; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--nuv.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--nuv.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!857 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!858 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!859 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!860 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !871}
!862 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!863 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!864 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!865 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!866 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!867 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880}
!874 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!875 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!876 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!877 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!878 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!879 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!880 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !888, line: 37, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!889 = !{!890, !891, !892, !893, !894, !895}
!890 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!891 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!892 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!893 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!894 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!895 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !898, file: !897, line: 166, size: 32, align: 32, elements: !1633)
!897 = !DIFile(filename: "libavcodec/nuv.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = distinct !DISubprogram(name: "decode_frame", scope: !897, file: !897, line: 154, type: !899, isLocal: true, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1632)
!899 = !DISubroutineType(types: !900)
!900 = !{!901, !902, !920, !1202, !1086}
!901 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64, align: 64)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !905)
!905 = !{!906, !951, !952, !953, !1230, !1231, !1232, !1233, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1386, !1390, !1391, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1570, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !904, file: !14, line: 1561, baseType: !907, size: 64, align: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64, align: 64)
!908 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !911)
!911 = !{!912, !916, !921, !925, !926, !927, !928, !932, !938, !940, !944}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !910, file: !691, line: 72, baseType: !913, size: 64, align: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64, align: 64)
!914 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !915)
!915 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !910, file: !691, line: 78, baseType: !917, size: 64, align: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!913, !920}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !910, file: !691, line: 85, baseType: !922, size: 64, align: 64, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !924)
!924 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !910, file: !691, line: 93, baseType: !901, size: 32, align: 32, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !910, file: !691, line: 99, baseType: !901, size: 32, align: 32, offset: 224)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !910, file: !691, line: 108, baseType: !901, size: 32, align: 32, offset: 256)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !910, file: !691, line: 113, baseType: !929, size: 64, align: 64, offset: 320)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!920, !920, !920}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !910, file: !691, line: 123, baseType: !933, size: 64, align: 64, offset: 384)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!936, !936}
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !910, file: !691, line: 130, baseType: !939, size: 32, align: 32, offset: 448)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !910, file: !691, line: 136, baseType: !941, size: 64, align: 64, offset: 512)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!939, !920}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !910, file: !691, line: 142, baseType: !945, size: 64, align: 64, offset: 576)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!901, !948, !920, !913, !901}
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !904, file: !14, line: 1562, baseType: !901, size: 32, align: 32, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !904, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !904, file: !14, line: 1565, baseType: !954, size: 64, align: 64, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !957)
!957 = !{!958, !959, !960, !961, !962, !963, !972, !975, !978, !981, !987, !990, !991, !999, !1000, !1001, !1003, !1007, !1013, !1024, !1028, !1029, !1082, !1203, !1205, !1206, !1210, !1214, !1219, !1223, !1224, !1225}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !956, file: !14, line: 3475, baseType: !913, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !956, file: !14, line: 3480, baseType: !913, size: 64, align: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !956, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !956, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !956, file: !14, line: 3487, baseType: !901, size: 32, align: 32, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !956, file: !14, line: 3488, baseType: !964, size: 64, align: 64, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !967, line: 61, baseType: !968)
!967 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !967, line: 58, size: 64, align: 32, elements: !969)
!969 = !{!970, !971}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !968, file: !967, line: 59, baseType: !901, size: 32, align: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !968, file: !967, line: 60, baseType: !901, size: 32, align: 32, offset: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !956, file: !14, line: 3489, baseType: !973, size: 64, align: 64, offset: 320)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !956, file: !14, line: 3490, baseType: !976, size: 64, align: 64, offset: 384)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !956, file: !14, line: 3491, baseType: !979, size: 64, align: 64, offset: 448)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !956, file: !14, line: 3492, baseType: !982, size: 64, align: 64, offset: 512)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !985, line: 55, baseType: !986)
!985 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!986 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !956, file: !14, line: 3493, baseType: !988, size: 8, align: 8, offset: 576)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !985, line: 48, baseType: !989)
!989 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !956, file: !14, line: 3494, baseType: !907, size: 64, align: 64, offset: 640)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !956, file: !14, line: 3495, baseType: !992, size: 64, align: 64, offset: 704)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !996)
!996 = !{!997, !998}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !995, file: !14, line: 3402, baseType: !901, size: 32, align: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !995, file: !14, line: 3403, baseType: !913, size: 64, align: 64, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !956, file: !14, line: 3507, baseType: !913, size: 64, align: 64, offset: 768)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !956, file: !14, line: 3516, baseType: !901, size: 32, align: 32, offset: 832)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !956, file: !14, line: 3517, baseType: !1002, size: 64, align: 64, offset: 896)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !956, file: !14, line: 3527, baseType: !1004, size: 64, align: 64, offset: 960)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!901, !902}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !956, file: !14, line: 3535, baseType: !1008, size: 64, align: 64, offset: 1024)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!901, !902, !1011}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !903)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !956, file: !14, line: 3541, baseType: !1014, size: 64, align: 64, offset: 1088)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1016)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1018, line: 223, size: 128, align: 64, elements: !1019)
!1018 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1019 = !{!1020, !1023}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1017, file: !1018, line: 224, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1017, file: !1018, line: 225, baseType: !1021, size: 64, align: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !956, file: !14, line: 3549, baseType: !1025, size: 64, align: 64, offset: 1152)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{null, !1002}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !956, file: !14, line: 3551, baseType: !1004, size: 64, align: 64, offset: 1216)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !956, file: !14, line: 3552, baseType: !1030, size: 64, align: 64, offset: 1280)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!901, !902, !1033, !901, !1034}
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1037)
!1037 = !{!1038, !1041, !1044, !1045, !1046, !1078}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1036, file: !14, line: 3921, baseType: !1039, size: 16, align: 16)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !985, line: 49, baseType: !1040)
!1040 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1036, file: !14, line: 3922, baseType: !1042, size: 32, align: 32, offset: 32)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !985, line: 51, baseType: !1043)
!1043 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1036, file: !14, line: 3923, baseType: !1042, size: 32, align: 32, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1036, file: !14, line: 3924, baseType: !1043, size: 32, align: 32, offset: 96)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1036, file: !14, line: 3925, baseType: !1047, size: 64, align: 64, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1051)
!1051 = !{!1052, !1053, !1054, !1055, !1056, !1057, !1067, !1071, !1073, !1074, !1076, !1077}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1050, file: !14, line: 3886, baseType: !901, size: 32, align: 32)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1050, file: !14, line: 3887, baseType: !901, size: 32, align: 32, offset: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1050, file: !14, line: 3888, baseType: !901, size: 32, align: 32, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1050, file: !14, line: 3889, baseType: !901, size: 32, align: 32, offset: 96)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1050, file: !14, line: 3890, baseType: !901, size: 32, align: 32, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1050, file: !14, line: 3897, baseType: !1058, size: 768, align: 64, offset: 192)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1060)
!1060 = !{!1061, !1065}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1059, file: !14, line: 3855, baseType: !1062, size: 512, align: 64)
!1062 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 512, align: 64, elements: !1063)
!1063 = !{!1064}
!1064 = !DISubrange(count: 8)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1059, file: !14, line: 3857, baseType: !1066, size: 256, align: 32, offset: 512)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 256, align: 32, elements: !1063)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1050, file: !14, line: 3903, baseType: !1068, size: 256, align: 64, offset: 960)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 256, align: 64, elements: !1069)
!1069 = !{!1070}
!1070 = !DISubrange(count: 4)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1050, file: !14, line: 3904, baseType: !1072, size: 128, align: 32, offset: 1216)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 128, align: 32, elements: !1069)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1050, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1050, file: !14, line: 3908, baseType: !1075, size: 64, align: 64, offset: 1408)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1050, file: !14, line: 3915, baseType: !1075, size: 64, align: 64, offset: 1472)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1050, file: !14, line: 3917, baseType: !901, size: 32, align: 32, offset: 1536)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1036, file: !14, line: 3926, baseType: !1079, size: 64, align: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1080, line: 197, baseType: !1081)
!1080 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1081 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !956, file: !14, line: 3564, baseType: !1083, size: 64, align: 64, offset: 1344)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!901, !902, !1086, !1120, !1202}
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1088)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1089)
!1089 = !{!1090, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1116, !1117, !1118, !1119}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1088, file: !14, line: 1451, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1093, line: 94, baseType: !1094)
!1093 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1093, line: 81, size: 192, align: 64, elements: !1095)
!1095 = !{!1096, !1100, !1101}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1094, file: !1093, line: 82, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1093, line: 73, baseType: !1099)
!1099 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1093, line: 73, flags: DIFlagFwdDecl)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1094, file: !1093, line: 89, baseType: !1033, size: 64, align: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1094, file: !1093, line: 93, baseType: !901, size: 32, align: 32, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1088, file: !14, line: 1461, baseType: !1079, size: 64, align: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1088, file: !14, line: 1467, baseType: !1079, size: 64, align: 64, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1088, file: !14, line: 1468, baseType: !1033, size: 64, align: 64, offset: 192)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1088, file: !14, line: 1469, baseType: !901, size: 32, align: 32, offset: 256)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1088, file: !14, line: 1470, baseType: !901, size: 32, align: 32, offset: 288)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1088, file: !14, line: 1474, baseType: !901, size: 32, align: 32, offset: 320)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1088, file: !14, line: 1479, baseType: !1109, size: 64, align: 64, offset: 384)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1112)
!1112 = !{!1113, !1114, !1115}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1111, file: !14, line: 1412, baseType: !1033, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1111, file: !14, line: 1413, baseType: !901, size: 32, align: 32, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1111, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1088, file: !14, line: 1480, baseType: !901, size: 32, align: 32, offset: 448)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1088, file: !14, line: 1486, baseType: !1079, size: 64, align: 64, offset: 512)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1088, file: !14, line: 1488, baseType: !1079, size: 64, align: 64, offset: 576)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1088, file: !14, line: 1497, baseType: !1079, size: 64, align: 64, offset: 640)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1122)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1123)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1124)
!1124 = !{!1125, !1126, !1127, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1154, !1156, !1157, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1190, !1191, !1192, !1193, !1194, !1195, !1198, !1199, !1200, !1201}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1123, file: !722, line: 282, baseType: !1062, size: 512, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1123, file: !722, line: 299, baseType: !1066, size: 256, align: 32, offset: 512)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1123, file: !722, line: 315, baseType: !1128, size: 64, align: 64, offset: 768)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1123, file: !722, line: 326, baseType: !901, size: 32, align: 32, offset: 832)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1123, file: !722, line: 326, baseType: !901, size: 32, align: 32, offset: 864)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1123, file: !722, line: 334, baseType: !901, size: 32, align: 32, offset: 896)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1123, file: !722, line: 341, baseType: !901, size: 32, align: 32, offset: 928)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1123, file: !722, line: 346, baseType: !901, size: 32, align: 32, offset: 960)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1123, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1123, file: !722, line: 356, baseType: !966, size: 64, align: 32, offset: 1024)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1123, file: !722, line: 361, baseType: !1079, size: 64, align: 64, offset: 1088)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1123, file: !722, line: 369, baseType: !1079, size: 64, align: 64, offset: 1152)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1123, file: !722, line: 377, baseType: !1079, size: 64, align: 64, offset: 1216)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1123, file: !722, line: 382, baseType: !901, size: 32, align: 32, offset: 1280)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1123, file: !722, line: 386, baseType: !901, size: 32, align: 32, offset: 1312)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1123, file: !722, line: 391, baseType: !901, size: 32, align: 32, offset: 1344)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1123, file: !722, line: 396, baseType: !920, size: 64, align: 64, offset: 1408)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1123, file: !722, line: 403, baseType: !1144, size: 512, align: 64, offset: 1472)
!1144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !984, size: 512, align: 64, elements: !1063)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1123, file: !722, line: 410, baseType: !901, size: 32, align: 32, offset: 1984)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1123, file: !722, line: 415, baseType: !901, size: 32, align: 32, offset: 2016)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1123, file: !722, line: 420, baseType: !901, size: 32, align: 32, offset: 2048)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1123, file: !722, line: 425, baseType: !901, size: 32, align: 32, offset: 2080)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1123, file: !722, line: 435, baseType: !1079, size: 64, align: 64, offset: 2112)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1123, file: !722, line: 440, baseType: !901, size: 32, align: 32, offset: 2176)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1123, file: !722, line: 445, baseType: !984, size: 64, align: 64, offset: 2240)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1123, file: !722, line: 459, baseType: !1153, size: 512, align: 64, offset: 2304)
!1153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1091, size: 512, align: 64, elements: !1063)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1123, file: !722, line: 473, baseType: !1155, size: 64, align: 64, offset: 2816)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1123, file: !722, line: 477, baseType: !901, size: 32, align: 32, offset: 2880)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1123, file: !722, line: 479, baseType: !1158, size: 64, align: 64, offset: 2944)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1162)
!1162 = !{!1163, !1164, !1165, !1166, !1171}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1161, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1161, file: !722, line: 203, baseType: !1033, size: 64, align: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1161, file: !722, line: 204, baseType: !901, size: 32, align: 32, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1161, file: !722, line: 205, baseType: !1167, size: 64, align: 64, offset: 192)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1169, line: 86, baseType: !1170)
!1169 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1170 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1169, line: 86, flags: DIFlagFwdDecl)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1161, file: !722, line: 206, baseType: !1091, size: 64, align: 64, offset: 256)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1123, file: !722, line: 480, baseType: !901, size: 32, align: 32, offset: 3008)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1123, file: !722, line: 505, baseType: !901, size: 32, align: 32, offset: 3040)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1123, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1123, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1123, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1123, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1123, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1123, file: !722, line: 532, baseType: !1079, size: 64, align: 64, offset: 3264)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1123, file: !722, line: 539, baseType: !1079, size: 64, align: 64, offset: 3328)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1123, file: !722, line: 547, baseType: !1079, size: 64, align: 64, offset: 3392)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1123, file: !722, line: 554, baseType: !1167, size: 64, align: 64, offset: 3456)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1123, file: !722, line: 563, baseType: !901, size: 32, align: 32, offset: 3520)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1123, file: !722, line: 572, baseType: !901, size: 32, align: 32, offset: 3552)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1123, file: !722, line: 581, baseType: !901, size: 32, align: 32, offset: 3584)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1123, file: !722, line: 588, baseType: !1187, size: 64, align: 64, offset: 3648)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1080, line: 194, baseType: !1189)
!1189 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1123, file: !722, line: 593, baseType: !901, size: 32, align: 32, offset: 3712)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1123, file: !722, line: 596, baseType: !901, size: 32, align: 32, offset: 3744)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1123, file: !722, line: 599, baseType: !1091, size: 64, align: 64, offset: 3776)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1123, file: !722, line: 605, baseType: !1091, size: 64, align: 64, offset: 3840)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1123, file: !722, line: 616, baseType: !1091, size: 64, align: 64, offset: 3904)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1123, file: !722, line: 626, baseType: !1196, size: 64, align: 64, offset: 3968)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1197, line: 216, baseType: !986)
!1197 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1123, file: !722, line: 627, baseType: !1196, size: 64, align: 64, offset: 4032)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1123, file: !722, line: 628, baseType: !1196, size: 64, align: 64, offset: 4096)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1123, file: !722, line: 629, baseType: !1196, size: 64, align: 64, offset: 4160)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1123, file: !722, line: 645, baseType: !1091, size: 64, align: 64, offset: 4224)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !956, file: !14, line: 3566, baseType: !1204, size: 64, align: 64, offset: 1408)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !956, file: !14, line: 3567, baseType: !1004, size: 64, align: 64, offset: 1472)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !956, file: !14, line: 3576, baseType: !1207, size: 64, align: 64, offset: 1536)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!901, !902, !1120}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !956, file: !14, line: 3577, baseType: !1211, size: 64, align: 64, offset: 1600)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!901, !902, !1086}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !956, file: !14, line: 3584, baseType: !1215, size: 64, align: 64, offset: 1664)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!901, !902, !1218}
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !956, file: !14, line: 3589, baseType: !1220, size: 64, align: 64, offset: 1728)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{null, !902}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !956, file: !14, line: 3594, baseType: !901, size: 32, align: 32, offset: 1792)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !956, file: !14, line: 3600, baseType: !913, size: 64, align: 64, offset: 1856)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !956, file: !14, line: 3609, baseType: !1226, size: 64, align: 64, offset: 1920)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1229)
!1229 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !904, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !904, file: !14, line: 1581, baseType: !1043, size: 32, align: 32, offset: 224)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !904, file: !14, line: 1583, baseType: !920, size: 64, align: 64, offset: 256)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !904, file: !14, line: 1591, baseType: !1234, size: 64, align: 64, offset: 320)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1018, line: 129, size: 1664, align: 64, elements: !1236)
!1236 = !{!1237, !1238, !1239, !1240, !1241, !1259, !1260, !1266, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1235, file: !1018, line: 136, baseType: !901, size: 32, align: 32)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1235, file: !1018, line: 151, baseType: !901, size: 32, align: 32, offset: 32)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1235, file: !1018, line: 157, baseType: !901, size: 32, align: 32, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1235, file: !1018, line: 159, baseType: !1218, size: 64, align: 64, offset: 128)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1235, file: !1018, line: 161, baseType: !1242, size: 64, align: 64, offset: 192)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1018, line: 117, baseType: !1244)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1018, line: 100, size: 832, align: 64, elements: !1245)
!1245 = !{!1246, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1244, file: !1018, line: 105, baseType: !1247, size: 256, align: 64)
!1247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1248, size: 256, align: 64, elements: !1069)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1093, line: 238, baseType: !1250)
!1250 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1093, line: 238, flags: DIFlagFwdDecl)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1244, file: !1018, line: 110, baseType: !901, size: 32, align: 32, offset: 256)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1244, file: !1018, line: 111, baseType: !901, size: 32, align: 32, offset: 288)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1244, file: !1018, line: 111, baseType: !901, size: 32, align: 32, offset: 320)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1244, file: !1018, line: 112, baseType: !1066, size: 256, align: 32, offset: 352)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1244, file: !1018, line: 113, baseType: !1072, size: 128, align: 32, offset: 608)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1244, file: !1018, line: 114, baseType: !901, size: 32, align: 32, offset: 736)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1244, file: !1018, line: 115, baseType: !901, size: 32, align: 32, offset: 768)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1244, file: !1018, line: 116, baseType: !901, size: 32, align: 32, offset: 800)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1235, file: !1018, line: 163, baseType: !920, size: 64, align: 64, offset: 256)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1235, file: !1018, line: 165, baseType: !1261, size: 128, align: 64, offset: 320)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1018, line: 122, baseType: !1262)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1018, line: 119, size: 128, align: 64, elements: !1263)
!1263 = !{!1264, !1265}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1262, file: !1018, line: 120, baseType: !1086, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1262, file: !1018, line: 121, baseType: !1218, size: 64, align: 64, offset: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1235, file: !1018, line: 166, baseType: !1267, size: 128, align: 64, offset: 448)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1018, line: 127, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1018, line: 124, size: 128, align: 64, elements: !1269)
!1269 = !{!1270, !1343}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1268, file: !1018, line: 125, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1275)
!1275 = !{!1276, !1277, !1301, !1305, !1306, !1340, !1341, !1342}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1274, file: !14, line: 5751, baseType: !907, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1274, file: !14, line: 5756, baseType: !1278, size: 64, align: 64, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1280)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1281)
!1281 = !{!1282, !1283, !1286, !1287, !1288, !1292, !1296, !1300}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1280, file: !14, line: 5797, baseType: !913, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1280, file: !14, line: 5804, baseType: !1284, size: 64, align: 64, offset: 64)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1280, file: !14, line: 5815, baseType: !907, size: 64, align: 64, offset: 128)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1280, file: !14, line: 5825, baseType: !901, size: 32, align: 32, offset: 192)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1280, file: !14, line: 5826, baseType: !1289, size: 64, align: 64, offset: 256)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!901, !1272}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1280, file: !14, line: 5827, baseType: !1293, size: 64, align: 64, offset: 320)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!901, !1272, !1086}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1280, file: !14, line: 5828, baseType: !1297, size: 64, align: 64, offset: 384)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{null, !1272}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1280, file: !14, line: 5829, baseType: !1297, size: 64, align: 64, offset: 448)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1274, file: !14, line: 5762, baseType: !1302, size: 64, align: 64, offset: 128)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1304)
!1304 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1274, file: !14, line: 5768, baseType: !920, size: 64, align: 64, offset: 192)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1274, file: !14, line: 5775, baseType: !1307, size: 64, align: 64, offset: 256)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1309)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1310)
!1310 = !{!1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1309, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1309, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1309, file: !14, line: 3948, baseType: !1042, size: 32, align: 32, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1309, file: !14, line: 3958, baseType: !1033, size: 64, align: 64, offset: 128)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1309, file: !14, line: 3962, baseType: !901, size: 32, align: 32, offset: 192)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1309, file: !14, line: 3968, baseType: !901, size: 32, align: 32, offset: 224)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1309, file: !14, line: 3973, baseType: !1079, size: 64, align: 64, offset: 256)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1309, file: !14, line: 3986, baseType: !901, size: 32, align: 32, offset: 320)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1309, file: !14, line: 3999, baseType: !901, size: 32, align: 32, offset: 352)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1309, file: !14, line: 4004, baseType: !901, size: 32, align: 32, offset: 384)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1309, file: !14, line: 4005, baseType: !901, size: 32, align: 32, offset: 416)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1309, file: !14, line: 4010, baseType: !901, size: 32, align: 32, offset: 448)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1309, file: !14, line: 4011, baseType: !901, size: 32, align: 32, offset: 480)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1309, file: !14, line: 4020, baseType: !966, size: 64, align: 32, offset: 512)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1309, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1309, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1309, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1309, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1309, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1309, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1309, file: !14, line: 4039, baseType: !901, size: 32, align: 32, offset: 768)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1309, file: !14, line: 4046, baseType: !984, size: 64, align: 64, offset: 832)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1309, file: !14, line: 4050, baseType: !901, size: 32, align: 32, offset: 896)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1309, file: !14, line: 4054, baseType: !901, size: 32, align: 32, offset: 928)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1309, file: !14, line: 4061, baseType: !901, size: 32, align: 32, offset: 960)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1309, file: !14, line: 4065, baseType: !901, size: 32, align: 32, offset: 992)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1309, file: !14, line: 4073, baseType: !901, size: 32, align: 32, offset: 1024)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1309, file: !14, line: 4080, baseType: !901, size: 32, align: 32, offset: 1056)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1309, file: !14, line: 4084, baseType: !901, size: 32, align: 32, offset: 1088)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1274, file: !14, line: 5781, baseType: !1307, size: 64, align: 64, offset: 320)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1274, file: !14, line: 5787, baseType: !966, size: 64, align: 32, offset: 384)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1274, file: !14, line: 5793, baseType: !966, size: 64, align: 32, offset: 448)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1268, file: !1018, line: 126, baseType: !901, size: 32, align: 32, offset: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1235, file: !1018, line: 172, baseType: !1086, size: 64, align: 64, offset: 576)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1235, file: !1018, line: 177, baseType: !1033, size: 64, align: 64, offset: 640)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1235, file: !1018, line: 178, baseType: !1043, size: 32, align: 32, offset: 704)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1235, file: !1018, line: 180, baseType: !920, size: 64, align: 64, offset: 768)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1235, file: !1018, line: 185, baseType: !901, size: 32, align: 32, offset: 832)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1235, file: !1018, line: 190, baseType: !920, size: 64, align: 64, offset: 896)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1235, file: !1018, line: 195, baseType: !901, size: 32, align: 32, offset: 960)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1235, file: !1018, line: 200, baseType: !1086, size: 64, align: 64, offset: 1024)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1235, file: !1018, line: 201, baseType: !901, size: 32, align: 32, offset: 1088)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1235, file: !1018, line: 202, baseType: !1218, size: 64, align: 64, offset: 1152)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1235, file: !1018, line: 203, baseType: !901, size: 32, align: 32, offset: 1216)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1235, file: !1018, line: 205, baseType: !901, size: 32, align: 32, offset: 1248)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1235, file: !1018, line: 206, baseType: !901, size: 32, align: 32, offset: 1280)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1235, file: !1018, line: 209, baseType: !1196, size: 64, align: 64, offset: 1344)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1235, file: !1018, line: 212, baseType: !1196, size: 64, align: 64, offset: 1408)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1235, file: !1018, line: 213, baseType: !1218, size: 64, align: 64, offset: 1472)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1235, file: !1018, line: 215, baseType: !901, size: 32, align: 32, offset: 1536)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1235, file: !1018, line: 217, baseType: !901, size: 32, align: 32, offset: 1568)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1235, file: !1018, line: 220, baseType: !901, size: 32, align: 32, offset: 1600)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !904, file: !14, line: 1598, baseType: !920, size: 64, align: 64, offset: 384)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !904, file: !14, line: 1606, baseType: !1079, size: 64, align: 64, offset: 448)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !904, file: !14, line: 1614, baseType: !901, size: 32, align: 32, offset: 512)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !904, file: !14, line: 1622, baseType: !901, size: 32, align: 32, offset: 544)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !904, file: !14, line: 1628, baseType: !901, size: 32, align: 32, offset: 576)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !904, file: !14, line: 1636, baseType: !901, size: 32, align: 32, offset: 608)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !904, file: !14, line: 1643, baseType: !901, size: 32, align: 32, offset: 640)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !904, file: !14, line: 1657, baseType: !1033, size: 64, align: 64, offset: 704)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !904, file: !14, line: 1658, baseType: !901, size: 32, align: 32, offset: 768)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !904, file: !14, line: 1679, baseType: !966, size: 64, align: 32, offset: 800)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !904, file: !14, line: 1688, baseType: !901, size: 32, align: 32, offset: 864)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !904, file: !14, line: 1712, baseType: !901, size: 32, align: 32, offset: 896)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !904, file: !14, line: 1729, baseType: !901, size: 32, align: 32, offset: 928)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !904, file: !14, line: 1729, baseType: !901, size: 32, align: 32, offset: 960)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !904, file: !14, line: 1744, baseType: !901, size: 32, align: 32, offset: 992)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !904, file: !14, line: 1744, baseType: !901, size: 32, align: 32, offset: 1024)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !904, file: !14, line: 1751, baseType: !901, size: 32, align: 32, offset: 1056)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !904, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !904, file: !14, line: 1791, baseType: !1382, size: 64, align: 64, offset: 1152)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DISubroutineType(types: !1384)
!1384 = !{null, !1385, !1120, !1202, !901, !901, !901}
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !904, file: !14, line: 1808, baseType: !1387, size: 64, align: 64, offset: 1216)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DISubroutineType(types: !1389)
!1389 = !{!473, !1385, !973}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !904, file: !14, line: 1816, baseType: !901, size: 32, align: 32, offset: 1280)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !904, file: !14, line: 1825, baseType: !1392, size: 32, align: 32, offset: 1312)
!1392 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !904, file: !14, line: 1830, baseType: !901, size: 32, align: 32, offset: 1344)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !904, file: !14, line: 1838, baseType: !1392, size: 32, align: 32, offset: 1376)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !904, file: !14, line: 1846, baseType: !901, size: 32, align: 32, offset: 1408)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !904, file: !14, line: 1851, baseType: !901, size: 32, align: 32, offset: 1440)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !904, file: !14, line: 1861, baseType: !1392, size: 32, align: 32, offset: 1472)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !904, file: !14, line: 1868, baseType: !1392, size: 32, align: 32, offset: 1504)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !904, file: !14, line: 1875, baseType: !1392, size: 32, align: 32, offset: 1536)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !904, file: !14, line: 1882, baseType: !1392, size: 32, align: 32, offset: 1568)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !904, file: !14, line: 1889, baseType: !1392, size: 32, align: 32, offset: 1600)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !904, file: !14, line: 1896, baseType: !1392, size: 32, align: 32, offset: 1632)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !904, file: !14, line: 1903, baseType: !1392, size: 32, align: 32, offset: 1664)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !904, file: !14, line: 1910, baseType: !901, size: 32, align: 32, offset: 1696)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !904, file: !14, line: 1915, baseType: !901, size: 32, align: 32, offset: 1728)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !904, file: !14, line: 1926, baseType: !1202, size: 64, align: 64, offset: 1792)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !904, file: !14, line: 1935, baseType: !966, size: 64, align: 32, offset: 1856)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !904, file: !14, line: 1942, baseType: !901, size: 32, align: 32, offset: 1920)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !904, file: !14, line: 1948, baseType: !901, size: 32, align: 32, offset: 1952)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !904, file: !14, line: 1954, baseType: !901, size: 32, align: 32, offset: 1984)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !904, file: !14, line: 1960, baseType: !901, size: 32, align: 32, offset: 2016)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !904, file: !14, line: 1984, baseType: !901, size: 32, align: 32, offset: 2048)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !904, file: !14, line: 1991, baseType: !901, size: 32, align: 32, offset: 2080)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !904, file: !14, line: 1996, baseType: !901, size: 32, align: 32, offset: 2112)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !904, file: !14, line: 2004, baseType: !901, size: 32, align: 32, offset: 2144)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !904, file: !14, line: 2011, baseType: !901, size: 32, align: 32, offset: 2176)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !904, file: !14, line: 2018, baseType: !901, size: 32, align: 32, offset: 2208)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !904, file: !14, line: 2027, baseType: !901, size: 32, align: 32, offset: 2240)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !904, file: !14, line: 2034, baseType: !901, size: 32, align: 32, offset: 2272)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !904, file: !14, line: 2044, baseType: !901, size: 32, align: 32, offset: 2304)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !904, file: !14, line: 2054, baseType: !1422, size: 64, align: 64, offset: 2368)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !904, file: !14, line: 2061, baseType: !1422, size: 64, align: 64, offset: 2432)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !904, file: !14, line: 2066, baseType: !901, size: 32, align: 32, offset: 2496)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !904, file: !14, line: 2070, baseType: !901, size: 32, align: 32, offset: 2528)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !904, file: !14, line: 2078, baseType: !901, size: 32, align: 32, offset: 2560)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !904, file: !14, line: 2085, baseType: !901, size: 32, align: 32, offset: 2592)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !904, file: !14, line: 2092, baseType: !901, size: 32, align: 32, offset: 2624)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !904, file: !14, line: 2099, baseType: !901, size: 32, align: 32, offset: 2656)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !904, file: !14, line: 2106, baseType: !901, size: 32, align: 32, offset: 2688)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !904, file: !14, line: 2113, baseType: !901, size: 32, align: 32, offset: 2720)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !904, file: !14, line: 2120, baseType: !901, size: 32, align: 32, offset: 2752)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !904, file: !14, line: 2125, baseType: !901, size: 32, align: 32, offset: 2784)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !904, file: !14, line: 2133, baseType: !901, size: 32, align: 32, offset: 2816)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !904, file: !14, line: 2140, baseType: !901, size: 32, align: 32, offset: 2848)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !904, file: !14, line: 2145, baseType: !901, size: 32, align: 32, offset: 2880)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !904, file: !14, line: 2153, baseType: !901, size: 32, align: 32, offset: 2912)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !904, file: !14, line: 2158, baseType: !901, size: 32, align: 32, offset: 2944)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !904, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !904, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !904, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !904, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !904, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !904, file: !14, line: 2203, baseType: !901, size: 32, align: 32, offset: 3136)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !904, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !904, file: !14, line: 2212, baseType: !901, size: 32, align: 32, offset: 3200)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !904, file: !14, line: 2213, baseType: !901, size: 32, align: 32, offset: 3232)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !904, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !904, file: !14, line: 2232, baseType: !901, size: 32, align: 32, offset: 3296)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !904, file: !14, line: 2243, baseType: !901, size: 32, align: 32, offset: 3328)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !904, file: !14, line: 2249, baseType: !901, size: 32, align: 32, offset: 3360)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !904, file: !14, line: 2256, baseType: !901, size: 32, align: 32, offset: 3392)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !904, file: !14, line: 2263, baseType: !984, size: 64, align: 64, offset: 3456)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !904, file: !14, line: 2270, baseType: !984, size: 64, align: 64, offset: 3520)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !904, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !904, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !904, file: !14, line: 2367, baseType: !1458, size: 64, align: 64, offset: 3648)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DISubroutineType(types: !1460)
!1460 = !{!901, !1385, !1218, !901}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !904, file: !14, line: 2383, baseType: !901, size: 32, align: 32, offset: 3712)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !904, file: !14, line: 2386, baseType: !1392, size: 32, align: 32, offset: 3744)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !904, file: !14, line: 2387, baseType: !1392, size: 32, align: 32, offset: 3776)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !904, file: !14, line: 2394, baseType: !901, size: 32, align: 32, offset: 3808)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !904, file: !14, line: 2401, baseType: !901, size: 32, align: 32, offset: 3840)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !904, file: !14, line: 2408, baseType: !901, size: 32, align: 32, offset: 3872)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !904, file: !14, line: 2415, baseType: !901, size: 32, align: 32, offset: 3904)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !904, file: !14, line: 2422, baseType: !901, size: 32, align: 32, offset: 3936)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !904, file: !14, line: 2423, baseType: !1470, size: 64, align: 64, offset: 3968)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1472)
!1472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1473)
!1473 = !{!1474, !1475, !1476, !1477}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1472, file: !14, line: 827, baseType: !901, size: 32, align: 32)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1472, file: !14, line: 828, baseType: !901, size: 32, align: 32, offset: 32)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1472, file: !14, line: 829, baseType: !901, size: 32, align: 32, offset: 64)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1472, file: !14, line: 830, baseType: !1392, size: 32, align: 32, offset: 96)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !904, file: !14, line: 2430, baseType: !1079, size: 64, align: 64, offset: 4032)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !904, file: !14, line: 2437, baseType: !1079, size: 64, align: 64, offset: 4096)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !904, file: !14, line: 2444, baseType: !1392, size: 32, align: 32, offset: 4160)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !904, file: !14, line: 2451, baseType: !1392, size: 32, align: 32, offset: 4192)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !904, file: !14, line: 2458, baseType: !901, size: 32, align: 32, offset: 4224)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !904, file: !14, line: 2469, baseType: !901, size: 32, align: 32, offset: 4256)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !904, file: !14, line: 2475, baseType: !901, size: 32, align: 32, offset: 4288)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !904, file: !14, line: 2481, baseType: !901, size: 32, align: 32, offset: 4320)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !904, file: !14, line: 2485, baseType: !901, size: 32, align: 32, offset: 4352)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !904, file: !14, line: 2489, baseType: !901, size: 32, align: 32, offset: 4384)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !904, file: !14, line: 2493, baseType: !901, size: 32, align: 32, offset: 4416)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !904, file: !14, line: 2501, baseType: !901, size: 32, align: 32, offset: 4448)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !904, file: !14, line: 2506, baseType: !901, size: 32, align: 32, offset: 4480)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !904, file: !14, line: 2510, baseType: !901, size: 32, align: 32, offset: 4512)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !904, file: !14, line: 2514, baseType: !1079, size: 64, align: 64, offset: 4544)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !904, file: !14, line: 2528, baseType: !1494, size: 64, align: 64, offset: 4608)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DISubroutineType(types: !1496)
!1496 = !{null, !1385, !920, !901, !901}
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !904, file: !14, line: 2534, baseType: !901, size: 32, align: 32, offset: 4672)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !904, file: !14, line: 2545, baseType: !901, size: 32, align: 32, offset: 4704)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !904, file: !14, line: 2547, baseType: !901, size: 32, align: 32, offset: 4736)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !904, file: !14, line: 2549, baseType: !901, size: 32, align: 32, offset: 4768)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !904, file: !14, line: 2551, baseType: !901, size: 32, align: 32, offset: 4800)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !904, file: !14, line: 2553, baseType: !901, size: 32, align: 32, offset: 4832)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !904, file: !14, line: 2555, baseType: !901, size: 32, align: 32, offset: 4864)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !904, file: !14, line: 2557, baseType: !901, size: 32, align: 32, offset: 4896)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !904, file: !14, line: 2559, baseType: !901, size: 32, align: 32, offset: 4928)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !904, file: !14, line: 2563, baseType: !901, size: 32, align: 32, offset: 4960)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !904, file: !14, line: 2571, baseType: !1075, size: 64, align: 64, offset: 4992)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !904, file: !14, line: 2579, baseType: !1075, size: 64, align: 64, offset: 5056)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !904, file: !14, line: 2586, baseType: !901, size: 32, align: 32, offset: 5120)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !904, file: !14, line: 2615, baseType: !901, size: 32, align: 32, offset: 5152)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !904, file: !14, line: 2627, baseType: !901, size: 32, align: 32, offset: 5184)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !904, file: !14, line: 2637, baseType: !901, size: 32, align: 32, offset: 5216)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !904, file: !14, line: 2681, baseType: !901, size: 32, align: 32, offset: 5248)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !904, file: !14, line: 2709, baseType: !1079, size: 64, align: 64, offset: 5312)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !904, file: !14, line: 2716, baseType: !1516, size: 64, align: 64, offset: 5376)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1518)
!1518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1519)
!1519 = !{!1520, !1521, !1522, !1523, !1524, !1525, !1526, !1530, !1534, !1535, !1536, !1537, !1543, !1544, !1545, !1546, !1547}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1518, file: !14, line: 3642, baseType: !913, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1518, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1518, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1518, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1518, file: !14, line: 3669, baseType: !901, size: 32, align: 32, offset: 160)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1518, file: !14, line: 3682, baseType: !1215, size: 64, align: 64, offset: 192)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1518, file: !14, line: 3698, baseType: !1527, size: 64, align: 64, offset: 256)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64, align: 64)
!1528 = !DISubroutineType(types: !1529)
!1529 = !{!901, !902, !1021, !1042}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1518, file: !14, line: 3712, baseType: !1531, size: 64, align: 64, offset: 320)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DISubroutineType(types: !1533)
!1533 = !{!901, !902, !901, !1021, !1042}
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1518, file: !14, line: 3726, baseType: !1527, size: 64, align: 64, offset: 384)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1518, file: !14, line: 3737, baseType: !1004, size: 64, align: 64, offset: 448)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1518, file: !14, line: 3746, baseType: !901, size: 32, align: 32, offset: 512)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1518, file: !14, line: 3757, baseType: !1538, size: 64, align: 64, offset: 576)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DISubroutineType(types: !1540)
!1540 = !{null, !1541}
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1518, file: !14, line: 3766, baseType: !1004, size: 64, align: 64, offset: 640)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1518, file: !14, line: 3774, baseType: !1004, size: 64, align: 64, offset: 704)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1518, file: !14, line: 3780, baseType: !901, size: 32, align: 32, offset: 768)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1518, file: !14, line: 3785, baseType: !901, size: 32, align: 32, offset: 800)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1518, file: !14, line: 3795, baseType: !1548, size: 64, align: 64, offset: 832)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DISubroutineType(types: !1550)
!1550 = !{!901, !902, !1091}
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !904, file: !14, line: 2728, baseType: !920, size: 64, align: 64, offset: 5440)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !904, file: !14, line: 2735, baseType: !1144, size: 512, align: 64, offset: 5504)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !904, file: !14, line: 2742, baseType: !901, size: 32, align: 32, offset: 6016)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !904, file: !14, line: 2755, baseType: !901, size: 32, align: 32, offset: 6048)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !904, file: !14, line: 2776, baseType: !901, size: 32, align: 32, offset: 6080)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !904, file: !14, line: 2783, baseType: !901, size: 32, align: 32, offset: 6112)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !904, file: !14, line: 2791, baseType: !901, size: 32, align: 32, offset: 6144)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !904, file: !14, line: 2802, baseType: !1218, size: 64, align: 64, offset: 6208)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !904, file: !14, line: 2811, baseType: !901, size: 32, align: 32, offset: 6272)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !904, file: !14, line: 2821, baseType: !901, size: 32, align: 32, offset: 6304)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !904, file: !14, line: 2830, baseType: !901, size: 32, align: 32, offset: 6336)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !904, file: !14, line: 2840, baseType: !901, size: 32, align: 32, offset: 6368)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !904, file: !14, line: 2851, baseType: !1564, size: 64, align: 64, offset: 6400)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DISubroutineType(types: !1566)
!1566 = !{!901, !1385, !1567, !920, !1202, !901, !901}
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DISubroutineType(types: !1569)
!1569 = !{!901, !1385, !920}
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !904, file: !14, line: 2871, baseType: !1571, size: 64, align: 64, offset: 6464)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DISubroutineType(types: !1573)
!1573 = !{!901, !1385, !1574, !920, !1202, !901}
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DISubroutineType(types: !1576)
!1576 = !{!901, !1385, !920, !901, !901}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !904, file: !14, line: 2878, baseType: !901, size: 32, align: 32, offset: 6528)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !904, file: !14, line: 2885, baseType: !901, size: 32, align: 32, offset: 6560)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !904, file: !14, line: 3005, baseType: !901, size: 32, align: 32, offset: 6592)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !904, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !904, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !904, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !904, file: !14, line: 3037, baseType: !1033, size: 64, align: 64, offset: 6720)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !904, file: !14, line: 3038, baseType: !901, size: 32, align: 32, offset: 6784)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !904, file: !14, line: 3050, baseType: !984, size: 64, align: 64, offset: 6848)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !904, file: !14, line: 3065, baseType: !901, size: 32, align: 32, offset: 6912)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !904, file: !14, line: 3083, baseType: !901, size: 32, align: 32, offset: 6944)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !904, file: !14, line: 3092, baseType: !966, size: 64, align: 32, offset: 6976)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !904, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !904, file: !14, line: 3106, baseType: !966, size: 64, align: 32, offset: 7072)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !904, file: !14, line: 3113, baseType: !1592, size: 64, align: 64, offset: 7168)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1594)
!1594 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1595)
!1595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1596)
!1596 = !{!1597, !1598, !1599, !1600, !1601, !1602, !1605}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1595, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1595, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1595, file: !14, line: 720, baseType: !913, size: 64, align: 64, offset: 64)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1595, file: !14, line: 724, baseType: !913, size: 64, align: 64, offset: 128)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1595, file: !14, line: 728, baseType: !901, size: 32, align: 32, offset: 192)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1595, file: !14, line: 734, baseType: !1603, size: 64, align: 64, offset: 256)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !913)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1595, file: !14, line: 739, baseType: !1606, size: 64, align: 64, offset: 320)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !904, file: !14, line: 3129, baseType: !1079, size: 64, align: 64, offset: 7232)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !904, file: !14, line: 3130, baseType: !1079, size: 64, align: 64, offset: 7296)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !904, file: !14, line: 3131, baseType: !1079, size: 64, align: 64, offset: 7360)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !904, file: !14, line: 3132, baseType: !1079, size: 64, align: 64, offset: 7424)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !904, file: !14, line: 3139, baseType: !1075, size: 64, align: 64, offset: 7488)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !904, file: !14, line: 3147, baseType: !901, size: 32, align: 32, offset: 7552)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !904, file: !14, line: 3165, baseType: !901, size: 32, align: 32, offset: 7584)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !904, file: !14, line: 3172, baseType: !901, size: 32, align: 32, offset: 7616)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !904, file: !14, line: 3180, baseType: !901, size: 32, align: 32, offset: 7648)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !904, file: !14, line: 3191, baseType: !1422, size: 64, align: 64, offset: 7680)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !904, file: !14, line: 3199, baseType: !1033, size: 64, align: 64, offset: 7744)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !904, file: !14, line: 3207, baseType: !1075, size: 64, align: 64, offset: 7808)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !904, file: !14, line: 3214, baseType: !1043, size: 32, align: 32, offset: 7872)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !904, file: !14, line: 3224, baseType: !1109, size: 64, align: 64, offset: 7936)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !904, file: !14, line: 3225, baseType: !901, size: 32, align: 32, offset: 8000)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !904, file: !14, line: 3249, baseType: !1091, size: 64, align: 64, offset: 8064)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !904, file: !14, line: 3256, baseType: !901, size: 32, align: 32, offset: 8128)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !904, file: !14, line: 3271, baseType: !901, size: 32, align: 32, offset: 8160)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !904, file: !14, line: 3279, baseType: !1079, size: 64, align: 64, offset: 8192)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !904, file: !14, line: 3301, baseType: !1091, size: 64, align: 64, offset: 8256)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !904, file: !14, line: 3310, baseType: !901, size: 32, align: 32, offset: 8320)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !904, file: !14, line: 3337, baseType: !901, size: 32, align: 32, offset: 8352)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !904, file: !14, line: 3351, baseType: !901, size: 32, align: 32, offset: 8384)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !904, file: !14, line: 3359, baseType: !901, size: 32, align: 32, offset: 8416)
!1632 = !{}
!1633 = !{!1634, !1635, !1636, !1637, !1638, !1639}
!1634 = !DIEnumerator(name: "NUV_UNCOMPRESSED", value: 48)
!1635 = !DIEnumerator(name: "NUV_RTJPEG", value: 49)
!1636 = !DIEnumerator(name: "NUV_RTJPEG_IN_LZO", value: 50)
!1637 = !DIEnumerator(name: "NUV_LZO", value: 51)
!1638 = !DIEnumerator(name: "NUV_BLACK", value: 78)
!1639 = !DIEnumerator(name: "NUV_COPY_LAST", value: 76)
!1640 = !{!1043, !901, !1641, !1647, !1652}
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1643)
!1643 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1644, line: 221, size: 32, align: 8, elements: !1645)
!1644 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1645 = !{!1646}
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1643, file: !1644, line: 221, baseType: !1042, size: 32, align: 32)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1649)
!1649 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !1644, line: 222, size: 16, align: 8, elements: !1650)
!1650 = !{!1651}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1649, file: !1644, line: 222, baseType: !1039, size: 16, align: 16)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1653 = !{!1654, !1656, !1660}
!1654 = distinct !DIGlobalVariable(name: "ff_nuv_decoder", scope: !0, file: !897, line: 358, type: !1655, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_nuv_decoder)
!1655 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !956)
!1656 = distinct !DIGlobalVariable(name: "fallback_lquant", scope: !0, file: !897, line: 47, type: !1657, isLocal: true, isDefinition: true, variable: [64 x i8]* @fallback_lquant)
!1657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1022, size: 512, align: 8, elements: !1658)
!1658 = !{!1659}
!1659 = !DISubrange(count: 64)
!1660 = distinct !DIGlobalVariable(name: "fallback_cquant", scope: !0, file: !897, line: 58, type: !1657, isLocal: true, isDefinition: true, variable: [64 x i8]* @fallback_cquant)
!1661 = !{i32 2, !"Dwarf Version", i32 4}
!1662 = !{i32 2, !"Debug Info Version", i32 3}
!1663 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1664 = distinct !DISubprogram(name: "decode_init", scope: !897, file: !897, line: 320, type: !1005, isLocal: true, isDefinition: true, scopeLine: 321, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1632)
!1665 = !DILocalVariable(name: "avctx", arg: 1, scope: !1664, file: !897, line: 320, type: !902)
!1666 = !DIExpression()
!1667 = !DILocation(line: 320, column: 62, scope: !1664)
!1668 = !DILocalVariable(name: "c", scope: !1664, file: !897, line: 322, type: !1669)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
