; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--segment.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--segment.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 56, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "libavformat/segment.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!940 = !{!941, !942, !943, !944, !945, !946, !947}
!941 = !DIEnumerator(name: "LIST_TYPE_UNDEFINED", value: -1)
!942 = !DIEnumerator(name: "LIST_TYPE_FLAT", value: 0)
!943 = !DIEnumerator(name: "LIST_TYPE_CSV", value: 1)
!944 = !DIEnumerator(name: "LIST_TYPE_M3U8", value: 2)
!945 = !DIEnumerator(name: "LIST_TYPE_EXT", value: 3)
!946 = !DIEnumerator(name: "LIST_TYPE_FFCONCAT", value: 4)
!947 = !DIEnumerator(name: "LIST_TYPE_NB", value: 5)
!948 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVEscapeMode", file: !949, line: 313, size: 32, align: 32, elements: !950)
!949 = !DIFile(filename: "./libavutil/avstring.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!950 = !{!951, !952, !953}
!951 = !DIEnumerator(name: "AV_ESCAPE_MODE_AUTO", value: 0)
!952 = !DIEnumerator(name: "AV_ESCAPE_MODE_BACKSLASH", value: 1)
!953 = !DIEnumerator(name: "AV_ESCAPE_MODE_QUOTE", value: 2)
!954 = !{!955, !958, !959, !960, !961, !962}
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !956, line: 40, baseType: !957)
!956 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!957 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!958 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!959 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!961 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!962 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!963 = !{!964, !2205, !2206, !2207, !2213, !2222}
!964 = distinct !DIGlobalVariable(name: "ff_segment_muxer", scope: !0, file: !939, line: 1075, type: !965, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_segment_muxer)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !967)
!967 = !{!968, !972, !973, !974, !975, !976, !977, !978, !979, !989, !1067, !1069, !1070, !2170, !2171, !2172, !2176, !2180, !2184, !2185, !2190, !2191, !2192, !2193, !2194, !2195, !2199}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !966, file: !919, line: 498, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!971 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !966, file: !919, line: 504, baseType: !969, size: 64, align: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !966, file: !919, line: 505, baseType: !969, size: 64, align: 64, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !966, file: !919, line: 506, baseType: !969, size: 64, align: 64, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !966, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !966, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !966, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !966, file: !919, line: 517, baseType: !959, size: 32, align: 32, offset: 352)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !966, file: !919, line: 523, baseType: !980, size: 64, align: 64, offset: 384)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !985, line: 44, size: 64, align: 32, elements: !986)
!985 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!986 = !{!987, !988}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !984, file: !985, line: 45, baseType: !3, size: 32, align: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !984, file: !985, line: 46, baseType: !961, size: 32, align: 32, offset: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !966, file: !919, line: 526, baseType: !990, size: 64, align: 64, offset: 448)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !994)
!994 = !{!995, !996, !1000, !1026, !1027, !1028, !1029, !1033, !1039, !1041, !1045}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !993, file: !486, line: 72, baseType: !969, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !993, file: !486, line: 78, baseType: !997, size: 64, align: 64, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!969, !960}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !993, file: !486, line: 85, baseType: !1001, size: 64, align: 64, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1022, !1023, !1024, !1025}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1003, file: !464, line: 247, baseType: !969, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1003, file: !464, line: 253, baseType: !969, size: 64, align: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1003, file: !464, line: 259, baseType: !959, size: 32, align: 32, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1003, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1003, file: !464, line: 271, baseType: !1010, size: 64, align: 64, offset: 192)
!1010 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1003, file: !464, line: 265, size: 64, align: 64, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1010, file: !464, line: 266, baseType: !955, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1010, file: !464, line: 267, baseType: !958, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1010, file: !464, line: 268, baseType: !969, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1010, file: !464, line: 270, baseType: !1016, size: 64, align: 32)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1017, line: 61, baseType: !1018)
!1017 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1017, line: 58, size: 64, align: 32, elements: !1019)
!1019 = !{!1020, !1021}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1018, file: !1017, line: 59, baseType: !959, size: 32, align: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1018, file: !1017, line: 60, baseType: !959, size: 32, align: 32, offset: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1003, file: !464, line: 272, baseType: !958, size: 64, align: 64, offset: 256)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1003, file: !464, line: 273, baseType: !958, size: 64, align: 64, offset: 320)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1003, file: !464, line: 275, baseType: !959, size: 32, align: 32, offset: 384)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1003, file: !464, line: 300, baseType: !969, size: 64, align: 64, offset: 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !993, file: !486, line: 93, baseType: !959, size: 32, align: 32, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !993, file: !486, line: 99, baseType: !959, size: 32, align: 32, offset: 224)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !993, file: !486, line: 108, baseType: !959, size: 32, align: 32, offset: 256)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !993, file: !486, line: 113, baseType: !1030, size: 64, align: 64, offset: 320)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!960, !960, !960}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !993, file: !486, line: 123, baseType: !1034, size: 64, align: 64, offset: 384)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!1037, !1037}
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !993, file: !486, line: 130, baseType: !1040, size: 32, align: 32, offset: 448)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !993, file: !486, line: 136, baseType: !1042, size: 64, align: 64, offset: 512)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!1040, !960}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !993, file: !486, line: 142, baseType: !1046, size: 64, align: 64, offset: 576)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!959, !1049, !960, !969, !959}
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1052)
!1052 = !{!1053, !1065, !1066}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1051, file: !464, line: 360, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1058)
!1058 = !{!1059, !1060, !1061, !1062, !1063, !1064}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1057, file: !464, line: 307, baseType: !969, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1057, file: !464, line: 313, baseType: !958, size: 64, align: 64, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1057, file: !464, line: 313, baseType: !958, size: 64, align: 64, offset: 128)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1057, file: !464, line: 318, baseType: !958, size: 64, align: 64, offset: 192)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1057, file: !464, line: 318, baseType: !958, size: 64, align: 64, offset: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1057, file: !464, line: 323, baseType: !959, size: 32, align: 32, offset: 320)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1051, file: !464, line: 364, baseType: !959, size: 32, align: 32, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1051, file: !464, line: 368, baseType: !959, size: 32, align: 32, offset: 96)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !966, file: !919, line: 535, baseType: !1068, size: 64, align: 64, offset: 512)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !966, file: !919, line: 539, baseType: !959, size: 32, align: 32, offset: 576)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !966, file: !919, line: 541, baseType: !1071, size: 64, align: 64, offset: 640)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!959, !1074}
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1076)
!1076 = !{!1077, !1078, !1176, !1177, !1178, !1244, !1245, !1246, !2024, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2078, !2079, !2080, !2081, !2082, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2133, !2134, !2137, !2138, !2139, !2140, !2141, !2142, !2147, !2148, !2149, !2150, !2158, !2159, !2163, !2167, !2168, !2169}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1075, file: !919, line: 1342, baseType: !990, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1075, file: !919, line: 1349, baseType: !1079, size: 64, align: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1081)
!1081 = !{!1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1106, !1107, !1147, !1148, !1152, !1157, !1158, !1159, !1163, !1169, !1175}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1080, file: !919, line: 638, baseType: !969, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1080, file: !919, line: 645, baseType: !969, size: 64, align: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1080, file: !919, line: 652, baseType: !959, size: 32, align: 32, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1080, file: !919, line: 659, baseType: !969, size: 64, align: 64, offset: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1080, file: !919, line: 661, baseType: !980, size: 64, align: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1080, file: !919, line: 663, baseType: !990, size: 64, align: 64, offset: 320)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1080, file: !919, line: 670, baseType: !969, size: 64, align: 64, offset: 384)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1080, file: !919, line: 679, baseType: !1079, size: 64, align: 64, offset: 448)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1080, file: !919, line: 684, baseType: !959, size: 32, align: 32, offset: 512)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1080, file: !919, line: 689, baseType: !959, size: 32, align: 32, offset: 544)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1080, file: !919, line: 696, baseType: !1093, size: 64, align: 64, offset: 576)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!959, !1096}
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1099)
!1099 = !{!1100, !1101, !1104, !1105}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1098, file: !919, line: 449, baseType: !969, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1098, file: !919, line: 450, baseType: !1102, size: 64, align: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1098, file: !919, line: 451, baseType: !959, size: 32, align: 32, offset: 128)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1098, file: !919, line: 452, baseType: !969, size: 64, align: 64, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1080, file: !919, line: 703, baseType: !1071, size: 64, align: 64, offset: 640)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1080, file: !919, line: 714, baseType: !1108, size: 64, align: 64, offset: 704)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!959, !1074, !1111}
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1113)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1114)
!1114 = !{!1115, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1143, !1144, !1145, !1146}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1113, file: !4, line: 1451, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1118, line: 94, baseType: !1119)
!1118 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1118, line: 81, size: 192, align: 64, elements: !1120)
!1120 = !{!1121, !1125, !1128}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1119, file: !1118, line: 82, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1118, line: 73, baseType: !1124)
!1124 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1118, line: 73, flags: DIFlagFwdDecl)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1119, file: !1118, line: 89, baseType: !1126, size: 64, align: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !956, line: 48, baseType: !1103)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1119, file: !1118, line: 93, baseType: !959, size: 32, align: 32, offset: 128)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1113, file: !4, line: 1461, baseType: !955, size: 64, align: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1113, file: !4, line: 1467, baseType: !955, size: 64, align: 64, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1113, file: !4, line: 1468, baseType: !1126, size: 64, align: 64, offset: 192)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1113, file: !4, line: 1469, baseType: !959, size: 32, align: 32, offset: 256)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1113, file: !4, line: 1470, baseType: !959, size: 32, align: 32, offset: 288)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1113, file: !4, line: 1474, baseType: !959, size: 32, align: 32, offset: 320)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1113, file: !4, line: 1479, baseType: !1136, size: 64, align: 64, offset: 384)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1138)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1139)
!1139 = !{!1140, !1141, !1142}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1138, file: !4, line: 1412, baseType: !1126, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1138, file: !4, line: 1413, baseType: !959, size: 32, align: 32, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1138, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1113, file: !4, line: 1480, baseType: !959, size: 32, align: 32, offset: 448)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1113, file: !4, line: 1486, baseType: !955, size: 64, align: 64, offset: 512)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1113, file: !4, line: 1488, baseType: !955, size: 64, align: 64, offset: 576)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1113, file: !4, line: 1497, baseType: !955, size: 64, align: 64, offset: 640)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1080, file: !919, line: 720, baseType: !1071, size: 64, align: 64, offset: 768)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1080, file: !919, line: 730, baseType: !1149, size: 64, align: 64, offset: 832)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!959, !1074, !959, !955, !959}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1080, file: !919, line: 737, baseType: !1153, size: 64, align: 64, offset: 896)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!955, !1074, !959, !1156, !955}
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1080, file: !919, line: 744, baseType: !1071, size: 64, align: 64, offset: 960)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1080, file: !919, line: 750, baseType: !1071, size: 64, align: 64, offset: 1024)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1080, file: !919, line: 758, baseType: !1160, size: 64, align: 64, offset: 1088)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{!959, !1074, !959, !955, !955, !955, !959}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1080, file: !919, line: 764, baseType: !1164, size: 64, align: 64, offset: 1152)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!959, !1074, !1167}
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1080, file: !919, line: 770, baseType: !1170, size: 64, align: 64, offset: 1216)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!959, !1074, !1173}
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1080, file: !919, line: 776, baseType: !1170, size: 64, align: 64, offset: 1280)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1075, file: !919, line: 1356, baseType: !1068, size: 64, align: 64, offset: 128)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1075, file: !919, line: 1365, baseType: !960, size: 64, align: 64, offset: 192)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1075, file: !919, line: 1379, baseType: !1179, size: 64, align: 64, offset: 256)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !537, line: 352, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !537, line: 161, size: 2112, align: 64, elements: !1182)
!1182 = !{!1183, !1184, !1185, !1186, !1187, !1188, !1189, !1193, !1194, !1198, !1199, !1200, !1201, !1202, !1204, !1205, !1211, !1212, !1216, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1234, !1235, !1236, !1237, !1241, !1242, !1243}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1181, file: !537, line: 174, baseType: !990, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1181, file: !537, line: 226, baseType: !1102, size: 64, align: 64, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1181, file: !537, line: 227, baseType: !959, size: 32, align: 32, offset: 128)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1181, file: !537, line: 228, baseType: !1102, size: 64, align: 64, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1181, file: !537, line: 229, baseType: !1102, size: 64, align: 64, offset: 256)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1181, file: !537, line: 233, baseType: !960, size: 64, align: 64, offset: 320)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1181, file: !537, line: 235, baseType: !1190, size: 64, align: 64, offset: 384)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!959, !960, !1126, !959}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1181, file: !537, line: 236, baseType: !1190, size: 64, align: 64, offset: 448)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1181, file: !537, line: 237, baseType: !1195, size: 64, align: 64, offset: 512)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!955, !960, !955, !959}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1181, file: !537, line: 238, baseType: !955, size: 64, align: 64, offset: 576)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1181, file: !537, line: 239, baseType: !959, size: 32, align: 32, offset: 640)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1181, file: !537, line: 240, baseType: !959, size: 32, align: 32, offset: 672)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1181, file: !537, line: 241, baseType: !959, size: 32, align: 32, offset: 704)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1181, file: !537, line: 242, baseType: !1203, size: 64, align: 64, offset: 768)
!1203 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1181, file: !537, line: 243, baseType: !1102, size: 64, align: 64, offset: 832)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1181, file: !537, line: 244, baseType: !1206, size: 64, align: 64, offset: 896)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!1203, !1203, !1209, !961}
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1127)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1181, file: !537, line: 245, baseType: !959, size: 32, align: 32, offset: 960)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1181, file: !537, line: 249, baseType: !1213, size: 64, align: 64, offset: 1024)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{!959, !960, !959}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1181, file: !537, line: 255, baseType: !1217, size: 64, align: 64, offset: 1088)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{!955, !960, !959, !955, !959}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1181, file: !537, line: 260, baseType: !959, size: 32, align: 32, offset: 1152)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1181, file: !537, line: 266, baseType: !955, size: 64, align: 64, offset: 1216)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1181, file: !537, line: 273, baseType: !959, size: 32, align: 32, offset: 1280)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1181, file: !537, line: 279, baseType: !955, size: 64, align: 64, offset: 1344)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1181, file: !537, line: 285, baseType: !959, size: 32, align: 32, offset: 1408)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1181, file: !537, line: 291, baseType: !959, size: 32, align: 32, offset: 1440)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1181, file: !537, line: 298, baseType: !959, size: 32, align: 32, offset: 1472)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1181, file: !537, line: 304, baseType: !959, size: 32, align: 32, offset: 1504)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1181, file: !537, line: 309, baseType: !969, size: 64, align: 64, offset: 1536)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1181, file: !537, line: 314, baseType: !969, size: 64, align: 64, offset: 1600)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1181, file: !537, line: 319, baseType: !1231, size: 64, align: 64, offset: 1664)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!959, !960, !1126, !959, !536, !955}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1181, file: !537, line: 326, baseType: !959, size: 32, align: 32, offset: 1728)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1181, file: !537, line: 331, baseType: !536, size: 32, align: 32, offset: 1760)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1181, file: !537, line: 332, baseType: !955, size: 64, align: 64, offset: 1792)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1181, file: !537, line: 338, baseType: !1238, size: 64, align: 64, offset: 1856)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!959, !960}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1181, file: !537, line: 340, baseType: !955, size: 64, align: 64, offset: 1920)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1181, file: !537, line: 346, baseType: !1102, size: 64, align: 64, offset: 1984)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1181, file: !537, line: 351, baseType: !959, size: 32, align: 32, offset: 2048)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1075, file: !919, line: 1386, baseType: !959, size: 32, align: 32, offset: 320)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1075, file: !919, line: 1393, baseType: !961, size: 32, align: 32, offset: 352)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1075, file: !919, line: 1405, baseType: !1247, size: 64, align: 64, offset: 384)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1250)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1251)
!1251 = !{!1252, !1253, !1254, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1810, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1910, !1916, !1917, !1921, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1953, !1954, !1955, !1956, !1957, !1958}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1250, file: !919, line: 866, baseType: !959, size: 32, align: 32)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1250, file: !919, line: 872, baseType: !959, size: 32, align: 32, offset: 32)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1250, file: !919, line: 878, baseType: !1255, size: 64, align: 64, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1257)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1258)
!1258 = !{!1259, !1260, !1261, !1262, !1486, !1487, !1488, !1489, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1515, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1698, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1257, file: !4, line: 1561, baseType: !990, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1257, file: !4, line: 1562, baseType: !959, size: 32, align: 32, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1257, file: !4, line: 1564, baseType: !545, size: 32, align: 32, offset: 96)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1257, file: !4, line: 1565, baseType: !1263, size: 64, align: 64, offset: 128)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1265)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1266)
!1266 = !{!1267, !1268, !1269, !1270, !1271, !1272, !1275, !1278, !1281, !1284, !1288, !1289, !1290, !1298, !1299, !1300, !1302, !1306, !1312, !1317, !1321, !1322, !1370, !1457, !1461, !1462, !1466, !1470, !1475, !1479, !1480, !1481}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1265, file: !4, line: 3475, baseType: !969, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1265, file: !4, line: 3480, baseType: !969, size: 64, align: 64, offset: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1265, file: !4, line: 3481, baseType: !545, size: 32, align: 32, offset: 128)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1265, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1265, file: !4, line: 3487, baseType: !959, size: 32, align: 32, offset: 192)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1265, file: !4, line: 3488, baseType: !1273, size: 64, align: 64, offset: 256)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1016)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1265, file: !4, line: 3489, baseType: !1276, size: 64, align: 64, offset: 320)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1265, file: !4, line: 3490, baseType: !1279, size: 64, align: 64, offset: 384)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1265, file: !4, line: 3491, baseType: !1282, size: 64, align: 64, offset: 448)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1265, file: !4, line: 3492, baseType: !1285, size: 64, align: 64, offset: 512)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1287)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !956, line: 55, baseType: !1203)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1265, file: !4, line: 3493, baseType: !1127, size: 8, align: 8, offset: 576)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1265, file: !4, line: 3494, baseType: !990, size: 64, align: 64, offset: 640)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1265, file: !4, line: 3495, baseType: !1291, size: 64, align: 64, offset: 704)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1293)
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1294)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1295)
!1295 = !{!1296, !1297}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1294, file: !4, line: 3402, baseType: !959, size: 32, align: 32)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1294, file: !4, line: 3403, baseType: !969, size: 64, align: 64, offset: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1265, file: !4, line: 3507, baseType: !969, size: 64, align: 64, offset: 768)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1265, file: !4, line: 3516, baseType: !959, size: 32, align: 32, offset: 832)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1265, file: !4, line: 3517, baseType: !1301, size: 64, align: 64, offset: 896)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1265, file: !4, line: 3527, baseType: !1303, size: 64, align: 64, offset: 960)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{!959, !1255}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1265, file: !4, line: 3535, baseType: !1307, size: 64, align: 64, offset: 1024)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!959, !1255, !1310}
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1256)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1265, file: !4, line: 3541, baseType: !1313, size: 64, align: 64, offset: 1088)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1315)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1316)
!1316 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1265, file: !4, line: 3549, baseType: !1318, size: 64, align: 64, offset: 1152)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DISubroutineType(types: !1320)
!1320 = !{null, !1301}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1265, file: !4, line: 3551, baseType: !1303, size: 64, align: 64, offset: 1216)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1265, file: !4, line: 3552, baseType: !1323, size: 64, align: 64, offset: 1280)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{!959, !1255, !1126, !959, !1326}
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1328)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1329)
!1329 = !{!1330, !1333, !1335, !1336, !1337, !1369}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1328, file: !4, line: 3921, baseType: !1331, size: 16, align: 16)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !956, line: 49, baseType: !1332)
!1332 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1328, file: !4, line: 3922, baseType: !1334, size: 32, align: 32, offset: 32)
!1334 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !956, line: 51, baseType: !961)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1328, file: !4, line: 3923, baseType: !1334, size: 32, align: 32, offset: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1328, file: !4, line: 3924, baseType: !961, size: 32, align: 32, offset: 96)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1328, file: !4, line: 3925, baseType: !1338, size: 64, align: 64, offset: 128)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1341)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1342)
!1342 = !{!1343, !1344, !1345, !1346, !1347, !1348, !1358, !1362, !1364, !1365, !1367, !1368}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1341, file: !4, line: 3886, baseType: !959, size: 32, align: 32)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1341, file: !4, line: 3887, baseType: !959, size: 32, align: 32, offset: 32)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1341, file: !4, line: 3888, baseType: !959, size: 32, align: 32, offset: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1341, file: !4, line: 3889, baseType: !959, size: 32, align: 32, offset: 96)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1341, file: !4, line: 3890, baseType: !959, size: 32, align: 32, offset: 128)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1341, file: !4, line: 3897, baseType: !1349, size: 768, align: 64, offset: 192)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1350)
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1351)
!1351 = !{!1352, !1356}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1350, file: !4, line: 3855, baseType: !1353, size: 512, align: 64)
!1353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1126, size: 512, align: 64, elements: !1354)
!1354 = !{!1355}
!1355 = !DISubrange(count: 8)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1350, file: !4, line: 3857, baseType: !1357, size: 256, align: 32, offset: 512)
!1357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 256, align: 32, elements: !1354)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1341, file: !4, line: 3903, baseType: !1359, size: 256, align: 64, offset: 960)
!1359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1126, size: 256, align: 64, elements: !1360)
!1360 = !{!1361}
!1361 = !DISubrange(count: 4)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1341, file: !4, line: 3904, baseType: !1363, size: 128, align: 32, offset: 1216)
!1363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 128, align: 32, elements: !1360)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1341, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1341, file: !4, line: 3908, baseType: !1366, size: 64, align: 64, offset: 1408)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1341, file: !4, line: 3915, baseType: !1366, size: 64, align: 64, offset: 1472)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1341, file: !4, line: 3917, baseType: !959, size: 32, align: 32, offset: 1536)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1328, file: !4, line: 3926, baseType: !955, size: 64, align: 64, offset: 192)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1265, file: !4, line: 3564, baseType: !1371, size: 64, align: 64, offset: 1344)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DISubroutineType(types: !1373)
!1373 = !{!959, !1255, !1111, !1374, !1456}
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1376)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1377)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1378)
!1378 = !{!1379, !1380, !1381, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1408, !1410, !1411, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1444, !1445, !1446, !1447, !1448, !1449, !1452, !1453, !1454, !1455}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1377, file: !789, line: 282, baseType: !1353, size: 512, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1377, file: !789, line: 299, baseType: !1357, size: 256, align: 32, offset: 512)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1377, file: !789, line: 315, baseType: !1382, size: 64, align: 64, offset: 768)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1377, file: !789, line: 326, baseType: !959, size: 32, align: 32, offset: 832)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1377, file: !789, line: 326, baseType: !959, size: 32, align: 32, offset: 864)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1377, file: !789, line: 334, baseType: !959, size: 32, align: 32, offset: 896)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1377, file: !789, line: 341, baseType: !959, size: 32, align: 32, offset: 928)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1377, file: !789, line: 346, baseType: !959, size: 32, align: 32, offset: 960)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1377, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1377, file: !789, line: 356, baseType: !1016, size: 64, align: 32, offset: 1024)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1377, file: !789, line: 361, baseType: !955, size: 64, align: 64, offset: 1088)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1377, file: !789, line: 369, baseType: !955, size: 64, align: 64, offset: 1152)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1377, file: !789, line: 377, baseType: !955, size: 64, align: 64, offset: 1216)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1377, file: !789, line: 382, baseType: !959, size: 32, align: 32, offset: 1280)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1377, file: !789, line: 386, baseType: !959, size: 32, align: 32, offset: 1312)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1377, file: !789, line: 391, baseType: !959, size: 32, align: 32, offset: 1344)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1377, file: !789, line: 396, baseType: !960, size: 64, align: 64, offset: 1408)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1377, file: !789, line: 403, baseType: !1398, size: 512, align: 64, offset: 1472)
!1398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1287, size: 512, align: 64, elements: !1354)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1377, file: !789, line: 410, baseType: !959, size: 32, align: 32, offset: 1984)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1377, file: !789, line: 415, baseType: !959, size: 32, align: 32, offset: 2016)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1377, file: !789, line: 420, baseType: !959, size: 32, align: 32, offset: 2048)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1377, file: !789, line: 425, baseType: !959, size: 32, align: 32, offset: 2080)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1377, file: !789, line: 435, baseType: !955, size: 64, align: 64, offset: 2112)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1377, file: !789, line: 440, baseType: !959, size: 32, align: 32, offset: 2176)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1377, file: !789, line: 445, baseType: !1287, size: 64, align: 64, offset: 2240)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1377, file: !789, line: 459, baseType: !1407, size: 512, align: 64, offset: 2304)
!1407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1116, size: 512, align: 64, elements: !1354)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1377, file: !789, line: 473, baseType: !1409, size: 64, align: 64, offset: 2816)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1377, file: !789, line: 477, baseType: !959, size: 32, align: 32, offset: 2880)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1377, file: !789, line: 479, baseType: !1412, size: 64, align: 64, offset: 2944)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1415)
!1415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1416)
!1416 = !{!1417, !1418, !1419, !1420, !1425}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1415, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1415, file: !789, line: 203, baseType: !1126, size: 64, align: 64, offset: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1415, file: !789, line: 204, baseType: !959, size: 32, align: 32, offset: 128)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1415, file: !789, line: 205, baseType: !1421, size: 64, align: 64, offset: 192)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1423, line: 86, baseType: !1424)
!1423 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1424 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1423, line: 86, flags: DIFlagFwdDecl)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1415, file: !789, line: 206, baseType: !1116, size: 64, align: 64, offset: 256)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1377, file: !789, line: 480, baseType: !959, size: 32, align: 32, offset: 3008)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1377, file: !789, line: 505, baseType: !959, size: 32, align: 32, offset: 3040)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1377, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1377, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1377, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1377, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1377, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1377, file: !789, line: 532, baseType: !955, size: 64, align: 64, offset: 3264)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1377, file: !789, line: 539, baseType: !955, size: 64, align: 64, offset: 3328)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1377, file: !789, line: 547, baseType: !955, size: 64, align: 64, offset: 3392)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1377, file: !789, line: 554, baseType: !1421, size: 64, align: 64, offset: 3456)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1377, file: !789, line: 563, baseType: !959, size: 32, align: 32, offset: 3520)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1377, file: !789, line: 572, baseType: !959, size: 32, align: 32, offset: 3552)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1377, file: !789, line: 581, baseType: !959, size: 32, align: 32, offset: 3584)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1377, file: !789, line: 588, baseType: !1441, size: 64, align: 64, offset: 3648)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !956, line: 36, baseType: !1443)
!1443 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1377, file: !789, line: 593, baseType: !959, size: 32, align: 32, offset: 3712)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1377, file: !789, line: 596, baseType: !959, size: 32, align: 32, offset: 3744)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1377, file: !789, line: 599, baseType: !1116, size: 64, align: 64, offset: 3776)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1377, file: !789, line: 605, baseType: !1116, size: 64, align: 64, offset: 3840)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1377, file: !789, line: 616, baseType: !1116, size: 64, align: 64, offset: 3904)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1377, file: !789, line: 626, baseType: !1450, size: 64, align: 64, offset: 3968)
!1450 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1451, line: 216, baseType: !1203)
!1451 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1377, file: !789, line: 627, baseType: !1450, size: 64, align: 64, offset: 4032)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1377, file: !789, line: 628, baseType: !1450, size: 64, align: 64, offset: 4096)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1377, file: !789, line: 629, baseType: !1450, size: 64, align: 64, offset: 4160)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1377, file: !789, line: 645, baseType: !1116, size: 64, align: 64, offset: 4224)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1265, file: !4, line: 3566, baseType: !1458, size: 64, align: 64, offset: 1408)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DISubroutineType(types: !1460)
!1460 = !{!959, !1255, !960, !1456, !1111}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1265, file: !4, line: 3567, baseType: !1303, size: 64, align: 64, offset: 1472)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1265, file: !4, line: 3576, baseType: !1463, size: 64, align: 64, offset: 1536)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DISubroutineType(types: !1465)
!1465 = !{!959, !1255, !1374}
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1265, file: !4, line: 3577, baseType: !1467, size: 64, align: 64, offset: 1600)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DISubroutineType(types: !1469)
!1469 = !{!959, !1255, !1111}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1265, file: !4, line: 3584, baseType: !1471, size: 64, align: 64, offset: 1664)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DISubroutineType(types: !1473)
!1473 = !{!959, !1255, !1474}
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1265, file: !4, line: 3589, baseType: !1476, size: 64, align: 64, offset: 1728)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DISubroutineType(types: !1478)
!1478 = !{null, !1255}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1265, file: !4, line: 3594, baseType: !959, size: 32, align: 32, offset: 1792)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1265, file: !4, line: 3600, baseType: !969, size: 64, align: 64, offset: 1856)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1265, file: !4, line: 3609, baseType: !1482, size: 64, align: 64, offset: 1920)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1485)
!1485 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1257, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1257, file: !4, line: 1581, baseType: !961, size: 32, align: 32, offset: 224)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1257, file: !4, line: 1583, baseType: !960, size: 64, align: 64, offset: 256)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1257, file: !4, line: 1591, baseType: !1490, size: 64, align: 64, offset: 320)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1257, file: !4, line: 1598, baseType: !960, size: 64, align: 64, offset: 384)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1257, file: !4, line: 1606, baseType: !955, size: 64, align: 64, offset: 448)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1257, file: !4, line: 1614, baseType: !959, size: 32, align: 32, offset: 512)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1257, file: !4, line: 1622, baseType: !959, size: 32, align: 32, offset: 544)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1257, file: !4, line: 1628, baseType: !959, size: 32, align: 32, offset: 576)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1257, file: !4, line: 1636, baseType: !959, size: 32, align: 32, offset: 608)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1257, file: !4, line: 1643, baseType: !959, size: 32, align: 32, offset: 640)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1257, file: !4, line: 1657, baseType: !1126, size: 64, align: 64, offset: 704)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1257, file: !4, line: 1658, baseType: !959, size: 32, align: 32, offset: 768)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1257, file: !4, line: 1679, baseType: !1016, size: 64, align: 32, offset: 800)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1257, file: !4, line: 1688, baseType: !959, size: 32, align: 32, offset: 864)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1257, file: !4, line: 1712, baseType: !959, size: 32, align: 32, offset: 896)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1257, file: !4, line: 1729, baseType: !959, size: 32, align: 32, offset: 928)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1257, file: !4, line: 1729, baseType: !959, size: 32, align: 32, offset: 960)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1257, file: !4, line: 1744, baseType: !959, size: 32, align: 32, offset: 992)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1257, file: !4, line: 1744, baseType: !959, size: 32, align: 32, offset: 1024)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1257, file: !4, line: 1751, baseType: !959, size: 32, align: 32, offset: 1056)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1257, file: !4, line: 1766, baseType: !555, size: 32, align: 32, offset: 1088)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1257, file: !4, line: 1791, baseType: !1511, size: 64, align: 64, offset: 1152)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DISubroutineType(types: !1513)
!1513 = !{null, !1514, !1374, !1456, !959, !959, !959}
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1257, file: !4, line: 1808, baseType: !1516, size: 64, align: 64, offset: 1216)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DISubroutineType(types: !1518)
!1518 = !{!555, !1514, !1276}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1257, file: !4, line: 1816, baseType: !959, size: 32, align: 32, offset: 1280)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1257, file: !4, line: 1825, baseType: !962, size: 32, align: 32, offset: 1312)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1257, file: !4, line: 1830, baseType: !959, size: 32, align: 32, offset: 1344)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1257, file: !4, line: 1838, baseType: !962, size: 32, align: 32, offset: 1376)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1257, file: !4, line: 1846, baseType: !959, size: 32, align: 32, offset: 1408)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1257, file: !4, line: 1851, baseType: !959, size: 32, align: 32, offset: 1440)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1257, file: !4, line: 1861, baseType: !962, size: 32, align: 32, offset: 1472)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1257, file: !4, line: 1868, baseType: !962, size: 32, align: 32, offset: 1504)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1257, file: !4, line: 1875, baseType: !962, size: 32, align: 32, offset: 1536)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1257, file: !4, line: 1882, baseType: !962, size: 32, align: 32, offset: 1568)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1257, file: !4, line: 1889, baseType: !962, size: 32, align: 32, offset: 1600)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1257, file: !4, line: 1896, baseType: !962, size: 32, align: 32, offset: 1632)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1257, file: !4, line: 1903, baseType: !962, size: 32, align: 32, offset: 1664)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1257, file: !4, line: 1910, baseType: !959, size: 32, align: 32, offset: 1696)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1257, file: !4, line: 1915, baseType: !959, size: 32, align: 32, offset: 1728)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1257, file: !4, line: 1926, baseType: !1456, size: 64, align: 64, offset: 1792)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1257, file: !4, line: 1935, baseType: !1016, size: 64, align: 32, offset: 1856)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1257, file: !4, line: 1942, baseType: !959, size: 32, align: 32, offset: 1920)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1257, file: !4, line: 1948, baseType: !959, size: 32, align: 32, offset: 1952)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1257, file: !4, line: 1954, baseType: !959, size: 32, align: 32, offset: 1984)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1257, file: !4, line: 1960, baseType: !959, size: 32, align: 32, offset: 2016)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1257, file: !4, line: 1984, baseType: !959, size: 32, align: 32, offset: 2048)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1257, file: !4, line: 1991, baseType: !959, size: 32, align: 32, offset: 2080)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1257, file: !4, line: 1996, baseType: !959, size: 32, align: 32, offset: 2112)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1257, file: !4, line: 2004, baseType: !959, size: 32, align: 32, offset: 2144)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1257, file: !4, line: 2011, baseType: !959, size: 32, align: 32, offset: 2176)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1257, file: !4, line: 2018, baseType: !959, size: 32, align: 32, offset: 2208)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1257, file: !4, line: 2027, baseType: !959, size: 32, align: 32, offset: 2240)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1257, file: !4, line: 2034, baseType: !959, size: 32, align: 32, offset: 2272)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1257, file: !4, line: 2044, baseType: !959, size: 32, align: 32, offset: 2304)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1257, file: !4, line: 2054, baseType: !1550, size: 64, align: 64, offset: 2368)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1257, file: !4, line: 2061, baseType: !1550, size: 64, align: 64, offset: 2432)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1257, file: !4, line: 2066, baseType: !959, size: 32, align: 32, offset: 2496)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1257, file: !4, line: 2070, baseType: !959, size: 32, align: 32, offset: 2528)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1257, file: !4, line: 2078, baseType: !959, size: 32, align: 32, offset: 2560)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1257, file: !4, line: 2085, baseType: !959, size: 32, align: 32, offset: 2592)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1257, file: !4, line: 2092, baseType: !959, size: 32, align: 32, offset: 2624)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1257, file: !4, line: 2099, baseType: !959, size: 32, align: 32, offset: 2656)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1257, file: !4, line: 2106, baseType: !959, size: 32, align: 32, offset: 2688)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1257, file: !4, line: 2113, baseType: !959, size: 32, align: 32, offset: 2720)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1257, file: !4, line: 2120, baseType: !959, size: 32, align: 32, offset: 2752)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1257, file: !4, line: 2125, baseType: !959, size: 32, align: 32, offset: 2784)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1257, file: !4, line: 2133, baseType: !959, size: 32, align: 32, offset: 2816)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1257, file: !4, line: 2140, baseType: !959, size: 32, align: 32, offset: 2848)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1257, file: !4, line: 2145, baseType: !959, size: 32, align: 32, offset: 2880)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1257, file: !4, line: 2153, baseType: !959, size: 32, align: 32, offset: 2912)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1257, file: !4, line: 2158, baseType: !959, size: 32, align: 32, offset: 2944)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1257, file: !4, line: 2166, baseType: !818, size: 32, align: 32, offset: 2976)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1257, file: !4, line: 2173, baseType: !836, size: 32, align: 32, offset: 3008)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1257, file: !4, line: 2180, baseType: !860, size: 32, align: 32, offset: 3040)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1257, file: !4, line: 2187, baseType: !812, size: 32, align: 32, offset: 3072)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1257, file: !4, line: 2194, baseType: !879, size: 32, align: 32, offset: 3104)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1257, file: !4, line: 2203, baseType: !959, size: 32, align: 32, offset: 3136)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1257, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1257, file: !4, line: 2212, baseType: !959, size: 32, align: 32, offset: 3200)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1257, file: !4, line: 2213, baseType: !959, size: 32, align: 32, offset: 3232)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1257, file: !4, line: 2220, baseType: !755, size: 32, align: 32, offset: 3264)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1257, file: !4, line: 2232, baseType: !959, size: 32, align: 32, offset: 3296)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1257, file: !4, line: 2243, baseType: !959, size: 32, align: 32, offset: 3328)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1257, file: !4, line: 2249, baseType: !959, size: 32, align: 32, offset: 3360)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1257, file: !4, line: 2256, baseType: !959, size: 32, align: 32, offset: 3392)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1257, file: !4, line: 2263, baseType: !1287, size: 64, align: 64, offset: 3456)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1257, file: !4, line: 2270, baseType: !1287, size: 64, align: 64, offset: 3520)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1257, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1257, file: !4, line: 2285, baseType: !755, size: 32, align: 32, offset: 3616)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1257, file: !4, line: 2367, baseType: !1586, size: 64, align: 64, offset: 3648)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DISubroutineType(types: !1588)
!1588 = !{!959, !1514, !1474, !959}
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1257, file: !4, line: 2383, baseType: !959, size: 32, align: 32, offset: 3712)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1257, file: !4, line: 2386, baseType: !962, size: 32, align: 32, offset: 3744)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1257, file: !4, line: 2387, baseType: !962, size: 32, align: 32, offset: 3776)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1257, file: !4, line: 2394, baseType: !959, size: 32, align: 32, offset: 3808)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1257, file: !4, line: 2401, baseType: !959, size: 32, align: 32, offset: 3840)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1257, file: !4, line: 2408, baseType: !959, size: 32, align: 32, offset: 3872)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1257, file: !4, line: 2415, baseType: !959, size: 32, align: 32, offset: 3904)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1257, file: !4, line: 2422, baseType: !959, size: 32, align: 32, offset: 3936)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1257, file: !4, line: 2423, baseType: !1598, size: 64, align: 64, offset: 3968)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1600)
!1600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1601)
!1601 = !{!1602, !1603, !1604, !1605}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1600, file: !4, line: 827, baseType: !959, size: 32, align: 32)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1600, file: !4, line: 828, baseType: !959, size: 32, align: 32, offset: 32)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1600, file: !4, line: 829, baseType: !959, size: 32, align: 32, offset: 64)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1600, file: !4, line: 830, baseType: !962, size: 32, align: 32, offset: 96)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1257, file: !4, line: 2430, baseType: !955, size: 64, align: 64, offset: 4032)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1257, file: !4, line: 2437, baseType: !955, size: 64, align: 64, offset: 4096)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1257, file: !4, line: 2444, baseType: !962, size: 32, align: 32, offset: 4160)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1257, file: !4, line: 2451, baseType: !962, size: 32, align: 32, offset: 4192)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1257, file: !4, line: 2458, baseType: !959, size: 32, align: 32, offset: 4224)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1257, file: !4, line: 2469, baseType: !959, size: 32, align: 32, offset: 4256)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1257, file: !4, line: 2475, baseType: !959, size: 32, align: 32, offset: 4288)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1257, file: !4, line: 2481, baseType: !959, size: 32, align: 32, offset: 4320)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1257, file: !4, line: 2485, baseType: !959, size: 32, align: 32, offset: 4352)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1257, file: !4, line: 2489, baseType: !959, size: 32, align: 32, offset: 4384)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1257, file: !4, line: 2493, baseType: !959, size: 32, align: 32, offset: 4416)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1257, file: !4, line: 2501, baseType: !959, size: 32, align: 32, offset: 4448)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1257, file: !4, line: 2506, baseType: !959, size: 32, align: 32, offset: 4480)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1257, file: !4, line: 2510, baseType: !959, size: 32, align: 32, offset: 4512)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1257, file: !4, line: 2514, baseType: !955, size: 64, align: 64, offset: 4544)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1257, file: !4, line: 2528, baseType: !1622, size: 64, align: 64, offset: 4608)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DISubroutineType(types: !1624)
!1624 = !{null, !1514, !960, !959, !959}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1257, file: !4, line: 2534, baseType: !959, size: 32, align: 32, offset: 4672)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1257, file: !4, line: 2545, baseType: !959, size: 32, align: 32, offset: 4704)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1257, file: !4, line: 2547, baseType: !959, size: 32, align: 32, offset: 4736)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1257, file: !4, line: 2549, baseType: !959, size: 32, align: 32, offset: 4768)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1257, file: !4, line: 2551, baseType: !959, size: 32, align: 32, offset: 4800)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1257, file: !4, line: 2553, baseType: !959, size: 32, align: 32, offset: 4832)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1257, file: !4, line: 2555, baseType: !959, size: 32, align: 32, offset: 4864)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1257, file: !4, line: 2557, baseType: !959, size: 32, align: 32, offset: 4896)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1257, file: !4, line: 2559, baseType: !959, size: 32, align: 32, offset: 4928)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1257, file: !4, line: 2563, baseType: !959, size: 32, align: 32, offset: 4960)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1257, file: !4, line: 2571, baseType: !1366, size: 64, align: 64, offset: 4992)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1257, file: !4, line: 2579, baseType: !1366, size: 64, align: 64, offset: 5056)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1257, file: !4, line: 2586, baseType: !959, size: 32, align: 32, offset: 5120)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1257, file: !4, line: 2615, baseType: !959, size: 32, align: 32, offset: 5152)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1257, file: !4, line: 2627, baseType: !959, size: 32, align: 32, offset: 5184)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1257, file: !4, line: 2637, baseType: !959, size: 32, align: 32, offset: 5216)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1257, file: !4, line: 2681, baseType: !959, size: 32, align: 32, offset: 5248)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1257, file: !4, line: 2709, baseType: !955, size: 64, align: 64, offset: 5312)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1257, file: !4, line: 2716, baseType: !1644, size: 64, align: 64, offset: 5376)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1646)
!1646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1647)
!1647 = !{!1648, !1649, !1650, !1651, !1652, !1653, !1654, !1658, !1662, !1663, !1664, !1665, !1671, !1672, !1673, !1674, !1675}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1646, file: !4, line: 3642, baseType: !969, size: 64, align: 64)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1646, file: !4, line: 3649, baseType: !545, size: 32, align: 32, offset: 64)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1646, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1646, file: !4, line: 3663, baseType: !555, size: 32, align: 32, offset: 128)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1646, file: !4, line: 3669, baseType: !959, size: 32, align: 32, offset: 160)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1646, file: !4, line: 3682, baseType: !1471, size: 64, align: 64, offset: 192)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1646, file: !4, line: 3698, baseType: !1655, size: 64, align: 64, offset: 256)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DISubroutineType(types: !1657)
!1657 = !{!959, !1255, !1209, !1334}
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1646, file: !4, line: 3712, baseType: !1659, size: 64, align: 64, offset: 320)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DISubroutineType(types: !1661)
!1661 = !{!959, !1255, !959, !1209, !1334}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1646, file: !4, line: 3726, baseType: !1655, size: 64, align: 64, offset: 384)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1646, file: !4, line: 3737, baseType: !1303, size: 64, align: 64, offset: 448)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1646, file: !4, line: 3746, baseType: !959, size: 32, align: 32, offset: 512)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1646, file: !4, line: 3757, baseType: !1666, size: 64, align: 64, offset: 576)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = !DISubroutineType(types: !1668)
!1668 = !{null, !1669}
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1646, file: !4, line: 3766, baseType: !1303, size: 64, align: 64, offset: 640)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1646, file: !4, line: 3774, baseType: !1303, size: 64, align: 64, offset: 704)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1646, file: !4, line: 3780, baseType: !959, size: 32, align: 32, offset: 768)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1646, file: !4, line: 3785, baseType: !959, size: 32, align: 32, offset: 800)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1646, file: !4, line: 3795, baseType: !1676, size: 64, align: 64, offset: 832)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DISubroutineType(types: !1678)
!1678 = !{!959, !1255, !1116}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1257, file: !4, line: 2728, baseType: !960, size: 64, align: 64, offset: 5440)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1257, file: !4, line: 2735, baseType: !1398, size: 512, align: 64, offset: 5504)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1257, file: !4, line: 2742, baseType: !959, size: 32, align: 32, offset: 6016)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1257, file: !4, line: 2755, baseType: !959, size: 32, align: 32, offset: 6048)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1257, file: !4, line: 2776, baseType: !959, size: 32, align: 32, offset: 6080)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1257, file: !4, line: 2783, baseType: !959, size: 32, align: 32, offset: 6112)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1257, file: !4, line: 2791, baseType: !959, size: 32, align: 32, offset: 6144)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1257, file: !4, line: 2802, baseType: !1474, size: 64, align: 64, offset: 6208)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1257, file: !4, line: 2811, baseType: !959, size: 32, align: 32, offset: 6272)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1257, file: !4, line: 2821, baseType: !959, size: 32, align: 32, offset: 6304)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1257, file: !4, line: 2830, baseType: !959, size: 32, align: 32, offset: 6336)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1257, file: !4, line: 2840, baseType: !959, size: 32, align: 32, offset: 6368)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1257, file: !4, line: 2851, baseType: !1692, size: 64, align: 64, offset: 6400)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DISubroutineType(types: !1694)
!1694 = !{!959, !1514, !1695, !960, !1456, !959, !959}
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1696, size: 64, align: 64)
!1696 = !DISubroutineType(types: !1697)
!1697 = !{!959, !1514, !960}
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1257, file: !4, line: 2871, baseType: !1699, size: 64, align: 64, offset: 6464)
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DISubroutineType(types: !1701)
!1701 = !{!959, !1514, !1702, !960, !1456, !959}
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64, align: 64)
!1703 = !DISubroutineType(types: !1704)
!1704 = !{!959, !1514, !960, !959, !959}
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1257, file: !4, line: 2878, baseType: !959, size: 32, align: 32, offset: 6528)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1257, file: !4, line: 2885, baseType: !959, size: 32, align: 32, offset: 6560)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1257, file: !4, line: 3005, baseType: !959, size: 32, align: 32, offset: 6592)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1257, file: !4, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1257, file: !4, line: 3020, baseType: !909, size: 32, align: 32, offset: 6656)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1257, file: !4, line: 3027, baseType: !909, size: 32, align: 32, offset: 6688)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1257, file: !4, line: 3037, baseType: !1126, size: 64, align: 64, offset: 6720)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1257, file: !4, line: 3038, baseType: !959, size: 32, align: 32, offset: 6784)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1257, file: !4, line: 3050, baseType: !1287, size: 64, align: 64, offset: 6848)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1257, file: !4, line: 3065, baseType: !959, size: 32, align: 32, offset: 6912)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1257, file: !4, line: 3083, baseType: !959, size: 32, align: 32, offset: 6944)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1257, file: !4, line: 3092, baseType: !1016, size: 64, align: 32, offset: 6976)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1257, file: !4, line: 3099, baseType: !555, size: 32, align: 32, offset: 7040)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1257, file: !4, line: 3106, baseType: !1016, size: 64, align: 32, offset: 7072)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1257, file: !4, line: 3113, baseType: !1720, size: 64, align: 64, offset: 7168)
!1720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1721, size: 64, align: 64)
!1721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1722)
!1722 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1723)
!1723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1724)
!1724 = !{!1725, !1726, !1727, !1728, !1729, !1730, !1733}
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1723, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1723, file: !4, line: 714, baseType: !545, size: 32, align: 32, offset: 32)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1723, file: !4, line: 720, baseType: !969, size: 64, align: 64, offset: 64)
