; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--rtpenc_vp9.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--rtpenc_vp9.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFormatContext = type { %struct.AVClass*, %struct.AVInputFormat*, %struct.AVOutputFormat*, i8*, %struct.AVIOContext*, i32, i32, %struct.AVStream**, [1024 x i8], i8*, i64, i64, i64, i32, i32, i32, i64, i64, i8*, i32, i32, %struct.AVProgram**, i32, i32, i32, i32, i32, i32, %struct.AVChapter**, %struct.AVDictionary*, i64, i32, i32, %struct.AVIOInterruptCB, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i8*, i8*, %struct.AVFormatInternal*, i32, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, i32, i8*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i64, i8*, i32, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVIOInterruptCB*, %struct.AVDictionary**)*, i8*, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVDictionary**)*, void (%struct.AVFormatContext*, %struct.AVIOContext*)*, i8*, i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!865 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!866 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !25, line: 1534, size: 32, align: 32, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874}
!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !25, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !25, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !25, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{i32 2, !"Dwarf Version", i32 4}
!917 = !{i32 2, !"Debug Info Version", i32 3}
!918 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!919 = distinct !DISubprogram(name: "ff_rtp_send_vp9", scope: !920, file: !920, line: 26, type: !921, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2055)
!920 = !DIFile(filename: "libavformat/rtpenc_vp9.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!921 = !DISubroutineType(types: !922)
!922 = !{null, !923, !1263, !947}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !897, line: 1947, baseType: !925)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !926)
!926 = !{!927, !973, !1083, !1232, !1233, !1298, !1299, !1300, !1932, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1986, !1987, !1988, !1989, !1990, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2021, !2022, !2025, !2026, !2027, !2028, !2029, !2030, !2032, !2033, !2034, !2035, !2043, !2044, !2048, !2052, !2053, !2054}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !925, file: !897, line: 1342, baseType: !928, size: 64, align: 64)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !932)
!932 = !{!933, !937, !942, !946, !948, !949, !950, !954, !960, !962, !966}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !931, file: !4, line: 72, baseType: !934, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !931, file: !4, line: 78, baseType: !938, size: 64, align: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!934, !941}
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !931, file: !4, line: 85, baseType: !943, size: 64, align: 64, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !931, file: !4, line: 93, baseType: !947, size: 32, align: 32, offset: 192)
!947 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !931, file: !4, line: 99, baseType: !947, size: 32, align: 32, offset: 224)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !931, file: !4, line: 108, baseType: !947, size: 32, align: 32, offset: 256)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !931, file: !4, line: 113, baseType: !951, size: 64, align: 64, offset: 320)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!941, !941, !941}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !931, file: !4, line: 123, baseType: !955, size: 64, align: 64, offset: 384)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!958, !958}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !931, file: !4, line: 130, baseType: !961, size: 32, align: 32, offset: 448)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !931, file: !4, line: 136, baseType: !963, size: 64, align: 64, offset: 512)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!961, !941}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !931, file: !4, line: 142, baseType: !967, size: 64, align: 64, offset: 576)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!947, !970, !941, !934, !947}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !925, file: !897, line: 1349, baseType: !974, size: 64, align: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !976)
!976 = !{!977, !978, !979, !980, !981, !987, !988, !989, !990, !991, !992, !1006, !1011, !1054, !1055, !1059, !1064, !1065, !1066, !1070, !1076, !1082}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !975, file: !897, line: 638, baseType: !934, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !975, file: !897, line: 645, baseType: !934, size: 64, align: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !975, file: !897, line: 652, baseType: !947, size: 32, align: 32, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !975, file: !897, line: 659, baseType: !934, size: 64, align: 64, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !975, file: !897, line: 661, baseType: !982, size: 64, align: 64, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !897, line: 443, flags: DIFlagFwdDecl)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !975, file: !897, line: 663, baseType: !928, size: 64, align: 64, offset: 320)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !975, file: !897, line: 670, baseType: !934, size: 64, align: 64, offset: 384)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !975, file: !897, line: 679, baseType: !974, size: 64, align: 64, offset: 448)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !975, file: !897, line: 684, baseType: !947, size: 32, align: 32, offset: 512)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !975, file: !897, line: 689, baseType: !947, size: 32, align: 32, offset: 544)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !975, file: !897, line: 696, baseType: !993, size: 64, align: 64, offset: 576)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!947, !996}
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !999)
!999 = !{!1000, !1001, !1004, !1005}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !998, file: !897, line: 449, baseType: !934, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !998, file: !897, line: 450, baseType: !1002, size: 64, align: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !998, file: !897, line: 451, baseType: !947, size: 32, align: 32, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !998, file: !897, line: 452, baseType: !934, size: 64, align: 64, offset: 192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !975, file: !897, line: 703, baseType: !1007, size: 64, align: 64, offset: 640)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!947, !1010}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !975, file: !897, line: 714, baseType: !1012, size: 64, align: 64, offset: 704)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!947, !1010, !1015}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !25, line: 1499, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !25, line: 1445, size: 704, align: 64, elements: !1018)
!1018 = !{!1019, !1034, !1037, !1038, !1039, !1040, !1041, !1042, !1050, !1051, !1052, !1053}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1017, file: !25, line: 1451, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1022, line: 94, baseType: !1023)
!1022 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1022, line: 81, size: 192, align: 64, elements: !1024)
!1024 = !{!1025, !1029, !1033}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1023, file: !1022, line: 82, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1022, line: 73, baseType: !1028)
!1028 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1022, line: 73, flags: DIFlagFwdDecl)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1023, file: !1022, line: 89, baseType: !1030, size: 64, align: 64, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1032, line: 48, baseType: !1003)
!1032 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1023, file: !1022, line: 93, baseType: !947, size: 32, align: 32, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1017, file: !25, line: 1461, baseType: !1035, size: 64, align: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1032, line: 40, baseType: !1036)
!1036 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1017, file: !25, line: 1467, baseType: !1035, size: 64, align: 64, offset: 128)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1017, file: !25, line: 1468, baseType: !1030, size: 64, align: 64, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1017, file: !25, line: 1469, baseType: !947, size: 32, align: 32, offset: 256)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1017, file: !25, line: 1470, baseType: !947, size: 32, align: 32, offset: 288)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1017, file: !25, line: 1474, baseType: !947, size: 32, align: 32, offset: 320)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1017, file: !25, line: 1479, baseType: !1043, size: 64, align: 64, offset: 384)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !25, line: 1415, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !25, line: 1411, size: 128, align: 64, elements: !1046)
!1046 = !{!1047, !1048, !1049}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1045, file: !25, line: 1412, baseType: !1030, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1045, file: !25, line: 1413, baseType: !947, size: 32, align: 32, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1045, file: !25, line: 1414, baseType: !24, size: 32, align: 32, offset: 96)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1017, file: !25, line: 1480, baseType: !947, size: 32, align: 32, offset: 448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1017, file: !25, line: 1486, baseType: !1035, size: 64, align: 64, offset: 512)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1017, file: !25, line: 1488, baseType: !1035, size: 64, align: 64, offset: 576)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1017, file: !25, line: 1497, baseType: !1035, size: 64, align: 64, offset: 640)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !975, file: !897, line: 720, baseType: !1007, size: 64, align: 64, offset: 768)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !975, file: !897, line: 730, baseType: !1056, size: 64, align: 64, offset: 832)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!947, !1010, !947, !1035, !947}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !975, file: !897, line: 737, baseType: !1060, size: 64, align: 64, offset: 896)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!1035, !1010, !947, !1063, !1035}
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !975, file: !897, line: 744, baseType: !1007, size: 64, align: 64, offset: 960)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !975, file: !897, line: 750, baseType: !1007, size: 64, align: 64, offset: 1024)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !975, file: !897, line: 758, baseType: !1067, size: 64, align: 64, offset: 1088)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!947, !1010, !947, !1035, !1035, !1035, !947}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !975, file: !897, line: 764, baseType: !1071, size: 64, align: 64, offset: 1152)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!947, !1010, !1074}
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !975, file: !897, line: 770, baseType: !1077, size: 64, align: 64, offset: 1216)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!947, !1010, !1080}
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !975, file: !897, line: 776, baseType: !1077, size: 64, align: 64, offset: 1280)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !925, file: !897, line: 1356, baseType: !1084, size: 64, align: 64, offset: 128)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1086)
!1086 = !{!1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1106, !1110, !1114, !1121, !1217, !1218, !1219, !1220, !1221, !1222, !1226}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1085, file: !897, line: 498, baseType: !934, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1085, file: !897, line: 504, baseType: !934, size: 64, align: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1085, file: !897, line: 505, baseType: !934, size: 64, align: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1085, file: !897, line: 506, baseType: !934, size: 64, align: 64, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1085, file: !897, line: 508, baseType: !55, size: 32, align: 32, offset: 256)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1085, file: !897, line: 509, baseType: !55, size: 32, align: 32, offset: 288)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1085, file: !897, line: 510, baseType: !55, size: 32, align: 32, offset: 320)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1085, file: !897, line: 517, baseType: !947, size: 32, align: 32, offset: 352)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1085, file: !897, line: 523, baseType: !982, size: 64, align: 64, offset: 384)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1085, file: !897, line: 526, baseType: !928, size: 64, align: 64, offset: 448)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1085, file: !897, line: 535, baseType: !1084, size: 64, align: 64, offset: 512)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1085, file: !897, line: 539, baseType: !947, size: 32, align: 32, offset: 576)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1085, file: !897, line: 541, baseType: !1007, size: 64, align: 64, offset: 640)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1085, file: !897, line: 549, baseType: !1012, size: 64, align: 64, offset: 704)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1085, file: !897, line: 550, baseType: !1007, size: 64, align: 64, offset: 768)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1085, file: !897, line: 554, baseType: !1103, size: 64, align: 64, offset: 832)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!947, !1010, !1015, !1015, !947}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1085, file: !897, line: 563, baseType: !1107, size: 64, align: 64, offset: 896)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!947, !55, !947}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1085, file: !897, line: 565, baseType: !1111, size: 64, align: 64, offset: 960)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{null, !1010, !947, !1063, !1063}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1085, file: !897, line: 570, baseType: !1115, size: 64, align: 64, offset: 1024)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!947, !1010, !947, !941, !1118}
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1119, line: 216, baseType: !1120)
!1119 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1120 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1085, file: !897, line: 581, baseType: !1122, size: 64, align: 64, offset: 1088)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!947, !1010, !947, !1125, !1216}
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1128)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1129)
!1129 = !{!1130, !1134, !1136, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1170, !1172, !1173, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1128, file: !526, line: 282, baseType: !1131, size: 512, align: 64)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1030, size: 512, align: 64, elements: !1132)
!1132 = !{!1133}
!1133 = !DISubrange(count: 8)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1128, file: !526, line: 299, baseType: !1135, size: 256, align: 32, offset: 512)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 256, align: 32, elements: !1132)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1128, file: !526, line: 315, baseType: !1137, size: 64, align: 64, offset: 768)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1128, file: !526, line: 326, baseType: !947, size: 32, align: 32, offset: 832)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1128, file: !526, line: 326, baseType: !947, size: 32, align: 32, offset: 864)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1128, file: !526, line: 334, baseType: !947, size: 32, align: 32, offset: 896)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1128, file: !526, line: 341, baseType: !947, size: 32, align: 32, offset: 928)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1128, file: !526, line: 346, baseType: !947, size: 32, align: 32, offset: 960)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1128, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1128, file: !526, line: 356, baseType: !1145, size: 64, align: 32, offset: 1024)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1146, line: 61, baseType: !1147)
!1146 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1146, line: 58, size: 64, align: 32, elements: !1148)
!1148 = !{!1149, !1150}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1147, file: !1146, line: 59, baseType: !947, size: 32, align: 32)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1147, file: !1146, line: 60, baseType: !947, size: 32, align: 32, offset: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1128, file: !526, line: 361, baseType: !1035, size: 64, align: 64, offset: 1088)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1128, file: !526, line: 369, baseType: !1035, size: 64, align: 64, offset: 1152)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1128, file: !526, line: 377, baseType: !1035, size: 64, align: 64, offset: 1216)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1128, file: !526, line: 382, baseType: !947, size: 32, align: 32, offset: 1280)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1128, file: !526, line: 386, baseType: !947, size: 32, align: 32, offset: 1312)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1128, file: !526, line: 391, baseType: !947, size: 32, align: 32, offset: 1344)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1128, file: !526, line: 396, baseType: !941, size: 64, align: 64, offset: 1408)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1128, file: !526, line: 403, baseType: !1159, size: 512, align: 64, offset: 1472)
!1159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1160, size: 512, align: 64, elements: !1132)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1032, line: 55, baseType: !1120)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1128, file: !526, line: 410, baseType: !947, size: 32, align: 32, offset: 1984)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1128, file: !526, line: 415, baseType: !947, size: 32, align: 32, offset: 2016)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1128, file: !526, line: 420, baseType: !947, size: 32, align: 32, offset: 2048)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1128, file: !526, line: 425, baseType: !947, size: 32, align: 32, offset: 2080)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1128, file: !526, line: 435, baseType: !1035, size: 64, align: 64, offset: 2112)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1128, file: !526, line: 440, baseType: !947, size: 32, align: 32, offset: 2176)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1128, file: !526, line: 445, baseType: !1160, size: 64, align: 64, offset: 2240)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1128, file: !526, line: 459, baseType: !1169, size: 512, align: 64, offset: 2304)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1020, size: 512, align: 64, elements: !1132)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1128, file: !526, line: 473, baseType: !1171, size: 64, align: 64, offset: 2816)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1128, file: !526, line: 477, baseType: !947, size: 32, align: 32, offset: 2880)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1128, file: !526, line: 479, baseType: !1174, size: 64, align: 64, offset: 2944)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1178)
!1178 = !{!1179, !1180, !1181, !1182, !1187}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1177, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1177, file: !526, line: 203, baseType: !1030, size: 64, align: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1177, file: !526, line: 204, baseType: !947, size: 32, align: 32, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1177, file: !526, line: 205, baseType: !1183, size: 64, align: 64, offset: 192)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1185, line: 86, baseType: !1186)
!1185 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1186 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1185, line: 86, flags: DIFlagFwdDecl)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1177, file: !526, line: 206, baseType: !1020, size: 64, align: 64, offset: 256)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1128, file: !526, line: 480, baseType: !947, size: 32, align: 32, offset: 3008)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1128, file: !526, line: 505, baseType: !947, size: 32, align: 32, offset: 3040)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1128, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1128, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1128, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1128, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1128, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1128, file: !526, line: 532, baseType: !1035, size: 64, align: 64, offset: 3264)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1128, file: !526, line: 539, baseType: !1035, size: 64, align: 64, offset: 3328)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1128, file: !526, line: 547, baseType: !1035, size: 64, align: 64, offset: 3392)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1128, file: !526, line: 554, baseType: !1183, size: 64, align: 64, offset: 3456)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1128, file: !526, line: 563, baseType: !947, size: 32, align: 32, offset: 3520)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1128, file: !526, line: 572, baseType: !947, size: 32, align: 32, offset: 3552)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1128, file: !526, line: 581, baseType: !947, size: 32, align: 32, offset: 3584)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1128, file: !526, line: 588, baseType: !1203, size: 64, align: 64, offset: 3648)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1032, line: 36, baseType: !1205)
!1205 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1128, file: !526, line: 593, baseType: !947, size: 32, align: 32, offset: 3712)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1128, file: !526, line: 596, baseType: !947, size: 32, align: 32, offset: 3744)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1128, file: !526, line: 599, baseType: !1020, size: 64, align: 64, offset: 3776)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1128, file: !526, line: 605, baseType: !1020, size: 64, align: 64, offset: 3840)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1128, file: !526, line: 616, baseType: !1020, size: 64, align: 64, offset: 3904)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1128, file: !526, line: 626, baseType: !1118, size: 64, align: 64, offset: 3968)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1128, file: !526, line: 627, baseType: !1118, size: 64, align: 64, offset: 4032)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1128, file: !526, line: 628, baseType: !1118, size: 64, align: 64, offset: 4096)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1128, file: !526, line: 629, baseType: !1118, size: 64, align: 64, offset: 4160)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1128, file: !526, line: 645, baseType: !1020, size: 64, align: 64, offset: 4224)
!1216 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1085, file: !897, line: 587, baseType: !1071, size: 64, align: 64, offset: 1152)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1085, file: !897, line: 592, baseType: !1077, size: 64, align: 64, offset: 1216)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1085, file: !897, line: 597, baseType: !1077, size: 64, align: 64, offset: 1280)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1085, file: !897, line: 598, baseType: !55, size: 32, align: 32, offset: 1344)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1085, file: !897, line: 608, baseType: !1007, size: 64, align: 64, offset: 1408)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1085, file: !897, line: 617, baseType: !1223, size: 64, align: 64, offset: 1472)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{null, !1010}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1085, file: !897, line: 623, baseType: !1227, size: 64, align: 64, offset: 1536)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!947, !1010, !1230}
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1016)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !925, file: !897, line: 1365, baseType: !941, size: 64, align: 64, offset: 192)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !925, file: !897, line: 1379, baseType: !1234, size: 64, align: 64, offset: 256)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1236)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1237)
!1237 = !{!1238, !1239, !1240, !1241, !1242, !1243, !1244, !1248, !1249, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1265, !1266, !1270, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1288, !1289, !1290, !1291, !1295, !1296, !1297}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1236, file: !628, line: 174, baseType: !928, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1236, file: !628, line: 226, baseType: !1002, size: 64, align: 64, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1236, file: !628, line: 227, baseType: !947, size: 32, align: 32, offset: 128)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1236, file: !628, line: 228, baseType: !1002, size: 64, align: 64, offset: 192)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1236, file: !628, line: 229, baseType: !1002, size: 64, align: 64, offset: 256)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1236, file: !628, line: 233, baseType: !941, size: 64, align: 64, offset: 320)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1236, file: !628, line: 235, baseType: !1245, size: 64, align: 64, offset: 384)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!947, !941, !1030, !947}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1236, file: !628, line: 236, baseType: !1245, size: 64, align: 64, offset: 448)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1236, file: !628, line: 237, baseType: !1250, size: 64, align: 64, offset: 512)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!1035, !941, !1035, !947}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1236, file: !628, line: 238, baseType: !1035, size: 64, align: 64, offset: 576)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1236, file: !628, line: 239, baseType: !947, size: 32, align: 32, offset: 640)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1236, file: !628, line: 240, baseType: !947, size: 32, align: 32, offset: 672)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1236, file: !628, line: 241, baseType: !947, size: 32, align: 32, offset: 704)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1236, file: !628, line: 242, baseType: !1120, size: 64, align: 64, offset: 768)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1236, file: !628, line: 243, baseType: !1002, size: 64, align: 64, offset: 832)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1236, file: !628, line: 244, baseType: !1260, size: 64, align: 64, offset: 896)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!1120, !1120, !1263, !1216}
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1236, file: !628, line: 245, baseType: !947, size: 32, align: 32, offset: 960)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1236, file: !628, line: 249, baseType: !1267, size: 64, align: 64, offset: 1024)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{!947, !941, !947}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1236, file: !628, line: 255, baseType: !1271, size: 64, align: 64, offset: 1088)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!1035, !941, !947, !1035, !947}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1236, file: !628, line: 260, baseType: !947, size: 32, align: 32, offset: 1152)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1236, file: !628, line: 266, baseType: !1035, size: 64, align: 64, offset: 1216)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1236, file: !628, line: 273, baseType: !947, size: 32, align: 32, offset: 1280)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1236, file: !628, line: 279, baseType: !1035, size: 64, align: 64, offset: 1344)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1236, file: !628, line: 285, baseType: !947, size: 32, align: 32, offset: 1408)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1236, file: !628, line: 291, baseType: !947, size: 32, align: 32, offset: 1440)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1236, file: !628, line: 298, baseType: !947, size: 32, align: 32, offset: 1472)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1236, file: !628, line: 304, baseType: !947, size: 32, align: 32, offset: 1504)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1236, file: !628, line: 309, baseType: !934, size: 64, align: 64, offset: 1536)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1236, file: !628, line: 314, baseType: !934, size: 64, align: 64, offset: 1600)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1236, file: !628, line: 319, baseType: !1285, size: 64, align: 64, offset: 1664)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!947, !941, !1030, !947, !627, !1035}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1236, file: !628, line: 326, baseType: !947, size: 32, align: 32, offset: 1728)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1236, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1236, file: !628, line: 332, baseType: !1035, size: 64, align: 64, offset: 1792)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1236, file: !628, line: 338, baseType: !1292, size: 64, align: 64, offset: 1856)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{!947, !941}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1236, file: !628, line: 340, baseType: !1035, size: 64, align: 64, offset: 1920)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1236, file: !628, line: 346, baseType: !1002, size: 64, align: 64, offset: 1984)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1236, file: !628, line: 351, baseType: !947, size: 32, align: 32, offset: 2048)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !925, file: !897, line: 1386, baseType: !947, size: 32, align: 32, offset: 320)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !925, file: !897, line: 1393, baseType: !1216, size: 32, align: 32, offset: 352)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !925, file: !897, line: 1405, baseType: !1301, size: 64, align: 64, offset: 384)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1304)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1305)
!1305 = !{!1306, !1307, !1308, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1779, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1880, !1886, !1887, !1891, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1923, !1924, !1925, !1926, !1927, !1928}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1304, file: !897, line: 866, baseType: !947, size: 32, align: 32)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1304, file: !897, line: 872, baseType: !947, size: 32, align: 32, offset: 32)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1304, file: !897, line: 878, baseType: !1309, size: 64, align: 64, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !25, line: 3360, baseType: !1311)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !25, line: 1556, size: 8448, align: 64, elements: !1312)
!1312 = !{!1313, !1314, !1315, !1316, !1454, !1455, !1456, !1457, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1483, !1487, !1488, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1667, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1311, file: !25, line: 1561, baseType: !928, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1311, file: !25, line: 1562, baseType: !947, size: 32, align: 32, offset: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1311, file: !25, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1311, file: !25, line: 1565, baseType: !1317, size: 64, align: 64, offset: 128)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1319)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !25, line: 3468, size: 1984, align: 64, elements: !1320)
!1320 = !{!1321, !1322, !1323, !1324, !1325, !1326, !1329, !1332, !1335, !1338, !1341, !1342, !1343, !1351, !1352, !1353, !1355, !1359, !1365, !1370, !1374, !1375, !1419, !1426, !1430, !1431, !1435, !1439, !1443, !1447, !1448, !1449}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1319, file: !25, line: 3475, baseType: !934, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1319, file: !25, line: 3480, baseType: !934, size: 64, align: 64, offset: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1319, file: !25, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1319, file: !25, line: 3482, baseType: !55, size: 32, align: 32, offset: 160)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1319, file: !25, line: 3487, baseType: !947, size: 32, align: 32, offset: 192)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1319, file: !25, line: 3488, baseType: !1327, size: 64, align: 64, offset: 256)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1145)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1319, file: !25, line: 3489, baseType: !1330, size: 64, align: 64, offset: 320)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1319, file: !25, line: 3490, baseType: !1333, size: 64, align: 64, offset: 384)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1319, file: !25, line: 3491, baseType: !1336, size: 64, align: 64, offset: 448)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1319, file: !25, line: 3492, baseType: !1339, size: 64, align: 64, offset: 512)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1160)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1319, file: !25, line: 3493, baseType: !1031, size: 8, align: 8, offset: 576)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1319, file: !25, line: 3494, baseType: !928, size: 64, align: 64, offset: 640)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1319, file: !25, line: 3495, baseType: !1344, size: 64, align: 64, offset: 704)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1346)
!1346 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !25, line: 3404, baseType: !1347)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !25, line: 3401, size: 128, align: 64, elements: !1348)
!1348 = !{!1349, !1350}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1347, file: !25, line: 3402, baseType: !947, size: 32, align: 32)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1347, file: !25, line: 3403, baseType: !934, size: 64, align: 64, offset: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1319, file: !25, line: 3507, baseType: !934, size: 64, align: 64, offset: 768)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1319, file: !25, line: 3516, baseType: !947, size: 32, align: 32, offset: 832)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1319, file: !25, line: 3517, baseType: !1354, size: 64, align: 64, offset: 896)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1319, file: !25, line: 3527, baseType: !1356, size: 64, align: 64, offset: 960)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!947, !1309}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1319, file: !25, line: 3535, baseType: !1360, size: 64, align: 64, offset: 1024)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DISubroutineType(types: !1362)
!1362 = !{!947, !1309, !1363}
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1310)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1319, file: !25, line: 3541, baseType: !1366, size: 64, align: 64, offset: 1088)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1368)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !25, line: 3461, baseType: !1369)
!1369 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !25, line: 3461, flags: DIFlagFwdDecl)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1319, file: !25, line: 3549, baseType: !1371, size: 64, align: 64, offset: 1152)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DISubroutineType(types: !1373)
!1373 = !{null, !1354}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1319, file: !25, line: 3551, baseType: !1356, size: 64, align: 64, offset: 1216)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1319, file: !25, line: 3552, baseType: !1376, size: 64, align: 64, offset: 1280)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DISubroutineType(types: !1378)
!1378 = !{!947, !1309, !1030, !947, !1379}
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1381)
!1381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !25, line: 3920, size: 256, align: 64, elements: !1382)
!1382 = !{!1383, !1386, !1388, !1389, !1390, !1418}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1381, file: !25, line: 3921, baseType: !1384, size: 16, align: 16)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1032, line: 49, baseType: !1385)
!1385 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1381, file: !25, line: 3922, baseType: !1387, size: 32, align: 32, offset: 32)
!1387 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1032, line: 51, baseType: !1216)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1381, file: !25, line: 3923, baseType: !1387, size: 32, align: 32, offset: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1381, file: !25, line: 3924, baseType: !1216, size: 32, align: 32, offset: 96)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1381, file: !25, line: 3925, baseType: !1391, size: 64, align: 64, offset: 128)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !25, line: 3918, baseType: !1394)
!1394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !25, line: 3885, size: 1600, align: 64, elements: !1395)
!1395 = !{!1396, !1397, !1398, !1399, !1400, !1401, !1407, !1411, !1413, !1414, !1416, !1417}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1394, file: !25, line: 3886, baseType: !947, size: 32, align: 32)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1394, file: !25, line: 3887, baseType: !947, size: 32, align: 32, offset: 32)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1394, file: !25, line: 3888, baseType: !947, size: 32, align: 32, offset: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1394, file: !25, line: 3889, baseType: !947, size: 32, align: 32, offset: 96)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1394, file: !25, line: 3890, baseType: !947, size: 32, align: 32, offset: 128)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1394, file: !25, line: 3897, baseType: !1402, size: 768, align: 64, offset: 192)
!1402 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !25, line: 3858, baseType: !1403)
!1403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !25, line: 3853, size: 768, align: 64, elements: !1404)
!1404 = !{!1405, !1406}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1403, file: !25, line: 3855, baseType: !1131, size: 512, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1403, file: !25, line: 3857, baseType: !1135, size: 256, align: 32, offset: 512)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1394, file: !25, line: 3903, baseType: !1408, size: 256, align: 64, offset: 960)
!1408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1030, size: 256, align: 64, elements: !1409)
!1409 = !{!1410}
!1410 = !DISubrange(count: 4)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1394, file: !25, line: 3904, baseType: !1412, size: 128, align: 32, offset: 1216)
!1412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 128, align: 32, elements: !1409)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1394, file: !25, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1394, file: !25, line: 3908, baseType: !1415, size: 64, align: 64, offset: 1408)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1394, file: !25, line: 3915, baseType: !1415, size: 64, align: 64, offset: 1472)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1394, file: !25, line: 3917, baseType: !947, size: 32, align: 32, offset: 1536)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1381, file: !25, line: 3926, baseType: !1035, size: 64, align: 64, offset: 192)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1319, file: !25, line: 3564, baseType: !1420, size: 64, align: 64, offset: 1344)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DISubroutineType(types: !1422)
!1422 = !{!947, !1309, !1015, !1423, !1425}
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1127)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1319, file: !25, line: 3566, baseType: !1427, size: 64, align: 64, offset: 1408)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{!947, !1309, !941, !1425, !1015}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1319, file: !25, line: 3567, baseType: !1356, size: 64, align: 64, offset: 1472)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1319, file: !25, line: 3576, baseType: !1432, size: 64, align: 64, offset: 1536)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DISubroutineType(types: !1434)
!1434 = !{!947, !1309, !1423}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1319, file: !25, line: 3577, baseType: !1436, size: 64, align: 64, offset: 1600)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DISubroutineType(types: !1438)
!1438 = !{!947, !1309, !1015}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1319, file: !25, line: 3584, baseType: !1440, size: 64, align: 64, offset: 1664)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DISubroutineType(types: !1442)
!1442 = !{!947, !1309, !1126}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1319, file: !25, line: 3589, baseType: !1444, size: 64, align: 64, offset: 1728)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DISubroutineType(types: !1446)
!1446 = !{null, !1309}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1319, file: !25, line: 3594, baseType: !947, size: 32, align: 32, offset: 1792)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1319, file: !25, line: 3600, baseType: !934, size: 64, align: 64, offset: 1856)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1319, file: !25, line: 3609, baseType: !1450, size: 64, align: 64, offset: 1920)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64, align: 64)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1453)
!1453 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !25, line: 3609, flags: DIFlagFwdDecl)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1311, file: !25, line: 1566, baseType: !55, size: 32, align: 32, offset: 192)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1311, file: !25, line: 1581, baseType: !1216, size: 32, align: 32, offset: 224)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1311, file: !25, line: 1583, baseType: !941, size: 64, align: 64, offset: 256)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1311, file: !25, line: 1591, baseType: !1458, size: 64, align: 64, offset: 320)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !25, line: 1532, flags: DIFlagFwdDecl)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1311, file: !25, line: 1598, baseType: !941, size: 64, align: 64, offset: 384)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1311, file: !25, line: 1606, baseType: !1035, size: 64, align: 64, offset: 448)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1311, file: !25, line: 1614, baseType: !947, size: 32, align: 32, offset: 512)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1311, file: !25, line: 1622, baseType: !947, size: 32, align: 32, offset: 544)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1311, file: !25, line: 1628, baseType: !947, size: 32, align: 32, offset: 576)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1311, file: !25, line: 1636, baseType: !947, size: 32, align: 32, offset: 608)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1311, file: !25, line: 1643, baseType: !947, size: 32, align: 32, offset: 640)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1311, file: !25, line: 1657, baseType: !1030, size: 64, align: 64, offset: 704)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1311, file: !25, line: 1658, baseType: !947, size: 32, align: 32, offset: 768)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1311, file: !25, line: 1679, baseType: !1145, size: 64, align: 32, offset: 800)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1311, file: !25, line: 1688, baseType: !947, size: 32, align: 32, offset: 864)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1311, file: !25, line: 1712, baseType: !947, size: 32, align: 32, offset: 896)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1311, file: !25, line: 1729, baseType: !947, size: 32, align: 32, offset: 928)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1311, file: !25, line: 1729, baseType: !947, size: 32, align: 32, offset: 960)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1311, file: !25, line: 1744, baseType: !947, size: 32, align: 32, offset: 992)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1311, file: !25, line: 1744, baseType: !947, size: 32, align: 32, offset: 1024)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1311, file: !25, line: 1751, baseType: !947, size: 32, align: 32, offset: 1056)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1311, file: !25, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1311, file: !25, line: 1791, baseType: !1479, size: 64, align: 64, offset: 1152)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{null, !1482, !1423, !1425, !947, !947, !947}
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1311, file: !25, line: 1808, baseType: !1484, size: 64, align: 64, offset: 1216)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{!645, !1482, !1330}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1311, file: !25, line: 1816, baseType: !947, size: 32, align: 32, offset: 1280)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1311, file: !25, line: 1825, baseType: !1489, size: 32, align: 32, offset: 1312)
!1489 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1311, file: !25, line: 1830, baseType: !947, size: 32, align: 32, offset: 1344)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1311, file: !25, line: 1838, baseType: !1489, size: 32, align: 32, offset: 1376)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1311, file: !25, line: 1846, baseType: !947, size: 32, align: 32, offset: 1408)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1311, file: !25, line: 1851, baseType: !947, size: 32, align: 32, offset: 1440)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1311, file: !25, line: 1861, baseType: !1489, size: 32, align: 32, offset: 1472)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1311, file: !25, line: 1868, baseType: !1489, size: 32, align: 32, offset: 1504)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1311, file: !25, line: 1875, baseType: !1489, size: 32, align: 32, offset: 1536)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1311, file: !25, line: 1882, baseType: !1489, size: 32, align: 32, offset: 1568)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1311, file: !25, line: 1889, baseType: !1489, size: 32, align: 32, offset: 1600)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1311, file: !25, line: 1896, baseType: !1489, size: 32, align: 32, offset: 1632)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1311, file: !25, line: 1903, baseType: !1489, size: 32, align: 32, offset: 1664)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1311, file: !25, line: 1910, baseType: !947, size: 32, align: 32, offset: 1696)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1311, file: !25, line: 1915, baseType: !947, size: 32, align: 32, offset: 1728)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1311, file: !25, line: 1926, baseType: !1425, size: 64, align: 64, offset: 1792)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1311, file: !25, line: 1935, baseType: !1145, size: 64, align: 32, offset: 1856)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1311, file: !25, line: 1942, baseType: !947, size: 32, align: 32, offset: 1920)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1311, file: !25, line: 1948, baseType: !947, size: 32, align: 32, offset: 1952)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1311, file: !25, line: 1954, baseType: !947, size: 32, align: 32, offset: 1984)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1311, file: !25, line: 1960, baseType: !947, size: 32, align: 32, offset: 2016)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1311, file: !25, line: 1984, baseType: !947, size: 32, align: 32, offset: 2048)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1311, file: !25, line: 1991, baseType: !947, size: 32, align: 32, offset: 2080)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1311, file: !25, line: 1996, baseType: !947, size: 32, align: 32, offset: 2112)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1311, file: !25, line: 2004, baseType: !947, size: 32, align: 32, offset: 2144)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1311, file: !25, line: 2011, baseType: !947, size: 32, align: 32, offset: 2176)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1311, file: !25, line: 2018, baseType: !947, size: 32, align: 32, offset: 2208)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1311, file: !25, line: 2027, baseType: !947, size: 32, align: 32, offset: 2240)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1311, file: !25, line: 2034, baseType: !947, size: 32, align: 32, offset: 2272)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1311, file: !25, line: 2044, baseType: !947, size: 32, align: 32, offset: 2304)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1311, file: !25, line: 2054, baseType: !1519, size: 64, align: 64, offset: 2368)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1311, file: !25, line: 2061, baseType: !1519, size: 64, align: 64, offset: 2432)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1311, file: !25, line: 2066, baseType: !947, size: 32, align: 32, offset: 2496)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1311, file: !25, line: 2070, baseType: !947, size: 32, align: 32, offset: 2528)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1311, file: !25, line: 2078, baseType: !947, size: 32, align: 32, offset: 2560)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1311, file: !25, line: 2085, baseType: !947, size: 32, align: 32, offset: 2592)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1311, file: !25, line: 2092, baseType: !947, size: 32, align: 32, offset: 2624)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1311, file: !25, line: 2099, baseType: !947, size: 32, align: 32, offset: 2656)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1311, file: !25, line: 2106, baseType: !947, size: 32, align: 32, offset: 2688)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1311, file: !25, line: 2113, baseType: !947, size: 32, align: 32, offset: 2720)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1311, file: !25, line: 2120, baseType: !947, size: 32, align: 32, offset: 2752)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1311, file: !25, line: 2125, baseType: !947, size: 32, align: 32, offset: 2784)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1311, file: !25, line: 2133, baseType: !947, size: 32, align: 32, offset: 2816)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1311, file: !25, line: 2140, baseType: !947, size: 32, align: 32, offset: 2848)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1311, file: !25, line: 2145, baseType: !947, size: 32, align: 32, offset: 2880)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1311, file: !25, line: 2153, baseType: !947, size: 32, align: 32, offset: 2912)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1311, file: !25, line: 2158, baseType: !947, size: 32, align: 32, offset: 2944)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1311, file: !25, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1311, file: !25, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1311, file: !25, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1311, file: !25, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1311, file: !25, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1311, file: !25, line: 2203, baseType: !947, size: 32, align: 32, offset: 3136)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1311, file: !25, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1311, file: !25, line: 2212, baseType: !947, size: 32, align: 32, offset: 3200)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1311, file: !25, line: 2213, baseType: !947, size: 32, align: 32, offset: 3232)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1311, file: !25, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1311, file: !25, line: 2232, baseType: !947, size: 32, align: 32, offset: 3296)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1311, file: !25, line: 2243, baseType: !947, size: 32, align: 32, offset: 3328)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1311, file: !25, line: 2249, baseType: !947, size: 32, align: 32, offset: 3360)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1311, file: !25, line: 2256, baseType: !947, size: 32, align: 32, offset: 3392)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1311, file: !25, line: 2263, baseType: !1160, size: 64, align: 64, offset: 3456)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1311, file: !25, line: 2270, baseType: !1160, size: 64, align: 64, offset: 3520)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1311, file: !25, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1311, file: !25, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1311, file: !25, line: 2367, baseType: !1555, size: 64, align: 64, offset: 3648)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1556 = !DISubroutineType(types: !1557)
!1557 = !{!947, !1482, !1126, !947}
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1311, file: !25, line: 2383, baseType: !947, size: 32, align: 32, offset: 3712)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1311, file: !25, line: 2386, baseType: !1489, size: 32, align: 32, offset: 3744)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1311, file: !25, line: 2387, baseType: !1489, size: 32, align: 32, offset: 3776)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1311, file: !25, line: 2394, baseType: !947, size: 32, align: 32, offset: 3808)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1311, file: !25, line: 2401, baseType: !947, size: 32, align: 32, offset: 3840)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1311, file: !25, line: 2408, baseType: !947, size: 32, align: 32, offset: 3872)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1311, file: !25, line: 2415, baseType: !947, size: 32, align: 32, offset: 3904)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1311, file: !25, line: 2422, baseType: !947, size: 32, align: 32, offset: 3936)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1311, file: !25, line: 2423, baseType: !1567, size: 64, align: 64, offset: 3968)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !25, line: 831, baseType: !1569)
!1569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !25, line: 826, size: 128, align: 32, elements: !1570)
!1570 = !{!1571, !1572, !1573, !1574}
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1569, file: !25, line: 827, baseType: !947, size: 32, align: 32)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1569, file: !25, line: 828, baseType: !947, size: 32, align: 32, offset: 32)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1569, file: !25, line: 829, baseType: !947, size: 32, align: 32, offset: 64)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1569, file: !25, line: 830, baseType: !1489, size: 32, align: 32, offset: 96)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1311, file: !25, line: 2430, baseType: !1035, size: 64, align: 64, offset: 4032)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1311, file: !25, line: 2437, baseType: !1035, size: 64, align: 64, offset: 4096)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1311, file: !25, line: 2444, baseType: !1489, size: 32, align: 32, offset: 4160)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1311, file: !25, line: 2451, baseType: !1489, size: 32, align: 32, offset: 4192)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1311, file: !25, line: 2458, baseType: !947, size: 32, align: 32, offset: 4224)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1311, file: !25, line: 2469, baseType: !947, size: 32, align: 32, offset: 4256)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1311, file: !25, line: 2475, baseType: !947, size: 32, align: 32, offset: 4288)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1311, file: !25, line: 2481, baseType: !947, size: 32, align: 32, offset: 4320)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1311, file: !25, line: 2485, baseType: !947, size: 32, align: 32, offset: 4352)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1311, file: !25, line: 2489, baseType: !947, size: 32, align: 32, offset: 4384)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1311, file: !25, line: 2493, baseType: !947, size: 32, align: 32, offset: 4416)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1311, file: !25, line: 2501, baseType: !947, size: 32, align: 32, offset: 4448)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1311, file: !25, line: 2506, baseType: !947, size: 32, align: 32, offset: 4480)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1311, file: !25, line: 2510, baseType: !947, size: 32, align: 32, offset: 4512)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1311, file: !25, line: 2514, baseType: !1035, size: 64, align: 64, offset: 4544)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1311, file: !25, line: 2528, baseType: !1591, size: 64, align: 64, offset: 4608)
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64, align: 64)
!1592 = !DISubroutineType(types: !1593)
!1593 = !{null, !1482, !941, !947, !947}
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1311, file: !25, line: 2534, baseType: !947, size: 32, align: 32, offset: 4672)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1311, file: !25, line: 2545, baseType: !947, size: 32, align: 32, offset: 4704)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1311, file: !25, line: 2547, baseType: !947, size: 32, align: 32, offset: 4736)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1311, file: !25, line: 2549, baseType: !947, size: 32, align: 32, offset: 4768)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1311, file: !25, line: 2551, baseType: !947, size: 32, align: 32, offset: 4800)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1311, file: !25, line: 2553, baseType: !947, size: 32, align: 32, offset: 4832)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1311, file: !25, line: 2555, baseType: !947, size: 32, align: 32, offset: 4864)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1311, file: !25, line: 2557, baseType: !947, size: 32, align: 32, offset: 4896)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1311, file: !25, line: 2559, baseType: !947, size: 32, align: 32, offset: 4928)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1311, file: !25, line: 2563, baseType: !947, size: 32, align: 32, offset: 4960)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1311, file: !25, line: 2571, baseType: !1415, size: 64, align: 64, offset: 4992)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1311, file: !25, line: 2579, baseType: !1415, size: 64, align: 64, offset: 5056)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1311, file: !25, line: 2586, baseType: !947, size: 32, align: 32, offset: 5120)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1311, file: !25, line: 2615, baseType: !947, size: 32, align: 32, offset: 5152)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1311, file: !25, line: 2627, baseType: !947, size: 32, align: 32, offset: 5184)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1311, file: !25, line: 2637, baseType: !947, size: 32, align: 32, offset: 5216)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1311, file: !25, line: 2681, baseType: !947, size: 32, align: 32, offset: 5248)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1311, file: !25, line: 2709, baseType: !1035, size: 64, align: 64, offset: 5312)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1311, file: !25, line: 2716, baseType: !1613, size: 64, align: 64, offset: 5376)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1615)
!1615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !25, line: 3636, size: 896, align: 64, elements: !1616)
!1616 = !{!1617, !1618, !1619, !1620, !1621, !1622, !1623, !1627, !1631, !1632, !1633, !1634, !1640, !1641, !1642, !1643, !1644}
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1615, file: !25, line: 3642, baseType: !934, size: 64, align: 64)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1615, file: !25, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1615, file: !25, line: 3656, baseType: !55, size: 32, align: 32, offset: 96)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1615, file: !25, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1615, file: !25, line: 3669, baseType: !947, size: 32, align: 32, offset: 160)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1615, file: !25, line: 3682, baseType: !1440, size: 64, align: 64, offset: 192)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1615, file: !25, line: 3698, baseType: !1624, size: 64, align: 64, offset: 256)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DISubroutineType(types: !1626)
!1626 = !{!947, !1309, !1263, !1387}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1615, file: !25, line: 3712, baseType: !1628, size: 64, align: 64, offset: 320)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64, align: 64)
!1629 = !DISubroutineType(types: !1630)
!1630 = !{!947, !1309, !947, !1263, !1387}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1615, file: !25, line: 3726, baseType: !1624, size: 64, align: 64, offset: 384)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1615, file: !25, line: 3737, baseType: !1356, size: 64, align: 64, offset: 448)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1615, file: !25, line: 3746, baseType: !947, size: 32, align: 32, offset: 512)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1615, file: !25, line: 3757, baseType: !1635, size: 64, align: 64, offset: 576)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DISubroutineType(types: !1637)
!1637 = !{null, !1638}
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64, align: 64)
!1639 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !25, line: 3617, flags: DIFlagFwdDecl)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1615, file: !25, line: 3766, baseType: !1356, size: 64, align: 64, offset: 640)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1615, file: !25, line: 3774, baseType: !1356, size: 64, align: 64, offset: 704)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1615, file: !25, line: 3780, baseType: !947, size: 32, align: 32, offset: 768)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1615, file: !25, line: 3785, baseType: !947, size: 32, align: 32, offset: 800)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1615, file: !25, line: 3795, baseType: !1645, size: 64, align: 64, offset: 832)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{!947, !1309, !1020}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1311, file: !25, line: 2728, baseType: !941, size: 64, align: 64, offset: 5440)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1311, file: !25, line: 2735, baseType: !1159, size: 512, align: 64, offset: 5504)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1311, file: !25, line: 2742, baseType: !947, size: 32, align: 32, offset: 6016)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1311, file: !25, line: 2755, baseType: !947, size: 32, align: 32, offset: 6048)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1311, file: !25, line: 2776, baseType: !947, size: 32, align: 32, offset: 6080)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1311, file: !25, line: 2783, baseType: !947, size: 32, align: 32, offset: 6112)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1311, file: !25, line: 2791, baseType: !947, size: 32, align: 32, offset: 6144)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1311, file: !25, line: 2802, baseType: !1126, size: 64, align: 64, offset: 6208)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1311, file: !25, line: 2811, baseType: !947, size: 32, align: 32, offset: 6272)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1311, file: !25, line: 2821, baseType: !947, size: 32, align: 32, offset: 6304)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1311, file: !25, line: 2830, baseType: !947, size: 32, align: 32, offset: 6336)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1311, file: !25, line: 2840, baseType: !947, size: 32, align: 32, offset: 6368)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1311, file: !25, line: 2851, baseType: !1661, size: 64, align: 64, offset: 6400)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64, align: 64)
!1662 = !DISubroutineType(types: !1663)
!1663 = !{!947, !1482, !1664, !941, !1425, !947, !947}
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64, align: 64)
!1665 = !DISubroutineType(types: !1666)
!1666 = !{!947, !1482, !941}
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1311, file: !25, line: 2871, baseType: !1668, size: 64, align: 64, offset: 6464)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DISubroutineType(types: !1670)
!1670 = !{!947, !1482, !1671, !941, !1425, !947}
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DISubroutineType(types: !1673)
!1673 = !{!947, !1482, !941, !947, !947}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1311, file: !25, line: 2878, baseType: !947, size: 32, align: 32, offset: 6528)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1311, file: !25, line: 2885, baseType: !947, size: 32, align: 32, offset: 6560)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1311, file: !25, line: 3005, baseType: !947, size: 32, align: 32, offset: 6592)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1311, file: !25, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1311, file: !25, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1311, file: !25, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1311, file: !25, line: 3037, baseType: !1030, size: 64, align: 64, offset: 6720)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1311, file: !25, line: 3038, baseType: !947, size: 32, align: 32, offset: 6784)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1311, file: !25, line: 3050, baseType: !1160, size: 64, align: 64, offset: 6848)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1311, file: !25, line: 3065, baseType: !947, size: 32, align: 32, offset: 6912)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1311, file: !25, line: 3083, baseType: !947, size: 32, align: 32, offset: 6944)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1311, file: !25, line: 3092, baseType: !1145, size: 64, align: 32, offset: 6976)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1311, file: !25, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1311, file: !25, line: 3106, baseType: !1145, size: 64, align: 32, offset: 7072)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1311, file: !25, line: 3113, baseType: !1689, size: 64, align: 64, offset: 7168)
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64, align: 64)
!1690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1691)
!1691 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !25, line: 740, baseType: !1692)
!1692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !25, line: 712, size: 384, align: 64, elements: !1693)
!1693 = !{!1694, !1695, !1696, !1697, !1698, !1699, !1702}
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1692, file: !25, line: 713, baseType: !55, size: 32, align: 32)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1692, file: !25, line: 714, baseType: !636, size: 32, align: 32, offset: 32)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1692, file: !25, line: 720, baseType: !934, size: 64, align: 64, offset: 64)
