; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mpeg12enc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mpeg12enc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RLTable = type { i32, i32, [2 x i16]*, i8*, i8*, [2 x i8*], [2 x i8*], [2 x i8*], [32 x %struct.RL_VLC_ELEM*] }
%struct.RL_VLC_ELEM = type { i16, i8, i8 }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!871 = !{!872, !873, !874, !875, !876, !877, !878, !879}
!872 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!873 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!874 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!875 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!876 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!877 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!878 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!879 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!880 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !57, line: 1534, size: 32, align: 32, elements: !881)
!881 = !{!882, !883, !884, !885, !886, !887}
!882 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!883 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!884 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!885 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!886 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!887 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!888 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !57, line: 810, size: 32, align: 32, elements: !889)
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899}
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!894 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!895 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!896 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!897 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!898 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !57, line: 798, size: 32, align: 32, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908}
!902 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!903 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!904 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!905 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!906 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!907 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!908 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OutputFormat", file: !910, line: 123, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/mpegutils.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!911 = !{!912, !913, !914, !915}
!912 = !DIEnumerator(name: "FMT_MPEG1", value: 0)
!913 = !DIEnumerator(name: "FMT_H261", value: 1)
!914 = !DIEnumerator(name: "FMT_H263", value: 2)
!915 = !DIEnumerator(name: "FMT_MJPEG", value: 3)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !917, line: 37, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!918 = !{!919, !920, !921, !922, !923, !924}
!919 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!920 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!921 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!922 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!923 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!924 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!925 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStereo3DType", file: !926, line: 51, size: 32, align: 32, elements: !927)
!926 = !DIFile(filename: "./libavutil/stereo3d.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!927 = !{!928, !929, !930, !931, !932, !933, !934, !935}
!928 = !DIEnumerator(name: "AV_STEREO3D_2D", value: 0)
!929 = !DIEnumerator(name: "AV_STEREO3D_SIDEBYSIDE", value: 1)
!930 = !DIEnumerator(name: "AV_STEREO3D_TOPBOTTOM", value: 2)
!931 = !DIEnumerator(name: "AV_STEREO3D_FRAMESEQUENCE", value: 3)
!932 = !DIEnumerator(name: "AV_STEREO3D_CHECKERBOARD", value: 4)
!933 = !DIEnumerator(name: "AV_STEREO3D_SIDEBYSIDE_QUINCUNX", value: 5)
!934 = !DIEnumerator(name: "AV_STEREO3D_LINES", value: 6)
!935 = !DIEnumerator(name: "AV_STEREO3D_COLUMNS", value: 7)
!936 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStereo3DView", file: !926, line: 147, size: 32, align: 32, elements: !937)
!937 = !{!938, !939, !940}
!938 = !DIEnumerator(name: "AV_STEREO3D_VIEW_PACKED", value: 0)
!939 = !DIEnumerator(name: "AV_STEREO3D_VIEW_LEFT", value: 1)
!940 = !DIEnumerator(name: "AV_STEREO3D_VIEW_RIGHT", value: 2)
!941 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVTimecodeFlag", file: !942, line: 35, size: 32, align: 32, elements: !943)
!942 = !DIFile(filename: "./libavutil/timecode.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!943 = !{!944, !945, !946}
!944 = !DIEnumerator(name: "AV_TIMECODE_FLAG_DROPFRAME", value: 1)
!945 = !DIEnumerator(name: "AV_TIMECODE_FLAG_24HOURSMAX", value: 2)
!946 = !DIEnumerator(name: "AV_TIMECODE_FLAG_ALLOWNEGATIVE", value: 4)
!947 = !{!948, !949, !957, !965, !962, !964, !979, !955}
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStereo3D", file: !926, line: 191, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStereo3D", file: !926, line: 176, size: 96, align: 32, elements: !952)
!952 = !{!953, !954, !956}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !951, file: !926, line: 180, baseType: !925, size: 32, align: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !951, file: !926, line: 185, baseType: !955, size: 32, align: 32, offset: 32)
!955 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !951, file: !926, line: 190, baseType: !936, size: 32, align: 32, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !959, line: 221, size: 32, align: 8, elements: !960)
!959 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!960 = !{!961}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !958, file: !959, line: 221, baseType: !962, size: 32, align: 32)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !963, line: 51, baseType: !964)
!963 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!964 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPanScan", file: !57, line: 1112, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPanScan", file: !57, line: 1090, size: 192, align: 32, elements: !968)
!968 = !{!969, !970, !971, !972}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !967, file: !57, line: 1096, baseType: !955, size: 32, align: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !967, file: !57, line: 1103, baseType: !955, size: 32, align: 32, offset: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !967, file: !57, line: 1104, baseType: !955, size: 32, align: 32, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !967, file: !57, line: 1111, baseType: !973, size: 96, align: 16, offset: 96)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !974, size: 96, align: 16, elements: !976)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !963, line: 37, baseType: !975)
!975 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!976 = !{!977, !978}
!977 = !DISubrange(count: 3)
!978 = !DISubrange(count: 2)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !963, line: 40, baseType: !980)
!980 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!981 = !{!982, !2637, !2639, !2640, !2643, !2647, !2651, !2652, !2656, !2657, !2659, !2661, !2665, !2666, !2670, !2671}
!982 = distinct !DIGlobalVariable(name: "done", scope: !983, file: !984, line: 1005, type: !955, isLocal: true, isDefinition: true, variable: i32* @ff_mpeg1_encode_init.done)
!983 = distinct !DISubprogram(name: "ff_mpeg1_encode_init", scope: !984, file: !984, line: 1003, type: !985, isLocal: false, isDefinition: true, scopeLine: 1004, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2636)
!984 = !DIFile(filename: "libavcodec/mpeg12enc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!985 = !DISubroutineType(types: !986)
!986 = !{null, !987}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "MpegEncContext", file: !989, line: 582, baseType: !990)
!989 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !989, line: 81, size: 86208, align: 64, elements: !991)
!991 = !{!992, !1073, !1074, !1075, !1076, !1080, !1081, !1095, !1096, !1097, !1098, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1805, !1806, !1858, !1860, !1861, !1862, !1863, !1864, !1875, !1876, !1877, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1892, !1894, !1896, !1897, !1898, !1899, !1900, !1901, !1906, !1908, !1909, !1910, !1911, !1912, !1913, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1940, !1941, !1942, !1943, !1959, !1966, !1978, !1994, !2016, !2056, !2069, !2096, !2111, !2125, !2138, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2159, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2172, !2174, !2175, !2176, !2177, !2178, !2179, !2182, !2184, !2186, !2187, !2190, !2249, !2250, !2251, !2252, !2253, !2254, !2255, !2257, !2258, !2260, !2261, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2283, !2284, !2285, !2288, !2289, !2290, !2291, !2293, !2295, !2296, !2297, !2298, !2299, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2381, !2382, !2383, !2397, !2398, !2399, !2400, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2445, !2446, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2464, !2469, !2470, !2471, !2472, !2473, !2474, !2475, !2476, !2477, !2478, !2479, !2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488, !2489, !2490, !2491, !2492, !2493, !2494, !2495, !2496, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2511, !2512, !2513, !2514, !2518, !2519, !2523, !2527, !2531, !2532, !2537, !2541, !2542, !2543, !2544, !2545, !2546, !2547, !2548, !2552, !2553, !2557, !2558, !2559, !2560, !2561, !2562, !2563, !2564, !2565, !2566, !2567, !2568, !2569, !2571, !2572, !2573, !2623, !2624, !2628, !2629, !2630, !2631, !2632, !2633, !2634, !2635}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !990, file: !989, line: 82, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !996)
!996 = !{!997, !1001, !1005, !1032, !1033, !1034, !1035, !1039, !1045, !1047, !1051}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !995, file: !26, line: 72, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1000)
!1000 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !995, file: !26, line: 78, baseType: !1002, size: 64, align: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!998, !948}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !995, file: !26, line: 85, baseType: !1006, size: 64, align: 64, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !1009)
!1009 = !{!1010, !1011, !1012, !1013, !1014, !1028, !1029, !1030, !1031}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1008, file: !4, line: 247, baseType: !998, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1008, file: !4, line: 253, baseType: !998, size: 64, align: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1008, file: !4, line: 259, baseType: !955, size: 32, align: 32, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1008, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1008, file: !4, line: 271, baseType: !1015, size: 64, align: 64, offset: 192)
!1015 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1008, file: !4, line: 265, size: 64, align: 64, elements: !1016)
!1016 = !{!1017, !1018, !1020, !1021}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1015, file: !4, line: 266, baseType: !979, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1015, file: !4, line: 267, baseType: !1019, size: 64, align: 64)
!1019 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1015, file: !4, line: 268, baseType: !998, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1015, file: !4, line: 270, baseType: !1022, size: 64, align: 32)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1023, line: 61, baseType: !1024)
!1023 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1023, line: 58, size: 64, align: 32, elements: !1025)
!1025 = !{!1026, !1027}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1024, file: !1023, line: 59, baseType: !955, size: 32, align: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1024, file: !1023, line: 60, baseType: !955, size: 32, align: 32, offset: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1008, file: !4, line: 272, baseType: !1019, size: 64, align: 64, offset: 256)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1008, file: !4, line: 273, baseType: !1019, size: 64, align: 64, offset: 320)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1008, file: !4, line: 275, baseType: !955, size: 32, align: 32, offset: 384)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1008, file: !4, line: 300, baseType: !998, size: 64, align: 64, offset: 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !995, file: !26, line: 93, baseType: !955, size: 32, align: 32, offset: 192)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !995, file: !26, line: 99, baseType: !955, size: 32, align: 32, offset: 224)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !995, file: !26, line: 108, baseType: !955, size: 32, align: 32, offset: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !995, file: !26, line: 113, baseType: !1036, size: 64, align: 64, offset: 320)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!948, !948, !948}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !995, file: !26, line: 123, baseType: !1040, size: 64, align: 64, offset: 384)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!1043, !1043}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !995, file: !26, line: 130, baseType: !1046, size: 32, align: 32, offset: 448)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !995, file: !26, line: 136, baseType: !1048, size: 64, align: 64, offset: 512)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!1046, !948}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !995, file: !26, line: 142, baseType: !1052, size: 64, align: 64, offset: 576)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!955, !1055, !948, !998, !955}
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1058)
!1058 = !{!1059, !1071, !1072}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1057, file: !4, line: 360, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1064)
!1064 = !{!1065, !1066, !1067, !1068, !1069, !1070}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1063, file: !4, line: 307, baseType: !998, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1063, file: !4, line: 313, baseType: !1019, size: 64, align: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1063, file: !4, line: 313, baseType: !1019, size: 64, align: 64, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1063, file: !4, line: 318, baseType: !1019, size: 64, align: 64, offset: 192)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1063, file: !4, line: 318, baseType: !1019, size: 64, align: 64, offset: 256)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1063, file: !4, line: 323, baseType: !955, size: 32, align: 32, offset: 320)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1057, file: !4, line: 364, baseType: !955, size: 32, align: 32, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1057, file: !4, line: 368, baseType: !955, size: 32, align: 32, offset: 96)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !990, file: !989, line: 84, baseType: !955, size: 32, align: 32, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !990, file: !989, line: 84, baseType: !955, size: 32, align: 32, offset: 96)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !990, file: !989, line: 85, baseType: !955, size: 32, align: 32, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !990, file: !989, line: 86, baseType: !1077, size: 384, align: 32, offset: 160)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 384, align: 32, elements: !1078)
!1078 = !{!1079}
!1079 = !DISubrange(count: 12)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !990, file: !989, line: 87, baseType: !955, size: 32, align: 32, offset: 544)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !990, file: !989, line: 90, baseType: !1082, size: 1088, align: 64, offset: 576)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !917, line: 35, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !917, line: 31, size: 1088, align: 64, elements: !1084)
!1084 = !{!1085, !1090, !1094}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1083, file: !917, line: 32, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1088)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !963, line: 48, baseType: !1089)
!1089 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1083, file: !917, line: 33, baseType: !1091, size: 512, align: 8, offset: 64)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1088, size: 512, align: 8, elements: !1092)
!1092 = !{!1093}
!1093 = !DISubrange(count: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1083, file: !917, line: 34, baseType: !1091, size: 512, align: 8, offset: 576)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !990, file: !989, line: 91, baseType: !1082, size: 1088, align: 64, offset: 1664)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !990, file: !989, line: 92, baseType: !1082, size: 1088, align: 64, offset: 2752)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !990, file: !989, line: 93, baseType: !1082, size: 1088, align: 64, offset: 3840)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !990, file: !989, line: 98, baseType: !1099, size: 64, align: 64, offset: 4928)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1101)
!1101 = !{!1102, !1105, !1106, !1107, !1372, !1373, !1374, !1375, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1527, !1531, !1532, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1710, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1100, file: !57, line: 1561, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1100, file: !57, line: 1562, baseType: !955, size: 32, align: 32, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1100, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1100, file: !57, line: 1565, baseType: !1108, size: 64, align: 64, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1110)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1111)
!1111 = !{!1112, !1113, !1114, !1115, !1116, !1117, !1120, !1123, !1126, !1129, !1134, !1135, !1136, !1144, !1145, !1146, !1148, !1154, !1160, !1169, !1173, !1174, !1222, !1343, !1347, !1348, !1352, !1356, !1361, !1365, !1366, !1367}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1110, file: !57, line: 3475, baseType: !998, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1110, file: !57, line: 3480, baseType: !998, size: 64, align: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1110, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1110, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1110, file: !57, line: 3487, baseType: !955, size: 32, align: 32, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1110, file: !57, line: 3488, baseType: !1118, size: 64, align: 64, offset: 256)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1022)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1110, file: !57, line: 3489, baseType: !1121, size: 64, align: 64, offset: 320)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1110, file: !57, line: 3490, baseType: !1124, size: 64, align: 64, offset: 384)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1110, file: !57, line: 3491, baseType: !1127, size: 64, align: 64, offset: 448)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1110, file: !57, line: 3492, baseType: !1130, size: 64, align: 64, offset: 512)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1132)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !963, line: 55, baseType: !1133)
!1133 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1110, file: !57, line: 3493, baseType: !1088, size: 8, align: 8, offset: 576)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1110, file: !57, line: 3494, baseType: !1103, size: 64, align: 64, offset: 640)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1110, file: !57, line: 3495, baseType: !1137, size: 64, align: 64, offset: 704)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1139)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1141)
!1141 = !{!1142, !1143}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1140, file: !57, line: 3402, baseType: !955, size: 32, align: 32)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1140, file: !57, line: 3403, baseType: !998, size: 64, align: 64, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1110, file: !57, line: 3507, baseType: !998, size: 64, align: 64, offset: 768)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1110, file: !57, line: 3516, baseType: !955, size: 32, align: 32, offset: 832)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1110, file: !57, line: 3517, baseType: !1147, size: 64, align: 64, offset: 896)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1110, file: !57, line: 3527, baseType: !1149, size: 64, align: 64, offset: 960)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!955, !1152}
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1100)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1110, file: !57, line: 3535, baseType: !1155, size: 64, align: 64, offset: 1024)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!955, !1152, !1158}
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1153)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1110, file: !57, line: 3541, baseType: !1161, size: 64, align: 64, offset: 1088)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1163)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1165, line: 223, size: 128, align: 64, elements: !1166)
!1165 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1166 = !{!1167, !1168}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1164, file: !1165, line: 224, baseType: !1086, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1164, file: !1165, line: 225, baseType: !1086, size: 64, align: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1110, file: !57, line: 3549, baseType: !1170, size: 64, align: 64, offset: 1152)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{null, !1147}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1110, file: !57, line: 3551, baseType: !1149, size: 64, align: 64, offset: 1216)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1110, file: !57, line: 3552, baseType: !1175, size: 64, align: 64, offset: 1280)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!955, !1152, !1178, !955, !1179}
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1182)
!1182 = !{!1183, !1186, !1187, !1188, !1189, !1221}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1181, file: !57, line: 3921, baseType: !1184, size: 16, align: 16)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !963, line: 49, baseType: !1185)
!1185 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1181, file: !57, line: 3922, baseType: !962, size: 32, align: 32, offset: 32)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1181, file: !57, line: 3923, baseType: !962, size: 32, align: 32, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1181, file: !57, line: 3924, baseType: !964, size: 32, align: 32, offset: 96)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1181, file: !57, line: 3925, baseType: !1190, size: 64, align: 64, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1194)
!1194 = !{!1195, !1196, !1197, !1198, !1199, !1200, !1210, !1214, !1216, !1217, !1219, !1220}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1193, file: !57, line: 3886, baseType: !955, size: 32, align: 32)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1193, file: !57, line: 3887, baseType: !955, size: 32, align: 32, offset: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1193, file: !57, line: 3888, baseType: !955, size: 32, align: 32, offset: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1193, file: !57, line: 3889, baseType: !955, size: 32, align: 32, offset: 96)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1193, file: !57, line: 3890, baseType: !955, size: 32, align: 32, offset: 128)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1193, file: !57, line: 3897, baseType: !1201, size: 768, align: 64, offset: 192)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1202)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1203)
!1203 = !{!1204, !1208}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1202, file: !57, line: 3855, baseType: !1205, size: 512, align: 64)
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1178, size: 512, align: 64, elements: !1206)
!1206 = !{!1207}
!1207 = !DISubrange(count: 8)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1202, file: !57, line: 3857, baseType: !1209, size: 256, align: 32, offset: 512)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 256, align: 32, elements: !1206)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1193, file: !57, line: 3903, baseType: !1211, size: 256, align: 64, offset: 960)
!1211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1178, size: 256, align: 64, elements: !1212)
!1212 = !{!1213}
!1213 = !DISubrange(count: 4)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1193, file: !57, line: 3904, baseType: !1215, size: 128, align: 32, offset: 1216)
!1215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 128, align: 32, elements: !1212)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1193, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1193, file: !57, line: 3908, baseType: !1218, size: 64, align: 64, offset: 1408)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1193, file: !57, line: 3915, baseType: !1218, size: 64, align: 64, offset: 1472)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1193, file: !57, line: 3917, baseType: !955, size: 32, align: 32, offset: 1536)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1181, file: !57, line: 3926, baseType: !979, size: 64, align: 64, offset: 192)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1110, file: !57, line: 3564, baseType: !1223, size: 64, align: 64, offset: 1344)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!955, !1152, !1226, !1260, !1342}
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1228)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1229)
!1229 = !{!1230, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1256, !1257, !1258, !1259}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1228, file: !57, line: 1451, baseType: !1231, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1233, line: 94, baseType: !1234)
!1233 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1233, line: 81, size: 192, align: 64, elements: !1235)
!1235 = !{!1236, !1240, !1241}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1234, file: !1233, line: 82, baseType: !1237, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1233, line: 73, baseType: !1239)
!1239 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1233, line: 73, flags: DIFlagFwdDecl)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1234, file: !1233, line: 89, baseType: !1178, size: 64, align: 64, offset: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1234, file: !1233, line: 93, baseType: !955, size: 32, align: 32, offset: 128)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1228, file: !57, line: 1461, baseType: !979, size: 64, align: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1228, file: !57, line: 1467, baseType: !979, size: 64, align: 64, offset: 128)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1228, file: !57, line: 1468, baseType: !1178, size: 64, align: 64, offset: 192)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1228, file: !57, line: 1469, baseType: !955, size: 32, align: 32, offset: 256)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1228, file: !57, line: 1470, baseType: !955, size: 32, align: 32, offset: 288)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1228, file: !57, line: 1474, baseType: !955, size: 32, align: 32, offset: 320)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1228, file: !57, line: 1479, baseType: !1249, size: 64, align: 64, offset: 384)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1252)
!1252 = !{!1253, !1254, !1255}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1251, file: !57, line: 1412, baseType: !1178, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1251, file: !57, line: 1413, baseType: !955, size: 32, align: 32, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1251, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1228, file: !57, line: 1480, baseType: !955, size: 32, align: 32, offset: 448)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1228, file: !57, line: 1486, baseType: !979, size: 64, align: 64, offset: 512)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1228, file: !57, line: 1488, baseType: !979, size: 64, align: 64, offset: 576)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1228, file: !57, line: 1497, baseType: !979, size: 64, align: 64, offset: 640)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1262)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1263)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1264)
!1264 = !{!1265, !1266, !1267, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1294, !1296, !1297, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1330, !1331, !1332, !1333, !1334, !1335, !1338, !1339, !1340, !1341}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1263, file: !780, line: 282, baseType: !1205, size: 512, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1263, file: !780, line: 299, baseType: !1209, size: 256, align: 32, offset: 512)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1263, file: !780, line: 315, baseType: !1268, size: 64, align: 64, offset: 768)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1263, file: !780, line: 326, baseType: !955, size: 32, align: 32, offset: 832)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1263, file: !780, line: 326, baseType: !955, size: 32, align: 32, offset: 864)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1263, file: !780, line: 334, baseType: !955, size: 32, align: 32, offset: 896)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1263, file: !780, line: 341, baseType: !955, size: 32, align: 32, offset: 928)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1263, file: !780, line: 346, baseType: !955, size: 32, align: 32, offset: 960)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1263, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1263, file: !780, line: 356, baseType: !1022, size: 64, align: 32, offset: 1024)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1263, file: !780, line: 361, baseType: !979, size: 64, align: 64, offset: 1088)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1263, file: !780, line: 369, baseType: !979, size: 64, align: 64, offset: 1152)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1263, file: !780, line: 377, baseType: !979, size: 64, align: 64, offset: 1216)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1263, file: !780, line: 382, baseType: !955, size: 32, align: 32, offset: 1280)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1263, file: !780, line: 386, baseType: !955, size: 32, align: 32, offset: 1312)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1263, file: !780, line: 391, baseType: !955, size: 32, align: 32, offset: 1344)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1263, file: !780, line: 396, baseType: !948, size: 64, align: 64, offset: 1408)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1263, file: !780, line: 403, baseType: !1284, size: 512, align: 64, offset: 1472)
!1284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1132, size: 512, align: 64, elements: !1206)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1263, file: !780, line: 410, baseType: !955, size: 32, align: 32, offset: 1984)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1263, file: !780, line: 415, baseType: !955, size: 32, align: 32, offset: 2016)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1263, file: !780, line: 420, baseType: !955, size: 32, align: 32, offset: 2048)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1263, file: !780, line: 425, baseType: !955, size: 32, align: 32, offset: 2080)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1263, file: !780, line: 435, baseType: !979, size: 64, align: 64, offset: 2112)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1263, file: !780, line: 440, baseType: !955, size: 32, align: 32, offset: 2176)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1263, file: !780, line: 445, baseType: !1132, size: 64, align: 64, offset: 2240)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1263, file: !780, line: 459, baseType: !1293, size: 512, align: 64, offset: 2304)
!1293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1231, size: 512, align: 64, elements: !1206)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1263, file: !780, line: 473, baseType: !1295, size: 64, align: 64, offset: 2816)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1263, file: !780, line: 477, baseType: !955, size: 32, align: 32, offset: 2880)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1263, file: !780, line: 479, baseType: !1298, size: 64, align: 64, offset: 2944)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1301)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1302)
!1302 = !{!1303, !1304, !1305, !1306, !1311}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1301, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1301, file: !780, line: 203, baseType: !1178, size: 64, align: 64, offset: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1301, file: !780, line: 204, baseType: !955, size: 32, align: 32, offset: 128)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1301, file: !780, line: 205, baseType: !1307, size: 64, align: 64, offset: 192)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1309, line: 86, baseType: !1310)
!1309 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1310 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1309, line: 86, flags: DIFlagFwdDecl)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1301, file: !780, line: 206, baseType: !1231, size: 64, align: 64, offset: 256)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1263, file: !780, line: 480, baseType: !955, size: 32, align: 32, offset: 3008)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1263, file: !780, line: 505, baseType: !955, size: 32, align: 32, offset: 3040)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1263, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1263, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1263, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1263, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1263, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1263, file: !780, line: 532, baseType: !979, size: 64, align: 64, offset: 3264)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1263, file: !780, line: 539, baseType: !979, size: 64, align: 64, offset: 3328)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1263, file: !780, line: 547, baseType: !979, size: 64, align: 64, offset: 3392)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1263, file: !780, line: 554, baseType: !1307, size: 64, align: 64, offset: 3456)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1263, file: !780, line: 563, baseType: !955, size: 32, align: 32, offset: 3520)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1263, file: !780, line: 572, baseType: !955, size: 32, align: 32, offset: 3552)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1263, file: !780, line: 581, baseType: !955, size: 32, align: 32, offset: 3584)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1263, file: !780, line: 588, baseType: !1327, size: 64, align: 64, offset: 3648)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !963, line: 36, baseType: !1329)
!1329 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1263, file: !780, line: 593, baseType: !955, size: 32, align: 32, offset: 3712)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1263, file: !780, line: 596, baseType: !955, size: 32, align: 32, offset: 3744)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1263, file: !780, line: 599, baseType: !1231, size: 64, align: 64, offset: 3776)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1263, file: !780, line: 605, baseType: !1231, size: 64, align: 64, offset: 3840)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1263, file: !780, line: 616, baseType: !1231, size: 64, align: 64, offset: 3904)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1263, file: !780, line: 626, baseType: !1336, size: 64, align: 64, offset: 3968)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1337, line: 216, baseType: !1133)
!1337 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1263, file: !780, line: 627, baseType: !1336, size: 64, align: 64, offset: 4032)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1263, file: !780, line: 628, baseType: !1336, size: 64, align: 64, offset: 4096)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1263, file: !780, line: 629, baseType: !1336, size: 64, align: 64, offset: 4160)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1263, file: !780, line: 645, baseType: !1231, size: 64, align: 64, offset: 4224)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1110, file: !57, line: 3566, baseType: !1344, size: 64, align: 64, offset: 1408)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DISubroutineType(types: !1346)
!1346 = !{!955, !1152, !948, !1342, !1226}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1110, file: !57, line: 3567, baseType: !1149, size: 64, align: 64, offset: 1472)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1110, file: !57, line: 3576, baseType: !1349, size: 64, align: 64, offset: 1536)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{!955, !1152, !1260}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1110, file: !57, line: 3577, baseType: !1353, size: 64, align: 64, offset: 1600)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DISubroutineType(types: !1355)
!1355 = !{!955, !1152, !1226}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1110, file: !57, line: 3584, baseType: !1357, size: 64, align: 64, offset: 1664)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DISubroutineType(types: !1359)
!1359 = !{!955, !1152, !1360}
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1110, file: !57, line: 3589, baseType: !1362, size: 64, align: 64, offset: 1728)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DISubroutineType(types: !1364)
!1364 = !{null, !1152}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1110, file: !57, line: 3594, baseType: !955, size: 32, align: 32, offset: 1792)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1110, file: !57, line: 3600, baseType: !998, size: 64, align: 64, offset: 1856)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1110, file: !57, line: 3609, baseType: !1368, size: 64, align: 64, offset: 1920)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1371)
!1371 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1100, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1100, file: !57, line: 1581, baseType: !964, size: 32, align: 32, offset: 224)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1100, file: !57, line: 1583, baseType: !948, size: 64, align: 64, offset: 256)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1100, file: !57, line: 1591, baseType: !1376, size: 64, align: 64, offset: 320)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1165, line: 129, size: 1664, align: 64, elements: !1378)
!1378 = !{!1379, !1380, !1381, !1382, !1383, !1401, !1402, !1408, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1377, file: !1165, line: 136, baseType: !955, size: 32, align: 32)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1377, file: !1165, line: 151, baseType: !955, size: 32, align: 32, offset: 32)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1377, file: !1165, line: 157, baseType: !955, size: 32, align: 32, offset: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1377, file: !1165, line: 159, baseType: !1360, size: 64, align: 64, offset: 128)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1377, file: !1165, line: 161, baseType: !1384, size: 64, align: 64, offset: 192)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1165, line: 117, baseType: !1386)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1165, line: 100, size: 832, align: 64, elements: !1387)
!1387 = !{!1388, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1386, file: !1165, line: 105, baseType: !1389, size: 256, align: 64)
!1389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1390, size: 256, align: 64, elements: !1212)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1233, line: 238, baseType: !1392)
!1392 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1233, line: 238, flags: DIFlagFwdDecl)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1386, file: !1165, line: 110, baseType: !955, size: 32, align: 32, offset: 256)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1386, file: !1165, line: 111, baseType: !955, size: 32, align: 32, offset: 288)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1386, file: !1165, line: 111, baseType: !955, size: 32, align: 32, offset: 320)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1386, file: !1165, line: 112, baseType: !1209, size: 256, align: 32, offset: 352)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1386, file: !1165, line: 113, baseType: !1215, size: 128, align: 32, offset: 608)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1386, file: !1165, line: 114, baseType: !955, size: 32, align: 32, offset: 736)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1386, file: !1165, line: 115, baseType: !955, size: 32, align: 32, offset: 768)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1386, file: !1165, line: 116, baseType: !955, size: 32, align: 32, offset: 800)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1377, file: !1165, line: 163, baseType: !948, size: 64, align: 64, offset: 256)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1377, file: !1165, line: 165, baseType: !1403, size: 128, align: 64, offset: 320)
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1165, line: 122, baseType: !1404)
!1404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1165, line: 119, size: 128, align: 64, elements: !1405)
!1405 = !{!1406, !1407}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1404, file: !1165, line: 120, baseType: !1226, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1404, file: !1165, line: 121, baseType: !1360, size: 64, align: 64, offset: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1377, file: !1165, line: 166, baseType: !1409, size: 128, align: 64, offset: 448)
!1409 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1165, line: 127, baseType: !1410)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1165, line: 124, size: 128, align: 64, elements: !1411)
!1411 = !{!1412, !1485}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1410, file: !1165, line: 125, baseType: !1413, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1416)
!1416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1417)
!1417 = !{!1418, !1419, !1443, !1447, !1448, !1482, !1483, !1484}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1416, file: !57, line: 5751, baseType: !1103, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1416, file: !57, line: 5756, baseType: !1420, size: 64, align: 64, offset: 64)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1422)
!1422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1423)
!1423 = !{!1424, !1425, !1428, !1429, !1430, !1434, !1438, !1442}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1422, file: !57, line: 5797, baseType: !998, size: 64, align: 64)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1422, file: !57, line: 5804, baseType: !1426, size: 64, align: 64, offset: 64)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1422, file: !57, line: 5815, baseType: !1103, size: 64, align: 64, offset: 128)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1422, file: !57, line: 5825, baseType: !955, size: 32, align: 32, offset: 192)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1422, file: !57, line: 5826, baseType: !1431, size: 64, align: 64, offset: 256)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DISubroutineType(types: !1433)
!1433 = !{!955, !1414}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1422, file: !57, line: 5827, baseType: !1435, size: 64, align: 64, offset: 320)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DISubroutineType(types: !1437)
!1437 = !{!955, !1414, !1226}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1422, file: !57, line: 5828, baseType: !1439, size: 64, align: 64, offset: 384)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1440 = !DISubroutineType(types: !1441)
!1441 = !{null, !1414}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1422, file: !57, line: 5829, baseType: !1439, size: 64, align: 64, offset: 448)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1416, file: !57, line: 5762, baseType: !1444, size: 64, align: 64, offset: 128)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1446)
!1446 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1416, file: !57, line: 5768, baseType: !948, size: 64, align: 64, offset: 192)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1416, file: !57, line: 5775, baseType: !1449, size: 64, align: 64, offset: 256)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1451)
!1451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1452)
!1452 = !{!1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1451, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1451, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1451, file: !57, line: 3948, baseType: !962, size: 32, align: 32, offset: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1451, file: !57, line: 3958, baseType: !1178, size: 64, align: 64, offset: 128)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1451, file: !57, line: 3962, baseType: !955, size: 32, align: 32, offset: 192)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1451, file: !57, line: 3968, baseType: !955, size: 32, align: 32, offset: 224)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1451, file: !57, line: 3973, baseType: !979, size: 64, align: 64, offset: 256)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1451, file: !57, line: 3986, baseType: !955, size: 32, align: 32, offset: 320)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1451, file: !57, line: 3999, baseType: !955, size: 32, align: 32, offset: 352)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1451, file: !57, line: 4004, baseType: !955, size: 32, align: 32, offset: 384)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1451, file: !57, line: 4005, baseType: !955, size: 32, align: 32, offset: 416)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1451, file: !57, line: 4010, baseType: !955, size: 32, align: 32, offset: 448)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1451, file: !57, line: 4011, baseType: !955, size: 32, align: 32, offset: 480)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1451, file: !57, line: 4020, baseType: !1022, size: 64, align: 32, offset: 512)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1451, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1451, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1451, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1451, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1451, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1451, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1451, file: !57, line: 4039, baseType: !955, size: 32, align: 32, offset: 768)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1451, file: !57, line: 4046, baseType: !1132, size: 64, align: 64, offset: 832)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1451, file: !57, line: 4050, baseType: !955, size: 32, align: 32, offset: 896)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1451, file: !57, line: 4054, baseType: !955, size: 32, align: 32, offset: 928)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1451, file: !57, line: 4061, baseType: !955, size: 32, align: 32, offset: 960)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1451, file: !57, line: 4065, baseType: !955, size: 32, align: 32, offset: 992)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1451, file: !57, line: 4073, baseType: !955, size: 32, align: 32, offset: 1024)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1451, file: !57, line: 4080, baseType: !955, size: 32, align: 32, offset: 1056)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1451, file: !57, line: 4084, baseType: !955, size: 32, align: 32, offset: 1088)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1416, file: !57, line: 5781, baseType: !1449, size: 64, align: 64, offset: 320)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1416, file: !57, line: 5787, baseType: !1022, size: 64, align: 32, offset: 384)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1416, file: !57, line: 5793, baseType: !1022, size: 64, align: 32, offset: 448)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1410, file: !1165, line: 126, baseType: !955, size: 32, align: 32, offset: 64)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1377, file: !1165, line: 172, baseType: !1226, size: 64, align: 64, offset: 576)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1377, file: !1165, line: 177, baseType: !1178, size: 64, align: 64, offset: 640)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1377, file: !1165, line: 178, baseType: !964, size: 32, align: 32, offset: 704)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1377, file: !1165, line: 180, baseType: !948, size: 64, align: 64, offset: 768)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1377, file: !1165, line: 185, baseType: !955, size: 32, align: 32, offset: 832)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1377, file: !1165, line: 190, baseType: !948, size: 64, align: 64, offset: 896)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1377, file: !1165, line: 195, baseType: !955, size: 32, align: 32, offset: 960)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1377, file: !1165, line: 200, baseType: !1226, size: 64, align: 64, offset: 1024)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1377, file: !1165, line: 201, baseType: !955, size: 32, align: 32, offset: 1088)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1377, file: !1165, line: 202, baseType: !1360, size: 64, align: 64, offset: 1152)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1377, file: !1165, line: 203, baseType: !955, size: 32, align: 32, offset: 1216)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1377, file: !1165, line: 205, baseType: !955, size: 32, align: 32, offset: 1248)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1377, file: !1165, line: 206, baseType: !955, size: 32, align: 32, offset: 1280)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1377, file: !1165, line: 209, baseType: !1336, size: 64, align: 64, offset: 1344)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1377, file: !1165, line: 212, baseType: !1336, size: 64, align: 64, offset: 1408)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1377, file: !1165, line: 213, baseType: !1360, size: 64, align: 64, offset: 1472)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1377, file: !1165, line: 215, baseType: !955, size: 32, align: 32, offset: 1536)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1377, file: !1165, line: 217, baseType: !955, size: 32, align: 32, offset: 1568)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1377, file: !1165, line: 220, baseType: !955, size: 32, align: 32, offset: 1600)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1100, file: !57, line: 1598, baseType: !948, size: 64, align: 64, offset: 384)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1100, file: !57, line: 1606, baseType: !979, size: 64, align: 64, offset: 448)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1100, file: !57, line: 1614, baseType: !955, size: 32, align: 32, offset: 512)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1100, file: !57, line: 1622, baseType: !955, size: 32, align: 32, offset: 544)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1100, file: !57, line: 1628, baseType: !955, size: 32, align: 32, offset: 576)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1100, file: !57, line: 1636, baseType: !955, size: 32, align: 32, offset: 608)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1100, file: !57, line: 1643, baseType: !955, size: 32, align: 32, offset: 640)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1100, file: !57, line: 1657, baseType: !1178, size: 64, align: 64, offset: 704)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1100, file: !57, line: 1658, baseType: !955, size: 32, align: 32, offset: 768)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1100, file: !57, line: 1679, baseType: !1022, size: 64, align: 32, offset: 800)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1100, file: !57, line: 1688, baseType: !955, size: 32, align: 32, offset: 864)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1100, file: !57, line: 1712, baseType: !955, size: 32, align: 32, offset: 896)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1100, file: !57, line: 1729, baseType: !955, size: 32, align: 32, offset: 928)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1100, file: !57, line: 1729, baseType: !955, size: 32, align: 32, offset: 960)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1100, file: !57, line: 1744, baseType: !955, size: 32, align: 32, offset: 992)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1100, file: !57, line: 1744, baseType: !955, size: 32, align: 32, offset: 1024)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1100, file: !57, line: 1751, baseType: !955, size: 32, align: 32, offset: 1056)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1100, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1100, file: !57, line: 1791, baseType: !1524, size: 64, align: 64, offset: 1152)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DISubroutineType(types: !1526)
!1526 = !{null, !1099, !1260, !1342, !955, !955, !955}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1100, file: !57, line: 1808, baseType: !1528, size: 64, align: 64, offset: 1216)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DISubroutineType(types: !1530)
!1530 = !{!516, !1099, !1121}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1100, file: !57, line: 1816, baseType: !955, size: 32, align: 32, offset: 1280)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1100, file: !57, line: 1825, baseType: !1533, size: 32, align: 32, offset: 1312)
!1533 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1100, file: !57, line: 1830, baseType: !955, size: 32, align: 32, offset: 1344)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1100, file: !57, line: 1838, baseType: !1533, size: 32, align: 32, offset: 1376)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1100, file: !57, line: 1846, baseType: !955, size: 32, align: 32, offset: 1408)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1100, file: !57, line: 1851, baseType: !955, size: 32, align: 32, offset: 1440)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1100, file: !57, line: 1861, baseType: !1533, size: 32, align: 32, offset: 1472)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1100, file: !57, line: 1868, baseType: !1533, size: 32, align: 32, offset: 1504)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1100, file: !57, line: 1875, baseType: !1533, size: 32, align: 32, offset: 1536)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1100, file: !57, line: 1882, baseType: !1533, size: 32, align: 32, offset: 1568)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1100, file: !57, line: 1889, baseType: !1533, size: 32, align: 32, offset: 1600)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1100, file: !57, line: 1896, baseType: !1533, size: 32, align: 32, offset: 1632)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1100, file: !57, line: 1903, baseType: !1533, size: 32, align: 32, offset: 1664)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1100, file: !57, line: 1910, baseType: !955, size: 32, align: 32, offset: 1696)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1100, file: !57, line: 1915, baseType: !955, size: 32, align: 32, offset: 1728)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1100, file: !57, line: 1926, baseType: !1342, size: 64, align: 64, offset: 1792)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1100, file: !57, line: 1935, baseType: !1022, size: 64, align: 32, offset: 1856)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1100, file: !57, line: 1942, baseType: !955, size: 32, align: 32, offset: 1920)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1100, file: !57, line: 1948, baseType: !955, size: 32, align: 32, offset: 1952)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1100, file: !57, line: 1954, baseType: !955, size: 32, align: 32, offset: 1984)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1100, file: !57, line: 1960, baseType: !955, size: 32, align: 32, offset: 2016)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1100, file: !57, line: 1984, baseType: !955, size: 32, align: 32, offset: 2048)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1100, file: !57, line: 1991, baseType: !955, size: 32, align: 32, offset: 2080)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1100, file: !57, line: 1996, baseType: !955, size: 32, align: 32, offset: 2112)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1100, file: !57, line: 2004, baseType: !955, size: 32, align: 32, offset: 2144)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1100, file: !57, line: 2011, baseType: !955, size: 32, align: 32, offset: 2176)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1100, file: !57, line: 2018, baseType: !955, size: 32, align: 32, offset: 2208)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1100, file: !57, line: 2027, baseType: !955, size: 32, align: 32, offset: 2240)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1100, file: !57, line: 2034, baseType: !955, size: 32, align: 32, offset: 2272)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1100, file: !57, line: 2044, baseType: !955, size: 32, align: 32, offset: 2304)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1100, file: !57, line: 2054, baseType: !1563, size: 64, align: 64, offset: 2368)
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1100, file: !57, line: 2061, baseType: !1563, size: 64, align: 64, offset: 2432)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1100, file: !57, line: 2066, baseType: !955, size: 32, align: 32, offset: 2496)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1100, file: !57, line: 2070, baseType: !955, size: 32, align: 32, offset: 2528)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1100, file: !57, line: 2078, baseType: !955, size: 32, align: 32, offset: 2560)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1100, file: !57, line: 2085, baseType: !955, size: 32, align: 32, offset: 2592)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1100, file: !57, line: 2092, baseType: !955, size: 32, align: 32, offset: 2624)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1100, file: !57, line: 2099, baseType: !955, size: 32, align: 32, offset: 2656)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1100, file: !57, line: 2106, baseType: !955, size: 32, align: 32, offset: 2688)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1100, file: !57, line: 2113, baseType: !955, size: 32, align: 32, offset: 2720)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1100, file: !57, line: 2120, baseType: !955, size: 32, align: 32, offset: 2752)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1100, file: !57, line: 2125, baseType: !955, size: 32, align: 32, offset: 2784)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1100, file: !57, line: 2133, baseType: !955, size: 32, align: 32, offset: 2816)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1100, file: !57, line: 2140, baseType: !955, size: 32, align: 32, offset: 2848)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1100, file: !57, line: 2145, baseType: !955, size: 32, align: 32, offset: 2880)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1100, file: !57, line: 2153, baseType: !955, size: 32, align: 32, offset: 2912)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1100, file: !57, line: 2158, baseType: !955, size: 32, align: 32, offset: 2944)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1100, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1100, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1100, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1100, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1100, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1100, file: !57, line: 2203, baseType: !955, size: 32, align: 32, offset: 3136)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1100, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1100, file: !57, line: 2212, baseType: !955, size: 32, align: 32, offset: 3200)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1100, file: !57, line: 2213, baseType: !955, size: 32, align: 32, offset: 3232)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1100, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1100, file: !57, line: 2232, baseType: !955, size: 32, align: 32, offset: 3296)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1100, file: !57, line: 2243, baseType: !955, size: 32, align: 32, offset: 3328)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1100, file: !57, line: 2249, baseType: !955, size: 32, align: 32, offset: 3360)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1100, file: !57, line: 2256, baseType: !955, size: 32, align: 32, offset: 3392)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1100, file: !57, line: 2263, baseType: !1132, size: 64, align: 64, offset: 3456)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1100, file: !57, line: 2270, baseType: !1132, size: 64, align: 64, offset: 3520)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1100, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1100, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1100, file: !57, line: 2367, baseType: !1599, size: 64, align: 64, offset: 3648)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = !DISubroutineType(types: !1601)
!1601 = !{!955, !1099, !1360, !955}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1100, file: !57, line: 2383, baseType: !955, size: 32, align: 32, offset: 3712)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1100, file: !57, line: 2386, baseType: !1533, size: 32, align: 32, offset: 3744)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1100, file: !57, line: 2387, baseType: !1533, size: 32, align: 32, offset: 3776)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1100, file: !57, line: 2394, baseType: !955, size: 32, align: 32, offset: 3808)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1100, file: !57, line: 2401, baseType: !955, size: 32, align: 32, offset: 3840)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1100, file: !57, line: 2408, baseType: !955, size: 32, align: 32, offset: 3872)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1100, file: !57, line: 2415, baseType: !955, size: 32, align: 32, offset: 3904)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1100, file: !57, line: 2422, baseType: !955, size: 32, align: 32, offset: 3936)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1100, file: !57, line: 2423, baseType: !1611, size: 64, align: 64, offset: 3968)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1613)
!1613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1614)
!1614 = !{!1615, !1616, !1617, !1618}
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1613, file: !57, line: 827, baseType: !955, size: 32, align: 32)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1613, file: !57, line: 828, baseType: !955, size: 32, align: 32, offset: 32)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1613, file: !57, line: 829, baseType: !955, size: 32, align: 32, offset: 64)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1613, file: !57, line: 830, baseType: !1533, size: 32, align: 32, offset: 96)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1100, file: !57, line: 2430, baseType: !979, size: 64, align: 64, offset: 4032)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1100, file: !57, line: 2437, baseType: !979, size: 64, align: 64, offset: 4096)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1100, file: !57, line: 2444, baseType: !1533, size: 32, align: 32, offset: 4160)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1100, file: !57, line: 2451, baseType: !1533, size: 32, align: 32, offset: 4192)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1100, file: !57, line: 2458, baseType: !955, size: 32, align: 32, offset: 4224)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1100, file: !57, line: 2469, baseType: !955, size: 32, align: 32, offset: 4256)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1100, file: !57, line: 2475, baseType: !955, size: 32, align: 32, offset: 4288)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1100, file: !57, line: 2481, baseType: !955, size: 32, align: 32, offset: 4320)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1100, file: !57, line: 2485, baseType: !955, size: 32, align: 32, offset: 4352)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1100, file: !57, line: 2489, baseType: !955, size: 32, align: 32, offset: 4384)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1100, file: !57, line: 2493, baseType: !955, size: 32, align: 32, offset: 4416)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1100, file: !57, line: 2501, baseType: !955, size: 32, align: 32, offset: 4448)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1100, file: !57, line: 2506, baseType: !955, size: 32, align: 32, offset: 4480)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1100, file: !57, line: 2510, baseType: !955, size: 32, align: 32, offset: 4512)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1100, file: !57, line: 2514, baseType: !979, size: 64, align: 64, offset: 4544)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1100, file: !57, line: 2528, baseType: !1635, size: 64, align: 64, offset: 4608)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DISubroutineType(types: !1637)
!1637 = !{null, !1099, !948, !955, !955}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1100, file: !57, line: 2534, baseType: !955, size: 32, align: 32, offset: 4672)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1100, file: !57, line: 2545, baseType: !955, size: 32, align: 32, offset: 4704)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1100, file: !57, line: 2547, baseType: !955, size: 32, align: 32, offset: 4736)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1100, file: !57, line: 2549, baseType: !955, size: 32, align: 32, offset: 4768)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1100, file: !57, line: 2551, baseType: !955, size: 32, align: 32, offset: 4800)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1100, file: !57, line: 2553, baseType: !955, size: 32, align: 32, offset: 4832)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1100, file: !57, line: 2555, baseType: !955, size: 32, align: 32, offset: 4864)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1100, file: !57, line: 2557, baseType: !955, size: 32, align: 32, offset: 4896)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1100, file: !57, line: 2559, baseType: !955, size: 32, align: 32, offset: 4928)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1100, file: !57, line: 2563, baseType: !955, size: 32, align: 32, offset: 4960)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1100, file: !57, line: 2571, baseType: !1218, size: 64, align: 64, offset: 4992)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1100, file: !57, line: 2579, baseType: !1218, size: 64, align: 64, offset: 5056)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1100, file: !57, line: 2586, baseType: !955, size: 32, align: 32, offset: 5120)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1100, file: !57, line: 2615, baseType: !955, size: 32, align: 32, offset: 5152)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1100, file: !57, line: 2627, baseType: !955, size: 32, align: 32, offset: 5184)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1100, file: !57, line: 2637, baseType: !955, size: 32, align: 32, offset: 5216)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1100, file: !57, line: 2681, baseType: !955, size: 32, align: 32, offset: 5248)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1100, file: !57, line: 2709, baseType: !979, size: 64, align: 64, offset: 5312)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1100, file: !57, line: 2716, baseType: !1657, size: 64, align: 64, offset: 5376)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1659)
!1659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1660)
!1660 = !{!1661, !1662, !1663, !1664, !1665, !1666, !1667, !1671, !1675, !1676, !1677, !1678, !1683, !1684, !1685, !1686, !1687}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1659, file: !57, line: 3642, baseType: !998, size: 64, align: 64)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1659, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1659, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1659, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1659, file: !57, line: 3669, baseType: !955, size: 32, align: 32, offset: 160)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1659, file: !57, line: 3682, baseType: !1357, size: 64, align: 64, offset: 192)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1659, file: !57, line: 3698, baseType: !1668, size: 64, align: 64, offset: 256)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DISubroutineType(types: !1670)
!1670 = !{!955, !1152, !1086, !962}
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1659, file: !57, line: 3712, baseType: !1672, size: 64, align: 64, offset: 320)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DISubroutineType(types: !1674)
!1674 = !{!955, !1152, !955, !1086, !962}
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1659, file: !57, line: 3726, baseType: !1668, size: 64, align: 64, offset: 384)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1659, file: !57, line: 3737, baseType: !1149, size: 64, align: 64, offset: 448)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1659, file: !57, line: 3746, baseType: !955, size: 32, align: 32, offset: 512)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1659, file: !57, line: 3757, baseType: !1679, size: 64, align: 64, offset: 576)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DISubroutineType(types: !1681)
!1681 = !{null, !1682}
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
