; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--rv34.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--rv34.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RV34VLC = type { [2 x %struct.VLC], [2 x [4 x %struct.VLC]], [4 x %struct.VLC], [2 x %struct.VLC], [2 x %struct.VLC], %struct.VLC }
%struct.VLC = type { i32, [2 x i16]*, i32, i32 }
%struct.GetBitContext = type { i8*, i8*, i32, i32, i32 }

!906 = !DIEnumerator(name: "FMT_MJPEG", value: 3)
!907 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !908, line: 37, size: 32, align: 32, elements: !909)
!908 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!909 = !{!910, !911, !912, !913, !914, !915}
!910 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!911 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!912 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!913 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!914 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!915 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !57, line: 798, size: 32, align: 32, elements: !917)
!917 = !{!918, !919, !920, !921, !922, !923, !924}
!918 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!919 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!920 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!921 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!922 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!923 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!924 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!925 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RV40BlockTypes", file: !926, line: 42, size: 32, align: 32, elements: !927)
!926 = !DIFile(filename: "libavcodec/rv34.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!927 = !{!928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940}
!928 = !DIEnumerator(name: "RV34_MB_TYPE_INTRA", value: 0)
!929 = !DIEnumerator(name: "RV34_MB_TYPE_INTRA16x16", value: 1)
!930 = !DIEnumerator(name: "RV34_MB_P_16x16", value: 2)
!931 = !DIEnumerator(name: "RV34_MB_P_8x8", value: 3)
!932 = !DIEnumerator(name: "RV34_MB_B_FORWARD", value: 4)
!933 = !DIEnumerator(name: "RV34_MB_B_BACKWARD", value: 5)
!934 = !DIEnumerator(name: "RV34_MB_SKIP", value: 6)
!935 = !DIEnumerator(name: "RV34_MB_B_DIRECT", value: 7)
!936 = !DIEnumerator(name: "RV34_MB_P_16x8", value: 8)
!937 = !DIEnumerator(name: "RV34_MB_P_8x16", value: 9)
!938 = !DIEnumerator(name: "RV34_MB_B_BIDIR", value: 10)
!939 = !DIEnumerator(name: "RV34_MB_P_MIX16x16", value: 11)
!940 = !DIEnumerator(name: "RV34_MB_TYPES", value: 12)
!941 = !{!942, !943, !944, !945, !953, !955, !956, !959, !960, !951}
!942 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!943 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !948, line: 221, size: 32, align: 8, elements: !949)
!948 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!949 = !{!950}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !947, file: !948, line: 221, baseType: !951, size: 32, align: 32)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !952, line: 51, baseType: !943)
!952 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !952, line: 48, baseType: !954)
!954 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !952, line: 49, baseType: !958)
!958 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !952, line: 55, baseType: !962)
!962 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!963 = !{!964, !998, !1004, !1007, !1012, !1016, !1021, !1025, !1026, !1031, !1034, !1038, !1042, !1046, !1049, !1052, !1055, !1058, !1059, !1062, !1066, !1067, !1071, !1073, !1075, !1076, !1093, !1095, !1096, !1099, !1100, !1104, !1107, !1111}
!964 = distinct !DIGlobalVariable(name: "intra_vlcs", scope: !0, file: !965, line: 69, type: !966, isLocal: true, isDefinition: true, variable: [5 x %struct.RV34VLC]* @intra_vlcs)
!965 = !DIFile(filename: "libavcodec/rv34.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 18240, align: 64, elements: !996)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "RV34VLC", file: !926, line: 70, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RV34VLC", file: !926, line: 63, size: 3648, align: 64, elements: !969)
!969 = !{!970, !986, !990, !993, !994, !995}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "cbppattern", scope: !968, file: !926, line: 64, baseType: !971, size: 384, align: 64)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 384, align: 64, elements: !982)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "VLC", file: !973, line: 30, baseType: !974)
!973 = !DIFile(filename: "libavcodec/vlc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VLC", file: !973, line: 26, size: 192, align: 64, elements: !975)
!975 = !{!976, !977, !984, !985}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !974, file: !973, line: 27, baseType: !942, size: 32, align: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !974, file: !973, line: 28, baseType: !978, size: 64, align: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !980, size: 32, align: 16, elements: !982)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !952, line: 37, baseType: !981)
!981 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!982 = !{!983}
!983 = !DISubrange(count: 2)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !974, file: !973, line: 29, baseType: !942, size: 32, align: 32, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "table_allocated", scope: !974, file: !973, line: 29, baseType: !942, size: 32, align: 32, offset: 160)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !968, file: !926, line: 65, baseType: !987, size: 1536, align: 64, offset: 384)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 1536, align: 64, elements: !988)
!988 = !{!983, !989}
!989 = !DISubrange(count: 4)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "first_pattern", scope: !968, file: !926, line: 66, baseType: !991, size: 768, align: 64, offset: 1920)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 768, align: 64, elements: !992)
!992 = !{!989}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "second_pattern", scope: !968, file: !926, line: 67, baseType: !971, size: 384, align: 64, offset: 2688)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "third_pattern", scope: !968, file: !926, line: 68, baseType: !971, size: 384, align: 64, offset: 3072)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "coefficient", scope: !968, file: !926, line: 69, baseType: !972, size: 192, align: 64, offset: 3456)
!996 = !{!997}
!997 = !DISubrange(count: 5)
!998 = distinct !DIGlobalVariable(name: "rv34_mb_max_sizes", scope: !0, file: !999, line: 119, type: !1000, isLocal: true, isDefinition: true, variable: [6 x i16]* @rv34_mb_max_sizes)
!999 = !DIFile(filename: "libavcodec/rv34data.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1001, size: 96, align: 16, elements: !1002)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!1002 = !{!1003}
!1003 = !DISubrange(count: 6)
!1004 = distinct !DIGlobalVariable(name: "rv34_mb_bits_sizes", scope: !0, file: !999, line: 124, type: !1005, isLocal: true, isDefinition: true, variable: [6 x i8]* @rv34_mb_bits_sizes)
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 48, align: 8, elements: !1002)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!1007 = distinct !DIGlobalVariable(name: "table_offs", scope: !0, file: !965, line: 78, type: !1008, isLocal: true, isDefinition: true, variable: [180 x i32]* @table_offs)
!1008 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1009, size: 5760, align: 32, elements: !1010)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!1010 = !{!1011}
!1011 = !DISubrange(count: 180)
!1012 = distinct !DIGlobalVariable(name: "table_data", scope: !0, file: !965, line: 99, type: !1013, isLocal: true, isDefinition: true, variable: [117592 x [2 x i16]]* @table_data)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !980, size: 3762944, align: 16, elements: !1014)
!1014 = !{!1015, !983}
!1015 = !DISubrange(count: 117592)
!1016 = distinct !DIGlobalVariable(name: "rv34_table_intra_cbppat", scope: !0, file: !1017, line: 42, type: !1018, isLocal: true, isDefinition: true, variable: [5 x [2 x [1296 x i8]]]* @rv34_table_intra_cbppat)
!1017 = !DIFile(filename: "libavcodec/rv34vlc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 103680, align: 8, elements: !1019)
!1019 = !{!997, !983, !1020}
!1020 = !DISubrange(count: 1296)
!1021 = distinct !DIGlobalVariable(name: "rv34_table_intra_secondpat", scope: !0, file: !1017, line: 2074, type: !1022, isLocal: true, isDefinition: true, variable: [5 x [2 x [108 x i8]]]* @rv34_table_intra_secondpat)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 8640, align: 8, elements: !1023)
!1023 = !{!997, !983, !1024}
!1024 = !DISubrange(count: 108)
!1025 = distinct !DIGlobalVariable(name: "rv34_table_intra_thirdpat", scope: !0, file: !1017, line: 2177, type: !1022, isLocal: true, isDefinition: true, variable: [5 x [2 x [108 x i8]]]* @rv34_table_intra_thirdpat)
!1026 = distinct !DIGlobalVariable(name: "rv34_table_intra_cbp", scope: !0, file: !1017, line: 886, type: !1027, isLocal: true, isDefinition: true, variable: [5 x [8 x [16 x i8]]]* @rv34_table_intra_cbp)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 5120, align: 8, elements: !1028)
!1028 = !{!997, !1029, !1030}
!1029 = !DISubrange(count: 8)
!1030 = !DISubrange(count: 16)
!1031 = distinct !DIGlobalVariable(name: "rv34_cbp_code", scope: !0, file: !999, line: 42, type: !1032, isLocal: true, isDefinition: true, variable: [16 x i8]* @rv34_cbp_code)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 128, align: 8, elements: !1033)
!1033 = !{!1030}
!1034 = distinct !DIGlobalVariable(name: "rv34_table_intra_firstpat", scope: !0, file: !1017, line: 940, type: !1035, isLocal: true, isDefinition: true, variable: [5 x [4 x [864 x i8]]]* @rv34_table_intra_firstpat)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 138240, align: 8, elements: !1036)
!1036 = !{!997, !989, !1037}
!1037 = !DISubrange(count: 864)
!1038 = distinct !DIGlobalVariable(name: "rv34_intra_coeff", scope: !0, file: !1017, line: 2281, type: !1039, isLocal: true, isDefinition: true, variable: [5 x [32 x i8]]* @rv34_intra_coeff)
!1039 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 1280, align: 8, elements: !1040)
!1040 = !{!997, !1041}
!1041 = !DISubrange(count: 32)
!1042 = distinct !DIGlobalVariable(name: "rv34_inter_cbppat", scope: !0, file: !1017, line: 2305, type: !1043, isLocal: true, isDefinition: true, variable: [7 x [1296 x i8]]* @rv34_inter_cbppat)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 72576, align: 8, elements: !1044)
!1044 = !{!1045, !1020}
!1045 = !DISubrange(count: 7)
!1046 = distinct !DIGlobalVariable(name: "inter_vlcs", scope: !0, file: !965, line: 69, type: !1047, isLocal: true, isDefinition: true, variable: [7 x %struct.RV34VLC]* @inter_vlcs)
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 25536, align: 64, elements: !1048)
!1048 = !{!1045}
!1049 = distinct !DIGlobalVariable(name: "rv34_inter_cbp", scope: !0, file: !1017, line: 2890, type: !1050, isLocal: true, isDefinition: true, variable: [7 x [4 x [16 x i8]]]* @rv34_inter_cbp)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 3584, align: 8, elements: !1051)
!1051 = !{!1045, !989, !1030}
!1052 = distinct !DIGlobalVariable(name: "rv34_table_inter_firstpat", scope: !0, file: !1017, line: 2936, type: !1053, isLocal: true, isDefinition: true, variable: [7 x [2 x [864 x i8]]]* @rv34_table_inter_firstpat)
!1053 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 96768, align: 8, elements: !1054)
!1054 = !{!1045, !983, !1037}
!1055 = distinct !DIGlobalVariable(name: "rv34_table_inter_secondpat", scope: !0, file: !1017, line: 3737, type: !1056, isLocal: true, isDefinition: true, variable: [7 x [2 x [108 x i8]]]* @rv34_table_inter_secondpat)
!1056 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 12096, align: 8, elements: !1057)
!1057 = !{!1045, !983, !1024}
!1058 = distinct !DIGlobalVariable(name: "rv34_table_inter_thirdpat", scope: !0, file: !1017, line: 3880, type: !1056, isLocal: true, isDefinition: true, variable: [7 x [2 x [108 x i8]]]* @rv34_table_inter_thirdpat)
!1059 = distinct !DIGlobalVariable(name: "rv34_inter_coeff", scope: !0, file: !1017, line: 4024, type: !1060, isLocal: true, isDefinition: true, variable: [7 x [32 x i8]]* @rv34_inter_coeff)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 1792, align: 8, elements: !1061)
!1061 = !{!1045, !1041}
!1062 = distinct !DIGlobalVariable(name: "rv34_mb_type_to_lavc", scope: !0, file: !965, line: 53, type: !1063, isLocal: true, isDefinition: true, variable: [12 x i32]* @rv34_mb_type_to_lavc)
!1063 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1009, size: 384, align: 32, elements: !1064)
!1064 = !{!1065}
!1065 = !DISubrange(count: 12)
!1066 = distinct !DIGlobalVariable(name: "num_mvs", scope: !0, file: !965, line: 852, type: !1063, isLocal: true, isDefinition: true, variable: [12 x i32]* @num_mvs)
!1067 = distinct !DIGlobalVariable(name: "chroma_coeffs", scope: !0, file: !965, line: 648, type: !1068, isLocal: true, isDefinition: true, variable: [3 x i32]* @chroma_coeffs)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1009, size: 96, align: 32, elements: !1069)
!1069 = !{!1070}
!1070 = !DISubrange(count: 3)
!1071 = distinct !DIGlobalVariable(name: "avail_indexes", scope: !0, file: !965, line: 457, type: !1072, isLocal: true, isDefinition: true, variable: [4 x i8]* @avail_indexes)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 32, align: 8, elements: !992)
!1073 = distinct !DIGlobalVariable(name: "part_sizes_w", scope: !0, file: !965, line: 451, type: !1074, isLocal: true, isDefinition: true, variable: [12 x i8]* @part_sizes_w)
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 96, align: 8, elements: !1064)
!1075 = distinct !DIGlobalVariable(name: "part_sizes_h", scope: !0, file: !965, line: 454, type: !1074, isLocal: true, isDefinition: true, variable: [12 x i8]* @part_sizes_h)
!1076 = distinct !DIGlobalVariable(name: "cbp_masks", scope: !1077, file: !965, line: 192, type: !1068, isLocal: true, isDefinition: true, variable: [3 x i32]* @rv34_decode_cbp.cbp_masks)
!1077 = distinct !DISubprogram(name: "rv34_decode_cbp", scope: !965, file: !965, line: 188, type: !1078, isLocal: true, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1092)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!942, !1080, !1091, !942}
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1082, line: 70, baseType: !1083)
!1082 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1082, line: 61, size: 256, align: 64, elements: !1084)
!1084 = !{!1085, !1087, !1088, !1089, !1090}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1083, file: !1082, line: 62, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1083, file: !1082, line: 62, baseType: !1086, size: 64, align: 64, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1083, file: !1082, line: 67, baseType: !942, size: 32, align: 32, offset: 128)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1083, file: !1082, line: 68, baseType: !942, size: 32, align: 32, offset: 160)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1083, file: !1082, line: 69, baseType: !942, size: 32, align: 32, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!1092 = !{}
!1093 = distinct !DIGlobalVariable(name: "shifts", scope: !1077, file: !965, line: 193, type: !1094, isLocal: true, isDefinition: true, variable: [4 x i32]* @rv34_decode_cbp.shifts)
!1094 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1009, size: 128, align: 32, elements: !992)
!1095 = distinct !DIGlobalVariable(name: "rv34_count_ones", scope: !0, file: !999, line: 35, type: !1032, isLocal: true, isDefinition: true, variable: [16 x i8]* @rv34_count_ones)
!1096 = distinct !DIGlobalVariable(name: "modulo_three_table", scope: !0, file: !999, line: 53, type: !1097, isLocal: true, isDefinition: true, variable: [108 x i8]* @modulo_three_table)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 864, align: 8, elements: !1098)
!1098 = !{!1024}
!1099 = distinct !DIGlobalVariable(name: "ittrans16", scope: !0, file: !965, line: 965, type: !1094, isLocal: true, isDefinition: true, variable: [4 x i32]* @ittrans16)
!1100 = distinct !DIGlobalVariable(name: "ittrans", scope: !0, file: !965, line: 959, type: !1101, isLocal: true, isDefinition: true, variable: [9 x i32]* @ittrans)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1009, size: 288, align: 32, elements: !1102)
!1102 = !{!1103}
!1103 = !DISubrange(count: 9)
!1104 = distinct !DIGlobalVariable(name: "rv34_qscale_tab", scope: !0, file: !999, line: 84, type: !1105, isLocal: true, isDefinition: true, variable: [32 x i16]* @rv34_qscale_tab)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1001, size: 512, align: 16, elements: !1106)
!1106 = !{!1041}
!1107 = distinct !DIGlobalVariable(name: "rv34_quant_to_vlc_set", scope: !0, file: !999, line: 95, type: !1108, isLocal: true, isDefinition: true, variable: [2 x [31 x i8]]* @rv34_quant_to_vlc_set)
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 496, align: 8, elements: !1109)
!1109 = !{!983, !1110}
!1110 = !DISubrange(count: 31)
!1111 = distinct !DIGlobalVariable(name: "rv34_chroma_quant", scope: !0, file: !999, line: 74, type: !1112, isLocal: true, isDefinition: true, variable: [2 x [32 x i8]]* @rv34_chroma_quant)
!1112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 512, align: 8, elements: !1113)
!1113 = !{!983, !1041}
!1114 = !{i32 2, !"Dwarf Version", i32 4}
!1115 = !{i32 2, !"Debug Info Version", i32 3}
!1116 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1117 = distinct !DISubprogram(name: "ff_rv34_get_start_offset", scope: !965, file: !965, line: 330, type: !1118, isLocal: false, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1092)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!942, !1080, !942}
!1120 = !DILocalVariable(name: "gb", arg: 1, scope: !1117, file: !965, line: 330, type: !1080)
!1121 = !DIExpression()
!1122 = !DILocation(line: 330, column: 45, scope: !1117)
!1123 = !DILocalVariable(name: "mb_size", arg: 2, scope: !1117, file: !965, line: 330, type: !942)
!1124 = !DILocation(line: 330, column: 53, scope: !1117)
!1125 = !DILocalVariable(name: "i", scope: !1117, file: !965, line: 332, type: !942)
!1126 = !DILocation(line: 332, column: 9, scope: !1117)
!1127 = !DILocation(line: 333, column: 11, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1117, file: !965, line: 333, column: 5)
!1129 = !DILocation(line: 333, column: 9, scope: !1128)
!1130 = !DILocation(line: 333, column: 16, scope: !1131)
!1131 = !DILexicalBlockFile(scope: !1132, file: !965, discriminator: 1)
!1132 = distinct !DILexicalBlock(scope: !1128, file: !965, line: 333, column: 5)
!1133 = !DILocation(line: 333, column: 18, scope: !1131)
!1134 = !DILocation(line: 333, column: 5, scope: !1131)
!1135 = !DILocation(line: 334, column: 30, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1132, file: !965, line: 334, column: 12)
!1137 = !DILocation(line: 334, column: 12, scope: !1136)
!1138 = !DILocation(line: 334, column: 36, scope: !1136)
!1139 = !DILocation(line: 334, column: 44, scope: !1136)
!1140 = !DILocation(line: 334, column: 33, scope: !1136)
!1141 = !DILocation(line: 334, column: 12, scope: !1132)
!1142 = !DILocation(line: 335, column: 13, scope: !1136)
!1143 = !DILocation(line: 334, column: 46, scope: !1144)
!1144 = !DILexicalBlockFile(scope: !1136, file: !965, discriminator: 1)
!1145 = !DILocation(line: 333, column: 24, scope: !1146)
!1146 = !DILexicalBlockFile(scope: !1132, file: !965, discriminator: 2)
!1147 = !DILocation(line: 333, column: 5, scope: !1146)
!1148 = distinct !{!1148, !1149}
!1149 = !DILocation(line: 333, column: 5, scope: !1117)
!1150 = !DILocation(line: 336, column: 31, scope: !1117)
!1151 = !DILocation(line: 336, column: 12, scope: !1117)
!1152 = !DILocation(line: 336, column: 5, scope: !1117)
!1153 = distinct !DISubprogram(name: "ff_rv34_decode_init", scope: !965, file: !965, line: 1492, type: !1154, isLocal: false, isDefinition: true, scopeLine: 1493, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1092)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!942, !1156}
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1159)
!1159 = !{!1160, !1244, !1245, !1246, !1498, !1499, !1500, !1501, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1654, !1658, !1659, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !2684, !2685, !2686, !2687, !2688, !2689, !2690, !2691, !2692, !2693, !2694, !2695, !2696, !2703, !2710, !2711, !2712, !2713, !2714, !2715, !2716, !2717, !2718, !2719, !2720, !2721, !2722, !2723, !2724, !2741, !2742, !2743, !2744, !2745, !2746, !2747, !2748, !2749, !2750, !2751, !2752, !2753, !2754, !2755, !2756, !2757, !2758, !2759, !2760, !2761, !2762, !2763, !2764}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1158, file: !57, line: 1561, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1163)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !1165)
!1165 = !{!1166, !1170, !1174, !1203, !1204, !1205, !1206, !1210, !1216, !1218, !1222}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1164, file: !26, line: 72, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1169)
!1169 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1164, file: !26, line: 78, baseType: !1171, size: 64, align: 64, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!1167, !944}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1164, file: !26, line: 85, baseType: !1175, size: 64, align: 64, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !1178)
!1178 = !{!1179, !1180, !1181, !1182, !1183, !1199, !1200, !1201, !1202}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1177, file: !4, line: 247, baseType: !1167, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1177, file: !4, line: 253, baseType: !1167, size: 64, align: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1177, file: !4, line: 259, baseType: !942, size: 32, align: 32, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1177, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1177, file: !4, line: 271, baseType: !1184, size: 64, align: 64, offset: 192)
!1184 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1177, file: !4, line: 265, size: 64, align: 64, elements: !1185)
!1185 = !{!1186, !1189, !1191, !1192}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1184, file: !4, line: 266, baseType: !1187, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !952, line: 40, baseType: !1188)
!1188 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1184, file: !4, line: 267, baseType: !1190, size: 64, align: 64)
!1190 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1184, file: !4, line: 268, baseType: !1167, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1184, file: !4, line: 270, baseType: !1193, size: 64, align: 32)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1194, line: 61, baseType: !1195)
!1194 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1194, line: 58, size: 64, align: 32, elements: !1196)
!1196 = !{!1197, !1198}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1195, file: !1194, line: 59, baseType: !942, size: 32, align: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1195, file: !1194, line: 60, baseType: !942, size: 32, align: 32, offset: 32)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1177, file: !4, line: 272, baseType: !1190, size: 64, align: 64, offset: 256)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1177, file: !4, line: 273, baseType: !1190, size: 64, align: 64, offset: 320)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1177, file: !4, line: 275, baseType: !942, size: 32, align: 32, offset: 384)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1177, file: !4, line: 300, baseType: !1167, size: 64, align: 64, offset: 448)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1164, file: !26, line: 93, baseType: !942, size: 32, align: 32, offset: 192)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1164, file: !26, line: 99, baseType: !942, size: 32, align: 32, offset: 224)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1164, file: !26, line: 108, baseType: !942, size: 32, align: 32, offset: 256)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1164, file: !26, line: 113, baseType: !1207, size: 64, align: 64, offset: 320)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!944, !944, !944}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1164, file: !26, line: 123, baseType: !1211, size: 64, align: 64, offset: 384)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!1214, !1214}
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1164)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1164, file: !26, line: 130, baseType: !1217, size: 32, align: 32, offset: 448)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1164, file: !26, line: 136, baseType: !1219, size: 64, align: 64, offset: 512)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{!1217, !944}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1164, file: !26, line: 142, baseType: !1223, size: 64, align: 64, offset: 576)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!942, !1226, !944, !1167, !942}
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1229)
!1229 = !{!1230, !1242, !1243}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1228, file: !4, line: 360, baseType: !1231, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1235)
!1235 = !{!1236, !1237, !1238, !1239, !1240, !1241}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1234, file: !4, line: 307, baseType: !1167, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1234, file: !4, line: 313, baseType: !1190, size: 64, align: 64, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1234, file: !4, line: 313, baseType: !1190, size: 64, align: 64, offset: 128)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1234, file: !4, line: 318, baseType: !1190, size: 64, align: 64, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1234, file: !4, line: 318, baseType: !1190, size: 64, align: 64, offset: 256)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1234, file: !4, line: 323, baseType: !942, size: 32, align: 32, offset: 320)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1228, file: !4, line: 364, baseType: !942, size: 32, align: 32, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1228, file: !4, line: 368, baseType: !942, size: 32, align: 32, offset: 96)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1158, file: !57, line: 1562, baseType: !942, size: 32, align: 32, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1158, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1158, file: !57, line: 1565, baseType: !1247, size: 64, align: 64, offset: 128)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1249)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1250)
!1250 = !{!1251, !1252, !1253, !1254, !1255, !1256, !1259, !1262, !1264, !1267, !1270, !1271, !1272, !1280, !1281, !1282, !1284, !1286, !1292, !1301, !1305, !1306, !1348, !1469, !1473, !1474, !1478, !1482, !1487, !1491, !1492, !1493}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1249, file: !57, line: 3475, baseType: !1167, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1249, file: !57, line: 3480, baseType: !1167, size: 64, align: 64, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1249, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1249, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1249, file: !57, line: 3487, baseType: !942, size: 32, align: 32, offset: 192)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1249, file: !57, line: 3488, baseType: !1257, size: 64, align: 64, offset: 256)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1193)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1249, file: !57, line: 3489, baseType: !1260, size: 64, align: 64, offset: 320)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1249, file: !57, line: 3490, baseType: !1263, size: 64, align: 64, offset: 384)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1249, file: !57, line: 3491, baseType: !1265, size: 64, align: 64, offset: 448)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1249, file: !57, line: 3492, baseType: !1268, size: 64, align: 64, offset: 512)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1249, file: !57, line: 3493, baseType: !953, size: 8, align: 8, offset: 576)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1249, file: !57, line: 3494, baseType: !1161, size: 64, align: 64, offset: 640)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1249, file: !57, line: 3495, baseType: !1273, size: 64, align: 64, offset: 704)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1275)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1276)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1277)
!1277 = !{!1278, !1279}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1276, file: !57, line: 3402, baseType: !942, size: 32, align: 32)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1276, file: !57, line: 3403, baseType: !1167, size: 64, align: 64, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1249, file: !57, line: 3507, baseType: !1167, size: 64, align: 64, offset: 768)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1249, file: !57, line: 3516, baseType: !942, size: 32, align: 32, offset: 832)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1249, file: !57, line: 3517, baseType: !1283, size: 64, align: 64, offset: 896)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1249, file: !57, line: 3527, baseType: !1285, size: 64, align: 64, offset: 960)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1249, file: !57, line: 3535, baseType: !1287, size: 64, align: 64, offset: 1024)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{!942, !1156, !1290}
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1157)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1249, file: !57, line: 3541, baseType: !1293, size: 64, align: 64, offset: 1088)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1295)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1296)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1297, line: 223, size: 128, align: 64, elements: !1298)
!1297 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1298 = !{!1299, !1300}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1296, file: !1297, line: 224, baseType: !1086, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1296, file: !1297, line: 225, baseType: !1086, size: 64, align: 64, offset: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1249, file: !57, line: 3549, baseType: !1302, size: 64, align: 64, offset: 1152)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{null, !1283}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1249, file: !57, line: 3551, baseType: !1285, size: 64, align: 64, offset: 1216)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1249, file: !57, line: 3552, baseType: !1307, size: 64, align: 64, offset: 1280)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!942, !1156, !955, !942, !1310}
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1312)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1313)
!1313 = !{!1314, !1315, !1316, !1317, !1318, !1347}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1312, file: !57, line: 3921, baseType: !957, size: 16, align: 16)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1312, file: !57, line: 3922, baseType: !951, size: 32, align: 32, offset: 32)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1312, file: !57, line: 3923, baseType: !951, size: 32, align: 32, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1312, file: !57, line: 3924, baseType: !943, size: 32, align: 32, offset: 96)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1312, file: !57, line: 3925, baseType: !1319, size: 64, align: 64, offset: 128)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1322)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1323)
!1323 = !{!1324, !1325, !1326, !1327, !1328, !1329, !1338, !1340, !1342, !1343, !1345, !1346}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1322, file: !57, line: 3886, baseType: !942, size: 32, align: 32)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1322, file: !57, line: 3887, baseType: !942, size: 32, align: 32, offset: 32)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1322, file: !57, line: 3888, baseType: !942, size: 32, align: 32, offset: 64)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1322, file: !57, line: 3889, baseType: !942, size: 32, align: 32, offset: 96)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1322, file: !57, line: 3890, baseType: !942, size: 32, align: 32, offset: 128)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1322, file: !57, line: 3897, baseType: !1330, size: 768, align: 64, offset: 192)
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1331)
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1332)
!1332 = !{!1333, !1336}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1331, file: !57, line: 3855, baseType: !1334, size: 512, align: 64)
!1334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 512, align: 64, elements: !1335)
!1335 = !{!1029}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1331, file: !57, line: 3857, baseType: !1337, size: 256, align: 32, offset: 512)
!1337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !942, size: 256, align: 32, elements: !1335)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1322, file: !57, line: 3903, baseType: !1339, size: 256, align: 64, offset: 960)
!1339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 256, align: 64, elements: !992)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1322, file: !57, line: 3904, baseType: !1341, size: 128, align: 32, offset: 1216)
!1341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !942, size: 128, align: 32, elements: !992)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1322, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1322, file: !57, line: 3908, baseType: !1344, size: 64, align: 64, offset: 1408)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1322, file: !57, line: 3915, baseType: !1344, size: 64, align: 64, offset: 1472)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1322, file: !57, line: 3917, baseType: !942, size: 32, align: 32, offset: 1536)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1312, file: !57, line: 3926, baseType: !1187, size: 64, align: 64, offset: 192)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1249, file: !57, line: 3564, baseType: !1349, size: 64, align: 64, offset: 1344)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{!942, !1156, !1352, !1386, !1468}
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1354)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1355)
!1355 = !{!1356, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1382, !1383, !1384, !1385}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1354, file: !57, line: 1451, baseType: !1357, size: 64, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1359, line: 94, baseType: !1360)
!1359 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1359, line: 81, size: 192, align: 64, elements: !1361)
!1361 = !{!1362, !1366, !1367}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1360, file: !1359, line: 82, baseType: !1363, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1359, line: 73, baseType: !1365)
!1365 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1359, line: 73, flags: DIFlagFwdDecl)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1360, file: !1359, line: 89, baseType: !955, size: 64, align: 64, offset: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1360, file: !1359, line: 93, baseType: !942, size: 32, align: 32, offset: 128)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1354, file: !57, line: 1461, baseType: !1187, size: 64, align: 64, offset: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1354, file: !57, line: 1467, baseType: !1187, size: 64, align: 64, offset: 128)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1354, file: !57, line: 1468, baseType: !955, size: 64, align: 64, offset: 192)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1354, file: !57, line: 1469, baseType: !942, size: 32, align: 32, offset: 256)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1354, file: !57, line: 1470, baseType: !942, size: 32, align: 32, offset: 288)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1354, file: !57, line: 1474, baseType: !942, size: 32, align: 32, offset: 320)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1354, file: !57, line: 1479, baseType: !1375, size: 64, align: 64, offset: 384)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1377)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1378)
!1378 = !{!1379, !1380, !1381}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1377, file: !57, line: 1412, baseType: !955, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1377, file: !57, line: 1413, baseType: !942, size: 32, align: 32, offset: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1377, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1354, file: !57, line: 1480, baseType: !942, size: 32, align: 32, offset: 448)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1354, file: !57, line: 1486, baseType: !1187, size: 64, align: 64, offset: 512)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1354, file: !57, line: 1488, baseType: !1187, size: 64, align: 64, offset: 576)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1354, file: !57, line: 1497, baseType: !1187, size: 64, align: 64, offset: 640)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1388)
!1388 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1389)
!1389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1390)
!1390 = !{!1391, !1392, !1393, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1420, !1422, !1423, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1456, !1457, !1458, !1459, !1460, !1461, !1464, !1465, !1466, !1467}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1389, file: !780, line: 282, baseType: !1334, size: 512, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1389, file: !780, line: 299, baseType: !1337, size: 256, align: 32, offset: 512)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1389, file: !780, line: 315, baseType: !1394, size: 64, align: 64, offset: 768)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1389, file: !780, line: 326, baseType: !942, size: 32, align: 32, offset: 832)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1389, file: !780, line: 326, baseType: !942, size: 32, align: 32, offset: 864)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1389, file: !780, line: 334, baseType: !942, size: 32, align: 32, offset: 896)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1389, file: !780, line: 341, baseType: !942, size: 32, align: 32, offset: 928)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1389, file: !780, line: 346, baseType: !942, size: 32, align: 32, offset: 960)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1389, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1389, file: !780, line: 356, baseType: !1193, size: 64, align: 32, offset: 1024)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1389, file: !780, line: 361, baseType: !1187, size: 64, align: 64, offset: 1088)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1389, file: !780, line: 369, baseType: !1187, size: 64, align: 64, offset: 1152)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1389, file: !780, line: 377, baseType: !1187, size: 64, align: 64, offset: 1216)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1389, file: !780, line: 382, baseType: !942, size: 32, align: 32, offset: 1280)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1389, file: !780, line: 386, baseType: !942, size: 32, align: 32, offset: 1312)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1389, file: !780, line: 391, baseType: !942, size: 32, align: 32, offset: 1344)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1389, file: !780, line: 396, baseType: !944, size: 64, align: 64, offset: 1408)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1389, file: !780, line: 403, baseType: !1410, size: 512, align: 64, offset: 1472)
!1410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 512, align: 64, elements: !1335)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1389, file: !780, line: 410, baseType: !942, size: 32, align: 32, offset: 1984)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1389, file: !780, line: 415, baseType: !942, size: 32, align: 32, offset: 2016)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1389, file: !780, line: 420, baseType: !942, size: 32, align: 32, offset: 2048)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1389, file: !780, line: 425, baseType: !942, size: 32, align: 32, offset: 2080)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1389, file: !780, line: 435, baseType: !1187, size: 64, align: 64, offset: 2112)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1389, file: !780, line: 440, baseType: !942, size: 32, align: 32, offset: 2176)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1389, file: !780, line: 445, baseType: !961, size: 64, align: 64, offset: 2240)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1389, file: !780, line: 459, baseType: !1419, size: 512, align: 64, offset: 2304)
!1419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1357, size: 512, align: 64, elements: !1335)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1389, file: !780, line: 473, baseType: !1421, size: 64, align: 64, offset: 2816)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1389, file: !780, line: 477, baseType: !942, size: 32, align: 32, offset: 2880)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1389, file: !780, line: 479, baseType: !1424, size: 64, align: 64, offset: 2944)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1427)
!1427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1428)
!1428 = !{!1429, !1430, !1431, !1432, !1437}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1427, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1427, file: !780, line: 203, baseType: !955, size: 64, align: 64, offset: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1427, file: !780, line: 204, baseType: !942, size: 32, align: 32, offset: 128)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1427, file: !780, line: 205, baseType: !1433, size: 64, align: 64, offset: 192)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1435, line: 86, baseType: !1436)
!1435 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1436 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1435, line: 86, flags: DIFlagFwdDecl)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1427, file: !780, line: 206, baseType: !1357, size: 64, align: 64, offset: 256)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1389, file: !780, line: 480, baseType: !942, size: 32, align: 32, offset: 3008)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1389, file: !780, line: 505, baseType: !942, size: 32, align: 32, offset: 3040)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1389, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1389, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1389, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1389, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1389, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1389, file: !780, line: 532, baseType: !1187, size: 64, align: 64, offset: 3264)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1389, file: !780, line: 539, baseType: !1187, size: 64, align: 64, offset: 3328)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1389, file: !780, line: 547, baseType: !1187, size: 64, align: 64, offset: 3392)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1389, file: !780, line: 554, baseType: !1433, size: 64, align: 64, offset: 3456)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1389, file: !780, line: 563, baseType: !942, size: 32, align: 32, offset: 3520)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1389, file: !780, line: 572, baseType: !942, size: 32, align: 32, offset: 3552)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1389, file: !780, line: 581, baseType: !942, size: 32, align: 32, offset: 3584)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1389, file: !780, line: 588, baseType: !1453, size: 64, align: 64, offset: 3648)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !952, line: 36, baseType: !1455)
!1455 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1389, file: !780, line: 593, baseType: !942, size: 32, align: 32, offset: 3712)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1389, file: !780, line: 596, baseType: !942, size: 32, align: 32, offset: 3744)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1389, file: !780, line: 599, baseType: !1357, size: 64, align: 64, offset: 3776)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1389, file: !780, line: 605, baseType: !1357, size: 64, align: 64, offset: 3840)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1389, file: !780, line: 616, baseType: !1357, size: 64, align: 64, offset: 3904)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1389, file: !780, line: 626, baseType: !1462, size: 64, align: 64, offset: 3968)
!1462 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1463, line: 216, baseType: !962)
!1463 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1389, file: !780, line: 627, baseType: !1462, size: 64, align: 64, offset: 4032)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1389, file: !780, line: 628, baseType: !1462, size: 64, align: 64, offset: 4096)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1389, file: !780, line: 629, baseType: !1462, size: 64, align: 64, offset: 4160)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1389, file: !780, line: 645, baseType: !1357, size: 64, align: 64, offset: 4224)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1249, file: !57, line: 3566, baseType: !1470, size: 64, align: 64, offset: 1408)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{!942, !1156, !944, !1468, !1352}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1249, file: !57, line: 3567, baseType: !1285, size: 64, align: 64, offset: 1472)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1249, file: !57, line: 3576, baseType: !1475, size: 64, align: 64, offset: 1536)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{!942, !1156, !1386}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1249, file: !57, line: 3577, baseType: !1479, size: 64, align: 64, offset: 1600)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{!942, !1156, !1352}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1249, file: !57, line: 3584, baseType: !1483, size: 64, align: 64, offset: 1664)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DISubroutineType(types: !1485)
!1485 = !{!942, !1156, !1486}
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1249, file: !57, line: 3589, baseType: !1488, size: 64, align: 64, offset: 1728)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{null, !1156}
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1249, file: !57, line: 3594, baseType: !942, size: 32, align: 32, offset: 1792)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1249, file: !57, line: 3600, baseType: !1167, size: 64, align: 64, offset: 1856)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1249, file: !57, line: 3609, baseType: !1494, size: 64, align: 64, offset: 1920)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1497)
!1497 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1158, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1158, file: !57, line: 1581, baseType: !943, size: 32, align: 32, offset: 224)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1158, file: !57, line: 1583, baseType: !944, size: 64, align: 64, offset: 256)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1158, file: !57, line: 1591, baseType: !1502, size: 64, align: 64, offset: 320)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1297, line: 129, size: 1664, align: 64, elements: !1504)
!1504 = !{!1505, !1506, !1507, !1508, !1509, !1527, !1528, !1534, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1503, file: !1297, line: 136, baseType: !942, size: 32, align: 32)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1503, file: !1297, line: 151, baseType: !942, size: 32, align: 32, offset: 32)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1503, file: !1297, line: 157, baseType: !942, size: 32, align: 32, offset: 64)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1503, file: !1297, line: 159, baseType: !1486, size: 64, align: 64, offset: 128)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1503, file: !1297, line: 161, baseType: !1510, size: 64, align: 64, offset: 192)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1297, line: 117, baseType: !1512)
!1512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1297, line: 100, size: 832, align: 64, elements: !1513)
!1513 = !{!1514, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1512, file: !1297, line: 105, baseType: !1515, size: 256, align: 64)
!1515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1516, size: 256, align: 64, elements: !992)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1359, line: 238, baseType: !1518)
!1518 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1359, line: 238, flags: DIFlagFwdDecl)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1512, file: !1297, line: 110, baseType: !942, size: 32, align: 32, offset: 256)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1512, file: !1297, line: 111, baseType: !942, size: 32, align: 32, offset: 288)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1512, file: !1297, line: 111, baseType: !942, size: 32, align: 32, offset: 320)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1512, file: !1297, line: 112, baseType: !1337, size: 256, align: 32, offset: 352)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1512, file: !1297, line: 113, baseType: !1341, size: 128, align: 32, offset: 608)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1512, file: !1297, line: 114, baseType: !942, size: 32, align: 32, offset: 736)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1512, file: !1297, line: 115, baseType: !942, size: 32, align: 32, offset: 768)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1512, file: !1297, line: 116, baseType: !942, size: 32, align: 32, offset: 800)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1503, file: !1297, line: 163, baseType: !944, size: 64, align: 64, offset: 256)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1503, file: !1297, line: 165, baseType: !1529, size: 128, align: 64, offset: 320)
!1529 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1297, line: 122, baseType: !1530)
!1530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1297, line: 119, size: 128, align: 64, elements: !1531)
!1531 = !{!1532, !1533}
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1530, file: !1297, line: 120, baseType: !1352, size: 64, align: 64)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1530, file: !1297, line: 121, baseType: !1486, size: 64, align: 64, offset: 64)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1503, file: !1297, line: 166, baseType: !1535, size: 128, align: 64, offset: 448)
!1535 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1297, line: 127, baseType: !1536)
!1536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1297, line: 124, size: 128, align: 64, elements: !1537)
!1537 = !{!1538, !1611}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1536, file: !1297, line: 125, baseType: !1539, size: 64, align: 64)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64, align: 64)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1542)
!1542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1543)
!1543 = !{!1544, !1545, !1569, !1573, !1574, !1608, !1609, !1610}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1542, file: !57, line: 5751, baseType: !1161, size: 64, align: 64)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1542, file: !57, line: 5756, baseType: !1546, size: 64, align: 64, offset: 64)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1548)
!1548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1549)
!1549 = !{!1550, !1551, !1554, !1555, !1556, !1560, !1564, !1568}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1548, file: !57, line: 5797, baseType: !1167, size: 64, align: 64)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1548, file: !57, line: 5804, baseType: !1552, size: 64, align: 64, offset: 64)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1548, file: !57, line: 5815, baseType: !1161, size: 64, align: 64, offset: 128)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1548, file: !57, line: 5825, baseType: !942, size: 32, align: 32, offset: 192)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1548, file: !57, line: 5826, baseType: !1557, size: 64, align: 64, offset: 256)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DISubroutineType(types: !1559)
!1559 = !{!942, !1540}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1548, file: !57, line: 5827, baseType: !1561, size: 64, align: 64, offset: 320)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{!942, !1540, !1352}
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1548, file: !57, line: 5828, baseType: !1565, size: 64, align: 64, offset: 384)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1566, size: 64, align: 64)
!1566 = !DISubroutineType(types: !1567)
!1567 = !{null, !1540}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1548, file: !57, line: 5829, baseType: !1565, size: 64, align: 64, offset: 448)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1542, file: !57, line: 5762, baseType: !1570, size: 64, align: 64, offset: 128)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1572)
!1572 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1542, file: !57, line: 5768, baseType: !944, size: 64, align: 64, offset: 192)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1542, file: !57, line: 5775, baseType: !1575, size: 64, align: 64, offset: 256)
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1576, size: 64, align: 64)
!1576 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1577)
!1577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1578)
!1578 = !{!1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607}
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1577, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1577, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1577, file: !57, line: 3948, baseType: !951, size: 32, align: 32, offset: 64)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1577, file: !57, line: 3958, baseType: !955, size: 64, align: 64, offset: 128)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1577, file: !57, line: 3962, baseType: !942, size: 32, align: 32, offset: 192)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1577, file: !57, line: 3968, baseType: !942, size: 32, align: 32, offset: 224)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1577, file: !57, line: 3973, baseType: !1187, size: 64, align: 64, offset: 256)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1577, file: !57, line: 3986, baseType: !942, size: 32, align: 32, offset: 320)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1577, file: !57, line: 3999, baseType: !942, size: 32, align: 32, offset: 352)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1577, file: !57, line: 4004, baseType: !942, size: 32, align: 32, offset: 384)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1577, file: !57, line: 4005, baseType: !942, size: 32, align: 32, offset: 416)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1577, file: !57, line: 4010, baseType: !942, size: 32, align: 32, offset: 448)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1577, file: !57, line: 4011, baseType: !942, size: 32, align: 32, offset: 480)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1577, file: !57, line: 4020, baseType: !1193, size: 64, align: 32, offset: 512)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1577, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1577, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1577, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1577, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1577, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1577, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1577, file: !57, line: 4039, baseType: !942, size: 32, align: 32, offset: 768)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1577, file: !57, line: 4046, baseType: !961, size: 64, align: 64, offset: 832)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1577, file: !57, line: 4050, baseType: !942, size: 32, align: 32, offset: 896)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1577, file: !57, line: 4054, baseType: !942, size: 32, align: 32, offset: 928)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1577, file: !57, line: 4061, baseType: !942, size: 32, align: 32, offset: 960)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1577, file: !57, line: 4065, baseType: !942, size: 32, align: 32, offset: 992)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1577, file: !57, line: 4073, baseType: !942, size: 32, align: 32, offset: 1024)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1577, file: !57, line: 4080, baseType: !942, size: 32, align: 32, offset: 1056)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1577, file: !57, line: 4084, baseType: !942, size: 32, align: 32, offset: 1088)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1542, file: !57, line: 5781, baseType: !1575, size: 64, align: 64, offset: 320)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1542, file: !57, line: 5787, baseType: !1193, size: 64, align: 32, offset: 384)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1542, file: !57, line: 5793, baseType: !1193, size: 64, align: 32, offset: 448)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1536, file: !1297, line: 126, baseType: !942, size: 32, align: 32, offset: 64)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1503, file: !1297, line: 172, baseType: !1352, size: 64, align: 64, offset: 576)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1503, file: !1297, line: 177, baseType: !955, size: 64, align: 64, offset: 640)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1503, file: !1297, line: 178, baseType: !943, size: 32, align: 32, offset: 704)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1503, file: !1297, line: 180, baseType: !944, size: 64, align: 64, offset: 768)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1503, file: !1297, line: 185, baseType: !942, size: 32, align: 32, offset: 832)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1503, file: !1297, line: 190, baseType: !944, size: 64, align: 64, offset: 896)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1503, file: !1297, line: 195, baseType: !942, size: 32, align: 32, offset: 960)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1503, file: !1297, line: 200, baseType: !1352, size: 64, align: 64, offset: 1024)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1503, file: !1297, line: 201, baseType: !942, size: 32, align: 32, offset: 1088)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1503, file: !1297, line: 202, baseType: !1486, size: 64, align: 64, offset: 1152)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1503, file: !1297, line: 203, baseType: !942, size: 32, align: 32, offset: 1216)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1503, file: !1297, line: 205, baseType: !942, size: 32, align: 32, offset: 1248)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1503, file: !1297, line: 206, baseType: !942, size: 32, align: 32, offset: 1280)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1503, file: !1297, line: 209, baseType: !1462, size: 64, align: 64, offset: 1344)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1503, file: !1297, line: 212, baseType: !1462, size: 64, align: 64, offset: 1408)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1503, file: !1297, line: 213, baseType: !1486, size: 64, align: 64, offset: 1472)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1503, file: !1297, line: 215, baseType: !942, size: 32, align: 32, offset: 1536)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1503, file: !1297, line: 217, baseType: !942, size: 32, align: 32, offset: 1568)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1503, file: !1297, line: 220, baseType: !942, size: 32, align: 32, offset: 1600)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1158, file: !57, line: 1598, baseType: !944, size: 64, align: 64, offset: 384)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1158, file: !57, line: 1606, baseType: !1187, size: 64, align: 64, offset: 448)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1158, file: !57, line: 1614, baseType: !942, size: 32, align: 32, offset: 512)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1158, file: !57, line: 1622, baseType: !942, size: 32, align: 32, offset: 544)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1158, file: !57, line: 1628, baseType: !942, size: 32, align: 32, offset: 576)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1158, file: !57, line: 1636, baseType: !942, size: 32, align: 32, offset: 608)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1158, file: !57, line: 1643, baseType: !942, size: 32, align: 32, offset: 640)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1158, file: !57, line: 1657, baseType: !955, size: 64, align: 64, offset: 704)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1158, file: !57, line: 1658, baseType: !942, size: 32, align: 32, offset: 768)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1158, file: !57, line: 1679, baseType: !1193, size: 64, align: 32, offset: 800)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1158, file: !57, line: 1688, baseType: !942, size: 32, align: 32, offset: 864)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1158, file: !57, line: 1712, baseType: !942, size: 32, align: 32, offset: 896)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1158, file: !57, line: 1729, baseType: !942, size: 32, align: 32, offset: 928)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1158, file: !57, line: 1729, baseType: !942, size: 32, align: 32, offset: 960)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1158, file: !57, line: 1744, baseType: !942, size: 32, align: 32, offset: 992)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1158, file: !57, line: 1744, baseType: !942, size: 32, align: 32, offset: 1024)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1158, file: !57, line: 1751, baseType: !942, size: 32, align: 32, offset: 1056)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1158, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1158, file: !57, line: 1791, baseType: !1650, size: 64, align: 64, offset: 1152)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DISubroutineType(types: !1652)
!1652 = !{null, !1653, !1386, !1468, !942, !942, !942}
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1158, file: !57, line: 1808, baseType: !1655, size: 64, align: 64, offset: 1216)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DISubroutineType(types: !1657)
!1657 = !{!516, !1653, !1260}
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1158, file: !57, line: 1816, baseType: !942, size: 32, align: 32, offset: 1280)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1158, file: !57, line: 1825, baseType: !1660, size: 32, align: 32, offset: 1312)
!1660 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1158, file: !57, line: 1830, baseType: !942, size: 32, align: 32, offset: 1344)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1158, file: !57, line: 1838, baseType: !1660, size: 32, align: 32, offset: 1376)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1158, file: !57, line: 1846, baseType: !942, size: 32, align: 32, offset: 1408)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1158, file: !57, line: 1851, baseType: !942, size: 32, align: 32, offset: 1440)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1158, file: !57, line: 1861, baseType: !1660, size: 32, align: 32, offset: 1472)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1158, file: !57, line: 1868, baseType: !1660, size: 32, align: 32, offset: 1504)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1158, file: !57, line: 1875, baseType: !1660, size: 32, align: 32, offset: 1536)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1158, file: !57, line: 1882, baseType: !1660, size: 32, align: 32, offset: 1568)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1158, file: !57, line: 1889, baseType: !1660, size: 32, align: 32, offset: 1600)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1158, file: !57, line: 1896, baseType: !1660, size: 32, align: 32, offset: 1632)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1158, file: !57, line: 1903, baseType: !1660, size: 32, align: 32, offset: 1664)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1158, file: !57, line: 1910, baseType: !942, size: 32, align: 32, offset: 1696)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1158, file: !57, line: 1915, baseType: !942, size: 32, align: 32, offset: 1728)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1158, file: !57, line: 1926, baseType: !1468, size: 64, align: 64, offset: 1792)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1158, file: !57, line: 1935, baseType: !1193, size: 64, align: 32, offset: 1856)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1158, file: !57, line: 1942, baseType: !942, size: 32, align: 32, offset: 1920)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1158, file: !57, line: 1948, baseType: !942, size: 32, align: 32, offset: 1952)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1158, file: !57, line: 1954, baseType: !942, size: 32, align: 32, offset: 1984)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1158, file: !57, line: 1960, baseType: !942, size: 32, align: 32, offset: 2016)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1158, file: !57, line: 1984, baseType: !942, size: 32, align: 32, offset: 2048)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1158, file: !57, line: 1991, baseType: !942, size: 32, align: 32, offset: 2080)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1158, file: !57, line: 1996, baseType: !942, size: 32, align: 32, offset: 2112)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1158, file: !57, line: 2004, baseType: !942, size: 32, align: 32, offset: 2144)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1158, file: !57, line: 2011, baseType: !942, size: 32, align: 32, offset: 2176)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1158, file: !57, line: 2018, baseType: !942, size: 32, align: 32, offset: 2208)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1158, file: !57, line: 2027, baseType: !942, size: 32, align: 32, offset: 2240)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1158, file: !57, line: 2034, baseType: !942, size: 32, align: 32, offset: 2272)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1158, file: !57, line: 2044, baseType: !942, size: 32, align: 32, offset: 2304)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1158, file: !57, line: 2054, baseType: !956, size: 64, align: 64, offset: 2368)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1158, file: !57, line: 2061, baseType: !956, size: 64, align: 64, offset: 2432)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1158, file: !57, line: 2066, baseType: !942, size: 32, align: 32, offset: 2496)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1158, file: !57, line: 2070, baseType: !942, size: 32, align: 32, offset: 2528)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1158, file: !57, line: 2078, baseType: !942, size: 32, align: 32, offset: 2560)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1158, file: !57, line: 2085, baseType: !942, size: 32, align: 32, offset: 2592)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1158, file: !57, line: 2092, baseType: !942, size: 32, align: 32, offset: 2624)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1158, file: !57, line: 2099, baseType: !942, size: 32, align: 32, offset: 2656)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1158, file: !57, line: 2106, baseType: !942, size: 32, align: 32, offset: 2688)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1158, file: !57, line: 2113, baseType: !942, size: 32, align: 32, offset: 2720)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1158, file: !57, line: 2120, baseType: !942, size: 32, align: 32, offset: 2752)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1158, file: !57, line: 2125, baseType: !942, size: 32, align: 32, offset: 2784)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1158, file: !57, line: 2133, baseType: !942, size: 32, align: 32, offset: 2816)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1158, file: !57, line: 2140, baseType: !942, size: 32, align: 32, offset: 2848)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1158, file: !57, line: 2145, baseType: !942, size: 32, align: 32, offset: 2880)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1158, file: !57, line: 2153, baseType: !942, size: 32, align: 32, offset: 2912)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1158, file: !57, line: 2158, baseType: !942, size: 32, align: 32, offset: 2944)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1158, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1158, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1158, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1158, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1158, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1158, file: !57, line: 2203, baseType: !942, size: 32, align: 32, offset: 3136)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1158, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1158, file: !57, line: 2212, baseType: !942, size: 32, align: 32, offset: 3200)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1158, file: !57, line: 2213, baseType: !942, size: 32, align: 32, offset: 3232)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1158, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1158, file: !57, line: 2232, baseType: !942, size: 32, align: 32, offset: 3296)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1158, file: !57, line: 2243, baseType: !942, size: 32, align: 32, offset: 3328)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1158, file: !57, line: 2249, baseType: !942, size: 32, align: 32, offset: 3360)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1158, file: !57, line: 2256, baseType: !942, size: 32, align: 32, offset: 3392)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1158, file: !57, line: 2263, baseType: !961, size: 64, align: 64, offset: 3456)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1158, file: !57, line: 2270, baseType: !961, size: 64, align: 64, offset: 3520)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1158, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1158, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1158, file: !57, line: 2367, baseType: !1725, size: 64, align: 64, offset: 3648)
!1725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1726, size: 64, align: 64)
!1726 = !DISubroutineType(types: !1727)
!1727 = !{!942, !1653, !1486, !942}
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1158, file: !57, line: 2383, baseType: !942, size: 32, align: 32, offset: 3712)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1158, file: !57, line: 2386, baseType: !1660, size: 32, align: 32, offset: 3744)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1158, file: !57, line: 2387, baseType: !1660, size: 32, align: 32, offset: 3776)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1158, file: !57, line: 2394, baseType: !942, size: 32, align: 32, offset: 3808)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1158, file: !57, line: 2401, baseType: !942, size: 32, align: 32, offset: 3840)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1158, file: !57, line: 2408, baseType: !942, size: 32, align: 32, offset: 3872)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1158, file: !57, line: 2415, baseType: !942, size: 32, align: 32, offset: 3904)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1158, file: !57, line: 2422, baseType: !942, size: 32, align: 32, offset: 3936)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1158, file: !57, line: 2423, baseType: !1737, size: 64, align: 64, offset: 3968)
!1737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1738, size: 64, align: 64)
!1738 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1739)
!1739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1740)
!1740 = !{!1741, !1742, !1743, !1744}
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1739, file: !57, line: 827, baseType: !942, size: 32, align: 32)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1739, file: !57, line: 828, baseType: !942, size: 32, align: 32, offset: 32)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1739, file: !57, line: 829, baseType: !942, size: 32, align: 32, offset: 64)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1739, file: !57, line: 830, baseType: !1660, size: 32, align: 32, offset: 96)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1158, file: !57, line: 2430, baseType: !1187, size: 64, align: 64, offset: 4032)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1158, file: !57, line: 2437, baseType: !1187, size: 64, align: 64, offset: 4096)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1158, file: !57, line: 2444, baseType: !1660, size: 32, align: 32, offset: 4160)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1158, file: !57, line: 2451, baseType: !1660, size: 32, align: 32, offset: 4192)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1158, file: !57, line: 2458, baseType: !942, size: 32, align: 32, offset: 4224)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1158, file: !57, line: 2469, baseType: !942, size: 32, align: 32, offset: 4256)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1158, file: !57, line: 2475, baseType: !942, size: 32, align: 32, offset: 4288)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1158, file: !57, line: 2481, baseType: !942, size: 32, align: 32, offset: 4320)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1158, file: !57, line: 2485, baseType: !942, size: 32, align: 32, offset: 4352)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1158, file: !57, line: 2489, baseType: !942, size: 32, align: 32, offset: 4384)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1158, file: !57, line: 2493, baseType: !942, size: 32, align: 32, offset: 4416)
