; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--aaccoder.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--aaccoder.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawDataBlockType", file: !907, line: 55, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932, !933, !934, !935, !936}
!929 = !DIEnumerator(name: "TYPE_SCE", value: 0)
!930 = !DIEnumerator(name: "TYPE_CPE", value: 1)
!931 = !DIEnumerator(name: "TYPE_CCE", value: 2)
!932 = !DIEnumerator(name: "TYPE_LFE", value: 3)
!933 = !DIEnumerator(name: "TYPE_DSE", value: 4)
!934 = !DIEnumerator(name: "TYPE_PCE", value: 5)
!935 = !DIEnumerator(name: "TYPE_FIL", value: 6)
!936 = !DIEnumerator(name: "TYPE_END", value: 7)
!937 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OCStatus", file: !907, line: 115, size: 32, align: 32, elements: !938)
!938 = !{!939, !940, !941, !942, !943}
!939 = !DIEnumerator(name: "OC_NONE", value: 0)
!940 = !DIEnumerator(name: "OC_TRIAL_PCE", value: 1)
!941 = !DIEnumerator(name: "OC_TRIAL_FRAME", value: 2)
!942 = !DIEnumerator(name: "OC_GLOBAL_HDR", value: 3)
!943 = !DIEnumerator(name: "OC_LOCKED", value: 4)
!944 = !{!945, !953, !954}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !947, line: 221, size: 32, align: 8, elements: !948)
!947 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!948 = !{!949}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !946, file: !947, line: 221, baseType: !950, size: 32, align: 32)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !951, line: 51, baseType: !952)
!951 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!952 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!954 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!955 = !{!956, !2727, !2733, !2740, !2744, !2745, !2746, !2750, !2752, !2755, !2757}
!956 = distinct !DIGlobalVariable(name: "ff_aac_coders", scope: !0, file: !957, line: 897, type: !958, isLocal: false, isDefinition: true, variable: [3 x %struct.AACCoefficientsEncoder]* @ff_aac_coders)
!957 = !DIFile(filename: "libavcodec/aaccoder.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 3840, align: 64, elements: !2154)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACCoefficientsEncoder", file: !961, line: 80, baseType: !962)
!961 = !DIFile(filename: "libavcodec/aacenc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACCoefficientsEncoder", file: !961, line: 56, size: 1280, align: 64, elements: !963)
!963 = !{!964, !2683, !2687, !2692, !2696, !2700, !2701, !2705, !2706, !2707, !2708, !2709, !2713, !2714, !2718, !2719, !2720, !2721, !2722, !2726}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "search_for_quantizers", scope: !962, file: !961, line: 57, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{null, !968, !1695, !2458, !1781}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !971)
!971 = !{!972, !1017, !1018, !1019, !1294, !1295, !1296, !1297, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1450, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1633, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !970, file: !35, line: 1561, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !977)
!977 = !{!978, !982, !986, !990, !992, !993, !994, !998, !1004, !1006, !1010}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !976, file: !4, line: 72, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !976, file: !4, line: 78, baseType: !983, size: 64, align: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!979, !953}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !976, file: !4, line: 85, baseType: !987, size: 64, align: 64, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !976, file: !4, line: 93, baseType: !991, size: 32, align: 32, offset: 192)
!991 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !976, file: !4, line: 99, baseType: !991, size: 32, align: 32, offset: 224)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !976, file: !4, line: 108, baseType: !991, size: 32, align: 32, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !976, file: !4, line: 113, baseType: !995, size: 64, align: 64, offset: 320)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!953, !953, !953}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !976, file: !4, line: 123, baseType: !999, size: 64, align: 64, offset: 384)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!1002, !1002}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !976, file: !4, line: 130, baseType: !1005, size: 32, align: 32, offset: 448)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !976, file: !4, line: 136, baseType: !1007, size: 64, align: 64, offset: 512)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!1005, !953}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !976, file: !4, line: 142, baseType: !1011, size: 64, align: 64, offset: 576)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!991, !1014, !953, !979, !991}
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !970, file: !35, line: 1562, baseType: !991, size: 32, align: 32, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !970, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !970, file: !35, line: 1565, baseType: !1020, size: 64, align: 64, offset: 128)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1023)
!1023 = !{!1024, !1025, !1026, !1027, !1028, !1029, !1038, !1041, !1044, !1047, !1052, !1055, !1056, !1064, !1065, !1066, !1068, !1072, !1078, !1089, !1093, !1094, !1144, !1265, !1269, !1270, !1274, !1278, !1283, !1287, !1288, !1289}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1022, file: !35, line: 3475, baseType: !979, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1022, file: !35, line: 3480, baseType: !979, size: 64, align: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1022, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1022, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1022, file: !35, line: 3487, baseType: !991, size: 32, align: 32, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1022, file: !35, line: 3488, baseType: !1030, size: 64, align: 64, offset: 256)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1033, line: 61, baseType: !1034)
!1033 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1033, line: 58, size: 64, align: 32, elements: !1035)
!1035 = !{!1036, !1037}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1034, file: !1033, line: 59, baseType: !991, size: 32, align: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1034, file: !1033, line: 60, baseType: !991, size: 32, align: 32, offset: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1022, file: !35, line: 3489, baseType: !1039, size: 64, align: 64, offset: 320)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1022, file: !35, line: 3490, baseType: !1042, size: 64, align: 64, offset: 384)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1022, file: !35, line: 3491, baseType: !1045, size: 64, align: 64, offset: 448)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1022, file: !35, line: 3492, baseType: !1048, size: 64, align: 64, offset: 512)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !951, line: 55, baseType: !1051)
!1051 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1022, file: !35, line: 3493, baseType: !1053, size: 8, align: 8, offset: 576)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !951, line: 48, baseType: !1054)
!1054 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1022, file: !35, line: 3494, baseType: !973, size: 64, align: 64, offset: 640)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1022, file: !35, line: 3495, baseType: !1057, size: 64, align: 64, offset: 704)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1059)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1061)
!1061 = !{!1062, !1063}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1060, file: !35, line: 3402, baseType: !991, size: 32, align: 32)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1060, file: !35, line: 3403, baseType: !979, size: 64, align: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1022, file: !35, line: 3507, baseType: !979, size: 64, align: 64, offset: 768)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1022, file: !35, line: 3516, baseType: !991, size: 32, align: 32, offset: 832)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1022, file: !35, line: 3517, baseType: !1067, size: 64, align: 64, offset: 896)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1022, file: !35, line: 3527, baseType: !1069, size: 64, align: 64, offset: 960)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!991, !968}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1022, file: !35, line: 3535, baseType: !1073, size: 64, align: 64, offset: 1024)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!991, !968, !1076}
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1022, file: !35, line: 3541, baseType: !1079, size: 64, align: 64, offset: 1088)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1081)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1083, line: 223, size: 128, align: 64, elements: !1084)
!1083 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1084 = !{!1085, !1088}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1082, file: !1083, line: 224, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1053)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1082, file: !1083, line: 225, baseType: !1086, size: 64, align: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1022, file: !35, line: 3549, baseType: !1090, size: 64, align: 64, offset: 1152)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{null, !1067}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1022, file: !35, line: 3551, baseType: !1069, size: 64, align: 64, offset: 1216)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1022, file: !35, line: 3552, baseType: !1095, size: 64, align: 64, offset: 1280)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!991, !968, !1098, !991, !1099}
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1102)
!1102 = !{!1103, !1106, !1107, !1108, !1109, !1141}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1101, file: !35, line: 3921, baseType: !1104, size: 16, align: 16)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !951, line: 49, baseType: !1105)
!1105 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1101, file: !35, line: 3922, baseType: !950, size: 32, align: 32, offset: 32)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1101, file: !35, line: 3923, baseType: !950, size: 32, align: 32, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1101, file: !35, line: 3924, baseType: !952, size: 32, align: 32, offset: 96)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1101, file: !35, line: 3925, baseType: !1110, size: 64, align: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1113)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1114)
!1114 = !{!1115, !1116, !1117, !1118, !1119, !1120, !1130, !1134, !1136, !1137, !1139, !1140}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1113, file: !35, line: 3886, baseType: !991, size: 32, align: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1113, file: !35, line: 3887, baseType: !991, size: 32, align: 32, offset: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1113, file: !35, line: 3888, baseType: !991, size: 32, align: 32, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1113, file: !35, line: 3889, baseType: !991, size: 32, align: 32, offset: 96)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1113, file: !35, line: 3890, baseType: !991, size: 32, align: 32, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1113, file: !35, line: 3897, baseType: !1121, size: 768, align: 64, offset: 192)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1123)
!1123 = !{!1124, !1128}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1122, file: !35, line: 3855, baseType: !1125, size: 512, align: 64)
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1098, size: 512, align: 64, elements: !1126)
!1126 = !{!1127}
!1127 = !DISubrange(count: 8)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1122, file: !35, line: 3857, baseType: !1129, size: 256, align: 32, offset: 512)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !991, size: 256, align: 32, elements: !1126)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1113, file: !35, line: 3903, baseType: !1131, size: 256, align: 64, offset: 960)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1098, size: 256, align: 64, elements: !1132)
!1132 = !{!1133}
!1133 = !DISubrange(count: 4)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1113, file: !35, line: 3904, baseType: !1135, size: 128, align: 32, offset: 1216)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !991, size: 128, align: 32, elements: !1132)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1113, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1113, file: !35, line: 3908, baseType: !1138, size: 64, align: 64, offset: 1408)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1113, file: !35, line: 3915, baseType: !1138, size: 64, align: 64, offset: 1472)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1113, file: !35, line: 3917, baseType: !991, size: 32, align: 32, offset: 1536)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1101, file: !35, line: 3926, baseType: !1142, size: 64, align: 64, offset: 192)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !951, line: 40, baseType: !1143)
!1143 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1022, file: !35, line: 3564, baseType: !1145, size: 64, align: 64, offset: 1344)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!991, !968, !1148, !1182, !1264}
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1150)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1151)
!1151 = !{!1152, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1178, !1179, !1180, !1181}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1150, file: !35, line: 1451, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1155, line: 94, baseType: !1156)
!1155 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1155, line: 81, size: 192, align: 64, elements: !1157)
!1157 = !{!1158, !1162, !1163}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1156, file: !1155, line: 82, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1155, line: 73, baseType: !1161)
!1161 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1155, line: 73, flags: DIFlagFwdDecl)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1156, file: !1155, line: 89, baseType: !1098, size: 64, align: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1156, file: !1155, line: 93, baseType: !991, size: 32, align: 32, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1150, file: !35, line: 1461, baseType: !1142, size: 64, align: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1150, file: !35, line: 1467, baseType: !1142, size: 64, align: 64, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1150, file: !35, line: 1468, baseType: !1098, size: 64, align: 64, offset: 192)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1150, file: !35, line: 1469, baseType: !991, size: 32, align: 32, offset: 256)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1150, file: !35, line: 1470, baseType: !991, size: 32, align: 32, offset: 288)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1150, file: !35, line: 1474, baseType: !991, size: 32, align: 32, offset: 320)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1150, file: !35, line: 1479, baseType: !1171, size: 64, align: 64, offset: 384)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1174)
!1174 = !{!1175, !1176, !1177}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1173, file: !35, line: 1412, baseType: !1098, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1173, file: !35, line: 1413, baseType: !991, size: 32, align: 32, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1173, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1150, file: !35, line: 1480, baseType: !991, size: 32, align: 32, offset: 448)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1150, file: !35, line: 1486, baseType: !1142, size: 64, align: 64, offset: 512)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1150, file: !35, line: 1488, baseType: !1142, size: 64, align: 64, offset: 576)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1150, file: !35, line: 1497, baseType: !1142, size: 64, align: 64, offset: 640)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1184)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1186)
!1186 = !{!1187, !1188, !1189, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1216, !1218, !1219, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1252, !1253, !1254, !1255, !1256, !1257, !1260, !1261, !1262, !1263}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1185, file: !758, line: 282, baseType: !1125, size: 512, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1185, file: !758, line: 299, baseType: !1129, size: 256, align: 32, offset: 512)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1185, file: !758, line: 315, baseType: !1190, size: 64, align: 64, offset: 768)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1185, file: !758, line: 326, baseType: !991, size: 32, align: 32, offset: 832)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1185, file: !758, line: 326, baseType: !991, size: 32, align: 32, offset: 864)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1185, file: !758, line: 334, baseType: !991, size: 32, align: 32, offset: 896)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1185, file: !758, line: 341, baseType: !991, size: 32, align: 32, offset: 928)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1185, file: !758, line: 346, baseType: !991, size: 32, align: 32, offset: 960)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1185, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1185, file: !758, line: 356, baseType: !1032, size: 64, align: 32, offset: 1024)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1185, file: !758, line: 361, baseType: !1142, size: 64, align: 64, offset: 1088)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1185, file: !758, line: 369, baseType: !1142, size: 64, align: 64, offset: 1152)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1185, file: !758, line: 377, baseType: !1142, size: 64, align: 64, offset: 1216)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1185, file: !758, line: 382, baseType: !991, size: 32, align: 32, offset: 1280)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1185, file: !758, line: 386, baseType: !991, size: 32, align: 32, offset: 1312)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1185, file: !758, line: 391, baseType: !991, size: 32, align: 32, offset: 1344)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1185, file: !758, line: 396, baseType: !953, size: 64, align: 64, offset: 1408)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1185, file: !758, line: 403, baseType: !1206, size: 512, align: 64, offset: 1472)
!1206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1050, size: 512, align: 64, elements: !1126)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1185, file: !758, line: 410, baseType: !991, size: 32, align: 32, offset: 1984)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1185, file: !758, line: 415, baseType: !991, size: 32, align: 32, offset: 2016)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1185, file: !758, line: 420, baseType: !991, size: 32, align: 32, offset: 2048)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1185, file: !758, line: 425, baseType: !991, size: 32, align: 32, offset: 2080)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1185, file: !758, line: 435, baseType: !1142, size: 64, align: 64, offset: 2112)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1185, file: !758, line: 440, baseType: !991, size: 32, align: 32, offset: 2176)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1185, file: !758, line: 445, baseType: !1050, size: 64, align: 64, offset: 2240)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1185, file: !758, line: 459, baseType: !1215, size: 512, align: 64, offset: 2304)
!1215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1153, size: 512, align: 64, elements: !1126)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1185, file: !758, line: 473, baseType: !1217, size: 64, align: 64, offset: 2816)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1185, file: !758, line: 477, baseType: !991, size: 32, align: 32, offset: 2880)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1185, file: !758, line: 479, baseType: !1220, size: 64, align: 64, offset: 2944)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1224)
!1224 = !{!1225, !1226, !1227, !1228, !1233}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1223, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1223, file: !758, line: 203, baseType: !1098, size: 64, align: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1223, file: !758, line: 204, baseType: !991, size: 32, align: 32, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1223, file: !758, line: 205, baseType: !1229, size: 64, align: 64, offset: 192)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1231, line: 86, baseType: !1232)
!1231 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1232 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1231, line: 86, flags: DIFlagFwdDecl)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1223, file: !758, line: 206, baseType: !1153, size: 64, align: 64, offset: 256)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1185, file: !758, line: 480, baseType: !991, size: 32, align: 32, offset: 3008)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1185, file: !758, line: 505, baseType: !991, size: 32, align: 32, offset: 3040)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1185, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1185, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1185, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1185, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1185, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1185, file: !758, line: 532, baseType: !1142, size: 64, align: 64, offset: 3264)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1185, file: !758, line: 539, baseType: !1142, size: 64, align: 64, offset: 3328)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1185, file: !758, line: 547, baseType: !1142, size: 64, align: 64, offset: 3392)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1185, file: !758, line: 554, baseType: !1229, size: 64, align: 64, offset: 3456)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1185, file: !758, line: 563, baseType: !991, size: 32, align: 32, offset: 3520)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1185, file: !758, line: 572, baseType: !991, size: 32, align: 32, offset: 3552)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1185, file: !758, line: 581, baseType: !991, size: 32, align: 32, offset: 3584)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1185, file: !758, line: 588, baseType: !1249, size: 64, align: 64, offset: 3648)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !951, line: 36, baseType: !1251)
!1251 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1185, file: !758, line: 593, baseType: !991, size: 32, align: 32, offset: 3712)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1185, file: !758, line: 596, baseType: !991, size: 32, align: 32, offset: 3744)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1185, file: !758, line: 599, baseType: !1153, size: 64, align: 64, offset: 3776)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1185, file: !758, line: 605, baseType: !1153, size: 64, align: 64, offset: 3840)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1185, file: !758, line: 616, baseType: !1153, size: 64, align: 64, offset: 3904)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1185, file: !758, line: 626, baseType: !1258, size: 64, align: 64, offset: 3968)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1259, line: 216, baseType: !1051)
!1259 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1185, file: !758, line: 627, baseType: !1258, size: 64, align: 64, offset: 4032)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1185, file: !758, line: 628, baseType: !1258, size: 64, align: 64, offset: 4096)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1185, file: !758, line: 629, baseType: !1258, size: 64, align: 64, offset: 4160)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1185, file: !758, line: 645, baseType: !1153, size: 64, align: 64, offset: 4224)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1022, file: !35, line: 3566, baseType: !1266, size: 64, align: 64, offset: 1408)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!991, !968, !953, !1264, !1148}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1022, file: !35, line: 3567, baseType: !1069, size: 64, align: 64, offset: 1472)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1022, file: !35, line: 3576, baseType: !1271, size: 64, align: 64, offset: 1536)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!991, !968, !1182}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1022, file: !35, line: 3577, baseType: !1275, size: 64, align: 64, offset: 1600)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!991, !968, !1148}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1022, file: !35, line: 3584, baseType: !1279, size: 64, align: 64, offset: 1664)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{!991, !968, !1282}
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1022, file: !35, line: 3589, baseType: !1284, size: 64, align: 64, offset: 1728)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{null, !968}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1022, file: !35, line: 3594, baseType: !991, size: 32, align: 32, offset: 1792)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1022, file: !35, line: 3600, baseType: !979, size: 64, align: 64, offset: 1856)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1022, file: !35, line: 3609, baseType: !1290, size: 64, align: 64, offset: 1920)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1293)
!1293 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !970, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !970, file: !35, line: 1581, baseType: !952, size: 32, align: 32, offset: 224)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !970, file: !35, line: 1583, baseType: !953, size: 64, align: 64, offset: 256)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !970, file: !35, line: 1591, baseType: !1298, size: 64, align: 64, offset: 320)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1083, line: 129, size: 1664, align: 64, elements: !1300)
!1300 = !{!1301, !1302, !1303, !1304, !1305, !1323, !1324, !1330, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1299, file: !1083, line: 136, baseType: !991, size: 32, align: 32)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1299, file: !1083, line: 151, baseType: !991, size: 32, align: 32, offset: 32)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1299, file: !1083, line: 157, baseType: !991, size: 32, align: 32, offset: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1299, file: !1083, line: 159, baseType: !1282, size: 64, align: 64, offset: 128)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1299, file: !1083, line: 161, baseType: !1306, size: 64, align: 64, offset: 192)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1083, line: 117, baseType: !1308)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1083, line: 100, size: 832, align: 64, elements: !1309)
!1309 = !{!1310, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1308, file: !1083, line: 105, baseType: !1311, size: 256, align: 64)
!1311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1312, size: 256, align: 64, elements: !1132)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1155, line: 238, baseType: !1314)
!1314 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1155, line: 238, flags: DIFlagFwdDecl)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1308, file: !1083, line: 110, baseType: !991, size: 32, align: 32, offset: 256)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1308, file: !1083, line: 111, baseType: !991, size: 32, align: 32, offset: 288)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1308, file: !1083, line: 111, baseType: !991, size: 32, align: 32, offset: 320)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1308, file: !1083, line: 112, baseType: !1129, size: 256, align: 32, offset: 352)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1308, file: !1083, line: 113, baseType: !1135, size: 128, align: 32, offset: 608)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1308, file: !1083, line: 114, baseType: !991, size: 32, align: 32, offset: 736)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1308, file: !1083, line: 115, baseType: !991, size: 32, align: 32, offset: 768)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1308, file: !1083, line: 116, baseType: !991, size: 32, align: 32, offset: 800)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1299, file: !1083, line: 163, baseType: !953, size: 64, align: 64, offset: 256)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1299, file: !1083, line: 165, baseType: !1325, size: 128, align: 64, offset: 320)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1083, line: 122, baseType: !1326)
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1083, line: 119, size: 128, align: 64, elements: !1327)
!1327 = !{!1328, !1329}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1326, file: !1083, line: 120, baseType: !1148, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1326, file: !1083, line: 121, baseType: !1282, size: 64, align: 64, offset: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1299, file: !1083, line: 166, baseType: !1331, size: 128, align: 64, offset: 448)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1083, line: 127, baseType: !1332)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1083, line: 124, size: 128, align: 64, elements: !1333)
!1333 = !{!1334, !1407}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1332, file: !1083, line: 125, baseType: !1335, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1338)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1339)
!1339 = !{!1340, !1341, !1365, !1369, !1370, !1404, !1405, !1406}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1338, file: !35, line: 5751, baseType: !973, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1338, file: !35, line: 5756, baseType: !1342, size: 64, align: 64, offset: 64)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1344)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1345)
!1345 = !{!1346, !1347, !1350, !1351, !1352, !1356, !1360, !1364}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1344, file: !35, line: 5797, baseType: !979, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1344, file: !35, line: 5804, baseType: !1348, size: 64, align: 64, offset: 64)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1344, file: !35, line: 5815, baseType: !973, size: 64, align: 64, offset: 128)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1344, file: !35, line: 5825, baseType: !991, size: 32, align: 32, offset: 192)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1344, file: !35, line: 5826, baseType: !1353, size: 64, align: 64, offset: 256)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DISubroutineType(types: !1355)
!1355 = !{!991, !1336}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1344, file: !35, line: 5827, baseType: !1357, size: 64, align: 64, offset: 320)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DISubroutineType(types: !1359)
!1359 = !{!991, !1336, !1148}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1344, file: !35, line: 5828, baseType: !1361, size: 64, align: 64, offset: 384)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DISubroutineType(types: !1363)
!1363 = !{null, !1336}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1344, file: !35, line: 5829, baseType: !1361, size: 64, align: 64, offset: 448)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1338, file: !35, line: 5762, baseType: !1366, size: 64, align: 64, offset: 128)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1368)
!1368 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1338, file: !35, line: 5768, baseType: !953, size: 64, align: 64, offset: 192)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1338, file: !35, line: 5775, baseType: !1371, size: 64, align: 64, offset: 256)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1373)
!1373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1374)
!1374 = !{!1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1373, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1373, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1373, file: !35, line: 3948, baseType: !950, size: 32, align: 32, offset: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1373, file: !35, line: 3958, baseType: !1098, size: 64, align: 64, offset: 128)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1373, file: !35, line: 3962, baseType: !991, size: 32, align: 32, offset: 192)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1373, file: !35, line: 3968, baseType: !991, size: 32, align: 32, offset: 224)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1373, file: !35, line: 3973, baseType: !1142, size: 64, align: 64, offset: 256)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1373, file: !35, line: 3986, baseType: !991, size: 32, align: 32, offset: 320)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1373, file: !35, line: 3999, baseType: !991, size: 32, align: 32, offset: 352)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1373, file: !35, line: 4004, baseType: !991, size: 32, align: 32, offset: 384)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1373, file: !35, line: 4005, baseType: !991, size: 32, align: 32, offset: 416)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1373, file: !35, line: 4010, baseType: !991, size: 32, align: 32, offset: 448)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1373, file: !35, line: 4011, baseType: !991, size: 32, align: 32, offset: 480)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1373, file: !35, line: 4020, baseType: !1032, size: 64, align: 32, offset: 512)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1373, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1373, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1373, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1373, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1373, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1373, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1373, file: !35, line: 4039, baseType: !991, size: 32, align: 32, offset: 768)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1373, file: !35, line: 4046, baseType: !1050, size: 64, align: 64, offset: 832)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1373, file: !35, line: 4050, baseType: !991, size: 32, align: 32, offset: 896)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1373, file: !35, line: 4054, baseType: !991, size: 32, align: 32, offset: 928)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1373, file: !35, line: 4061, baseType: !991, size: 32, align: 32, offset: 960)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1373, file: !35, line: 4065, baseType: !991, size: 32, align: 32, offset: 992)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1373, file: !35, line: 4073, baseType: !991, size: 32, align: 32, offset: 1024)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1373, file: !35, line: 4080, baseType: !991, size: 32, align: 32, offset: 1056)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1373, file: !35, line: 4084, baseType: !991, size: 32, align: 32, offset: 1088)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1338, file: !35, line: 5781, baseType: !1371, size: 64, align: 64, offset: 320)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1338, file: !35, line: 5787, baseType: !1032, size: 64, align: 32, offset: 384)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1338, file: !35, line: 5793, baseType: !1032, size: 64, align: 32, offset: 448)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1332, file: !1083, line: 126, baseType: !991, size: 32, align: 32, offset: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1299, file: !1083, line: 172, baseType: !1148, size: 64, align: 64, offset: 576)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1299, file: !1083, line: 177, baseType: !1098, size: 64, align: 64, offset: 640)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1299, file: !1083, line: 178, baseType: !952, size: 32, align: 32, offset: 704)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1299, file: !1083, line: 180, baseType: !953, size: 64, align: 64, offset: 768)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1299, file: !1083, line: 185, baseType: !991, size: 32, align: 32, offset: 832)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1299, file: !1083, line: 190, baseType: !953, size: 64, align: 64, offset: 896)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1299, file: !1083, line: 195, baseType: !991, size: 32, align: 32, offset: 960)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1299, file: !1083, line: 200, baseType: !1148, size: 64, align: 64, offset: 1024)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1299, file: !1083, line: 201, baseType: !991, size: 32, align: 32, offset: 1088)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1299, file: !1083, line: 202, baseType: !1282, size: 64, align: 64, offset: 1152)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1299, file: !1083, line: 203, baseType: !991, size: 32, align: 32, offset: 1216)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1299, file: !1083, line: 205, baseType: !991, size: 32, align: 32, offset: 1248)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1299, file: !1083, line: 206, baseType: !991, size: 32, align: 32, offset: 1280)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1299, file: !1083, line: 209, baseType: !1258, size: 64, align: 64, offset: 1344)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1299, file: !1083, line: 212, baseType: !1258, size: 64, align: 64, offset: 1408)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1299, file: !1083, line: 213, baseType: !1282, size: 64, align: 64, offset: 1472)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1299, file: !1083, line: 215, baseType: !991, size: 32, align: 32, offset: 1536)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1299, file: !1083, line: 217, baseType: !991, size: 32, align: 32, offset: 1568)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1299, file: !1083, line: 220, baseType: !991, size: 32, align: 32, offset: 1600)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !970, file: !35, line: 1598, baseType: !953, size: 64, align: 64, offset: 384)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !970, file: !35, line: 1606, baseType: !1142, size: 64, align: 64, offset: 448)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !970, file: !35, line: 1614, baseType: !991, size: 32, align: 32, offset: 512)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !970, file: !35, line: 1622, baseType: !991, size: 32, align: 32, offset: 544)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !970, file: !35, line: 1628, baseType: !991, size: 32, align: 32, offset: 576)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !970, file: !35, line: 1636, baseType: !991, size: 32, align: 32, offset: 608)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !970, file: !35, line: 1643, baseType: !991, size: 32, align: 32, offset: 640)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !970, file: !35, line: 1657, baseType: !1098, size: 64, align: 64, offset: 704)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !970, file: !35, line: 1658, baseType: !991, size: 32, align: 32, offset: 768)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !970, file: !35, line: 1679, baseType: !1032, size: 64, align: 32, offset: 800)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !970, file: !35, line: 1688, baseType: !991, size: 32, align: 32, offset: 864)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !970, file: !35, line: 1712, baseType: !991, size: 32, align: 32, offset: 896)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !970, file: !35, line: 1729, baseType: !991, size: 32, align: 32, offset: 928)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !970, file: !35, line: 1729, baseType: !991, size: 32, align: 32, offset: 960)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !970, file: !35, line: 1744, baseType: !991, size: 32, align: 32, offset: 992)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !970, file: !35, line: 1744, baseType: !991, size: 32, align: 32, offset: 1024)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !970, file: !35, line: 1751, baseType: !991, size: 32, align: 32, offset: 1056)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !970, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !970, file: !35, line: 1791, baseType: !1446, size: 64, align: 64, offset: 1152)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DISubroutineType(types: !1448)
!1448 = !{null, !1449, !1182, !1264, !991, !991, !991}
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !970, file: !35, line: 1808, baseType: !1451, size: 64, align: 64, offset: 1216)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DISubroutineType(types: !1453)
!1453 = !{!494, !1449, !1039}
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !970, file: !35, line: 1816, baseType: !991, size: 32, align: 32, offset: 1280)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !970, file: !35, line: 1825, baseType: !954, size: 32, align: 32, offset: 1312)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !970, file: !35, line: 1830, baseType: !991, size: 32, align: 32, offset: 1344)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !970, file: !35, line: 1838, baseType: !954, size: 32, align: 32, offset: 1376)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !970, file: !35, line: 1846, baseType: !991, size: 32, align: 32, offset: 1408)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !970, file: !35, line: 1851, baseType: !991, size: 32, align: 32, offset: 1440)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !970, file: !35, line: 1861, baseType: !954, size: 32, align: 32, offset: 1472)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !970, file: !35, line: 1868, baseType: !954, size: 32, align: 32, offset: 1504)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !970, file: !35, line: 1875, baseType: !954, size: 32, align: 32, offset: 1536)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !970, file: !35, line: 1882, baseType: !954, size: 32, align: 32, offset: 1568)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !970, file: !35, line: 1889, baseType: !954, size: 32, align: 32, offset: 1600)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !970, file: !35, line: 1896, baseType: !954, size: 32, align: 32, offset: 1632)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !970, file: !35, line: 1903, baseType: !954, size: 32, align: 32, offset: 1664)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !970, file: !35, line: 1910, baseType: !991, size: 32, align: 32, offset: 1696)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !970, file: !35, line: 1915, baseType: !991, size: 32, align: 32, offset: 1728)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !970, file: !35, line: 1926, baseType: !1264, size: 64, align: 64, offset: 1792)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !970, file: !35, line: 1935, baseType: !1032, size: 64, align: 32, offset: 1856)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !970, file: !35, line: 1942, baseType: !991, size: 32, align: 32, offset: 1920)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !970, file: !35, line: 1948, baseType: !991, size: 32, align: 32, offset: 1952)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !970, file: !35, line: 1954, baseType: !991, size: 32, align: 32, offset: 1984)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !970, file: !35, line: 1960, baseType: !991, size: 32, align: 32, offset: 2016)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !970, file: !35, line: 1984, baseType: !991, size: 32, align: 32, offset: 2048)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !970, file: !35, line: 1991, baseType: !991, size: 32, align: 32, offset: 2080)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !970, file: !35, line: 1996, baseType: !991, size: 32, align: 32, offset: 2112)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !970, file: !35, line: 2004, baseType: !991, size: 32, align: 32, offset: 2144)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !970, file: !35, line: 2011, baseType: !991, size: 32, align: 32, offset: 2176)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !970, file: !35, line: 2018, baseType: !991, size: 32, align: 32, offset: 2208)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !970, file: !35, line: 2027, baseType: !991, size: 32, align: 32, offset: 2240)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !970, file: !35, line: 2034, baseType: !991, size: 32, align: 32, offset: 2272)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !970, file: !35, line: 2044, baseType: !991, size: 32, align: 32, offset: 2304)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !970, file: !35, line: 2054, baseType: !1485, size: 64, align: 64, offset: 2368)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !970, file: !35, line: 2061, baseType: !1485, size: 64, align: 64, offset: 2432)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !970, file: !35, line: 2066, baseType: !991, size: 32, align: 32, offset: 2496)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !970, file: !35, line: 2070, baseType: !991, size: 32, align: 32, offset: 2528)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !970, file: !35, line: 2078, baseType: !991, size: 32, align: 32, offset: 2560)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !970, file: !35, line: 2085, baseType: !991, size: 32, align: 32, offset: 2592)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !970, file: !35, line: 2092, baseType: !991, size: 32, align: 32, offset: 2624)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !970, file: !35, line: 2099, baseType: !991, size: 32, align: 32, offset: 2656)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !970, file: !35, line: 2106, baseType: !991, size: 32, align: 32, offset: 2688)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !970, file: !35, line: 2113, baseType: !991, size: 32, align: 32, offset: 2720)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !970, file: !35, line: 2120, baseType: !991, size: 32, align: 32, offset: 2752)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !970, file: !35, line: 2125, baseType: !991, size: 32, align: 32, offset: 2784)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !970, file: !35, line: 2133, baseType: !991, size: 32, align: 32, offset: 2816)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !970, file: !35, line: 2140, baseType: !991, size: 32, align: 32, offset: 2848)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !970, file: !35, line: 2145, baseType: !991, size: 32, align: 32, offset: 2880)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !970, file: !35, line: 2153, baseType: !991, size: 32, align: 32, offset: 2912)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !970, file: !35, line: 2158, baseType: !991, size: 32, align: 32, offset: 2944)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !970, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !970, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !970, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !970, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !970, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !970, file: !35, line: 2203, baseType: !991, size: 32, align: 32, offset: 3136)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !970, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !970, file: !35, line: 2212, baseType: !991, size: 32, align: 32, offset: 3200)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !970, file: !35, line: 2213, baseType: !991, size: 32, align: 32, offset: 3232)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !970, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !970, file: !35, line: 2232, baseType: !991, size: 32, align: 32, offset: 3296)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !970, file: !35, line: 2243, baseType: !991, size: 32, align: 32, offset: 3328)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !970, file: !35, line: 2249, baseType: !991, size: 32, align: 32, offset: 3360)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !970, file: !35, line: 2256, baseType: !991, size: 32, align: 32, offset: 3392)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !970, file: !35, line: 2263, baseType: !1050, size: 64, align: 64, offset: 3456)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !970, file: !35, line: 2270, baseType: !1050, size: 64, align: 64, offset: 3520)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !970, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !970, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !970, file: !35, line: 2367, baseType: !1521, size: 64, align: 64, offset: 3648)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DISubroutineType(types: !1523)
!1523 = !{!991, !1449, !1282, !991}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !970, file: !35, line: 2383, baseType: !991, size: 32, align: 32, offset: 3712)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !970, file: !35, line: 2386, baseType: !954, size: 32, align: 32, offset: 3744)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !970, file: !35, line: 2387, baseType: !954, size: 32, align: 32, offset: 3776)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !970, file: !35, line: 2394, baseType: !991, size: 32, align: 32, offset: 3808)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !970, file: !35, line: 2401, baseType: !991, size: 32, align: 32, offset: 3840)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !970, file: !35, line: 2408, baseType: !991, size: 32, align: 32, offset: 3872)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !970, file: !35, line: 2415, baseType: !991, size: 32, align: 32, offset: 3904)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !970, file: !35, line: 2422, baseType: !991, size: 32, align: 32, offset: 3936)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !970, file: !35, line: 2423, baseType: !1533, size: 64, align: 64, offset: 3968)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64, align: 64)
!1534 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1535)
!1535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1536)
!1536 = !{!1537, !1538, !1539, !1540}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1535, file: !35, line: 827, baseType: !991, size: 32, align: 32)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1535, file: !35, line: 828, baseType: !991, size: 32, align: 32, offset: 32)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1535, file: !35, line: 829, baseType: !991, size: 32, align: 32, offset: 64)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1535, file: !35, line: 830, baseType: !954, size: 32, align: 32, offset: 96)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !970, file: !35, line: 2430, baseType: !1142, size: 64, align: 64, offset: 4032)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !970, file: !35, line: 2437, baseType: !1142, size: 64, align: 64, offset: 4096)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !970, file: !35, line: 2444, baseType: !954, size: 32, align: 32, offset: 4160)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !970, file: !35, line: 2451, baseType: !954, size: 32, align: 32, offset: 4192)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !970, file: !35, line: 2458, baseType: !991, size: 32, align: 32, offset: 4224)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !970, file: !35, line: 2469, baseType: !991, size: 32, align: 32, offset: 4256)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !970, file: !35, line: 2475, baseType: !991, size: 32, align: 32, offset: 4288)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !970, file: !35, line: 2481, baseType: !991, size: 32, align: 32, offset: 4320)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !970, file: !35, line: 2485, baseType: !991, size: 32, align: 32, offset: 4352)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !970, file: !35, line: 2489, baseType: !991, size: 32, align: 32, offset: 4384)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !970, file: !35, line: 2493, baseType: !991, size: 32, align: 32, offset: 4416)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !970, file: !35, line: 2501, baseType: !991, size: 32, align: 32, offset: 4448)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !970, file: !35, line: 2506, baseType: !991, size: 32, align: 32, offset: 4480)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !970, file: !35, line: 2510, baseType: !991, size: 32, align: 32, offset: 4512)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !970, file: !35, line: 2514, baseType: !1142, size: 64, align: 64, offset: 4544)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !970, file: !35, line: 2528, baseType: !1557, size: 64, align: 64, offset: 4608)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DISubroutineType(types: !1559)
!1559 = !{null, !1449, !953, !991, !991}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !970, file: !35, line: 2534, baseType: !991, size: 32, align: 32, offset: 4672)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !970, file: !35, line: 2545, baseType: !991, size: 32, align: 32, offset: 4704)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !970, file: !35, line: 2547, baseType: !991, size: 32, align: 32, offset: 4736)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !970, file: !35, line: 2549, baseType: !991, size: 32, align: 32, offset: 4768)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !970, file: !35, line: 2551, baseType: !991, size: 32, align: 32, offset: 4800)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !970, file: !35, line: 2553, baseType: !991, size: 32, align: 32, offset: 4832)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !970, file: !35, line: 2555, baseType: !991, size: 32, align: 32, offset: 4864)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !970, file: !35, line: 2557, baseType: !991, size: 32, align: 32, offset: 4896)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !970, file: !35, line: 2559, baseType: !991, size: 32, align: 32, offset: 4928)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !970, file: !35, line: 2563, baseType: !991, size: 32, align: 32, offset: 4960)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !970, file: !35, line: 2571, baseType: !1138, size: 64, align: 64, offset: 4992)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !970, file: !35, line: 2579, baseType: !1138, size: 64, align: 64, offset: 5056)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !970, file: !35, line: 2586, baseType: !991, size: 32, align: 32, offset: 5120)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !970, file: !35, line: 2615, baseType: !991, size: 32, align: 32, offset: 5152)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !970, file: !35, line: 2627, baseType: !991, size: 32, align: 32, offset: 5184)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !970, file: !35, line: 2637, baseType: !991, size: 32, align: 32, offset: 5216)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !970, file: !35, line: 2681, baseType: !991, size: 32, align: 32, offset: 5248)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !970, file: !35, line: 2709, baseType: !1142, size: 64, align: 64, offset: 5312)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !970, file: !35, line: 2716, baseType: !1579, size: 64, align: 64, offset: 5376)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1581)
!1581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1582)
!1582 = !{!1583, !1584, !1585, !1586, !1587, !1588, !1589, !1593, !1597, !1598, !1599, !1600, !1606, !1607, !1608, !1609, !1610}
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1581, file: !35, line: 3642, baseType: !979, size: 64, align: 64)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1581, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1581, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1581, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1581, file: !35, line: 3669, baseType: !991, size: 32, align: 32, offset: 160)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1581, file: !35, line: 3682, baseType: !1279, size: 64, align: 64, offset: 192)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1581, file: !35, line: 3698, baseType: !1590, size: 64, align: 64, offset: 256)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64, align: 64)
!1591 = !DISubroutineType(types: !1592)
!1592 = !{!991, !968, !1086, !950}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1581, file: !35, line: 3712, baseType: !1594, size: 64, align: 64, offset: 320)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DISubroutineType(types: !1596)
!1596 = !{!991, !968, !991, !1086, !950}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1581, file: !35, line: 3726, baseType: !1590, size: 64, align: 64, offset: 384)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1581, file: !35, line: 3737, baseType: !1069, size: 64, align: 64, offset: 448)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1581, file: !35, line: 3746, baseType: !991, size: 32, align: 32, offset: 512)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1581, file: !35, line: 3757, baseType: !1601, size: 64, align: 64, offset: 576)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DISubroutineType(types: !1603)
!1603 = !{null, !1604}
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1581, file: !35, line: 3766, baseType: !1069, size: 64, align: 64, offset: 640)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1581, file: !35, line: 3774, baseType: !1069, size: 64, align: 64, offset: 704)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1581, file: !35, line: 3780, baseType: !991, size: 32, align: 32, offset: 768)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1581, file: !35, line: 3785, baseType: !991, size: 32, align: 32, offset: 800)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1581, file: !35, line: 3795, baseType: !1611, size: 64, align: 64, offset: 832)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DISubroutineType(types: !1613)
!1613 = !{!991, !968, !1153}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !970, file: !35, line: 2728, baseType: !953, size: 64, align: 64, offset: 5440)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !970, file: !35, line: 2735, baseType: !1206, size: 512, align: 64, offset: 5504)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !970, file: !35, line: 2742, baseType: !991, size: 32, align: 32, offset: 6016)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !970, file: !35, line: 2755, baseType: !991, size: 32, align: 32, offset: 6048)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !970, file: !35, line: 2776, baseType: !991, size: 32, align: 32, offset: 6080)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !970, file: !35, line: 2783, baseType: !991, size: 32, align: 32, offset: 6112)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !970, file: !35, line: 2791, baseType: !991, size: 32, align: 32, offset: 6144)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !970, file: !35, line: 2802, baseType: !1282, size: 64, align: 64, offset: 6208)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !970, file: !35, line: 2811, baseType: !991, size: 32, align: 32, offset: 6272)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !970, file: !35, line: 2821, baseType: !991, size: 32, align: 32, offset: 6304)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !970, file: !35, line: 2830, baseType: !991, size: 32, align: 32, offset: 6336)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !970, file: !35, line: 2840, baseType: !991, size: 32, align: 32, offset: 6368)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !970, file: !35, line: 2851, baseType: !1627, size: 64, align: 64, offset: 6400)
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64, align: 64)
!1628 = !DISubroutineType(types: !1629)
!1629 = !{!991, !1449, !1630, !953, !1264, !991, !991}
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DISubroutineType(types: !1632)
!1632 = !{!991, !1449, !953}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !970, file: !35, line: 2871, baseType: !1634, size: 64, align: 64, offset: 6464)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DISubroutineType(types: !1636)
!1636 = !{!991, !1449, !1637, !953, !1264, !991}
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DISubroutineType(types: !1639)
!1639 = !{!991, !1449, !953, !991, !991}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !970, file: !35, line: 2878, baseType: !991, size: 32, align: 32, offset: 6528)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !970, file: !35, line: 2885, baseType: !991, size: 32, align: 32, offset: 6560)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !970, file: !35, line: 3005, baseType: !991, size: 32, align: 32, offset: 6592)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !970, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !970, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !970, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !970, file: !35, line: 3037, baseType: !1098, size: 64, align: 64, offset: 6720)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !970, file: !35, line: 3038, baseType: !991, size: 32, align: 32, offset: 6784)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !970, file: !35, line: 3050, baseType: !1050, size: 64, align: 64, offset: 6848)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !970, file: !35, line: 3065, baseType: !991, size: 32, align: 32, offset: 6912)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !970, file: !35, line: 3083, baseType: !991, size: 32, align: 32, offset: 6944)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !970, file: !35, line: 3092, baseType: !1032, size: 64, align: 32, offset: 6976)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !970, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !970, file: !35, line: 3106, baseType: !1032, size: 64, align: 32, offset: 7072)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !970, file: !35, line: 3113, baseType: !1655, size: 64, align: 64, offset: 7168)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1657)
!1657 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1658)
!1658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1659)
!1659 = !{!1660, !1661, !1662, !1663, !1664, !1665, !1668}
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1658, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1658, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1658, file: !35, line: 720, baseType: !979, size: 64, align: 64, offset: 64)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1658, file: !35, line: 724, baseType: !979, size: 64, align: 64, offset: 128)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1658, file: !35, line: 728, baseType: !991, size: 32, align: 32, offset: 192)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1658, file: !35, line: 734, baseType: !1666, size: 64, align: 64, offset: 256)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1658, file: !35, line: 739, baseType: !1669, size: 64, align: 64, offset: 320)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1060)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !970, file: !35, line: 3129, baseType: !1142, size: 64, align: 64, offset: 7232)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !970, file: !35, line: 3130, baseType: !1142, size: 64, align: 64, offset: 7296)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !970, file: !35, line: 3131, baseType: !1142, size: 64, align: 64, offset: 7360)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !970, file: !35, line: 3132, baseType: !1142, size: 64, align: 64, offset: 7424)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !970, file: !35, line: 3139, baseType: !1138, size: 64, align: 64, offset: 7488)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !970, file: !35, line: 3147, baseType: !991, size: 32, align: 32, offset: 7552)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !970, file: !35, line: 3165, baseType: !991, size: 32, align: 32, offset: 7584)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !970, file: !35, line: 3172, baseType: !991, size: 32, align: 32, offset: 7616)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !970, file: !35, line: 3180, baseType: !991, size: 32, align: 32, offset: 7648)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !970, file: !35, line: 3191, baseType: !1485, size: 64, align: 64, offset: 7680)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !970, file: !35, line: 3199, baseType: !1098, size: 64, align: 64, offset: 7744)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !970, file: !35, line: 3207, baseType: !1138, size: 64, align: 64, offset: 7808)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !970, file: !35, line: 3214, baseType: !952, size: 32, align: 32, offset: 7872)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !970, file: !35, line: 3224, baseType: !1171, size: 64, align: 64, offset: 7936)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !970, file: !35, line: 3225, baseType: !991, size: 32, align: 32, offset: 8000)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !970, file: !35, line: 3249, baseType: !1153, size: 64, align: 64, offset: 8064)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !970, file: !35, line: 3256, baseType: !991, size: 32, align: 32, offset: 8128)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !970, file: !35, line: 3271, baseType: !991, size: 32, align: 32, offset: 8160)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !970, file: !35, line: 3279, baseType: !1142, size: 64, align: 64, offset: 8192)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !970, file: !35, line: 3301, baseType: !1153, size: 64, align: 64, offset: 8256)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !970, file: !35, line: 3310, baseType: !991, size: 32, align: 32, offset: 8320)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !970, file: !35, line: 3337, baseType: !991, size: 32, align: 32, offset: 8352)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !970, file: !35, line: 3351, baseType: !991, size: 32, align: 32, offset: 8384)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !970, file: !35, line: 3359, baseType: !991, size: 32, align: 32, offset: 8416)
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1696, size: 64, align: 64)
!1696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACEncContext", file: !961, line: 376, size: 4539904, align: 256, elements: !1697)
!1697 = !{!1698, !1700, !1712, !1723, !1768, !1769, !1815, !1833, !1835, !1836, !1837, !1886, !1887, !1888, !1889, !1890, !2542, !2622, !2625, !2627, !2628, !2629, !2630, !2631, !2632, !2633, !2634, !2651, !2655, !2657, !2658, !2671, !2675, !2679}
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1696, file: !961, line: 377, baseType: !1699, size: 64, align: 64)
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1696, file: !961, line: 378, baseType: !1701, size: 256, align: 32, offset: 64)
!1701 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACEncOptions", file: !961, line: 52, baseType: !1702)
!1702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACEncOptions", file: !961, line: 43, size: 256, align: 32, elements: !1703)
!1703 = !{!1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711}
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !1702, file: !961, line: 44, baseType: !991, size: 32, align: 32)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "pns", scope: !1702, file: !961, line: 45, baseType: !991, size: 32, align: 32, offset: 32)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "tns", scope: !1702, file: !961, line: 46, baseType: !991, size: 32, align: 32, offset: 64)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "ltp", scope: !1702, file: !961, line: 47, baseType: !991, size: 32, align: 32, offset: 96)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "pce", scope: !1702, file: !961, line: 48, baseType: !991, size: 32, align: 32, offset: 128)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !1702, file: !961, line: 49, baseType: !991, size: 32, align: 32, offset: 160)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "mid_side", scope: !1702, file: !961, line: 50, baseType: !991, size: 32, align: 32, offset: 192)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "intensity_stereo", scope: !1702, file: !961, line: 51, baseType: !991, size: 32, align: 32, offset: 224)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1696, file: !961, line: 379, baseType: !1713, size: 320, align: 64, offset: 320)
!1713 = !DIDerivedType(tag: DW_TAG_typedef, name: "PutBitContext", file: !1714, line: 40, baseType: !1715)
!1714 = !DIFile(filename: "libavcodec/put_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PutBitContext", file: !1714, line: 35, size: 320, align: 64, elements: !1716)
!1716 = !{!1717, !1718, !1719, !1720, !1721, !1722}
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "bit_buf", scope: !1715, file: !1714, line: 36, baseType: !950, size: 32, align: 32)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "bit_left", scope: !1715, file: !1714, line: 37, baseType: !991, size: 32, align: 32, offset: 32)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1715, file: !1714, line: 38, baseType: !1098, size: 64, align: 64, offset: 64)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1715, file: !1714, line: 38, baseType: !1098, size: 64, align: 64, offset: 128)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1715, file: !1714, line: 38, baseType: !1098, size: 64, align: 64, offset: 192)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1715, file: !1714, line: 39, baseType: !991, size: 32, align: 32, offset: 256)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "mdct1024", scope: !1696, file: !961, line: 380, baseType: !1724, size: 896, align: 64, offset: 640)
!1724 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !1725, line: 41, baseType: !1726)
!1725 = !DIFile(filename: "libavcodec/avfft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !888, line: 88, size: 896, align: 64, elements: !1727)
!1727 = !{!1728, !1729, !1730, !1731, !1739, !1740, !1741, !1743, !1744, !1749, !1750, !1756, !1757, !1758, !1764, !1765, !1766}
