; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--targaenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--targaenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!873 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!874 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !14, line: 1534, size: 32, align: 32, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881}
!876 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!877 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!878 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!879 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!880 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!881 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!882 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893}
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!887 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!888 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!889 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902}
!896 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!897 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!898 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!899 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!900 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!901 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!902 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TargaCompr", file: !910, line: 33, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/targa.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!911 = !{!912, !913, !914, !915, !916}
!912 = !DIEnumerator(name: "TGA_NODATA", value: 0)
!913 = !DIEnumerator(name: "TGA_PAL", value: 1)
!914 = !DIEnumerator(name: "TGA_RGB", value: 2)
!915 = !DIEnumerator(name: "TGA_BW", value: 3)
!916 = !DIEnumerator(name: "TGA_RLE", value: 8)
!917 = !{!918, !926, !933, !934, !935}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!919 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !920, line: 222, size: 16, align: 8, elements: !921)
!920 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!921 = !{!922}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !919, file: !920, line: 222, baseType: !923, size: 16, align: 16)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !924, line: 49, baseType: !925)
!924 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!925 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !920, line: 221, size: 32, align: 8, elements: !929)
!929 = !{!930}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !928, file: !920, line: 221, baseType: !931, size: 32, align: 32)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !924, line: 51, baseType: !932)
!932 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !924, line: 48, baseType: !937)
!937 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!938 = !{!939, !1698, !1699}
!939 = distinct !DIGlobalVariable(name: "ff_targa_encoder", scope: !0, file: !940, line: 219, type: !941, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_targa_encoder)
!940 = !DIFile(filename: "libavcodec/targaenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !943)
!943 = !{!944, !948, !949, !950, !951, !953, !962, !965, !968, !971, !976, !977, !1053, !1061, !1062, !1063, !1065, !1613, !1619, !1627, !1631, !1632, !1669, !1673, !1677, !1678, !1682, !1686, !1687, !1691, !1692, !1693}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !942, file: !14, line: 3475, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !942, file: !14, line: 3480, baseType: !945, size: 64, align: 64, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !942, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !942, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !942, file: !14, line: 3487, baseType: !952, size: 32, align: 32, offset: 192)
!952 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !942, file: !14, line: 3488, baseType: !954, size: 64, align: 64, offset: 256)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !957, line: 61, baseType: !958)
!957 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !957, line: 58, size: 64, align: 32, elements: !959)
!959 = !{!960, !961}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !958, file: !957, line: 59, baseType: !952, size: 32, align: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !958, file: !957, line: 60, baseType: !952, size: 32, align: 32, offset: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !942, file: !14, line: 3489, baseType: !963, size: 64, align: 64, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !942, file: !14, line: 3490, baseType: !966, size: 64, align: 64, offset: 384)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !942, file: !14, line: 3491, baseType: !969, size: 64, align: 64, offset: 448)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !942, file: !14, line: 3492, baseType: !972, size: 64, align: 64, offset: 512)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !924, line: 55, baseType: !975)
!975 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !942, file: !14, line: 3493, baseType: !936, size: 8, align: 8, offset: 576)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !942, file: !14, line: 3494, baseType: !978, size: 64, align: 64, offset: 640)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !982)
!982 = !{!983, !984, !989, !1012, !1013, !1014, !1015, !1019, !1025, !1027, !1031}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !981, file: !713, line: 72, baseType: !945, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !981, file: !713, line: 78, baseType: !985, size: 64, align: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!945, !988}
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !981, file: !713, line: 85, baseType: !990, size: 64, align: 64, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !993)
!993 = !{!994, !995, !996, !997, !998, !1008, !1009, !1010, !1011}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !992, file: !691, line: 247, baseType: !945, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !992, file: !691, line: 253, baseType: !945, size: 64, align: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !992, file: !691, line: 259, baseType: !952, size: 32, align: 32, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !992, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !992, file: !691, line: 271, baseType: !999, size: 64, align: 64, offset: 192)
!999 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !992, file: !691, line: 265, size: 64, align: 64, elements: !1000)
!1000 = !{!1001, !1004, !1006, !1007}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !999, file: !691, line: 266, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !924, line: 40, baseType: !1003)
!1003 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !999, file: !691, line: 267, baseType: !1005, size: 64, align: 64)
!1005 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !999, file: !691, line: 268, baseType: !945, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !999, file: !691, line: 270, baseType: !956, size: 64, align: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !992, file: !691, line: 272, baseType: !1005, size: 64, align: 64, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !992, file: !691, line: 273, baseType: !1005, size: 64, align: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !992, file: !691, line: 275, baseType: !952, size: 32, align: 32, offset: 384)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !992, file: !691, line: 300, baseType: !945, size: 64, align: 64, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !981, file: !713, line: 93, baseType: !952, size: 32, align: 32, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !981, file: !713, line: 99, baseType: !952, size: 32, align: 32, offset: 224)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !981, file: !713, line: 108, baseType: !952, size: 32, align: 32, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !981, file: !713, line: 113, baseType: !1016, size: 64, align: 64, offset: 320)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!988, !988, !988}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !981, file: !713, line: 123, baseType: !1020, size: 64, align: 64, offset: 384)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!1023, !1023}
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !981, file: !713, line: 130, baseType: !1026, size: 32, align: 32, offset: 448)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !981, file: !713, line: 136, baseType: !1028, size: 64, align: 64, offset: 512)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!1026, !988}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !981, file: !713, line: 142, baseType: !1032, size: 64, align: 64, offset: 576)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!952, !1035, !988, !945, !952}
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1038)
!1038 = !{!1039, !1051, !1052}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1037, file: !691, line: 360, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1044)
!1044 = !{!1045, !1046, !1047, !1048, !1049, !1050}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1043, file: !691, line: 307, baseType: !945, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1043, file: !691, line: 313, baseType: !1005, size: 64, align: 64, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1043, file: !691, line: 313, baseType: !1005, size: 64, align: 64, offset: 128)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1043, file: !691, line: 318, baseType: !1005, size: 64, align: 64, offset: 192)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1043, file: !691, line: 318, baseType: !1005, size: 64, align: 64, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1043, file: !691, line: 323, baseType: !952, size: 32, align: 32, offset: 320)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1037, file: !691, line: 364, baseType: !952, size: 32, align: 32, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1037, file: !691, line: 368, baseType: !952, size: 32, align: 32, offset: 96)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !942, file: !14, line: 3495, baseType: !1054, size: 64, align: 64, offset: 704)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1056)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1058)
!1058 = !{!1059, !1060}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1057, file: !14, line: 3402, baseType: !952, size: 32, align: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1057, file: !14, line: 3403, baseType: !945, size: 64, align: 64, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !942, file: !14, line: 3507, baseType: !945, size: 64, align: 64, offset: 768)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !942, file: !14, line: 3516, baseType: !952, size: 32, align: 32, offset: 832)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !942, file: !14, line: 3517, baseType: !1064, size: 64, align: 64, offset: 896)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !942, file: !14, line: 3527, baseType: !1066, size: 64, align: 64, offset: 960)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!952, !1069}
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1071)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1076, !1079, !1080, !1081, !1082, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1361, !1365, !1366, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1551, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1071, file: !14, line: 1561, baseType: !978, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1071, file: !14, line: 1562, baseType: !952, size: 32, align: 32, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1071, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1071, file: !14, line: 1565, baseType: !1077, size: 64, align: 64, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1071, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1071, file: !14, line: 1581, baseType: !932, size: 32, align: 32, offset: 224)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1071, file: !14, line: 1583, baseType: !988, size: 64, align: 64, offset: 256)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1071, file: !14, line: 1591, baseType: !1083, size: 64, align: 64, offset: 320)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1085, line: 129, size: 1664, align: 64, elements: !1086)
!1085 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1086 = !{!1087, !1088, !1089, !1090, !1187, !1208, !1209, !1238, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1084, file: !1085, line: 136, baseType: !952, size: 32, align: 32)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1084, file: !1085, line: 151, baseType: !952, size: 32, align: 32, offset: 32)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1084, file: !1085, line: 157, baseType: !952, size: 32, align: 32, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1084, file: !1085, line: 159, baseType: !1091, size: 64, align: 64, offset: 128)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1093)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1094)
!1094 = !{!1095, !1099, !1101, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1139, !1141, !1142, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1175, !1176, !1177, !1178, !1179, !1180, !1183, !1184, !1185, !1186}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1093, file: !744, line: 282, baseType: !1096, size: 512, align: 64)
!1096 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 512, align: 64, elements: !1097)
!1097 = !{!1098}
!1098 = !DISubrange(count: 8)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1093, file: !744, line: 299, baseType: !1100, size: 256, align: 32, offset: 512)
!1100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 256, align: 32, elements: !1097)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1093, file: !744, line: 315, baseType: !1102, size: 64, align: 64, offset: 768)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1093, file: !744, line: 326, baseType: !952, size: 32, align: 32, offset: 832)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1093, file: !744, line: 326, baseType: !952, size: 32, align: 32, offset: 864)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1093, file: !744, line: 334, baseType: !952, size: 32, align: 32, offset: 896)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1093, file: !744, line: 341, baseType: !952, size: 32, align: 32, offset: 928)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1093, file: !744, line: 346, baseType: !952, size: 32, align: 32, offset: 960)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1093, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1093, file: !744, line: 356, baseType: !956, size: 64, align: 32, offset: 1024)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1093, file: !744, line: 361, baseType: !1002, size: 64, align: 64, offset: 1088)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1093, file: !744, line: 369, baseType: !1002, size: 64, align: 64, offset: 1152)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1093, file: !744, line: 377, baseType: !1002, size: 64, align: 64, offset: 1216)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1093, file: !744, line: 382, baseType: !952, size: 32, align: 32, offset: 1280)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1093, file: !744, line: 386, baseType: !952, size: 32, align: 32, offset: 1312)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1093, file: !744, line: 391, baseType: !952, size: 32, align: 32, offset: 1344)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1093, file: !744, line: 396, baseType: !988, size: 64, align: 64, offset: 1408)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1093, file: !744, line: 403, baseType: !1118, size: 512, align: 64, offset: 1472)
!1118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !974, size: 512, align: 64, elements: !1097)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1093, file: !744, line: 410, baseType: !952, size: 32, align: 32, offset: 1984)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1093, file: !744, line: 415, baseType: !952, size: 32, align: 32, offset: 2016)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1093, file: !744, line: 420, baseType: !952, size: 32, align: 32, offset: 2048)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1093, file: !744, line: 425, baseType: !952, size: 32, align: 32, offset: 2080)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1093, file: !744, line: 435, baseType: !1002, size: 64, align: 64, offset: 2112)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1093, file: !744, line: 440, baseType: !952, size: 32, align: 32, offset: 2176)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1093, file: !744, line: 445, baseType: !974, size: 64, align: 64, offset: 2240)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1093, file: !744, line: 459, baseType: !1127, size: 512, align: 64, offset: 2304)
!1127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1128, size: 512, align: 64, elements: !1097)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1130, line: 94, baseType: !1131)
!1130 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1130, line: 81, size: 192, align: 64, elements: !1132)
!1132 = !{!1133, !1137, !1138}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1131, file: !1130, line: 82, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1130, line: 73, baseType: !1136)
!1136 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1130, line: 73, flags: DIFlagFwdDecl)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1131, file: !1130, line: 89, baseType: !935, size: 64, align: 64, offset: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1131, file: !1130, line: 93, baseType: !952, size: 32, align: 32, offset: 128)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1093, file: !744, line: 473, baseType: !1140, size: 64, align: 64, offset: 2816)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1093, file: !744, line: 477, baseType: !952, size: 32, align: 32, offset: 2880)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1093, file: !744, line: 479, baseType: !1143, size: 64, align: 64, offset: 2944)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1147)
!1147 = !{!1148, !1149, !1150, !1151, !1156}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1146, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1146, file: !744, line: 203, baseType: !935, size: 64, align: 64, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1146, file: !744, line: 204, baseType: !952, size: 32, align: 32, offset: 128)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1146, file: !744, line: 205, baseType: !1152, size: 64, align: 64, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1154, line: 86, baseType: !1155)
!1154 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1155 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1154, line: 86, flags: DIFlagFwdDecl)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1146, file: !744, line: 206, baseType: !1128, size: 64, align: 64, offset: 256)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1093, file: !744, line: 480, baseType: !952, size: 32, align: 32, offset: 3008)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1093, file: !744, line: 505, baseType: !952, size: 32, align: 32, offset: 3040)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1093, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1093, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1093, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1093, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1093, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1093, file: !744, line: 532, baseType: !1002, size: 64, align: 64, offset: 3264)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1093, file: !744, line: 539, baseType: !1002, size: 64, align: 64, offset: 3328)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1093, file: !744, line: 547, baseType: !1002, size: 64, align: 64, offset: 3392)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1093, file: !744, line: 554, baseType: !1152, size: 64, align: 64, offset: 3456)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1093, file: !744, line: 563, baseType: !952, size: 32, align: 32, offset: 3520)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1093, file: !744, line: 572, baseType: !952, size: 32, align: 32, offset: 3552)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1093, file: !744, line: 581, baseType: !952, size: 32, align: 32, offset: 3584)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1093, file: !744, line: 588, baseType: !1172, size: 64, align: 64, offset: 3648)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !924, line: 36, baseType: !1174)
!1174 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1093, file: !744, line: 593, baseType: !952, size: 32, align: 32, offset: 3712)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1093, file: !744, line: 596, baseType: !952, size: 32, align: 32, offset: 3744)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1093, file: !744, line: 599, baseType: !1128, size: 64, align: 64, offset: 3776)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1093, file: !744, line: 605, baseType: !1128, size: 64, align: 64, offset: 3840)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1093, file: !744, line: 616, baseType: !1128, size: 64, align: 64, offset: 3904)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1093, file: !744, line: 626, baseType: !1181, size: 64, align: 64, offset: 3968)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1182, line: 216, baseType: !975)
!1182 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1093, file: !744, line: 627, baseType: !1181, size: 64, align: 64, offset: 4032)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1093, file: !744, line: 628, baseType: !1181, size: 64, align: 64, offset: 4096)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1093, file: !744, line: 629, baseType: !1181, size: 64, align: 64, offset: 4160)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1093, file: !744, line: 645, baseType: !1128, size: 64, align: 64, offset: 4224)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1084, file: !1085, line: 161, baseType: !1188, size: 64, align: 64, offset: 192)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1085, line: 117, baseType: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1085, line: 100, size: 832, align: 64, elements: !1191)
!1191 = !{!1192, !1199, !1200, !1201, !1202, !1203, !1205, !1206, !1207}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1190, file: !1085, line: 105, baseType: !1193, size: 256, align: 64)
!1193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1194, size: 256, align: 64, elements: !1197)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1130, line: 238, baseType: !1196)
!1196 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1130, line: 238, flags: DIFlagFwdDecl)
!1197 = !{!1198}
!1198 = !DISubrange(count: 4)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1190, file: !1085, line: 110, baseType: !952, size: 32, align: 32, offset: 256)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1190, file: !1085, line: 111, baseType: !952, size: 32, align: 32, offset: 288)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1190, file: !1085, line: 111, baseType: !952, size: 32, align: 32, offset: 320)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1190, file: !1085, line: 112, baseType: !1100, size: 256, align: 32, offset: 352)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1190, file: !1085, line: 113, baseType: !1204, size: 128, align: 32, offset: 608)
!1204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 128, align: 32, elements: !1197)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1190, file: !1085, line: 114, baseType: !952, size: 32, align: 32, offset: 736)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1190, file: !1085, line: 115, baseType: !952, size: 32, align: 32, offset: 768)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1190, file: !1085, line: 116, baseType: !952, size: 32, align: 32, offset: 800)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1084, file: !1085, line: 163, baseType: !988, size: 64, align: 64, offset: 256)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1084, file: !1085, line: 165, baseType: !1210, size: 128, align: 64, offset: 320)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1085, line: 122, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1085, line: 119, size: 128, align: 64, elements: !1212)
!1212 = !{!1213, !1237}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1211, file: !1085, line: 120, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1217)
!1217 = !{!1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1233, !1234, !1235, !1236}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1216, file: !14, line: 1451, baseType: !1128, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1216, file: !14, line: 1461, baseType: !1002, size: 64, align: 64, offset: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1216, file: !14, line: 1467, baseType: !1002, size: 64, align: 64, offset: 128)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1216, file: !14, line: 1468, baseType: !935, size: 64, align: 64, offset: 192)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1216, file: !14, line: 1469, baseType: !952, size: 32, align: 32, offset: 256)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1216, file: !14, line: 1470, baseType: !952, size: 32, align: 32, offset: 288)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1216, file: !14, line: 1474, baseType: !952, size: 32, align: 32, offset: 320)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1216, file: !14, line: 1479, baseType: !1226, size: 64, align: 64, offset: 384)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1228)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1229)
!1229 = !{!1230, !1231, !1232}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1228, file: !14, line: 1412, baseType: !935, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1228, file: !14, line: 1413, baseType: !952, size: 32, align: 32, offset: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1228, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1216, file: !14, line: 1480, baseType: !952, size: 32, align: 32, offset: 448)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1216, file: !14, line: 1486, baseType: !1002, size: 64, align: 64, offset: 512)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1216, file: !14, line: 1488, baseType: !1002, size: 64, align: 64, offset: 576)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1216, file: !14, line: 1497, baseType: !1002, size: 64, align: 64, offset: 640)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1211, file: !1085, line: 121, baseType: !1091, size: 64, align: 64, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1084, file: !1085, line: 166, baseType: !1239, size: 128, align: 64, offset: 448)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1085, line: 127, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1085, line: 124, size: 128, align: 64, elements: !1241)
!1241 = !{!1242, !1315}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1240, file: !1085, line: 125, baseType: !1243, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1246)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1247)
!1247 = !{!1248, !1249, !1273, !1277, !1278, !1312, !1313, !1314}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1246, file: !14, line: 5751, baseType: !978, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1246, file: !14, line: 5756, baseType: !1250, size: 64, align: 64, offset: 64)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1252)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1253)
!1253 = !{!1254, !1255, !1258, !1259, !1260, !1264, !1268, !1272}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1252, file: !14, line: 5797, baseType: !945, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1252, file: !14, line: 5804, baseType: !1256, size: 64, align: 64, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1252, file: !14, line: 5815, baseType: !978, size: 64, align: 64, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1252, file: !14, line: 5825, baseType: !952, size: 32, align: 32, offset: 192)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1252, file: !14, line: 5826, baseType: !1261, size: 64, align: 64, offset: 256)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DISubroutineType(types: !1263)
!1263 = !{!952, !1244}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1252, file: !14, line: 5827, baseType: !1265, size: 64, align: 64, offset: 320)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!952, !1244, !1214}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1252, file: !14, line: 5828, baseType: !1269, size: 64, align: 64, offset: 384)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{null, !1244}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1252, file: !14, line: 5829, baseType: !1269, size: 64, align: 64, offset: 448)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1246, file: !14, line: 5762, baseType: !1274, size: 64, align: 64, offset: 128)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1276)
!1276 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1246, file: !14, line: 5768, baseType: !988, size: 64, align: 64, offset: 192)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1246, file: !14, line: 5775, baseType: !1279, size: 64, align: 64, offset: 256)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1281)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1282)
!1282 = !{!1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1281, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1281, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1281, file: !14, line: 3948, baseType: !931, size: 32, align: 32, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1281, file: !14, line: 3958, baseType: !935, size: 64, align: 64, offset: 128)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1281, file: !14, line: 3962, baseType: !952, size: 32, align: 32, offset: 192)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1281, file: !14, line: 3968, baseType: !952, size: 32, align: 32, offset: 224)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1281, file: !14, line: 3973, baseType: !1002, size: 64, align: 64, offset: 256)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1281, file: !14, line: 3986, baseType: !952, size: 32, align: 32, offset: 320)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1281, file: !14, line: 3999, baseType: !952, size: 32, align: 32, offset: 352)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1281, file: !14, line: 4004, baseType: !952, size: 32, align: 32, offset: 384)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1281, file: !14, line: 4005, baseType: !952, size: 32, align: 32, offset: 416)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1281, file: !14, line: 4010, baseType: !952, size: 32, align: 32, offset: 448)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1281, file: !14, line: 4011, baseType: !952, size: 32, align: 32, offset: 480)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1281, file: !14, line: 4020, baseType: !956, size: 64, align: 32, offset: 512)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1281, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1281, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1281, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1281, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1281, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1281, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1281, file: !14, line: 4039, baseType: !952, size: 32, align: 32, offset: 768)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1281, file: !14, line: 4046, baseType: !974, size: 64, align: 64, offset: 832)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1281, file: !14, line: 4050, baseType: !952, size: 32, align: 32, offset: 896)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1281, file: !14, line: 4054, baseType: !952, size: 32, align: 32, offset: 928)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1281, file: !14, line: 4061, baseType: !952, size: 32, align: 32, offset: 960)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1281, file: !14, line: 4065, baseType: !952, size: 32, align: 32, offset: 992)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1281, file: !14, line: 4073, baseType: !952, size: 32, align: 32, offset: 1024)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1281, file: !14, line: 4080, baseType: !952, size: 32, align: 32, offset: 1056)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1281, file: !14, line: 4084, baseType: !952, size: 32, align: 32, offset: 1088)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1246, file: !14, line: 5781, baseType: !1279, size: 64, align: 64, offset: 320)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1246, file: !14, line: 5787, baseType: !956, size: 64, align: 32, offset: 384)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1246, file: !14, line: 5793, baseType: !956, size: 64, align: 32, offset: 448)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1240, file: !1085, line: 126, baseType: !952, size: 32, align: 32, offset: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1084, file: !1085, line: 172, baseType: !1214, size: 64, align: 64, offset: 576)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1084, file: !1085, line: 177, baseType: !935, size: 64, align: 64, offset: 640)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1084, file: !1085, line: 178, baseType: !932, size: 32, align: 32, offset: 704)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1084, file: !1085, line: 180, baseType: !988, size: 64, align: 64, offset: 768)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1084, file: !1085, line: 185, baseType: !952, size: 32, align: 32, offset: 832)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1084, file: !1085, line: 190, baseType: !988, size: 64, align: 64, offset: 896)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1084, file: !1085, line: 195, baseType: !952, size: 32, align: 32, offset: 960)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1084, file: !1085, line: 200, baseType: !1214, size: 64, align: 64, offset: 1024)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1084, file: !1085, line: 201, baseType: !952, size: 32, align: 32, offset: 1088)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1084, file: !1085, line: 202, baseType: !1091, size: 64, align: 64, offset: 1152)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1084, file: !1085, line: 203, baseType: !952, size: 32, align: 32, offset: 1216)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1084, file: !1085, line: 205, baseType: !952, size: 32, align: 32, offset: 1248)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1084, file: !1085, line: 206, baseType: !952, size: 32, align: 32, offset: 1280)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1084, file: !1085, line: 209, baseType: !1181, size: 64, align: 64, offset: 1344)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1084, file: !1085, line: 212, baseType: !1181, size: 64, align: 64, offset: 1408)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1084, file: !1085, line: 213, baseType: !1091, size: 64, align: 64, offset: 1472)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1084, file: !1085, line: 215, baseType: !952, size: 32, align: 32, offset: 1536)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1084, file: !1085, line: 217, baseType: !952, size: 32, align: 32, offset: 1568)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1084, file: !1085, line: 220, baseType: !952, size: 32, align: 32, offset: 1600)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1071, file: !14, line: 1598, baseType: !988, size: 64, align: 64, offset: 384)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1071, file: !14, line: 1606, baseType: !1002, size: 64, align: 64, offset: 448)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1071, file: !14, line: 1614, baseType: !952, size: 32, align: 32, offset: 512)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1071, file: !14, line: 1622, baseType: !952, size: 32, align: 32, offset: 544)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1071, file: !14, line: 1628, baseType: !952, size: 32, align: 32, offset: 576)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1071, file: !14, line: 1636, baseType: !952, size: 32, align: 32, offset: 608)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1071, file: !14, line: 1643, baseType: !952, size: 32, align: 32, offset: 640)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1071, file: !14, line: 1657, baseType: !935, size: 64, align: 64, offset: 704)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1071, file: !14, line: 1658, baseType: !952, size: 32, align: 32, offset: 768)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1071, file: !14, line: 1679, baseType: !956, size: 64, align: 32, offset: 800)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1071, file: !14, line: 1688, baseType: !952, size: 32, align: 32, offset: 864)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1071, file: !14, line: 1712, baseType: !952, size: 32, align: 32, offset: 896)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1071, file: !14, line: 1729, baseType: !952, size: 32, align: 32, offset: 928)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1071, file: !14, line: 1729, baseType: !952, size: 32, align: 32, offset: 960)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1071, file: !14, line: 1744, baseType: !952, size: 32, align: 32, offset: 992)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1071, file: !14, line: 1744, baseType: !952, size: 32, align: 32, offset: 1024)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1071, file: !14, line: 1751, baseType: !952, size: 32, align: 32, offset: 1056)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1071, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1071, file: !14, line: 1791, baseType: !1354, size: 64, align: 64, offset: 1152)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = !DISubroutineType(types: !1356)
!1356 = !{null, !1357, !1358, !1360, !952, !952, !952}
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1092)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1071, file: !14, line: 1808, baseType: !1362, size: 64, align: 64, offset: 1216)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DISubroutineType(types: !1364)
!1364 = !{!473, !1357, !963}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1071, file: !14, line: 1816, baseType: !952, size: 32, align: 32, offset: 1280)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1071, file: !14, line: 1825, baseType: !1367, size: 32, align: 32, offset: 1312)
!1367 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1071, file: !14, line: 1830, baseType: !952, size: 32, align: 32, offset: 1344)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1071, file: !14, line: 1838, baseType: !1367, size: 32, align: 32, offset: 1376)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1071, file: !14, line: 1846, baseType: !952, size: 32, align: 32, offset: 1408)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1071, file: !14, line: 1851, baseType: !952, size: 32, align: 32, offset: 1440)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1071, file: !14, line: 1861, baseType: !1367, size: 32, align: 32, offset: 1472)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1071, file: !14, line: 1868, baseType: !1367, size: 32, align: 32, offset: 1504)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1071, file: !14, line: 1875, baseType: !1367, size: 32, align: 32, offset: 1536)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1071, file: !14, line: 1882, baseType: !1367, size: 32, align: 32, offset: 1568)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1071, file: !14, line: 1889, baseType: !1367, size: 32, align: 32, offset: 1600)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1071, file: !14, line: 1896, baseType: !1367, size: 32, align: 32, offset: 1632)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1071, file: !14, line: 1903, baseType: !1367, size: 32, align: 32, offset: 1664)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1071, file: !14, line: 1910, baseType: !952, size: 32, align: 32, offset: 1696)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1071, file: !14, line: 1915, baseType: !952, size: 32, align: 32, offset: 1728)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1071, file: !14, line: 1926, baseType: !1360, size: 64, align: 64, offset: 1792)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1071, file: !14, line: 1935, baseType: !956, size: 64, align: 32, offset: 1856)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1071, file: !14, line: 1942, baseType: !952, size: 32, align: 32, offset: 1920)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1071, file: !14, line: 1948, baseType: !952, size: 32, align: 32, offset: 1952)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1071, file: !14, line: 1954, baseType: !952, size: 32, align: 32, offset: 1984)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1071, file: !14, line: 1960, baseType: !952, size: 32, align: 32, offset: 2016)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1071, file: !14, line: 1984, baseType: !952, size: 32, align: 32, offset: 2048)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1071, file: !14, line: 1991, baseType: !952, size: 32, align: 32, offset: 2080)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1071, file: !14, line: 1996, baseType: !952, size: 32, align: 32, offset: 2112)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1071, file: !14, line: 2004, baseType: !952, size: 32, align: 32, offset: 2144)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1071, file: !14, line: 2011, baseType: !952, size: 32, align: 32, offset: 2176)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1071, file: !14, line: 2018, baseType: !952, size: 32, align: 32, offset: 2208)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1071, file: !14, line: 2027, baseType: !952, size: 32, align: 32, offset: 2240)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1071, file: !14, line: 2034, baseType: !952, size: 32, align: 32, offset: 2272)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1071, file: !14, line: 2044, baseType: !952, size: 32, align: 32, offset: 2304)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1071, file: !14, line: 2054, baseType: !1397, size: 64, align: 64, offset: 2368)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1071, file: !14, line: 2061, baseType: !1397, size: 64, align: 64, offset: 2432)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1071, file: !14, line: 2066, baseType: !952, size: 32, align: 32, offset: 2496)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1071, file: !14, line: 2070, baseType: !952, size: 32, align: 32, offset: 2528)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1071, file: !14, line: 2078, baseType: !952, size: 32, align: 32, offset: 2560)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1071, file: !14, line: 2085, baseType: !952, size: 32, align: 32, offset: 2592)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1071, file: !14, line: 2092, baseType: !952, size: 32, align: 32, offset: 2624)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1071, file: !14, line: 2099, baseType: !952, size: 32, align: 32, offset: 2656)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1071, file: !14, line: 2106, baseType: !952, size: 32, align: 32, offset: 2688)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1071, file: !14, line: 2113, baseType: !952, size: 32, align: 32, offset: 2720)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1071, file: !14, line: 2120, baseType: !952, size: 32, align: 32, offset: 2752)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1071, file: !14, line: 2125, baseType: !952, size: 32, align: 32, offset: 2784)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1071, file: !14, line: 2133, baseType: !952, size: 32, align: 32, offset: 2816)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1071, file: !14, line: 2140, baseType: !952, size: 32, align: 32, offset: 2848)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1071, file: !14, line: 2145, baseType: !952, size: 32, align: 32, offset: 2880)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1071, file: !14, line: 2153, baseType: !952, size: 32, align: 32, offset: 2912)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1071, file: !14, line: 2158, baseType: !952, size: 32, align: 32, offset: 2944)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1071, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1071, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1071, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1071, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1071, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1071, file: !14, line: 2203, baseType: !952, size: 32, align: 32, offset: 3136)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1071, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1071, file: !14, line: 2212, baseType: !952, size: 32, align: 32, offset: 3200)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1071, file: !14, line: 2213, baseType: !952, size: 32, align: 32, offset: 3232)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1071, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1071, file: !14, line: 2232, baseType: !952, size: 32, align: 32, offset: 3296)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1071, file: !14, line: 2243, baseType: !952, size: 32, align: 32, offset: 3328)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1071, file: !14, line: 2249, baseType: !952, size: 32, align: 32, offset: 3360)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1071, file: !14, line: 2256, baseType: !952, size: 32, align: 32, offset: 3392)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1071, file: !14, line: 2263, baseType: !974, size: 64, align: 64, offset: 3456)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1071, file: !14, line: 2270, baseType: !974, size: 64, align: 64, offset: 3520)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1071, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1071, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1071, file: !14, line: 2367, baseType: !1433, size: 64, align: 64, offset: 3648)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DISubroutineType(types: !1435)
!1435 = !{!952, !1357, !1091, !952}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1071, file: !14, line: 2383, baseType: !952, size: 32, align: 32, offset: 3712)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1071, file: !14, line: 2386, baseType: !1367, size: 32, align: 32, offset: 3744)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1071, file: !14, line: 2387, baseType: !1367, size: 32, align: 32, offset: 3776)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1071, file: !14, line: 2394, baseType: !952, size: 32, align: 32, offset: 3808)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1071, file: !14, line: 2401, baseType: !952, size: 32, align: 32, offset: 3840)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1071, file: !14, line: 2408, baseType: !952, size: 32, align: 32, offset: 3872)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1071, file: !14, line: 2415, baseType: !952, size: 32, align: 32, offset: 3904)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1071, file: !14, line: 2422, baseType: !952, size: 32, align: 32, offset: 3936)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1071, file: !14, line: 2423, baseType: !1445, size: 64, align: 64, offset: 3968)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1447)
!1447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1448)
!1448 = !{!1449, !1450, !1451, !1452}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1447, file: !14, line: 827, baseType: !952, size: 32, align: 32)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1447, file: !14, line: 828, baseType: !952, size: 32, align: 32, offset: 32)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1447, file: !14, line: 829, baseType: !952, size: 32, align: 32, offset: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1447, file: !14, line: 830, baseType: !1367, size: 32, align: 32, offset: 96)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1071, file: !14, line: 2430, baseType: !1002, size: 64, align: 64, offset: 4032)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1071, file: !14, line: 2437, baseType: !1002, size: 64, align: 64, offset: 4096)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1071, file: !14, line: 2444, baseType: !1367, size: 32, align: 32, offset: 4160)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1071, file: !14, line: 2451, baseType: !1367, size: 32, align: 32, offset: 4192)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1071, file: !14, line: 2458, baseType: !952, size: 32, align: 32, offset: 4224)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1071, file: !14, line: 2469, baseType: !952, size: 32, align: 32, offset: 4256)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1071, file: !14, line: 2475, baseType: !952, size: 32, align: 32, offset: 4288)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1071, file: !14, line: 2481, baseType: !952, size: 32, align: 32, offset: 4320)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1071, file: !14, line: 2485, baseType: !952, size: 32, align: 32, offset: 4352)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1071, file: !14, line: 2489, baseType: !952, size: 32, align: 32, offset: 4384)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1071, file: !14, line: 2493, baseType: !952, size: 32, align: 32, offset: 4416)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1071, file: !14, line: 2501, baseType: !952, size: 32, align: 32, offset: 4448)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1071, file: !14, line: 2506, baseType: !952, size: 32, align: 32, offset: 4480)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1071, file: !14, line: 2510, baseType: !952, size: 32, align: 32, offset: 4512)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1071, file: !14, line: 2514, baseType: !1002, size: 64, align: 64, offset: 4544)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1071, file: !14, line: 2528, baseType: !1469, size: 64, align: 64, offset: 4608)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DISubroutineType(types: !1471)
!1471 = !{null, !1357, !988, !952, !952}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1071, file: !14, line: 2534, baseType: !952, size: 32, align: 32, offset: 4672)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1071, file: !14, line: 2545, baseType: !952, size: 32, align: 32, offset: 4704)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1071, file: !14, line: 2547, baseType: !952, size: 32, align: 32, offset: 4736)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1071, file: !14, line: 2549, baseType: !952, size: 32, align: 32, offset: 4768)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1071, file: !14, line: 2551, baseType: !952, size: 32, align: 32, offset: 4800)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1071, file: !14, line: 2553, baseType: !952, size: 32, align: 32, offset: 4832)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1071, file: !14, line: 2555, baseType: !952, size: 32, align: 32, offset: 4864)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1071, file: !14, line: 2557, baseType: !952, size: 32, align: 32, offset: 4896)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1071, file: !14, line: 2559, baseType: !952, size: 32, align: 32, offset: 4928)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1071, file: !14, line: 2563, baseType: !952, size: 32, align: 32, offset: 4960)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1071, file: !14, line: 2571, baseType: !1483, size: 64, align: 64, offset: 4992)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1071, file: !14, line: 2579, baseType: !1483, size: 64, align: 64, offset: 5056)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1071, file: !14, line: 2586, baseType: !952, size: 32, align: 32, offset: 5120)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1071, file: !14, line: 2615, baseType: !952, size: 32, align: 32, offset: 5152)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1071, file: !14, line: 2627, baseType: !952, size: 32, align: 32, offset: 5184)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1071, file: !14, line: 2637, baseType: !952, size: 32, align: 32, offset: 5216)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1071, file: !14, line: 2681, baseType: !952, size: 32, align: 32, offset: 5248)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1071, file: !14, line: 2709, baseType: !1002, size: 64, align: 64, offset: 5312)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1071, file: !14, line: 2716, baseType: !1492, size: 64, align: 64, offset: 5376)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1494)
!1494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1495)
!1495 = !{!1496, !1497, !1498, !1499, !1500, !1501, !1505, !1511, !1515, !1516, !1517, !1518, !1524, !1525, !1526, !1527, !1528}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1494, file: !14, line: 3642, baseType: !945, size: 64, align: 64)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1494, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1494, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1494, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1494, file: !14, line: 3669, baseType: !952, size: 32, align: 32, offset: 160)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1494, file: !14, line: 3682, baseType: !1502, size: 64, align: 64, offset: 192)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{!952, !1069, !1091}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1494, file: !14, line: 3698, baseType: !1506, size: 64, align: 64, offset: 256)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DISubroutineType(types: !1508)
!1508 = !{!952, !1069, !1509, !931}
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1494, file: !14, line: 3712, baseType: !1512, size: 64, align: 64, offset: 320)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64, align: 64)
!1513 = !DISubroutineType(types: !1514)
!1514 = !{!952, !1069, !952, !1509, !931}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1494, file: !14, line: 3726, baseType: !1506, size: 64, align: 64, offset: 384)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1494, file: !14, line: 3737, baseType: !1066, size: 64, align: 64, offset: 448)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1494, file: !14, line: 3746, baseType: !952, size: 32, align: 32, offset: 512)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1494, file: !14, line: 3757, baseType: !1519, size: 64, align: 64, offset: 576)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DISubroutineType(types: !1521)
!1521 = !{null, !1522}
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!1523 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1494, file: !14, line: 3766, baseType: !1066, size: 64, align: 64, offset: 640)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1494, file: !14, line: 3774, baseType: !1066, size: 64, align: 64, offset: 704)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1494, file: !14, line: 3780, baseType: !952, size: 32, align: 32, offset: 768)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1494, file: !14, line: 3785, baseType: !952, size: 32, align: 32, offset: 800)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1494, file: !14, line: 3795, baseType: !1529, size: 64, align: 64, offset: 832)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DISubroutineType(types: !1531)
!1531 = !{!952, !1069, !1128}
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1071, file: !14, line: 2728, baseType: !988, size: 64, align: 64, offset: 5440)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1071, file: !14, line: 2735, baseType: !1118, size: 512, align: 64, offset: 5504)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1071, file: !14, line: 2742, baseType: !952, size: 32, align: 32, offset: 6016)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1071, file: !14, line: 2755, baseType: !952, size: 32, align: 32, offset: 6048)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1071, file: !14, line: 2776, baseType: !952, size: 32, align: 32, offset: 6080)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1071, file: !14, line: 2783, baseType: !952, size: 32, align: 32, offset: 6112)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1071, file: !14, line: 2791, baseType: !952, size: 32, align: 32, offset: 6144)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1071, file: !14, line: 2802, baseType: !1091, size: 64, align: 64, offset: 6208)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1071, file: !14, line: 2811, baseType: !952, size: 32, align: 32, offset: 6272)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1071, file: !14, line: 2821, baseType: !952, size: 32, align: 32, offset: 6304)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1071, file: !14, line: 2830, baseType: !952, size: 32, align: 32, offset: 6336)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1071, file: !14, line: 2840, baseType: !952, size: 32, align: 32, offset: 6368)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1071, file: !14, line: 2851, baseType: !1545, size: 64, align: 64, offset: 6400)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64, align: 64)
!1546 = !DISubroutineType(types: !1547)
!1547 = !{!952, !1357, !1548, !988, !1360, !952, !952}
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DISubroutineType(types: !1550)
!1550 = !{!952, !1357, !988}
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1071, file: !14, line: 2871, baseType: !1552, size: 64, align: 64, offset: 6464)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1553 = !DISubroutineType(types: !1554)
!1554 = !{!952, !1357, !1555, !988, !1360, !952}
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1556 = !DISubroutineType(types: !1557)
!1557 = !{!952, !1357, !988, !952, !952}
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1071, file: !14, line: 2878, baseType: !952, size: 32, align: 32, offset: 6528)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1071, file: !14, line: 2885, baseType: !952, size: 32, align: 32, offset: 6560)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1071, file: !14, line: 3005, baseType: !952, size: 32, align: 32, offset: 6592)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1071, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1071, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1071, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1071, file: !14, line: 3037, baseType: !935, size: 64, align: 64, offset: 6720)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1071, file: !14, line: 3038, baseType: !952, size: 32, align: 32, offset: 6784)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1071, file: !14, line: 3050, baseType: !974, size: 64, align: 64, offset: 6848)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1071, file: !14, line: 3065, baseType: !952, size: 32, align: 32, offset: 6912)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1071, file: !14, line: 3083, baseType: !952, size: 32, align: 32, offset: 6944)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1071, file: !14, line: 3092, baseType: !956, size: 64, align: 32, offset: 6976)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1071, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1071, file: !14, line: 3106, baseType: !956, size: 64, align: 32, offset: 7072)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1071, file: !14, line: 3113, baseType: !1573, size: 64, align: 64, offset: 7168)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1575)
!1575 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1576)
!1576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1577)
!1577 = !{!1578, !1579, !1580, !1581, !1582, !1583, !1586}
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1576, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1576, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1576, file: !14, line: 720, baseType: !945, size: 64, align: 64, offset: 64)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1576, file: !14, line: 724, baseType: !945, size: 64, align: 64, offset: 128)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1576, file: !14, line: 728, baseType: !952, size: 32, align: 32, offset: 192)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1576, file: !14, line: 734, baseType: !1584, size: 64, align: 64, offset: 256)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1576, file: !14, line: 739, baseType: !1587, size: 64, align: 64, offset: 320)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64, align: 64)
!1588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1057)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1071, file: !14, line: 3129, baseType: !1002, size: 64, align: 64, offset: 7232)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1071, file: !14, line: 3130, baseType: !1002, size: 64, align: 64, offset: 7296)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1071, file: !14, line: 3131, baseType: !1002, size: 64, align: 64, offset: 7360)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1071, file: !14, line: 3132, baseType: !1002, size: 64, align: 64, offset: 7424)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1071, file: !14, line: 3139, baseType: !1483, size: 64, align: 64, offset: 7488)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1071, file: !14, line: 3147, baseType: !952, size: 32, align: 32, offset: 7552)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1071, file: !14, line: 3165, baseType: !952, size: 32, align: 32, offset: 7584)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1071, file: !14, line: 3172, baseType: !952, size: 32, align: 32, offset: 7616)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1071, file: !14, line: 3180, baseType: !952, size: 32, align: 32, offset: 7648)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1071, file: !14, line: 3191, baseType: !1397, size: 64, align: 64, offset: 7680)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1071, file: !14, line: 3199, baseType: !935, size: 64, align: 64, offset: 7744)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1071, file: !14, line: 3207, baseType: !1483, size: 64, align: 64, offset: 7808)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1071, file: !14, line: 3214, baseType: !932, size: 32, align: 32, offset: 7872)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1071, file: !14, line: 3224, baseType: !1226, size: 64, align: 64, offset: 7936)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1071, file: !14, line: 3225, baseType: !952, size: 32, align: 32, offset: 8000)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1071, file: !14, line: 3249, baseType: !1128, size: 64, align: 64, offset: 8064)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1071, file: !14, line: 3256, baseType: !952, size: 32, align: 32, offset: 8128)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1071, file: !14, line: 3271, baseType: !952, size: 32, align: 32, offset: 8160)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1071, file: !14, line: 3279, baseType: !1002, size: 64, align: 64, offset: 8192)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1071, file: !14, line: 3301, baseType: !1128, size: 64, align: 64, offset: 8256)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1071, file: !14, line: 3310, baseType: !952, size: 32, align: 32, offset: 8320)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1071, file: !14, line: 3337, baseType: !952, size: 32, align: 32, offset: 8352)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1071, file: !14, line: 3351, baseType: !952, size: 32, align: 32, offset: 8384)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1071, file: !14, line: 3359, baseType: !952, size: 32, align: 32, offset: 8416)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !942, file: !14, line: 3535, baseType: !1614, size: 64, align: 64, offset: 1024)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1615, size: 64, align: 64)
!1615 = !DISubroutineType(types: !1616)
!1616 = !{!952, !1069, !1617}
!1617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1618, size: 64, align: 64)
!1618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1070)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !942, file: !14, line: 3541, baseType: !1620, size: 64, align: 64, offset: 1088)
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64, align: 64)
!1621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1622)
!1622 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1623)
!1623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1085, line: 223, size: 128, align: 64, elements: !1624)
!1624 = !{!1625, !1626}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1623, file: !1085, line: 224, baseType: !1509, size: 64, align: 64)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1623, file: !1085, line: 225, baseType: !1509, size: 64, align: 64, offset: 64)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !942, file: !14, line: 3549, baseType: !1628, size: 64, align: 64, offset: 1152)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64, align: 64)
!1629 = !DISubroutineType(types: !1630)
!1630 = !{null, !1064}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !942, file: !14, line: 3551, baseType: !1066, size: 64, align: 64, offset: 1216)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !942, file: !14, line: 3552, baseType: !1633, size: 64, align: 64, offset: 1280)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DISubroutineType(types: !1635)
!1635 = !{!952, !1069, !935, !952, !1636}
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1638)
!1638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1639)
!1639 = !{!1640, !1641, !1642, !1643, !1644, !1668}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1638, file: !14, line: 3921, baseType: !923, size: 16, align: 16)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1638, file: !14, line: 3922, baseType: !931, size: 32, align: 32, offset: 32)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1638, file: !14, line: 3923, baseType: !931, size: 32, align: 32, offset: 64)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1638, file: !14, line: 3924, baseType: !932, size: 32, align: 32, offset: 96)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1638, file: !14, line: 3925, baseType: !1645, size: 64, align: 64, offset: 128)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1648)
!1648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1649)
!1649 = !{!1650, !1651, !1652, !1653, !1654, !1655, !1661, !1663, !1664, !1665, !1666, !1667}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1648, file: !14, line: 3886, baseType: !952, size: 32, align: 32)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1648, file: !14, line: 3887, baseType: !952, size: 32, align: 32, offset: 32)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1648, file: !14, line: 3888, baseType: !952, size: 32, align: 32, offset: 64)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1648, file: !14, line: 3889, baseType: !952, size: 32, align: 32, offset: 96)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1648, file: !14, line: 3890, baseType: !952, size: 32, align: 32, offset: 128)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1648, file: !14, line: 3897, baseType: !1656, size: 768, align: 64, offset: 192)
!1656 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1657)
!1657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1658)
!1658 = !{!1659, !1660}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1657, file: !14, line: 3855, baseType: !1096, size: 512, align: 64)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1657, file: !14, line: 3857, baseType: !1100, size: 256, align: 32, offset: 512)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1648, file: !14, line: 3903, baseType: !1662, size: 256, align: 64, offset: 960)
!1662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 256, align: 64, elements: !1197)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1648, file: !14, line: 3904, baseType: !1204, size: 128, align: 32, offset: 1216)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1648, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1648, file: !14, line: 3908, baseType: !1483, size: 64, align: 64, offset: 1408)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1648, file: !14, line: 3915, baseType: !1483, size: 64, align: 64, offset: 1472)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1648, file: !14, line: 3917, baseType: !952, size: 32, align: 32, offset: 1536)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1638, file: !14, line: 3926, baseType: !1002, size: 64, align: 64, offset: 192)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !942, file: !14, line: 3564, baseType: !1670, size: 64, align: 64, offset: 1344)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{!952, !1069, !1214, !1358, !1360}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !942, file: !14, line: 3566, baseType: !1674, size: 64, align: 64, offset: 1408)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DISubroutineType(types: !1676)
!1676 = !{!952, !1069, !988, !1360, !1214}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !942, file: !14, line: 3567, baseType: !1066, size: 64, align: 64, offset: 1472)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !942, file: !14, line: 3576, baseType: !1679, size: 64, align: 64, offset: 1536)
