; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--parser.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--parser.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecParserContext = type { i8*, %struct.AVCodecParser*, i64, i64, i64, i32, i32, i64, i64, i64, i64, i32, i32, [4 x i64], [4 x i64], [4 x i64], i32, i64, [4 x i64], i32, i64, i32, i32, i32, [4 x i64], i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVCodecParser = type { [5 x i32], i32, i32 (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecParserContext*, %struct.AVCodecContext*, i8**, i32*, i8*, i32)*, void (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecContext*, i8*, i32)*, %struct.AVCodecParser* }

!816 = !DIEnumerator(name: "AVCOL_TRC_LOG", value: 9)
!817 = !DIEnumerator(name: "AVCOL_TRC_LOG_SQRT", value: 10)
!818 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_4", value: 11)
!819 = !DIEnumerator(name: "AVCOL_TRC_BT1361_ECG", value: 12)
!820 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_1", value: 13)
!821 = !DIEnumerator(name: "AVCOL_TRC_BT2020_10", value: 14)
!822 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!823 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!824 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!825 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!826 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!827 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!828 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!829 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !495, line: 493, size: 32, align: 32, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847}
!831 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!832 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!833 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!834 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!835 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!836 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!837 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!838 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!839 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!840 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!841 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!842 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!843 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!844 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!845 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!846 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!847 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!848 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !495, line: 538, size: 32, align: 32, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857}
!850 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!851 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!852 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!853 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!854 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!855 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!856 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!857 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !35, line: 1534, size: 32, align: 32, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865}
!860 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!861 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!862 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!863 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!864 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!865 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !35, line: 810, size: 32, align: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !35, line: 5085, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892}
!889 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!890 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!891 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!892 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!893 = !{!894, !917, !1685, !913, !1089}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64, align: 64)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParser", file: !35, line: 5272, baseType: !896)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParser", file: !35, line: 5259, size: 512, align: 64, elements: !897)
!897 = !{!898, !903, !904, !956, !1686, !1690, !1694}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !896, file: !35, line: 5260, baseType: !899, size: 160, align: 32)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !900, size: 160, align: 32, elements: !901)
!900 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!901 = !{!902}
!902 = !DISubrange(count: 5)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !896, file: !35, line: 5261, baseType: !900, size: 32, align: 32, offset: 160)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "parser_init", scope: !896, file: !35, line: 5262, baseType: !905, size: 64, align: 64, offset: 192)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64, align: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!900, !908}
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParserContext", file: !35, line: 5257, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParserContext", file: !35, line: 5092, size: 2816, align: 64, elements: !911)
!911 = !{!912, !914, !916, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !910, file: !35, line: 5093, baseType: !913, size: 64, align: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !910, file: !35, line: 5094, baseType: !915, size: 64, align: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64, align: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !910, file: !35, line: 5095, baseType: !917, size: 64, align: 64, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !918, line: 40, baseType: !919)
!918 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!919 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "cur_offset", scope: !910, file: !35, line: 5096, baseType: !917, size: 64, align: 64, offset: 192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame_offset", scope: !910, file: !35, line: 5098, baseType: !917, size: 64, align: 64, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !910, file: !35, line: 5100, baseType: !900, size: 32, align: 32, offset: 320)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !910, file: !35, line: 5110, baseType: !900, size: 32, align: 32, offset: 352)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !910, file: !35, line: 5111, baseType: !917, size: 64, align: 64, offset: 384)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !910, file: !35, line: 5112, baseType: !917, size: 64, align: 64, offset: 448)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "last_pts", scope: !910, file: !35, line: 5115, baseType: !917, size: 64, align: 64, offset: 512)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "last_dts", scope: !910, file: !35, line: 5116, baseType: !917, size: 64, align: 64, offset: 576)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "fetch_timestamp", scope: !910, file: !35, line: 5117, baseType: !900, size: 32, align: 32, offset: 640)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_start_index", scope: !910, file: !35, line: 5120, baseType: !900, size: 32, align: 32, offset: 672)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_offset", scope: !910, file: !35, line: 5121, baseType: !931, size: 256, align: 64, offset: 704)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 256, align: 64, elements: !932)
!932 = !{!933}
!933 = !DISubrange(count: 4)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pts", scope: !910, file: !35, line: 5122, baseType: !931, size: 256, align: 64, offset: 960)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_dts", scope: !910, file: !35, line: 5123, baseType: !931, size: 256, align: 64, offset: 1216)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !910, file: !35, line: 5125, baseType: !900, size: 32, align: 32, offset: 1472)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !910, file: !35, line: 5132, baseType: !917, size: 64, align: 64, offset: 1536)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_end", scope: !910, file: !35, line: 5133, baseType: !931, size: 256, align: 64, offset: 1600)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !910, file: !35, line: 5141, baseType: !900, size: 32, align: 32, offset: 1856)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !910, file: !35, line: 5148, baseType: !917, size: 64, align: 64, offset: 1920)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "dts_sync_point", scope: !910, file: !35, line: 5161, baseType: !900, size: 32, align: 32, offset: 1984)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "dts_ref_dts_delta", scope: !910, file: !35, line: 5176, baseType: !900, size: 32, align: 32, offset: 2016)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "pts_dts_delta", scope: !910, file: !35, line: 5190, baseType: !900, size: 32, align: 32, offset: 2048)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pos", scope: !910, file: !35, line: 5197, baseType: !931, size: 256, align: 64, offset: 2112)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !910, file: !35, line: 5202, baseType: !917, size: 64, align: 64, offset: 2368)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !910, file: !35, line: 5207, baseType: !917, size: 64, align: 64, offset: 2432)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !910, file: !35, line: 5214, baseType: !900, size: 32, align: 32, offset: 2496)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !910, file: !35, line: 5216, baseType: !858, size: 32, align: 32, offset: 2528)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "picture_structure", scope: !910, file: !35, line: 5226, baseType: !887, size: 32, align: 32, offset: 2560)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "output_picture_number", scope: !910, file: !35, line: 5234, baseType: !900, size: 32, align: 32, offset: 2592)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !910, file: !35, line: 5239, baseType: !900, size: 32, align: 32, offset: 2624)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !910, file: !35, line: 5240, baseType: !900, size: 32, align: 32, offset: 2656)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !910, file: !35, line: 5245, baseType: !900, size: 32, align: 32, offset: 2688)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !910, file: !35, line: 5246, baseType: !900, size: 32, align: 32, offset: 2720)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !910, file: !35, line: 5256, baseType: !900, size: 32, align: 32, offset: 2752)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "parser_parse", scope: !896, file: !35, line: 5265, baseType: !957, size: 64, align: 64, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!900, !908, !960, !1685, !1253, !1077, !900}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !963)
!963 = !{!964, !1008, !1009, !1010, !1283, !1284, !1285, !1286, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1439, !1443, !1444, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1623, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !962, file: !35, line: 1561, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !969)
!969 = !{!970, !974, !978, !982, !983, !984, !985, !989, !995, !997, !1001}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !968, file: !4, line: 72, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !968, file: !4, line: 78, baseType: !975, size: 64, align: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!971, !913}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !968, file: !4, line: 85, baseType: !979, size: 64, align: 64, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !968, file: !4, line: 93, baseType: !900, size: 32, align: 32, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !968, file: !4, line: 99, baseType: !900, size: 32, align: 32, offset: 224)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !968, file: !4, line: 108, baseType: !900, size: 32, align: 32, offset: 256)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !968, file: !4, line: 113, baseType: !986, size: 64, align: 64, offset: 320)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!913, !913, !913}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !968, file: !4, line: 123, baseType: !990, size: 64, align: 64, offset: 384)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!993, !993}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !968, file: !4, line: 130, baseType: !996, size: 32, align: 32, offset: 448)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !968, file: !4, line: 136, baseType: !998, size: 64, align: 64, offset: 512)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!996, !913}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !968, file: !4, line: 142, baseType: !1002, size: 64, align: 64, offset: 576)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!900, !1005, !913, !971, !900}
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !962, file: !35, line: 1562, baseType: !900, size: 32, align: 32, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !962, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !962, file: !35, line: 1565, baseType: !1011, size: 64, align: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019, !1020, !1029, !1032, !1035, !1038, !1043, !1046, !1047, !1055, !1056, !1057, !1059, !1063, !1069, !1080, !1084, !1085, !1133, !1254, !1258, !1259, !1263, !1267, !1272, !1276, !1277, !1278}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1013, file: !35, line: 3475, baseType: !971, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1013, file: !35, line: 3480, baseType: !971, size: 64, align: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1013, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1013, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1013, file: !35, line: 3487, baseType: !900, size: 32, align: 32, offset: 192)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1013, file: !35, line: 3488, baseType: !1021, size: 64, align: 64, offset: 256)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1024, line: 61, baseType: !1025)
!1024 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1024, line: 58, size: 64, align: 32, elements: !1026)
!1026 = !{!1027, !1028}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1025, file: !1024, line: 59, baseType: !900, size: 32, align: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1025, file: !1024, line: 60, baseType: !900, size: 32, align: 32, offset: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1013, file: !35, line: 3489, baseType: !1030, size: 64, align: 64, offset: 320)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1013, file: !35, line: 3490, baseType: !1033, size: 64, align: 64, offset: 384)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !900)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1013, file: !35, line: 3491, baseType: !1036, size: 64, align: 64, offset: 448)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1013, file: !35, line: 3492, baseType: !1039, size: 64, align: 64, offset: 512)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1041)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !918, line: 55, baseType: !1042)
!1042 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1013, file: !35, line: 3493, baseType: !1044, size: 8, align: 8, offset: 576)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !918, line: 48, baseType: !1045)
!1045 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1013, file: !35, line: 3494, baseType: !965, size: 64, align: 64, offset: 640)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1013, file: !35, line: 3495, baseType: !1048, size: 64, align: 64, offset: 704)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1051)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1052)
!1052 = !{!1053, !1054}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1051, file: !35, line: 3402, baseType: !900, size: 32, align: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1051, file: !35, line: 3403, baseType: !971, size: 64, align: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1013, file: !35, line: 3507, baseType: !971, size: 64, align: 64, offset: 768)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1013, file: !35, line: 3516, baseType: !900, size: 32, align: 32, offset: 832)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1013, file: !35, line: 3517, baseType: !1058, size: 64, align: 64, offset: 896)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1013, file: !35, line: 3527, baseType: !1060, size: 64, align: 64, offset: 960)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!900, !960}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1013, file: !35, line: 3535, baseType: !1064, size: 64, align: 64, offset: 1024)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!900, !960, !1067}
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1013, file: !35, line: 3541, baseType: !1070, size: 64, align: 64, offset: 1088)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1072)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1074, line: 223, size: 128, align: 64, elements: !1075)
!1074 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1075 = !{!1076, !1079}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1073, file: !1074, line: 224, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1044)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1073, file: !1074, line: 225, baseType: !1077, size: 64, align: 64, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1013, file: !35, line: 3549, baseType: !1081, size: 64, align: 64, offset: 1152)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{null, !1058}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1013, file: !35, line: 3551, baseType: !1060, size: 64, align: 64, offset: 1216)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1013, file: !35, line: 3552, baseType: !1086, size: 64, align: 64, offset: 1280)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!900, !960, !1089, !900, !1090}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1093)
!1093 = !{!1094, !1097, !1100, !1101, !1102, !1132}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1092, file: !35, line: 3921, baseType: !1095, size: 16, align: 16)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !918, line: 49, baseType: !1096)
!1096 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1092, file: !35, line: 3922, baseType: !1098, size: 32, align: 32, offset: 32)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !918, line: 51, baseType: !1099)
!1099 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1092, file: !35, line: 3923, baseType: !1098, size: 32, align: 32, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1092, file: !35, line: 3924, baseType: !1099, size: 32, align: 32, offset: 96)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1092, file: !35, line: 3925, baseType: !1103, size: 64, align: 64, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1107)
!1107 = !{!1108, !1109, !1110, !1111, !1112, !1113, !1123, !1125, !1127, !1128, !1130, !1131}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1106, file: !35, line: 3886, baseType: !900, size: 32, align: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1106, file: !35, line: 3887, baseType: !900, size: 32, align: 32, offset: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1106, file: !35, line: 3888, baseType: !900, size: 32, align: 32, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1106, file: !35, line: 3889, baseType: !900, size: 32, align: 32, offset: 96)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1106, file: !35, line: 3890, baseType: !900, size: 32, align: 32, offset: 128)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1106, file: !35, line: 3897, baseType: !1114, size: 768, align: 64, offset: 192)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1115)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1116)
!1116 = !{!1117, !1121}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1115, file: !35, line: 3855, baseType: !1118, size: 512, align: 64)
!1118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1089, size: 512, align: 64, elements: !1119)
!1119 = !{!1120}
!1120 = !DISubrange(count: 8)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1115, file: !35, line: 3857, baseType: !1122, size: 256, align: 32, offset: 512)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !900, size: 256, align: 32, elements: !1119)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1106, file: !35, line: 3903, baseType: !1124, size: 256, align: 64, offset: 960)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1089, size: 256, align: 64, elements: !932)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1106, file: !35, line: 3904, baseType: !1126, size: 128, align: 32, offset: 1216)
!1126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !900, size: 128, align: 32, elements: !932)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1106, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1106, file: !35, line: 3908, baseType: !1129, size: 64, align: 64, offset: 1408)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1106, file: !35, line: 3915, baseType: !1129, size: 64, align: 64, offset: 1472)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1106, file: !35, line: 3917, baseType: !900, size: 32, align: 32, offset: 1536)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1092, file: !35, line: 3926, baseType: !917, size: 64, align: 64, offset: 192)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1013, file: !35, line: 3564, baseType: !1134, size: 64, align: 64, offset: 1344)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!900, !960, !1137, !1171, !1253}
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1139)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1140)
!1140 = !{!1141, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1167, !1168, !1169, !1170}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1139, file: !35, line: 1451, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1144, line: 94, baseType: !1145)
!1144 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1144, line: 81, size: 192, align: 64, elements: !1146)
!1146 = !{!1147, !1151, !1152}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1145, file: !1144, line: 82, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1144, line: 73, baseType: !1150)
!1150 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1144, line: 73, flags: DIFlagFwdDecl)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1145, file: !1144, line: 89, baseType: !1089, size: 64, align: 64, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1145, file: !1144, line: 93, baseType: !900, size: 32, align: 32, offset: 128)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1139, file: !35, line: 1461, baseType: !917, size: 64, align: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1139, file: !35, line: 1467, baseType: !917, size: 64, align: 64, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1139, file: !35, line: 1468, baseType: !1089, size: 64, align: 64, offset: 192)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1139, file: !35, line: 1469, baseType: !900, size: 32, align: 32, offset: 256)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1139, file: !35, line: 1470, baseType: !900, size: 32, align: 32, offset: 288)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1139, file: !35, line: 1474, baseType: !900, size: 32, align: 32, offset: 320)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1139, file: !35, line: 1479, baseType: !1160, size: 64, align: 64, offset: 384)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1163)
!1163 = !{!1164, !1165, !1166}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1162, file: !35, line: 1412, baseType: !1089, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1162, file: !35, line: 1413, baseType: !900, size: 32, align: 32, offset: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1162, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1139, file: !35, line: 1480, baseType: !900, size: 32, align: 32, offset: 448)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1139, file: !35, line: 1486, baseType: !917, size: 64, align: 64, offset: 512)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1139, file: !35, line: 1488, baseType: !917, size: 64, align: 64, offset: 576)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1139, file: !35, line: 1497, baseType: !917, size: 64, align: 64, offset: 640)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1173)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1174)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1175)
!1175 = !{!1176, !1177, !1178, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1205, !1207, !1208, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1241, !1242, !1243, !1244, !1245, !1246, !1249, !1250, !1251, !1252}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1174, file: !758, line: 282, baseType: !1118, size: 512, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1174, file: !758, line: 299, baseType: !1122, size: 256, align: 32, offset: 512)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1174, file: !758, line: 315, baseType: !1179, size: 64, align: 64, offset: 768)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1174, file: !758, line: 326, baseType: !900, size: 32, align: 32, offset: 832)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1174, file: !758, line: 326, baseType: !900, size: 32, align: 32, offset: 864)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1174, file: !758, line: 334, baseType: !900, size: 32, align: 32, offset: 896)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1174, file: !758, line: 341, baseType: !900, size: 32, align: 32, offset: 928)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1174, file: !758, line: 346, baseType: !900, size: 32, align: 32, offset: 960)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1174, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1174, file: !758, line: 356, baseType: !1023, size: 64, align: 32, offset: 1024)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1174, file: !758, line: 361, baseType: !917, size: 64, align: 64, offset: 1088)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1174, file: !758, line: 369, baseType: !917, size: 64, align: 64, offset: 1152)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1174, file: !758, line: 377, baseType: !917, size: 64, align: 64, offset: 1216)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1174, file: !758, line: 382, baseType: !900, size: 32, align: 32, offset: 1280)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1174, file: !758, line: 386, baseType: !900, size: 32, align: 32, offset: 1312)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1174, file: !758, line: 391, baseType: !900, size: 32, align: 32, offset: 1344)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1174, file: !758, line: 396, baseType: !913, size: 64, align: 64, offset: 1408)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1174, file: !758, line: 403, baseType: !1195, size: 512, align: 64, offset: 1472)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1041, size: 512, align: 64, elements: !1119)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1174, file: !758, line: 410, baseType: !900, size: 32, align: 32, offset: 1984)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1174, file: !758, line: 415, baseType: !900, size: 32, align: 32, offset: 2016)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1174, file: !758, line: 420, baseType: !900, size: 32, align: 32, offset: 2048)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1174, file: !758, line: 425, baseType: !900, size: 32, align: 32, offset: 2080)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1174, file: !758, line: 435, baseType: !917, size: 64, align: 64, offset: 2112)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1174, file: !758, line: 440, baseType: !900, size: 32, align: 32, offset: 2176)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1174, file: !758, line: 445, baseType: !1041, size: 64, align: 64, offset: 2240)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1174, file: !758, line: 459, baseType: !1204, size: 512, align: 64, offset: 2304)
!1204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1142, size: 512, align: 64, elements: !1119)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1174, file: !758, line: 473, baseType: !1206, size: 64, align: 64, offset: 2816)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1174, file: !758, line: 477, baseType: !900, size: 32, align: 32, offset: 2880)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1174, file: !758, line: 479, baseType: !1209, size: 64, align: 64, offset: 2944)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1213)
!1213 = !{!1214, !1215, !1216, !1217, !1222}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1212, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1212, file: !758, line: 203, baseType: !1089, size: 64, align: 64, offset: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1212, file: !758, line: 204, baseType: !900, size: 32, align: 32, offset: 128)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1212, file: !758, line: 205, baseType: !1218, size: 64, align: 64, offset: 192)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1220, line: 86, baseType: !1221)
!1220 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1221 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1220, line: 86, flags: DIFlagFwdDecl)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1212, file: !758, line: 206, baseType: !1142, size: 64, align: 64, offset: 256)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1174, file: !758, line: 480, baseType: !900, size: 32, align: 32, offset: 3008)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1174, file: !758, line: 505, baseType: !900, size: 32, align: 32, offset: 3040)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1174, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1174, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1174, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1174, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1174, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1174, file: !758, line: 532, baseType: !917, size: 64, align: 64, offset: 3264)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1174, file: !758, line: 539, baseType: !917, size: 64, align: 64, offset: 3328)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1174, file: !758, line: 547, baseType: !917, size: 64, align: 64, offset: 3392)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1174, file: !758, line: 554, baseType: !1218, size: 64, align: 64, offset: 3456)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1174, file: !758, line: 563, baseType: !900, size: 32, align: 32, offset: 3520)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1174, file: !758, line: 572, baseType: !900, size: 32, align: 32, offset: 3552)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1174, file: !758, line: 581, baseType: !900, size: 32, align: 32, offset: 3584)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1174, file: !758, line: 588, baseType: !1238, size: 64, align: 64, offset: 3648)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !918, line: 36, baseType: !1240)
!1240 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1174, file: !758, line: 593, baseType: !900, size: 32, align: 32, offset: 3712)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1174, file: !758, line: 596, baseType: !900, size: 32, align: 32, offset: 3744)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1174, file: !758, line: 599, baseType: !1142, size: 64, align: 64, offset: 3776)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1174, file: !758, line: 605, baseType: !1142, size: 64, align: 64, offset: 3840)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1174, file: !758, line: 616, baseType: !1142, size: 64, align: 64, offset: 3904)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1174, file: !758, line: 626, baseType: !1247, size: 64, align: 64, offset: 3968)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1248, line: 216, baseType: !1042)
!1248 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1174, file: !758, line: 627, baseType: !1247, size: 64, align: 64, offset: 4032)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1174, file: !758, line: 628, baseType: !1247, size: 64, align: 64, offset: 4096)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1174, file: !758, line: 629, baseType: !1247, size: 64, align: 64, offset: 4160)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1174, file: !758, line: 645, baseType: !1142, size: 64, align: 64, offset: 4224)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1013, file: !35, line: 3566, baseType: !1255, size: 64, align: 64, offset: 1408)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!900, !960, !913, !1253, !1137}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1013, file: !35, line: 3567, baseType: !1060, size: 64, align: 64, offset: 1472)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1013, file: !35, line: 3576, baseType: !1260, size: 64, align: 64, offset: 1536)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!900, !960, !1171}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1013, file: !35, line: 3577, baseType: !1264, size: 64, align: 64, offset: 1600)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!900, !960, !1137}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1013, file: !35, line: 3584, baseType: !1268, size: 64, align: 64, offset: 1664)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!900, !960, !1271}
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1013, file: !35, line: 3589, baseType: !1273, size: 64, align: 64, offset: 1728)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{null, !960}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1013, file: !35, line: 3594, baseType: !900, size: 32, align: 32, offset: 1792)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1013, file: !35, line: 3600, baseType: !971, size: 64, align: 64, offset: 1856)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1013, file: !35, line: 3609, baseType: !1279, size: 64, align: 64, offset: 1920)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1282)
!1282 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !962, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !962, file: !35, line: 1581, baseType: !1099, size: 32, align: 32, offset: 224)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !962, file: !35, line: 1583, baseType: !913, size: 64, align: 64, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !962, file: !35, line: 1591, baseType: !1287, size: 64, align: 64, offset: 320)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1074, line: 129, size: 1664, align: 64, elements: !1289)
!1289 = !{!1290, !1291, !1292, !1293, !1294, !1312, !1313, !1319, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1288, file: !1074, line: 136, baseType: !900, size: 32, align: 32)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1288, file: !1074, line: 151, baseType: !900, size: 32, align: 32, offset: 32)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1288, file: !1074, line: 157, baseType: !900, size: 32, align: 32, offset: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1288, file: !1074, line: 159, baseType: !1271, size: 64, align: 64, offset: 128)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1288, file: !1074, line: 161, baseType: !1295, size: 64, align: 64, offset: 192)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1074, line: 117, baseType: !1297)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1074, line: 100, size: 832, align: 64, elements: !1298)
!1298 = !{!1299, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1297, file: !1074, line: 105, baseType: !1300, size: 256, align: 64)
!1300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1301, size: 256, align: 64, elements: !932)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1144, line: 238, baseType: !1303)
!1303 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1144, line: 238, flags: DIFlagFwdDecl)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1297, file: !1074, line: 110, baseType: !900, size: 32, align: 32, offset: 256)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1297, file: !1074, line: 111, baseType: !900, size: 32, align: 32, offset: 288)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1297, file: !1074, line: 111, baseType: !900, size: 32, align: 32, offset: 320)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1297, file: !1074, line: 112, baseType: !1122, size: 256, align: 32, offset: 352)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1297, file: !1074, line: 113, baseType: !1126, size: 128, align: 32, offset: 608)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1297, file: !1074, line: 114, baseType: !900, size: 32, align: 32, offset: 736)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1297, file: !1074, line: 115, baseType: !900, size: 32, align: 32, offset: 768)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1297, file: !1074, line: 116, baseType: !900, size: 32, align: 32, offset: 800)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1288, file: !1074, line: 163, baseType: !913, size: 64, align: 64, offset: 256)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1288, file: !1074, line: 165, baseType: !1314, size: 128, align: 64, offset: 320)
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1074, line: 122, baseType: !1315)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1074, line: 119, size: 128, align: 64, elements: !1316)
!1316 = !{!1317, !1318}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1315, file: !1074, line: 120, baseType: !1137, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1315, file: !1074, line: 121, baseType: !1271, size: 64, align: 64, offset: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1288, file: !1074, line: 166, baseType: !1320, size: 128, align: 64, offset: 448)
!1320 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1074, line: 127, baseType: !1321)
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1074, line: 124, size: 128, align: 64, elements: !1322)
!1322 = !{!1323, !1396}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1321, file: !1074, line: 125, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1327)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1328)
!1328 = !{!1329, !1330, !1354, !1358, !1359, !1393, !1394, !1395}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1327, file: !35, line: 5751, baseType: !965, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1327, file: !35, line: 5756, baseType: !1331, size: 64, align: 64, offset: 64)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1333)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1334)
!1334 = !{!1335, !1336, !1339, !1340, !1341, !1345, !1349, !1353}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1333, file: !35, line: 5797, baseType: !971, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1333, file: !35, line: 5804, baseType: !1337, size: 64, align: 64, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1333, file: !35, line: 5815, baseType: !965, size: 64, align: 64, offset: 128)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1333, file: !35, line: 5825, baseType: !900, size: 32, align: 32, offset: 192)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1333, file: !35, line: 5826, baseType: !1342, size: 64, align: 64, offset: 256)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!900, !1325}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1333, file: !35, line: 5827, baseType: !1346, size: 64, align: 64, offset: 320)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DISubroutineType(types: !1348)
!1348 = !{!900, !1325, !1137}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1333, file: !35, line: 5828, baseType: !1350, size: 64, align: 64, offset: 384)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DISubroutineType(types: !1352)
!1352 = !{null, !1325}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1333, file: !35, line: 5829, baseType: !1350, size: 64, align: 64, offset: 448)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1327, file: !35, line: 5762, baseType: !1355, size: 64, align: 64, offset: 128)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1357)
!1357 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1327, file: !35, line: 5768, baseType: !913, size: 64, align: 64, offset: 192)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1327, file: !35, line: 5775, baseType: !1360, size: 64, align: 64, offset: 256)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1362)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1363)
!1363 = !{!1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1362, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1362, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1362, file: !35, line: 3948, baseType: !1098, size: 32, align: 32, offset: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1362, file: !35, line: 3958, baseType: !1089, size: 64, align: 64, offset: 128)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1362, file: !35, line: 3962, baseType: !900, size: 32, align: 32, offset: 192)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1362, file: !35, line: 3968, baseType: !900, size: 32, align: 32, offset: 224)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1362, file: !35, line: 3973, baseType: !917, size: 64, align: 64, offset: 256)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1362, file: !35, line: 3986, baseType: !900, size: 32, align: 32, offset: 320)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1362, file: !35, line: 3999, baseType: !900, size: 32, align: 32, offset: 352)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1362, file: !35, line: 4004, baseType: !900, size: 32, align: 32, offset: 384)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1362, file: !35, line: 4005, baseType: !900, size: 32, align: 32, offset: 416)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1362, file: !35, line: 4010, baseType: !900, size: 32, align: 32, offset: 448)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1362, file: !35, line: 4011, baseType: !900, size: 32, align: 32, offset: 480)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1362, file: !35, line: 4020, baseType: !1023, size: 64, align: 32, offset: 512)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1362, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1362, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1362, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1362, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1362, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1362, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1362, file: !35, line: 4039, baseType: !900, size: 32, align: 32, offset: 768)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1362, file: !35, line: 4046, baseType: !1041, size: 64, align: 64, offset: 832)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1362, file: !35, line: 4050, baseType: !900, size: 32, align: 32, offset: 896)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1362, file: !35, line: 4054, baseType: !900, size: 32, align: 32, offset: 928)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1362, file: !35, line: 4061, baseType: !900, size: 32, align: 32, offset: 960)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1362, file: !35, line: 4065, baseType: !900, size: 32, align: 32, offset: 992)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1362, file: !35, line: 4073, baseType: !900, size: 32, align: 32, offset: 1024)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1362, file: !35, line: 4080, baseType: !900, size: 32, align: 32, offset: 1056)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1362, file: !35, line: 4084, baseType: !900, size: 32, align: 32, offset: 1088)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1327, file: !35, line: 5781, baseType: !1360, size: 64, align: 64, offset: 320)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1327, file: !35, line: 5787, baseType: !1023, size: 64, align: 32, offset: 384)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1327, file: !35, line: 5793, baseType: !1023, size: 64, align: 32, offset: 448)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1321, file: !1074, line: 126, baseType: !900, size: 32, align: 32, offset: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1288, file: !1074, line: 172, baseType: !1137, size: 64, align: 64, offset: 576)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1288, file: !1074, line: 177, baseType: !1089, size: 64, align: 64, offset: 640)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1288, file: !1074, line: 178, baseType: !1099, size: 32, align: 32, offset: 704)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1288, file: !1074, line: 180, baseType: !913, size: 64, align: 64, offset: 768)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1288, file: !1074, line: 185, baseType: !900, size: 32, align: 32, offset: 832)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1288, file: !1074, line: 190, baseType: !913, size: 64, align: 64, offset: 896)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1288, file: !1074, line: 195, baseType: !900, size: 32, align: 32, offset: 960)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1288, file: !1074, line: 200, baseType: !1137, size: 64, align: 64, offset: 1024)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1288, file: !1074, line: 201, baseType: !900, size: 32, align: 32, offset: 1088)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1288, file: !1074, line: 202, baseType: !1271, size: 64, align: 64, offset: 1152)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1288, file: !1074, line: 203, baseType: !900, size: 32, align: 32, offset: 1216)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1288, file: !1074, line: 205, baseType: !900, size: 32, align: 32, offset: 1248)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1288, file: !1074, line: 206, baseType: !900, size: 32, align: 32, offset: 1280)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1288, file: !1074, line: 209, baseType: !1247, size: 64, align: 64, offset: 1344)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1288, file: !1074, line: 212, baseType: !1247, size: 64, align: 64, offset: 1408)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1288, file: !1074, line: 213, baseType: !1271, size: 64, align: 64, offset: 1472)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1288, file: !1074, line: 215, baseType: !900, size: 32, align: 32, offset: 1536)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1288, file: !1074, line: 217, baseType: !900, size: 32, align: 32, offset: 1568)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1288, file: !1074, line: 220, baseType: !900, size: 32, align: 32, offset: 1600)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !962, file: !35, line: 1598, baseType: !913, size: 64, align: 64, offset: 384)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !962, file: !35, line: 1606, baseType: !917, size: 64, align: 64, offset: 448)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !962, file: !35, line: 1614, baseType: !900, size: 32, align: 32, offset: 512)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !962, file: !35, line: 1622, baseType: !900, size: 32, align: 32, offset: 544)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !962, file: !35, line: 1628, baseType: !900, size: 32, align: 32, offset: 576)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !962, file: !35, line: 1636, baseType: !900, size: 32, align: 32, offset: 608)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !962, file: !35, line: 1643, baseType: !900, size: 32, align: 32, offset: 640)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !962, file: !35, line: 1657, baseType: !1089, size: 64, align: 64, offset: 704)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !962, file: !35, line: 1658, baseType: !900, size: 32, align: 32, offset: 768)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !962, file: !35, line: 1679, baseType: !1023, size: 64, align: 32, offset: 800)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !962, file: !35, line: 1688, baseType: !900, size: 32, align: 32, offset: 864)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !962, file: !35, line: 1712, baseType: !900, size: 32, align: 32, offset: 896)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !962, file: !35, line: 1729, baseType: !900, size: 32, align: 32, offset: 928)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !962, file: !35, line: 1729, baseType: !900, size: 32, align: 32, offset: 960)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !962, file: !35, line: 1744, baseType: !900, size: 32, align: 32, offset: 992)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !962, file: !35, line: 1744, baseType: !900, size: 32, align: 32, offset: 1024)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !962, file: !35, line: 1751, baseType: !900, size: 32, align: 32, offset: 1056)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !962, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !962, file: !35, line: 1791, baseType: !1435, size: 64, align: 64, offset: 1152)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DISubroutineType(types: !1437)
!1437 = !{null, !1438, !1171, !1253, !900, !900, !900}
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !962, file: !35, line: 1808, baseType: !1440, size: 64, align: 64, offset: 1216)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DISubroutineType(types: !1442)
!1442 = !{!494, !1438, !1030}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !962, file: !35, line: 1816, baseType: !900, size: 32, align: 32, offset: 1280)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !962, file: !35, line: 1825, baseType: !1445, size: 32, align: 32, offset: 1312)
!1445 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !962, file: !35, line: 1830, baseType: !900, size: 32, align: 32, offset: 1344)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !962, file: !35, line: 1838, baseType: !1445, size: 32, align: 32, offset: 1376)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !962, file: !35, line: 1846, baseType: !900, size: 32, align: 32, offset: 1408)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !962, file: !35, line: 1851, baseType: !900, size: 32, align: 32, offset: 1440)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !962, file: !35, line: 1861, baseType: !1445, size: 32, align: 32, offset: 1472)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !962, file: !35, line: 1868, baseType: !1445, size: 32, align: 32, offset: 1504)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !962, file: !35, line: 1875, baseType: !1445, size: 32, align: 32, offset: 1536)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !962, file: !35, line: 1882, baseType: !1445, size: 32, align: 32, offset: 1568)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !962, file: !35, line: 1889, baseType: !1445, size: 32, align: 32, offset: 1600)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !962, file: !35, line: 1896, baseType: !1445, size: 32, align: 32, offset: 1632)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !962, file: !35, line: 1903, baseType: !1445, size: 32, align: 32, offset: 1664)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !962, file: !35, line: 1910, baseType: !900, size: 32, align: 32, offset: 1696)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !962, file: !35, line: 1915, baseType: !900, size: 32, align: 32, offset: 1728)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !962, file: !35, line: 1926, baseType: !1253, size: 64, align: 64, offset: 1792)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !962, file: !35, line: 1935, baseType: !1023, size: 64, align: 32, offset: 1856)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !962, file: !35, line: 1942, baseType: !900, size: 32, align: 32, offset: 1920)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !962, file: !35, line: 1948, baseType: !900, size: 32, align: 32, offset: 1952)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !962, file: !35, line: 1954, baseType: !900, size: 32, align: 32, offset: 1984)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !962, file: !35, line: 1960, baseType: !900, size: 32, align: 32, offset: 2016)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !962, file: !35, line: 1984, baseType: !900, size: 32, align: 32, offset: 2048)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !962, file: !35, line: 1991, baseType: !900, size: 32, align: 32, offset: 2080)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !962, file: !35, line: 1996, baseType: !900, size: 32, align: 32, offset: 2112)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !962, file: !35, line: 2004, baseType: !900, size: 32, align: 32, offset: 2144)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !962, file: !35, line: 2011, baseType: !900, size: 32, align: 32, offset: 2176)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !962, file: !35, line: 2018, baseType: !900, size: 32, align: 32, offset: 2208)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !962, file: !35, line: 2027, baseType: !900, size: 32, align: 32, offset: 2240)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !962, file: !35, line: 2034, baseType: !900, size: 32, align: 32, offset: 2272)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !962, file: !35, line: 2044, baseType: !900, size: 32, align: 32, offset: 2304)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !962, file: !35, line: 2054, baseType: !1475, size: 64, align: 64, offset: 2368)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !962, file: !35, line: 2061, baseType: !1475, size: 64, align: 64, offset: 2432)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !962, file: !35, line: 2066, baseType: !900, size: 32, align: 32, offset: 2496)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !962, file: !35, line: 2070, baseType: !900, size: 32, align: 32, offset: 2528)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !962, file: !35, line: 2078, baseType: !900, size: 32, align: 32, offset: 2560)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !962, file: !35, line: 2085, baseType: !900, size: 32, align: 32, offset: 2592)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !962, file: !35, line: 2092, baseType: !900, size: 32, align: 32, offset: 2624)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !962, file: !35, line: 2099, baseType: !900, size: 32, align: 32, offset: 2656)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !962, file: !35, line: 2106, baseType: !900, size: 32, align: 32, offset: 2688)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !962, file: !35, line: 2113, baseType: !900, size: 32, align: 32, offset: 2720)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !962, file: !35, line: 2120, baseType: !900, size: 32, align: 32, offset: 2752)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !962, file: !35, line: 2125, baseType: !900, size: 32, align: 32, offset: 2784)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !962, file: !35, line: 2133, baseType: !900, size: 32, align: 32, offset: 2816)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !962, file: !35, line: 2140, baseType: !900, size: 32, align: 32, offset: 2848)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !962, file: !35, line: 2145, baseType: !900, size: 32, align: 32, offset: 2880)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !962, file: !35, line: 2153, baseType: !900, size: 32, align: 32, offset: 2912)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !962, file: !35, line: 2158, baseType: !900, size: 32, align: 32, offset: 2944)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !962, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !962, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !962, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !962, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !962, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !962, file: !35, line: 2203, baseType: !900, size: 32, align: 32, offset: 3136)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !962, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !962, file: !35, line: 2212, baseType: !900, size: 32, align: 32, offset: 3200)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !962, file: !35, line: 2213, baseType: !900, size: 32, align: 32, offset: 3232)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !962, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !962, file: !35, line: 2232, baseType: !900, size: 32, align: 32, offset: 3296)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !962, file: !35, line: 2243, baseType: !900, size: 32, align: 32, offset: 3328)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !962, file: !35, line: 2249, baseType: !900, size: 32, align: 32, offset: 3360)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !962, file: !35, line: 2256, baseType: !900, size: 32, align: 32, offset: 3392)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !962, file: !35, line: 2263, baseType: !1041, size: 64, align: 64, offset: 3456)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !962, file: !35, line: 2270, baseType: !1041, size: 64, align: 64, offset: 3520)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !962, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !962, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !962, file: !35, line: 2367, baseType: !1511, size: 64, align: 64, offset: 3648)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DISubroutineType(types: !1513)
!1513 = !{!900, !1438, !1271, !900}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !962, file: !35, line: 2383, baseType: !900, size: 32, align: 32, offset: 3712)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !962, file: !35, line: 2386, baseType: !1445, size: 32, align: 32, offset: 3744)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !962, file: !35, line: 2387, baseType: !1445, size: 32, align: 32, offset: 3776)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !962, file: !35, line: 2394, baseType: !900, size: 32, align: 32, offset: 3808)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !962, file: !35, line: 2401, baseType: !900, size: 32, align: 32, offset: 3840)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !962, file: !35, line: 2408, baseType: !900, size: 32, align: 32, offset: 3872)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !962, file: !35, line: 2415, baseType: !900, size: 32, align: 32, offset: 3904)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !962, file: !35, line: 2422, baseType: !900, size: 32, align: 32, offset: 3936)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !962, file: !35, line: 2423, baseType: !1523, size: 64, align: 64, offset: 3968)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1525)
!1525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1526)
!1526 = !{!1527, !1528, !1529, !1530}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1525, file: !35, line: 827, baseType: !900, size: 32, align: 32)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1525, file: !35, line: 828, baseType: !900, size: 32, align: 32, offset: 32)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1525, file: !35, line: 829, baseType: !900, size: 32, align: 32, offset: 64)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1525, file: !35, line: 830, baseType: !1445, size: 32, align: 32, offset: 96)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !962, file: !35, line: 2430, baseType: !917, size: 64, align: 64, offset: 4032)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !962, file: !35, line: 2437, baseType: !917, size: 64, align: 64, offset: 4096)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !962, file: !35, line: 2444, baseType: !1445, size: 32, align: 32, offset: 4160)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !962, file: !35, line: 2451, baseType: !1445, size: 32, align: 32, offset: 4192)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !962, file: !35, line: 2458, baseType: !900, size: 32, align: 32, offset: 4224)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !962, file: !35, line: 2469, baseType: !900, size: 32, align: 32, offset: 4256)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !962, file: !35, line: 2475, baseType: !900, size: 32, align: 32, offset: 4288)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !962, file: !35, line: 2481, baseType: !900, size: 32, align: 32, offset: 4320)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !962, file: !35, line: 2485, baseType: !900, size: 32, align: 32, offset: 4352)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !962, file: !35, line: 2489, baseType: !900, size: 32, align: 32, offset: 4384)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !962, file: !35, line: 2493, baseType: !900, size: 32, align: 32, offset: 4416)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !962, file: !35, line: 2501, baseType: !900, size: 32, align: 32, offset: 4448)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !962, file: !35, line: 2506, baseType: !900, size: 32, align: 32, offset: 4480)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !962, file: !35, line: 2510, baseType: !900, size: 32, align: 32, offset: 4512)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !962, file: !35, line: 2514, baseType: !917, size: 64, align: 64, offset: 4544)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !962, file: !35, line: 2528, baseType: !1547, size: 64, align: 64, offset: 4608)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DISubroutineType(types: !1549)
!1549 = !{null, !1438, !913, !900, !900}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !962, file: !35, line: 2534, baseType: !900, size: 32, align: 32, offset: 4672)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !962, file: !35, line: 2545, baseType: !900, size: 32, align: 32, offset: 4704)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !962, file: !35, line: 2547, baseType: !900, size: 32, align: 32, offset: 4736)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !962, file: !35, line: 2549, baseType: !900, size: 32, align: 32, offset: 4768)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !962, file: !35, line: 2551, baseType: !900, size: 32, align: 32, offset: 4800)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !962, file: !35, line: 2553, baseType: !900, size: 32, align: 32, offset: 4832)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !962, file: !35, line: 2555, baseType: !900, size: 32, align: 32, offset: 4864)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !962, file: !35, line: 2557, baseType: !900, size: 32, align: 32, offset: 4896)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !962, file: !35, line: 2559, baseType: !900, size: 32, align: 32, offset: 4928)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !962, file: !35, line: 2563, baseType: !900, size: 32, align: 32, offset: 4960)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !962, file: !35, line: 2571, baseType: !1129, size: 64, align: 64, offset: 4992)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !962, file: !35, line: 2579, baseType: !1129, size: 64, align: 64, offset: 5056)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !962, file: !35, line: 2586, baseType: !900, size: 32, align: 32, offset: 5120)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !962, file: !35, line: 2615, baseType: !900, size: 32, align: 32, offset: 5152)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !962, file: !35, line: 2627, baseType: !900, size: 32, align: 32, offset: 5184)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !962, file: !35, line: 2637, baseType: !900, size: 32, align: 32, offset: 5216)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !962, file: !35, line: 2681, baseType: !900, size: 32, align: 32, offset: 5248)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !962, file: !35, line: 2709, baseType: !917, size: 64, align: 64, offset: 5312)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !962, file: !35, line: 2716, baseType: !1569, size: 64, align: 64, offset: 5376)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64, align: 64)
!1570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1571)
!1571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1572)
!1572 = !{!1573, !1574, !1575, !1576, !1577, !1578, !1579, !1583, !1587, !1588, !1589, !1590, !1596, !1597, !1598, !1599, !1600}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1571, file: !35, line: 3642, baseType: !971, size: 64, align: 64)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1571, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1571, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1571, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1571, file: !35, line: 3669, baseType: !900, size: 32, align: 32, offset: 160)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1571, file: !35, line: 3682, baseType: !1268, size: 64, align: 64, offset: 192)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1571, file: !35, line: 3698, baseType: !1580, size: 64, align: 64, offset: 256)
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1581, size: 64, align: 64)
!1581 = !DISubroutineType(types: !1582)
!1582 = !{!900, !960, !1077, !1098}
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1571, file: !35, line: 3712, baseType: !1584, size: 64, align: 64, offset: 320)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = !DISubroutineType(types: !1586)
!1586 = !{!900, !960, !900, !1077, !1098}
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1571, file: !35, line: 3726, baseType: !1580, size: 64, align: 64, offset: 384)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1571, file: !35, line: 3737, baseType: !1060, size: 64, align: 64, offset: 448)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1571, file: !35, line: 3746, baseType: !900, size: 32, align: 32, offset: 512)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1571, file: !35, line: 3757, baseType: !1591, size: 64, align: 64, offset: 576)
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64, align: 64)
!1592 = !DISubroutineType(types: !1593)
!1593 = !{null, !1594}
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1571, file: !35, line: 3766, baseType: !1060, size: 64, align: 64, offset: 640)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1571, file: !35, line: 3774, baseType: !1060, size: 64, align: 64, offset: 704)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1571, file: !35, line: 3780, baseType: !900, size: 32, align: 32, offset: 768)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1571, file: !35, line: 3785, baseType: !900, size: 32, align: 32, offset: 800)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1571, file: !35, line: 3795, baseType: !1601, size: 64, align: 64, offset: 832)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DISubroutineType(types: !1603)
!1603 = !{!900, !960, !1142}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !962, file: !35, line: 2728, baseType: !913, size: 64, align: 64, offset: 5440)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !962, file: !35, line: 2735, baseType: !1195, size: 512, align: 64, offset: 5504)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !962, file: !35, line: 2742, baseType: !900, size: 32, align: 32, offset: 6016)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !962, file: !35, line: 2755, baseType: !900, size: 32, align: 32, offset: 6048)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !962, file: !35, line: 2776, baseType: !900, size: 32, align: 32, offset: 6080)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !962, file: !35, line: 2783, baseType: !900, size: 32, align: 32, offset: 6112)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !962, file: !35, line: 2791, baseType: !900, size: 32, align: 32, offset: 6144)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !962, file: !35, line: 2802, baseType: !1271, size: 64, align: 64, offset: 6208)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !962, file: !35, line: 2811, baseType: !900, size: 32, align: 32, offset: 6272)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !962, file: !35, line: 2821, baseType: !900, size: 32, align: 32, offset: 6304)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !962, file: !35, line: 2830, baseType: !900, size: 32, align: 32, offset: 6336)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !962, file: !35, line: 2840, baseType: !900, size: 32, align: 32, offset: 6368)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !962, file: !35, line: 2851, baseType: !1617, size: 64, align: 64, offset: 6400)
!1617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1618, size: 64, align: 64)
!1618 = !DISubroutineType(types: !1619)
!1619 = !{!900, !1438, !1620, !913, !1253, !900, !900}
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64, align: 64)
!1621 = !DISubroutineType(types: !1622)
!1622 = !{!900, !1438, !913}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !962, file: !35, line: 2871, baseType: !1624, size: 64, align: 64, offset: 6464)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DISubroutineType(types: !1626)
!1626 = !{!900, !1438, !1627, !913, !1253, !900}
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64, align: 64)
!1628 = !DISubroutineType(types: !1629)
!1629 = !{!900, !1438, !913, !900, !900}
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !962, file: !35, line: 2878, baseType: !900, size: 32, align: 32, offset: 6528)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !962, file: !35, line: 2885, baseType: !900, size: 32, align: 32, offset: 6560)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !962, file: !35, line: 3005, baseType: !900, size: 32, align: 32, offset: 6592)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !962, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !962, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !962, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !962, file: !35, line: 3037, baseType: !1089, size: 64, align: 64, offset: 6720)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !962, file: !35, line: 3038, baseType: !900, size: 32, align: 32, offset: 6784)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !962, file: !35, line: 3050, baseType: !1041, size: 64, align: 64, offset: 6848)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !962, file: !35, line: 3065, baseType: !900, size: 32, align: 32, offset: 6912)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !962, file: !35, line: 3083, baseType: !900, size: 32, align: 32, offset: 6944)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !962, file: !35, line: 3092, baseType: !1023, size: 64, align: 32, offset: 6976)
