; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--rv30dsp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--rv30dsp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RV34DSPContext = type { [4 x [16 x void (i8*, i8*, i64)*]], [4 x [16 x void (i8*, i8*, i64)*]], [3 x void (i8*, i8*, i64, i32, i32, i32)*], [3 x void (i8*, i8*, i64, i32, i32, i32)*], [2 x [2 x void (i8*, i8*, i8*, i32, i32, i64)*]], void (i16*)*, void (i16*)*, void (i8*, i64, i16*)*, void (i8*, i64, i32)*, [2 x void (i8*, i64, i32, i32, i32, i32, i32, i32, i32)*], [2 x void (i8*, i64, i32, i32, i32, i32)*], [2 x i32 (i8*, i64, i32, i32, i32, i32*, i32*)*] }
%struct.H264ChromaContext = type { [4 x void (i8*, i8*, i64, i32, i32, i32)*], [4 x void (i8*, i8*, i64, i32, i32, i32)*] }
%struct.H264QpelContext = type { [4 x [16 x void (i8*, i8*, i64)*]], [4 x [16 x void (i8*, i8*, i64)*]] }

@ff_crop_tab = external constant [2304 x i8], align 16

; Function Attrs: cold nounwind optsize uwtable
define void @ff_rv30dsp_init(%struct.RV34DSPContext* %c) #0 !dbg !6 {
entry:
  %c.addr = alloca %struct.RV34DSPContext*, align 8
  %h264chroma = alloca %struct.H264ChromaContext, align 8
  %qpel = alloca %struct.H264QpelContext, align 8
  store %struct.RV34DSPContext* %c, %struct.RV34DSPContext** %c.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--rv30dsp.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{}
!3 = !{i32 2, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!6 = distinct !DISubprogram(name: "ff_rv30dsp_init", scope: !7, file: !7, line: 265, type: !8, isLocal: false, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!7 = !DIFile(filename: "libavcodec/rv30dsp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "RV34DSPContext", file: !12, line: 75, baseType: !13)
!12 = !DIFile(filename: "libavcodec/rv34dsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RV34DSPContext", file: !12, line: 57, size: 9472, align: 64, elements: !14)
!14 = !{!15, !34, !35, !45, !46, !54, !62, !63, !68, !73, !80, !86}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "put_pixels_tab", scope: !13, file: !12, line: 58, baseType: !16, size: 4096, align: 64)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 4096, align: 64, elements: !31)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "qpel_mc_func", file: !18, line: 65, baseType: !19)
!18 = !DIFile(filename: "libavcodec/qpeldsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !22, !26, !28}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !24, line: 48, baseType: !25)
!24 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!25 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !29, line: 149, baseType: !30)
!29 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!30 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!31 = !{!32, !33}
!32 = !DISubrange(count: 4)
!33 = !DISubrange(count: 16)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "avg_pixels_tab", scope: !13, file: !12, line: 59, baseType: !16, size: 4096, align: 64, offset: 4096)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "put_chroma_pixels_tab", scope: !13, file: !12, line: 60, baseType: !36, size: 192, align: 64, offset: 8192)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 192, align: 64, elements: !43)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "h264_chroma_mc_func", file: !38, line: 25, baseType: !39)
!38 = !DIFile(filename: "libavcodec/h264chroma.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !22, !22, !28, !42, !42, !42}
!42 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!43 = !{!44}
!44 = !DISubrange(count: 3)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "avg_chroma_pixels_tab", scope: !13, file: !12, line: 61, baseType: !36, size: 192, align: 64, offset: 8384)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "rv40_weight_pixels_tab", scope: !13, file: !12, line: 67, baseType: !47, size: 256, align: 64, offset: 8576)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 256, align: 64, elements: !52)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "rv40_weight_func", file: !12, line: 33, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !22, !22, !22, !42, !42, !28}
!52 = !{!53, !53}
!53 = !DISubrange(count: 2)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "rv34_inv_transform", scope: !13, file: !12, line: 68, baseType: !55, size: 64, align: 64, offset: 8832)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "rv34_inv_transform_func", file: !12, line: 38, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !24, line: 37, baseType: !61)
!61 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "rv34_inv_transform_dc", scope: !13, file: !12, line: 69, baseType: !55, size: 64, align: 64, offset: 8896)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "rv34_idct_add", scope: !13, file: !12, line: 70, baseType: !64, size: 64, align: 64, offset: 8960)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "rv34_idct_add_func", file: !12, line: 40, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !22, !28, !59}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "rv34_idct_dc_add", scope: !13, file: !12, line: 71, baseType: !69, size: 64, align: 64, offset: 9024)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "rv34_idct_dc_add_func", file: !12, line: 41, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !22, !28, !42}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "rv40_weak_loop_filter", scope: !13, file: !12, line: 72, baseType: !74, size: 128, align: 64, offset: 9088)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 128, align: 64, elements: !79)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "rv40_weak_loop_filter_func", file: !12, line: 44, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !22, !28, !42, !42, !42, !42, !42, !42, !42}
!79 = !{!53}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "rv40_strong_loop_filter", scope: !13, file: !12, line: 73, baseType: !81, size: 128, align: 64, offset: 9216)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 128, align: 64, elements: !79)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "rv40_strong_loop_filter_func", file: !12, line: 49, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !22, !28, !42, !42, !42, !42}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "rv40_loop_filter_strength", scope: !13, file: !12, line: 74, baseType: !87, size: 128, align: 64, offset: 9344)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 128, align: 64, elements: !79)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "rv40_loop_filter_strength_func", file: !12, line: 53, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!42, !22, !28, !42, !42, !42, !92, !92}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!93 = !DILocalVariable(name: "c", arg: 1, scope: !6, file: !7, line: 265, type: !10)
!94 = !DIExpression()
!95 = !DILocation(line: 265, column: 60, scope: !6)
!96 = !DILocalVariable(name: "h264chroma", scope: !6, file: !7, line: 267, type: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264ChromaContext", file: !38, line: 30, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264ChromaContext", file: !38, line: 27, size: 512, align: 64, elements: !99)
!99 = !{!100, !103}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "put_h264_chroma_pixels_tab", scope: !98, file: !38, line: 28, baseType: !101, size: 256, align: 64)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 256, align: 64, elements: !102)
!102 = !{!32}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "avg_h264_chroma_pixels_tab", scope: !98, file: !38, line: 29, baseType: !101, size: 256, align: 64, offset: 256)
!104 = !DILocation(line: 267, column: 23, scope: !6)
!105 = !DILocalVariable(name: "qpel", scope: !6, file: !7, line: 268, type: !106)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264QpelContext", file: !107, line: 30, baseType: !108)
!107 = !DIFile(filename: "libavcodec/h264qpel.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264QpelContext", file: !107, line: 27, size: 8192, align: 64, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "put_h264_qpel_pixels_tab", scope: !108, file: !107, line: 28, baseType: !16, size: 4096, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "avg_h264_qpel_pixels_tab", scope: !108, file: !107, line: 29, baseType: !16, size: 4096, align: 64, offset: 4096)
!112 = !DILocation(line: 268, column: 21, scope: !6)
!113 = !DILocation(line: 270, column: 21, scope: !6)
!114 = !DILocation(line: 270, column: 5, scope: !6)
!115 = !DILocation(line: 271, column: 5, scope: !6)
!116 = !DILocation(line: 272, column: 5, scope: !6)
!117 = !DILocation(line: 274, column: 37, scope: !6)
!118 = !DILocation(line: 274, column: 32, scope: !6)
!119 = !DILocation(line: 274, column: 5, scope: !6)
!120 = !DILocation(line: 274, column: 8, scope: !6)
!121 = !DILocation(line: 274, column: 30, scope: !6)
!122 = !DILocation(line: 275, column: 5, scope: !6)
!123 = !DILocation(line: 275, column: 8, scope: !6)
!124 = !DILocation(line: 275, column: 30, scope: !6)
!125 = !DILocation(line: 276, column: 5, scope: !6)
!126 = !DILocation(line: 276, column: 8, scope: !6)
!127 = !DILocation(line: 276, column: 30, scope: !6)
!128 = !DILocation(line: 277, column: 5, scope: !6)
!129 = !DILocation(line: 277, column: 8, scope: !6)
!130 = !DILocation(line: 277, column: 30, scope: !6)
!131 = !DILocation(line: 278, column: 5, scope: !6)
!132 = !DILocation(line: 278, column: 8, scope: !6)
!133 = !DILocation(line: 278, column: 30, scope: !6)
!134 = !DILocation(line: 279, column: 5, scope: !6)
!135 = !DILocation(line: 279, column: 8, scope: !6)
!136 = !DILocation(line: 279, column: 30, scope: !6)
!137 = !DILocation(line: 280, column: 5, scope: !6)
!138 = !DILocation(line: 280, column: 8, scope: !6)
!139 = !DILocation(line: 280, column: 30, scope: !6)
!140 = !DILocation(line: 281, column: 5, scope: !6)
!141 = !DILocation(line: 281, column: 8, scope: !6)
!142 = !DILocation(line: 281, column: 30, scope: !6)
!143 = !DILocation(line: 282, column: 5, scope: !6)
!144 = !DILocation(line: 282, column: 8, scope: !6)
!145 = !DILocation(line: 282, column: 30, scope: !6)
!146 = !DILocation(line: 283, column: 37, scope: !6)
!147 = !DILocation(line: 283, column: 32, scope: !6)
!148 = !DILocation(line: 283, column: 5, scope: !6)
!149 = !DILocation(line: 283, column: 8, scope: !6)
!150 = !DILocation(line: 283, column: 30, scope: !6)
!151 = !DILocation(line: 284, column: 5, scope: !6)
!152 = !DILocation(line: 284, column: 8, scope: !6)
!153 = !DILocation(line: 284, column: 30, scope: !6)
!154 = !DILocation(line: 285, column: 5, scope: !6)
!155 = !DILocation(line: 285, column: 8, scope: !6)
!156 = !DILocation(line: 285, column: 30, scope: !6)
!157 = !DILocation(line: 286, column: 5, scope: !6)
!158 = !DILocation(line: 286, column: 8, scope: !6)
!159 = !DILocation(line: 286, column: 30, scope: !6)
!160 = !DILocation(line: 287, column: 5, scope: !6)
!161 = !DILocation(line: 287, column: 8, scope: !6)
!162 = !DILocation(line: 287, column: 30, scope: !6)
!163 = !DILocation(line: 288, column: 5, scope: !6)
!164 = !DILocation(line: 288, column: 8, scope: !6)
!165 = !DILocation(line: 288, column: 30, scope: !6)
!166 = !DILocation(line: 289, column: 5, scope: !6)
!167 = !DILocation(line: 289, column: 8, scope: !6)
!168 = !DILocation(line: 289, column: 30, scope: !6)
!169 = !DILocation(line: 290, column: 5, scope: !6)
!170 = !DILocation(line: 290, column: 8, scope: !6)
!171 = !DILocation(line: 290, column: 30, scope: !6)
!172 = !DILocation(line: 291, column: 5, scope: !6)
!173 = !DILocation(line: 291, column: 8, scope: !6)
!174 = !DILocation(line: 291, column: 30, scope: !6)
!175 = !DILocation(line: 292, column: 37, scope: !6)
!176 = !DILocation(line: 292, column: 32, scope: !6)
!177 = !DILocation(line: 292, column: 5, scope: !6)
!178 = !DILocation(line: 292, column: 8, scope: !6)
!179 = !DILocation(line: 292, column: 30, scope: !6)
!180 = !DILocation(line: 293, column: 5, scope: !6)
!181 = !DILocation(line: 293, column: 8, scope: !6)
!182 = !DILocation(line: 293, column: 30, scope: !6)
!183 = !DILocation(line: 294, column: 5, scope: !6)
!184 = !DILocation(line: 294, column: 8, scope: !6)
