; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--aea.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--aea.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type opaque
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProbeData = type { i8*, i8*, i32, i8* }

!860 = !DIEnumerator(name: "AV_SAMPLE_FMT_NB", value: 12)
!861 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !25, line: 3865, size: 32, align: 32, elements: !862)
!862 = !{!863, !864, !865, !866}
!863 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!864 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!865 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!866 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !25, line: 1534, size: 32, align: 32, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874}
!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !25, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !25, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !25, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !926, !925}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !920, line: 221, size: 32, align: 8, elements: !921)
!920 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!921 = !{!922}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !919, file: !920, line: 221, baseType: !923, size: 32, align: 32)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !924, line: 51, baseType: !925)
!924 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!925 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!926 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!927 = !{!928}
!928 = distinct !DIGlobalVariable(name: "ff_aea_demuxer", scope: !0, file: !929, line: 101, type: !930, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_aea_demuxer)
!929 = !DIFile(filename: "libavformat/aea.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !897, line: 777, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !932)
!932 = !{!933, !937, !938, !939, !940, !946, !988, !989, !991, !992, !993, !1007, !2038, !2039, !2040, !2044, !2048, !2049, !2050, !2054, !2055, !2056}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !931, file: !897, line: 638, baseType: !934, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !931, file: !897, line: 645, baseType: !934, size: 64, align: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !931, file: !897, line: 652, baseType: !926, size: 32, align: 32, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !931, file: !897, line: 659, baseType: !934, size: 64, align: 64, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !931, file: !897, line: 661, baseType: !941, size: 64, align: 64, offset: 256)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !897, line: 443, flags: DIFlagFwdDecl)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !931, file: !897, line: 663, baseType: !947, size: 64, align: 64, offset: 320)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !951)
!951 = !{!952, !953, !958, !962, !963, !964, !965, !969, !975, !977, !981}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !950, file: !4, line: 72, baseType: !934, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !950, file: !4, line: 78, baseType: !954, size: 64, align: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!934, !957}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !950, file: !4, line: 85, baseType: !959, size: 64, align: 64, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !950, file: !4, line: 93, baseType: !926, size: 32, align: 32, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !950, file: !4, line: 99, baseType: !926, size: 32, align: 32, offset: 224)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !950, file: !4, line: 108, baseType: !926, size: 32, align: 32, offset: 256)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !950, file: !4, line: 113, baseType: !966, size: 64, align: 64, offset: 320)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!957, !957, !957}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !950, file: !4, line: 123, baseType: !970, size: 64, align: 64, offset: 384)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!973, !973}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !950, file: !4, line: 130, baseType: !976, size: 32, align: 32, offset: 448)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !950, file: !4, line: 136, baseType: !978, size: 64, align: 64, offset: 512)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!976, !957}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !950, file: !4, line: 142, baseType: !982, size: 64, align: 64, offset: 576)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!926, !985, !957, !934, !926}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !931, file: !897, line: 670, baseType: !934, size: 64, align: 64, offset: 384)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !931, file: !897, line: 679, baseType: !990, size: 64, align: 64, offset: 448)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !931, file: !897, line: 684, baseType: !926, size: 32, align: 32, offset: 512)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !931, file: !897, line: 689, baseType: !926, size: 32, align: 32, offset: 544)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !931, file: !897, line: 696, baseType: !994, size: 64, align: 64, offset: 576)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!926, !997}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1000)
!1000 = !{!1001, !1002, !1005, !1006}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !999, file: !897, line: 449, baseType: !934, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !999, file: !897, line: 450, baseType: !1003, size: 64, align: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !999, file: !897, line: 451, baseType: !926, size: 32, align: 32, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !999, file: !897, line: 452, baseType: !934, size: 64, align: 64, offset: 192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !931, file: !897, line: 703, baseType: !1008, size: 64, align: 64, offset: 640)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!926, !1011}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1013)
!1013 = !{!1014, !1015, !1016, !1216, !1217, !1282, !1283, !1284, !1915, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1969, !1970, !1971, !1972, !1973, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2004, !2005, !2008, !2009, !2010, !2011, !2012, !2013, !2015, !2016, !2017, !2018, !2026, !2027, !2031, !2035, !2036, !2037}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1012, file: !897, line: 1342, baseType: !947, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1012, file: !897, line: 1349, baseType: !990, size: 64, align: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1012, file: !897, line: 1356, baseType: !1017, size: 64, align: 64, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1075, !1076, !1080, !1084, !1089, !1096, !1191, !1197, !1203, !1204, !1205, !1206, !1210}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1018, file: !897, line: 498, baseType: !934, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1018, file: !897, line: 504, baseType: !934, size: 64, align: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1018, file: !897, line: 505, baseType: !934, size: 64, align: 64, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1018, file: !897, line: 506, baseType: !934, size: 64, align: 64, offset: 192)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1018, file: !897, line: 508, baseType: !24, size: 32, align: 32, offset: 256)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1018, file: !897, line: 509, baseType: !24, size: 32, align: 32, offset: 288)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1018, file: !897, line: 510, baseType: !24, size: 32, align: 32, offset: 320)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1018, file: !897, line: 517, baseType: !926, size: 32, align: 32, offset: 352)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1018, file: !897, line: 523, baseType: !941, size: 64, align: 64, offset: 384)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1018, file: !897, line: 526, baseType: !947, size: 64, align: 64, offset: 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1018, file: !897, line: 535, baseType: !1017, size: 64, align: 64, offset: 512)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1018, file: !897, line: 539, baseType: !926, size: 32, align: 32, offset: 576)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1018, file: !897, line: 541, baseType: !1008, size: 64, align: 64, offset: 640)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1018, file: !897, line: 549, baseType: !1034, size: 64, align: 64, offset: 704)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!926, !1011, !1037}
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !25, line: 1499, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !25, line: 1445, size: 704, align: 64, elements: !1040)
!1040 = !{!1041, !1055, !1058, !1059, !1060, !1061, !1062, !1063, !1071, !1072, !1073, !1074}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1039, file: !25, line: 1451, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1044, line: 94, baseType: !1045)
!1044 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1044, line: 81, size: 192, align: 64, elements: !1046)
!1046 = !{!1047, !1051, !1054}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1045, file: !1044, line: 82, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1044, line: 73, baseType: !1050)
!1050 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1044, line: 73, flags: DIFlagFwdDecl)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1045, file: !1044, line: 89, baseType: !1052, size: 64, align: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !924, line: 48, baseType: !1004)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1045, file: !1044, line: 93, baseType: !926, size: 32, align: 32, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1039, file: !25, line: 1461, baseType: !1056, size: 64, align: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !924, line: 40, baseType: !1057)
!1057 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1039, file: !25, line: 1467, baseType: !1056, size: 64, align: 64, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1039, file: !25, line: 1468, baseType: !1052, size: 64, align: 64, offset: 192)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1039, file: !25, line: 1469, baseType: !926, size: 32, align: 32, offset: 256)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1039, file: !25, line: 1470, baseType: !926, size: 32, align: 32, offset: 288)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1039, file: !25, line: 1474, baseType: !926, size: 32, align: 32, offset: 320)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1039, file: !25, line: 1479, baseType: !1064, size: 64, align: 64, offset: 384)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !25, line: 1415, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !25, line: 1411, size: 128, align: 64, elements: !1067)
!1067 = !{!1068, !1069, !1070}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1066, file: !25, line: 1412, baseType: !1052, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1066, file: !25, line: 1413, baseType: !926, size: 32, align: 32, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1066, file: !25, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1039, file: !25, line: 1480, baseType: !926, size: 32, align: 32, offset: 448)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1039, file: !25, line: 1486, baseType: !1056, size: 64, align: 64, offset: 512)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1039, file: !25, line: 1488, baseType: !1056, size: 64, align: 64, offset: 576)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1039, file: !25, line: 1497, baseType: !1056, size: 64, align: 64, offset: 640)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1018, file: !897, line: 550, baseType: !1008, size: 64, align: 64, offset: 768)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1018, file: !897, line: 554, baseType: !1077, size: 64, align: 64, offset: 832)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!926, !1011, !1037, !1037, !926}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1018, file: !897, line: 563, baseType: !1081, size: 64, align: 64, offset: 896)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!926, !24, !926}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1018, file: !897, line: 565, baseType: !1085, size: 64, align: 64, offset: 960)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{null, !1011, !926, !1088, !1088}
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1018, file: !897, line: 570, baseType: !1090, size: 64, align: 64, offset: 1024)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!926, !1011, !926, !957, !1093}
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1094, line: 216, baseType: !1095)
!1094 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1095 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1018, file: !897, line: 581, baseType: !1097, size: 64, align: 64, offset: 1088)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!926, !1011, !926, !1100, !925}
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1104)
!1104 = !{!1105, !1109, !1111, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1145, !1147, !1148, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1103, file: !526, line: 282, baseType: !1106, size: 512, align: 64)
!1106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 512, align: 64, elements: !1107)
!1107 = !{!1108}
!1108 = !DISubrange(count: 8)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1103, file: !526, line: 299, baseType: !1110, size: 256, align: 32, offset: 512)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 256, align: 32, elements: !1107)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1103, file: !526, line: 315, baseType: !1112, size: 64, align: 64, offset: 768)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1103, file: !526, line: 326, baseType: !926, size: 32, align: 32, offset: 832)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1103, file: !526, line: 326, baseType: !926, size: 32, align: 32, offset: 864)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1103, file: !526, line: 334, baseType: !926, size: 32, align: 32, offset: 896)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1103, file: !526, line: 341, baseType: !926, size: 32, align: 32, offset: 928)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1103, file: !526, line: 346, baseType: !926, size: 32, align: 32, offset: 960)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1103, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1103, file: !526, line: 356, baseType: !1120, size: 64, align: 32, offset: 1024)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1121, line: 61, baseType: !1122)
!1121 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1121, line: 58, size: 64, align: 32, elements: !1123)
!1123 = !{!1124, !1125}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1122, file: !1121, line: 59, baseType: !926, size: 32, align: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1122, file: !1121, line: 60, baseType: !926, size: 32, align: 32, offset: 32)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1103, file: !526, line: 361, baseType: !1056, size: 64, align: 64, offset: 1088)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1103, file: !526, line: 369, baseType: !1056, size: 64, align: 64, offset: 1152)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1103, file: !526, line: 377, baseType: !1056, size: 64, align: 64, offset: 1216)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1103, file: !526, line: 382, baseType: !926, size: 32, align: 32, offset: 1280)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1103, file: !526, line: 386, baseType: !926, size: 32, align: 32, offset: 1312)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1103, file: !526, line: 391, baseType: !926, size: 32, align: 32, offset: 1344)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1103, file: !526, line: 396, baseType: !957, size: 64, align: 64, offset: 1408)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1103, file: !526, line: 403, baseType: !1134, size: 512, align: 64, offset: 1472)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1135, size: 512, align: 64, elements: !1107)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !924, line: 55, baseType: !1095)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1103, file: !526, line: 410, baseType: !926, size: 32, align: 32, offset: 1984)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1103, file: !526, line: 415, baseType: !926, size: 32, align: 32, offset: 2016)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1103, file: !526, line: 420, baseType: !926, size: 32, align: 32, offset: 2048)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1103, file: !526, line: 425, baseType: !926, size: 32, align: 32, offset: 2080)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1103, file: !526, line: 435, baseType: !1056, size: 64, align: 64, offset: 2112)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1103, file: !526, line: 440, baseType: !926, size: 32, align: 32, offset: 2176)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1103, file: !526, line: 445, baseType: !1135, size: 64, align: 64, offset: 2240)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1103, file: !526, line: 459, baseType: !1144, size: 512, align: 64, offset: 2304)
!1144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1042, size: 512, align: 64, elements: !1107)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1103, file: !526, line: 473, baseType: !1146, size: 64, align: 64, offset: 2816)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1103, file: !526, line: 477, baseType: !926, size: 32, align: 32, offset: 2880)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1103, file: !526, line: 479, baseType: !1149, size: 64, align: 64, offset: 2944)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1152)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1153)
!1153 = !{!1154, !1155, !1156, !1157, !1162}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1152, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1152, file: !526, line: 203, baseType: !1052, size: 64, align: 64, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1152, file: !526, line: 204, baseType: !926, size: 32, align: 32, offset: 128)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1152, file: !526, line: 205, baseType: !1158, size: 64, align: 64, offset: 192)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1160, line: 86, baseType: !1161)
!1160 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1161 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1160, line: 86, flags: DIFlagFwdDecl)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1152, file: !526, line: 206, baseType: !1042, size: 64, align: 64, offset: 256)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1103, file: !526, line: 480, baseType: !926, size: 32, align: 32, offset: 3008)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1103, file: !526, line: 505, baseType: !926, size: 32, align: 32, offset: 3040)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1103, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1103, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1103, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1103, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1103, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1103, file: !526, line: 532, baseType: !1056, size: 64, align: 64, offset: 3264)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1103, file: !526, line: 539, baseType: !1056, size: 64, align: 64, offset: 3328)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1103, file: !526, line: 547, baseType: !1056, size: 64, align: 64, offset: 3392)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1103, file: !526, line: 554, baseType: !1158, size: 64, align: 64, offset: 3456)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1103, file: !526, line: 563, baseType: !926, size: 32, align: 32, offset: 3520)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1103, file: !526, line: 572, baseType: !926, size: 32, align: 32, offset: 3552)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1103, file: !526, line: 581, baseType: !926, size: 32, align: 32, offset: 3584)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1103, file: !526, line: 588, baseType: !1178, size: 64, align: 64, offset: 3648)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !924, line: 36, baseType: !1180)
!1180 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1103, file: !526, line: 593, baseType: !926, size: 32, align: 32, offset: 3712)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1103, file: !526, line: 596, baseType: !926, size: 32, align: 32, offset: 3744)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1103, file: !526, line: 599, baseType: !1042, size: 64, align: 64, offset: 3776)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1103, file: !526, line: 605, baseType: !1042, size: 64, align: 64, offset: 3840)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1103, file: !526, line: 616, baseType: !1042, size: 64, align: 64, offset: 3904)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1103, file: !526, line: 626, baseType: !1093, size: 64, align: 64, offset: 3968)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1103, file: !526, line: 627, baseType: !1093, size: 64, align: 64, offset: 4032)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1103, file: !526, line: 628, baseType: !1093, size: 64, align: 64, offset: 4096)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1103, file: !526, line: 629, baseType: !1093, size: 64, align: 64, offset: 4160)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1103, file: !526, line: 645, baseType: !1042, size: 64, align: 64, offset: 4224)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1018, file: !897, line: 587, baseType: !1192, size: 64, align: 64, offset: 1152)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64, align: 64)
!1193 = !DISubroutineType(types: !1194)
!1194 = !{!926, !1011, !1195}
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1018, file: !897, line: 592, baseType: !1198, size: 64, align: 64, offset: 1216)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!926, !1011, !1201}
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1018, file: !897, line: 597, baseType: !1198, size: 64, align: 64, offset: 1280)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1018, file: !897, line: 598, baseType: !24, size: 32, align: 32, offset: 1344)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1018, file: !897, line: 608, baseType: !1008, size: 64, align: 64, offset: 1408)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1018, file: !897, line: 617, baseType: !1207, size: 64, align: 64, offset: 1472)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{null, !1011}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1018, file: !897, line: 623, baseType: !1211, size: 64, align: 64, offset: 1536)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!926, !1011, !1214}
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1038)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1012, file: !897, line: 1365, baseType: !957, size: 64, align: 64, offset: 192)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1012, file: !897, line: 1379, baseType: !1218, size: 64, align: 64, offset: 256)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1220)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1221)
!1221 = !{!1222, !1223, !1224, !1225, !1226, !1227, !1228, !1232, !1233, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1249, !1250, !1254, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1272, !1273, !1274, !1275, !1279, !1280, !1281}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1220, file: !628, line: 174, baseType: !947, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1220, file: !628, line: 226, baseType: !1003, size: 64, align: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1220, file: !628, line: 227, baseType: !926, size: 32, align: 32, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1220, file: !628, line: 228, baseType: !1003, size: 64, align: 64, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1220, file: !628, line: 229, baseType: !1003, size: 64, align: 64, offset: 256)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1220, file: !628, line: 233, baseType: !957, size: 64, align: 64, offset: 320)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1220, file: !628, line: 235, baseType: !1229, size: 64, align: 64, offset: 384)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!926, !957, !1052, !926}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1220, file: !628, line: 236, baseType: !1229, size: 64, align: 64, offset: 448)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1220, file: !628, line: 237, baseType: !1234, size: 64, align: 64, offset: 512)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!1056, !957, !1056, !926}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1220, file: !628, line: 238, baseType: !1056, size: 64, align: 64, offset: 576)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1220, file: !628, line: 239, baseType: !926, size: 32, align: 32, offset: 640)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1220, file: !628, line: 240, baseType: !926, size: 32, align: 32, offset: 672)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1220, file: !628, line: 241, baseType: !926, size: 32, align: 32, offset: 704)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1220, file: !628, line: 242, baseType: !1095, size: 64, align: 64, offset: 768)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1220, file: !628, line: 243, baseType: !1003, size: 64, align: 64, offset: 832)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1220, file: !628, line: 244, baseType: !1244, size: 64, align: 64, offset: 896)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!1095, !1095, !1247, !925}
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1053)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1220, file: !628, line: 245, baseType: !926, size: 32, align: 32, offset: 960)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1220, file: !628, line: 249, baseType: !1251, size: 64, align: 64, offset: 1024)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!926, !957, !926}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1220, file: !628, line: 255, baseType: !1255, size: 64, align: 64, offset: 1088)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!1056, !957, !926, !1056, !926}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1220, file: !628, line: 260, baseType: !926, size: 32, align: 32, offset: 1152)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1220, file: !628, line: 266, baseType: !1056, size: 64, align: 64, offset: 1216)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1220, file: !628, line: 273, baseType: !926, size: 32, align: 32, offset: 1280)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1220, file: !628, line: 279, baseType: !1056, size: 64, align: 64, offset: 1344)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1220, file: !628, line: 285, baseType: !926, size: 32, align: 32, offset: 1408)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1220, file: !628, line: 291, baseType: !926, size: 32, align: 32, offset: 1440)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1220, file: !628, line: 298, baseType: !926, size: 32, align: 32, offset: 1472)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1220, file: !628, line: 304, baseType: !926, size: 32, align: 32, offset: 1504)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1220, file: !628, line: 309, baseType: !934, size: 64, align: 64, offset: 1536)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1220, file: !628, line: 314, baseType: !934, size: 64, align: 64, offset: 1600)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1220, file: !628, line: 319, baseType: !1269, size: 64, align: 64, offset: 1664)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!926, !957, !1052, !926, !627, !1056}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1220, file: !628, line: 326, baseType: !926, size: 32, align: 32, offset: 1728)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1220, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1220, file: !628, line: 332, baseType: !1056, size: 64, align: 64, offset: 1792)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1220, file: !628, line: 338, baseType: !1276, size: 64, align: 64, offset: 1856)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{!926, !957}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1220, file: !628, line: 340, baseType: !1056, size: 64, align: 64, offset: 1920)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1220, file: !628, line: 346, baseType: !1003, size: 64, align: 64, offset: 1984)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1220, file: !628, line: 351, baseType: !926, size: 32, align: 32, offset: 2048)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1012, file: !897, line: 1386, baseType: !926, size: 32, align: 32, offset: 320)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1012, file: !897, line: 1393, baseType: !925, size: 32, align: 32, offset: 352)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1012, file: !897, line: 1405, baseType: !1285, size: 64, align: 64, offset: 384)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1288)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1289)
!1289 = !{!1290, !1291, !1292, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1762, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1863, !1869, !1870, !1874, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1906, !1907, !1908, !1909, !1910, !1911}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1288, file: !897, line: 866, baseType: !926, size: 32, align: 32)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1288, file: !897, line: 872, baseType: !926, size: 32, align: 32, offset: 32)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1288, file: !897, line: 878, baseType: !1293, size: 64, align: 64, offset: 64)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !25, line: 3360, baseType: !1295)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !25, line: 1556, size: 8448, align: 64, elements: !1296)
!1296 = !{!1297, !1298, !1299, !1300, !1437, !1438, !1439, !1440, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1466, !1470, !1471, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1650, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1295, file: !25, line: 1561, baseType: !947, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1295, file: !25, line: 1562, baseType: !926, size: 32, align: 32, offset: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1295, file: !25, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1295, file: !25, line: 1565, baseType: !1301, size: 64, align: 64, offset: 128)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1303)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !25, line: 3468, size: 1984, align: 64, elements: !1304)
!1304 = !{!1305, !1306, !1307, !1308, !1309, !1310, !1313, !1316, !1319, !1322, !1325, !1326, !1327, !1335, !1336, !1337, !1339, !1343, !1349, !1354, !1358, !1359, !1402, !1409, !1413, !1414, !1418, !1422, !1426, !1430, !1431, !1432}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1303, file: !25, line: 3475, baseType: !934, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1303, file: !25, line: 3480, baseType: !934, size: 64, align: 64, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1303, file: !25, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1303, file: !25, line: 3482, baseType: !24, size: 32, align: 32, offset: 160)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1303, file: !25, line: 3487, baseType: !926, size: 32, align: 32, offset: 192)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1303, file: !25, line: 3488, baseType: !1311, size: 64, align: 64, offset: 256)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1120)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1303, file: !25, line: 3489, baseType: !1314, size: 64, align: 64, offset: 320)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1303, file: !25, line: 3490, baseType: !1317, size: 64, align: 64, offset: 384)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1303, file: !25, line: 3491, baseType: !1320, size: 64, align: 64, offset: 448)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1303, file: !25, line: 3492, baseType: !1323, size: 64, align: 64, offset: 512)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1135)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1303, file: !25, line: 3493, baseType: !1053, size: 8, align: 8, offset: 576)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1303, file: !25, line: 3494, baseType: !947, size: 64, align: 64, offset: 640)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1303, file: !25, line: 3495, baseType: !1328, size: 64, align: 64, offset: 704)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1330)
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !25, line: 3404, baseType: !1331)
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !25, line: 3401, size: 128, align: 64, elements: !1332)
!1332 = !{!1333, !1334}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1331, file: !25, line: 3402, baseType: !926, size: 32, align: 32)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1331, file: !25, line: 3403, baseType: !934, size: 64, align: 64, offset: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1303, file: !25, line: 3507, baseType: !934, size: 64, align: 64, offset: 768)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1303, file: !25, line: 3516, baseType: !926, size: 32, align: 32, offset: 832)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1303, file: !25, line: 3517, baseType: !1338, size: 64, align: 64, offset: 896)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1303, file: !25, line: 3527, baseType: !1340, size: 64, align: 64, offset: 960)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{!926, !1293}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1303, file: !25, line: 3535, baseType: !1344, size: 64, align: 64, offset: 1024)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DISubroutineType(types: !1346)
!1346 = !{!926, !1293, !1347}
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1294)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1303, file: !25, line: 3541, baseType: !1350, size: 64, align: 64, offset: 1088)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1352)
!1352 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !25, line: 3461, baseType: !1353)
!1353 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !25, line: 3461, flags: DIFlagFwdDecl)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1303, file: !25, line: 3549, baseType: !1355, size: 64, align: 64, offset: 1152)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{null, !1338}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1303, file: !25, line: 3551, baseType: !1340, size: 64, align: 64, offset: 1216)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1303, file: !25, line: 3552, baseType: !1360, size: 64, align: 64, offset: 1280)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DISubroutineType(types: !1362)
!1362 = !{!926, !1293, !1052, !926, !1363}
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1365)
!1365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !25, line: 3920, size: 256, align: 64, elements: !1366)
!1366 = !{!1367, !1370, !1371, !1372, !1373, !1401}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1365, file: !25, line: 3921, baseType: !1368, size: 16, align: 16)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !924, line: 49, baseType: !1369)
!1369 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1365, file: !25, line: 3922, baseType: !923, size: 32, align: 32, offset: 32)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1365, file: !25, line: 3923, baseType: !923, size: 32, align: 32, offset: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1365, file: !25, line: 3924, baseType: !925, size: 32, align: 32, offset: 96)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1365, file: !25, line: 3925, baseType: !1374, size: 64, align: 64, offset: 128)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !25, line: 3918, baseType: !1377)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !25, line: 3885, size: 1600, align: 64, elements: !1378)
!1378 = !{!1379, !1380, !1381, !1382, !1383, !1384, !1390, !1394, !1396, !1397, !1399, !1400}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1377, file: !25, line: 3886, baseType: !926, size: 32, align: 32)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1377, file: !25, line: 3887, baseType: !926, size: 32, align: 32, offset: 32)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1377, file: !25, line: 3888, baseType: !926, size: 32, align: 32, offset: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1377, file: !25, line: 3889, baseType: !926, size: 32, align: 32, offset: 96)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1377, file: !25, line: 3890, baseType: !926, size: 32, align: 32, offset: 128)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1377, file: !25, line: 3897, baseType: !1385, size: 768, align: 64, offset: 192)
!1385 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !25, line: 3858, baseType: !1386)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !25, line: 3853, size: 768, align: 64, elements: !1387)
!1387 = !{!1388, !1389}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1386, file: !25, line: 3855, baseType: !1106, size: 512, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1386, file: !25, line: 3857, baseType: !1110, size: 256, align: 32, offset: 512)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1377, file: !25, line: 3903, baseType: !1391, size: 256, align: 64, offset: 960)
!1391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 256, align: 64, elements: !1392)
!1392 = !{!1393}
!1393 = !DISubrange(count: 4)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1377, file: !25, line: 3904, baseType: !1395, size: 128, align: 32, offset: 1216)
!1395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 128, align: 32, elements: !1392)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1377, file: !25, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1377, file: !25, line: 3908, baseType: !1398, size: 64, align: 64, offset: 1408)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1377, file: !25, line: 3915, baseType: !1398, size: 64, align: 64, offset: 1472)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1377, file: !25, line: 3917, baseType: !926, size: 32, align: 32, offset: 1536)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1365, file: !25, line: 3926, baseType: !1056, size: 64, align: 64, offset: 192)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1303, file: !25, line: 3564, baseType: !1403, size: 64, align: 64, offset: 1344)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DISubroutineType(types: !1405)
!1405 = !{!926, !1293, !1037, !1406, !1408}
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1102)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1303, file: !25, line: 3566, baseType: !1410, size: 64, align: 64, offset: 1408)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DISubroutineType(types: !1412)
!1412 = !{!926, !1293, !957, !1408, !1037}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1303, file: !25, line: 3567, baseType: !1340, size: 64, align: 64, offset: 1472)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1303, file: !25, line: 3576, baseType: !1415, size: 64, align: 64, offset: 1536)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DISubroutineType(types: !1417)
!1417 = !{!926, !1293, !1406}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1303, file: !25, line: 3577, baseType: !1419, size: 64, align: 64, offset: 1600)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DISubroutineType(types: !1421)
!1421 = !{!926, !1293, !1037}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1303, file: !25, line: 3584, baseType: !1423, size: 64, align: 64, offset: 1664)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DISubroutineType(types: !1425)
!1425 = !{!926, !1293, !1101}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1303, file: !25, line: 3589, baseType: !1427, size: 64, align: 64, offset: 1728)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{null, !1293}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1303, file: !25, line: 3594, baseType: !926, size: 32, align: 32, offset: 1792)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1303, file: !25, line: 3600, baseType: !934, size: 64, align: 64, offset: 1856)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1303, file: !25, line: 3609, baseType: !1433, size: 64, align: 64, offset: 1920)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1436)
!1436 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !25, line: 3609, flags: DIFlagFwdDecl)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1295, file: !25, line: 1566, baseType: !24, size: 32, align: 32, offset: 192)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1295, file: !25, line: 1581, baseType: !925, size: 32, align: 32, offset: 224)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1295, file: !25, line: 1583, baseType: !957, size: 64, align: 64, offset: 256)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1295, file: !25, line: 1591, baseType: !1441, size: 64, align: 64, offset: 320)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !25, line: 1532, flags: DIFlagFwdDecl)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1295, file: !25, line: 1598, baseType: !957, size: 64, align: 64, offset: 384)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1295, file: !25, line: 1606, baseType: !1056, size: 64, align: 64, offset: 448)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1295, file: !25, line: 1614, baseType: !926, size: 32, align: 32, offset: 512)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1295, file: !25, line: 1622, baseType: !926, size: 32, align: 32, offset: 544)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1295, file: !25, line: 1628, baseType: !926, size: 32, align: 32, offset: 576)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1295, file: !25, line: 1636, baseType: !926, size: 32, align: 32, offset: 608)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1295, file: !25, line: 1643, baseType: !926, size: 32, align: 32, offset: 640)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1295, file: !25, line: 1657, baseType: !1052, size: 64, align: 64, offset: 704)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1295, file: !25, line: 1658, baseType: !926, size: 32, align: 32, offset: 768)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1295, file: !25, line: 1679, baseType: !1120, size: 64, align: 32, offset: 800)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1295, file: !25, line: 1688, baseType: !926, size: 32, align: 32, offset: 864)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1295, file: !25, line: 1712, baseType: !926, size: 32, align: 32, offset: 896)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1295, file: !25, line: 1729, baseType: !926, size: 32, align: 32, offset: 928)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1295, file: !25, line: 1729, baseType: !926, size: 32, align: 32, offset: 960)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1295, file: !25, line: 1744, baseType: !926, size: 32, align: 32, offset: 992)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1295, file: !25, line: 1744, baseType: !926, size: 32, align: 32, offset: 1024)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1295, file: !25, line: 1751, baseType: !926, size: 32, align: 32, offset: 1056)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1295, file: !25, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1295, file: !25, line: 1791, baseType: !1462, size: 64, align: 64, offset: 1152)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{null, !1465, !1406, !1408, !926, !926, !926}
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1295, file: !25, line: 1808, baseType: !1467, size: 64, align: 64, offset: 1216)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DISubroutineType(types: !1469)
!1469 = !{!645, !1465, !1314}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1295, file: !25, line: 1816, baseType: !926, size: 32, align: 32, offset: 1280)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1295, file: !25, line: 1825, baseType: !1472, size: 32, align: 32, offset: 1312)
!1472 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1295, file: !25, line: 1830, baseType: !926, size: 32, align: 32, offset: 1344)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1295, file: !25, line: 1838, baseType: !1472, size: 32, align: 32, offset: 1376)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1295, file: !25, line: 1846, baseType: !926, size: 32, align: 32, offset: 1408)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1295, file: !25, line: 1851, baseType: !926, size: 32, align: 32, offset: 1440)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1295, file: !25, line: 1861, baseType: !1472, size: 32, align: 32, offset: 1472)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1295, file: !25, line: 1868, baseType: !1472, size: 32, align: 32, offset: 1504)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1295, file: !25, line: 1875, baseType: !1472, size: 32, align: 32, offset: 1536)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1295, file: !25, line: 1882, baseType: !1472, size: 32, align: 32, offset: 1568)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1295, file: !25, line: 1889, baseType: !1472, size: 32, align: 32, offset: 1600)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1295, file: !25, line: 1896, baseType: !1472, size: 32, align: 32, offset: 1632)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1295, file: !25, line: 1903, baseType: !1472, size: 32, align: 32, offset: 1664)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1295, file: !25, line: 1910, baseType: !926, size: 32, align: 32, offset: 1696)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1295, file: !25, line: 1915, baseType: !926, size: 32, align: 32, offset: 1728)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1295, file: !25, line: 1926, baseType: !1408, size: 64, align: 64, offset: 1792)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1295, file: !25, line: 1935, baseType: !1120, size: 64, align: 32, offset: 1856)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1295, file: !25, line: 1942, baseType: !926, size: 32, align: 32, offset: 1920)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1295, file: !25, line: 1948, baseType: !926, size: 32, align: 32, offset: 1952)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1295, file: !25, line: 1954, baseType: !926, size: 32, align: 32, offset: 1984)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1295, file: !25, line: 1960, baseType: !926, size: 32, align: 32, offset: 2016)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1295, file: !25, line: 1984, baseType: !926, size: 32, align: 32, offset: 2048)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1295, file: !25, line: 1991, baseType: !926, size: 32, align: 32, offset: 2080)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1295, file: !25, line: 1996, baseType: !926, size: 32, align: 32, offset: 2112)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1295, file: !25, line: 2004, baseType: !926, size: 32, align: 32, offset: 2144)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1295, file: !25, line: 2011, baseType: !926, size: 32, align: 32, offset: 2176)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1295, file: !25, line: 2018, baseType: !926, size: 32, align: 32, offset: 2208)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1295, file: !25, line: 2027, baseType: !926, size: 32, align: 32, offset: 2240)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1295, file: !25, line: 2034, baseType: !926, size: 32, align: 32, offset: 2272)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1295, file: !25, line: 2044, baseType: !926, size: 32, align: 32, offset: 2304)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1295, file: !25, line: 2054, baseType: !1502, size: 64, align: 64, offset: 2368)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1295, file: !25, line: 2061, baseType: !1502, size: 64, align: 64, offset: 2432)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1295, file: !25, line: 2066, baseType: !926, size: 32, align: 32, offset: 2496)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1295, file: !25, line: 2070, baseType: !926, size: 32, align: 32, offset: 2528)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1295, file: !25, line: 2078, baseType: !926, size: 32, align: 32, offset: 2560)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1295, file: !25, line: 2085, baseType: !926, size: 32, align: 32, offset: 2592)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1295, file: !25, line: 2092, baseType: !926, size: 32, align: 32, offset: 2624)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1295, file: !25, line: 2099, baseType: !926, size: 32, align: 32, offset: 2656)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1295, file: !25, line: 2106, baseType: !926, size: 32, align: 32, offset: 2688)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1295, file: !25, line: 2113, baseType: !926, size: 32, align: 32, offset: 2720)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1295, file: !25, line: 2120, baseType: !926, size: 32, align: 32, offset: 2752)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1295, file: !25, line: 2125, baseType: !926, size: 32, align: 32, offset: 2784)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1295, file: !25, line: 2133, baseType: !926, size: 32, align: 32, offset: 2816)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1295, file: !25, line: 2140, baseType: !926, size: 32, align: 32, offset: 2848)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1295, file: !25, line: 2145, baseType: !926, size: 32, align: 32, offset: 2880)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1295, file: !25, line: 2153, baseType: !926, size: 32, align: 32, offset: 2912)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1295, file: !25, line: 2158, baseType: !926, size: 32, align: 32, offset: 2944)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1295, file: !25, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1295, file: !25, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1295, file: !25, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1295, file: !25, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1295, file: !25, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1295, file: !25, line: 2203, baseType: !926, size: 32, align: 32, offset: 3136)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1295, file: !25, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1295, file: !25, line: 2212, baseType: !926, size: 32, align: 32, offset: 3200)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1295, file: !25, line: 2213, baseType: !926, size: 32, align: 32, offset: 3232)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1295, file: !25, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1295, file: !25, line: 2232, baseType: !926, size: 32, align: 32, offset: 3296)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1295, file: !25, line: 2243, baseType: !926, size: 32, align: 32, offset: 3328)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1295, file: !25, line: 2249, baseType: !926, size: 32, align: 32, offset: 3360)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1295, file: !25, line: 2256, baseType: !926, size: 32, align: 32, offset: 3392)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1295, file: !25, line: 2263, baseType: !1135, size: 64, align: 64, offset: 3456)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1295, file: !25, line: 2270, baseType: !1135, size: 64, align: 64, offset: 3520)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1295, file: !25, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1295, file: !25, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1295, file: !25, line: 2367, baseType: !1538, size: 64, align: 64, offset: 3648)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DISubroutineType(types: !1540)
!1540 = !{!926, !1465, !1101, !926}
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1295, file: !25, line: 2383, baseType: !926, size: 32, align: 32, offset: 3712)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1295, file: !25, line: 2386, baseType: !1472, size: 32, align: 32, offset: 3744)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1295, file: !25, line: 2387, baseType: !1472, size: 32, align: 32, offset: 3776)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1295, file: !25, line: 2394, baseType: !926, size: 32, align: 32, offset: 3808)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1295, file: !25, line: 2401, baseType: !926, size: 32, align: 32, offset: 3840)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1295, file: !25, line: 2408, baseType: !926, size: 32, align: 32, offset: 3872)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1295, file: !25, line: 2415, baseType: !926, size: 32, align: 32, offset: 3904)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1295, file: !25, line: 2422, baseType: !926, size: 32, align: 32, offset: 3936)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1295, file: !25, line: 2423, baseType: !1550, size: 64, align: 64, offset: 3968)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !25, line: 831, baseType: !1552)
!1552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !25, line: 826, size: 128, align: 32, elements: !1553)
!1553 = !{!1554, !1555, !1556, !1557}
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1552, file: !25, line: 827, baseType: !926, size: 32, align: 32)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1552, file: !25, line: 828, baseType: !926, size: 32, align: 32, offset: 32)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1552, file: !25, line: 829, baseType: !926, size: 32, align: 32, offset: 64)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1552, file: !25, line: 830, baseType: !1472, size: 32, align: 32, offset: 96)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1295, file: !25, line: 2430, baseType: !1056, size: 64, align: 64, offset: 4032)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1295, file: !25, line: 2437, baseType: !1056, size: 64, align: 64, offset: 4096)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1295, file: !25, line: 2444, baseType: !1472, size: 32, align: 32, offset: 4160)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1295, file: !25, line: 2451, baseType: !1472, size: 32, align: 32, offset: 4192)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1295, file: !25, line: 2458, baseType: !926, size: 32, align: 32, offset: 4224)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1295, file: !25, line: 2469, baseType: !926, size: 32, align: 32, offset: 4256)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1295, file: !25, line: 2475, baseType: !926, size: 32, align: 32, offset: 4288)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1295, file: !25, line: 2481, baseType: !926, size: 32, align: 32, offset: 4320)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1295, file: !25, line: 2485, baseType: !926, size: 32, align: 32, offset: 4352)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1295, file: !25, line: 2489, baseType: !926, size: 32, align: 32, offset: 4384)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1295, file: !25, line: 2493, baseType: !926, size: 32, align: 32, offset: 4416)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1295, file: !25, line: 2501, baseType: !926, size: 32, align: 32, offset: 4448)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1295, file: !25, line: 2506, baseType: !926, size: 32, align: 32, offset: 4480)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1295, file: !25, line: 2510, baseType: !926, size: 32, align: 32, offset: 4512)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1295, file: !25, line: 2514, baseType: !1056, size: 64, align: 64, offset: 4544)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1295, file: !25, line: 2528, baseType: !1574, size: 64, align: 64, offset: 4608)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DISubroutineType(types: !1576)
!1576 = !{null, !1465, !957, !926, !926}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1295, file: !25, line: 2534, baseType: !926, size: 32, align: 32, offset: 4672)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1295, file: !25, line: 2545, baseType: !926, size: 32, align: 32, offset: 4704)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1295, file: !25, line: 2547, baseType: !926, size: 32, align: 32, offset: 4736)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1295, file: !25, line: 2549, baseType: !926, size: 32, align: 32, offset: 4768)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1295, file: !25, line: 2551, baseType: !926, size: 32, align: 32, offset: 4800)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1295, file: !25, line: 2553, baseType: !926, size: 32, align: 32, offset: 4832)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1295, file: !25, line: 2555, baseType: !926, size: 32, align: 32, offset: 4864)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1295, file: !25, line: 2557, baseType: !926, size: 32, align: 32, offset: 4896)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1295, file: !25, line: 2559, baseType: !926, size: 32, align: 32, offset: 4928)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1295, file: !25, line: 2563, baseType: !926, size: 32, align: 32, offset: 4960)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1295, file: !25, line: 2571, baseType: !1398, size: 64, align: 64, offset: 4992)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1295, file: !25, line: 2579, baseType: !1398, size: 64, align: 64, offset: 5056)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1295, file: !25, line: 2586, baseType: !926, size: 32, align: 32, offset: 5120)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1295, file: !25, line: 2615, baseType: !926, size: 32, align: 32, offset: 5152)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1295, file: !25, line: 2627, baseType: !926, size: 32, align: 32, offset: 5184)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1295, file: !25, line: 2637, baseType: !926, size: 32, align: 32, offset: 5216)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1295, file: !25, line: 2681, baseType: !926, size: 32, align: 32, offset: 5248)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1295, file: !25, line: 2709, baseType: !1056, size: 64, align: 64, offset: 5312)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1295, file: !25, line: 2716, baseType: !1596, size: 64, align: 64, offset: 5376)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1598)
!1598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !25, line: 3636, size: 896, align: 64, elements: !1599)
!1599 = !{!1600, !1601, !1602, !1603, !1604, !1605, !1606, !1610, !1614, !1615, !1616, !1617, !1623, !1624, !1625, !1626, !1627}
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1598, file: !25, line: 3642, baseType: !934, size: 64, align: 64)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1598, file: !25, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1598, file: !25, line: 3656, baseType: !24, size: 32, align: 32, offset: 96)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1598, file: !25, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1598, file: !25, line: 3669, baseType: !926, size: 32, align: 32, offset: 160)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1598, file: !25, line: 3682, baseType: !1423, size: 64, align: 64, offset: 192)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1598, file: !25, line: 3698, baseType: !1607, size: 64, align: 64, offset: 256)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DISubroutineType(types: !1609)
!1609 = !{!926, !1293, !1247, !923}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1598, file: !25, line: 3712, baseType: !1611, size: 64, align: 64, offset: 320)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DISubroutineType(types: !1613)
!1613 = !{!926, !1293, !926, !1247, !923}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1598, file: !25, line: 3726, baseType: !1607, size: 64, align: 64, offset: 384)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1598, file: !25, line: 3737, baseType: !1340, size: 64, align: 64, offset: 448)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1598, file: !25, line: 3746, baseType: !926, size: 32, align: 32, offset: 512)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1598, file: !25, line: 3757, baseType: !1618, size: 64, align: 64, offset: 576)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DISubroutineType(types: !1620)
!1620 = !{null, !1621}
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1622, size: 64, align: 64)
!1622 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !25, line: 3617, flags: DIFlagFwdDecl)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1598, file: !25, line: 3766, baseType: !1340, size: 64, align: 64, offset: 640)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1598, file: !25, line: 3774, baseType: !1340, size: 64, align: 64, offset: 704)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1598, file: !25, line: 3780, baseType: !926, size: 32, align: 32, offset: 768)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1598, file: !25, line: 3785, baseType: !926, size: 32, align: 32, offset: 800)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1598, file: !25, line: 3795, baseType: !1628, size: 64, align: 64, offset: 832)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64, align: 64)
!1629 = !DISubroutineType(types: !1630)
!1630 = !{!926, !1293, !1042}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1295, file: !25, line: 2728, baseType: !957, size: 64, align: 64, offset: 5440)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1295, file: !25, line: 2735, baseType: !1134, size: 512, align: 64, offset: 5504)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1295, file: !25, line: 2742, baseType: !926, size: 32, align: 32, offset: 6016)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1295, file: !25, line: 2755, baseType: !926, size: 32, align: 32, offset: 6048)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1295, file: !25, line: 2776, baseType: !926, size: 32, align: 32, offset: 6080)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1295, file: !25, line: 2783, baseType: !926, size: 32, align: 32, offset: 6112)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1295, file: !25, line: 2791, baseType: !926, size: 32, align: 32, offset: 6144)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1295, file: !25, line: 2802, baseType: !1101, size: 64, align: 64, offset: 6208)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1295, file: !25, line: 2811, baseType: !926, size: 32, align: 32, offset: 6272)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1295, file: !25, line: 2821, baseType: !926, size: 32, align: 32, offset: 6304)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1295, file: !25, line: 2830, baseType: !926, size: 32, align: 32, offset: 6336)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1295, file: !25, line: 2840, baseType: !926, size: 32, align: 32, offset: 6368)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1295, file: !25, line: 2851, baseType: !1644, size: 64, align: 64, offset: 6400)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DISubroutineType(types: !1646)
!1646 = !{!926, !1465, !1647, !957, !1408, !926, !926}
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DISubroutineType(types: !1649)
!1649 = !{!926, !1465, !957}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1295, file: !25, line: 2871, baseType: !1651, size: 64, align: 64, offset: 6464)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DISubroutineType(types: !1653)
!1653 = !{!926, !1465, !1654, !957, !1408, !926}
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DISubroutineType(types: !1656)
!1656 = !{!926, !1465, !957, !926, !926}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1295, file: !25, line: 2878, baseType: !926, size: 32, align: 32, offset: 6528)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1295, file: !25, line: 2885, baseType: !926, size: 32, align: 32, offset: 6560)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1295, file: !25, line: 3005, baseType: !926, size: 32, align: 32, offset: 6592)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1295, file: !25, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1295, file: !25, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1295, file: !25, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1295, file: !25, line: 3037, baseType: !1052, size: 64, align: 64, offset: 6720)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1295, file: !25, line: 3038, baseType: !926, size: 32, align: 32, offset: 6784)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1295, file: !25, line: 3050, baseType: !1135, size: 64, align: 64, offset: 6848)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1295, file: !25, line: 3065, baseType: !926, size: 32, align: 32, offset: 6912)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1295, file: !25, line: 3083, baseType: !926, size: 32, align: 32, offset: 6944)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1295, file: !25, line: 3092, baseType: !1120, size: 64, align: 32, offset: 6976)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1295, file: !25, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1295, file: !25, line: 3106, baseType: !1120, size: 64, align: 32, offset: 7072)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1295, file: !25, line: 3113, baseType: !1672, size: 64, align: 64, offset: 7168)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1674)
!1674 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !25, line: 740, baseType: !1675)
!1675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !25, line: 712, size: 384, align: 64, elements: !1676)
!1676 = !{!1677, !1678, !1679, !1680, !1681, !1682, !1685}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1675, file: !25, line: 713, baseType: !24, size: 32, align: 32)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1675, file: !25, line: 714, baseType: !636, size: 32, align: 32, offset: 32)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1675, file: !25, line: 720, baseType: !934, size: 64, align: 64, offset: 64)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1675, file: !25, line: 724, baseType: !934, size: 64, align: 64, offset: 128)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1675, file: !25, line: 728, baseType: !926, size: 32, align: 32, offset: 192)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1675, file: !25, line: 734, baseType: !1683, size: 64, align: 64, offset: 256)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64, align: 64)
!1684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1675, file: !25, line: 739, baseType: !1686, size: 64, align: 64, offset: 320)
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64, align: 64)
!1687 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1331)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1295, file: !25, line: 3129, baseType: !1056, size: 64, align: 64, offset: 7232)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1295, file: !25, line: 3130, baseType: !1056, size: 64, align: 64, offset: 7296)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1295, file: !25, line: 3131, baseType: !1056, size: 64, align: 64, offset: 7360)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1295, file: !25, line: 3132, baseType: !1056, size: 64, align: 64, offset: 7424)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1295, file: !25, line: 3139, baseType: !1398, size: 64, align: 64, offset: 7488)
