; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--ac3_parser.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--ac3_parser.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecParserContext = type { i8*, %struct.AVCodecParser*, i64, i64, i64, i32, i32, i64, i64, i64, i64, i32, i32, [4 x i64], [4 x i64], [4 x i64], i32, i64, [4 x i64], i32, i64, i32, i32, i32, [4 x i64], i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!897 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!898 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !564, line: 493, size: 32, align: 32, elements: !899)
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916}
!900 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!901 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!902 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!903 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!904 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!905 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!906 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!907 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!908 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!909 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!910 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!911 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!912 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!913 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!914 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!915 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!916 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!917 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !564, line: 538, size: 32, align: 32, elements: !918)
!918 = !{!919, !920, !921, !922, !923, !924, !925, !926}
!919 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!920 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!921 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!922 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!923 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!924 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!925 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!926 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !37, line: 810, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932, !933, !934, !935, !936, !937, !938}
!929 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!930 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!931 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!932 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!933 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!934 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!935 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!936 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!937 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!938 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!939 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !37, line: 798, size: 32, align: 32, elements: !940)
!940 = !{!941, !942, !943, !944, !945, !946, !947}
!941 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!942 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!943 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!944 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!945 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!946 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!947 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!948 = !{!949, !950, !951, !959, !961}
!949 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!950 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !954, line: 221, size: 32, align: 8, elements: !955)
!954 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!955 = !{!956}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !953, file: !954, line: 221, baseType: !957, size: 32, align: 32)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !958, line: 51, baseType: !950)
!958 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !958, line: 48, baseType: !960)
!960 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !958, line: 55, baseType: !962)
!962 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!963 = !{!964, !1790, !1792, !1793}
!964 = distinct !DIGlobalVariable(name: "ff_ac3_parser", scope: !0, file: !965, line: 237, type: !966, isLocal: false, isDefinition: true, variable: { [5 x i32], i32, i32 (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecParserContext*, %struct.AVCodecContext*, i8**, i32*, i8*, i32)*, void (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecContext*, i8*, i32)*, %struct.AVCodecParser* }* @ff_ac3_parser)
!965 = !DIFile(filename: "libavcodec/ac3_parser.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParser", file: !37, line: 5272, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParser", file: !37, line: 5259, size: 512, align: 64, elements: !968)
!968 = !{!969, !973, !974, !1025, !1781, !1785, !1789}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !967, file: !37, line: 5260, baseType: !970, size: 160, align: 32)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 160, align: 32, elements: !971)
!971 = !{!972}
!972 = !DISubrange(count: 5)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !967, file: !37, line: 5261, baseType: !949, size: 32, align: 32, offset: 160)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "parser_init", scope: !967, file: !37, line: 5262, baseType: !975, size: 64, align: 64, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!949, !978}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParserContext", file: !37, line: 5257, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParserContext", file: !37, line: 5092, size: 2816, align: 64, elements: !981)
!981 = !{!982, !984, !986, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !980, file: !37, line: 5093, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !980, file: !37, line: 5094, baseType: !985, size: 64, align: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !980, file: !37, line: 5095, baseType: !987, size: 64, align: 64, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !958, line: 40, baseType: !988)
!988 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "cur_offset", scope: !980, file: !37, line: 5096, baseType: !987, size: 64, align: 64, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame_offset", scope: !980, file: !37, line: 5098, baseType: !987, size: 64, align: 64, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !980, file: !37, line: 5100, baseType: !949, size: 32, align: 32, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !980, file: !37, line: 5110, baseType: !949, size: 32, align: 32, offset: 352)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !980, file: !37, line: 5111, baseType: !987, size: 64, align: 64, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !980, file: !37, line: 5112, baseType: !987, size: 64, align: 64, offset: 448)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "last_pts", scope: !980, file: !37, line: 5115, baseType: !987, size: 64, align: 64, offset: 512)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "last_dts", scope: !980, file: !37, line: 5116, baseType: !987, size: 64, align: 64, offset: 576)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "fetch_timestamp", scope: !980, file: !37, line: 5117, baseType: !949, size: 32, align: 32, offset: 640)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_start_index", scope: !980, file: !37, line: 5120, baseType: !949, size: 32, align: 32, offset: 672)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_offset", scope: !980, file: !37, line: 5121, baseType: !1000, size: 256, align: 64, offset: 704)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !987, size: 256, align: 64, elements: !1001)
!1001 = !{!1002}
!1002 = !DISubrange(count: 4)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pts", scope: !980, file: !37, line: 5122, baseType: !1000, size: 256, align: 64, offset: 960)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_dts", scope: !980, file: !37, line: 5123, baseType: !1000, size: 256, align: 64, offset: 1216)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !980, file: !37, line: 5125, baseType: !949, size: 32, align: 32, offset: 1472)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !980, file: !37, line: 5132, baseType: !987, size: 64, align: 64, offset: 1536)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_end", scope: !980, file: !37, line: 5133, baseType: !1000, size: 256, align: 64, offset: 1600)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !980, file: !37, line: 5141, baseType: !949, size: 32, align: 32, offset: 1856)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !980, file: !37, line: 5148, baseType: !987, size: 64, align: 64, offset: 1920)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "dts_sync_point", scope: !980, file: !37, line: 5161, baseType: !949, size: 32, align: 32, offset: 1984)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "dts_ref_dts_delta", scope: !980, file: !37, line: 5176, baseType: !949, size: 32, align: 32, offset: 2016)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "pts_dts_delta", scope: !980, file: !37, line: 5190, baseType: !949, size: 32, align: 32, offset: 2048)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pos", scope: !980, file: !37, line: 5197, baseType: !1000, size: 256, align: 64, offset: 2112)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !980, file: !37, line: 5202, baseType: !987, size: 64, align: 64, offset: 2368)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !980, file: !37, line: 5207, baseType: !987, size: 64, align: 64, offset: 2432)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !980, file: !37, line: 5214, baseType: !949, size: 32, align: 32, offset: 2496)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !980, file: !37, line: 5216, baseType: !36, size: 32, align: 32, offset: 2528)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "picture_structure", scope: !980, file: !37, line: 5226, baseType: !45, size: 32, align: 32, offset: 2560)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "output_picture_number", scope: !980, file: !37, line: 5234, baseType: !949, size: 32, align: 32, offset: 2592)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !980, file: !37, line: 5239, baseType: !949, size: 32, align: 32, offset: 2624)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !980, file: !37, line: 5240, baseType: !949, size: 32, align: 32, offset: 2656)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !980, file: !37, line: 5245, baseType: !949, size: 32, align: 32, offset: 2688)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !980, file: !37, line: 5246, baseType: !949, size: 32, align: 32, offset: 2720)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !980, file: !37, line: 5256, baseType: !949, size: 32, align: 32, offset: 2752)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "parser_parse", scope: !967, file: !37, line: 5265, baseType: !1026, size: 64, align: 64, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!949, !978, !1029, !1780, !1348, !1174, !949}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !37, line: 3360, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !37, line: 1556, size: 8448, align: 64, elements: !1032)
!1032 = !{!1033, !1115, !1116, !1117, !1378, !1379, !1380, !1381, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1534, !1538, !1539, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1718, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1031, file: !37, line: 1561, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !74, line: 143, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !74, line: 67, size: 640, align: 64, elements: !1038)
!1038 = !{!1039, !1043, !1047, !1074, !1075, !1076, !1077, !1081, !1087, !1089, !1093}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1037, file: !74, line: 72, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1042)
!1042 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1037, file: !74, line: 78, baseType: !1044, size: 64, align: 64, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!1040, !983}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1037, file: !74, line: 85, baseType: !1048, size: 64, align: 64, offset: 128)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !52, line: 246, size: 512, align: 64, elements: !1051)
!1051 = !{!1052, !1053, !1054, !1055, !1056, !1070, !1071, !1072, !1073}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1050, file: !52, line: 247, baseType: !1040, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1050, file: !52, line: 253, baseType: !1040, size: 64, align: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1050, file: !52, line: 259, baseType: !949, size: 32, align: 32, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1050, file: !52, line: 260, baseType: !51, size: 32, align: 32, offset: 160)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1050, file: !52, line: 271, baseType: !1057, size: 64, align: 64, offset: 192)
!1057 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1050, file: !52, line: 265, size: 64, align: 64, elements: !1058)
!1058 = !{!1059, !1060, !1062, !1063}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1057, file: !52, line: 266, baseType: !987, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1057, file: !52, line: 267, baseType: !1061, size: 64, align: 64)
!1061 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1057, file: !52, line: 268, baseType: !1040, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1057, file: !52, line: 270, baseType: !1064, size: 64, align: 32)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1065, line: 61, baseType: !1066)
!1065 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1065, line: 58, size: 64, align: 32, elements: !1067)
!1067 = !{!1068, !1069}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1066, file: !1065, line: 59, baseType: !949, size: 32, align: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1066, file: !1065, line: 60, baseType: !949, size: 32, align: 32, offset: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1050, file: !52, line: 272, baseType: !1061, size: 64, align: 64, offset: 256)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1050, file: !52, line: 273, baseType: !1061, size: 64, align: 64, offset: 320)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1050, file: !52, line: 275, baseType: !949, size: 32, align: 32, offset: 384)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1050, file: !52, line: 300, baseType: !1040, size: 64, align: 64, offset: 448)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1037, file: !74, line: 93, baseType: !949, size: 32, align: 32, offset: 192)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1037, file: !74, line: 99, baseType: !949, size: 32, align: 32, offset: 224)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1037, file: !74, line: 108, baseType: !949, size: 32, align: 32, offset: 256)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1037, file: !74, line: 113, baseType: !1078, size: 64, align: 64, offset: 320)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!983, !983, !983}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1037, file: !74, line: 123, baseType: !1082, size: 64, align: 64, offset: 384)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!1085, !1085}
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1037, file: !74, line: 130, baseType: !1088, size: 32, align: 32, offset: 448)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !74, line: 48, baseType: !73)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1037, file: !74, line: 136, baseType: !1090, size: 64, align: 64, offset: 512)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!1088, !983}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1037, file: !74, line: 142, baseType: !1094, size: 64, align: 64, offset: 576)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!949, !1097, !983, !1040, !949}
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !52, line: 329, size: 128, align: 64, elements: !1100)
!1100 = !{!1101, !1113, !1114}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1099, file: !52, line: 360, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !52, line: 324, baseType: !1105)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !52, line: 306, size: 384, align: 64, elements: !1106)
!1106 = !{!1107, !1108, !1109, !1110, !1111, !1112}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1105, file: !52, line: 307, baseType: !1040, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1105, file: !52, line: 313, baseType: !1061, size: 64, align: 64, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1105, file: !52, line: 313, baseType: !1061, size: 64, align: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1105, file: !52, line: 318, baseType: !1061, size: 64, align: 64, offset: 192)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1105, file: !52, line: 318, baseType: !1061, size: 64, align: 64, offset: 256)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1105, file: !52, line: 323, baseType: !949, size: 32, align: 32, offset: 320)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1099, file: !52, line: 364, baseType: !949, size: 32, align: 32, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1099, file: !52, line: 368, baseType: !949, size: 32, align: 32, offset: 96)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1031, file: !37, line: 1562, baseType: !949, size: 32, align: 32, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1031, file: !37, line: 1564, baseType: !94, size: 32, align: 32, offset: 96)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1031, file: !37, line: 1565, baseType: !1118, size: 64, align: 64, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1120)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !37, line: 3468, size: 1984, align: 64, elements: !1121)
!1121 = !{!1122, !1123, !1124, !1125, !1126, !1127, !1130, !1133, !1136, !1139, !1142, !1143, !1144, !1152, !1153, !1154, !1156, !1160, !1166, !1177, !1181, !1182, !1228, !1349, !1353, !1354, !1358, !1362, !1367, !1371, !1372, !1373}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1120, file: !37, line: 3475, baseType: !1040, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1120, file: !37, line: 3480, baseType: !1040, size: 64, align: 64, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1120, file: !37, line: 3481, baseType: !94, size: 32, align: 32, offset: 128)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1120, file: !37, line: 3482, baseType: !104, size: 32, align: 32, offset: 160)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1120, file: !37, line: 3487, baseType: !949, size: 32, align: 32, offset: 192)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1120, file: !37, line: 3488, baseType: !1128, size: 64, align: 64, offset: 256)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1064)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1120, file: !37, line: 3489, baseType: !1131, size: 64, align: 64, offset: 320)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !563)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1120, file: !37, line: 3490, baseType: !1134, size: 64, align: 64, offset: 384)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1120, file: !37, line: 3491, baseType: !1137, size: 64, align: 64, offset: 448)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !763)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1120, file: !37, line: 3492, baseType: !1140, size: 64, align: 64, offset: 512)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1120, file: !37, line: 3493, baseType: !959, size: 8, align: 8, offset: 576)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1120, file: !37, line: 3494, baseType: !1034, size: 64, align: 64, offset: 640)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1120, file: !37, line: 3495, baseType: !1145, size: 64, align: 64, offset: 704)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1147)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !37, line: 3404, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !37, line: 3401, size: 128, align: 64, elements: !1149)
!1149 = !{!1150, !1151}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1148, file: !37, line: 3402, baseType: !949, size: 32, align: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1148, file: !37, line: 3403, baseType: !1040, size: 64, align: 64, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1120, file: !37, line: 3507, baseType: !1040, size: 64, align: 64, offset: 768)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1120, file: !37, line: 3516, baseType: !949, size: 32, align: 32, offset: 832)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1120, file: !37, line: 3517, baseType: !1155, size: 64, align: 64, offset: 896)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1120, file: !37, line: 3527, baseType: !1157, size: 64, align: 64, offset: 960)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!949, !1029}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1120, file: !37, line: 3535, baseType: !1161, size: 64, align: 64, offset: 1024)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!949, !1029, !1164}
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1030)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1120, file: !37, line: 3541, baseType: !1167, size: 64, align: 64, offset: 1088)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1169)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !37, line: 3461, baseType: !1170)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1171, line: 223, size: 128, align: 64, elements: !1172)
!1171 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1172 = !{!1173, !1176}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1170, file: !1171, line: 224, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1170, file: !1171, line: 225, baseType: !1174, size: 64, align: 64, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1120, file: !37, line: 3549, baseType: !1178, size: 64, align: 64, offset: 1152)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{null, !1155}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1120, file: !37, line: 3551, baseType: !1157, size: 64, align: 64, offset: 1216)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1120, file: !37, line: 3552, baseType: !1183, size: 64, align: 64, offset: 1280)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!949, !1029, !1186, !949, !1187}
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1189)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !37, line: 3920, size: 256, align: 64, elements: !1190)
!1190 = !{!1191, !1194, !1195, !1196, !1197, !1227}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1189, file: !37, line: 3921, baseType: !1192, size: 16, align: 16)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !958, line: 49, baseType: !1193)
!1193 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1189, file: !37, line: 3922, baseType: !957, size: 32, align: 32, offset: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1189, file: !37, line: 3923, baseType: !957, size: 32, align: 32, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1189, file: !37, line: 3924, baseType: !950, size: 32, align: 32, offset: 96)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1189, file: !37, line: 3925, baseType: !1198, size: 64, align: 64, offset: 128)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !37, line: 3918, baseType: !1201)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !37, line: 3885, size: 1600, align: 64, elements: !1202)
!1202 = !{!1203, !1204, !1205, !1206, !1207, !1208, !1218, !1220, !1222, !1223, !1225, !1226}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1201, file: !37, line: 3886, baseType: !949, size: 32, align: 32)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1201, file: !37, line: 3887, baseType: !949, size: 32, align: 32, offset: 32)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1201, file: !37, line: 3888, baseType: !949, size: 32, align: 32, offset: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1201, file: !37, line: 3889, baseType: !949, size: 32, align: 32, offset: 96)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1201, file: !37, line: 3890, baseType: !949, size: 32, align: 32, offset: 128)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1201, file: !37, line: 3897, baseType: !1209, size: 768, align: 64, offset: 192)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !37, line: 3858, baseType: !1210)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !37, line: 3853, size: 768, align: 64, elements: !1211)
!1211 = !{!1212, !1216}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1210, file: !37, line: 3855, baseType: !1213, size: 512, align: 64)
!1213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1186, size: 512, align: 64, elements: !1214)
!1214 = !{!1215}
!1215 = !DISubrange(count: 8)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1210, file: !37, line: 3857, baseType: !1217, size: 256, align: 32, offset: 512)
!1217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 256, align: 32, elements: !1214)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1201, file: !37, line: 3903, baseType: !1219, size: 256, align: 64, offset: 960)
!1219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1186, size: 256, align: 64, elements: !1001)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1201, file: !37, line: 3904, baseType: !1221, size: 128, align: 32, offset: 1216)
!1221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 128, align: 32, elements: !1001)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1201, file: !37, line: 3906, baseType: !780, size: 32, align: 32, offset: 1344)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1201, file: !37, line: 3908, baseType: !1224, size: 64, align: 64, offset: 1408)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1201, file: !37, line: 3915, baseType: !1224, size: 64, align: 64, offset: 1472)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1201, file: !37, line: 3917, baseType: !949, size: 32, align: 32, offset: 1536)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1189, file: !37, line: 3926, baseType: !987, size: 64, align: 64, offset: 192)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1120, file: !37, line: 3564, baseType: !1229, size: 64, align: 64, offset: 1344)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!949, !1029, !1232, !1266, !1348}
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !37, line: 1499, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !37, line: 1445, size: 704, align: 64, elements: !1235)
!1235 = !{!1236, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1262, !1263, !1264, !1265}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1234, file: !37, line: 1451, baseType: !1237, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1239, line: 94, baseType: !1240)
!1239 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1239, line: 81, size: 192, align: 64, elements: !1241)
!1241 = !{!1242, !1246, !1247}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1240, file: !1239, line: 82, baseType: !1243, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1239, line: 73, baseType: !1245)
!1245 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1239, line: 73, flags: DIFlagFwdDecl)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1240, file: !1239, line: 89, baseType: !1186, size: 64, align: 64, offset: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1240, file: !1239, line: 93, baseType: !949, size: 32, align: 32, offset: 128)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1234, file: !37, line: 1461, baseType: !987, size: 64, align: 64, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1234, file: !37, line: 1467, baseType: !987, size: 64, align: 64, offset: 128)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1234, file: !37, line: 1468, baseType: !1186, size: 64, align: 64, offset: 192)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1234, file: !37, line: 1469, baseType: !949, size: 32, align: 32, offset: 256)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1234, file: !37, line: 1470, baseType: !949, size: 32, align: 32, offset: 288)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1234, file: !37, line: 1474, baseType: !949, size: 32, align: 32, offset: 320)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1234, file: !37, line: 1479, baseType: !1255, size: 64, align: 64, offset: 384)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !37, line: 1415, baseType: !1257)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !37, line: 1411, size: 128, align: 64, elements: !1258)
!1258 = !{!1259, !1260, !1261}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1257, file: !37, line: 1412, baseType: !1186, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1257, file: !37, line: 1413, baseType: !949, size: 32, align: 32, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1257, file: !37, line: 1414, baseType: !786, size: 32, align: 32, offset: 96)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1234, file: !37, line: 1480, baseType: !949, size: 32, align: 32, offset: 448)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1234, file: !37, line: 1486, baseType: !987, size: 64, align: 64, offset: 512)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1234, file: !37, line: 1488, baseType: !987, size: 64, align: 64, offset: 576)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1234, file: !37, line: 1497, baseType: !987, size: 64, align: 64, offset: 640)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1268)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !827, line: 646, baseType: !1269)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !827, line: 268, size: 4288, align: 64, elements: !1270)
!1270 = !{!1271, !1272, !1273, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1300, !1302, !1303, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1336, !1337, !1338, !1339, !1340, !1341, !1344, !1345, !1346, !1347}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1269, file: !827, line: 282, baseType: !1213, size: 512, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1269, file: !827, line: 299, baseType: !1217, size: 256, align: 32, offset: 512)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1269, file: !827, line: 315, baseType: !1274, size: 64, align: 64, offset: 768)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1269, file: !827, line: 326, baseType: !949, size: 32, align: 32, offset: 832)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1269, file: !827, line: 326, baseType: !949, size: 32, align: 32, offset: 864)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1269, file: !827, line: 334, baseType: !949, size: 32, align: 32, offset: 896)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1269, file: !827, line: 341, baseType: !949, size: 32, align: 32, offset: 928)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1269, file: !827, line: 346, baseType: !949, size: 32, align: 32, offset: 960)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1269, file: !827, line: 351, baseType: !816, size: 32, align: 32, offset: 992)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1269, file: !827, line: 356, baseType: !1064, size: 64, align: 32, offset: 1024)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1269, file: !827, line: 361, baseType: !987, size: 64, align: 64, offset: 1088)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1269, file: !827, line: 369, baseType: !987, size: 64, align: 64, offset: 1152)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1269, file: !827, line: 377, baseType: !987, size: 64, align: 64, offset: 1216)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1269, file: !827, line: 382, baseType: !949, size: 32, align: 32, offset: 1280)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1269, file: !827, line: 386, baseType: !949, size: 32, align: 32, offset: 1312)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1269, file: !827, line: 391, baseType: !949, size: 32, align: 32, offset: 1344)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1269, file: !827, line: 396, baseType: !983, size: 64, align: 64, offset: 1408)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1269, file: !827, line: 403, baseType: !1290, size: 512, align: 64, offset: 1472)
!1290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 512, align: 64, elements: !1214)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1269, file: !827, line: 410, baseType: !949, size: 32, align: 32, offset: 1984)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1269, file: !827, line: 415, baseType: !949, size: 32, align: 32, offset: 2016)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1269, file: !827, line: 420, baseType: !949, size: 32, align: 32, offset: 2048)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1269, file: !827, line: 425, baseType: !949, size: 32, align: 32, offset: 2080)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1269, file: !827, line: 435, baseType: !987, size: 64, align: 64, offset: 2112)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1269, file: !827, line: 440, baseType: !949, size: 32, align: 32, offset: 2176)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1269, file: !827, line: 445, baseType: !961, size: 64, align: 64, offset: 2240)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1269, file: !827, line: 459, baseType: !1299, size: 512, align: 64, offset: 2304)
!1299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1237, size: 512, align: 64, elements: !1214)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1269, file: !827, line: 473, baseType: !1301, size: 64, align: 64, offset: 2816)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1269, file: !827, line: 477, baseType: !949, size: 32, align: 32, offset: 2880)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1269, file: !827, line: 479, baseType: !1304, size: 64, align: 64, offset: 2944)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !827, line: 207, baseType: !1307)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !827, line: 201, size: 320, align: 64, elements: !1308)
!1308 = !{!1309, !1310, !1311, !1312, !1317}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1307, file: !827, line: 202, baseType: !826, size: 32, align: 32)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1307, file: !827, line: 203, baseType: !1186, size: 64, align: 64, offset: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1307, file: !827, line: 204, baseType: !949, size: 32, align: 32, offset: 128)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1307, file: !827, line: 205, baseType: !1313, size: 64, align: 64, offset: 192)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1315, line: 86, baseType: !1316)
!1315 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1316 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1315, line: 86, flags: DIFlagFwdDecl)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1307, file: !827, line: 206, baseType: !1237, size: 64, align: 64, offset: 256)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1269, file: !827, line: 480, baseType: !949, size: 32, align: 32, offset: 3008)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1269, file: !827, line: 505, baseType: !949, size: 32, align: 32, offset: 3040)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1269, file: !827, line: 512, baseType: !850, size: 32, align: 32, offset: 3072)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1269, file: !827, line: 514, baseType: !856, size: 32, align: 32, offset: 3104)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1269, file: !827, line: 516, baseType: !874, size: 32, align: 32, offset: 3136)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1269, file: !827, line: 523, baseType: !898, size: 32, align: 32, offset: 3168)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1269, file: !827, line: 525, baseType: !917, size: 32, align: 32, offset: 3200)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1269, file: !827, line: 532, baseType: !987, size: 64, align: 64, offset: 3264)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1269, file: !827, line: 539, baseType: !987, size: 64, align: 64, offset: 3328)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1269, file: !827, line: 547, baseType: !987, size: 64, align: 64, offset: 3392)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1269, file: !827, line: 554, baseType: !1313, size: 64, align: 64, offset: 3456)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1269, file: !827, line: 563, baseType: !949, size: 32, align: 32, offset: 3520)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1269, file: !827, line: 572, baseType: !949, size: 32, align: 32, offset: 3552)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1269, file: !827, line: 581, baseType: !949, size: 32, align: 32, offset: 3584)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1269, file: !827, line: 588, baseType: !1333, size: 64, align: 64, offset: 3648)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !958, line: 36, baseType: !1335)
!1335 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1269, file: !827, line: 593, baseType: !949, size: 32, align: 32, offset: 3712)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1269, file: !827, line: 596, baseType: !949, size: 32, align: 32, offset: 3744)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1269, file: !827, line: 599, baseType: !1237, size: 64, align: 64, offset: 3776)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1269, file: !827, line: 605, baseType: !1237, size: 64, align: 64, offset: 3840)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1269, file: !827, line: 616, baseType: !1237, size: 64, align: 64, offset: 3904)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1269, file: !827, line: 626, baseType: !1342, size: 64, align: 64, offset: 3968)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1343, line: 216, baseType: !962)
!1343 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1269, file: !827, line: 627, baseType: !1342, size: 64, align: 64, offset: 4032)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1269, file: !827, line: 628, baseType: !1342, size: 64, align: 64, offset: 4096)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1269, file: !827, line: 629, baseType: !1342, size: 64, align: 64, offset: 4160)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1269, file: !827, line: 645, baseType: !1237, size: 64, align: 64, offset: 4224)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1120, file: !37, line: 3566, baseType: !1350, size: 64, align: 64, offset: 1408)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DISubroutineType(types: !1352)
!1352 = !{!949, !1029, !983, !1348, !1232}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1120, file: !37, line: 3567, baseType: !1157, size: 64, align: 64, offset: 1472)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1120, file: !37, line: 3576, baseType: !1355, size: 64, align: 64, offset: 1536)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{!949, !1029, !1266}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1120, file: !37, line: 3577, baseType: !1359, size: 64, align: 64, offset: 1600)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DISubroutineType(types: !1361)
!1361 = !{!949, !1029, !1232}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1120, file: !37, line: 3584, baseType: !1363, size: 64, align: 64, offset: 1664)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DISubroutineType(types: !1365)
!1365 = !{!949, !1029, !1366}
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1120, file: !37, line: 3589, baseType: !1368, size: 64, align: 64, offset: 1728)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DISubroutineType(types: !1370)
!1370 = !{null, !1029}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1120, file: !37, line: 3594, baseType: !949, size: 32, align: 32, offset: 1792)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1120, file: !37, line: 3600, baseType: !1040, size: 64, align: 64, offset: 1856)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1120, file: !37, line: 3609, baseType: !1374, size: 64, align: 64, offset: 1920)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1377)
!1377 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !37, line: 3609, flags: DIFlagFwdDecl)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1031, file: !37, line: 1566, baseType: !104, size: 32, align: 32, offset: 192)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1031, file: !37, line: 1581, baseType: !950, size: 32, align: 32, offset: 224)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1031, file: !37, line: 1583, baseType: !983, size: 64, align: 64, offset: 256)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1031, file: !37, line: 1591, baseType: !1382, size: 64, align: 64, offset: 320)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1171, line: 129, size: 1664, align: 64, elements: !1384)
!1384 = !{!1385, !1386, !1387, !1388, !1389, !1407, !1408, !1414, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1383, file: !1171, line: 136, baseType: !949, size: 32, align: 32)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1383, file: !1171, line: 151, baseType: !949, size: 32, align: 32, offset: 32)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1383, file: !1171, line: 157, baseType: !949, size: 32, align: 32, offset: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1383, file: !1171, line: 159, baseType: !1366, size: 64, align: 64, offset: 128)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1383, file: !1171, line: 161, baseType: !1390, size: 64, align: 64, offset: 192)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1171, line: 117, baseType: !1392)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1171, line: 100, size: 832, align: 64, elements: !1393)
!1393 = !{!1394, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1392, file: !1171, line: 105, baseType: !1395, size: 256, align: 64)
!1395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1396, size: 256, align: 64, elements: !1001)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1239, line: 238, baseType: !1398)
!1398 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1239, line: 238, flags: DIFlagFwdDecl)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1392, file: !1171, line: 110, baseType: !949, size: 32, align: 32, offset: 256)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1392, file: !1171, line: 111, baseType: !949, size: 32, align: 32, offset: 288)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1392, file: !1171, line: 111, baseType: !949, size: 32, align: 32, offset: 320)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1392, file: !1171, line: 112, baseType: !1217, size: 256, align: 32, offset: 352)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1392, file: !1171, line: 113, baseType: !1221, size: 128, align: 32, offset: 608)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1392, file: !1171, line: 114, baseType: !949, size: 32, align: 32, offset: 736)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1392, file: !1171, line: 115, baseType: !949, size: 32, align: 32, offset: 768)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1392, file: !1171, line: 116, baseType: !949, size: 32, align: 32, offset: 800)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1383, file: !1171, line: 163, baseType: !983, size: 64, align: 64, offset: 256)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1383, file: !1171, line: 165, baseType: !1409, size: 128, align: 64, offset: 320)
!1409 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1171, line: 122, baseType: !1410)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1171, line: 119, size: 128, align: 64, elements: !1411)
!1411 = !{!1412, !1413}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1410, file: !1171, line: 120, baseType: !1232, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1410, file: !1171, line: 121, baseType: !1366, size: 64, align: 64, offset: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1383, file: !1171, line: 166, baseType: !1415, size: 128, align: 64, offset: 448)
!1415 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1171, line: 127, baseType: !1416)
!1416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1171, line: 124, size: 128, align: 64, elements: !1417)
!1417 = !{!1418, !1491}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1416, file: !1171, line: 125, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !37, line: 5794, baseType: !1422)
!1422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !37, line: 5747, size: 512, align: 64, elements: !1423)
!1423 = !{!1424, !1425, !1449, !1453, !1454, !1488, !1489, !1490}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1422, file: !37, line: 5751, baseType: !1034, size: 64, align: 64)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1422, file: !37, line: 5756, baseType: !1426, size: 64, align: 64, offset: 64)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1428)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !37, line: 5796, size: 512, align: 64, elements: !1429)
!1429 = !{!1430, !1431, !1434, !1435, !1436, !1440, !1444, !1448}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1428, file: !37, line: 5797, baseType: !1040, size: 64, align: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1428, file: !37, line: 5804, baseType: !1432, size: 64, align: 64, offset: 64)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1428, file: !37, line: 5815, baseType: !1034, size: 64, align: 64, offset: 128)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1428, file: !37, line: 5825, baseType: !949, size: 32, align: 32, offset: 192)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1428, file: !37, line: 5826, baseType: !1437, size: 64, align: 64, offset: 256)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DISubroutineType(types: !1439)
!1439 = !{!949, !1420}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1428, file: !37, line: 5827, baseType: !1441, size: 64, align: 64, offset: 320)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DISubroutineType(types: !1443)
!1443 = !{!949, !1420, !1232}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1428, file: !37, line: 5828, baseType: !1445, size: 64, align: 64, offset: 384)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DISubroutineType(types: !1447)
!1447 = !{null, !1420}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1428, file: !37, line: 5829, baseType: !1445, size: 64, align: 64, offset: 448)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1422, file: !37, line: 5762, baseType: !1450, size: 64, align: 64, offset: 128)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64, align: 64)
!1451 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !37, line: 5735, baseType: !1452)
!1452 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !37, line: 5735, flags: DIFlagFwdDecl)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1422, file: !37, line: 5768, baseType: !983, size: 64, align: 64, offset: 192)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1422, file: !37, line: 5775, baseType: !1455, size: 64, align: 64, offset: 256)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !37, line: 4085, baseType: !1457)
!1457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !37, line: 3936, size: 1152, align: 64, elements: !1458)
!1458 = !{!1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1457, file: !37, line: 3940, baseType: !94, size: 32, align: 32)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1457, file: !37, line: 3944, baseType: !104, size: 32, align: 32, offset: 32)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1457, file: !37, line: 3948, baseType: !957, size: 32, align: 32, offset: 64)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1457, file: !37, line: 3958, baseType: !1186, size: 64, align: 64, offset: 128)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1457, file: !37, line: 3962, baseType: !949, size: 32, align: 32, offset: 192)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1457, file: !37, line: 3968, baseType: !949, size: 32, align: 32, offset: 224)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1457, file: !37, line: 3973, baseType: !987, size: 64, align: 64, offset: 256)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1457, file: !37, line: 3986, baseType: !949, size: 32, align: 32, offset: 320)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1457, file: !37, line: 3999, baseType: !949, size: 32, align: 32, offset: 352)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1457, file: !37, line: 4004, baseType: !949, size: 32, align: 32, offset: 384)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1457, file: !37, line: 4005, baseType: !949, size: 32, align: 32, offset: 416)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1457, file: !37, line: 4010, baseType: !949, size: 32, align: 32, offset: 448)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1457, file: !37, line: 4011, baseType: !949, size: 32, align: 32, offset: 480)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1457, file: !37, line: 4020, baseType: !1064, size: 64, align: 32, offset: 512)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1457, file: !37, line: 4025, baseType: !36, size: 32, align: 32, offset: 576)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1457, file: !37, line: 4030, baseType: !850, size: 32, align: 32, offset: 608)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1457, file: !37, line: 4031, baseType: !856, size: 32, align: 32, offset: 640)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1457, file: !37, line: 4032, baseType: !874, size: 32, align: 32, offset: 672)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1457, file: !37, line: 4033, baseType: !898, size: 32, align: 32, offset: 704)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1457, file: !37, line: 4034, baseType: !917, size: 32, align: 32, offset: 736)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1457, file: !37, line: 4039, baseType: !949, size: 32, align: 32, offset: 768)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1457, file: !37, line: 4046, baseType: !961, size: 64, align: 64, offset: 832)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1457, file: !37, line: 4050, baseType: !949, size: 32, align: 32, offset: 896)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1457, file: !37, line: 4054, baseType: !949, size: 32, align: 32, offset: 928)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1457, file: !37, line: 4061, baseType: !949, size: 32, align: 32, offset: 960)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1457, file: !37, line: 4065, baseType: !949, size: 32, align: 32, offset: 992)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1457, file: !37, line: 4073, baseType: !949, size: 32, align: 32, offset: 1024)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1457, file: !37, line: 4080, baseType: !949, size: 32, align: 32, offset: 1056)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1457, file: !37, line: 4084, baseType: !949, size: 32, align: 32, offset: 1088)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1422, file: !37, line: 5781, baseType: !1455, size: 64, align: 64, offset: 320)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1422, file: !37, line: 5787, baseType: !1064, size: 64, align: 32, offset: 384)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1422, file: !37, line: 5793, baseType: !1064, size: 64, align: 32, offset: 448)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1416, file: !1171, line: 126, baseType: !949, size: 32, align: 32, offset: 64)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1383, file: !1171, line: 172, baseType: !1232, size: 64, align: 64, offset: 576)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1383, file: !1171, line: 177, baseType: !1186, size: 64, align: 64, offset: 640)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1383, file: !1171, line: 178, baseType: !950, size: 32, align: 32, offset: 704)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1383, file: !1171, line: 180, baseType: !983, size: 64, align: 64, offset: 768)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1383, file: !1171, line: 185, baseType: !949, size: 32, align: 32, offset: 832)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1383, file: !1171, line: 190, baseType: !983, size: 64, align: 64, offset: 896)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1383, file: !1171, line: 195, baseType: !949, size: 32, align: 32, offset: 960)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1383, file: !1171, line: 200, baseType: !1232, size: 64, align: 64, offset: 1024)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1383, file: !1171, line: 201, baseType: !949, size: 32, align: 32, offset: 1088)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1383, file: !1171, line: 202, baseType: !1366, size: 64, align: 64, offset: 1152)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1383, file: !1171, line: 203, baseType: !949, size: 32, align: 32, offset: 1216)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1383, file: !1171, line: 205, baseType: !949, size: 32, align: 32, offset: 1248)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1383, file: !1171, line: 206, baseType: !949, size: 32, align: 32, offset: 1280)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1383, file: !1171, line: 209, baseType: !1342, size: 64, align: 64, offset: 1344)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1383, file: !1171, line: 212, baseType: !1342, size: 64, align: 64, offset: 1408)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1383, file: !1171, line: 213, baseType: !1366, size: 64, align: 64, offset: 1472)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1383, file: !1171, line: 215, baseType: !949, size: 32, align: 32, offset: 1536)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1383, file: !1171, line: 217, baseType: !949, size: 32, align: 32, offset: 1568)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1383, file: !1171, line: 220, baseType: !949, size: 32, align: 32, offset: 1600)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1031, file: !37, line: 1598, baseType: !983, size: 64, align: 64, offset: 384)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1031, file: !37, line: 1606, baseType: !987, size: 64, align: 64, offset: 448)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1031, file: !37, line: 1614, baseType: !949, size: 32, align: 32, offset: 512)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1031, file: !37, line: 1622, baseType: !949, size: 32, align: 32, offset: 544)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1031, file: !37, line: 1628, baseType: !949, size: 32, align: 32, offset: 576)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1031, file: !37, line: 1636, baseType: !949, size: 32, align: 32, offset: 608)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1031, file: !37, line: 1643, baseType: !949, size: 32, align: 32, offset: 640)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1031, file: !37, line: 1657, baseType: !1186, size: 64, align: 64, offset: 704)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1031, file: !37, line: 1658, baseType: !949, size: 32, align: 32, offset: 768)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1031, file: !37, line: 1679, baseType: !1064, size: 64, align: 32, offset: 800)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1031, file: !37, line: 1688, baseType: !949, size: 32, align: 32, offset: 864)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1031, file: !37, line: 1712, baseType: !949, size: 32, align: 32, offset: 896)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1031, file: !37, line: 1729, baseType: !949, size: 32, align: 32, offset: 928)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1031, file: !37, line: 1729, baseType: !949, size: 32, align: 32, offset: 960)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1031, file: !37, line: 1744, baseType: !949, size: 32, align: 32, offset: 992)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1031, file: !37, line: 1744, baseType: !949, size: 32, align: 32, offset: 1024)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1031, file: !37, line: 1751, baseType: !949, size: 32, align: 32, offset: 1056)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1031, file: !37, line: 1766, baseType: !563, size: 32, align: 32, offset: 1088)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1031, file: !37, line: 1791, baseType: !1530, size: 64, align: 64, offset: 1152)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DISubroutineType(types: !1532)
!1532 = !{null, !1533, !1266, !1348, !949, !949, !949}
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1031, file: !37, line: 1808, baseType: !1535, size: 64, align: 64, offset: 1216)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{!563, !1533, !1131}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1031, file: !37, line: 1816, baseType: !949, size: 32, align: 32, offset: 1280)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1031, file: !37, line: 1825, baseType: !1540, size: 32, align: 32, offset: 1312)
!1540 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1031, file: !37, line: 1830, baseType: !949, size: 32, align: 32, offset: 1344)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1031, file: !37, line: 1838, baseType: !1540, size: 32, align: 32, offset: 1376)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1031, file: !37, line: 1846, baseType: !949, size: 32, align: 32, offset: 1408)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1031, file: !37, line: 1851, baseType: !949, size: 32, align: 32, offset: 1440)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1031, file: !37, line: 1861, baseType: !1540, size: 32, align: 32, offset: 1472)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1031, file: !37, line: 1868, baseType: !1540, size: 32, align: 32, offset: 1504)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1031, file: !37, line: 1875, baseType: !1540, size: 32, align: 32, offset: 1536)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1031, file: !37, line: 1882, baseType: !1540, size: 32, align: 32, offset: 1568)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1031, file: !37, line: 1889, baseType: !1540, size: 32, align: 32, offset: 1600)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1031, file: !37, line: 1896, baseType: !1540, size: 32, align: 32, offset: 1632)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1031, file: !37, line: 1903, baseType: !1540, size: 32, align: 32, offset: 1664)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1031, file: !37, line: 1910, baseType: !949, size: 32, align: 32, offset: 1696)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1031, file: !37, line: 1915, baseType: !949, size: 32, align: 32, offset: 1728)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1031, file: !37, line: 1926, baseType: !1348, size: 64, align: 64, offset: 1792)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1031, file: !37, line: 1935, baseType: !1064, size: 64, align: 32, offset: 1856)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1031, file: !37, line: 1942, baseType: !949, size: 32, align: 32, offset: 1920)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1031, file: !37, line: 1948, baseType: !949, size: 32, align: 32, offset: 1952)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1031, file: !37, line: 1954, baseType: !949, size: 32, align: 32, offset: 1984)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1031, file: !37, line: 1960, baseType: !949, size: 32, align: 32, offset: 2016)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1031, file: !37, line: 1984, baseType: !949, size: 32, align: 32, offset: 2048)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1031, file: !37, line: 1991, baseType: !949, size: 32, align: 32, offset: 2080)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1031, file: !37, line: 1996, baseType: !949, size: 32, align: 32, offset: 2112)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1031, file: !37, line: 2004, baseType: !949, size: 32, align: 32, offset: 2144)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1031, file: !37, line: 2011, baseType: !949, size: 32, align: 32, offset: 2176)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1031, file: !37, line: 2018, baseType: !949, size: 32, align: 32, offset: 2208)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1031, file: !37, line: 2027, baseType: !949, size: 32, align: 32, offset: 2240)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1031, file: !37, line: 2034, baseType: !949, size: 32, align: 32, offset: 2272)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1031, file: !37, line: 2044, baseType: !949, size: 32, align: 32, offset: 2304)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1031, file: !37, line: 2054, baseType: !1570, size: 64, align: 64, offset: 2368)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1031, file: !37, line: 2061, baseType: !1570, size: 64, align: 64, offset: 2432)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1031, file: !37, line: 2066, baseType: !949, size: 32, align: 32, offset: 2496)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1031, file: !37, line: 2070, baseType: !949, size: 32, align: 32, offset: 2528)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1031, file: !37, line: 2078, baseType: !949, size: 32, align: 32, offset: 2560)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1031, file: !37, line: 2085, baseType: !949, size: 32, align: 32, offset: 2592)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1031, file: !37, line: 2092, baseType: !949, size: 32, align: 32, offset: 2624)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1031, file: !37, line: 2099, baseType: !949, size: 32, align: 32, offset: 2656)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1031, file: !37, line: 2106, baseType: !949, size: 32, align: 32, offset: 2688)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1031, file: !37, line: 2113, baseType: !949, size: 32, align: 32, offset: 2720)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1031, file: !37, line: 2120, baseType: !949, size: 32, align: 32, offset: 2752)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1031, file: !37, line: 2125, baseType: !949, size: 32, align: 32, offset: 2784)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1031, file: !37, line: 2133, baseType: !949, size: 32, align: 32, offset: 2816)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1031, file: !37, line: 2140, baseType: !949, size: 32, align: 32, offset: 2848)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1031, file: !37, line: 2145, baseType: !949, size: 32, align: 32, offset: 2880)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1031, file: !37, line: 2153, baseType: !949, size: 32, align: 32, offset: 2912)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1031, file: !37, line: 2158, baseType: !949, size: 32, align: 32, offset: 2944)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1031, file: !37, line: 2166, baseType: !856, size: 32, align: 32, offset: 2976)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1031, file: !37, line: 2173, baseType: !874, size: 32, align: 32, offset: 3008)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1031, file: !37, line: 2180, baseType: !898, size: 32, align: 32, offset: 3040)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1031, file: !37, line: 2187, baseType: !850, size: 32, align: 32, offset: 3072)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1031, file: !37, line: 2194, baseType: !917, size: 32, align: 32, offset: 3104)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1031, file: !37, line: 2203, baseType: !949, size: 32, align: 32, offset: 3136)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1031, file: !37, line: 2209, baseType: !36, size: 32, align: 32, offset: 3168)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1031, file: !37, line: 2212, baseType: !949, size: 32, align: 32, offset: 3200)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1031, file: !37, line: 2213, baseType: !949, size: 32, align: 32, offset: 3232)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1031, file: !37, line: 2220, baseType: !763, size: 32, align: 32, offset: 3264)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1031, file: !37, line: 2232, baseType: !949, size: 32, align: 32, offset: 3296)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1031, file: !37, line: 2243, baseType: !949, size: 32, align: 32, offset: 3328)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1031, file: !37, line: 2249, baseType: !949, size: 32, align: 32, offset: 3360)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1031, file: !37, line: 2256, baseType: !949, size: 32, align: 32, offset: 3392)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1031, file: !37, line: 2263, baseType: !961, size: 64, align: 64, offset: 3456)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1031, file: !37, line: 2270, baseType: !961, size: 64, align: 64, offset: 3520)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1031, file: !37, line: 2277, baseType: !927, size: 32, align: 32, offset: 3584)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1031, file: !37, line: 2285, baseType: !763, size: 32, align: 32, offset: 3616)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1031, file: !37, line: 2367, baseType: !1606, size: 64, align: 64, offset: 3648)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DISubroutineType(types: !1608)
!1608 = !{!949, !1533, !1366, !949}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1031, file: !37, line: 2383, baseType: !949, size: 32, align: 32, offset: 3712)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1031, file: !37, line: 2386, baseType: !1540, size: 32, align: 32, offset: 3744)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1031, file: !37, line: 2387, baseType: !1540, size: 32, align: 32, offset: 3776)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1031, file: !37, line: 2394, baseType: !949, size: 32, align: 32, offset: 3808)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1031, file: !37, line: 2401, baseType: !949, size: 32, align: 32, offset: 3840)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1031, file: !37, line: 2408, baseType: !949, size: 32, align: 32, offset: 3872)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1031, file: !37, line: 2415, baseType: !949, size: 32, align: 32, offset: 3904)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1031, file: !37, line: 2422, baseType: !949, size: 32, align: 32, offset: 3936)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1031, file: !37, line: 2423, baseType: !1618, size: 64, align: 64, offset: 3968)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !37, line: 831, baseType: !1620)
!1620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !37, line: 826, size: 128, align: 32, elements: !1621)
!1621 = !{!1622, !1623, !1624, !1625}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1620, file: !37, line: 827, baseType: !949, size: 32, align: 32)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1620, file: !37, line: 828, baseType: !949, size: 32, align: 32, offset: 32)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1620, file: !37, line: 829, baseType: !949, size: 32, align: 32, offset: 64)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1620, file: !37, line: 830, baseType: !1540, size: 32, align: 32, offset: 96)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1031, file: !37, line: 2430, baseType: !987, size: 64, align: 64, offset: 4032)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1031, file: !37, line: 2437, baseType: !987, size: 64, align: 64, offset: 4096)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1031, file: !37, line: 2444, baseType: !1540, size: 32, align: 32, offset: 4160)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1031, file: !37, line: 2451, baseType: !1540, size: 32, align: 32, offset: 4192)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1031, file: !37, line: 2458, baseType: !949, size: 32, align: 32, offset: 4224)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1031, file: !37, line: 2469, baseType: !949, size: 32, align: 32, offset: 4256)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1031, file: !37, line: 2475, baseType: !949, size: 32, align: 32, offset: 4288)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1031, file: !37, line: 2481, baseType: !949, size: 32, align: 32, offset: 4320)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1031, file: !37, line: 2485, baseType: !949, size: 32, align: 32, offset: 4352)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1031, file: !37, line: 2489, baseType: !949, size: 32, align: 32, offset: 4384)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1031, file: !37, line: 2493, baseType: !949, size: 32, align: 32, offset: 4416)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1031, file: !37, line: 2501, baseType: !949, size: 32, align: 32, offset: 4448)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1031, file: !37, line: 2506, baseType: !949, size: 32, align: 32, offset: 4480)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1031, file: !37, line: 2510, baseType: !949, size: 32, align: 32, offset: 4512)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1031, file: !37, line: 2514, baseType: !987, size: 64, align: 64, offset: 4544)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1031, file: !37, line: 2528, baseType: !1642, size: 64, align: 64, offset: 4608)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{null, !1533, !983, !949, !949}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1031, file: !37, line: 2534, baseType: !949, size: 32, align: 32, offset: 4672)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1031, file: !37, line: 2545, baseType: !949, size: 32, align: 32, offset: 4704)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1031, file: !37, line: 2547, baseType: !949, size: 32, align: 32, offset: 4736)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1031, file: !37, line: 2549, baseType: !949, size: 32, align: 32, offset: 4768)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1031, file: !37, line: 2551, baseType: !949, size: 32, align: 32, offset: 4800)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1031, file: !37, line: 2553, baseType: !949, size: 32, align: 32, offset: 4832)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1031, file: !37, line: 2555, baseType: !949, size: 32, align: 32, offset: 4864)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1031, file: !37, line: 2557, baseType: !949, size: 32, align: 32, offset: 4896)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1031, file: !37, line: 2559, baseType: !949, size: 32, align: 32, offset: 4928)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1031, file: !37, line: 2563, baseType: !949, size: 32, align: 32, offset: 4960)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1031, file: !37, line: 2571, baseType: !1224, size: 64, align: 64, offset: 4992)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1031, file: !37, line: 2579, baseType: !1224, size: 64, align: 64, offset: 5056)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1031, file: !37, line: 2586, baseType: !949, size: 32, align: 32, offset: 5120)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1031, file: !37, line: 2615, baseType: !949, size: 32, align: 32, offset: 5152)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1031, file: !37, line: 2627, baseType: !949, size: 32, align: 32, offset: 5184)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1031, file: !37, line: 2637, baseType: !949, size: 32, align: 32, offset: 5216)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1031, file: !37, line: 2681, baseType: !949, size: 32, align: 32, offset: 5248)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1031, file: !37, line: 2709, baseType: !987, size: 64, align: 64, offset: 5312)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1031, file: !37, line: 2716, baseType: !1664, size: 64, align: 64, offset: 5376)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64, align: 64)
!1665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1666)
!1666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !37, line: 3636, size: 896, align: 64, elements: !1667)
!1667 = !{!1668, !1669, !1670, !1671, !1672, !1673, !1674, !1678, !1682, !1683, !1684, !1685, !1691, !1692, !1693, !1694, !1695}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1666, file: !37, line: 3642, baseType: !1040, size: 64, align: 64)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1666, file: !37, line: 3649, baseType: !94, size: 32, align: 32, offset: 64)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1666, file: !37, line: 3656, baseType: !104, size: 32, align: 32, offset: 96)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1666, file: !37, line: 3663, baseType: !563, size: 32, align: 32, offset: 128)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1666, file: !37, line: 3669, baseType: !949, size: 32, align: 32, offset: 160)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1666, file: !37, line: 3682, baseType: !1363, size: 64, align: 64, offset: 192)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1666, file: !37, line: 3698, baseType: !1675, size: 64, align: 64, offset: 256)
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64, align: 64)
!1676 = !DISubroutineType(types: !1677)
!1677 = !{!949, !1029, !1174, !957}
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1666, file: !37, line: 3712, baseType: !1679, size: 64, align: 64, offset: 320)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DISubroutineType(types: !1681)
!1681 = !{!949, !1029, !949, !1174, !957}
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1666, file: !37, line: 3726, baseType: !1675, size: 64, align: 64, offset: 384)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1666, file: !37, line: 3737, baseType: !1157, size: 64, align: 64, offset: 448)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1666, file: !37, line: 3746, baseType: !949, size: 32, align: 32, offset: 512)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1666, file: !37, line: 3757, baseType: !1686, size: 64, align: 64, offset: 576)
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64, align: 64)
!1687 = !DISubroutineType(types: !1688)
!1688 = !{null, !1689}
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64, align: 64)
!1690 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !37, line: 3617, flags: DIFlagFwdDecl)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1666, file: !37, line: 3766, baseType: !1157, size: 64, align: 64, offset: 640)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1666, file: !37, line: 3774, baseType: !1157, size: 64, align: 64, offset: 704)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1666, file: !37, line: 3780, baseType: !949, size: 32, align: 32, offset: 768)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1666, file: !37, line: 3785, baseType: !949, size: 32, align: 32, offset: 800)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1666, file: !37, line: 3795, baseType: !1696, size: 64, align: 64, offset: 832)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{!949, !1029, !1237}
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1031, file: !37, line: 2728, baseType: !983, size: 64, align: 64, offset: 5440)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1031, file: !37, line: 2735, baseType: !1290, size: 512, align: 64, offset: 5504)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1031, file: !37, line: 2742, baseType: !949, size: 32, align: 32, offset: 6016)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1031, file: !37, line: 2755, baseType: !949, size: 32, align: 32, offset: 6048)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1031, file: !37, line: 2776, baseType: !949, size: 32, align: 32, offset: 6080)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1031, file: !37, line: 2783, baseType: !949, size: 32, align: 32, offset: 6112)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1031, file: !37, line: 2791, baseType: !949, size: 32, align: 32, offset: 6144)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1031, file: !37, line: 2802, baseType: !1366, size: 64, align: 64, offset: 6208)
