; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--riffdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--riffdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecTag = type { i32, i32 }
%struct.AVCodecGuid = type { i32, [16 x i8] }
%struct.AVIOContext = type { %struct.AVClass*, i8*, i32, i8*, i8*, i8*, i32 (i8*, i8*, i32)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i64, i32, i32, i32, i64, i8*, i64 (i64, i8*, i32)*, i32, i32 (i8*, i32)*, i64 (i8*, i32, i64, i32)*, i32, i64, i32, i64, i32, i32, i32, i32, i8*, i8*, i32 (i8*, i8*, i32, i32, i64)*, i32, i32, i64, i32 (i8*)*, i64, i8*, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !34, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !34, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !918, !919, !928, !934, !935}
!917 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!918 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !922, line: 222, size: 16, align: 8, elements: !923)
!922 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!923 = !{!924}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !921, file: !922, line: 222, baseType: !925, size: 16, align: 16)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !926, line: 49, baseType: !927)
!926 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!927 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !922, line: 221, size: 32, align: 8, elements: !931)
!931 = !{!932}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !930, file: !922, line: 221, baseType: !933, size: 32, align: 32)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !926, line: 51, baseType: !918)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !926, line: 38, baseType: !917)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!936 = !{i32 2, !"Dwarf Version", i32 4}
!937 = !{i32 2, !"Debug Info Version", i32 3}
!938 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!939 = distinct !DISubprogram(name: "ff_get_guid", scope: !940, file: !940, line: 32, type: !941, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1064)
!940 = !DIFile(filename: "libavformat/riffdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!941 = !DISubroutineType(types: !942)
!942 = !{!917, !943, !1058}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !25, line: 352, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !25, line: 161, size: 2112, align: 64, elements: !946)
!946 = !{!947, !992, !995, !996, !997, !998, !999, !1005, !1006, !1012, !1013, !1014, !1015, !1016, !1018, !1019, !1025, !1026, !1030, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1048, !1049, !1050, !1051, !1055, !1056, !1057}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !945, file: !25, line: 174, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !952)
!952 = !{!953, !957, !962, !966, !967, !968, !969, !973, !979, !981, !985}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !951, file: !4, line: 72, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!956 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !951, file: !4, line: 78, baseType: !958, size: 64, align: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!954, !961}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !951, file: !4, line: 85, baseType: !963, size: 64, align: 64, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !951, file: !4, line: 93, baseType: !917, size: 32, align: 32, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !951, file: !4, line: 99, baseType: !917, size: 32, align: 32, offset: 224)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !951, file: !4, line: 108, baseType: !917, size: 32, align: 32, offset: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !951, file: !4, line: 113, baseType: !970, size: 64, align: 64, offset: 320)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!961, !961, !961}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !951, file: !4, line: 123, baseType: !974, size: 64, align: 64, offset: 384)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!977, !977}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !951, file: !4, line: 130, baseType: !980, size: 32, align: 32, offset: 448)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !951, file: !4, line: 136, baseType: !982, size: 64, align: 64, offset: 512)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!980, !961}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !951, file: !4, line: 142, baseType: !986, size: 64, align: 64, offset: 576)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!917, !989, !961, !954, !917}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !945, file: !25, line: 226, baseType: !993, size: 64, align: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !945, file: !25, line: 227, baseType: !917, size: 32, align: 32, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !945, file: !25, line: 228, baseType: !993, size: 64, align: 64, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !945, file: !25, line: 229, baseType: !993, size: 64, align: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !945, file: !25, line: 233, baseType: !961, size: 64, align: 64, offset: 320)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !945, file: !25, line: 235, baseType: !1000, size: 64, align: 64, offset: 384)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!917, !961, !1003, !917}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !926, line: 48, baseType: !994)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !945, file: !25, line: 236, baseType: !1000, size: 64, align: 64, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !945, file: !25, line: 237, baseType: !1007, size: 64, align: 64, offset: 512)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!1010, !961, !1010, !917}
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !926, line: 40, baseType: !1011)
!1011 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !945, file: !25, line: 238, baseType: !1010, size: 64, align: 64, offset: 576)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !945, file: !25, line: 239, baseType: !917, size: 32, align: 32, offset: 640)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !945, file: !25, line: 240, baseType: !917, size: 32, align: 32, offset: 672)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !945, file: !25, line: 241, baseType: !917, size: 32, align: 32, offset: 704)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !945, file: !25, line: 242, baseType: !1017, size: 64, align: 64, offset: 768)
!1017 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !945, file: !25, line: 243, baseType: !993, size: 64, align: 64, offset: 832)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !945, file: !25, line: 244, baseType: !1020, size: 64, align: 64, offset: 896)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!1017, !1017, !1023, !918}
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !945, file: !25, line: 245, baseType: !917, size: 32, align: 32, offset: 960)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !945, file: !25, line: 249, baseType: !1027, size: 64, align: 64, offset: 1024)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!917, !961, !917}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !945, file: !25, line: 255, baseType: !1031, size: 64, align: 64, offset: 1088)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!1010, !961, !917, !1010, !917}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !945, file: !25, line: 260, baseType: !917, size: 32, align: 32, offset: 1152)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !945, file: !25, line: 266, baseType: !1010, size: 64, align: 64, offset: 1216)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !945, file: !25, line: 273, baseType: !917, size: 32, align: 32, offset: 1280)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !945, file: !25, line: 279, baseType: !1010, size: 64, align: 64, offset: 1344)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !945, file: !25, line: 285, baseType: !917, size: 32, align: 32, offset: 1408)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !945, file: !25, line: 291, baseType: !917, size: 32, align: 32, offset: 1440)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !945, file: !25, line: 298, baseType: !917, size: 32, align: 32, offset: 1472)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !945, file: !25, line: 304, baseType: !917, size: 32, align: 32, offset: 1504)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !945, file: !25, line: 309, baseType: !954, size: 64, align: 64, offset: 1536)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !945, file: !25, line: 314, baseType: !954, size: 64, align: 64, offset: 1600)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !945, file: !25, line: 319, baseType: !1045, size: 64, align: 64, offset: 1664)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!917, !961, !1003, !917, !24, !1010}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !945, file: !25, line: 326, baseType: !917, size: 32, align: 32, offset: 1728)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !945, file: !25, line: 331, baseType: !24, size: 32, align: 32, offset: 1760)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !945, file: !25, line: 332, baseType: !1010, size: 64, align: 64, offset: 1792)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !945, file: !25, line: 338, baseType: !1052, size: 64, align: 64, offset: 1856)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!917, !961}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !945, file: !25, line: 340, baseType: !1010, size: 64, align: 64, offset: 1920)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !945, file: !25, line: 346, baseType: !993, size: 64, align: 64, offset: 1984)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !945, file: !25, line: 351, baseType: !917, size: 32, align: 32, offset: 2048)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "ff_asf_guid", file: !1060, line: 90, baseType: !1061)
!1060 = !DIFile(filename: "libavformat/riff.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1004, size: 128, align: 8, elements: !1062)
!1062 = !{!1063}
!1063 = !DISubrange(count: 16)
!1064 = !{}
!1065 = !DILocalVariable(name: "s", arg: 1, scope: !939, file: !940, line: 32, type: !943)
!1066 = !DIExpression()
!1067 = !DILocation(line: 32, column: 30, scope: !939)
!1068 = !DILocalVariable(name: "g", arg: 2, scope: !939, file: !940, line: 32, type: !1058)
!1069 = !DILocation(line: 32, column: 46, scope: !939)
!1070 = !DILocalVariable(name: "ret", scope: !939, file: !940, line: 34, type: !917)
!1071 = !DILocation(line: 34, column: 9, scope: !939)
!1072 = !DILocation(line: 35, column: 5, scope: !939)
!1073 = distinct !{!1073, !1072}
!1074 = !DILocation(line: 35, column: 104, scope: !1075)
!1075 = !DILexicalBlockFile(scope: !1076, file: !940, discriminator: 1)
!1076 = distinct !DILexicalBlock(scope: !939, file: !940, line: 35, column: 8)
!1077 = !DILocation(line: 36, column: 21, scope: !939)
!1078 = !DILocation(line: 36, column: 25, scope: !939)
!1079 = !DILocation(line: 36, column: 24, scope: !939)
!1080 = !DILocation(line: 36, column: 11, scope: !939)
!1081 = !DILocation(line: 36, column: 9, scope: !939)
!1082 = !DILocation(line: 37, column: 9, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !939, file: !940, line: 37, column: 9)
!1084 = !DILocation(line: 37, column: 13, scope: !1083)
!1085 = !DILocation(line: 37, column: 9, scope: !939)
!1086 = !DILocation(line: 38, column: 17, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1083, file: !940, line: 37, column: 32)
!1088 = !DILocation(line: 38, column: 9, scope: !1087)
!1089 = !DILocation(line: 39, column: 16, scope: !1087)
!1090 = !DILocation(line: 39, column: 20, scope: !1087)
!1091 = !DILocation(line: 39, column: 26, scope: !1092)
!1092 = !DILexicalBlockFile(scope: !1087, file: !940, discriminator: 1)
!1093 = !DILocation(line: 39, column: 16, scope: !1092)
!1094 = !DILocation(line: 39, column: 16, scope: !1095)
!1095 = !DILexicalBlockFile(scope: !1087, file: !940, discriminator: 2)
!1096 = !DILocation(line: 39, column: 16, scope: !1097)
!1097 = !DILexicalBlockFile(scope: !1087, file: !940, discriminator: 3)
!1098 = !DILocation(line: 39, column: 9, scope: !1097)
!1099 = !DILocation(line: 41, column: 5, scope: !939)
!1100 = !DILocation(line: 42, column: 1, scope: !939)
!1101 = distinct !DISubprogram(name: "ff_codec_guid_get_id", scope: !940, file: !940, line: 44, type: !1102, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1064)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!33, !1104, !1003}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1106)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecGuid", file: !1060, line: 95, baseType: !1107)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecGuid", file: !1060, line: 92, size: 160, align: 32, elements: !1108)
!1108 = !{!1109, !1110}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1107, file: !1060, line: 93, baseType: !33, size: 32, align: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !1107, file: !1060, line: 94, baseType: !1059, size: 128, align: 8, offset: 32)
!1111 = !DILocalVariable(name: "g1", arg: 1, scope: !1112, file: !1060, line: 116, type: !1115)
!1112 = distinct !DISubprogram(name: "ff_guidcmp", scope: !1060, file: !1060, line: 116, type: !1113, isLocal: true, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1064)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!917, !1115, !1115}
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1117 = !DILocation(line: 116, column: 73, scope: !1112, inlinedAt: !1118)
!1118 = distinct !DILocation(line: 48, column: 14, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1120, file: !940, line: 48, column: 13)
!1120 = distinct !DILexicalBlock(scope: !1121, file: !940, line: 47, column: 5)
!1121 = distinct !DILexicalBlock(scope: !1101, file: !940, line: 47, column: 5)
!1122 = !DILocalVariable(name: "g2", arg: 2, scope: !1112, file: !1060, line: 116, type: !1115)
!1123 = !DILocation(line: 116, column: 89, scope: !1112, inlinedAt: !1118)
!1124 = !DILocalVariable(name: "guids", arg: 1, scope: !1101, file: !940, line: 44, type: !1104)
!1125 = !DILocation(line: 44, column: 56, scope: !1101)
!1126 = !DILocalVariable(name: "guid", arg: 2, scope: !1101, file: !940, line: 44, type: !1003)
!1127 = !DILocation(line: 44, column: 75, scope: !1101)
!1128 = !DILocalVariable(name: "i", scope: !1101, file: !940, line: 46, type: !917)
!1129 = !DILocation(line: 46, column: 9, scope: !1101)
!1130 = !DILocation(line: 47, column: 12, scope: !1121)
!1131 = !DILocation(line: 47, column: 10, scope: !1121)
!1132 = !DILocation(line: 47, column: 23, scope: !1133)
!1133 = !DILexicalBlockFile(scope: !1120, file: !940, discriminator: 1)
!1134 = !DILocation(line: 47, column: 17, scope: !1133)
!1135 = !DILocation(line: 47, column: 26, scope: !1133)
!1136 = !DILocation(line: 47, column: 29, scope: !1133)
!1137 = !DILocation(line: 47, column: 5, scope: !1133)
!1138 = !DILocation(line: 48, column: 31, scope: !1119)
!1139 = !DILocation(line: 48, column: 25, scope: !1119)
!1140 = !DILocation(line: 48, column: 34, scope: !1119)
!1141 = !DILocation(line: 48, column: 40, scope: !1119)
!1142 = !DILocation(line: 48, column: 14, scope: !1119)
!1143 = !DILocation(line: 118, column: 19, scope: !1112, inlinedAt: !1118)
!1144 = !DILocation(line: 118, column: 23, scope: !1112, inlinedAt: !1118)
!1145 = !DILocation(line: 118, column: 12, scope: !1112, inlinedAt: !1118)
!1146 = !DILocation(line: 48, column: 13, scope: !1120)
!1147 = !DILocation(line: 49, column: 26, scope: !1119)
!1148 = !DILocation(line: 49, column: 20, scope: !1119)
!1149 = !DILocation(line: 49, column: 29, scope: !1119)
!1150 = !DILocation(line: 49, column: 13, scope: !1119)
!1151 = !DILocation(line: 48, column: 44, scope: !1152)
!1152 = !DILexicalBlockFile(scope: !1119, file: !940, discriminator: 1)
!1153 = !DILocation(line: 47, column: 51, scope: !1154)
!1154 = !DILexicalBlockFile(scope: !1120, file: !940, discriminator: 2)
!1155 = !DILocation(line: 47, column: 5, scope: !1154)
!1156 = distinct !{!1156, !1157}
!1157 = !DILocation(line: 47, column: 5, scope: !1101)
!1158 = !DILocation(line: 50, column: 5, scope: !1101)
!1159 = !DILocation(line: 51, column: 1, scope: !1101)
!1160 = distinct !DISubprogram(name: "ff_get_wav_header", scope: !940, file: !940, line: 91, type: !1161, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1064)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{!917, !1163, !943, !1869, !917, !917}
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !897, line: 1947, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1166)
!1166 = !{!1167, !1168, !1275, !1422, !1423, !1424, !1425, !1426, !2117, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2171, !2172, !2173, !2174, !2175, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2226, !2227, !2230, !2231, !2232, !2233, !2234, !2235, !2237, !2238, !2239, !2240, !2248, !2249, !2253, !2257, !2258, !2259}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1165, file: !897, line: 1342, baseType: !948, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1165, file: !897, line: 1349, baseType: !1169, size: 64, align: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1171)
!1171 = !{!1172, !1173, !1174, !1175, !1176, !1186, !1187, !1188, !1189, !1190, !1191, !1203, !1208, !1246, !1247, !1251, !1256, !1257, !1258, !1262, !1268, !1274}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1170, file: !897, line: 638, baseType: !954, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1170, file: !897, line: 645, baseType: !954, size: 64, align: 64, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1170, file: !897, line: 652, baseType: !917, size: 32, align: 32, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1170, file: !897, line: 659, baseType: !954, size: 64, align: 64, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1170, file: !897, line: 661, baseType: !1177, size: 64, align: 64, offset: 256)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1179)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1182, line: 44, size: 64, align: 32, elements: !1183)
!1182 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1183 = !{!1184, !1185}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1181, file: !1182, line: 45, baseType: !33, size: 32, align: 32)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1181, file: !1182, line: 46, baseType: !918, size: 32, align: 32, offset: 32)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1170, file: !897, line: 663, baseType: !948, size: 64, align: 64, offset: 320)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1170, file: !897, line: 670, baseType: !954, size: 64, align: 64, offset: 384)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1170, file: !897, line: 679, baseType: !1169, size: 64, align: 64, offset: 448)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1170, file: !897, line: 684, baseType: !917, size: 32, align: 32, offset: 512)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1170, file: !897, line: 689, baseType: !917, size: 32, align: 32, offset: 544)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1170, file: !897, line: 696, baseType: !1192, size: 64, align: 64, offset: 576)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64, align: 64)
!1193 = !DISubroutineType(types: !1194)
!1194 = !{!917, !1195}
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1197)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1198)
!1198 = !{!1199, !1200, !1201, !1202}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1197, file: !897, line: 449, baseType: !954, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1197, file: !897, line: 450, baseType: !993, size: 64, align: 64, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1197, file: !897, line: 451, baseType: !917, size: 32, align: 32, offset: 128)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1197, file: !897, line: 452, baseType: !954, size: 64, align: 64, offset: 192)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1170, file: !897, line: 703, baseType: !1204, size: 64, align: 64, offset: 640)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!917, !1207}
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1170, file: !897, line: 714, baseType: !1209, size: 64, align: 64, offset: 704)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!917, !1207, !1212}
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !34, line: 1499, baseType: !1214)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !34, line: 1445, size: 704, align: 64, elements: !1215)
!1215 = !{!1216, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1242, !1243, !1244, !1245}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1214, file: !34, line: 1451, baseType: !1217, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1219, line: 94, baseType: !1220)
!1219 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1219, line: 81, size: 192, align: 64, elements: !1221)
!1221 = !{!1222, !1226, !1227}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1220, file: !1219, line: 82, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1219, line: 73, baseType: !1225)
!1225 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1219, line: 73, flags: DIFlagFwdDecl)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1220, file: !1219, line: 89, baseType: !1003, size: 64, align: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1220, file: !1219, line: 93, baseType: !917, size: 32, align: 32, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1214, file: !34, line: 1461, baseType: !1010, size: 64, align: 64, offset: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1214, file: !34, line: 1467, baseType: !1010, size: 64, align: 64, offset: 128)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1214, file: !34, line: 1468, baseType: !1003, size: 64, align: 64, offset: 192)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1214, file: !34, line: 1469, baseType: !917, size: 32, align: 32, offset: 256)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1214, file: !34, line: 1470, baseType: !917, size: 32, align: 32, offset: 288)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1214, file: !34, line: 1474, baseType: !917, size: 32, align: 32, offset: 320)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1214, file: !34, line: 1479, baseType: !1235, size: 64, align: 64, offset: 384)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !34, line: 1415, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !34, line: 1411, size: 128, align: 64, elements: !1238)
!1238 = !{!1239, !1240, !1241}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1237, file: !34, line: 1412, baseType: !1003, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1237, file: !34, line: 1413, baseType: !917, size: 32, align: 32, offset: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1237, file: !34, line: 1414, baseType: !493, size: 32, align: 32, offset: 96)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1214, file: !34, line: 1480, baseType: !917, size: 32, align: 32, offset: 448)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1214, file: !34, line: 1486, baseType: !1010, size: 64, align: 64, offset: 512)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1214, file: !34, line: 1488, baseType: !1010, size: 64, align: 64, offset: 576)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1214, file: !34, line: 1497, baseType: !1010, size: 64, align: 64, offset: 640)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1170, file: !897, line: 720, baseType: !1204, size: 64, align: 64, offset: 768)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1170, file: !897, line: 730, baseType: !1248, size: 64, align: 64, offset: 832)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!917, !1207, !917, !1010, !917}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1170, file: !897, line: 737, baseType: !1252, size: 64, align: 64, offset: 896)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{!1010, !1207, !917, !1255, !1010}
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1170, file: !897, line: 744, baseType: !1204, size: 64, align: 64, offset: 960)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1170, file: !897, line: 750, baseType: !1204, size: 64, align: 64, offset: 1024)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1170, file: !897, line: 758, baseType: !1259, size: 64, align: 64, offset: 1088)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!917, !1207, !917, !1010, !1010, !1010, !917}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1170, file: !897, line: 764, baseType: !1263, size: 64, align: 64, offset: 1152)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!917, !1207, !1266}
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1170, file: !897, line: 770, baseType: !1269, size: 64, align: 64, offset: 1216)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!917, !1207, !1272}
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1170, file: !897, line: 776, baseType: !1269, size: 64, align: 64, offset: 1280)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1165, file: !897, line: 1356, baseType: !1276, size: 64, align: 64, offset: 128)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1278)
!1278 = !{!1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1298, !1302, !1306, !1312, !1407, !1408, !1409, !1410, !1411, !1412, !1416}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1277, file: !897, line: 498, baseType: !954, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1277, file: !897, line: 504, baseType: !954, size: 64, align: 64, offset: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1277, file: !897, line: 505, baseType: !954, size: 64, align: 64, offset: 128)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1277, file: !897, line: 506, baseType: !954, size: 64, align: 64, offset: 192)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1277, file: !897, line: 508, baseType: !33, size: 32, align: 32, offset: 256)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1277, file: !897, line: 509, baseType: !33, size: 32, align: 32, offset: 288)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1277, file: !897, line: 510, baseType: !33, size: 32, align: 32, offset: 320)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1277, file: !897, line: 517, baseType: !917, size: 32, align: 32, offset: 352)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1277, file: !897, line: 523, baseType: !1177, size: 64, align: 64, offset: 384)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1277, file: !897, line: 526, baseType: !948, size: 64, align: 64, offset: 448)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1277, file: !897, line: 535, baseType: !1276, size: 64, align: 64, offset: 512)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1277, file: !897, line: 539, baseType: !917, size: 32, align: 32, offset: 576)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1277, file: !897, line: 541, baseType: !1204, size: 64, align: 64, offset: 640)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1277, file: !897, line: 549, baseType: !1209, size: 64, align: 64, offset: 704)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1277, file: !897, line: 550, baseType: !1204, size: 64, align: 64, offset: 768)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1277, file: !897, line: 554, baseType: !1295, size: 64, align: 64, offset: 832)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{!917, !1207, !1212, !1212, !917}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1277, file: !897, line: 563, baseType: !1299, size: 64, align: 64, offset: 896)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DISubroutineType(types: !1301)
!1301 = !{!917, !33, !917}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1277, file: !897, line: 565, baseType: !1303, size: 64, align: 64, offset: 960)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{null, !1207, !917, !1255, !1255}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1277, file: !897, line: 570, baseType: !1307, size: 64, align: 64, offset: 1024)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!917, !1207, !917, !961, !1310}
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1311, line: 216, baseType: !1017)
!1311 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1277, file: !897, line: 581, baseType: !1313, size: 64, align: 64, offset: 1088)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!917, !1207, !917, !1316, !918}
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !535, line: 646, baseType: !1319)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !535, line: 268, size: 4288, align: 64, elements: !1320)
!1320 = !{!1321, !1325, !1327, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1361, !1363, !1364, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1319, file: !535, line: 282, baseType: !1322, size: 512, align: 64)
!1322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1003, size: 512, align: 64, elements: !1323)
!1323 = !{!1324}
!1324 = !DISubrange(count: 8)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1319, file: !535, line: 299, baseType: !1326, size: 256, align: 32, offset: 512)
!1326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 256, align: 32, elements: !1323)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1319, file: !535, line: 315, baseType: !1328, size: 64, align: 64, offset: 768)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1319, file: !535, line: 326, baseType: !917, size: 32, align: 32, offset: 832)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1319, file: !535, line: 326, baseType: !917, size: 32, align: 32, offset: 864)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1319, file: !535, line: 334, baseType: !917, size: 32, align: 32, offset: 896)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1319, file: !535, line: 341, baseType: !917, size: 32, align: 32, offset: 928)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1319, file: !535, line: 346, baseType: !917, size: 32, align: 32, offset: 960)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1319, file: !535, line: 351, baseType: !523, size: 32, align: 32, offset: 992)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1319, file: !535, line: 356, baseType: !1336, size: 64, align: 32, offset: 1024)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1337, line: 61, baseType: !1338)
!1337 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1337, line: 58, size: 64, align: 32, elements: !1339)
!1339 = !{!1340, !1341}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1338, file: !1337, line: 59, baseType: !917, size: 32, align: 32)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1338, file: !1337, line: 60, baseType: !917, size: 32, align: 32, offset: 32)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1319, file: !535, line: 361, baseType: !1010, size: 64, align: 64, offset: 1088)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1319, file: !535, line: 369, baseType: !1010, size: 64, align: 64, offset: 1152)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1319, file: !535, line: 377, baseType: !1010, size: 64, align: 64, offset: 1216)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1319, file: !535, line: 382, baseType: !917, size: 32, align: 32, offset: 1280)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1319, file: !535, line: 386, baseType: !917, size: 32, align: 32, offset: 1312)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1319, file: !535, line: 391, baseType: !917, size: 32, align: 32, offset: 1344)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1319, file: !535, line: 396, baseType: !961, size: 64, align: 64, offset: 1408)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1319, file: !535, line: 403, baseType: !1350, size: 512, align: 64, offset: 1472)
!1350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1351, size: 512, align: 64, elements: !1323)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !926, line: 55, baseType: !1017)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1319, file: !535, line: 410, baseType: !917, size: 32, align: 32, offset: 1984)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1319, file: !535, line: 415, baseType: !917, size: 32, align: 32, offset: 2016)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1319, file: !535, line: 420, baseType: !917, size: 32, align: 32, offset: 2048)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1319, file: !535, line: 425, baseType: !917, size: 32, align: 32, offset: 2080)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1319, file: !535, line: 435, baseType: !1010, size: 64, align: 64, offset: 2112)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1319, file: !535, line: 440, baseType: !917, size: 32, align: 32, offset: 2176)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1319, file: !535, line: 445, baseType: !1351, size: 64, align: 64, offset: 2240)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1319, file: !535, line: 459, baseType: !1360, size: 512, align: 64, offset: 2304)
!1360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1217, size: 512, align: 64, elements: !1323)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1319, file: !535, line: 473, baseType: !1362, size: 64, align: 64, offset: 2816)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1319, file: !535, line: 477, baseType: !917, size: 32, align: 32, offset: 2880)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1319, file: !535, line: 479, baseType: !1365, size: 64, align: 64, offset: 2944)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !535, line: 207, baseType: !1368)
!1368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !535, line: 201, size: 320, align: 64, elements: !1369)
!1369 = !{!1370, !1371, !1372, !1373, !1378}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1368, file: !535, line: 202, baseType: !534, size: 32, align: 32)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1368, file: !535, line: 203, baseType: !1003, size: 64, align: 64, offset: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1368, file: !535, line: 204, baseType: !917, size: 32, align: 32, offset: 128)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1368, file: !535, line: 205, baseType: !1374, size: 64, align: 64, offset: 192)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1376, line: 86, baseType: !1377)
!1376 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1377 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1376, line: 86, flags: DIFlagFwdDecl)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1368, file: !535, line: 206, baseType: !1217, size: 64, align: 64, offset: 256)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1319, file: !535, line: 480, baseType: !917, size: 32, align: 32, offset: 3008)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1319, file: !535, line: 505, baseType: !917, size: 32, align: 32, offset: 3040)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1319, file: !535, line: 512, baseType: !558, size: 32, align: 32, offset: 3072)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1319, file: !535, line: 514, baseType: !565, size: 32, align: 32, offset: 3104)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1319, file: !535, line: 516, baseType: !583, size: 32, align: 32, offset: 3136)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1319, file: !535, line: 523, baseType: !607, size: 32, align: 32, offset: 3168)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1319, file: !535, line: 525, baseType: !626, size: 32, align: 32, offset: 3200)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1319, file: !535, line: 532, baseType: !1010, size: 64, align: 64, offset: 3264)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1319, file: !535, line: 539, baseType: !1010, size: 64, align: 64, offset: 3328)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1319, file: !535, line: 547, baseType: !1010, size: 64, align: 64, offset: 3392)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1319, file: !535, line: 554, baseType: !1374, size: 64, align: 64, offset: 3456)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1319, file: !535, line: 563, baseType: !917, size: 32, align: 32, offset: 3520)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1319, file: !535, line: 572, baseType: !917, size: 32, align: 32, offset: 3552)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1319, file: !535, line: 581, baseType: !917, size: 32, align: 32, offset: 3584)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1319, file: !535, line: 588, baseType: !1394, size: 64, align: 64, offset: 3648)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !926, line: 36, baseType: !1396)
!1396 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1319, file: !535, line: 593, baseType: !917, size: 32, align: 32, offset: 3712)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1319, file: !535, line: 596, baseType: !917, size: 32, align: 32, offset: 3744)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1319, file: !535, line: 599, baseType: !1217, size: 64, align: 64, offset: 3776)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1319, file: !535, line: 605, baseType: !1217, size: 64, align: 64, offset: 3840)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1319, file: !535, line: 616, baseType: !1217, size: 64, align: 64, offset: 3904)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1319, file: !535, line: 626, baseType: !1310, size: 64, align: 64, offset: 3968)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1319, file: !535, line: 627, baseType: !1310, size: 64, align: 64, offset: 4032)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1319, file: !535, line: 628, baseType: !1310, size: 64, align: 64, offset: 4096)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1319, file: !535, line: 629, baseType: !1310, size: 64, align: 64, offset: 4160)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1319, file: !535, line: 645, baseType: !1217, size: 64, align: 64, offset: 4224)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1277, file: !897, line: 587, baseType: !1263, size: 64, align: 64, offset: 1152)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1277, file: !897, line: 592, baseType: !1269, size: 64, align: 64, offset: 1216)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1277, file: !897, line: 597, baseType: !1269, size: 64, align: 64, offset: 1280)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1277, file: !897, line: 598, baseType: !33, size: 32, align: 32, offset: 1344)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1277, file: !897, line: 608, baseType: !1204, size: 64, align: 64, offset: 1408)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1277, file: !897, line: 617, baseType: !1413, size: 64, align: 64, offset: 1472)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DISubroutineType(types: !1415)
!1415 = !{null, !1207}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1277, file: !897, line: 623, baseType: !1417, size: 64, align: 64, offset: 1536)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DISubroutineType(types: !1419)
!1419 = !{!917, !1207, !1420}
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1213)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1165, file: !897, line: 1365, baseType: !961, size: 64, align: 64, offset: 192)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1165, file: !897, line: 1379, baseType: !943, size: 64, align: 64, offset: 256)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1165, file: !897, line: 1386, baseType: !917, size: 32, align: 32, offset: 320)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1165, file: !897, line: 1393, baseType: !918, size: 32, align: 32, offset: 352)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1165, file: !897, line: 1405, baseType: !1427, size: 64, align: 64, offset: 384)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1430)
!1430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1431)
!1431 = !{!1432, !1433, !1434, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1902, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !2003, !2009, !2010, !2014, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2046, !2047, !2048, !2049, !2050, !2051}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1430, file: !897, line: 866, baseType: !917, size: 32, align: 32)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1430, file: !897, line: 872, baseType: !917, size: 32, align: 32, offset: 32)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1430, file: !897, line: 878, baseType: !1435, size: 64, align: 64, offset: 64)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !34, line: 3360, baseType: !1437)
!1437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !34, line: 1556, size: 8448, align: 64, elements: !1438)
!1438 = !{!1439, !1440, !1441, !1442, !1577, !1578, !1579, !1580, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1606, !1610, !1611, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1790, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1437, file: !34, line: 1561, baseType: !948, size: 64, align: 64)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1437, file: !34, line: 1562, baseType: !917, size: 32, align: 32, offset: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1437, file: !34, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1437, file: !34, line: 1565, baseType: !1443, size: 64, align: 64, offset: 128)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1445)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !34, line: 3468, size: 1984, align: 64, elements: !1446)
!1446 = !{!1447, !1448, !1449, !1450, !1451, !1452, !1455, !1458, !1461, !1464, !1467, !1468, !1469, !1477, !1478, !1479, !1481, !1485, !1491, !1496, !1500, !1501, !1542, !1549, !1553, !1554, !1558, !1562, !1566, !1570, !1571, !1572}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1445, file: !34, line: 3475, baseType: !954, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1445, file: !34, line: 3480, baseType: !954, size: 64, align: 64, offset: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1445, file: !34, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1445, file: !34, line: 3482, baseType: !33, size: 32, align: 32, offset: 160)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1445, file: !34, line: 3487, baseType: !917, size: 32, align: 32, offset: 192)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1445, file: !34, line: 3488, baseType: !1453, size: 64, align: 64, offset: 256)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1336)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1445, file: !34, line: 3489, baseType: !1456, size: 64, align: 64, offset: 320)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1445, file: !34, line: 3490, baseType: !1459, size: 64, align: 64, offset: 384)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1445, file: !34, line: 3491, baseType: !1462, size: 64, align: 64, offset: 448)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1445, file: !34, line: 3492, baseType: !1465, size: 64, align: 64, offset: 512)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1351)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1445, file: !34, line: 3493, baseType: !1004, size: 8, align: 8, offset: 576)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1445, file: !34, line: 3494, baseType: !948, size: 64, align: 64, offset: 640)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1445, file: !34, line: 3495, baseType: !1470, size: 64, align: 64, offset: 704)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1472)
!1472 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !34, line: 3404, baseType: !1473)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !34, line: 3401, size: 128, align: 64, elements: !1474)
!1474 = !{!1475, !1476}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1473, file: !34, line: 3402, baseType: !917, size: 32, align: 32)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1473, file: !34, line: 3403, baseType: !954, size: 64, align: 64, offset: 64)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1445, file: !34, line: 3507, baseType: !954, size: 64, align: 64, offset: 768)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1445, file: !34, line: 3516, baseType: !917, size: 32, align: 32, offset: 832)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1445, file: !34, line: 3517, baseType: !1480, size: 64, align: 64, offset: 896)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1445, file: !34, line: 3527, baseType: !1482, size: 64, align: 64, offset: 960)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DISubroutineType(types: !1484)
!1484 = !{!917, !1435}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1445, file: !34, line: 3535, baseType: !1486, size: 64, align: 64, offset: 1024)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DISubroutineType(types: !1488)
!1488 = !{!917, !1435, !1489}
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1436)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1445, file: !34, line: 3541, baseType: !1492, size: 64, align: 64, offset: 1088)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1494)
!1494 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !34, line: 3461, baseType: !1495)
!1495 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !34, line: 3461, flags: DIFlagFwdDecl)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1445, file: !34, line: 3549, baseType: !1497, size: 64, align: 64, offset: 1152)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{null, !1480}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1445, file: !34, line: 3551, baseType: !1482, size: 64, align: 64, offset: 1216)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1445, file: !34, line: 3552, baseType: !1502, size: 64, align: 64, offset: 1280)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{!917, !1435, !1003, !917, !1505}
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1507)
!1507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !34, line: 3920, size: 256, align: 64, elements: !1508)
!1508 = !{!1509, !1510, !1511, !1512, !1513, !1541}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1507, file: !34, line: 3921, baseType: !925, size: 16, align: 16)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1507, file: !34, line: 3922, baseType: !933, size: 32, align: 32, offset: 32)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1507, file: !34, line: 3923, baseType: !933, size: 32, align: 32, offset: 64)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1507, file: !34, line: 3924, baseType: !918, size: 32, align: 32, offset: 96)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1507, file: !34, line: 3925, baseType: !1514, size: 64, align: 64, offset: 128)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !34, line: 3918, baseType: !1517)
!1517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !34, line: 3885, size: 1600, align: 64, elements: !1518)
!1518 = !{!1519, !1520, !1521, !1522, !1523, !1524, !1530, !1534, !1536, !1537, !1539, !1540}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1517, file: !34, line: 3886, baseType: !917, size: 32, align: 32)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1517, file: !34, line: 3887, baseType: !917, size: 32, align: 32, offset: 32)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1517, file: !34, line: 3888, baseType: !917, size: 32, align: 32, offset: 64)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1517, file: !34, line: 3889, baseType: !917, size: 32, align: 32, offset: 96)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1517, file: !34, line: 3890, baseType: !917, size: 32, align: 32, offset: 128)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1517, file: !34, line: 3897, baseType: !1525, size: 768, align: 64, offset: 192)
!1525 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !34, line: 3858, baseType: !1526)
!1526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !34, line: 3853, size: 768, align: 64, elements: !1527)
!1527 = !{!1528, !1529}
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1526, file: !34, line: 3855, baseType: !1322, size: 512, align: 64)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1526, file: !34, line: 3857, baseType: !1326, size: 256, align: 32, offset: 512)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1517, file: !34, line: 3903, baseType: !1531, size: 256, align: 64, offset: 960)
!1531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1003, size: 256, align: 64, elements: !1532)
!1532 = !{!1533}
!1533 = !DISubrange(count: 4)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1517, file: !34, line: 3904, baseType: !1535, size: 128, align: 32, offset: 1216)
!1535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 128, align: 32, elements: !1532)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1517, file: !34, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1517, file: !34, line: 3908, baseType: !1538, size: 64, align: 64, offset: 1408)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1517, file: !34, line: 3915, baseType: !1538, size: 64, align: 64, offset: 1472)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1517, file: !34, line: 3917, baseType: !917, size: 32, align: 32, offset: 1536)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1507, file: !34, line: 3926, baseType: !1010, size: 64, align: 64, offset: 192)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1445, file: !34, line: 3564, baseType: !1543, size: 64, align: 64, offset: 1344)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DISubroutineType(types: !1545)
!1545 = !{!917, !1435, !1212, !1546, !1548}
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1318)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1445, file: !34, line: 3566, baseType: !1550, size: 64, align: 64, offset: 1408)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DISubroutineType(types: !1552)
!1552 = !{!917, !1435, !961, !1548, !1212}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1445, file: !34, line: 3567, baseType: !1482, size: 64, align: 64, offset: 1472)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1445, file: !34, line: 3576, baseType: !1555, size: 64, align: 64, offset: 1536)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1556 = !DISubroutineType(types: !1557)
!1557 = !{!917, !1435, !1546}
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1445, file: !34, line: 3577, baseType: !1559, size: 64, align: 64, offset: 1600)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64, align: 64)
!1560 = !DISubroutineType(types: !1561)
!1561 = !{!917, !1435, !1212}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1445, file: !34, line: 3584, baseType: !1563, size: 64, align: 64, offset: 1664)
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1564 = !DISubroutineType(types: !1565)
!1565 = !{!917, !1435, !1317}
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1445, file: !34, line: 3589, baseType: !1567, size: 64, align: 64, offset: 1728)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DISubroutineType(types: !1569)
!1569 = !{null, !1435}
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1445, file: !34, line: 3594, baseType: !917, size: 32, align: 32, offset: 1792)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1445, file: !34, line: 3600, baseType: !954, size: 64, align: 64, offset: 1856)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1445, file: !34, line: 3609, baseType: !1573, size: 64, align: 64, offset: 1920)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1576)
!1576 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !34, line: 3609, flags: DIFlagFwdDecl)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1437, file: !34, line: 1566, baseType: !33, size: 32, align: 32, offset: 192)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1437, file: !34, line: 1581, baseType: !918, size: 32, align: 32, offset: 224)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1437, file: !34, line: 1583, baseType: !961, size: 64, align: 64, offset: 256)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1437, file: !34, line: 1591, baseType: !1581, size: 64, align: 64, offset: 320)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64, align: 64)
!1582 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !34, line: 1532, flags: DIFlagFwdDecl)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1437, file: !34, line: 1598, baseType: !961, size: 64, align: 64, offset: 384)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1437, file: !34, line: 1606, baseType: !1010, size: 64, align: 64, offset: 448)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1437, file: !34, line: 1614, baseType: !917, size: 32, align: 32, offset: 512)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1437, file: !34, line: 1622, baseType: !917, size: 32, align: 32, offset: 544)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1437, file: !34, line: 1628, baseType: !917, size: 32, align: 32, offset: 576)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1437, file: !34, line: 1636, baseType: !917, size: 32, align: 32, offset: 608)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1437, file: !34, line: 1643, baseType: !917, size: 32, align: 32, offset: 640)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1437, file: !34, line: 1657, baseType: !1003, size: 64, align: 64, offset: 704)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1437, file: !34, line: 1658, baseType: !917, size: 32, align: 32, offset: 768)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1437, file: !34, line: 1679, baseType: !1336, size: 64, align: 32, offset: 800)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1437, file: !34, line: 1688, baseType: !917, size: 32, align: 32, offset: 864)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1437, file: !34, line: 1712, baseType: !917, size: 32, align: 32, offset: 896)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1437, file: !34, line: 1729, baseType: !917, size: 32, align: 32, offset: 928)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1437, file: !34, line: 1729, baseType: !917, size: 32, align: 32, offset: 960)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1437, file: !34, line: 1744, baseType: !917, size: 32, align: 32, offset: 992)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1437, file: !34, line: 1744, baseType: !917, size: 32, align: 32, offset: 1024)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1437, file: !34, line: 1751, baseType: !917, size: 32, align: 32, offset: 1056)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1437, file: !34, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1437, file: !34, line: 1791, baseType: !1602, size: 64, align: 64, offset: 1152)
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64, align: 64)
!1603 = !DISubroutineType(types: !1604)
!1604 = !{null, !1605, !1546, !1548, !917, !917, !917}
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1437, file: !34, line: 1808, baseType: !1607, size: 64, align: 64, offset: 1216)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DISubroutineType(types: !1609)
!1609 = !{!645, !1605, !1456}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1437, file: !34, line: 1816, baseType: !917, size: 32, align: 32, offset: 1280)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1437, file: !34, line: 1825, baseType: !1612, size: 32, align: 32, offset: 1312)
!1612 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1437, file: !34, line: 1830, baseType: !917, size: 32, align: 32, offset: 1344)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1437, file: !34, line: 1838, baseType: !1612, size: 32, align: 32, offset: 1376)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1437, file: !34, line: 1846, baseType: !917, size: 32, align: 32, offset: 1408)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1437, file: !34, line: 1851, baseType: !917, size: 32, align: 32, offset: 1440)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1437, file: !34, line: 1861, baseType: !1612, size: 32, align: 32, offset: 1472)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1437, file: !34, line: 1868, baseType: !1612, size: 32, align: 32, offset: 1504)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1437, file: !34, line: 1875, baseType: !1612, size: 32, align: 32, offset: 1536)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1437, file: !34, line: 1882, baseType: !1612, size: 32, align: 32, offset: 1568)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1437, file: !34, line: 1889, baseType: !1612, size: 32, align: 32, offset: 1600)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1437, file: !34, line: 1896, baseType: !1612, size: 32, align: 32, offset: 1632)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1437, file: !34, line: 1903, baseType: !1612, size: 32, align: 32, offset: 1664)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1437, file: !34, line: 1910, baseType: !917, size: 32, align: 32, offset: 1696)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1437, file: !34, line: 1915, baseType: !917, size: 32, align: 32, offset: 1728)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1437, file: !34, line: 1926, baseType: !1548, size: 64, align: 64, offset: 1792)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1437, file: !34, line: 1935, baseType: !1336, size: 64, align: 32, offset: 1856)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1437, file: !34, line: 1942, baseType: !917, size: 32, align: 32, offset: 1920)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1437, file: !34, line: 1948, baseType: !917, size: 32, align: 32, offset: 1952)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1437, file: !34, line: 1954, baseType: !917, size: 32, align: 32, offset: 1984)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1437, file: !34, line: 1960, baseType: !917, size: 32, align: 32, offset: 2016)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1437, file: !34, line: 1984, baseType: !917, size: 32, align: 32, offset: 2048)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1437, file: !34, line: 1991, baseType: !917, size: 32, align: 32, offset: 2080)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1437, file: !34, line: 1996, baseType: !917, size: 32, align: 32, offset: 2112)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1437, file: !34, line: 2004, baseType: !917, size: 32, align: 32, offset: 2144)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1437, file: !34, line: 2011, baseType: !917, size: 32, align: 32, offset: 2176)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1437, file: !34, line: 2018, baseType: !917, size: 32, align: 32, offset: 2208)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1437, file: !34, line: 2027, baseType: !917, size: 32, align: 32, offset: 2240)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1437, file: !34, line: 2034, baseType: !917, size: 32, align: 32, offset: 2272)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1437, file: !34, line: 2044, baseType: !917, size: 32, align: 32, offset: 2304)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1437, file: !34, line: 2054, baseType: !1642, size: 64, align: 64, offset: 2368)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1437, file: !34, line: 2061, baseType: !1642, size: 64, align: 64, offset: 2432)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1437, file: !34, line: 2066, baseType: !917, size: 32, align: 32, offset: 2496)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1437, file: !34, line: 2070, baseType: !917, size: 32, align: 32, offset: 2528)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1437, file: !34, line: 2078, baseType: !917, size: 32, align: 32, offset: 2560)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1437, file: !34, line: 2085, baseType: !917, size: 32, align: 32, offset: 2592)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1437, file: !34, line: 2092, baseType: !917, size: 32, align: 32, offset: 2624)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1437, file: !34, line: 2099, baseType: !917, size: 32, align: 32, offset: 2656)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1437, file: !34, line: 2106, baseType: !917, size: 32, align: 32, offset: 2688)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1437, file: !34, line: 2113, baseType: !917, size: 32, align: 32, offset: 2720)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1437, file: !34, line: 2120, baseType: !917, size: 32, align: 32, offset: 2752)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1437, file: !34, line: 2125, baseType: !917, size: 32, align: 32, offset: 2784)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1437, file: !34, line: 2133, baseType: !917, size: 32, align: 32, offset: 2816)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1437, file: !34, line: 2140, baseType: !917, size: 32, align: 32, offset: 2848)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1437, file: !34, line: 2145, baseType: !917, size: 32, align: 32, offset: 2880)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1437, file: !34, line: 2153, baseType: !917, size: 32, align: 32, offset: 2912)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1437, file: !34, line: 2158, baseType: !917, size: 32, align: 32, offset: 2944)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1437, file: !34, line: 2166, baseType: !565, size: 32, align: 32, offset: 2976)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1437, file: !34, line: 2173, baseType: !583, size: 32, align: 32, offset: 3008)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1437, file: !34, line: 2180, baseType: !607, size: 32, align: 32, offset: 3040)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1437, file: !34, line: 2187, baseType: !558, size: 32, align: 32, offset: 3072)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1437, file: !34, line: 2194, baseType: !626, size: 32, align: 32, offset: 3104)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1437, file: !34, line: 2203, baseType: !917, size: 32, align: 32, offset: 3136)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1437, file: !34, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1437, file: !34, line: 2212, baseType: !917, size: 32, align: 32, offset: 3200)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1437, file: !34, line: 2213, baseType: !917, size: 32, align: 32, offset: 3232)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1437, file: !34, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1437, file: !34, line: 2232, baseType: !917, size: 32, align: 32, offset: 3296)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1437, file: !34, line: 2243, baseType: !917, size: 32, align: 32, offset: 3328)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1437, file: !34, line: 2249, baseType: !917, size: 32, align: 32, offset: 3360)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1437, file: !34, line: 2256, baseType: !917, size: 32, align: 32, offset: 3392)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1437, file: !34, line: 2263, baseType: !1351, size: 64, align: 64, offset: 3456)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1437, file: !34, line: 2270, baseType: !1351, size: 64, align: 64, offset: 3520)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1437, file: !34, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1437, file: !34, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1437, file: !34, line: 2367, baseType: !1678, size: 64, align: 64, offset: 3648)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1679 = !DISubroutineType(types: !1680)
!1680 = !{!917, !1605, !1317, !917}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1437, file: !34, line: 2383, baseType: !917, size: 32, align: 32, offset: 3712)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1437, file: !34, line: 2386, baseType: !1612, size: 32, align: 32, offset: 3744)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1437, file: !34, line: 2387, baseType: !1612, size: 32, align: 32, offset: 3776)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1437, file: !34, line: 2394, baseType: !917, size: 32, align: 32, offset: 3808)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1437, file: !34, line: 2401, baseType: !917, size: 32, align: 32, offset: 3840)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1437, file: !34, line: 2408, baseType: !917, size: 32, align: 32, offset: 3872)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1437, file: !34, line: 2415, baseType: !917, size: 32, align: 32, offset: 3904)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1437, file: !34, line: 2422, baseType: !917, size: 32, align: 32, offset: 3936)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1437, file: !34, line: 2423, baseType: !1690, size: 64, align: 64, offset: 3968)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !34, line: 831, baseType: !1692)
!1692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !34, line: 826, size: 128, align: 32, elements: !1693)
!1693 = !{!1694, !1695, !1696, !1697}
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1692, file: !34, line: 827, baseType: !917, size: 32, align: 32)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1692, file: !34, line: 828, baseType: !917, size: 32, align: 32, offset: 32)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1692, file: !34, line: 829, baseType: !917, size: 32, align: 32, offset: 64)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1692, file: !34, line: 830, baseType: !1612, size: 32, align: 32, offset: 96)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1437, file: !34, line: 2430, baseType: !1010, size: 64, align: 64, offset: 4032)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1437, file: !34, line: 2437, baseType: !1010, size: 64, align: 64, offset: 4096)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1437, file: !34, line: 2444, baseType: !1612, size: 32, align: 32, offset: 4160)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1437, file: !34, line: 2451, baseType: !1612, size: 32, align: 32, offset: 4192)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1437, file: !34, line: 2458, baseType: !917, size: 32, align: 32, offset: 4224)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1437, file: !34, line: 2469, baseType: !917, size: 32, align: 32, offset: 4256)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1437, file: !34, line: 2475, baseType: !917, size: 32, align: 32, offset: 4288)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1437, file: !34, line: 2481, baseType: !917, size: 32, align: 32, offset: 4320)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1437, file: !34, line: 2485, baseType: !917, size: 32, align: 32, offset: 4352)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1437, file: !34, line: 2489, baseType: !917, size: 32, align: 32, offset: 4384)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1437, file: !34, line: 2493, baseType: !917, size: 32, align: 32, offset: 4416)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1437, file: !34, line: 2501, baseType: !917, size: 32, align: 32, offset: 4448)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1437, file: !34, line: 2506, baseType: !917, size: 32, align: 32, offset: 4480)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1437, file: !34, line: 2510, baseType: !917, size: 32, align: 32, offset: 4512)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1437, file: !34, line: 2514, baseType: !1010, size: 64, align: 64, offset: 4544)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1437, file: !34, line: 2528, baseType: !1714, size: 64, align: 64, offset: 4608)
!1714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1715, size: 64, align: 64)
!1715 = !DISubroutineType(types: !1716)
!1716 = !{null, !1605, !961, !917, !917}
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1437, file: !34, line: 2534, baseType: !917, size: 32, align: 32, offset: 4672)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1437, file: !34, line: 2545, baseType: !917, size: 32, align: 32, offset: 4704)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1437, file: !34, line: 2547, baseType: !917, size: 32, align: 32, offset: 4736)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1437, file: !34, line: 2549, baseType: !917, size: 32, align: 32, offset: 4768)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1437, file: !34, line: 2551, baseType: !917, size: 32, align: 32, offset: 4800)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1437, file: !34, line: 2553, baseType: !917, size: 32, align: 32, offset: 4832)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1437, file: !34, line: 2555, baseType: !917, size: 32, align: 32, offset: 4864)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1437, file: !34, line: 2557, baseType: !917, size: 32, align: 32, offset: 4896)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1437, file: !34, line: 2559, baseType: !917, size: 32, align: 32, offset: 4928)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1437, file: !34, line: 2563, baseType: !917, size: 32, align: 32, offset: 4960)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1437, file: !34, line: 2571, baseType: !1538, size: 64, align: 64, offset: 4992)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1437, file: !34, line: 2579, baseType: !1538, size: 64, align: 64, offset: 5056)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1437, file: !34, line: 2586, baseType: !917, size: 32, align: 32, offset: 5120)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1437, file: !34, line: 2615, baseType: !917, size: 32, align: 32, offset: 5152)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1437, file: !34, line: 2627, baseType: !917, size: 32, align: 32, offset: 5184)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1437, file: !34, line: 2637, baseType: !917, size: 32, align: 32, offset: 5216)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1437, file: !34, line: 2681, baseType: !917, size: 32, align: 32, offset: 5248)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1437, file: !34, line: 2709, baseType: !1010, size: 64, align: 64, offset: 5312)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1437, file: !34, line: 2716, baseType: !1736, size: 64, align: 64, offset: 5376)
!1736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1737, size: 64, align: 64)
!1737 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1738)
!1738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !34, line: 3636, size: 896, align: 64, elements: !1739)
!1739 = !{!1740, !1741, !1742, !1743, !1744, !1745, !1746, !1750, !1754, !1755, !1756, !1757, !1763, !1764, !1765, !1766, !1767}
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1738, file: !34, line: 3642, baseType: !954, size: 64, align: 64)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1738, file: !34, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1738, file: !34, line: 3656, baseType: !33, size: 32, align: 32, offset: 96)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1738, file: !34, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1738, file: !34, line: 3669, baseType: !917, size: 32, align: 32, offset: 160)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1738, file: !34, line: 3682, baseType: !1563, size: 64, align: 64, offset: 192)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1738, file: !34, line: 3698, baseType: !1747, size: 64, align: 64, offset: 256)
!1747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1748, size: 64, align: 64)
!1748 = !DISubroutineType(types: !1749)
!1749 = !{!917, !1435, !1023, !933}
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1738, file: !34, line: 3712, baseType: !1751, size: 64, align: 64, offset: 320)
!1751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1752, size: 64, align: 64)
!1752 = !DISubroutineType(types: !1753)
!1753 = !{!917, !1435, !917, !1023, !933}
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1738, file: !34, line: 3726, baseType: !1747, size: 64, align: 64, offset: 384)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1738, file: !34, line: 3737, baseType: !1482, size: 64, align: 64, offset: 448)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1738, file: !34, line: 3746, baseType: !917, size: 32, align: 32, offset: 512)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1738, file: !34, line: 3757, baseType: !1758, size: 64, align: 64, offset: 576)
!1758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1759, size: 64, align: 64)
!1759 = !DISubroutineType(types: !1760)
!1760 = !{null, !1761}
!1761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1762, size: 64, align: 64)
!1762 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !34, line: 3617, flags: DIFlagFwdDecl)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1738, file: !34, line: 3766, baseType: !1482, size: 64, align: 64, offset: 640)
