; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--wavpackenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--wavpackenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "WP_ID", file: !910, line: 65, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/wavpack.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!911 = !{!912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926}
!912 = !DIEnumerator(name: "WP_ID_DUMMY", value: 0)
!913 = !DIEnumerator(name: "WP_ID_ENCINFO", value: 1)
!914 = !DIEnumerator(name: "WP_ID_DECTERMS", value: 2)
!915 = !DIEnumerator(name: "WP_ID_DECWEIGHTS", value: 3)
!916 = !DIEnumerator(name: "WP_ID_DECSAMPLES", value: 4)
!917 = !DIEnumerator(name: "WP_ID_ENTROPY", value: 5)
!918 = !DIEnumerator(name: "WP_ID_HYBRID", value: 6)
!919 = !DIEnumerator(name: "WP_ID_SHAPING", value: 7)
!920 = !DIEnumerator(name: "WP_ID_FLOATINFO", value: 8)
!921 = !DIEnumerator(name: "WP_ID_INT32INFO", value: 9)
!922 = !DIEnumerator(name: "WP_ID_DATA", value: 10)
!923 = !DIEnumerator(name: "WP_ID_CORR", value: 11)
!924 = !DIEnumerator(name: "WP_ID_EXTRABITS", value: 12)
!925 = !DIEnumerator(name: "WP_ID_CHANINFO", value: 13)
!926 = !DIEnumerator(name: "WP_ID_SAMPLE_RATE", value: 39)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "WP_ID_Flags", file: !910, line: 58, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "WP_IDF_MASK", value: 63)
!930 = !DIEnumerator(name: "WP_IDF_IGNORE", value: 32)
!931 = !DIEnumerator(name: "WP_IDF_ODD", value: 64)
!932 = !DIEnumerator(name: "WP_IDF_LONG", value: 128)
!933 = !{!934, !939, !943, !947, !942, !945, !948, !954, !955, !946, !957, !953, !958, !964, !965}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !937, line: 36, baseType: !938)
!937 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!938 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !937, line: 37, baseType: !942)
!942 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !937, line: 38, baseType: !946)
!946 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!947 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !950, line: 221, size: 32, align: 8, elements: !951)
!950 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!951 = !{!952}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !949, file: !950, line: 221, baseType: !953, size: 32, align: 32)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !937, line: 51, baseType: !947)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !937, line: 48, baseType: !956)
!956 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!957 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !950, line: 222, size: 16, align: 8, elements: !960)
!960 = !{!961}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !959, file: !950, line: 222, baseType: !962, size: 16, align: 16)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !937, line: 49, baseType: !963)
!963 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !937, line: 40, baseType: !966)
!966 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!967 = !{!968, !1720, !1721, !1727, !1731, !1745, !1749, !1750, !1751, !1752, !1756, !1758, !1760, !1762}
!968 = distinct !DIGlobalVariable(name: "ff_wavpack_encoder", scope: !0, file: !969, line: 2974, type: !970, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_wavpack_encoder)
!969 = !DIFile(filename: "libavcodec/wavpackenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !972)
!972 = !{!973, !977, !978, !979, !980, !981, !990, !993, !996, !999, !1004, !1005, !1078, !1086, !1087, !1088, !1090, !1635, !1641, !1649, !1653, !1654, !1691, !1695, !1699, !1700, !1704, !1708, !1709, !1713, !1714, !1715}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !971, file: !14, line: 3475, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !971, file: !14, line: 3480, baseType: !974, size: 64, align: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !971, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !971, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !971, file: !14, line: 3487, baseType: !946, size: 32, align: 32, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !971, file: !14, line: 3488, baseType: !982, size: 64, align: 64, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !985, line: 61, baseType: !986)
!985 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !985, line: 58, size: 64, align: 32, elements: !987)
!987 = !{!988, !989}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !986, file: !985, line: 59, baseType: !946, size: 32, align: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !986, file: !985, line: 60, baseType: !946, size: 32, align: 32, offset: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !971, file: !14, line: 3489, baseType: !991, size: 64, align: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !971, file: !14, line: 3490, baseType: !994, size: 64, align: 64, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !971, file: !14, line: 3491, baseType: !997, size: 64, align: 64, offset: 448)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !971, file: !14, line: 3492, baseType: !1000, size: 64, align: 64, offset: 512)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !937, line: 55, baseType: !1003)
!1003 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !971, file: !14, line: 3493, baseType: !955, size: 8, align: 8, offset: 576)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !971, file: !14, line: 3494, baseType: !1006, size: 64, align: 64, offset: 640)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !1010)
!1010 = !{!1011, !1012, !1016, !1037, !1038, !1039, !1040, !1044, !1050, !1052, !1056}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1009, file: !713, line: 72, baseType: !974, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1009, file: !713, line: 78, baseType: !1013, size: 64, align: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!974, !954}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1009, file: !713, line: 85, baseType: !1017, size: 64, align: 64, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1024, !1025, !1033, !1034, !1035, !1036}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1019, file: !691, line: 247, baseType: !974, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1019, file: !691, line: 253, baseType: !974, size: 64, align: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1019, file: !691, line: 259, baseType: !946, size: 32, align: 32, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1019, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1019, file: !691, line: 271, baseType: !1026, size: 64, align: 64, offset: 192)
!1026 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1019, file: !691, line: 265, size: 64, align: 64, elements: !1027)
!1027 = !{!1028, !1029, !1031, !1032}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1026, file: !691, line: 266, baseType: !965, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1026, file: !691, line: 267, baseType: !1030, size: 64, align: 64)
!1030 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1026, file: !691, line: 268, baseType: !974, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1026, file: !691, line: 270, baseType: !984, size: 64, align: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1019, file: !691, line: 272, baseType: !1030, size: 64, align: 64, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1019, file: !691, line: 273, baseType: !1030, size: 64, align: 64, offset: 320)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1019, file: !691, line: 275, baseType: !946, size: 32, align: 32, offset: 384)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1019, file: !691, line: 300, baseType: !974, size: 64, align: 64, offset: 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1009, file: !713, line: 93, baseType: !946, size: 32, align: 32, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1009, file: !713, line: 99, baseType: !946, size: 32, align: 32, offset: 224)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1009, file: !713, line: 108, baseType: !946, size: 32, align: 32, offset: 256)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1009, file: !713, line: 113, baseType: !1041, size: 64, align: 64, offset: 320)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!954, !954, !954}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1009, file: !713, line: 123, baseType: !1045, size: 64, align: 64, offset: 384)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!1048, !1048}
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1009, file: !713, line: 130, baseType: !1051, size: 32, align: 32, offset: 448)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1009, file: !713, line: 136, baseType: !1053, size: 64, align: 64, offset: 512)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!1051, !954}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1009, file: !713, line: 142, baseType: !1057, size: 64, align: 64, offset: 576)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!946, !1060, !954, !974, !946}
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1063)
!1063 = !{!1064, !1076, !1077}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1062, file: !691, line: 360, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1069)
!1069 = !{!1070, !1071, !1072, !1073, !1074, !1075}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1068, file: !691, line: 307, baseType: !974, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1068, file: !691, line: 313, baseType: !1030, size: 64, align: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1068, file: !691, line: 313, baseType: !1030, size: 64, align: 64, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1068, file: !691, line: 318, baseType: !1030, size: 64, align: 64, offset: 192)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1068, file: !691, line: 318, baseType: !1030, size: 64, align: 64, offset: 256)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1068, file: !691, line: 323, baseType: !946, size: 32, align: 32, offset: 320)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1062, file: !691, line: 364, baseType: !946, size: 32, align: 32, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1062, file: !691, line: 368, baseType: !946, size: 32, align: 32, offset: 96)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !971, file: !14, line: 3495, baseType: !1079, size: 64, align: 64, offset: 704)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1081)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1083)
!1083 = !{!1084, !1085}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1082, file: !14, line: 3402, baseType: !946, size: 32, align: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1082, file: !14, line: 3403, baseType: !974, size: 64, align: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !971, file: !14, line: 3507, baseType: !974, size: 64, align: 64, offset: 768)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !971, file: !14, line: 3516, baseType: !946, size: 32, align: 32, offset: 832)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !971, file: !14, line: 3517, baseType: !1089, size: 64, align: 64, offset: 896)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !971, file: !14, line: 3527, baseType: !1091, size: 64, align: 64, offset: 960)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!946, !1094}
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1096)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1097)
!1097 = !{!1098, !1099, !1100, !1101, !1104, !1105, !1106, !1107, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1384, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1573, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1096, file: !14, line: 1561, baseType: !1006, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1096, file: !14, line: 1562, baseType: !946, size: 32, align: 32, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1096, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1096, file: !14, line: 1565, baseType: !1102, size: 64, align: 64, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1096, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1096, file: !14, line: 1581, baseType: !947, size: 32, align: 32, offset: 224)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1096, file: !14, line: 1583, baseType: !954, size: 64, align: 64, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1096, file: !14, line: 1591, baseType: !1108, size: 64, align: 64, offset: 320)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1110, line: 129, size: 1664, align: 64, elements: !1111)
!1110 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1111 = !{!1112, !1113, !1114, !1115, !1210, !1231, !1232, !1261, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1109, file: !1110, line: 136, baseType: !946, size: 32, align: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1109, file: !1110, line: 151, baseType: !946, size: 32, align: 32, offset: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1109, file: !1110, line: 157, baseType: !946, size: 32, align: 32, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1109, file: !1110, line: 159, baseType: !1116, size: 64, align: 64, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1118)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1119)
!1119 = !{!1120, !1124, !1126, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1164, !1166, !1167, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1198, !1199, !1200, !1201, !1202, !1203, !1206, !1207, !1208, !1209}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1118, file: !744, line: 282, baseType: !1121, size: 512, align: 64)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 512, align: 64, elements: !1122)
!1122 = !{!1123}
!1123 = !DISubrange(count: 8)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1118, file: !744, line: 299, baseType: !1125, size: 256, align: 32, offset: 512)
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, size: 256, align: 32, elements: !1122)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1118, file: !744, line: 315, baseType: !1127, size: 64, align: 64, offset: 768)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1118, file: !744, line: 326, baseType: !946, size: 32, align: 32, offset: 832)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1118, file: !744, line: 326, baseType: !946, size: 32, align: 32, offset: 864)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1118, file: !744, line: 334, baseType: !946, size: 32, align: 32, offset: 896)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1118, file: !744, line: 341, baseType: !946, size: 32, align: 32, offset: 928)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1118, file: !744, line: 346, baseType: !946, size: 32, align: 32, offset: 960)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1118, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1118, file: !744, line: 356, baseType: !984, size: 64, align: 32, offset: 1024)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1118, file: !744, line: 361, baseType: !965, size: 64, align: 64, offset: 1088)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1118, file: !744, line: 369, baseType: !965, size: 64, align: 64, offset: 1152)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1118, file: !744, line: 377, baseType: !965, size: 64, align: 64, offset: 1216)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1118, file: !744, line: 382, baseType: !946, size: 32, align: 32, offset: 1280)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1118, file: !744, line: 386, baseType: !946, size: 32, align: 32, offset: 1312)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1118, file: !744, line: 391, baseType: !946, size: 32, align: 32, offset: 1344)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1118, file: !744, line: 396, baseType: !954, size: 64, align: 64, offset: 1408)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1118, file: !744, line: 403, baseType: !1143, size: 512, align: 64, offset: 1472)
!1143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1002, size: 512, align: 64, elements: !1122)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1118, file: !744, line: 410, baseType: !946, size: 32, align: 32, offset: 1984)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1118, file: !744, line: 415, baseType: !946, size: 32, align: 32, offset: 2016)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1118, file: !744, line: 420, baseType: !946, size: 32, align: 32, offset: 2048)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1118, file: !744, line: 425, baseType: !946, size: 32, align: 32, offset: 2080)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1118, file: !744, line: 435, baseType: !965, size: 64, align: 64, offset: 2112)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1118, file: !744, line: 440, baseType: !946, size: 32, align: 32, offset: 2176)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1118, file: !744, line: 445, baseType: !1002, size: 64, align: 64, offset: 2240)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1118, file: !744, line: 459, baseType: !1152, size: 512, align: 64, offset: 2304)
!1152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1153, size: 512, align: 64, elements: !1122)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1155, line: 94, baseType: !1156)
!1155 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1155, line: 81, size: 192, align: 64, elements: !1157)
!1157 = !{!1158, !1162, !1163}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1156, file: !1155, line: 82, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1155, line: 73, baseType: !1161)
!1161 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1155, line: 73, flags: DIFlagFwdDecl)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1156, file: !1155, line: 89, baseType: !964, size: 64, align: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1156, file: !1155, line: 93, baseType: !946, size: 32, align: 32, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1118, file: !744, line: 473, baseType: !1165, size: 64, align: 64, offset: 2816)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1118, file: !744, line: 477, baseType: !946, size: 32, align: 32, offset: 2880)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1118, file: !744, line: 479, baseType: !1168, size: 64, align: 64, offset: 2944)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1172)
!1172 = !{!1173, !1174, !1175, !1176, !1181}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1171, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1171, file: !744, line: 203, baseType: !964, size: 64, align: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1171, file: !744, line: 204, baseType: !946, size: 32, align: 32, offset: 128)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1171, file: !744, line: 205, baseType: !1177, size: 64, align: 64, offset: 192)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1179, line: 86, baseType: !1180)
!1179 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1180 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1179, line: 86, flags: DIFlagFwdDecl)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1171, file: !744, line: 206, baseType: !1153, size: 64, align: 64, offset: 256)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1118, file: !744, line: 480, baseType: !946, size: 32, align: 32, offset: 3008)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1118, file: !744, line: 505, baseType: !946, size: 32, align: 32, offset: 3040)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1118, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1118, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1118, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1118, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1118, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1118, file: !744, line: 532, baseType: !965, size: 64, align: 64, offset: 3264)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1118, file: !744, line: 539, baseType: !965, size: 64, align: 64, offset: 3328)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1118, file: !744, line: 547, baseType: !965, size: 64, align: 64, offset: 3392)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1118, file: !744, line: 554, baseType: !1177, size: 64, align: 64, offset: 3456)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1118, file: !744, line: 563, baseType: !946, size: 32, align: 32, offset: 3520)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1118, file: !744, line: 572, baseType: !946, size: 32, align: 32, offset: 3552)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1118, file: !744, line: 581, baseType: !946, size: 32, align: 32, offset: 3584)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1118, file: !744, line: 588, baseType: !1197, size: 64, align: 64, offset: 3648)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1118, file: !744, line: 593, baseType: !946, size: 32, align: 32, offset: 3712)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1118, file: !744, line: 596, baseType: !946, size: 32, align: 32, offset: 3744)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1118, file: !744, line: 599, baseType: !1153, size: 64, align: 64, offset: 3776)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1118, file: !744, line: 605, baseType: !1153, size: 64, align: 64, offset: 3840)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1118, file: !744, line: 616, baseType: !1153, size: 64, align: 64, offset: 3904)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1118, file: !744, line: 626, baseType: !1204, size: 64, align: 64, offset: 3968)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1205, line: 216, baseType: !1003)
!1205 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1118, file: !744, line: 627, baseType: !1204, size: 64, align: 64, offset: 4032)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1118, file: !744, line: 628, baseType: !1204, size: 64, align: 64, offset: 4096)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1118, file: !744, line: 629, baseType: !1204, size: 64, align: 64, offset: 4160)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1118, file: !744, line: 645, baseType: !1153, size: 64, align: 64, offset: 4224)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1109, file: !1110, line: 161, baseType: !1211, size: 64, align: 64, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1110, line: 117, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1110, line: 100, size: 832, align: 64, elements: !1214)
!1214 = !{!1215, !1222, !1223, !1224, !1225, !1226, !1228, !1229, !1230}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1213, file: !1110, line: 105, baseType: !1216, size: 256, align: 64)
!1216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1217, size: 256, align: 64, elements: !1220)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1155, line: 238, baseType: !1219)
!1219 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1155, line: 238, flags: DIFlagFwdDecl)
!1220 = !{!1221}
!1221 = !DISubrange(count: 4)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1213, file: !1110, line: 110, baseType: !946, size: 32, align: 32, offset: 256)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1213, file: !1110, line: 111, baseType: !946, size: 32, align: 32, offset: 288)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1213, file: !1110, line: 111, baseType: !946, size: 32, align: 32, offset: 320)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1213, file: !1110, line: 112, baseType: !1125, size: 256, align: 32, offset: 352)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1213, file: !1110, line: 113, baseType: !1227, size: 128, align: 32, offset: 608)
!1227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, size: 128, align: 32, elements: !1220)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1213, file: !1110, line: 114, baseType: !946, size: 32, align: 32, offset: 736)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1213, file: !1110, line: 115, baseType: !946, size: 32, align: 32, offset: 768)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1213, file: !1110, line: 116, baseType: !946, size: 32, align: 32, offset: 800)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1109, file: !1110, line: 163, baseType: !954, size: 64, align: 64, offset: 256)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1109, file: !1110, line: 165, baseType: !1233, size: 128, align: 64, offset: 320)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1110, line: 122, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1110, line: 119, size: 128, align: 64, elements: !1235)
!1235 = !{!1236, !1260}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1234, file: !1110, line: 120, baseType: !1237, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1240)
!1240 = !{!1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1256, !1257, !1258, !1259}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1239, file: !14, line: 1451, baseType: !1153, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1239, file: !14, line: 1461, baseType: !965, size: 64, align: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1239, file: !14, line: 1467, baseType: !965, size: 64, align: 64, offset: 128)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1239, file: !14, line: 1468, baseType: !964, size: 64, align: 64, offset: 192)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1239, file: !14, line: 1469, baseType: !946, size: 32, align: 32, offset: 256)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1239, file: !14, line: 1470, baseType: !946, size: 32, align: 32, offset: 288)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1239, file: !14, line: 1474, baseType: !946, size: 32, align: 32, offset: 320)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1239, file: !14, line: 1479, baseType: !1249, size: 64, align: 64, offset: 384)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1252)
!1252 = !{!1253, !1254, !1255}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1251, file: !14, line: 1412, baseType: !964, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1251, file: !14, line: 1413, baseType: !946, size: 32, align: 32, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1251, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1239, file: !14, line: 1480, baseType: !946, size: 32, align: 32, offset: 448)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1239, file: !14, line: 1486, baseType: !965, size: 64, align: 64, offset: 512)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1239, file: !14, line: 1488, baseType: !965, size: 64, align: 64, offset: 576)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1239, file: !14, line: 1497, baseType: !965, size: 64, align: 64, offset: 640)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1234, file: !1110, line: 121, baseType: !1116, size: 64, align: 64, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1109, file: !1110, line: 166, baseType: !1262, size: 128, align: 64, offset: 448)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1110, line: 127, baseType: !1263)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1110, line: 124, size: 128, align: 64, elements: !1264)
!1264 = !{!1265, !1338}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1263, file: !1110, line: 125, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1269)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1270)
!1270 = !{!1271, !1272, !1296, !1300, !1301, !1335, !1336, !1337}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1269, file: !14, line: 5751, baseType: !1006, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1269, file: !14, line: 5756, baseType: !1273, size: 64, align: 64, offset: 64)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1275)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1276)
!1276 = !{!1277, !1278, !1281, !1282, !1283, !1287, !1291, !1295}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1275, file: !14, line: 5797, baseType: !974, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1275, file: !14, line: 5804, baseType: !1279, size: 64, align: 64, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1275, file: !14, line: 5815, baseType: !1006, size: 64, align: 64, offset: 128)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1275, file: !14, line: 5825, baseType: !946, size: 32, align: 32, offset: 192)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1275, file: !14, line: 5826, baseType: !1284, size: 64, align: 64, offset: 256)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!946, !1267}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1275, file: !14, line: 5827, baseType: !1288, size: 64, align: 64, offset: 320)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{!946, !1267, !1237}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1275, file: !14, line: 5828, baseType: !1292, size: 64, align: 64, offset: 384)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{null, !1267}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1275, file: !14, line: 5829, baseType: !1292, size: 64, align: 64, offset: 448)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1269, file: !14, line: 5762, baseType: !1297, size: 64, align: 64, offset: 128)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1299)
!1299 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1269, file: !14, line: 5768, baseType: !954, size: 64, align: 64, offset: 192)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1269, file: !14, line: 5775, baseType: !1302, size: 64, align: 64, offset: 256)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1304)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1305)
!1305 = !{!1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1304, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1304, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1304, file: !14, line: 3948, baseType: !953, size: 32, align: 32, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1304, file: !14, line: 3958, baseType: !964, size: 64, align: 64, offset: 128)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1304, file: !14, line: 3962, baseType: !946, size: 32, align: 32, offset: 192)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1304, file: !14, line: 3968, baseType: !946, size: 32, align: 32, offset: 224)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1304, file: !14, line: 3973, baseType: !965, size: 64, align: 64, offset: 256)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1304, file: !14, line: 3986, baseType: !946, size: 32, align: 32, offset: 320)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1304, file: !14, line: 3999, baseType: !946, size: 32, align: 32, offset: 352)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1304, file: !14, line: 4004, baseType: !946, size: 32, align: 32, offset: 384)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1304, file: !14, line: 4005, baseType: !946, size: 32, align: 32, offset: 416)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1304, file: !14, line: 4010, baseType: !946, size: 32, align: 32, offset: 448)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1304, file: !14, line: 4011, baseType: !946, size: 32, align: 32, offset: 480)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1304, file: !14, line: 4020, baseType: !984, size: 64, align: 32, offset: 512)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1304, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1304, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1304, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1304, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1304, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1304, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1304, file: !14, line: 4039, baseType: !946, size: 32, align: 32, offset: 768)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1304, file: !14, line: 4046, baseType: !1002, size: 64, align: 64, offset: 832)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1304, file: !14, line: 4050, baseType: !946, size: 32, align: 32, offset: 896)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1304, file: !14, line: 4054, baseType: !946, size: 32, align: 32, offset: 928)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1304, file: !14, line: 4061, baseType: !946, size: 32, align: 32, offset: 960)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1304, file: !14, line: 4065, baseType: !946, size: 32, align: 32, offset: 992)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1304, file: !14, line: 4073, baseType: !946, size: 32, align: 32, offset: 1024)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1304, file: !14, line: 4080, baseType: !946, size: 32, align: 32, offset: 1056)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1304, file: !14, line: 4084, baseType: !946, size: 32, align: 32, offset: 1088)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1269, file: !14, line: 5781, baseType: !1302, size: 64, align: 64, offset: 320)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1269, file: !14, line: 5787, baseType: !984, size: 64, align: 32, offset: 384)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1269, file: !14, line: 5793, baseType: !984, size: 64, align: 32, offset: 448)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1263, file: !1110, line: 126, baseType: !946, size: 32, align: 32, offset: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1109, file: !1110, line: 172, baseType: !1237, size: 64, align: 64, offset: 576)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1109, file: !1110, line: 177, baseType: !964, size: 64, align: 64, offset: 640)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1109, file: !1110, line: 178, baseType: !947, size: 32, align: 32, offset: 704)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1109, file: !1110, line: 180, baseType: !954, size: 64, align: 64, offset: 768)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1109, file: !1110, line: 185, baseType: !946, size: 32, align: 32, offset: 832)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1109, file: !1110, line: 190, baseType: !954, size: 64, align: 64, offset: 896)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1109, file: !1110, line: 195, baseType: !946, size: 32, align: 32, offset: 960)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1109, file: !1110, line: 200, baseType: !1237, size: 64, align: 64, offset: 1024)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1109, file: !1110, line: 201, baseType: !946, size: 32, align: 32, offset: 1088)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1109, file: !1110, line: 202, baseType: !1116, size: 64, align: 64, offset: 1152)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1109, file: !1110, line: 203, baseType: !946, size: 32, align: 32, offset: 1216)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1109, file: !1110, line: 205, baseType: !946, size: 32, align: 32, offset: 1248)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1109, file: !1110, line: 206, baseType: !946, size: 32, align: 32, offset: 1280)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1109, file: !1110, line: 209, baseType: !1204, size: 64, align: 64, offset: 1344)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1109, file: !1110, line: 212, baseType: !1204, size: 64, align: 64, offset: 1408)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1109, file: !1110, line: 213, baseType: !1116, size: 64, align: 64, offset: 1472)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1109, file: !1110, line: 215, baseType: !946, size: 32, align: 32, offset: 1536)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1109, file: !1110, line: 217, baseType: !946, size: 32, align: 32, offset: 1568)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1109, file: !1110, line: 220, baseType: !946, size: 32, align: 32, offset: 1600)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1096, file: !14, line: 1598, baseType: !954, size: 64, align: 64, offset: 384)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1096, file: !14, line: 1606, baseType: !965, size: 64, align: 64, offset: 448)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1096, file: !14, line: 1614, baseType: !946, size: 32, align: 32, offset: 512)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1096, file: !14, line: 1622, baseType: !946, size: 32, align: 32, offset: 544)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1096, file: !14, line: 1628, baseType: !946, size: 32, align: 32, offset: 576)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1096, file: !14, line: 1636, baseType: !946, size: 32, align: 32, offset: 608)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1096, file: !14, line: 1643, baseType: !946, size: 32, align: 32, offset: 640)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1096, file: !14, line: 1657, baseType: !964, size: 64, align: 64, offset: 704)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1096, file: !14, line: 1658, baseType: !946, size: 32, align: 32, offset: 768)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1096, file: !14, line: 1679, baseType: !984, size: 64, align: 32, offset: 800)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1096, file: !14, line: 1688, baseType: !946, size: 32, align: 32, offset: 864)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1096, file: !14, line: 1712, baseType: !946, size: 32, align: 32, offset: 896)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1096, file: !14, line: 1729, baseType: !946, size: 32, align: 32, offset: 928)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1096, file: !14, line: 1729, baseType: !946, size: 32, align: 32, offset: 960)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1096, file: !14, line: 1744, baseType: !946, size: 32, align: 32, offset: 992)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1096, file: !14, line: 1744, baseType: !946, size: 32, align: 32, offset: 1024)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1096, file: !14, line: 1751, baseType: !946, size: 32, align: 32, offset: 1056)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1096, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1096, file: !14, line: 1791, baseType: !1377, size: 64, align: 64, offset: 1152)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DISubroutineType(types: !1379)
!1379 = !{null, !1380, !1381, !1383, !946, !946, !946}
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1117)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1096, file: !14, line: 1808, baseType: !1385, size: 64, align: 64, offset: 1216)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DISubroutineType(types: !1387)
!1387 = !{!473, !1380, !991}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1096, file: !14, line: 1816, baseType: !946, size: 32, align: 32, offset: 1280)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1096, file: !14, line: 1825, baseType: !957, size: 32, align: 32, offset: 1312)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1096, file: !14, line: 1830, baseType: !946, size: 32, align: 32, offset: 1344)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1096, file: !14, line: 1838, baseType: !957, size: 32, align: 32, offset: 1376)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1096, file: !14, line: 1846, baseType: !946, size: 32, align: 32, offset: 1408)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1096, file: !14, line: 1851, baseType: !946, size: 32, align: 32, offset: 1440)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1096, file: !14, line: 1861, baseType: !957, size: 32, align: 32, offset: 1472)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1096, file: !14, line: 1868, baseType: !957, size: 32, align: 32, offset: 1504)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1096, file: !14, line: 1875, baseType: !957, size: 32, align: 32, offset: 1536)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1096, file: !14, line: 1882, baseType: !957, size: 32, align: 32, offset: 1568)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1096, file: !14, line: 1889, baseType: !957, size: 32, align: 32, offset: 1600)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1096, file: !14, line: 1896, baseType: !957, size: 32, align: 32, offset: 1632)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1096, file: !14, line: 1903, baseType: !957, size: 32, align: 32, offset: 1664)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1096, file: !14, line: 1910, baseType: !946, size: 32, align: 32, offset: 1696)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1096, file: !14, line: 1915, baseType: !946, size: 32, align: 32, offset: 1728)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1096, file: !14, line: 1926, baseType: !1383, size: 64, align: 64, offset: 1792)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1096, file: !14, line: 1935, baseType: !984, size: 64, align: 32, offset: 1856)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1096, file: !14, line: 1942, baseType: !946, size: 32, align: 32, offset: 1920)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1096, file: !14, line: 1948, baseType: !946, size: 32, align: 32, offset: 1952)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1096, file: !14, line: 1954, baseType: !946, size: 32, align: 32, offset: 1984)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1096, file: !14, line: 1960, baseType: !946, size: 32, align: 32, offset: 2016)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1096, file: !14, line: 1984, baseType: !946, size: 32, align: 32, offset: 2048)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1096, file: !14, line: 1991, baseType: !946, size: 32, align: 32, offset: 2080)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1096, file: !14, line: 1996, baseType: !946, size: 32, align: 32, offset: 2112)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1096, file: !14, line: 2004, baseType: !946, size: 32, align: 32, offset: 2144)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1096, file: !14, line: 2011, baseType: !946, size: 32, align: 32, offset: 2176)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1096, file: !14, line: 2018, baseType: !946, size: 32, align: 32, offset: 2208)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1096, file: !14, line: 2027, baseType: !946, size: 32, align: 32, offset: 2240)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1096, file: !14, line: 2034, baseType: !946, size: 32, align: 32, offset: 2272)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1096, file: !14, line: 2044, baseType: !946, size: 32, align: 32, offset: 2304)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1096, file: !14, line: 2054, baseType: !1419, size: 64, align: 64, offset: 2368)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1096, file: !14, line: 2061, baseType: !1419, size: 64, align: 64, offset: 2432)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1096, file: !14, line: 2066, baseType: !946, size: 32, align: 32, offset: 2496)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1096, file: !14, line: 2070, baseType: !946, size: 32, align: 32, offset: 2528)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1096, file: !14, line: 2078, baseType: !946, size: 32, align: 32, offset: 2560)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1096, file: !14, line: 2085, baseType: !946, size: 32, align: 32, offset: 2592)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1096, file: !14, line: 2092, baseType: !946, size: 32, align: 32, offset: 2624)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1096, file: !14, line: 2099, baseType: !946, size: 32, align: 32, offset: 2656)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1096, file: !14, line: 2106, baseType: !946, size: 32, align: 32, offset: 2688)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1096, file: !14, line: 2113, baseType: !946, size: 32, align: 32, offset: 2720)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1096, file: !14, line: 2120, baseType: !946, size: 32, align: 32, offset: 2752)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1096, file: !14, line: 2125, baseType: !946, size: 32, align: 32, offset: 2784)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1096, file: !14, line: 2133, baseType: !946, size: 32, align: 32, offset: 2816)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1096, file: !14, line: 2140, baseType: !946, size: 32, align: 32, offset: 2848)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1096, file: !14, line: 2145, baseType: !946, size: 32, align: 32, offset: 2880)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1096, file: !14, line: 2153, baseType: !946, size: 32, align: 32, offset: 2912)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1096, file: !14, line: 2158, baseType: !946, size: 32, align: 32, offset: 2944)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1096, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1096, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1096, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1096, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1096, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1096, file: !14, line: 2203, baseType: !946, size: 32, align: 32, offset: 3136)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1096, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1096, file: !14, line: 2212, baseType: !946, size: 32, align: 32, offset: 3200)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1096, file: !14, line: 2213, baseType: !946, size: 32, align: 32, offset: 3232)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1096, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1096, file: !14, line: 2232, baseType: !946, size: 32, align: 32, offset: 3296)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1096, file: !14, line: 2243, baseType: !946, size: 32, align: 32, offset: 3328)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1096, file: !14, line: 2249, baseType: !946, size: 32, align: 32, offset: 3360)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1096, file: !14, line: 2256, baseType: !946, size: 32, align: 32, offset: 3392)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1096, file: !14, line: 2263, baseType: !1002, size: 64, align: 64, offset: 3456)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1096, file: !14, line: 2270, baseType: !1002, size: 64, align: 64, offset: 3520)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1096, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1096, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1096, file: !14, line: 2367, baseType: !1455, size: 64, align: 64, offset: 3648)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{!946, !1380, !1116, !946}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1096, file: !14, line: 2383, baseType: !946, size: 32, align: 32, offset: 3712)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1096, file: !14, line: 2386, baseType: !957, size: 32, align: 32, offset: 3744)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1096, file: !14, line: 2387, baseType: !957, size: 32, align: 32, offset: 3776)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1096, file: !14, line: 2394, baseType: !946, size: 32, align: 32, offset: 3808)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1096, file: !14, line: 2401, baseType: !946, size: 32, align: 32, offset: 3840)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1096, file: !14, line: 2408, baseType: !946, size: 32, align: 32, offset: 3872)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1096, file: !14, line: 2415, baseType: !946, size: 32, align: 32, offset: 3904)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1096, file: !14, line: 2422, baseType: !946, size: 32, align: 32, offset: 3936)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1096, file: !14, line: 2423, baseType: !1467, size: 64, align: 64, offset: 3968)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1469)
!1469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1470)
!1470 = !{!1471, !1472, !1473, !1474}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1469, file: !14, line: 827, baseType: !946, size: 32, align: 32)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1469, file: !14, line: 828, baseType: !946, size: 32, align: 32, offset: 32)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1469, file: !14, line: 829, baseType: !946, size: 32, align: 32, offset: 64)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1469, file: !14, line: 830, baseType: !957, size: 32, align: 32, offset: 96)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1096, file: !14, line: 2430, baseType: !965, size: 64, align: 64, offset: 4032)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1096, file: !14, line: 2437, baseType: !965, size: 64, align: 64, offset: 4096)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1096, file: !14, line: 2444, baseType: !957, size: 32, align: 32, offset: 4160)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1096, file: !14, line: 2451, baseType: !957, size: 32, align: 32, offset: 4192)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1096, file: !14, line: 2458, baseType: !946, size: 32, align: 32, offset: 4224)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1096, file: !14, line: 2469, baseType: !946, size: 32, align: 32, offset: 4256)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1096, file: !14, line: 2475, baseType: !946, size: 32, align: 32, offset: 4288)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1096, file: !14, line: 2481, baseType: !946, size: 32, align: 32, offset: 4320)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1096, file: !14, line: 2485, baseType: !946, size: 32, align: 32, offset: 4352)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1096, file: !14, line: 2489, baseType: !946, size: 32, align: 32, offset: 4384)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1096, file: !14, line: 2493, baseType: !946, size: 32, align: 32, offset: 4416)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1096, file: !14, line: 2501, baseType: !946, size: 32, align: 32, offset: 4448)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1096, file: !14, line: 2506, baseType: !946, size: 32, align: 32, offset: 4480)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1096, file: !14, line: 2510, baseType: !946, size: 32, align: 32, offset: 4512)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1096, file: !14, line: 2514, baseType: !965, size: 64, align: 64, offset: 4544)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1096, file: !14, line: 2528, baseType: !1491, size: 64, align: 64, offset: 4608)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{null, !1380, !954, !946, !946}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1096, file: !14, line: 2534, baseType: !946, size: 32, align: 32, offset: 4672)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1096, file: !14, line: 2545, baseType: !946, size: 32, align: 32, offset: 4704)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1096, file: !14, line: 2547, baseType: !946, size: 32, align: 32, offset: 4736)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1096, file: !14, line: 2549, baseType: !946, size: 32, align: 32, offset: 4768)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1096, file: !14, line: 2551, baseType: !946, size: 32, align: 32, offset: 4800)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1096, file: !14, line: 2553, baseType: !946, size: 32, align: 32, offset: 4832)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1096, file: !14, line: 2555, baseType: !946, size: 32, align: 32, offset: 4864)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1096, file: !14, line: 2557, baseType: !946, size: 32, align: 32, offset: 4896)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1096, file: !14, line: 2559, baseType: !946, size: 32, align: 32, offset: 4928)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1096, file: !14, line: 2563, baseType: !946, size: 32, align: 32, offset: 4960)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1096, file: !14, line: 2571, baseType: !1505, size: 64, align: 64, offset: 4992)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1096, file: !14, line: 2579, baseType: !1505, size: 64, align: 64, offset: 5056)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1096, file: !14, line: 2586, baseType: !946, size: 32, align: 32, offset: 5120)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1096, file: !14, line: 2615, baseType: !946, size: 32, align: 32, offset: 5152)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1096, file: !14, line: 2627, baseType: !946, size: 32, align: 32, offset: 5184)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1096, file: !14, line: 2637, baseType: !946, size: 32, align: 32, offset: 5216)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1096, file: !14, line: 2681, baseType: !946, size: 32, align: 32, offset: 5248)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1096, file: !14, line: 2709, baseType: !965, size: 64, align: 64, offset: 5312)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1096, file: !14, line: 2716, baseType: !1514, size: 64, align: 64, offset: 5376)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1516)
!1516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1517)
!1517 = !{!1518, !1519, !1520, !1521, !1522, !1523, !1527, !1533, !1537, !1538, !1539, !1540, !1546, !1547, !1548, !1549, !1550}
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1516, file: !14, line: 3642, baseType: !974, size: 64, align: 64)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1516, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1516, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1516, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1516, file: !14, line: 3669, baseType: !946, size: 32, align: 32, offset: 160)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1516, file: !14, line: 3682, baseType: !1524, size: 64, align: 64, offset: 192)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DISubroutineType(types: !1526)
!1526 = !{!946, !1094, !1116}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1516, file: !14, line: 3698, baseType: !1528, size: 64, align: 64, offset: 256)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DISubroutineType(types: !1530)
!1530 = !{!946, !1094, !1531, !953}
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1516, file: !14, line: 3712, baseType: !1534, size: 64, align: 64, offset: 320)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{!946, !1094, !946, !1531, !953}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1516, file: !14, line: 3726, baseType: !1528, size: 64, align: 64, offset: 384)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1516, file: !14, line: 3737, baseType: !1091, size: 64, align: 64, offset: 448)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1516, file: !14, line: 3746, baseType: !946, size: 32, align: 32, offset: 512)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1516, file: !14, line: 3757, baseType: !1541, size: 64, align: 64, offset: 576)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{null, !1544}
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1516, file: !14, line: 3766, baseType: !1091, size: 64, align: 64, offset: 640)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1516, file: !14, line: 3774, baseType: !1091, size: 64, align: 64, offset: 704)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1516, file: !14, line: 3780, baseType: !946, size: 32, align: 32, offset: 768)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1516, file: !14, line: 3785, baseType: !946, size: 32, align: 32, offset: 800)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1516, file: !14, line: 3795, baseType: !1551, size: 64, align: 64, offset: 832)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1552, size: 64, align: 64)
!1552 = !DISubroutineType(types: !1553)
!1553 = !{!946, !1094, !1153}
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1096, file: !14, line: 2728, baseType: !954, size: 64, align: 64, offset: 5440)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1096, file: !14, line: 2735, baseType: !1143, size: 512, align: 64, offset: 5504)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1096, file: !14, line: 2742, baseType: !946, size: 32, align: 32, offset: 6016)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1096, file: !14, line: 2755, baseType: !946, size: 32, align: 32, offset: 6048)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1096, file: !14, line: 2776, baseType: !946, size: 32, align: 32, offset: 6080)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1096, file: !14, line: 2783, baseType: !946, size: 32, align: 32, offset: 6112)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1096, file: !14, line: 2791, baseType: !946, size: 32, align: 32, offset: 6144)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1096, file: !14, line: 2802, baseType: !1116, size: 64, align: 64, offset: 6208)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1096, file: !14, line: 2811, baseType: !946, size: 32, align: 32, offset: 6272)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1096, file: !14, line: 2821, baseType: !946, size: 32, align: 32, offset: 6304)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1096, file: !14, line: 2830, baseType: !946, size: 32, align: 32, offset: 6336)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1096, file: !14, line: 2840, baseType: !946, size: 32, align: 32, offset: 6368)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1096, file: !14, line: 2851, baseType: !1567, size: 64, align: 64, offset: 6400)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DISubroutineType(types: !1569)
!1569 = !{!946, !1380, !1570, !954, !1383, !946, !946}
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DISubroutineType(types: !1572)
!1572 = !{!946, !1380, !954}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1096, file: !14, line: 2871, baseType: !1574, size: 64, align: 64, offset: 6464)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DISubroutineType(types: !1576)
!1576 = !{!946, !1380, !1577, !954, !1383, !946}
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64, align: 64)
!1578 = !DISubroutineType(types: !1579)
!1579 = !{!946, !1380, !954, !946, !946}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1096, file: !14, line: 2878, baseType: !946, size: 32, align: 32, offset: 6528)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1096, file: !14, line: 2885, baseType: !946, size: 32, align: 32, offset: 6560)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1096, file: !14, line: 3005, baseType: !946, size: 32, align: 32, offset: 6592)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1096, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1096, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1096, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1096, file: !14, line: 3037, baseType: !964, size: 64, align: 64, offset: 6720)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1096, file: !14, line: 3038, baseType: !946, size: 32, align: 32, offset: 6784)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1096, file: !14, line: 3050, baseType: !1002, size: 64, align: 64, offset: 6848)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1096, file: !14, line: 3065, baseType: !946, size: 32, align: 32, offset: 6912)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1096, file: !14, line: 3083, baseType: !946, size: 32, align: 32, offset: 6944)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1096, file: !14, line: 3092, baseType: !984, size: 64, align: 32, offset: 6976)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1096, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1096, file: !14, line: 3106, baseType: !984, size: 64, align: 32, offset: 7072)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1096, file: !14, line: 3113, baseType: !1595, size: 64, align: 64, offset: 7168)
!1595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1596, size: 64, align: 64)
!1596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1597)
!1597 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1598)
!1598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1599)
!1599 = !{!1600, !1601, !1602, !1603, !1604, !1605, !1608}
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1598, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1598, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1598, file: !14, line: 720, baseType: !974, size: 64, align: 64, offset: 64)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1598, file: !14, line: 724, baseType: !974, size: 64, align: 64, offset: 128)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1598, file: !14, line: 728, baseType: !946, size: 32, align: 32, offset: 192)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1598, file: !14, line: 734, baseType: !1606, size: 64, align: 64, offset: 256)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1598, file: !14, line: 739, baseType: !1609, size: 64, align: 64, offset: 320)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1082)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1096, file: !14, line: 3129, baseType: !965, size: 64, align: 64, offset: 7232)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1096, file: !14, line: 3130, baseType: !965, size: 64, align: 64, offset: 7296)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1096, file: !14, line: 3131, baseType: !965, size: 64, align: 64, offset: 7360)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1096, file: !14, line: 3132, baseType: !965, size: 64, align: 64, offset: 7424)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1096, file: !14, line: 3139, baseType: !1505, size: 64, align: 64, offset: 7488)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1096, file: !14, line: 3147, baseType: !946, size: 32, align: 32, offset: 7552)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1096, file: !14, line: 3165, baseType: !946, size: 32, align: 32, offset: 7584)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1096, file: !14, line: 3172, baseType: !946, size: 32, align: 32, offset: 7616)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1096, file: !14, line: 3180, baseType: !946, size: 32, align: 32, offset: 7648)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1096, file: !14, line: 3191, baseType: !1419, size: 64, align: 64, offset: 7680)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1096, file: !14, line: 3199, baseType: !964, size: 64, align: 64, offset: 7744)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1096, file: !14, line: 3207, baseType: !1505, size: 64, align: 64, offset: 7808)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1096, file: !14, line: 3214, baseType: !947, size: 32, align: 32, offset: 7872)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1096, file: !14, line: 3224, baseType: !1249, size: 64, align: 64, offset: 7936)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1096, file: !14, line: 3225, baseType: !946, size: 32, align: 32, offset: 8000)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1096, file: !14, line: 3249, baseType: !1153, size: 64, align: 64, offset: 8064)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1096, file: !14, line: 3256, baseType: !946, size: 32, align: 32, offset: 8128)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1096, file: !14, line: 3271, baseType: !946, size: 32, align: 32, offset: 8160)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1096, file: !14, line: 3279, baseType: !965, size: 64, align: 64, offset: 8192)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1096, file: !14, line: 3301, baseType: !1153, size: 64, align: 64, offset: 8256)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1096, file: !14, line: 3310, baseType: !946, size: 32, align: 32, offset: 8320)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1096, file: !14, line: 3337, baseType: !946, size: 32, align: 32, offset: 8352)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1096, file: !14, line: 3351, baseType: !946, size: 32, align: 32, offset: 8384)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1096, file: !14, line: 3359, baseType: !946, size: 32, align: 32, offset: 8416)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !971, file: !14, line: 3535, baseType: !1636, size: 64, align: 64, offset: 1024)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DISubroutineType(types: !1638)
!1638 = !{!946, !1094, !1639}
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1095)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !971, file: !14, line: 3541, baseType: !1642, size: 64, align: 64, offset: 1088)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1644)
!1644 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1645)
!1645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1110, line: 223, size: 128, align: 64, elements: !1646)
!1646 = !{!1647, !1648}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1645, file: !1110, line: 224, baseType: !1531, size: 64, align: 64)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1645, file: !1110, line: 225, baseType: !1531, size: 64, align: 64, offset: 64)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !971, file: !14, line: 3549, baseType: !1650, size: 64, align: 64, offset: 1152)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DISubroutineType(types: !1652)
!1652 = !{null, !1089}
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !971, file: !14, line: 3551, baseType: !1091, size: 64, align: 64, offset: 1216)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !971, file: !14, line: 3552, baseType: !1655, size: 64, align: 64, offset: 1280)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DISubroutineType(types: !1657)
!1657 = !{!946, !1094, !964, !946, !1658}
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1660)
!1660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1661)
!1661 = !{!1662, !1663, !1664, !1665, !1666, !1690}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1660, file: !14, line: 3921, baseType: !962, size: 16, align: 16)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1660, file: !14, line: 3922, baseType: !953, size: 32, align: 32, offset: 32)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1660, file: !14, line: 3923, baseType: !953, size: 32, align: 32, offset: 64)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1660, file: !14, line: 3924, baseType: !947, size: 32, align: 32, offset: 96)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1660, file: !14, line: 3925, baseType: !1667, size: 64, align: 64, offset: 128)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1670)
!1670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1671)
!1671 = !{!1672, !1673, !1674, !1675, !1676, !1677, !1683, !1685, !1686, !1687, !1688, !1689}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1670, file: !14, line: 3886, baseType: !946, size: 32, align: 32)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1670, file: !14, line: 3887, baseType: !946, size: 32, align: 32, offset: 32)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1670, file: !14, line: 3888, baseType: !946, size: 32, align: 32, offset: 64)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1670, file: !14, line: 3889, baseType: !946, size: 32, align: 32, offset: 96)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1670, file: !14, line: 3890, baseType: !946, size: 32, align: 32, offset: 128)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1670, file: !14, line: 3897, baseType: !1678, size: 768, align: 64, offset: 192)
!1678 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1679)
!1679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1680)
!1680 = !{!1681, !1682}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1679, file: !14, line: 3855, baseType: !1121, size: 512, align: 64)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1679, file: !14, line: 3857, baseType: !1125, size: 256, align: 32, offset: 512)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1670, file: !14, line: 3903, baseType: !1684, size: 256, align: 64, offset: 960)
!1684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 256, align: 64, elements: !1220)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1670, file: !14, line: 3904, baseType: !1227, size: 128, align: 32, offset: 1216)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1670, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1670, file: !14, line: 3908, baseType: !1505, size: 64, align: 64, offset: 1408)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1670, file: !14, line: 3915, baseType: !1505, size: 64, align: 64, offset: 1472)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1670, file: !14, line: 3917, baseType: !946, size: 32, align: 32, offset: 1536)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1660, file: !14, line: 3926, baseType: !965, size: 64, align: 64, offset: 192)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !971, file: !14, line: 3564, baseType: !1692, size: 64, align: 64, offset: 1344)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DISubroutineType(types: !1694)
!1694 = !{!946, !1094, !1237, !1381, !1383}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !971, file: !14, line: 3566, baseType: !1696, size: 64, align: 64, offset: 1408)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{!946, !1094, !954, !1383, !1237}
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !971, file: !14, line: 3567, baseType: !1091, size: 64, align: 64, offset: 1472)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !971, file: !14, line: 3576, baseType: !1701, size: 64, align: 64, offset: 1536)
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64, align: 64)
!1702 = !DISubroutineType(types: !1703)
!1703 = !{!946, !1094, !1381}
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !971, file: !14, line: 3577, baseType: !1705, size: 64, align: 64, offset: 1600)
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64, align: 64)
!1706 = !DISubroutineType(types: !1707)
!1707 = !{!946, !1094, !1237}
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !971, file: !14, line: 3584, baseType: !1524, size: 64, align: 64, offset: 1664)
