; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--matroskaenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--matroskaenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!990 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_ROW_INTERLEAVED_LR", value: 7)
!991 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_COL_INTERLEAVED_RL", value: 8)
!992 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_COL_INTERLEAVED_LR", value: 9)
!993 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_ANAGLYPH_CYAN_RED", value: 10)
!994 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_RIGHT_LEFT", value: 11)
!995 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_ANAGLYPH_GREEN_MAG", value: 12)
!996 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_BOTH_EYES_BLOCK_LR", value: 13)
!997 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_BOTH_EYES_BLOCK_RL", value: 14)
!998 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_NB", value: 15)
!999 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStereo3DType", file: !1000, line: 51, size: 32, align: 32, elements: !1001)
!1000 = !DIFile(filename: "./libavutil/stereo3d.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009}
!1002 = !DIEnumerator(name: "AV_STEREO3D_2D", value: 0)
!1003 = !DIEnumerator(name: "AV_STEREO3D_SIDEBYSIDE", value: 1)
!1004 = !DIEnumerator(name: "AV_STEREO3D_TOPBOTTOM", value: 2)
!1005 = !DIEnumerator(name: "AV_STEREO3D_FRAMESEQUENCE", value: 3)
!1006 = !DIEnumerator(name: "AV_STEREO3D_CHECKERBOARD", value: 4)
!1007 = !DIEnumerator(name: "AV_STEREO3D_SIDEBYSIDE_QUINCUNX", value: 5)
!1008 = !DIEnumerator(name: "AV_STEREO3D_LINES", value: 6)
!1009 = !DIEnumerator(name: "AV_STEREO3D_COLUMNS", value: 7)
!1010 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStereo3DView", file: !1000, line: 147, size: 32, align: 32, elements: !1011)
!1011 = !{!1012, !1013, !1014}
!1012 = !DIEnumerator(name: "AV_STEREO3D_VIEW_PACKED", value: 0)
!1013 = !DIEnumerator(name: "AV_STEREO3D_VIEW_LEFT", value: 1)
!1014 = !DIEnumerator(name: "AV_STEREO3D_VIEW_RIGHT", value: 2)
!1015 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSphericalProjection", file: !1016, line: 51, size: 32, align: 32, elements: !1017)
!1016 = !DIFile(filename: "./libavutil/spherical.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1017 = !{!1018, !1019, !1020}
!1018 = !DIEnumerator(name: "AV_SPHERICAL_EQUIRECTANGULAR", value: 0)
!1019 = !DIEnumerator(name: "AV_SPHERICAL_CUBEMAP", value: 1)
!1020 = !DIEnumerator(name: "AV_SPHERICAL_EQUIRECTANGULAR_TILE", value: 2)
!1021 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !951, line: 341, size: 32, align: 32, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026}
!1023 = !DIEnumerator(name: "MATROSKA_VIDEO_PROJECTION_TYPE_RECTANGULAR", value: 0)
!1024 = !DIEnumerator(name: "MATROSKA_VIDEO_PROJECTION_TYPE_EQUIRECTANGULAR", value: 1)
!1025 = !DIEnumerator(name: "MATROSKA_VIDEO_PROJECTION_TYPE_CUBEMAP", value: 2)
!1026 = !DIEnumerator(name: "MATROSKA_VIDEO_PROJECTION_TYPE_MESH", value: 3)
!1027 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVLangCodespace", file: !1028, line: 30, size: 32, align: 32, elements: !1029)
!1028 = !DIFile(filename: "libavformat/avlanguage.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1029 = !{!1030, !1031, !1032}
!1030 = !DIEnumerator(name: "AV_LANG_ISO639_2_BIBL", value: 0)
!1031 = !DIEnumerator(name: "AV_LANG_ISO639_2_TERM", value: 1)
!1032 = !DIEnumerator(name: "AV_LANG_ISO639_1", value: 2)
!1033 = !{!1034, !1042, !1044, !1039, !1045, !1051, !1053, !1054, !1061, !1069, !1092, !1093, !1108, !1050, !1110, !1111, !1113, !1115, !1117}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !1036, line: 220, size: 64, align: 8, elements: !1037)
!1036 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1037 = !{!1038}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1035, file: !1036, line: 220, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1040, line: 55, baseType: !1041)
!1040 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1041 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1040, line: 48, baseType: !1043)
!1043 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1036, line: 221, size: 32, align: 8, elements: !1047)
!1047 = !{!1048}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1046, file: !1036, line: 221, baseType: !1049, size: 32, align: 32)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1040, line: 51, baseType: !1050)
!1050 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1040, line: 40, baseType: !1052)
!1052 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1053 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStereo3D", file: !1000, line: 191, baseType: !1056)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStereo3D", file: !1000, line: 176, size: 96, align: 32, elements: !1057)
!1057 = !{!1058, !1059, !1060}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1056, file: !1000, line: 180, baseType: !999, size: 32, align: 32)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1056, file: !1000, line: 185, baseType: !1053, size: 32, align: 32, offset: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1056, file: !1000, line: 190, baseType: !1010, size: 32, align: 32, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1063)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVContentLightMetadata", file: !1064, line: 108, baseType: !1065)
!1064 = !DIFile(filename: "./libavutil/mastering_display_metadata.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVContentLightMetadata", file: !1064, line: 98, size: 64, align: 32, elements: !1066)
!1066 = !{!1067, !1068}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "MaxCLL", scope: !1065, file: !1064, line: 102, baseType: !1050, size: 32, align: 32)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "MaxFALL", scope: !1065, file: !1064, line: 107, baseType: !1050, size: 32, align: 32, offset: 32)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1071)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVMasteringDisplayMetadata", file: !1064, line: 69, baseType: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVMasteringDisplayMetadata", file: !1064, line: 38, size: 704, align: 32, elements: !1073)
!1073 = !{!1074, !1085, !1088, !1089, !1090, !1091}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "display_primaries", scope: !1072, file: !1064, line: 42, baseType: !1075, size: 384, align: 32)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1076, size: 384, align: 32, elements: !1082)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1077, line: 61, baseType: !1078)
!1077 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1077, line: 58, size: 64, align: 32, elements: !1079)
!1079 = !{!1080, !1081}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1078, file: !1077, line: 59, baseType: !1053, size: 32, align: 32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1078, file: !1077, line: 60, baseType: !1053, size: 32, align: 32, offset: 32)
!1082 = !{!1083, !1084}
!1083 = !DISubrange(count: 3)
!1084 = !DISubrange(count: 2)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !1072, file: !1064, line: 47, baseType: !1086, size: 128, align: 32, offset: 384)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1076, size: 128, align: 32, elements: !1087)
!1087 = !{!1084}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "min_luminance", scope: !1072, file: !1064, line: 52, baseType: !1076, size: 64, align: 32, offset: 512)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "max_luminance", scope: !1072, file: !1064, line: 57, baseType: !1076, size: 64, align: 32, offset: 576)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "has_primaries", scope: !1072, file: !1064, line: 62, baseType: !1053, size: 32, align: 32, offset: 640)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "has_luminance", scope: !1072, file: !1064, line: 67, baseType: !1053, size: 32, align: 32, offset: 672)
!1092 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1095)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSphericalMapping", file: !1016, line: 183, baseType: !1096)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSphericalMapping", file: !1016, line: 82, size: 288, align: 32, elements: !1097)
!1097 = !{!1098, !1099, !1101, !1102, !1103, !1104, !1105, !1106, !1107}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !1096, file: !1016, line: 86, baseType: !1015, size: 32, align: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "yaw", scope: !1096, file: !1016, line: 126, baseType: !1100, size: 32, align: 32, offset: 32)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !1040, line: 38, baseType: !1053)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !1096, file: !1016, line: 127, baseType: !1100, size: 32, align: 32, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !1096, file: !1016, line: 128, baseType: !1100, size: 32, align: 32, offset: 96)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "bound_left", scope: !1096, file: !1016, line: 167, baseType: !1049, size: 32, align: 32, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "bound_top", scope: !1096, file: !1016, line: 168, baseType: !1049, size: 32, align: 32, offset: 160)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "bound_right", scope: !1096, file: !1016, line: 169, baseType: !1049, size: 32, align: 32, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "bound_bottom", scope: !1096, file: !1016, line: 170, baseType: !1049, size: 32, align: 32, offset: 224)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !1096, file: !1016, line: 182, baseType: !1049, size: 32, align: 32, offset: 256)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !1040, line: 37, baseType: !1112)
!1112 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1042)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1035)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1119)
!1119 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !1036, line: 222, size: 16, align: 8, elements: !1120)
!1120 = !{!1121}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1119, file: !1036, line: 222, baseType: !1122, size: 16, align: 16)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1040, line: 49, baseType: !1123)
!1123 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1124 = !{!1125, !2410, !2411, !2412, !2418, !2420, !2423, !2424, !2430, !2431}
!1125 = distinct !DIGlobalVariable(name: "ff_matroska_muxer", scope: !0, file: !1126, line: 2810, type: !1127, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_matroska_muxer)
!1126 = !DIFile(filename: "libavformat/matroskaenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !1128)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1129)
!1129 = !{!1130, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1151, !1223, !1225, !1226, !2375, !2376, !2377, !2381, !2385, !2389, !2390, !2395, !2396, !2397, !2398, !2399, !2400, !2404}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1128, file: !919, line: 498, baseType: !1131, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1133)
!1133 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1128, file: !919, line: 504, baseType: !1131, size: 64, align: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1128, file: !919, line: 505, baseType: !1131, size: 64, align: 64, offset: 128)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1128, file: !919, line: 506, baseType: !1131, size: 64, align: 64, offset: 192)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1128, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1128, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1128, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1128, file: !919, line: 517, baseType: !1053, size: 32, align: 32, offset: 352)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1128, file: !919, line: 523, baseType: !1142, size: 64, align: 64, offset: 384)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1144)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1147, line: 44, size: 64, align: 32, elements: !1148)
!1147 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1148 = !{!1149, !1150}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1146, file: !1147, line: 45, baseType: !3, size: 32, align: 32)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1146, file: !1147, line: 46, baseType: !1050, size: 32, align: 32, offset: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1128, file: !919, line: 526, baseType: !1152, size: 64, align: 64, offset: 448)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1154)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !1155)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1156)
!1156 = !{!1157, !1158, !1162, !1182, !1183, !1184, !1185, !1189, !1195, !1197, !1201}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1155, file: !486, line: 72, baseType: !1131, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1155, file: !486, line: 78, baseType: !1159, size: 64, align: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!1131, !1044}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1155, file: !486, line: 85, baseType: !1163, size: 64, align: 64, offset: 128)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1166)
!1166 = !{!1167, !1168, !1169, !1170, !1171, !1178, !1179, !1180, !1181}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1165, file: !464, line: 247, baseType: !1131, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1165, file: !464, line: 253, baseType: !1131, size: 64, align: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1165, file: !464, line: 259, baseType: !1053, size: 32, align: 32, offset: 128)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1165, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1165, file: !464, line: 271, baseType: !1172, size: 64, align: 64, offset: 192)
!1172 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1165, file: !464, line: 265, size: 64, align: 64, elements: !1173)
!1173 = !{!1174, !1175, !1176, !1177}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1172, file: !464, line: 266, baseType: !1051, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1172, file: !464, line: 267, baseType: !1092, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1172, file: !464, line: 268, baseType: !1131, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1172, file: !464, line: 270, baseType: !1076, size: 64, align: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1165, file: !464, line: 272, baseType: !1092, size: 64, align: 64, offset: 256)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1165, file: !464, line: 273, baseType: !1092, size: 64, align: 64, offset: 320)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1165, file: !464, line: 275, baseType: !1053, size: 32, align: 32, offset: 384)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1165, file: !464, line: 300, baseType: !1131, size: 64, align: 64, offset: 448)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1155, file: !486, line: 93, baseType: !1053, size: 32, align: 32, offset: 192)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1155, file: !486, line: 99, baseType: !1053, size: 32, align: 32, offset: 224)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1155, file: !486, line: 108, baseType: !1053, size: 32, align: 32, offset: 256)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1155, file: !486, line: 113, baseType: !1186, size: 64, align: 64, offset: 320)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!1044, !1044, !1044}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1155, file: !486, line: 123, baseType: !1190, size: 64, align: 64, offset: 384)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!1193, !1193}
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1155)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1155, file: !486, line: 130, baseType: !1196, size: 32, align: 32, offset: 448)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1155, file: !486, line: 136, baseType: !1198, size: 64, align: 64, offset: 512)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!1196, !1044}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1155, file: !486, line: 142, baseType: !1202, size: 64, align: 64, offset: 576)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!1053, !1205, !1044, !1131, !1053}
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1208)
!1208 = !{!1209, !1221, !1222}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1207, file: !464, line: 360, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1214)
!1214 = !{!1215, !1216, !1217, !1218, !1219, !1220}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1213, file: !464, line: 307, baseType: !1131, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1213, file: !464, line: 313, baseType: !1092, size: 64, align: 64, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1213, file: !464, line: 313, baseType: !1092, size: 64, align: 64, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1213, file: !464, line: 318, baseType: !1092, size: 64, align: 64, offset: 192)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1213, file: !464, line: 318, baseType: !1092, size: 64, align: 64, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1213, file: !464, line: 323, baseType: !1053, size: 32, align: 32, offset: 320)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1207, file: !464, line: 364, baseType: !1053, size: 32, align: 32, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1207, file: !464, line: 368, baseType: !1053, size: 32, align: 32, offset: 96)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1128, file: !919, line: 535, baseType: !1224, size: 64, align: 64, offset: 512)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1128, file: !919, line: 539, baseType: !1053, size: 32, align: 32, offset: 576)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1128, file: !919, line: 541, baseType: !1227, size: 64, align: 64, offset: 640)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!1053, !1230}
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1232)
!1232 = !{!1233, !1234, !1329, !1330, !1331, !1394, !1395, !1396, !2229, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2283, !2284, !2285, !2286, !2287, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2338, !2339, !2342, !2343, !2344, !2345, !2346, !2347, !2352, !2353, !2354, !2355, !2363, !2364, !2368, !2372, !2373, !2374}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1231, file: !919, line: 1342, baseType: !1152, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1231, file: !919, line: 1349, baseType: !1235, size: 64, align: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1237)
!1237 = !{!1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1261, !1262, !1300, !1301, !1305, !1310, !1311, !1312, !1316, !1322, !1328}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1236, file: !919, line: 638, baseType: !1131, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1236, file: !919, line: 645, baseType: !1131, size: 64, align: 64, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1236, file: !919, line: 652, baseType: !1053, size: 32, align: 32, offset: 128)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1236, file: !919, line: 659, baseType: !1131, size: 64, align: 64, offset: 192)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1236, file: !919, line: 661, baseType: !1142, size: 64, align: 64, offset: 256)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1236, file: !919, line: 663, baseType: !1152, size: 64, align: 64, offset: 320)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1236, file: !919, line: 670, baseType: !1131, size: 64, align: 64, offset: 384)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1236, file: !919, line: 679, baseType: !1235, size: 64, align: 64, offset: 448)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1236, file: !919, line: 684, baseType: !1053, size: 32, align: 32, offset: 512)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1236, file: !919, line: 689, baseType: !1053, size: 32, align: 32, offset: 544)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1236, file: !919, line: 696, baseType: !1249, size: 64, align: 64, offset: 576)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{!1053, !1252}
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1255)
!1255 = !{!1256, !1257, !1259, !1260}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1254, file: !919, line: 449, baseType: !1131, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1254, file: !919, line: 450, baseType: !1258, size: 64, align: 64, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1254, file: !919, line: 451, baseType: !1053, size: 32, align: 32, offset: 128)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1254, file: !919, line: 452, baseType: !1131, size: 64, align: 64, offset: 192)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1236, file: !919, line: 703, baseType: !1227, size: 64, align: 64, offset: 640)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1236, file: !919, line: 714, baseType: !1263, size: 64, align: 64, offset: 704)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!1053, !1230, !1266}
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1269)
!1269 = !{!1270, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1296, !1297, !1298, !1299}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1268, file: !4, line: 1451, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1273, line: 94, baseType: !1274)
!1273 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1273, line: 81, size: 192, align: 64, elements: !1275)
!1275 = !{!1276, !1280, !1281}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1274, file: !1273, line: 82, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1273, line: 73, baseType: !1279)
!1279 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1273, line: 73, flags: DIFlagFwdDecl)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1274, file: !1273, line: 89, baseType: !1110, size: 64, align: 64, offset: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1274, file: !1273, line: 93, baseType: !1053, size: 32, align: 32, offset: 128)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1268, file: !4, line: 1461, baseType: !1051, size: 64, align: 64, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1268, file: !4, line: 1467, baseType: !1051, size: 64, align: 64, offset: 128)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1268, file: !4, line: 1468, baseType: !1110, size: 64, align: 64, offset: 192)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1268, file: !4, line: 1469, baseType: !1053, size: 32, align: 32, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1268, file: !4, line: 1470, baseType: !1053, size: 32, align: 32, offset: 288)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1268, file: !4, line: 1474, baseType: !1053, size: 32, align: 32, offset: 320)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1268, file: !4, line: 1479, baseType: !1289, size: 64, align: 64, offset: 384)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1291)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1292)
!1292 = !{!1293, !1294, !1295}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1291, file: !4, line: 1412, baseType: !1110, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1291, file: !4, line: 1413, baseType: !1053, size: 32, align: 32, offset: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1291, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1268, file: !4, line: 1480, baseType: !1053, size: 32, align: 32, offset: 448)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1268, file: !4, line: 1486, baseType: !1051, size: 64, align: 64, offset: 512)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1268, file: !4, line: 1488, baseType: !1051, size: 64, align: 64, offset: 576)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1268, file: !4, line: 1497, baseType: !1051, size: 64, align: 64, offset: 640)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1236, file: !919, line: 720, baseType: !1227, size: 64, align: 64, offset: 768)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1236, file: !919, line: 730, baseType: !1302, size: 64, align: 64, offset: 832)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{!1053, !1230, !1053, !1051, !1053}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1236, file: !919, line: 737, baseType: !1306, size: 64, align: 64, offset: 896)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!1051, !1230, !1053, !1309, !1051}
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1236, file: !919, line: 744, baseType: !1227, size: 64, align: 64, offset: 960)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1236, file: !919, line: 750, baseType: !1227, size: 64, align: 64, offset: 1024)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1236, file: !919, line: 758, baseType: !1313, size: 64, align: 64, offset: 1088)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!1053, !1230, !1053, !1051, !1051, !1051, !1053}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1236, file: !919, line: 764, baseType: !1317, size: 64, align: 64, offset: 1152)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!1053, !1230, !1320}
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1236, file: !919, line: 770, baseType: !1323, size: 64, align: 64, offset: 1216)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{!1053, !1230, !1326}
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1236, file: !919, line: 776, baseType: !1323, size: 64, align: 64, offset: 1280)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1231, file: !919, line: 1356, baseType: !1224, size: 64, align: 64, offset: 128)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1231, file: !919, line: 1365, baseType: !1044, size: 64, align: 64, offset: 192)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1231, file: !919, line: 1379, baseType: !1332, size: 64, align: 64, offset: 256)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !537, line: 352, baseType: !1334)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !537, line: 161, size: 2112, align: 64, elements: !1335)
!1335 = !{!1336, !1337, !1338, !1339, !1340, !1341, !1342, !1346, !1347, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1361, !1362, !1366, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1384, !1385, !1386, !1387, !1391, !1392, !1393}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1334, file: !537, line: 174, baseType: !1152, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1334, file: !537, line: 226, baseType: !1258, size: 64, align: 64, offset: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1334, file: !537, line: 227, baseType: !1053, size: 32, align: 32, offset: 128)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1334, file: !537, line: 228, baseType: !1258, size: 64, align: 64, offset: 192)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1334, file: !537, line: 229, baseType: !1258, size: 64, align: 64, offset: 256)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1334, file: !537, line: 233, baseType: !1044, size: 64, align: 64, offset: 320)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1334, file: !537, line: 235, baseType: !1343, size: 64, align: 64, offset: 384)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{!1053, !1044, !1110, !1053}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1334, file: !537, line: 236, baseType: !1343, size: 64, align: 64, offset: 448)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1334, file: !537, line: 237, baseType: !1348, size: 64, align: 64, offset: 512)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DISubroutineType(types: !1350)
!1350 = !{!1051, !1044, !1051, !1053}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1334, file: !537, line: 238, baseType: !1051, size: 64, align: 64, offset: 576)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1334, file: !537, line: 239, baseType: !1053, size: 32, align: 32, offset: 640)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1334, file: !537, line: 240, baseType: !1053, size: 32, align: 32, offset: 672)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1334, file: !537, line: 241, baseType: !1053, size: 32, align: 32, offset: 704)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1334, file: !537, line: 242, baseType: !1041, size: 64, align: 64, offset: 768)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1334, file: !537, line: 243, baseType: !1258, size: 64, align: 64, offset: 832)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1334, file: !537, line: 244, baseType: !1358, size: 64, align: 64, offset: 896)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DISubroutineType(types: !1360)
!1360 = !{!1041, !1041, !1113, !1050}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1334, file: !537, line: 245, baseType: !1053, size: 32, align: 32, offset: 960)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1334, file: !537, line: 249, baseType: !1363, size: 64, align: 64, offset: 1024)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DISubroutineType(types: !1365)
!1365 = !{!1053, !1044, !1053}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1334, file: !537, line: 255, baseType: !1367, size: 64, align: 64, offset: 1088)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DISubroutineType(types: !1369)
!1369 = !{!1051, !1044, !1053, !1051, !1053}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1334, file: !537, line: 260, baseType: !1053, size: 32, align: 32, offset: 1152)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1334, file: !537, line: 266, baseType: !1051, size: 64, align: 64, offset: 1216)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1334, file: !537, line: 273, baseType: !1053, size: 32, align: 32, offset: 1280)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1334, file: !537, line: 279, baseType: !1051, size: 64, align: 64, offset: 1344)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1334, file: !537, line: 285, baseType: !1053, size: 32, align: 32, offset: 1408)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1334, file: !537, line: 291, baseType: !1053, size: 32, align: 32, offset: 1440)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1334, file: !537, line: 298, baseType: !1053, size: 32, align: 32, offset: 1472)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1334, file: !537, line: 304, baseType: !1053, size: 32, align: 32, offset: 1504)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1334, file: !537, line: 309, baseType: !1131, size: 64, align: 64, offset: 1536)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1334, file: !537, line: 314, baseType: !1131, size: 64, align: 64, offset: 1600)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1334, file: !537, line: 319, baseType: !1381, size: 64, align: 64, offset: 1664)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DISubroutineType(types: !1383)
!1383 = !{!1053, !1044, !1110, !1053, !536, !1051}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1334, file: !537, line: 326, baseType: !1053, size: 32, align: 32, offset: 1728)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1334, file: !537, line: 331, baseType: !536, size: 32, align: 32, offset: 1760)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1334, file: !537, line: 332, baseType: !1051, size: 64, align: 64, offset: 1792)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1334, file: !537, line: 338, baseType: !1388, size: 64, align: 64, offset: 1856)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DISubroutineType(types: !1390)
!1390 = !{!1053, !1044}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1334, file: !537, line: 340, baseType: !1051, size: 64, align: 64, offset: 1920)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1334, file: !537, line: 346, baseType: !1258, size: 64, align: 64, offset: 1984)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1334, file: !537, line: 351, baseType: !1053, size: 32, align: 32, offset: 2048)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1231, file: !919, line: 1386, baseType: !1053, size: 32, align: 32, offset: 320)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1231, file: !919, line: 1393, baseType: !1050, size: 32, align: 32, offset: 352)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1231, file: !919, line: 1405, baseType: !1397, size: 64, align: 64, offset: 384)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1400)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1401)
!1401 = !{!1402, !1403, !1404, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2154, !2160, !2161, !2165, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2197, !2198, !2199, !2200, !2201, !2202}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1400, file: !919, line: 866, baseType: !1053, size: 32, align: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1400, file: !919, line: 872, baseType: !1053, size: 32, align: 32, offset: 32)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1400, file: !919, line: 878, baseType: !1405, size: 64, align: 64, offset: 64)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1407)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1408)
!1408 = !{!1409, !1410, !1411, !1412, !1636, !1637, !1638, !1639, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1792, !1796, !1797, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1976, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1407, file: !4, line: 1561, baseType: !1152, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1407, file: !4, line: 1562, baseType: !1053, size: 32, align: 32, offset: 64)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1407, file: !4, line: 1564, baseType: !545, size: 32, align: 32, offset: 96)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1407, file: !4, line: 1565, baseType: !1413, size: 64, align: 64, offset: 128)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1415)
!1415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1416)
!1416 = !{!1417, !1418, !1419, !1420, !1421, !1422, !1425, !1428, !1431, !1434, !1437, !1438, !1439, !1447, !1448, !1449, !1451, !1455, !1461, !1470, !1474, !1475, !1520, !1607, !1611, !1612, !1616, !1620, !1625, !1629, !1630, !1631}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1415, file: !4, line: 3475, baseType: !1131, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1415, file: !4, line: 3480, baseType: !1131, size: 64, align: 64, offset: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1415, file: !4, line: 3481, baseType: !545, size: 32, align: 32, offset: 128)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1415, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1415, file: !4, line: 3487, baseType: !1053, size: 32, align: 32, offset: 192)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1415, file: !4, line: 3488, baseType: !1423, size: 64, align: 64, offset: 256)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1076)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1415, file: !4, line: 3489, baseType: !1426, size: 64, align: 64, offset: 320)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1415, file: !4, line: 3490, baseType: !1429, size: 64, align: 64, offset: 384)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1053)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1415, file: !4, line: 3491, baseType: !1432, size: 64, align: 64, offset: 448)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1415, file: !4, line: 3492, baseType: !1435, size: 64, align: 64, offset: 512)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1415, file: !4, line: 3493, baseType: !1042, size: 8, align: 8, offset: 576)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1415, file: !4, line: 3494, baseType: !1152, size: 64, align: 64, offset: 640)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1415, file: !4, line: 3495, baseType: !1440, size: 64, align: 64, offset: 704)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1442)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1443)
!1443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1444)
!1444 = !{!1445, !1446}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1443, file: !4, line: 3402, baseType: !1053, size: 32, align: 32)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1443, file: !4, line: 3403, baseType: !1131, size: 64, align: 64, offset: 64)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1415, file: !4, line: 3507, baseType: !1131, size: 64, align: 64, offset: 768)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1415, file: !4, line: 3516, baseType: !1053, size: 32, align: 32, offset: 832)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1415, file: !4, line: 3517, baseType: !1450, size: 64, align: 64, offset: 896)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1415, file: !4, line: 3527, baseType: !1452, size: 64, align: 64, offset: 960)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DISubroutineType(types: !1454)
!1454 = !{!1053, !1405}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1415, file: !4, line: 3535, baseType: !1456, size: 64, align: 64, offset: 1024)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DISubroutineType(types: !1458)
!1458 = !{!1053, !1405, !1459}
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1406)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1415, file: !4, line: 3541, baseType: !1462, size: 64, align: 64, offset: 1088)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1464)
!1464 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1465)
!1465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1466, line: 223, size: 128, align: 64, elements: !1467)
!1466 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1467 = !{!1468, !1469}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1465, file: !1466, line: 224, baseType: !1113, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1465, file: !1466, line: 225, baseType: !1113, size: 64, align: 64, offset: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1415, file: !4, line: 3549, baseType: !1471, size: 64, align: 64, offset: 1152)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DISubroutineType(types: !1473)
!1473 = !{null, !1450}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1415, file: !4, line: 3551, baseType: !1452, size: 64, align: 64, offset: 1216)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1415, file: !4, line: 3552, baseType: !1476, size: 64, align: 64, offset: 1280)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DISubroutineType(types: !1478)
!1478 = !{!1053, !1405, !1110, !1053, !1479}
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1481)
!1481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1482)
!1482 = !{!1483, !1484, !1485, !1486, !1487, !1519}
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1481, file: !4, line: 3921, baseType: !1122, size: 16, align: 16)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1481, file: !4, line: 3922, baseType: !1049, size: 32, align: 32, offset: 32)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1481, file: !4, line: 3923, baseType: !1049, size: 32, align: 32, offset: 64)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1481, file: !4, line: 3924, baseType: !1050, size: 32, align: 32, offset: 96)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1481, file: !4, line: 3925, baseType: !1488, size: 64, align: 64, offset: 128)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1491)
!1491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1492)
!1492 = !{!1493, !1494, !1495, !1496, !1497, !1498, !1508, !1512, !1514, !1515, !1517, !1518}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1491, file: !4, line: 3886, baseType: !1053, size: 32, align: 32)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1491, file: !4, line: 3887, baseType: !1053, size: 32, align: 32, offset: 32)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1491, file: !4, line: 3888, baseType: !1053, size: 32, align: 32, offset: 64)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1491, file: !4, line: 3889, baseType: !1053, size: 32, align: 32, offset: 96)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1491, file: !4, line: 3890, baseType: !1053, size: 32, align: 32, offset: 128)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1491, file: !4, line: 3897, baseType: !1499, size: 768, align: 64, offset: 192)
!1499 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1500)
!1500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1501)
!1501 = !{!1502, !1506}
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1500, file: !4, line: 3855, baseType: !1503, size: 512, align: 64)
!1503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1110, size: 512, align: 64, elements: !1504)
!1504 = !{!1505}
!1505 = !DISubrange(count: 8)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1500, file: !4, line: 3857, baseType: !1507, size: 256, align: 32, offset: 512)
!1507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1053, size: 256, align: 32, elements: !1504)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1491, file: !4, line: 3903, baseType: !1509, size: 256, align: 64, offset: 960)
!1509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1110, size: 256, align: 64, elements: !1510)
!1510 = !{!1511}
!1511 = !DISubrange(count: 4)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1491, file: !4, line: 3904, baseType: !1513, size: 128, align: 32, offset: 1216)
!1513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1053, size: 128, align: 32, elements: !1510)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1491, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1491, file: !4, line: 3908, baseType: !1516, size: 64, align: 64, offset: 1408)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1491, file: !4, line: 3915, baseType: !1516, size: 64, align: 64, offset: 1472)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1491, file: !4, line: 3917, baseType: !1053, size: 32, align: 32, offset: 1536)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1481, file: !4, line: 3926, baseType: !1051, size: 64, align: 64, offset: 192)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1415, file: !4, line: 3564, baseType: !1521, size: 64, align: 64, offset: 1344)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DISubroutineType(types: !1523)
!1523 = !{!1053, !1405, !1266, !1524, !1606}
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1526)
!1526 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1527)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1528)
!1528 = !{!1529, !1530, !1531, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1558, !1560, !1561, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1594, !1595, !1596, !1597, !1598, !1599, !1602, !1603, !1604, !1605}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1527, file: !789, line: 282, baseType: !1503, size: 512, align: 64)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1527, file: !789, line: 299, baseType: !1507, size: 256, align: 32, offset: 512)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1527, file: !789, line: 315, baseType: !1532, size: 64, align: 64, offset: 768)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1527, file: !789, line: 326, baseType: !1053, size: 32, align: 32, offset: 832)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1527, file: !789, line: 326, baseType: !1053, size: 32, align: 32, offset: 864)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1527, file: !789, line: 334, baseType: !1053, size: 32, align: 32, offset: 896)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1527, file: !789, line: 341, baseType: !1053, size: 32, align: 32, offset: 928)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1527, file: !789, line: 346, baseType: !1053, size: 32, align: 32, offset: 960)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1527, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1527, file: !789, line: 356, baseType: !1076, size: 64, align: 32, offset: 1024)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1527, file: !789, line: 361, baseType: !1051, size: 64, align: 64, offset: 1088)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1527, file: !789, line: 369, baseType: !1051, size: 64, align: 64, offset: 1152)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1527, file: !789, line: 377, baseType: !1051, size: 64, align: 64, offset: 1216)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1527, file: !789, line: 382, baseType: !1053, size: 32, align: 32, offset: 1280)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1527, file: !789, line: 386, baseType: !1053, size: 32, align: 32, offset: 1312)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1527, file: !789, line: 391, baseType: !1053, size: 32, align: 32, offset: 1344)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1527, file: !789, line: 396, baseType: !1044, size: 64, align: 64, offset: 1408)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1527, file: !789, line: 403, baseType: !1548, size: 512, align: 64, offset: 1472)
!1548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 512, align: 64, elements: !1504)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1527, file: !789, line: 410, baseType: !1053, size: 32, align: 32, offset: 1984)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1527, file: !789, line: 415, baseType: !1053, size: 32, align: 32, offset: 2016)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1527, file: !789, line: 420, baseType: !1053, size: 32, align: 32, offset: 2048)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1527, file: !789, line: 425, baseType: !1053, size: 32, align: 32, offset: 2080)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1527, file: !789, line: 435, baseType: !1051, size: 64, align: 64, offset: 2112)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1527, file: !789, line: 440, baseType: !1053, size: 32, align: 32, offset: 2176)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1527, file: !789, line: 445, baseType: !1039, size: 64, align: 64, offset: 2240)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1527, file: !789, line: 459, baseType: !1557, size: 512, align: 64, offset: 2304)
!1557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1271, size: 512, align: 64, elements: !1504)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1527, file: !789, line: 473, baseType: !1559, size: 64, align: 64, offset: 2816)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1527, file: !789, line: 477, baseType: !1053, size: 32, align: 32, offset: 2880)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1527, file: !789, line: 479, baseType: !1562, size: 64, align: 64, offset: 2944)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1564 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1565)
!1565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1566)
!1566 = !{!1567, !1568, !1569, !1570, !1575}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1565, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1565, file: !789, line: 203, baseType: !1110, size: 64, align: 64, offset: 64)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1565, file: !789, line: 204, baseType: !1053, size: 32, align: 32, offset: 128)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1565, file: !789, line: 205, baseType: !1571, size: 64, align: 64, offset: 192)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1573, line: 86, baseType: !1574)
!1573 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1574 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1573, line: 86, flags: DIFlagFwdDecl)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1565, file: !789, line: 206, baseType: !1271, size: 64, align: 64, offset: 256)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1527, file: !789, line: 480, baseType: !1053, size: 32, align: 32, offset: 3008)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1527, file: !789, line: 505, baseType: !1053, size: 32, align: 32, offset: 3040)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1527, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1527, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1527, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1527, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1527, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1527, file: !789, line: 532, baseType: !1051, size: 64, align: 64, offset: 3264)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1527, file: !789, line: 539, baseType: !1051, size: 64, align: 64, offset: 3328)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1527, file: !789, line: 547, baseType: !1051, size: 64, align: 64, offset: 3392)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1527, file: !789, line: 554, baseType: !1571, size: 64, align: 64, offset: 3456)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1527, file: !789, line: 563, baseType: !1053, size: 32, align: 32, offset: 3520)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1527, file: !789, line: 572, baseType: !1053, size: 32, align: 32, offset: 3552)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1527, file: !789, line: 581, baseType: !1053, size: 32, align: 32, offset: 3584)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1527, file: !789, line: 588, baseType: !1591, size: 64, align: 64, offset: 3648)
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64, align: 64)
!1592 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1040, line: 36, baseType: !1593)
!1593 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1527, file: !789, line: 593, baseType: !1053, size: 32, align: 32, offset: 3712)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1527, file: !789, line: 596, baseType: !1053, size: 32, align: 32, offset: 3744)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1527, file: !789, line: 599, baseType: !1271, size: 64, align: 64, offset: 3776)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1527, file: !789, line: 605, baseType: !1271, size: 64, align: 64, offset: 3840)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1527, file: !789, line: 616, baseType: !1271, size: 64, align: 64, offset: 3904)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1527, file: !789, line: 626, baseType: !1600, size: 64, align: 64, offset: 3968)
!1600 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1601, line: 216, baseType: !1041)
!1601 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1527, file: !789, line: 627, baseType: !1600, size: 64, align: 64, offset: 4032)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1527, file: !789, line: 628, baseType: !1600, size: 64, align: 64, offset: 4096)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1527, file: !789, line: 629, baseType: !1600, size: 64, align: 64, offset: 4160)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1527, file: !789, line: 645, baseType: !1271, size: 64, align: 64, offset: 4224)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1415, file: !4, line: 3566, baseType: !1608, size: 64, align: 64, offset: 1408)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = !DISubroutineType(types: !1610)
!1610 = !{!1053, !1405, !1044, !1606, !1266}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1415, file: !4, line: 3567, baseType: !1452, size: 64, align: 64, offset: 1472)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1415, file: !4, line: 3576, baseType: !1613, size: 64, align: 64, offset: 1536)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DISubroutineType(types: !1615)
!1615 = !{!1053, !1405, !1524}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1415, file: !4, line: 3577, baseType: !1617, size: 64, align: 64, offset: 1600)
!1617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1618, size: 64, align: 64)
!1618 = !DISubroutineType(types: !1619)
!1619 = !{!1053, !1405, !1266}
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1415, file: !4, line: 3584, baseType: !1621, size: 64, align: 64, offset: 1664)
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1622, size: 64, align: 64)
!1622 = !DISubroutineType(types: !1623)
!1623 = !{!1053, !1405, !1624}
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64, align: 64)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1415, file: !4, line: 3589, baseType: !1626, size: 64, align: 64, offset: 1728)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DISubroutineType(types: !1628)
!1628 = !{null, !1405}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1415, file: !4, line: 3594, baseType: !1053, size: 32, align: 32, offset: 1792)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1415, file: !4, line: 3600, baseType: !1131, size: 64, align: 64, offset: 1856)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1415, file: !4, line: 3609, baseType: !1632, size: 64, align: 64, offset: 1920)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64, align: 64)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1635)
!1635 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1407, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1407, file: !4, line: 1581, baseType: !1050, size: 32, align: 32, offset: 224)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1407, file: !4, line: 1583, baseType: !1044, size: 64, align: 64, offset: 256)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1407, file: !4, line: 1591, baseType: !1640, size: 64, align: 64, offset: 320)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1466, line: 129, size: 1664, align: 64, elements: !1642)
!1642 = !{!1643, !1644, !1645, !1646, !1647, !1665, !1666, !1672, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768}
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1641, file: !1466, line: 136, baseType: !1053, size: 32, align: 32)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1641, file: !1466, line: 151, baseType: !1053, size: 32, align: 32, offset: 32)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1641, file: !1466, line: 157, baseType: !1053, size: 32, align: 32, offset: 64)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1641, file: !1466, line: 159, baseType: !1624, size: 64, align: 64, offset: 128)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1641, file: !1466, line: 161, baseType: !1648, size: 64, align: 64, offset: 192)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1466, line: 117, baseType: !1650)
!1650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1466, line: 100, size: 832, align: 64, elements: !1651)
!1651 = !{!1652, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1650, file: !1466, line: 105, baseType: !1653, size: 256, align: 64)
!1653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1654, size: 256, align: 64, elements: !1510)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1273, line: 238, baseType: !1656)
!1656 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1273, line: 238, flags: DIFlagFwdDecl)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1650, file: !1466, line: 110, baseType: !1053, size: 32, align: 32, offset: 256)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1650, file: !1466, line: 111, baseType: !1053, size: 32, align: 32, offset: 288)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1650, file: !1466, line: 111, baseType: !1053, size: 32, align: 32, offset: 320)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1650, file: !1466, line: 112, baseType: !1507, size: 256, align: 32, offset: 352)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1650, file: !1466, line: 113, baseType: !1513, size: 128, align: 32, offset: 608)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1650, file: !1466, line: 114, baseType: !1053, size: 32, align: 32, offset: 736)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1650, file: !1466, line: 115, baseType: !1053, size: 32, align: 32, offset: 768)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1650, file: !1466, line: 116, baseType: !1053, size: 32, align: 32, offset: 800)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1641, file: !1466, line: 163, baseType: !1044, size: 64, align: 64, offset: 256)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1641, file: !1466, line: 165, baseType: !1667, size: 128, align: 64, offset: 320)
!1667 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1466, line: 122, baseType: !1668)
!1668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1466, line: 119, size: 128, align: 64, elements: !1669)
!1669 = !{!1670, !1671}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1668, file: !1466, line: 120, baseType: !1266, size: 64, align: 64)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1668, file: !1466, line: 121, baseType: !1624, size: 64, align: 64, offset: 64)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1641, file: !1466, line: 166, baseType: !1673, size: 128, align: 64, offset: 448)
!1673 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1466, line: 127, baseType: !1674)
!1674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1466, line: 124, size: 128, align: 64, elements: !1675)
!1675 = !{!1676, !1749}
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1674, file: !1466, line: 125, baseType: !1677, size: 64, align: 64)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64, align: 64)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1679 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !1680)
!1680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !1681)
!1681 = !{!1682, !1683, !1707, !1711, !1712, !1746, !1747, !1748}
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1680, file: !4, line: 5751, baseType: !1152, size: 64, align: 64)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1680, file: !4, line: 5756, baseType: !1684, size: 64, align: 64, offset: 64)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1686)
!1686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !1687)
!1687 = !{!1688, !1689, !1692, !1693, !1694, !1698, !1702, !1706}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1686, file: !4, line: 5797, baseType: !1131, size: 64, align: 64)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1686, file: !4, line: 5804, baseType: !1690, size: 64, align: 64, offset: 64)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1686, file: !4, line: 5815, baseType: !1152, size: 64, align: 64, offset: 128)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1686, file: !4, line: 5825, baseType: !1053, size: 32, align: 32, offset: 192)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1686, file: !4, line: 5826, baseType: !1695, size: 64, align: 64, offset: 256)
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1696, size: 64, align: 64)
!1696 = !DISubroutineType(types: !1697)
!1697 = !{!1053, !1678}
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1686, file: !4, line: 5827, baseType: !1699, size: 64, align: 64, offset: 320)
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DISubroutineType(types: !1701)
!1701 = !{!1053, !1678, !1266}
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1686, file: !4, line: 5828, baseType: !1703, size: 64, align: 64, offset: 384)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64, align: 64)
!1704 = !DISubroutineType(types: !1705)
!1705 = !{null, !1678}
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1686, file: !4, line: 5829, baseType: !1703, size: 64, align: 64, offset: 448)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1680, file: !4, line: 5762, baseType: !1708, size: 64, align: 64, offset: 128)
!1708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1709, size: 64, align: 64)
!1709 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !1710)
!1710 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1680, file: !4, line: 5768, baseType: !1044, size: 64, align: 64, offset: 192)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1680, file: !4, line: 5775, baseType: !1713, size: 64, align: 64, offset: 256)
!1713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1714, size: 64, align: 64)
!1714 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !1715)
!1715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !1716)
!1716 = !{!1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745}
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1715, file: !4, line: 3940, baseType: !545, size: 32, align: 32)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1715, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1715, file: !4, line: 3948, baseType: !1049, size: 32, align: 32, offset: 64)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1715, file: !4, line: 3958, baseType: !1110, size: 64, align: 64, offset: 128)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1715, file: !4, line: 3962, baseType: !1053, size: 32, align: 32, offset: 192)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1715, file: !4, line: 3968, baseType: !1053, size: 32, align: 32, offset: 224)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1715, file: !4, line: 3973, baseType: !1051, size: 64, align: 64, offset: 256)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1715, file: !4, line: 3986, baseType: !1053, size: 32, align: 32, offset: 320)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1715, file: !4, line: 3999, baseType: !1053, size: 32, align: 32, offset: 352)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1715, file: !4, line: 4004, baseType: !1053, size: 32, align: 32, offset: 384)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1715, file: !4, line: 4005, baseType: !1053, size: 32, align: 32, offset: 416)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1715, file: !4, line: 4010, baseType: !1053, size: 32, align: 32, offset: 448)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1715, file: !4, line: 4011, baseType: !1053, size: 32, align: 32, offset: 480)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1715, file: !4, line: 4020, baseType: !1076, size: 64, align: 32, offset: 512)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1715, file: !4, line: 4025, baseType: !889, size: 32, align: 32, offset: 576)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1715, file: !4, line: 4030, baseType: !812, size: 32, align: 32, offset: 608)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1715, file: !4, line: 4031, baseType: !818, size: 32, align: 32, offset: 640)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1715, file: !4, line: 4032, baseType: !836, size: 32, align: 32, offset: 672)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1715, file: !4, line: 4033, baseType: !860, size: 32, align: 32, offset: 704)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1715, file: !4, line: 4034, baseType: !879, size: 32, align: 32, offset: 736)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1715, file: !4, line: 4039, baseType: !1053, size: 32, align: 32, offset: 768)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1715, file: !4, line: 4046, baseType: !1039, size: 64, align: 64, offset: 832)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1715, file: !4, line: 4050, baseType: !1053, size: 32, align: 32, offset: 896)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1715, file: !4, line: 4054, baseType: !1053, size: 32, align: 32, offset: 928)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1715, file: !4, line: 4061, baseType: !1053, size: 32, align: 32, offset: 960)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1715, file: !4, line: 4065, baseType: !1053, size: 32, align: 32, offset: 992)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1715, file: !4, line: 4073, baseType: !1053, size: 32, align: 32, offset: 1024)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1715, file: !4, line: 4080, baseType: !1053, size: 32, align: 32, offset: 1056)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1715, file: !4, line: 4084, baseType: !1053, size: 32, align: 32, offset: 1088)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1680, file: !4, line: 5781, baseType: !1713, size: 64, align: 64, offset: 320)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1680, file: !4, line: 5787, baseType: !1076, size: 64, align: 32, offset: 384)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1680, file: !4, line: 5793, baseType: !1076, size: 64, align: 32, offset: 448)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1674, file: !1466, line: 126, baseType: !1053, size: 32, align: 32, offset: 64)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1641, file: !1466, line: 172, baseType: !1266, size: 64, align: 64, offset: 576)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1641, file: !1466, line: 177, baseType: !1110, size: 64, align: 64, offset: 640)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1641, file: !1466, line: 178, baseType: !1050, size: 32, align: 32, offset: 704)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1641, file: !1466, line: 180, baseType: !1044, size: 64, align: 64, offset: 768)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1641, file: !1466, line: 185, baseType: !1053, size: 32, align: 32, offset: 832)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1641, file: !1466, line: 190, baseType: !1044, size: 64, align: 64, offset: 896)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1641, file: !1466, line: 195, baseType: !1053, size: 32, align: 32, offset: 960)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1641, file: !1466, line: 200, baseType: !1266, size: 64, align: 64, offset: 1024)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1641, file: !1466, line: 201, baseType: !1053, size: 32, align: 32, offset: 1088)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1641, file: !1466, line: 202, baseType: !1624, size: 64, align: 64, offset: 1152)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1641, file: !1466, line: 203, baseType: !1053, size: 32, align: 32, offset: 1216)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1641, file: !1466, line: 205, baseType: !1053, size: 32, align: 32, offset: 1248)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1641, file: !1466, line: 206, baseType: !1053, size: 32, align: 32, offset: 1280)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1641, file: !1466, line: 209, baseType: !1600, size: 64, align: 64, offset: 1344)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1641, file: !1466, line: 212, baseType: !1600, size: 64, align: 64, offset: 1408)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1641, file: !1466, line: 213, baseType: !1624, size: 64, align: 64, offset: 1472)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1641, file: !1466, line: 215, baseType: !1053, size: 32, align: 32, offset: 1536)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1641, file: !1466, line: 217, baseType: !1053, size: 32, align: 32, offset: 1568)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1641, file: !1466, line: 220, baseType: !1053, size: 32, align: 32, offset: 1600)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1407, file: !4, line: 1598, baseType: !1044, size: 64, align: 64, offset: 384)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1407, file: !4, line: 1606, baseType: !1051, size: 64, align: 64, offset: 448)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1407, file: !4, line: 1614, baseType: !1053, size: 32, align: 32, offset: 512)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1407, file: !4, line: 1622, baseType: !1053, size: 32, align: 32, offset: 544)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1407, file: !4, line: 1628, baseType: !1053, size: 32, align: 32, offset: 576)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1407, file: !4, line: 1636, baseType: !1053, size: 32, align: 32, offset: 608)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1407, file: !4, line: 1643, baseType: !1053, size: 32, align: 32, offset: 640)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1407, file: !4, line: 1657, baseType: !1110, size: 64, align: 64, offset: 704)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1407, file: !4, line: 1658, baseType: !1053, size: 32, align: 32, offset: 768)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1407, file: !4, line: 1679, baseType: !1076, size: 64, align: 32, offset: 800)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1407, file: !4, line: 1688, baseType: !1053, size: 32, align: 32, offset: 864)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1407, file: !4, line: 1712, baseType: !1053, size: 32, align: 32, offset: 896)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1407, file: !4, line: 1729, baseType: !1053, size: 32, align: 32, offset: 928)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1407, file: !4, line: 1729, baseType: !1053, size: 32, align: 32, offset: 960)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1407, file: !4, line: 1744, baseType: !1053, size: 32, align: 32, offset: 992)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1407, file: !4, line: 1744, baseType: !1053, size: 32, align: 32, offset: 1024)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1407, file: !4, line: 1751, baseType: !1053, size: 32, align: 32, offset: 1056)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1407, file: !4, line: 1766, baseType: !555, size: 32, align: 32, offset: 1088)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1407, file: !4, line: 1791, baseType: !1788, size: 64, align: 64, offset: 1152)
!1788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1789, size: 64, align: 64)
!1789 = !DISubroutineType(types: !1790)
!1790 = !{null, !1791, !1524, !1606, !1053, !1053, !1053}
!1791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1407, file: !4, line: 1808, baseType: !1793, size: 64, align: 64, offset: 1216)
!1793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1794, size: 64, align: 64)
!1794 = !DISubroutineType(types: !1795)
!1795 = !{!555, !1791, !1426}
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1407, file: !4, line: 1816, baseType: !1053, size: 32, align: 32, offset: 1280)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1407, file: !4, line: 1825, baseType: !1798, size: 32, align: 32, offset: 1312)
!1798 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1407, file: !4, line: 1830, baseType: !1053, size: 32, align: 32, offset: 1344)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1407, file: !4, line: 1838, baseType: !1798, size: 32, align: 32, offset: 1376)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1407, file: !4, line: 1846, baseType: !1053, size: 32, align: 32, offset: 1408)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1407, file: !4, line: 1851, baseType: !1053, size: 32, align: 32, offset: 1440)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1407, file: !4, line: 1861, baseType: !1798, size: 32, align: 32, offset: 1472)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1407, file: !4, line: 1868, baseType: !1798, size: 32, align: 32, offset: 1504)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1407, file: !4, line: 1875, baseType: !1798, size: 32, align: 32, offset: 1536)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1407, file: !4, line: 1882, baseType: !1798, size: 32, align: 32, offset: 1568)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1407, file: !4, line: 1889, baseType: !1798, size: 32, align: 32, offset: 1600)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1407, file: !4, line: 1896, baseType: !1798, size: 32, align: 32, offset: 1632)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1407, file: !4, line: 1903, baseType: !1798, size: 32, align: 32, offset: 1664)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1407, file: !4, line: 1910, baseType: !1053, size: 32, align: 32, offset: 1696)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1407, file: !4, line: 1915, baseType: !1053, size: 32, align: 32, offset: 1728)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1407, file: !4, line: 1926, baseType: !1606, size: 64, align: 64, offset: 1792)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1407, file: !4, line: 1935, baseType: !1076, size: 64, align: 32, offset: 1856)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1407, file: !4, line: 1942, baseType: !1053, size: 32, align: 32, offset: 1920)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1407, file: !4, line: 1948, baseType: !1053, size: 32, align: 32, offset: 1952)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1407, file: !4, line: 1954, baseType: !1053, size: 32, align: 32, offset: 1984)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1407, file: !4, line: 1960, baseType: !1053, size: 32, align: 32, offset: 2016)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1407, file: !4, line: 1984, baseType: !1053, size: 32, align: 32, offset: 2048)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1407, file: !4, line: 1991, baseType: !1053, size: 32, align: 32, offset: 2080)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1407, file: !4, line: 1996, baseType: !1053, size: 32, align: 32, offset: 2112)
