; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--formats.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--formats.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFilterFormats = type { i32, i32*, i32, %struct.AVFilterFormats*** }
%struct.AVPixFmtDescriptor = type { i8*, i8, i8, i8, i64, [4 x %struct.AVComponentDescriptor], i8* }
%struct.AVComponentDescriptor = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVFilterChannelLayouts = type { i64*, i32, i8, i8, i32, %struct.AVFilterChannelLayouts*** }
%struct.AVFilterContext = type { %struct.AVClass*, %struct.AVFilter*, i8*, %struct.AVFilterPad*, %struct.AVFilterLink**, i32, %struct.AVFilterPad*, %struct.AVFilterLink**, i32, i8*, %struct.AVFilterGraph*, i32, %struct.AVFilterInternal*, %struct.AVFilterCommand*, i8*, i8*, double*, i32, %struct.AVBufferRef*, i32, i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!105 = !DIEnumerator(name: "AVCOL_PRI_SMPTEST428_1", value: 10)
!106 = !DIEnumerator(name: "AVCOL_PRI_SMPTE431", value: 11)
!107 = !DIEnumerator(name: "AVCOL_PRI_SMPTE432", value: 12)
!108 = !DIEnumerator(name: "AVCOL_PRI_JEDEC_P22", value: 22)
!109 = !DIEnumerator(name: "AVCOL_PRI_NB", value: 23)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorTransferCharacteristic", file: !86, line: 464, size: 32, align: 32, elements: !111)
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133}
!112 = !DIEnumerator(name: "AVCOL_TRC_RESERVED0", value: 0)
!113 = !DIEnumerator(name: "AVCOL_TRC_BT709", value: 1)
!114 = !DIEnumerator(name: "AVCOL_TRC_UNSPECIFIED", value: 2)
!115 = !DIEnumerator(name: "AVCOL_TRC_RESERVED", value: 3)
!116 = !DIEnumerator(name: "AVCOL_TRC_GAMMA22", value: 4)
!117 = !DIEnumerator(name: "AVCOL_TRC_GAMMA28", value: 5)
!118 = !DIEnumerator(name: "AVCOL_TRC_SMPTE170M", value: 6)
!119 = !DIEnumerator(name: "AVCOL_TRC_SMPTE240M", value: 7)
!120 = !DIEnumerator(name: "AVCOL_TRC_LINEAR", value: 8)
!121 = !DIEnumerator(name: "AVCOL_TRC_LOG", value: 9)
!122 = !DIEnumerator(name: "AVCOL_TRC_LOG_SQRT", value: 10)
!123 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_4", value: 11)
!124 = !DIEnumerator(name: "AVCOL_TRC_BT1361_ECG", value: 12)
!125 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_1", value: 13)
!126 = !DIEnumerator(name: "AVCOL_TRC_BT2020_10", value: 14)
!127 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!128 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!129 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!130 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!131 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!132 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!133 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !86, line: 493, size: 32, align: 32, elements: !135)
!135 = !{!136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152}
!136 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!137 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!138 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!139 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!140 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!141 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!142 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!143 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!144 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!145 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!146 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!147 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!148 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!149 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!150 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!151 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!152 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!153 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !86, line: 538, size: 32, align: 32, elements: !154)
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162}
!155 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!156 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!157 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!158 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!159 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!160 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!161 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!162 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!163 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !165, file: !164, line: 503, size: 32, align: 32, elements: !540)
!164 = !DIFile(filename: "libavfilter/avfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterLink", file: !164, line: 439, size: 493504, align: 64, elements: !166)
!166 = !{!167, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !501, !502, !503, !504, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !165, file: !164, line: 440, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterContext", file: !164, line: 67, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterContext", file: !164, line: 338, size: 1344, align: 64, elements: !171)
!171 = !{!172, !218, !400, !401, !403, !405, !407, !408, !409, !410, !411, !451, !452, !458, !468, !469, !470, !472, !473, !474, !475, !476}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !170, file: !164, line: 339, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !31, line: 143, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !31, line: 67, size: 640, align: 64, elements: !177)
!177 = !{!178, !182, !187, !191, !193, !194, !195, !199, !205, !207, !211}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !176, file: !31, line: 72, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !176, file: !31, line: 78, baseType: !183, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!179, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !176, file: !31, line: 85, baseType: !188, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !190)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !31, line: 85, flags: DIFlagFwdDecl)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !176, file: !31, line: 93, baseType: !192, size: 32, align: 32, offset: 192)
!192 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !176, file: !31, line: 99, baseType: !192, size: 32, align: 32, offset: 224)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !176, file: !31, line: 108, baseType: !192, size: 32, align: 32, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !176, file: !31, line: 113, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!186, !186, !186}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !176, file: !31, line: 123, baseType: !200, size: 64, align: 64, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!203, !203}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !176, file: !31, line: 130, baseType: !206, size: 32, align: 32, offset: 448)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !31, line: 48, baseType: !30)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !176, file: !31, line: 136, baseType: !208, size: 64, align: 64, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!206, !186}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !176, file: !31, line: 142, baseType: !212, size: 64, align: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!192, !215, !186, !179, !192}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !31, line: 60, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !170, file: !164, line: 341, baseType: !219, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilter", file: !164, line: 328, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilter", file: !164, line: 144, size: 1024, align: 64, elements: !223)
!223 = !{!224, !225, !226, !368, !369, !370, !371, !375, !376, !381, !385, !386, !387, !388, !390, !395, !399}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !222, file: !164, line: 148, baseType: !179, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !222, file: !164, line: 155, baseType: !179, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !222, file: !164, line: 164, baseType: !227, size: 64, align: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterPad", file: !164, line: 69, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterPad", file: !231, line: 54, size: 576, align: 64, elements: !232)
!231 = !DIFile(filename: "libavfilter/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!232 = !{!233, !234, !235, !352, !356, !360, !364, !365, !366, !367}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !230, file: !231, line: 60, baseType: !179, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !230, file: !231, line: 65, baseType: !3, size: 32, align: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "get_video_buffer", scope: !230, file: !231, line: 73, baseType: !236, size: 64, align: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!239, !350, !192, !192}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !62, line: 646, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !62, line: 268, size: 4288, align: 64, elements: !242)
!242 = !{!243, !251, !253, !255, !256, !257, !258, !259, !260, !261, !268, !272, !273, !274, !275, !276, !277, !278, !282, !283, !284, !285, !286, !287, !288, !289, !302, !304, !305, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !338, !339, !340, !341, !342, !343, !346, !347, !348, !349}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !241, file: !62, line: 282, baseType: !244, size: 512, align: 64)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 512, align: 64, elements: !249)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !247, line: 48, baseType: !248)
!247 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!248 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!249 = !{!250}
!250 = !DISubrange(count: 8)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !241, file: !62, line: 299, baseType: !252, size: 256, align: 32, offset: 512)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 256, align: 32, elements: !249)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !241, file: !62, line: 315, baseType: !254, size: 64, align: 64, offset: 768)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !241, file: !62, line: 326, baseType: !192, size: 32, align: 32, offset: 832)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !241, file: !62, line: 326, baseType: !192, size: 32, align: 32, offset: 864)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !241, file: !62, line: 334, baseType: !192, size: 32, align: 32, offset: 896)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !241, file: !62, line: 341, baseType: !192, size: 32, align: 32, offset: 928)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !241, file: !62, line: 346, baseType: !192, size: 32, align: 32, offset: 960)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !241, file: !62, line: 351, baseType: !51, size: 32, align: 32, offset: 992)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !241, file: !62, line: 356, baseType: !262, size: 64, align: 32, offset: 1024)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !263, line: 61, baseType: !264)
!263 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !263, line: 58, size: 64, align: 32, elements: !265)
!265 = !{!266, !267}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !264, file: !263, line: 59, baseType: !192, size: 32, align: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !264, file: !263, line: 60, baseType: !192, size: 32, align: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !241, file: !62, line: 361, baseType: !269, size: 64, align: 64, offset: 1088)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !270, line: 197, baseType: !271)
!270 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!271 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !241, file: !62, line: 369, baseType: !269, size: 64, align: 64, offset: 1152)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !241, file: !62, line: 377, baseType: !269, size: 64, align: 64, offset: 1216)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !241, file: !62, line: 382, baseType: !192, size: 32, align: 32, offset: 1280)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !241, file: !62, line: 386, baseType: !192, size: 32, align: 32, offset: 1312)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !241, file: !62, line: 391, baseType: !192, size: 32, align: 32, offset: 1344)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !241, file: !62, line: 396, baseType: !186, size: 64, align: 64, offset: 1408)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !241, file: !62, line: 403, baseType: !279, size: 512, align: 64, offset: 1472)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 512, align: 64, elements: !249)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !247, line: 55, baseType: !281)
!281 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !241, file: !62, line: 410, baseType: !192, size: 32, align: 32, offset: 1984)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !241, file: !62, line: 415, baseType: !192, size: 32, align: 32, offset: 2016)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !241, file: !62, line: 420, baseType: !192, size: 32, align: 32, offset: 2048)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !241, file: !62, line: 425, baseType: !192, size: 32, align: 32, offset: 2080)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !241, file: !62, line: 435, baseType: !269, size: 64, align: 64, offset: 2112)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !241, file: !62, line: 440, baseType: !192, size: 32, align: 32, offset: 2176)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !241, file: !62, line: 445, baseType: !280, size: 64, align: 64, offset: 2240)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !241, file: !62, line: 459, baseType: !290, size: 512, align: 64, offset: 2304)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 512, align: 64, elements: !249)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !293, line: 94, baseType: !294)
!293 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !293, line: 81, size: 192, align: 64, elements: !295)
!295 = !{!296, !300, !301}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !294, file: !293, line: 82, baseType: !297, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !293, line: 73, baseType: !299)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !293, line: 73, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !294, file: !293, line: 89, baseType: !245, size: 64, align: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !294, file: !293, line: 93, baseType: !192, size: 32, align: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !241, file: !62, line: 473, baseType: !303, size: 64, align: 64, offset: 2816)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !241, file: !62, line: 477, baseType: !192, size: 32, align: 32, offset: 2880)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !241, file: !62, line: 479, baseType: !306, size: 64, align: 64, offset: 2944)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !62, line: 207, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !62, line: 201, size: 320, align: 64, elements: !310)
!310 = !{!311, !312, !313, !314, !319}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !309, file: !62, line: 202, baseType: !61, size: 32, align: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !309, file: !62, line: 203, baseType: !245, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !309, file: !62, line: 204, baseType: !192, size: 32, align: 32, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !309, file: !62, line: 205, baseType: !315, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !317, line: 86, baseType: !318)
!317 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !317, line: 86, flags: DIFlagFwdDecl)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !309, file: !62, line: 206, baseType: !291, size: 64, align: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !241, file: !62, line: 480, baseType: !192, size: 32, align: 32, offset: 3008)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !241, file: !62, line: 505, baseType: !192, size: 32, align: 32, offset: 3040)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !241, file: !62, line: 512, baseType: !85, size: 32, align: 32, offset: 3072)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !241, file: !62, line: 514, baseType: !92, size: 32, align: 32, offset: 3104)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !241, file: !62, line: 516, baseType: !110, size: 32, align: 32, offset: 3136)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !241, file: !62, line: 523, baseType: !134, size: 32, align: 32, offset: 3168)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !241, file: !62, line: 525, baseType: !153, size: 32, align: 32, offset: 3200)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !241, file: !62, line: 532, baseType: !269, size: 64, align: 64, offset: 3264)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !241, file: !62, line: 539, baseType: !269, size: 64, align: 64, offset: 3328)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !241, file: !62, line: 547, baseType: !269, size: 64, align: 64, offset: 3392)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !241, file: !62, line: 554, baseType: !315, size: 64, align: 64, offset: 3456)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !241, file: !62, line: 563, baseType: !192, size: 32, align: 32, offset: 3520)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !241, file: !62, line: 572, baseType: !192, size: 32, align: 32, offset: 3552)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !241, file: !62, line: 581, baseType: !192, size: 32, align: 32, offset: 3584)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !241, file: !62, line: 588, baseType: !335, size: 64, align: 64, offset: 3648)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !270, line: 194, baseType: !337)
!337 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !241, file: !62, line: 593, baseType: !192, size: 32, align: 32, offset: 3712)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !241, file: !62, line: 596, baseType: !192, size: 32, align: 32, offset: 3744)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !241, file: !62, line: 599, baseType: !291, size: 64, align: 64, offset: 3776)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !241, file: !62, line: 605, baseType: !291, size: 64, align: 64, offset: 3840)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !241, file: !62, line: 616, baseType: !291, size: 64, align: 64, offset: 3904)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !241, file: !62, line: 626, baseType: !344, size: 64, align: 64, offset: 3968)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !345, line: 216, baseType: !281)
!345 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!346 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !241, file: !62, line: 627, baseType: !344, size: 64, align: 64, offset: 4032)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !241, file: !62, line: 628, baseType: !344, size: 64, align: 64, offset: 4096)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !241, file: !62, line: 629, baseType: !344, size: 64, align: 64, offset: 4160)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !241, file: !62, line: 645, baseType: !291, size: 64, align: 64, offset: 4224)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterLink", file: !164, line: 68, baseType: !165)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "get_audio_buffer", scope: !230, file: !231, line: 81, baseType: !353, size: 64, align: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!239, !350, !192}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "filter_frame", scope: !230, file: !231, line: 93, baseType: !357, size: 64, align: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!192, !350, !239}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "poll_frame", scope: !230, file: !231, line: 104, baseType: !361, size: 64, align: 64, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!192, !350}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "request_frame", scope: !230, file: !231, line: 113, baseType: !361, size: 64, align: 64, offset: 384)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "config_props", scope: !230, file: !231, line: 129, baseType: !361, size: 64, align: 64, offset: 448)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "needs_fifo", scope: !230, file: !231, line: 137, baseType: !192, size: 32, align: 32, offset: 512)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "needs_writable", scope: !230, file: !231, line: 145, baseType: !192, size: 32, align: 32, offset: 544)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !222, file: !164, line: 172, baseType: !227, size: 64, align: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !222, file: !164, line: 182, baseType: !173, size: 64, align: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !222, file: !164, line: 187, baseType: !192, size: 32, align: 32, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "preinit", scope: !222, file: !164, line: 210, baseType: !372, size: 64, align: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!192, !168}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !222, file: !164, line: 233, baseType: !372, size: 64, align: 64, offset: 448)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "init_dict", scope: !222, file: !164, line: 246, baseType: !377, size: 64, align: 64, offset: 512)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!192, !168, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !222, file: !164, line: 258, baseType: !382, size: 64, align: 64, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{null, !168}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "query_formats", scope: !222, file: !164, line: 282, baseType: !372, size: 64, align: 64, offset: 640)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "priv_size", scope: !222, file: !164, line: 284, baseType: !192, size: 32, align: 32, offset: 704)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "flags_internal", scope: !222, file: !164, line: 286, baseType: !192, size: 32, align: 32, offset: 736)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !222, file: !164, line: 292, baseType: !389, size: 64, align: 64, offset: 768)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "process_command", scope: !222, file: !164, line: 306, baseType: !391, size: 64, align: 64, offset: 832)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!192, !168, !179, !179, !394, !192, !192}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "init_opaque", scope: !222, file: !164, line: 313, baseType: !396, size: 64, align: 64, offset: 896)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!192, !168, !186}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !222, file: !164, line: 327, baseType: !372, size: 64, align: 64, offset: 960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !170, file: !164, line: 343, baseType: !394, size: 64, align: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "input_pads", scope: !170, file: !164, line: 345, baseType: !402, size: 64, align: 64, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !170, file: !164, line: 346, baseType: !404, size: 64, align: 64, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !170, file: !164, line: 347, baseType: !406, size: 32, align: 32, offset: 320)
!406 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "output_pads", scope: !170, file: !164, line: 349, baseType: !402, size: 64, align: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !170, file: !164, line: 350, baseType: !404, size: 64, align: 64, offset: 448)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "nb_outputs", scope: !170, file: !164, line: 351, baseType: !406, size: 32, align: 32, offset: 512)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !170, file: !164, line: 353, baseType: !186, size: 64, align: 64, offset: 576)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !170, file: !164, line: 355, baseType: !412, size: 64, align: 64, offset: 640)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraph", file: !164, line: 840, size: 768, align: 64, elements: !414)
!414 = !{!415, !416, !418, !419, !420, !421, !422, !423, !445, !446, !447, !448, !449, !450}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !413, file: !164, line: 841, baseType: !173, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !413, file: !164, line: 842, baseType: !417, size: 64, align: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "nb_filters", scope: !413, file: !164, line: 843, baseType: !406, size: 32, align: 32, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "scale_sws_opts", scope: !413, file: !164, line: 845, baseType: !394, size: 64, align: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "resample_lavr_opts", scope: !413, file: !164, line: 847, baseType: !394, size: 64, align: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !413, file: !164, line: 862, baseType: !192, size: 32, align: 32, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !413, file: !164, line: 869, baseType: !192, size: 32, align: 32, offset: 352)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !413, file: !164, line: 874, baseType: !424, size: 64, align: 64, offset: 384)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterGraphInternal", file: !164, line: 809, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraphInternal", file: !231, line: 148, size: 192, align: 64, elements: !427)
!427 = !{!428, !429, !439}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !426, file: !231, line: 149, baseType: !186, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "thread_execute", scope: !426, file: !231, line: 150, baseType: !430, size: 64, align: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_execute_func", file: !164, line: 837, baseType: !432)
!432 = !DISubroutineType(types: !433)
!433 = !{!192, !168, !434, !186, !438, !192}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_action_func", file: !164, line: 823, baseType: !436)
!436 = !DISubroutineType(types: !437)
!437 = !{!192, !168, !186, !192, !192}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "frame_queues", scope: !426, file: !231, line: 151, baseType: !440, size: 8, align: 8, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameQueueGlobal", file: !441, line: 48, baseType: !442)
!441 = !DIFile(filename: "libavfilter/framequeue.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameQueueGlobal", file: !441, line: 46, size: 8, align: 8, elements: !443)
!443 = !{!444}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !442, file: !441, line: 47, baseType: !181, size: 8, align: 8)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !413, file: !164, line: 881, baseType: !186, size: 64, align: 64, offset: 448)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !413, file: !164, line: 895, baseType: !430, size: 64, align: 64, offset: 512)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "aresample_swr_opts", scope: !413, file: !164, line: 897, baseType: !394, size: 64, align: 64, offset: 576)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links", scope: !413, file: !164, line: 906, baseType: !404, size: 64, align: 64, offset: 640)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links_count", scope: !413, file: !164, line: 907, baseType: !192, size: 32, align: 32, offset: 704)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "disable_auto_convert", scope: !413, file: !164, line: 909, baseType: !406, size: 32, align: 32, offset: 736)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !170, file: !164, line: 373, baseType: !192, size: 32, align: 32, offset: 704)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !170, file: !164, line: 378, baseType: !453, size: 64, align: 64, offset: 768)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterInternal", file: !164, line: 335, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterInternal", file: !231, line: 154, size: 64, align: 64, elements: !456)
!456 = !{!457}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !455, file: !231, line: 155, baseType: !430, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "command_queue", scope: !170, file: !164, line: 380, baseType: !459, size: 64, align: 64, offset: 832)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterCommand", file: !231, line: 38, size: 320, align: 64, elements: !461)
!461 = !{!462, !464, !465, !466, !467}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !460, file: !231, line: 39, baseType: !463, size: 64, align: 64)
!463 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !460, file: !231, line: 40, baseType: !394, size: 64, align: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !460, file: !231, line: 41, baseType: !394, size: 64, align: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !460, file: !231, line: 42, baseType: !192, size: 32, align: 32, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !460, file: !231, line: 43, baseType: !459, size: 64, align: 64, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "enable_str", scope: !170, file: !164, line: 382, baseType: !394, size: 64, align: 64, offset: 896)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !170, file: !164, line: 383, baseType: !186, size: 64, align: 64, offset: 960)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "var_values", scope: !170, file: !164, line: 384, baseType: !471, size: 64, align: 64, offset: 1024)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "is_disabled", scope: !170, file: !164, line: 385, baseType: !192, size: 32, align: 32, offset: 1088)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !170, file: !164, line: 394, baseType: !291, size: 64, align: 64, offset: 1152)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !170, file: !164, line: 401, baseType: !192, size: 32, align: 32, offset: 1216)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !170, file: !164, line: 408, baseType: !406, size: 32, align: 32, offset: 1248)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !170, file: !164, line: 424, baseType: !192, size: 32, align: 32, offset: 1280)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "srcpad", scope: !165, file: !164, line: 441, baseType: !402, size: 64, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !165, file: !164, line: 443, baseType: !168, size: 64, align: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "dstpad", scope: !165, file: !164, line: 444, baseType: !402, size: 64, align: 64, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !165, file: !164, line: 446, baseType: !3, size: 32, align: 32, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !165, file: !164, line: 449, baseType: !192, size: 32, align: 32, offset: 288)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !165, file: !164, line: 450, baseType: !192, size: 32, align: 32, offset: 320)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !165, file: !164, line: 451, baseType: !262, size: 64, align: 32, offset: 352)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !165, file: !164, line: 453, baseType: !280, size: 64, align: 64, offset: 448)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !165, file: !164, line: 454, baseType: !192, size: 32, align: 32, offset: 512)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !165, file: !164, line: 456, baseType: !192, size: 32, align: 32, offset: 544)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !165, file: !164, line: 465, baseType: !262, size: 64, align: 32, offset: 576)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "in_formats", scope: !165, file: !164, line: 481, baseType: !489, size: 64, align: 64, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterFormats", file: !164, line: 70, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterFormats", file: !492, line: 64, size: 256, align: 64, elements: !493)
!492 = !DIFile(filename: "libavfilter/formats.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!493 = !{!494, !495, !496, !497}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "nb_formats", scope: !491, file: !492, line: 65, baseType: !406, size: 32, align: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !491, file: !492, line: 66, baseType: !438, size: 64, align: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !491, file: !492, line: 68, baseType: !406, size: 32, align: 32, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !491, file: !492, line: 69, baseType: !498, size: 64, align: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "out_formats", scope: !165, file: !164, line: 482, baseType: !489, size: 64, align: 64, offset: 704)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "in_samplerates", scope: !165, file: !164, line: 488, baseType: !489, size: 64, align: 64, offset: 768)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "out_samplerates", scope: !165, file: !164, line: 489, baseType: !489, size: 64, align: 64, offset: 832)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "in_channel_layouts", scope: !165, file: !164, line: 490, baseType: !505, size: 64, align: 64, offset: 896)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64, align: 64)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterChannelLayouts", file: !492, line: 85, size: 256, align: 64, elements: !507)
!507 = !{!508, !510, !511, !512, !513, !514}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !506, file: !492, line: 86, baseType: !509, size: 64, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "nb_channel_layouts", scope: !506, file: !492, line: 87, baseType: !192, size: 32, align: 32, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "all_layouts", scope: !506, file: !492, line: 88, baseType: !181, size: 8, align: 8, offset: 96)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "all_counts", scope: !506, file: !492, line: 89, baseType: !181, size: 8, align: 8, offset: 104)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !506, file: !492, line: 91, baseType: !406, size: 32, align: 32, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !506, file: !492, line: 92, baseType: !515, size: 64, align: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "out_channel_layouts", scope: !165, file: !164, line: 491, baseType: !505, size: 64, align: 64, offset: 960)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "request_samples", scope: !165, file: !164, line: 500, baseType: !192, size: 32, align: 32, offset: 1024)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !165, file: !164, line: 507, baseType: !163, size: 32, align: 32, offset: 1056)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !165, file: !164, line: 512, baseType: !412, size: 64, align: 64, offset: 1088)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts", scope: !165, file: !164, line: 518, baseType: !269, size: 64, align: 64, offset: 1152)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts_us", scope: !165, file: !164, line: 524, baseType: !269, size: 64, align: 64, offset: 1216)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "age_index", scope: !165, file: !164, line: 529, baseType: !192, size: 32, align: 32, offset: 1280)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !165, file: !164, line: 542, baseType: !262, size: 64, align: 32, offset: 1312)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf", scope: !165, file: !164, line: 547, baseType: !239, size: 64, align: 64, offset: 1408)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf_size", scope: !165, file: !164, line: 553, baseType: !192, size: 32, align: 32, offset: 1472)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "min_samples", scope: !165, file: !164, line: 562, baseType: !192, size: 32, align: 32, offset: 1504)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "max_samples", scope: !165, file: !164, line: 568, baseType: !192, size: 32, align: 32, offset: 1536)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !165, file: !164, line: 573, baseType: !192, size: 32, align: 32, offset: 1568)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !165, file: !164, line: 578, baseType: !406, size: 32, align: 32, offset: 1600)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_in", scope: !165, file: !164, line: 583, baseType: !269, size: 64, align: 64, offset: 1664)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_out", scope: !165, file: !164, line: 583, baseType: !269, size: 64, align: 64, offset: 1728)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pool", scope: !165, file: !164, line: 588, baseType: !186, size: 64, align: 64, offset: 1792)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "frame_wanted_out", scope: !165, file: !164, line: 595, baseType: !192, size: 32, align: 32, offset: 1856)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !165, file: !164, line: 601, baseType: !291, size: 64, align: 64, offset: 1920)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !165, file: !164, line: 610, baseType: !537, size: 491520, align: 8, offset: 1984)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 491520, align: 8, elements: !538)
!538 = !{!539}
!539 = !DISubrange(count: 61440)
!540 = !{!541, !542, !543}
!541 = !DIEnumerator(name: "AVLINK_UNINIT", value: 0)
!542 = !DIEnumerator(name: "AVLINK_STARTINIT", value: 1)
!543 = !DIEnumerator(name: "AVLINK_INIT", value: 2)
!544 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPixelFormat", file: !86, line: 64, size: 32, align: 32, elements: !545)
!545 = !{!546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742}
!546 = !DIEnumerator(name: "AV_PIX_FMT_NONE", value: -1)
!547 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P", value: 0)
!548 = !DIEnumerator(name: "AV_PIX_FMT_YUYV422", value: 1)
!549 = !DIEnumerator(name: "AV_PIX_FMT_RGB24", value: 2)
!550 = !DIEnumerator(name: "AV_PIX_FMT_BGR24", value: 3)
!551 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P", value: 4)
!552 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P", value: 5)
!553 = !DIEnumerator(name: "AV_PIX_FMT_YUV410P", value: 6)
!554 = !DIEnumerator(name: "AV_PIX_FMT_YUV411P", value: 7)
!555 = !DIEnumerator(name: "AV_PIX_FMT_GRAY8", value: 8)
!556 = !DIEnumerator(name: "AV_PIX_FMT_MONOWHITE", value: 9)
!557 = !DIEnumerator(name: "AV_PIX_FMT_MONOBLACK", value: 10)
!558 = !DIEnumerator(name: "AV_PIX_FMT_PAL8", value: 11)
!559 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ420P", value: 12)
!560 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ422P", value: 13)
!561 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ444P", value: 14)
!562 = !DIEnumerator(name: "AV_PIX_FMT_UYVY422", value: 15)
!563 = !DIEnumerator(name: "AV_PIX_FMT_UYYVYY411", value: 16)
!564 = !DIEnumerator(name: "AV_PIX_FMT_BGR8", value: 17)
!565 = !DIEnumerator(name: "AV_PIX_FMT_BGR4", value: 18)
!566 = !DIEnumerator(name: "AV_PIX_FMT_BGR4_BYTE", value: 19)
!567 = !DIEnumerator(name: "AV_PIX_FMT_RGB8", value: 20)
!568 = !DIEnumerator(name: "AV_PIX_FMT_RGB4", value: 21)
!569 = !DIEnumerator(name: "AV_PIX_FMT_RGB4_BYTE", value: 22)
!570 = !DIEnumerator(name: "AV_PIX_FMT_NV12", value: 23)
!571 = !DIEnumerator(name: "AV_PIX_FMT_NV21", value: 24)
!572 = !DIEnumerator(name: "AV_PIX_FMT_ARGB", value: 25)
!573 = !DIEnumerator(name: "AV_PIX_FMT_RGBA", value: 26)
!574 = !DIEnumerator(name: "AV_PIX_FMT_ABGR", value: 27)
!575 = !DIEnumerator(name: "AV_PIX_FMT_BGRA", value: 28)
!576 = !DIEnumerator(name: "AV_PIX_FMT_GRAY16BE", value: 29)
!577 = !DIEnumerator(name: "AV_PIX_FMT_GRAY16LE", value: 30)
!578 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P", value: 31)
!579 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ440P", value: 32)
!580 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P", value: 33)
!581 = !DIEnumerator(name: "AV_PIX_FMT_RGB48BE", value: 34)
!582 = !DIEnumerator(name: "AV_PIX_FMT_RGB48LE", value: 35)
!583 = !DIEnumerator(name: "AV_PIX_FMT_RGB565BE", value: 36)
!584 = !DIEnumerator(name: "AV_PIX_FMT_RGB565LE", value: 37)
!585 = !DIEnumerator(name: "AV_PIX_FMT_RGB555BE", value: 38)
!586 = !DIEnumerator(name: "AV_PIX_FMT_RGB555LE", value: 39)
!587 = !DIEnumerator(name: "AV_PIX_FMT_BGR565BE", value: 40)
!588 = !DIEnumerator(name: "AV_PIX_FMT_BGR565LE", value: 41)
!589 = !DIEnumerator(name: "AV_PIX_FMT_BGR555BE", value: 42)
!590 = !DIEnumerator(name: "AV_PIX_FMT_BGR555LE", value: 43)
!591 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_MOCO", value: 44)
!592 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_IDCT", value: 45)
!593 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_VLD", value: 46)
!594 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI", value: 46)
!595 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P16LE", value: 47)
!596 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P16BE", value: 48)
!597 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P16LE", value: 49)
!598 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P16BE", value: 50)
!599 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P16LE", value: 51)
!600 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P16BE", value: 52)
!601 = !DIEnumerator(name: "AV_PIX_FMT_DXVA2_VLD", value: 53)
!602 = !DIEnumerator(name: "AV_PIX_FMT_RGB444LE", value: 54)
!603 = !DIEnumerator(name: "AV_PIX_FMT_RGB444BE", value: 55)
!604 = !DIEnumerator(name: "AV_PIX_FMT_BGR444LE", value: 56)
!605 = !DIEnumerator(name: "AV_PIX_FMT_BGR444BE", value: 57)
!606 = !DIEnumerator(name: "AV_PIX_FMT_YA8", value: 58)
!607 = !DIEnumerator(name: "AV_PIX_FMT_Y400A", value: 58)
!608 = !DIEnumerator(name: "AV_PIX_FMT_GRAY8A", value: 58)
!609 = !DIEnumerator(name: "AV_PIX_FMT_BGR48BE", value: 59)
!610 = !DIEnumerator(name: "AV_PIX_FMT_BGR48LE", value: 60)
!611 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P9BE", value: 61)
!612 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P9LE", value: 62)
!613 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P10BE", value: 63)
!614 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P10LE", value: 64)
!615 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P10BE", value: 65)
!616 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P10LE", value: 66)
!617 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P9BE", value: 67)
!618 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P9LE", value: 68)
!619 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P10BE", value: 69)
!620 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P10LE", value: 70)
!621 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P9BE", value: 71)
!622 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P9LE", value: 72)
!623 = !DIEnumerator(name: "AV_PIX_FMT_GBRP", value: 73)
!624 = !DIEnumerator(name: "AV_PIX_FMT_GBR24P", value: 73)
!625 = !DIEnumerator(name: "AV_PIX_FMT_GBRP9BE", value: 74)
!626 = !DIEnumerator(name: "AV_PIX_FMT_GBRP9LE", value: 75)
!627 = !DIEnumerator(name: "AV_PIX_FMT_GBRP10BE", value: 76)
!628 = !DIEnumerator(name: "AV_PIX_FMT_GBRP10LE", value: 77)
!629 = !DIEnumerator(name: "AV_PIX_FMT_GBRP16BE", value: 78)
!630 = !DIEnumerator(name: "AV_PIX_FMT_GBRP16LE", value: 79)
!631 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P", value: 80)
!632 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P", value: 81)
!633 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P9BE", value: 82)
!634 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P9LE", value: 83)
!635 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P9BE", value: 84)
!636 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P9LE", value: 85)
!637 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P9BE", value: 86)
!638 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P9LE", value: 87)
!639 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P10BE", value: 88)
!640 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P10LE", value: 89)
!641 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P10BE", value: 90)
!642 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P10LE", value: 91)
!643 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P10BE", value: 92)
!644 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P10LE", value: 93)
!645 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P16BE", value: 94)
!646 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P16LE", value: 95)
!647 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P16BE", value: 96)
!648 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P16LE", value: 97)
!649 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P16BE", value: 98)
!650 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P16LE", value: 99)
!651 = !DIEnumerator(name: "AV_PIX_FMT_VDPAU", value: 100)
!652 = !DIEnumerator(name: "AV_PIX_FMT_XYZ12LE", value: 101)
!653 = !DIEnumerator(name: "AV_PIX_FMT_XYZ12BE", value: 102)
!654 = !DIEnumerator(name: "AV_PIX_FMT_NV16", value: 103)
!655 = !DIEnumerator(name: "AV_PIX_FMT_NV20LE", value: 104)
!656 = !DIEnumerator(name: "AV_PIX_FMT_NV20BE", value: 105)
!657 = !DIEnumerator(name: "AV_PIX_FMT_RGBA64BE", value: 106)
!658 = !DIEnumerator(name: "AV_PIX_FMT_RGBA64LE", value: 107)
!659 = !DIEnumerator(name: "AV_PIX_FMT_BGRA64BE", value: 108)
!660 = !DIEnumerator(name: "AV_PIX_FMT_BGRA64LE", value: 109)
!661 = !DIEnumerator(name: "AV_PIX_FMT_YVYU422", value: 110)
!662 = !DIEnumerator(name: "AV_PIX_FMT_YA16BE", value: 111)
!663 = !DIEnumerator(name: "AV_PIX_FMT_YA16LE", value: 112)
!664 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP", value: 113)
!665 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP16BE", value: 114)
!666 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP16LE", value: 115)
!667 = !DIEnumerator(name: "AV_PIX_FMT_QSV", value: 116)
!668 = !DIEnumerator(name: "AV_PIX_FMT_MMAL", value: 117)
!669 = !DIEnumerator(name: "AV_PIX_FMT_D3D11VA_VLD", value: 118)
!670 = !DIEnumerator(name: "AV_PIX_FMT_CUDA", value: 119)
!671 = !DIEnumerator(name: "AV_PIX_FMT_0RGB", value: 120)
!672 = !DIEnumerator(name: "AV_PIX_FMT_RGB0", value: 121)
!673 = !DIEnumerator(name: "AV_PIX_FMT_0BGR", value: 122)
!674 = !DIEnumerator(name: "AV_PIX_FMT_BGR0", value: 123)
!675 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P12BE", value: 124)
!676 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P12LE", value: 125)
!677 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P14BE", value: 126)
!678 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P14LE", value: 127)
!679 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P12BE", value: 128)
!680 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P12LE", value: 129)
!681 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P14BE", value: 130)
!682 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P14LE", value: 131)
!683 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P12BE", value: 132)
!684 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P12LE", value: 133)
!685 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P14BE", value: 134)
!686 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P14LE", value: 135)
!687 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12BE", value: 136)
!688 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12LE", value: 137)
!689 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14BE", value: 138)
!690 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14LE", value: 139)
!691 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ411P", value: 140)
!692 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR8", value: 141)
!693 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB8", value: 142)
!694 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG8", value: 143)
!695 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG8", value: 144)
!696 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16LE", value: 145)
!697 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16BE", value: 146)
!698 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16LE", value: 147)
!699 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16BE", value: 148)
!700 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16LE", value: 149)
!701 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16BE", value: 150)
!702 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16LE", value: 151)
!703 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16BE", value: 152)
!704 = !DIEnumerator(name: "AV_PIX_FMT_XVMC", value: 153)
!705 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10LE", value: 154)
!706 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10BE", value: 155)
!707 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12LE", value: 156)
!708 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12BE", value: 157)
!709 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64LE", value: 158)
!710 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64BE", value: 159)
!711 = !DIEnumerator(name: "AV_PIX_FMT_VIDEOTOOLBOX", value: 160)
!712 = !DIEnumerator(name: "AV_PIX_FMT_P010LE", value: 161)
!713 = !DIEnumerator(name: "AV_PIX_FMT_P010BE", value: 162)
!714 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12BE", value: 163)
!715 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12LE", value: 164)
!716 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10BE", value: 165)
!717 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10LE", value: 166)
!718 = !DIEnumerator(name: "AV_PIX_FMT_MEDIACODEC", value: 167)
!719 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12BE", value: 168)
!720 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12LE", value: 169)
!721 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10BE", value: 170)
!722 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10LE", value: 171)
!723 = !DIEnumerator(name: "AV_PIX_FMT_P016LE", value: 172)
!724 = !DIEnumerator(name: "AV_PIX_FMT_P016BE", value: 173)
!725 = !DIEnumerator(name: "AV_PIX_FMT_D3D11", value: 174)
!726 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9BE", value: 175)
!727 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9LE", value: 176)
!728 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32BE", value: 177)
!729 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32LE", value: 178)
!730 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32BE", value: 179)
!731 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32LE", value: 180)
!732 = !DIEnumerator(name: "AV_PIX_FMT_DRM_PRIME", value: 181)
!733 = !DIEnumerator(name: "AV_PIX_FMT_OPENCL", value: 182)
!734 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14BE", value: 183)
!735 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14LE", value: 184)
!736 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32BE", value: 185)
!737 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32LE", value: 186)
!738 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12BE", value: 187)
!739 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12LE", value: 188)
!740 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12BE", value: 189)
!741 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12LE", value: 190)
!742 = !DIEnumerator(name: "AV_PIX_FMT_NB", value: 191)
!743 = !{!186, !192}
!744 = !{!745}
!745 = distinct !DIGlobalVariable(name: "avfilter_all_channel_layouts", scope: !0, file: !746, line: 372, type: !747, isLocal: false, isDefinition: true, variable: [69 x i64]* @avfilter_all_channel_layouts)
!746 = !DIFile(filename: "libavfilter/formats.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 4416, align: 64, elements: !749)
!748 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!749 = !{!750}
!750 = !DISubrange(count: 69)
!751 = !{i32 2, !"Dwarf Version", i32 4}
!752 = !{i32 2, !"Debug Info Version", i32 3}
!753 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!754 = distinct !DISubprogram(name: "ff_merge_formats", scope: !746, file: !746, line: 92, type: !755, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !757)
!755 = !DISubroutineType(types: !756)
!756 = !{!489, !489, !489, !3}
!757 = !{}
!758 = !DILocalVariable(name: "a", arg: 1, scope: !754, file: !746, line: 92, type: !489)
!759 = !DIExpression()
!760 = !DILocation(line: 92, column: 52, scope: !754)
!761 = !DILocalVariable(name: "b", arg: 2, scope: !754, file: !746, line: 92, type: !489)
!762 = !DILocation(line: 92, column: 72, scope: !754)
!763 = !DILocalVariable(name: "type", arg: 3, scope: !754, file: !746, line: 93, type: !3)
!764 = !DILocation(line: 93, column: 52, scope: !754)
!765 = !DILocalVariable(name: "ret", scope: !754, file: !746, line: 95, type: !489)
!766 = !DILocation(line: 95, column: 22, scope: !754)
!767 = !DILocalVariable(name: "i", scope: !754, file: !746, line: 96, type: !192)
!768 = !DILocation(line: 96, column: 9, scope: !754)
!769 = !DILocalVariable(name: "j", scope: !754, file: !746, line: 96, type: !192)
!770 = !DILocation(line: 96, column: 12, scope: !754)
!771 = !DILocalVariable(name: "alpha1", scope: !754, file: !746, line: 97, type: !192)
!772 = !DILocation(line: 97, column: 9, scope: !754)
!773 = !DILocalVariable(name: "alpha2", scope: !754, file: !746, line: 97, type: !192)
!774 = !DILocation(line: 97, column: 19, scope: !754)
!775 = !DILocalVariable(name: "chroma1", scope: !754, file: !746, line: 98, type: !192)
!776 = !DILocation(line: 98, column: 9, scope: !754)
!777 = !DILocalVariable(name: "chroma2", scope: !754, file: !746, line: 98, type: !192)
!778 = !DILocation(line: 98, column: 20, scope: !754)
!779 = !DILocation(line: 100, column: 9, scope: !780)
!780 = distinct !DILexicalBlock(scope: !754, file: !746, line: 100, column: 9)
!781 = !DILocation(line: 100, column: 14, scope: !780)
!782 = !DILocation(line: 100, column: 11, scope: !780)
!783 = !DILocation(line: 100, column: 9, scope: !754)
!784 = !DILocation(line: 101, column: 16, scope: !780)
!785 = !DILocation(line: 101, column: 9, scope: !780)
!786 = !DILocation(line: 110, column: 9, scope: !787)
!787 = distinct !DILexicalBlock(scope: !754, file: !746, line: 110, column: 9)
!788 = !DILocation(line: 110, column: 14, scope: !787)
!789 = !DILocation(line: 110, column: 9, scope: !754)
!790 = !DILocation(line: 111, column: 16, scope: !791)
!791 = distinct !DILexicalBlock(scope: !787, file: !746, line: 111, column: 9)
!792 = !DILocation(line: 111, column: 14, scope: !791)
!793 = !DILocation(line: 111, column: 21, scope: !794)
!794 = !DILexicalBlockFile(scope: !795, file: !746, discriminator: 1)
!795 = distinct !DILexicalBlock(scope: !791, file: !746, line: 111, column: 9)
!796 = !DILocation(line: 111, column: 25, scope: !794)
!797 = !DILocation(line: 111, column: 28, scope: !794)
!798 = !DILocation(line: 111, column: 23, scope: !794)
!799 = !DILocation(line: 111, column: 9, scope: !794)
!800 = !DILocation(line: 112, column: 20, scope: !801)
!801 = distinct !DILexicalBlock(scope: !795, file: !746, line: 112, column: 13)
!802 = !DILocation(line: 112, column: 18, scope: !801)
!803 = !DILocation(line: 112, column: 25, scope: !804)
!804 = !DILexicalBlockFile(scope: !805, file: !746, discriminator: 1)
!805 = distinct !DILexicalBlock(scope: !801, file: !746, line: 112, column: 13)
!806 = !DILocation(line: 112, column: 29, scope: !804)
!807 = !DILocation(line: 112, column: 32, scope: !804)
!808 = !DILocation(line: 112, column: 27, scope: !804)
!809 = !DILocation(line: 112, column: 13, scope: !804)
!810 = !DILocalVariable(name: "adesc", scope: !811, file: !746, line: 113, type: !812)
!811 = distinct !DILexicalBlock(scope: !805, file: !746, line: 112, column: 49)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64, align: 64)
!813 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPixFmtDescriptor", file: !815, line: 123, baseType: !816)
!815 = !DIFile(filename: "./libavutil/pixdesc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPixFmtDescriptor", file: !815, line: 81, size: 1280, align: 64, elements: !817)
!817 = !{!818, !819, !820, !821, !822, !823, !838}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !816, file: !815, line: 82, baseType: !179, size: 64, align: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !816, file: !815, line: 83, baseType: !246, size: 8, align: 8, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_w", scope: !816, file: !815, line: 92, baseType: !246, size: 8, align: 8, offset: 72)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_h", scope: !816, file: !815, line: 101, baseType: !246, size: 8, align: 8, offset: 80)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !816, file: !815, line: 106, baseType: !280, size: 64, align: 64, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !816, file: !815, line: 117, baseType: !824, size: 1024, align: 32, offset: 192)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !825, size: 1024, align: 32, elements: !836)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVComponentDescriptor", file: !815, line: 70, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVComponentDescriptor", file: !815, line: 31, size: 256, align: 32, elements: !827)
!827 = !{!828, !829, !830, !831, !832, !833, !834, !835}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !826, file: !815, line: 35, baseType: !192, size: 32, align: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !826, file: !815, line: 41, baseType: !192, size: 32, align: 32, offset: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !826, file: !815, line: 47, baseType: !192, size: 32, align: 32, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !826, file: !815, line: 53, baseType: !192, size: 32, align: 32, offset: 96)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !826, file: !815, line: 58, baseType: !192, size: 32, align: 32, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "step_minus1", scope: !826, file: !815, line: 62, baseType: !192, size: 32, align: 32, offset: 160)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "depth_minus1", scope: !826, file: !815, line: 65, baseType: !192, size: 32, align: 32, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "offset_plus1", scope: !826, file: !815, line: 68, baseType: !192, size: 32, align: 32, offset: 224)
!836 = !{!837}
!837 = !DISubrange(count: 4)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !816, file: !815, line: 122, baseType: !179, size: 64, align: 64, offset: 1216)
!839 = !DILocation(line: 113, column: 43, scope: !811)
!840 = !DILocation(line: 113, column: 82, scope: !811)
!841 = !DILocation(line: 113, column: 71, scope: !811)
!842 = !DILocation(line: 113, column: 74, scope: !811)
!843 = !DILocation(line: 113, column: 51, scope: !811)
!844 = !DILocalVariable(name: "bdesc", scope: !811, file: !746, line: 114, type: !812)
!845 = !DILocation(line: 114, column: 43, scope: !811)
!846 = !DILocation(line: 114, column: 82, scope: !811)
!847 = !DILocation(line: 114, column: 71, scope: !811)
!848 = !DILocation(line: 114, column: 74, scope: !811)
!849 = !DILocation(line: 114, column: 51, scope: !811)
!850 = !DILocation(line: 115, column: 27, scope: !811)
!851 = !DILocation(line: 115, column: 34, scope: !811)
!852 = !DILocation(line: 115, column: 42, scope: !811)
!853 = !DILocation(line: 115, column: 49, scope: !811)
!854 = !DILocation(line: 115, column: 40, scope: !811)
!855 = !DILocation(line: 115, column: 55, scope: !811)
!856 = !DILocation(line: 115, column: 24, scope: !811)
!857 = !DILocation(line: 116, column: 27, scope: !811)
!858 = !DILocation(line: 116, column: 34, scope: !811)
!859 = !DILocation(line: 116, column: 48, scope: !811)
!860 = !DILocation(line: 116, column: 52, scope: !811)
!861 = !DILocation(line: 116, column: 55, scope: !862)
!862 = !DILexicalBlockFile(scope: !811, file: !746, discriminator: 1)
!863 = !DILocation(line: 116, column: 62, scope: !862)
!864 = !DILocation(line: 116, column: 76, scope: !862)
!865 = !DILocation(line: 116, column: 52, scope: !866)
!866 = !DILexicalBlockFile(scope: !811, file: !746, discriminator: 2)
!867 = !DILocation(line: 116, column: 24, scope: !866)
!868 = !DILocation(line: 117, column: 32, scope: !869)
!869 = distinct !DILexicalBlock(scope: !811, file: !746, line: 117, column: 21)
!870 = !DILocation(line: 117, column: 21, scope: !869)
!871 = !DILocation(line: 117, column: 24, scope: !869)
!872 = !DILocation(line: 117, column: 49, scope: !869)
!873 = !DILocation(line: 117, column: 38, scope: !869)
!874 = !DILocation(line: 117, column: 41, scope: !869)
!875 = !DILocation(line: 117, column: 35, scope: !869)
!876 = !DILocation(line: 117, column: 21, scope: !811)
!877 = !DILocation(line: 118, column: 31, scope: !878)
!878 = distinct !DILexicalBlock(scope: !869, file: !746, line: 117, column: 53)
!879 = !DILocation(line: 118, column: 38, scope: !878)
!880 = !DILocation(line: 118, column: 44, scope: !878)
!881 = !DILocation(line: 118, column: 28, scope: !878)
!882 = !DILocation(line: 119, column: 31, scope: !878)
!883 = !DILocation(line: 119, column: 38, scope: !878)
!884 = !DILocation(line: 119, column: 52, scope: !878)
!885 = !DILocation(line: 119, column: 28, scope: !878)
!886 = !DILocation(line: 120, column: 17, scope: !878)
!887 = !DILocation(line: 121, column: 13, scope: !811)
!888 = !DILocation(line: 112, column: 45, scope: !889)
!889 = !DILexicalBlockFile(scope: !805, file: !746, discriminator: 2)
!890 = !DILocation(line: 112, column: 13, scope: !889)
!891 = distinct !{!891, !892}
!892 = !DILocation(line: 112, column: 13, scope: !795)
!893 = !DILocation(line: 121, column: 13, scope: !894)
!894 = !DILexicalBlockFile(scope: !801, file: !746, discriminator: 1)
!895 = !DILocation(line: 111, column: 41, scope: !896)
!896 = !DILexicalBlockFile(scope: !795, file: !746, discriminator: 2)
!897 = !DILocation(line: 111, column: 9, scope: !896)
!898 = distinct !{!898, !899}
!899 = !DILocation(line: 111, column: 9, scope: !787)
!900 = !DILocation(line: 121, column: 13, scope: !901)
!901 = !DILexicalBlockFile(scope: !791, file: !746, discriminator: 2)
!902 = !DILocation(line: 124, column: 9, scope: !903)
!903 = distinct !DILexicalBlock(scope: !754, file: !746, line: 124, column: 9)
!904 = !DILocation(line: 124, column: 18, scope: !903)
!905 = !DILocation(line: 124, column: 16, scope: !903)
!906 = !DILocation(line: 124, column: 25, scope: !903)
