; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--x86--me_cmp_init.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--x86--me_cmp_init.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!874 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!875 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!876 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!877 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!878 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!879 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!880 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !57, line: 1534, size: 32, align: 32, elements: !881)
!881 = !{!882, !883, !884, !885, !886, !887}
!882 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!883 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!884 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!885 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!886 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!887 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!888 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !57, line: 810, size: 32, align: 32, elements: !889)
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899}
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!894 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!895 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!896 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!897 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!898 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !57, line: 798, size: 32, align: 32, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908}
!902 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!903 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!904 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!905 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!906 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!907 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!908 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OutputFormat", file: !910, line: 123, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "./libavcodec/mpegutils.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!911 = !{!912, !913, !914, !915}
!912 = !DIEnumerator(name: "FMT_MPEG1", value: 0)
!913 = !DIEnumerator(name: "FMT_H261", value: 1)
!914 = !DIEnumerator(name: "FMT_H263", value: 2)
!915 = !DIEnumerator(name: "FMT_MJPEG", value: 3)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !917, line: 37, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "./libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!918 = !{!919, !920, !921, !922, !923, !924}
!919 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!920 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!921 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!922 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!923 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!924 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!925 = !{!926}
!926 = distinct !DIGlobalVariable(name: "round_tab", scope: !0, file: !927, line: 273, type: !928, isLocal: true, isDefinition: true, variable: [3 x i64]* @round_tab)
!927 = !DIFile(filename: "libavcodec/x86/me_cmp_init.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 192, align: 64, elements: !933)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !931, line: 55, baseType: !932)
!931 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!932 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!933 = !{!934}
!934 = !DISubrange(count: 3)
!935 = !{i32 2, !"Dwarf Version", i32 4}
!936 = !{i32 2, !"Debug Info Version", i32 3}
!937 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!938 = distinct !DISubprogram(name: "ff_me_cmp_init_x86", scope: !927, file: !927, line: 556, type: !939, isLocal: false, isDefinition: true, scopeLine: 557, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2595)
!939 = !DISubroutineType(types: !940)
!940 = !{null, !941, !1124}
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "MECmpContext", file: !943, line: 80, baseType: !944)
!943 = !DIFile(filename: "./libavcodec/me_cmp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MECmpContext", file: !943, line: 53, size: 8640, align: 64, elements: !945)
!945 = !{!946, !954, !2572, !2573, !2574, !2575, !2576, !2577, !2578, !2579, !2580, !2581, !2582, !2583, !2584, !2585, !2586, !2587, !2588, !2589, !2590, !2591, !2594}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "sum_abs_dctelem", scope: !944, file: !943, line: 54, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!950, !951}
!950 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !931, line: 37, baseType: !953)
!953 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "sad", scope: !944, file: !943, line: 56, baseType: !955, size: 384, align: 64, offset: 64)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 384, align: 64, elements: !2190)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "me_cmp_func", file: !943, line: 48, baseType: !957)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!950, !960, !1150, !1150, !1777, !950}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !962, line: 81, size: 86208, align: 64, elements: !963)
!962 = !DIFile(filename: "./libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!963 = !{!964, !1048, !1049, !1050, !1051, !1055, !1056, !1070, !1071, !1072, !1073, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1778, !1779, !1832, !1834, !1835, !1836, !1837, !1838, !1849, !1850, !1851, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1865, !1866, !1868, !1869, !1870, !1871, !1872, !1873, !1878, !1880, !1881, !1882, !1883, !1884, !1885, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1912, !1913, !1914, !1915, !1931, !1938, !1950, !1966, !1988, !1989, !2002, !2029, !2044, !2058, !2071, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2092, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2105, !2107, !2108, !2109, !2110, !2111, !2112, !2115, !2117, !2119, !2120, !2123, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2192, !2193, !2195, !2196, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2218, !2219, !2220, !2223, !2224, !2225, !2226, !2228, !2230, !2231, !2232, !2233, !2234, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2316, !2317, !2318, !2332, !2333, !2334, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2447, !2448, !2449, !2450, !2454, !2455, !2459, !2463, !2467, !2468, !2473, !2477, !2478, !2479, !2480, !2481, !2482, !2483, !2484, !2488, !2489, !2493, !2494, !2495, !2496, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2507, !2508, !2509, !2559, !2560, !2564, !2565, !2566, !2567, !2568, !2569, !2570, !2571}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !961, file: !962, line: 82, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !968)
!968 = !{!969, !973, !978, !1007, !1008, !1009, !1010, !1014, !1020, !1022, !1026}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !967, file: !26, line: 72, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !967, file: !26, line: 78, baseType: !974, size: 64, align: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!970, !977}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !967, file: !26, line: 85, baseType: !979, size: 64, align: 64, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !982)
!982 = !{!983, !984, !985, !986, !987, !1003, !1004, !1005, !1006}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !981, file: !4, line: 247, baseType: !970, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !981, file: !4, line: 253, baseType: !970, size: 64, align: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !981, file: !4, line: 259, baseType: !950, size: 32, align: 32, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !981, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !981, file: !4, line: 271, baseType: !988, size: 64, align: 64, offset: 192)
!988 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !981, file: !4, line: 265, size: 64, align: 64, elements: !989)
!989 = !{!990, !993, !995, !996}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !988, file: !4, line: 266, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !931, line: 40, baseType: !992)
!992 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !988, file: !4, line: 267, baseType: !994, size: 64, align: 64)
!994 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !988, file: !4, line: 268, baseType: !970, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !988, file: !4, line: 270, baseType: !997, size: 64, align: 32)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !998, line: 61, baseType: !999)
!998 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !998, line: 58, size: 64, align: 32, elements: !1000)
!1000 = !{!1001, !1002}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !999, file: !998, line: 59, baseType: !950, size: 32, align: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !999, file: !998, line: 60, baseType: !950, size: 32, align: 32, offset: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !981, file: !4, line: 272, baseType: !994, size: 64, align: 64, offset: 256)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !981, file: !4, line: 273, baseType: !994, size: 64, align: 64, offset: 320)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !981, file: !4, line: 275, baseType: !950, size: 32, align: 32, offset: 384)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !981, file: !4, line: 300, baseType: !970, size: 64, align: 64, offset: 448)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !967, file: !26, line: 93, baseType: !950, size: 32, align: 32, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !967, file: !26, line: 99, baseType: !950, size: 32, align: 32, offset: 224)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !967, file: !26, line: 108, baseType: !950, size: 32, align: 32, offset: 256)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !967, file: !26, line: 113, baseType: !1011, size: 64, align: 64, offset: 320)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!977, !977, !977}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !967, file: !26, line: 123, baseType: !1015, size: 64, align: 64, offset: 384)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!1018, !1018}
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !967, file: !26, line: 130, baseType: !1021, size: 32, align: 32, offset: 448)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !967, file: !26, line: 136, baseType: !1023, size: 64, align: 64, offset: 512)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!1021, !977}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !967, file: !26, line: 142, baseType: !1027, size: 64, align: 64, offset: 576)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!950, !1030, !977, !970, !950}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1033)
!1033 = !{!1034, !1046, !1047}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1032, file: !4, line: 360, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1039)
!1039 = !{!1040, !1041, !1042, !1043, !1044, !1045}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1038, file: !4, line: 307, baseType: !970, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1038, file: !4, line: 313, baseType: !994, size: 64, align: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1038, file: !4, line: 313, baseType: !994, size: 64, align: 64, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1038, file: !4, line: 318, baseType: !994, size: 64, align: 64, offset: 192)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1038, file: !4, line: 318, baseType: !994, size: 64, align: 64, offset: 256)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1038, file: !4, line: 323, baseType: !950, size: 32, align: 32, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1032, file: !4, line: 364, baseType: !950, size: 32, align: 32, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1032, file: !4, line: 368, baseType: !950, size: 32, align: 32, offset: 96)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !961, file: !962, line: 84, baseType: !950, size: 32, align: 32, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !961, file: !962, line: 84, baseType: !950, size: 32, align: 32, offset: 96)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !961, file: !962, line: 85, baseType: !950, size: 32, align: 32, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !961, file: !962, line: 86, baseType: !1052, size: 384, align: 32, offset: 160)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 384, align: 32, elements: !1053)
!1053 = !{!1054}
!1054 = !DISubrange(count: 12)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !961, file: !962, line: 87, baseType: !950, size: 32, align: 32, offset: 544)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !961, file: !962, line: 90, baseType: !1057, size: 1088, align: 64, offset: 576)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !917, line: 35, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !917, line: 31, size: 1088, align: 64, elements: !1059)
!1059 = !{!1060, !1065, !1069}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1058, file: !917, line: 32, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1063)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !931, line: 48, baseType: !1064)
!1064 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1058, file: !917, line: 33, baseType: !1066, size: 512, align: 8, offset: 64)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1063, size: 512, align: 8, elements: !1067)
!1067 = !{!1068}
!1068 = !DISubrange(count: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1058, file: !917, line: 34, baseType: !1066, size: 512, align: 8, offset: 576)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !961, file: !962, line: 91, baseType: !1057, size: 1088, align: 64, offset: 1664)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !961, file: !962, line: 92, baseType: !1057, size: 1088, align: 64, offset: 2752)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !961, file: !962, line: 93, baseType: !1057, size: 1088, align: 64, offset: 3840)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !961, file: !962, line: 98, baseType: !1074, size: 64, align: 64, offset: 4928)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1076)
!1076 = !{!1077, !1080, !1081, !1082, !1346, !1347, !1348, !1349, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1501, !1505, !1506, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1683, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1075, file: !57, line: 1561, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1075, file: !57, line: 1562, baseType: !950, size: 32, align: 32, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1075, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1075, file: !57, line: 1565, baseType: !1083, size: 64, align: 64, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1085)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1086)
!1086 = !{!1087, !1088, !1089, !1090, !1091, !1092, !1095, !1098, !1101, !1104, !1106, !1107, !1108, !1116, !1117, !1118, !1120, !1126, !1132, !1141, !1145, !1146, !1196, !1317, !1321, !1322, !1326, !1330, !1335, !1339, !1340, !1341}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1085, file: !57, line: 3475, baseType: !970, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1085, file: !57, line: 3480, baseType: !970, size: 64, align: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1085, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1085, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1085, file: !57, line: 3487, baseType: !950, size: 32, align: 32, offset: 192)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1085, file: !57, line: 3488, baseType: !1093, size: 64, align: 64, offset: 256)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1085, file: !57, line: 3489, baseType: !1096, size: 64, align: 64, offset: 320)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1085, file: !57, line: 3490, baseType: !1099, size: 64, align: 64, offset: 384)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1085, file: !57, line: 3491, baseType: !1102, size: 64, align: 64, offset: 448)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1085, file: !57, line: 3492, baseType: !1105, size: 64, align: 64, offset: 512)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1085, file: !57, line: 3493, baseType: !1063, size: 8, align: 8, offset: 576)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1085, file: !57, line: 3494, baseType: !1078, size: 64, align: 64, offset: 640)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1085, file: !57, line: 3495, baseType: !1109, size: 64, align: 64, offset: 704)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1111)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1113)
!1113 = !{!1114, !1115}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1112, file: !57, line: 3402, baseType: !950, size: 32, align: 32)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1112, file: !57, line: 3403, baseType: !970, size: 64, align: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1085, file: !57, line: 3507, baseType: !970, size: 64, align: 64, offset: 768)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1085, file: !57, line: 3516, baseType: !950, size: 32, align: 32, offset: 832)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1085, file: !57, line: 3517, baseType: !1119, size: 64, align: 64, offset: 896)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1085, file: !57, line: 3527, baseType: !1121, size: 64, align: 64, offset: 960)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!950, !1124}
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1075)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1085, file: !57, line: 3535, baseType: !1127, size: 64, align: 64, offset: 1024)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!950, !1124, !1130}
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1125)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1085, file: !57, line: 3541, baseType: !1133, size: 64, align: 64, offset: 1088)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1135)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1136)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1137, line: 223, size: 128, align: 64, elements: !1138)
!1137 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1138 = !{!1139, !1140}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1136, file: !1137, line: 224, baseType: !1061, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1136, file: !1137, line: 225, baseType: !1061, size: 64, align: 64, offset: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1085, file: !57, line: 3549, baseType: !1142, size: 64, align: 64, offset: 1152)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{null, !1119}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1085, file: !57, line: 3551, baseType: !1121, size: 64, align: 64, offset: 1216)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1085, file: !57, line: 3552, baseType: !1147, size: 64, align: 64, offset: 1280)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!950, !1124, !1150, !950, !1151}
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1154)
!1154 = !{!1155, !1158, !1161, !1162, !1163, !1195}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1153, file: !57, line: 3921, baseType: !1156, size: 16, align: 16)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !931, line: 49, baseType: !1157)
!1157 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1153, file: !57, line: 3922, baseType: !1159, size: 32, align: 32, offset: 32)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !931, line: 51, baseType: !1160)
!1160 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1153, file: !57, line: 3923, baseType: !1159, size: 32, align: 32, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1153, file: !57, line: 3924, baseType: !1160, size: 32, align: 32, offset: 96)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1153, file: !57, line: 3925, baseType: !1164, size: 64, align: 64, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1167)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1168)
!1168 = !{!1169, !1170, !1171, !1172, !1173, !1174, !1184, !1188, !1190, !1191, !1193, !1194}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1167, file: !57, line: 3886, baseType: !950, size: 32, align: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1167, file: !57, line: 3887, baseType: !950, size: 32, align: 32, offset: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1167, file: !57, line: 3888, baseType: !950, size: 32, align: 32, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1167, file: !57, line: 3889, baseType: !950, size: 32, align: 32, offset: 96)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1167, file: !57, line: 3890, baseType: !950, size: 32, align: 32, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1167, file: !57, line: 3897, baseType: !1175, size: 768, align: 64, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1176)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1177)
!1177 = !{!1178, !1182}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1176, file: !57, line: 3855, baseType: !1179, size: 512, align: 64)
!1179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1150, size: 512, align: 64, elements: !1180)
!1180 = !{!1181}
!1181 = !DISubrange(count: 8)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1176, file: !57, line: 3857, baseType: !1183, size: 256, align: 32, offset: 512)
!1183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 256, align: 32, elements: !1180)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1167, file: !57, line: 3903, baseType: !1185, size: 256, align: 64, offset: 960)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1150, size: 256, align: 64, elements: !1186)
!1186 = !{!1187}
!1187 = !DISubrange(count: 4)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1167, file: !57, line: 3904, baseType: !1189, size: 128, align: 32, offset: 1216)
!1189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 128, align: 32, elements: !1186)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1167, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1167, file: !57, line: 3908, baseType: !1192, size: 64, align: 64, offset: 1408)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1167, file: !57, line: 3915, baseType: !1192, size: 64, align: 64, offset: 1472)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1167, file: !57, line: 3917, baseType: !950, size: 32, align: 32, offset: 1536)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1153, file: !57, line: 3926, baseType: !991, size: 64, align: 64, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1085, file: !57, line: 3564, baseType: !1197, size: 64, align: 64, offset: 1344)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!950, !1124, !1200, !1234, !1316}
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1202)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1203)
!1203 = !{!1204, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1230, !1231, !1232, !1233}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1202, file: !57, line: 1451, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1207, line: 94, baseType: !1208)
!1207 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1207, line: 81, size: 192, align: 64, elements: !1209)
!1209 = !{!1210, !1214, !1215}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1208, file: !1207, line: 82, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1207, line: 73, baseType: !1213)
!1213 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1207, line: 73, flags: DIFlagFwdDecl)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1208, file: !1207, line: 89, baseType: !1150, size: 64, align: 64, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1208, file: !1207, line: 93, baseType: !950, size: 32, align: 32, offset: 128)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1202, file: !57, line: 1461, baseType: !991, size: 64, align: 64, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1202, file: !57, line: 1467, baseType: !991, size: 64, align: 64, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1202, file: !57, line: 1468, baseType: !1150, size: 64, align: 64, offset: 192)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1202, file: !57, line: 1469, baseType: !950, size: 32, align: 32, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1202, file: !57, line: 1470, baseType: !950, size: 32, align: 32, offset: 288)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1202, file: !57, line: 1474, baseType: !950, size: 32, align: 32, offset: 320)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1202, file: !57, line: 1479, baseType: !1223, size: 64, align: 64, offset: 384)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1225)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1226)
!1226 = !{!1227, !1228, !1229}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1225, file: !57, line: 1412, baseType: !1150, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1225, file: !57, line: 1413, baseType: !950, size: 32, align: 32, offset: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1225, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1202, file: !57, line: 1480, baseType: !950, size: 32, align: 32, offset: 448)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1202, file: !57, line: 1486, baseType: !991, size: 64, align: 64, offset: 512)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1202, file: !57, line: 1488, baseType: !991, size: 64, align: 64, offset: 576)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1202, file: !57, line: 1497, baseType: !991, size: 64, align: 64, offset: 640)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1236)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1238)
!1238 = !{!1239, !1240, !1241, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1268, !1270, !1271, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1304, !1305, !1306, !1307, !1308, !1309, !1312, !1313, !1314, !1315}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1237, file: !780, line: 282, baseType: !1179, size: 512, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1237, file: !780, line: 299, baseType: !1183, size: 256, align: 32, offset: 512)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1237, file: !780, line: 315, baseType: !1242, size: 64, align: 64, offset: 768)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1237, file: !780, line: 326, baseType: !950, size: 32, align: 32, offset: 832)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1237, file: !780, line: 326, baseType: !950, size: 32, align: 32, offset: 864)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1237, file: !780, line: 334, baseType: !950, size: 32, align: 32, offset: 896)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1237, file: !780, line: 341, baseType: !950, size: 32, align: 32, offset: 928)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1237, file: !780, line: 346, baseType: !950, size: 32, align: 32, offset: 960)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1237, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1237, file: !780, line: 356, baseType: !997, size: 64, align: 32, offset: 1024)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1237, file: !780, line: 361, baseType: !991, size: 64, align: 64, offset: 1088)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1237, file: !780, line: 369, baseType: !991, size: 64, align: 64, offset: 1152)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1237, file: !780, line: 377, baseType: !991, size: 64, align: 64, offset: 1216)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1237, file: !780, line: 382, baseType: !950, size: 32, align: 32, offset: 1280)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1237, file: !780, line: 386, baseType: !950, size: 32, align: 32, offset: 1312)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1237, file: !780, line: 391, baseType: !950, size: 32, align: 32, offset: 1344)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1237, file: !780, line: 396, baseType: !977, size: 64, align: 64, offset: 1408)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1237, file: !780, line: 403, baseType: !1258, size: 512, align: 64, offset: 1472)
!1258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 512, align: 64, elements: !1180)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1237, file: !780, line: 410, baseType: !950, size: 32, align: 32, offset: 1984)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1237, file: !780, line: 415, baseType: !950, size: 32, align: 32, offset: 2016)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1237, file: !780, line: 420, baseType: !950, size: 32, align: 32, offset: 2048)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1237, file: !780, line: 425, baseType: !950, size: 32, align: 32, offset: 2080)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1237, file: !780, line: 435, baseType: !991, size: 64, align: 64, offset: 2112)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1237, file: !780, line: 440, baseType: !950, size: 32, align: 32, offset: 2176)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1237, file: !780, line: 445, baseType: !930, size: 64, align: 64, offset: 2240)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1237, file: !780, line: 459, baseType: !1267, size: 512, align: 64, offset: 2304)
!1267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1205, size: 512, align: 64, elements: !1180)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1237, file: !780, line: 473, baseType: !1269, size: 64, align: 64, offset: 2816)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1237, file: !780, line: 477, baseType: !950, size: 32, align: 32, offset: 2880)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1237, file: !780, line: 479, baseType: !1272, size: 64, align: 64, offset: 2944)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1275)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1276)
!1276 = !{!1277, !1278, !1279, !1280, !1285}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1275, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1275, file: !780, line: 203, baseType: !1150, size: 64, align: 64, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1275, file: !780, line: 204, baseType: !950, size: 32, align: 32, offset: 128)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1275, file: !780, line: 205, baseType: !1281, size: 64, align: 64, offset: 192)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1283, line: 86, baseType: !1284)
!1283 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1284 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1283, line: 86, flags: DIFlagFwdDecl)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1275, file: !780, line: 206, baseType: !1205, size: 64, align: 64, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1237, file: !780, line: 480, baseType: !950, size: 32, align: 32, offset: 3008)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1237, file: !780, line: 505, baseType: !950, size: 32, align: 32, offset: 3040)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1237, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1237, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1237, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1237, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1237, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1237, file: !780, line: 532, baseType: !991, size: 64, align: 64, offset: 3264)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1237, file: !780, line: 539, baseType: !991, size: 64, align: 64, offset: 3328)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1237, file: !780, line: 547, baseType: !991, size: 64, align: 64, offset: 3392)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1237, file: !780, line: 554, baseType: !1281, size: 64, align: 64, offset: 3456)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1237, file: !780, line: 563, baseType: !950, size: 32, align: 32, offset: 3520)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1237, file: !780, line: 572, baseType: !950, size: 32, align: 32, offset: 3552)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1237, file: !780, line: 581, baseType: !950, size: 32, align: 32, offset: 3584)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1237, file: !780, line: 588, baseType: !1301, size: 64, align: 64, offset: 3648)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !931, line: 36, baseType: !1303)
!1303 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1237, file: !780, line: 593, baseType: !950, size: 32, align: 32, offset: 3712)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1237, file: !780, line: 596, baseType: !950, size: 32, align: 32, offset: 3744)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1237, file: !780, line: 599, baseType: !1205, size: 64, align: 64, offset: 3776)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1237, file: !780, line: 605, baseType: !1205, size: 64, align: 64, offset: 3840)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1237, file: !780, line: 616, baseType: !1205, size: 64, align: 64, offset: 3904)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1237, file: !780, line: 626, baseType: !1310, size: 64, align: 64, offset: 3968)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1311, line: 216, baseType: !932)
!1311 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1237, file: !780, line: 627, baseType: !1310, size: 64, align: 64, offset: 4032)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1237, file: !780, line: 628, baseType: !1310, size: 64, align: 64, offset: 4096)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1237, file: !780, line: 629, baseType: !1310, size: 64, align: 64, offset: 4160)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1237, file: !780, line: 645, baseType: !1205, size: 64, align: 64, offset: 4224)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1085, file: !57, line: 3566, baseType: !1318, size: 64, align: 64, offset: 1408)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DISubroutineType(types: !1320)
!1320 = !{!950, !1124, !977, !1316, !1200}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1085, file: !57, line: 3567, baseType: !1121, size: 64, align: 64, offset: 1472)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1085, file: !57, line: 3576, baseType: !1323, size: 64, align: 64, offset: 1536)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{!950, !1124, !1234}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1085, file: !57, line: 3577, baseType: !1327, size: 64, align: 64, offset: 1600)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!950, !1124, !1200}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1085, file: !57, line: 3584, baseType: !1331, size: 64, align: 64, offset: 1664)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!950, !1124, !1334}
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1085, file: !57, line: 3589, baseType: !1336, size: 64, align: 64, offset: 1728)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{null, !1124}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1085, file: !57, line: 3594, baseType: !950, size: 32, align: 32, offset: 1792)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1085, file: !57, line: 3600, baseType: !970, size: 64, align: 64, offset: 1856)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1085, file: !57, line: 3609, baseType: !1342, size: 64, align: 64, offset: 1920)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1345)
!1345 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1075, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1075, file: !57, line: 1581, baseType: !1160, size: 32, align: 32, offset: 224)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1075, file: !57, line: 1583, baseType: !977, size: 64, align: 64, offset: 256)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1075, file: !57, line: 1591, baseType: !1350, size: 64, align: 64, offset: 320)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1137, line: 129, size: 1664, align: 64, elements: !1352)
!1352 = !{!1353, !1354, !1355, !1356, !1357, !1375, !1376, !1382, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1351, file: !1137, line: 136, baseType: !950, size: 32, align: 32)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1351, file: !1137, line: 151, baseType: !950, size: 32, align: 32, offset: 32)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1351, file: !1137, line: 157, baseType: !950, size: 32, align: 32, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1351, file: !1137, line: 159, baseType: !1334, size: 64, align: 64, offset: 128)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1351, file: !1137, line: 161, baseType: !1358, size: 64, align: 64, offset: 192)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1137, line: 117, baseType: !1360)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1137, line: 100, size: 832, align: 64, elements: !1361)
!1361 = !{!1362, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1360, file: !1137, line: 105, baseType: !1363, size: 256, align: 64)
!1363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1364, size: 256, align: 64, elements: !1186)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1207, line: 238, baseType: !1366)
!1366 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1207, line: 238, flags: DIFlagFwdDecl)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1360, file: !1137, line: 110, baseType: !950, size: 32, align: 32, offset: 256)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1360, file: !1137, line: 111, baseType: !950, size: 32, align: 32, offset: 288)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1360, file: !1137, line: 111, baseType: !950, size: 32, align: 32, offset: 320)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1360, file: !1137, line: 112, baseType: !1183, size: 256, align: 32, offset: 352)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1360, file: !1137, line: 113, baseType: !1189, size: 128, align: 32, offset: 608)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1360, file: !1137, line: 114, baseType: !950, size: 32, align: 32, offset: 736)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1360, file: !1137, line: 115, baseType: !950, size: 32, align: 32, offset: 768)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1360, file: !1137, line: 116, baseType: !950, size: 32, align: 32, offset: 800)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1351, file: !1137, line: 163, baseType: !977, size: 64, align: 64, offset: 256)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1351, file: !1137, line: 165, baseType: !1377, size: 128, align: 64, offset: 320)
!1377 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1137, line: 122, baseType: !1378)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1137, line: 119, size: 128, align: 64, elements: !1379)
!1379 = !{!1380, !1381}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1378, file: !1137, line: 120, baseType: !1200, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1378, file: !1137, line: 121, baseType: !1334, size: 64, align: 64, offset: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1351, file: !1137, line: 166, baseType: !1383, size: 128, align: 64, offset: 448)
!1383 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1137, line: 127, baseType: !1384)
!1384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1137, line: 124, size: 128, align: 64, elements: !1385)
!1385 = !{!1386, !1459}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1384, file: !1137, line: 125, baseType: !1387, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1390)
!1390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1391)
!1391 = !{!1392, !1393, !1417, !1421, !1422, !1456, !1457, !1458}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1390, file: !57, line: 5751, baseType: !1078, size: 64, align: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1390, file: !57, line: 5756, baseType: !1394, size: 64, align: 64, offset: 64)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1396)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1397)
!1397 = !{!1398, !1399, !1402, !1403, !1404, !1408, !1412, !1416}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1396, file: !57, line: 5797, baseType: !970, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1396, file: !57, line: 5804, baseType: !1400, size: 64, align: 64, offset: 64)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1396, file: !57, line: 5815, baseType: !1078, size: 64, align: 64, offset: 128)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1396, file: !57, line: 5825, baseType: !950, size: 32, align: 32, offset: 192)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1396, file: !57, line: 5826, baseType: !1405, size: 64, align: 64, offset: 256)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DISubroutineType(types: !1407)
!1407 = !{!950, !1388}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1396, file: !57, line: 5827, baseType: !1409, size: 64, align: 64, offset: 320)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DISubroutineType(types: !1411)
!1411 = !{!950, !1388, !1200}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1396, file: !57, line: 5828, baseType: !1413, size: 64, align: 64, offset: 384)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DISubroutineType(types: !1415)
!1415 = !{null, !1388}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1396, file: !57, line: 5829, baseType: !1413, size: 64, align: 64, offset: 448)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1390, file: !57, line: 5762, baseType: !1418, size: 64, align: 64, offset: 128)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1420)
!1420 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1390, file: !57, line: 5768, baseType: !977, size: 64, align: 64, offset: 192)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1390, file: !57, line: 5775, baseType: !1423, size: 64, align: 64, offset: 256)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1425)
!1425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1426)
!1426 = !{!1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1425, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1425, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1425, file: !57, line: 3948, baseType: !1159, size: 32, align: 32, offset: 64)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1425, file: !57, line: 3958, baseType: !1150, size: 64, align: 64, offset: 128)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1425, file: !57, line: 3962, baseType: !950, size: 32, align: 32, offset: 192)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1425, file: !57, line: 3968, baseType: !950, size: 32, align: 32, offset: 224)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1425, file: !57, line: 3973, baseType: !991, size: 64, align: 64, offset: 256)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1425, file: !57, line: 3986, baseType: !950, size: 32, align: 32, offset: 320)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1425, file: !57, line: 3999, baseType: !950, size: 32, align: 32, offset: 352)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1425, file: !57, line: 4004, baseType: !950, size: 32, align: 32, offset: 384)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1425, file: !57, line: 4005, baseType: !950, size: 32, align: 32, offset: 416)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1425, file: !57, line: 4010, baseType: !950, size: 32, align: 32, offset: 448)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1425, file: !57, line: 4011, baseType: !950, size: 32, align: 32, offset: 480)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1425, file: !57, line: 4020, baseType: !997, size: 64, align: 32, offset: 512)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1425, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1425, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1425, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1425, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1425, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1425, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1425, file: !57, line: 4039, baseType: !950, size: 32, align: 32, offset: 768)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1425, file: !57, line: 4046, baseType: !930, size: 64, align: 64, offset: 832)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1425, file: !57, line: 4050, baseType: !950, size: 32, align: 32, offset: 896)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1425, file: !57, line: 4054, baseType: !950, size: 32, align: 32, offset: 928)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1425, file: !57, line: 4061, baseType: !950, size: 32, align: 32, offset: 960)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1425, file: !57, line: 4065, baseType: !950, size: 32, align: 32, offset: 992)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1425, file: !57, line: 4073, baseType: !950, size: 32, align: 32, offset: 1024)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1425, file: !57, line: 4080, baseType: !950, size: 32, align: 32, offset: 1056)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1425, file: !57, line: 4084, baseType: !950, size: 32, align: 32, offset: 1088)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1390, file: !57, line: 5781, baseType: !1423, size: 64, align: 64, offset: 320)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1390, file: !57, line: 5787, baseType: !997, size: 64, align: 32, offset: 384)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1390, file: !57, line: 5793, baseType: !997, size: 64, align: 32, offset: 448)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1384, file: !1137, line: 126, baseType: !950, size: 32, align: 32, offset: 64)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1351, file: !1137, line: 172, baseType: !1200, size: 64, align: 64, offset: 576)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1351, file: !1137, line: 177, baseType: !1150, size: 64, align: 64, offset: 640)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1351, file: !1137, line: 178, baseType: !1160, size: 32, align: 32, offset: 704)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1351, file: !1137, line: 180, baseType: !977, size: 64, align: 64, offset: 768)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1351, file: !1137, line: 185, baseType: !950, size: 32, align: 32, offset: 832)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1351, file: !1137, line: 190, baseType: !977, size: 64, align: 64, offset: 896)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1351, file: !1137, line: 195, baseType: !950, size: 32, align: 32, offset: 960)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1351, file: !1137, line: 200, baseType: !1200, size: 64, align: 64, offset: 1024)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1351, file: !1137, line: 201, baseType: !950, size: 32, align: 32, offset: 1088)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1351, file: !1137, line: 202, baseType: !1334, size: 64, align: 64, offset: 1152)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1351, file: !1137, line: 203, baseType: !950, size: 32, align: 32, offset: 1216)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1351, file: !1137, line: 205, baseType: !950, size: 32, align: 32, offset: 1248)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1351, file: !1137, line: 206, baseType: !950, size: 32, align: 32, offset: 1280)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1351, file: !1137, line: 209, baseType: !1310, size: 64, align: 64, offset: 1344)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1351, file: !1137, line: 212, baseType: !1310, size: 64, align: 64, offset: 1408)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1351, file: !1137, line: 213, baseType: !1334, size: 64, align: 64, offset: 1472)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1351, file: !1137, line: 215, baseType: !950, size: 32, align: 32, offset: 1536)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1351, file: !1137, line: 217, baseType: !950, size: 32, align: 32, offset: 1568)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1351, file: !1137, line: 220, baseType: !950, size: 32, align: 32, offset: 1600)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1075, file: !57, line: 1598, baseType: !977, size: 64, align: 64, offset: 384)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1075, file: !57, line: 1606, baseType: !991, size: 64, align: 64, offset: 448)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1075, file: !57, line: 1614, baseType: !950, size: 32, align: 32, offset: 512)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1075, file: !57, line: 1622, baseType: !950, size: 32, align: 32, offset: 544)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1075, file: !57, line: 1628, baseType: !950, size: 32, align: 32, offset: 576)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1075, file: !57, line: 1636, baseType: !950, size: 32, align: 32, offset: 608)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1075, file: !57, line: 1643, baseType: !950, size: 32, align: 32, offset: 640)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1075, file: !57, line: 1657, baseType: !1150, size: 64, align: 64, offset: 704)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1075, file: !57, line: 1658, baseType: !950, size: 32, align: 32, offset: 768)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1075, file: !57, line: 1679, baseType: !997, size: 64, align: 32, offset: 800)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1075, file: !57, line: 1688, baseType: !950, size: 32, align: 32, offset: 864)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1075, file: !57, line: 1712, baseType: !950, size: 32, align: 32, offset: 896)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1075, file: !57, line: 1729, baseType: !950, size: 32, align: 32, offset: 928)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1075, file: !57, line: 1729, baseType: !950, size: 32, align: 32, offset: 960)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1075, file: !57, line: 1744, baseType: !950, size: 32, align: 32, offset: 992)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1075, file: !57, line: 1744, baseType: !950, size: 32, align: 32, offset: 1024)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1075, file: !57, line: 1751, baseType: !950, size: 32, align: 32, offset: 1056)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1075, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1075, file: !57, line: 1791, baseType: !1498, size: 64, align: 64, offset: 1152)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DISubroutineType(types: !1500)
!1500 = !{null, !1074, !1234, !1316, !950, !950, !950}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1075, file: !57, line: 1808, baseType: !1502, size: 64, align: 64, offset: 1216)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{!516, !1074, !1096}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1075, file: !57, line: 1816, baseType: !950, size: 32, align: 32, offset: 1280)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1075, file: !57, line: 1825, baseType: !1507, size: 32, align: 32, offset: 1312)
!1507 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1075, file: !57, line: 1830, baseType: !950, size: 32, align: 32, offset: 1344)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1075, file: !57, line: 1838, baseType: !1507, size: 32, align: 32, offset: 1376)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1075, file: !57, line: 1846, baseType: !950, size: 32, align: 32, offset: 1408)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1075, file: !57, line: 1851, baseType: !950, size: 32, align: 32, offset: 1440)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1075, file: !57, line: 1861, baseType: !1507, size: 32, align: 32, offset: 1472)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1075, file: !57, line: 1868, baseType: !1507, size: 32, align: 32, offset: 1504)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1075, file: !57, line: 1875, baseType: !1507, size: 32, align: 32, offset: 1536)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1075, file: !57, line: 1882, baseType: !1507, size: 32, align: 32, offset: 1568)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1075, file: !57, line: 1889, baseType: !1507, size: 32, align: 32, offset: 1600)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1075, file: !57, line: 1896, baseType: !1507, size: 32, align: 32, offset: 1632)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1075, file: !57, line: 1903, baseType: !1507, size: 32, align: 32, offset: 1664)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1075, file: !57, line: 1910, baseType: !950, size: 32, align: 32, offset: 1696)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1075, file: !57, line: 1915, baseType: !950, size: 32, align: 32, offset: 1728)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1075, file: !57, line: 1926, baseType: !1316, size: 64, align: 64, offset: 1792)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1075, file: !57, line: 1935, baseType: !997, size: 64, align: 32, offset: 1856)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1075, file: !57, line: 1942, baseType: !950, size: 32, align: 32, offset: 1920)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1075, file: !57, line: 1948, baseType: !950, size: 32, align: 32, offset: 1952)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1075, file: !57, line: 1954, baseType: !950, size: 32, align: 32, offset: 1984)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1075, file: !57, line: 1960, baseType: !950, size: 32, align: 32, offset: 2016)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1075, file: !57, line: 1984, baseType: !950, size: 32, align: 32, offset: 2048)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1075, file: !57, line: 1991, baseType: !950, size: 32, align: 32, offset: 2080)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1075, file: !57, line: 1996, baseType: !950, size: 32, align: 32, offset: 2112)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1075, file: !57, line: 2004, baseType: !950, size: 32, align: 32, offset: 2144)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1075, file: !57, line: 2011, baseType: !950, size: 32, align: 32, offset: 2176)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1075, file: !57, line: 2018, baseType: !950, size: 32, align: 32, offset: 2208)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1075, file: !57, line: 2027, baseType: !950, size: 32, align: 32, offset: 2240)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1075, file: !57, line: 2034, baseType: !950, size: 32, align: 32, offset: 2272)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1075, file: !57, line: 2044, baseType: !950, size: 32, align: 32, offset: 2304)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1075, file: !57, line: 2054, baseType: !1537, size: 64, align: 64, offset: 2368)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1075, file: !57, line: 2061, baseType: !1537, size: 64, align: 64, offset: 2432)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1075, file: !57, line: 2066, baseType: !950, size: 32, align: 32, offset: 2496)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1075, file: !57, line: 2070, baseType: !950, size: 32, align: 32, offset: 2528)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1075, file: !57, line: 2078, baseType: !950, size: 32, align: 32, offset: 2560)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1075, file: !57, line: 2085, baseType: !950, size: 32, align: 32, offset: 2592)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1075, file: !57, line: 2092, baseType: !950, size: 32, align: 32, offset: 2624)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1075, file: !57, line: 2099, baseType: !950, size: 32, align: 32, offset: 2656)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1075, file: !57, line: 2106, baseType: !950, size: 32, align: 32, offset: 2688)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1075, file: !57, line: 2113, baseType: !950, size: 32, align: 32, offset: 2720)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1075, file: !57, line: 2120, baseType: !950, size: 32, align: 32, offset: 2752)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1075, file: !57, line: 2125, baseType: !950, size: 32, align: 32, offset: 2784)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1075, file: !57, line: 2133, baseType: !950, size: 32, align: 32, offset: 2816)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1075, file: !57, line: 2140, baseType: !950, size: 32, align: 32, offset: 2848)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1075, file: !57, line: 2145, baseType: !950, size: 32, align: 32, offset: 2880)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1075, file: !57, line: 2153, baseType: !950, size: 32, align: 32, offset: 2912)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1075, file: !57, line: 2158, baseType: !950, size: 32, align: 32, offset: 2944)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1075, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1075, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1075, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1075, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1075, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1075, file: !57, line: 2203, baseType: !950, size: 32, align: 32, offset: 3136)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1075, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1075, file: !57, line: 2212, baseType: !950, size: 32, align: 32, offset: 3200)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1075, file: !57, line: 2213, baseType: !950, size: 32, align: 32, offset: 3232)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1075, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1075, file: !57, line: 2232, baseType: !950, size: 32, align: 32, offset: 3296)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1075, file: !57, line: 2243, baseType: !950, size: 32, align: 32, offset: 3328)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1075, file: !57, line: 2249, baseType: !950, size: 32, align: 32, offset: 3360)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1075, file: !57, line: 2256, baseType: !950, size: 32, align: 32, offset: 3392)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1075, file: !57, line: 2263, baseType: !930, size: 64, align: 64, offset: 3456)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1075, file: !57, line: 2270, baseType: !930, size: 64, align: 64, offset: 3520)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1075, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1075, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1075, file: !57, line: 2367, baseType: !1573, size: 64, align: 64, offset: 3648)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DISubroutineType(types: !1575)
!1575 = !{!950, !1074, !1334, !950}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1075, file: !57, line: 2383, baseType: !950, size: 32, align: 32, offset: 3712)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1075, file: !57, line: 2386, baseType: !1507, size: 32, align: 32, offset: 3744)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1075, file: !57, line: 2387, baseType: !1507, size: 32, align: 32, offset: 3776)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1075, file: !57, line: 2394, baseType: !950, size: 32, align: 32, offset: 3808)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1075, file: !57, line: 2401, baseType: !950, size: 32, align: 32, offset: 3840)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1075, file: !57, line: 2408, baseType: !950, size: 32, align: 32, offset: 3872)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1075, file: !57, line: 2415, baseType: !950, size: 32, align: 32, offset: 3904)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1075, file: !57, line: 2422, baseType: !950, size: 32, align: 32, offset: 3936)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1075, file: !57, line: 2423, baseType: !1585, size: 64, align: 64, offset: 3968)
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1586 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1587)
!1587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1588)
!1588 = !{!1589, !1590, !1591, !1592}
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1587, file: !57, line: 827, baseType: !950, size: 32, align: 32)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1587, file: !57, line: 828, baseType: !950, size: 32, align: 32, offset: 32)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1587, file: !57, line: 829, baseType: !950, size: 32, align: 32, offset: 64)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1587, file: !57, line: 830, baseType: !1507, size: 32, align: 32, offset: 96)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1075, file: !57, line: 2430, baseType: !991, size: 64, align: 64, offset: 4032)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1075, file: !57, line: 2437, baseType: !991, size: 64, align: 64, offset: 4096)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1075, file: !57, line: 2444, baseType: !1507, size: 32, align: 32, offset: 4160)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1075, file: !57, line: 2451, baseType: !1507, size: 32, align: 32, offset: 4192)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1075, file: !57, line: 2458, baseType: !950, size: 32, align: 32, offset: 4224)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1075, file: !57, line: 2469, baseType: !950, size: 32, align: 32, offset: 4256)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1075, file: !57, line: 2475, baseType: !950, size: 32, align: 32, offset: 4288)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1075, file: !57, line: 2481, baseType: !950, size: 32, align: 32, offset: 4320)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1075, file: !57, line: 2485, baseType: !950, size: 32, align: 32, offset: 4352)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1075, file: !57, line: 2489, baseType: !950, size: 32, align: 32, offset: 4384)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1075, file: !57, line: 2493, baseType: !950, size: 32, align: 32, offset: 4416)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1075, file: !57, line: 2501, baseType: !950, size: 32, align: 32, offset: 4448)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1075, file: !57, line: 2506, baseType: !950, size: 32, align: 32, offset: 4480)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1075, file: !57, line: 2510, baseType: !950, size: 32, align: 32, offset: 4512)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1075, file: !57, line: 2514, baseType: !991, size: 64, align: 64, offset: 4544)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1075, file: !57, line: 2528, baseType: !1609, size: 64, align: 64, offset: 4608)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DISubroutineType(types: !1611)
!1611 = !{null, !1074, !977, !950, !950}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1075, file: !57, line: 2534, baseType: !950, size: 32, align: 32, offset: 4672)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1075, file: !57, line: 2545, baseType: !950, size: 32, align: 32, offset: 4704)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1075, file: !57, line: 2547, baseType: !950, size: 32, align: 32, offset: 4736)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1075, file: !57, line: 2549, baseType: !950, size: 32, align: 32, offset: 4768)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1075, file: !57, line: 2551, baseType: !950, size: 32, align: 32, offset: 4800)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1075, file: !57, line: 2553, baseType: !950, size: 32, align: 32, offset: 4832)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1075, file: !57, line: 2555, baseType: !950, size: 32, align: 32, offset: 4864)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1075, file: !57, line: 2557, baseType: !950, size: 32, align: 32, offset: 4896)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1075, file: !57, line: 2559, baseType: !950, size: 32, align: 32, offset: 4928)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1075, file: !57, line: 2563, baseType: !950, size: 32, align: 32, offset: 4960)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1075, file: !57, line: 2571, baseType: !1192, size: 64, align: 64, offset: 4992)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1075, file: !57, line: 2579, baseType: !1192, size: 64, align: 64, offset: 5056)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1075, file: !57, line: 2586, baseType: !950, size: 32, align: 32, offset: 5120)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1075, file: !57, line: 2615, baseType: !950, size: 32, align: 32, offset: 5152)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1075, file: !57, line: 2627, baseType: !950, size: 32, align: 32, offset: 5184)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1075, file: !57, line: 2637, baseType: !950, size: 32, align: 32, offset: 5216)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1075, file: !57, line: 2681, baseType: !950, size: 32, align: 32, offset: 5248)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1075, file: !57, line: 2709, baseType: !991, size: 64, align: 64, offset: 5312)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1075, file: !57, line: 2716, baseType: !1631, size: 64, align: 64, offset: 5376)
!1631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1632, size: 64, align: 64)
!1632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1633)
!1633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1634)
!1634 = !{!1635, !1636, !1637, !1638, !1639, !1640, !1641, !1645, !1649, !1650, !1651, !1652, !1656, !1657, !1658, !1659, !1660}
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1633, file: !57, line: 3642, baseType: !970, size: 64, align: 64)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1633, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1633, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1633, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1633, file: !57, line: 3669, baseType: !950, size: 32, align: 32, offset: 160)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1633, file: !57, line: 3682, baseType: !1331, size: 64, align: 64, offset: 192)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1633, file: !57, line: 3698, baseType: !1642, size: 64, align: 64, offset: 256)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{!950, !1124, !1061, !1159}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1633, file: !57, line: 3712, baseType: !1646, size: 64, align: 64, offset: 320)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DISubroutineType(types: !1648)
!1648 = !{!950, !1124, !950, !1061, !1159}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1633, file: !57, line: 3726, baseType: !1642, size: 64, align: 64, offset: 384)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1633, file: !57, line: 3737, baseType: !1121, size: 64, align: 64, offset: 448)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1633, file: !57, line: 3746, baseType: !950, size: 32, align: 32, offset: 512)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1633, file: !57, line: 3757, baseType: !1653, size: 64, align: 64, offset: 576)
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64, align: 64)
!1654 = !DISubroutineType(types: !1655)
!1655 = !{null, !960}
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1633, file: !57, line: 3766, baseType: !1121, size: 64, align: 64, offset: 640)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1633, file: !57, line: 3774, baseType: !1121, size: 64, align: 64, offset: 704)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1633, file: !57, line: 3780, baseType: !950, size: 32, align: 32, offset: 768)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1633, file: !57, line: 3785, baseType: !950, size: 32, align: 32, offset: 800)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1633, file: !57, line: 3795, baseType: !1661, size: 64, align: 64, offset: 832)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64, align: 64)
!1662 = !DISubroutineType(types: !1663)
!1663 = !{!950, !1124, !1205}
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1075, file: !57, line: 2728, baseType: !977, size: 64, align: 64, offset: 5440)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1075, file: !57, line: 2735, baseType: !1258, size: 512, align: 64, offset: 5504)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1075, file: !57, line: 2742, baseType: !950, size: 32, align: 32, offset: 6016)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1075, file: !57, line: 2755, baseType: !950, size: 32, align: 32, offset: 6048)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1075, file: !57, line: 2776, baseType: !950, size: 32, align: 32, offset: 6080)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1075, file: !57, line: 2783, baseType: !950, size: 32, align: 32, offset: 6112)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1075, file: !57, line: 2791, baseType: !950, size: 32, align: 32, offset: 6144)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1075, file: !57, line: 2802, baseType: !1334, size: 64, align: 64, offset: 6208)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1075, file: !57, line: 2811, baseType: !950, size: 32, align: 32, offset: 6272)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1075, file: !57, line: 2821, baseType: !950, size: 32, align: 32, offset: 6304)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1075, file: !57, line: 2830, baseType: !950, size: 32, align: 32, offset: 6336)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1075, file: !57, line: 2840, baseType: !950, size: 32, align: 32, offset: 6368)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1075, file: !57, line: 2851, baseType: !1677, size: 64, align: 64, offset: 6400)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64, align: 64)
!1678 = !DISubroutineType(types: !1679)
!1679 = !{!950, !1074, !1680, !977, !1316, !950, !950}
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{!950, !1074, !977}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1075, file: !57, line: 2871, baseType: !1684, size: 64, align: 64, offset: 6464)
