; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--mmsh.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--mmsh.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }
%struct.URLProtocol = type { i8*, {}*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }
%struct.AVIOInterruptCB = type { i32 (i8*)*, i8* }
%struct.AVDictionary = type opaque
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }

!28 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!29 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!30 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!31 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!32 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!33 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!34 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!35 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!36 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!37 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!38 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!39 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!40 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!41 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!42 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!43 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!44 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!45 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 50, size: 32, align: 32, elements: !48)
!47 = !DIFile(filename: "libavformat/mmsh.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!48 = !{!49, !50, !51, !52}
!49 = !DIEnumerator(name: "CHUNK_TYPE_DATA", value: 17444)
!50 = !DIEnumerator(name: "CHUNK_TYPE_ASF_HEADER", value: 18468)
!51 = !DIEnumerator(name: "CHUNK_TYPE_END", value: 17700)
!52 = !DIEnumerator(name: "CHUNK_TYPE_STREAM_CHANGE", value: 17188)
!53 = !{!54, !55, !64, !65, !66, !72, !74}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !58, line: 222, size: 16, align: 8, elements: !59)
!58 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!59 = !{!60}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !57, file: !58, line: 222, baseType: !61, size: 16, align: 16)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !62, line: 49, baseType: !63)
!62 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!63 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!64 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!65 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !58, line: 221, size: 32, align: 8, elements: !69)
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !68, file: !58, line: 221, baseType: !71, size: 32, align: 32)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !62, line: 51, baseType: !65)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !62, line: 40, baseType: !73)
!73 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "MMSHContext", file: !47, line: 62, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MMSHContext", file: !47, line: 57, size: 537216, align: 64, elements: !77)
!77 = !{!78, !311, !315, !316}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "mms", scope: !76, file: !47, line: 58, baseType: !79, size: 528960, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "MMSContext", file: !80, line: 58, baseType: !81)
!80 = !DIFile(filename: "libavformat/mms.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MMSContext", file: !80, line: 30, size: 528960, align: 64, elements: !82)
!82 = !{!83, !285, !291, !294, !298, !302, !303, !304, !305, !306, !307, !308, !309, !310}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "mms_hd", scope: !81, file: !80, line: 31, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !86, line: 52, baseType: !87)
!86 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !86, line: 38, size: 768, align: 64, elements: !88)
!88 = !{!89, !171, !266, !267, !268, !269, !270, !271, !272, !281, !282, !283, !284}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !87, file: !86, line: 39, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !94)
!94 = !{!95, !99, !103, !130, !131, !132, !133, !137, !143, !145, !149}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !93, file: !26, line: 72, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !93, file: !26, line: 78, baseType: !100, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!96, !54}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !93, file: !26, line: 85, baseType: !104, size: 64, align: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !107)
!107 = !{!108, !109, !110, !111, !112, !126, !127, !128, !129}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !106, file: !4, line: 247, baseType: !96, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !106, file: !4, line: 253, baseType: !96, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !106, file: !4, line: 259, baseType: !64, size: 32, align: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !106, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !106, file: !4, line: 271, baseType: !113, size: 64, align: 64, offset: 192)
!113 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !106, file: !4, line: 265, size: 64, align: 64, elements: !114)
!114 = !{!115, !116, !118, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !113, file: !4, line: 266, baseType: !72, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !113, file: !4, line: 267, baseType: !117, size: 64, align: 64)
!117 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !113, file: !4, line: 268, baseType: !96, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !113, file: !4, line: 270, baseType: !120, size: 64, align: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !121, line: 61, baseType: !122)
!121 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !121, line: 58, size: 64, align: 32, elements: !123)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !122, file: !121, line: 59, baseType: !64, size: 32, align: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !122, file: !121, line: 60, baseType: !64, size: 32, align: 32, offset: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !106, file: !4, line: 272, baseType: !117, size: 64, align: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !106, file: !4, line: 273, baseType: !117, size: 64, align: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !106, file: !4, line: 275, baseType: !64, size: 32, align: 32, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !106, file: !4, line: 300, baseType: !96, size: 64, align: 64, offset: 448)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !93, file: !26, line: 93, baseType: !64, size: 32, align: 32, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !93, file: !26, line: 99, baseType: !64, size: 32, align: 32, offset: 224)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !93, file: !26, line: 108, baseType: !64, size: 32, align: 32, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !93, file: !26, line: 113, baseType: !134, size: 64, align: 64, offset: 320)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!54, !54, !54}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !93, file: !26, line: 123, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!141, !141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !93, file: !26, line: 130, baseType: !144, size: 32, align: 32, offset: 448)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !93, file: !26, line: 136, baseType: !146, size: 64, align: 64, offset: 512)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!144, !54}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !93, file: !26, line: 142, baseType: !150, size: 64, align: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!64, !153, !54, !96, !64}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !156)
!156 = !{!157, !169, !170}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !155, file: !4, line: 360, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !162)
!162 = !{!163, !164, !165, !166, !167, !168}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !161, file: !4, line: 307, baseType: !96, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !161, file: !4, line: 313, baseType: !117, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !161, file: !4, line: 313, baseType: !117, size: 64, align: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !161, file: !4, line: 318, baseType: !117, size: 64, align: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !161, file: !4, line: 318, baseType: !117, size: 64, align: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !161, file: !4, line: 323, baseType: !64, size: 32, align: 32, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !155, file: !4, line: 364, baseType: !64, size: 32, align: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !155, file: !4, line: 368, baseType: !64, size: 32, align: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !87, file: !86, line: 40, baseType: !172, size: 64, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !86, line: 54, size: 1600, align: 64, elements: !175)
!175 = !{!176, !177, !181, !190, !195, !199, !205, !211, !215, !216, !220, !224, !225, !231, !232, !233, !234, !235, !236, !237, !238, !259, !260, !261, !265}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !174, file: !86, line: 55, baseType: !96, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !174, file: !86, line: 56, baseType: !178, size: 64, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!64, !84, !96, !64}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !174, file: !86, line: 62, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!64, !84, !96, !64, !185}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !188, line: 86, baseType: !189)
!188 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !188, line: 86, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !174, file: !86, line: 63, baseType: !191, size: 64, align: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!64, !84, !194}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !174, file: !86, line: 64, baseType: !196, size: 64, align: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!64, !84}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !174, file: !86, line: 78, baseType: !200, size: 64, align: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!64, !84, !203, !64}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !174, file: !86, line: 79, baseType: !206, size: 64, align: 64, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!64, !84, !209, !64}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !174, file: !86, line: 80, baseType: !212, size: 64, align: 64, offset: 448)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!72, !84, !72, !64}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !174, file: !86, line: 81, baseType: !196, size: 64, align: 64, offset: 512)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !174, file: !86, line: 82, baseType: !217, size: 64, align: 64, offset: 576)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!64, !84, !64}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !174, file: !86, line: 83, baseType: !221, size: 64, align: 64, offset: 640)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!72, !84, !64, !72, !64}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !174, file: !86, line: 85, baseType: !196, size: 64, align: 64, offset: 704)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !174, file: !86, line: 86, baseType: !226, size: 64, align: 64, offset: 768)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!64, !84, !229, !230}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !174, file: !86, line: 88, baseType: !196, size: 64, align: 64, offset: 832)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !174, file: !86, line: 89, baseType: !217, size: 64, align: 64, offset: 896)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !174, file: !86, line: 90, baseType: !64, size: 32, align: 32, offset: 960)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !174, file: !86, line: 91, baseType: !90, size: 64, align: 64, offset: 1024)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !174, file: !86, line: 92, baseType: !64, size: 32, align: 32, offset: 1088)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !174, file: !86, line: 93, baseType: !217, size: 64, align: 64, offset: 1152)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !174, file: !86, line: 94, baseType: !196, size: 64, align: 64, offset: 1216)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !174, file: !86, line: 95, baseType: !239, size: 64, align: 64, offset: 1280)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!64, !84, !242}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !245, line: 101, baseType: !246)
!245 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !245, line: 86, size: 576, align: 64, elements: !247)
!247 = !{!248, !250, !251, !252, !253, !254, !255, !256, !257, !258}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !246, file: !245, line: 87, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !246, file: !245, line: 88, baseType: !64, size: 32, align: 32, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !246, file: !245, line: 89, baseType: !64, size: 32, align: 32, offset: 96)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !246, file: !245, line: 91, baseType: !72, size: 64, align: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !246, file: !245, line: 92, baseType: !72, size: 64, align: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !246, file: !245, line: 94, baseType: !72, size: 64, align: 64, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !246, file: !245, line: 96, baseType: !72, size: 64, align: 64, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !246, file: !245, line: 98, baseType: !72, size: 64, align: 64, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !246, file: !245, line: 99, baseType: !72, size: 64, align: 64, offset: 448)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !246, file: !245, line: 100, baseType: !72, size: 64, align: 64, offset: 512)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !174, file: !86, line: 96, baseType: !196, size: 64, align: 64, offset: 1344)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !174, file: !86, line: 97, baseType: !196, size: 64, align: 64, offset: 1408)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !174, file: !86, line: 98, baseType: !262, size: 64, align: 64, offset: 1472)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!64, !84, !84}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !174, file: !86, line: 99, baseType: !96, size: 64, align: 64, offset: 1536)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !87, file: !86, line: 41, baseType: !54, size: 64, align: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !87, file: !86, line: 42, baseType: !249, size: 64, align: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !87, file: !86, line: 43, baseType: !64, size: 32, align: 32, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !87, file: !86, line: 44, baseType: !64, size: 32, align: 32, offset: 288)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !87, file: !86, line: 45, baseType: !64, size: 32, align: 32, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !87, file: !86, line: 46, baseType: !64, size: 32, align: 32, offset: 352)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !87, file: !86, line: 47, baseType: !273, size: 128, align: 64, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !245, line: 61, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !245, line: 58, size: 128, align: 64, elements: !275)
!275 = !{!276, !280}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !274, file: !245, line: 59, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!64, !54}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !274, file: !245, line: 60, baseType: !54, size: 64, align: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !87, file: !86, line: 48, baseType: !72, size: 64, align: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !87, file: !86, line: 49, baseType: !96, size: 64, align: 64, offset: 576)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !87, file: !86, line: 50, baseType: !96, size: 64, align: 64, offset: 640)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !87, file: !86, line: 51, baseType: !64, size: 32, align: 32, offset: 704)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !81, file: !80, line: 32, baseType: !286, size: 64, align: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "MMSStream", file: !80, line: 28, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MMSStream", file: !80, line: 26, size: 32, align: 32, elements: !289)
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !288, file: !80, line: 27, baseType: !64, size: 32, align: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "write_out_ptr", scope: !81, file: !80, line: 36, baseType: !292, size: 64, align: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !62, line: 48, baseType: !204)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "out_buffer", scope: !81, file: !80, line: 37, baseType: !295, size: 4096, align: 8, offset: 192)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 4096, align: 8, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 512)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer", scope: !81, file: !80, line: 42, baseType: !299, size: 524288, align: 8, offset: 4288)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 524288, align: 8, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 65536)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "read_in_ptr", scope: !81, file: !80, line: 43, baseType: !292, size: 64, align: 64, offset: 528576)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_in_len", scope: !81, file: !80, line: 44, baseType: !64, size: 32, align: 32, offset: 528640)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "asf_header", scope: !81, file: !80, line: 49, baseType: !292, size: 64, align: 64, offset: 528704)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "asf_header_size", scope: !81, file: !80, line: 50, baseType: !64, size: 32, align: 32, offset: 528768)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "header_parsed", scope: !81, file: !80, line: 51, baseType: !64, size: 32, align: 32, offset: 528800)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "asf_packet_len", scope: !81, file: !80, line: 52, baseType: !64, size: 32, align: 32, offset: 528832)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "asf_header_read_size", scope: !81, file: !80, line: 53, baseType: !64, size: 32, align: 32, offset: 528864)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "stream_num", scope: !81, file: !80, line: 56, baseType: !64, size: 32, align: 32, offset: 528896)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams_allocated", scope: !81, file: !80, line: 57, baseType: !65, size: 32, align: 32, offset: 528928)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !76, file: !47, line: 59, baseType: !312, size: 8192, align: 8, offset: 528960)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 8192, align: 8, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 1024)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "request_seq", scope: !76, file: !47, line: 60, baseType: !64, size: 32, align: 32, offset: 537152)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_seq", scope: !76, file: !47, line: 61, baseType: !64, size: 32, align: 32, offset: 537184)
!317 = !{!318}
!318 = distinct !DIGlobalVariable(name: "ff_mmsh_protocol", scope: !0, file: !47, line: 412, type: !319, isLocal: false, isDefinition: true, variable: { i8*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }* @ff_mmsh_protocol)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLProtocol", file: !86, line: 100, baseType: !174)
!321 = !{i32 2, !"Dwarf Version", i32 4}
!322 = !{i32 2, !"Debug Info Version", i32 3}
!323 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!324 = distinct !DISubprogram(name: "mmsh_open", scope: !47, file: !47, line: 325, type: !179, isLocal: true, isDefinition: true, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !325)
!325 = !{}
!326 = !DILocalVariable(name: "h", arg: 1, scope: !324, file: !47, line: 325, type: !84)
!327 = !DIExpression()
!328 = !DILocation(line: 325, column: 34, scope: !324)
!329 = !DILocalVariable(name: "uri", arg: 2, scope: !324, file: !47, line: 325, type: !96)
!330 = !DILocation(line: 325, column: 49, scope: !324)
!331 = !DILocalVariable(name: "flags", arg: 3, scope: !324, file: !47, line: 325, type: !64)
!332 = !DILocation(line: 325, column: 58, scope: !324)
!333 = !DILocation(line: 327, column: 31, scope: !324)
!334 = !DILocation(line: 327, column: 34, scope: !324)
!335 = !DILocation(line: 327, column: 39, scope: !324)
!336 = !DILocation(line: 327, column: 12, scope: !324)
!337 = !DILocation(line: 327, column: 5, scope: !324)
!338 = distinct !DISubprogram(name: "mmsh_read", scope: !47, file: !47, line: 358, type: !339, isLocal: true, isDefinition: true, scopeLine: 359, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !325)
!339 = !DISubroutineType(types: !340)
!340 = !{!64, !84, !292, !64}
!341 = !DILocalVariable(name: "h", arg: 1, scope: !338, file: !47, line: 358, type: !84)
!342 = !DILocation(line: 358, column: 34, scope: !338)
!343 = !DILocalVariable(name: "buf", arg: 2, scope: !338, file: !47, line: 358, type: !292)
!344 = !DILocation(line: 358, column: 46, scope: !338)
!345 = !DILocalVariable(name: "size", arg: 3, scope: !338, file: !47, line: 358, type: !64)
!346 = !DILocation(line: 358, column: 55, scope: !338)
!347 = !DILocalVariable(name: "res", scope: !338, file: !47, line: 360, type: !64)
!348 = !DILocation(line: 360, column: 9, scope: !338)
!349 = !DILocalVariable(name: "mmsh", scope: !338, file: !47, line: 361, type: !74)
!350 = !DILocation(line: 361, column: 18, scope: !338)
!351 = !DILocation(line: 361, column: 25, scope: !338)
!352 = !DILocation(line: 361, column: 28, scope: !338)
!353 = !DILocalVariable(name: "mms", scope: !338, file: !47, line: 362, type: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!355 = !DILocation(line: 362, column: 17, scope: !338)
!356 = !DILocation(line: 362, column: 24, scope: !338)
!357 = !DILocation(line: 362, column: 30, scope: !338)
!358 = !DILocation(line: 363, column: 5, scope: !338)
!359 = distinct !{!359, !358}
!360 = !DILocation(line: 364, column: 13, scope: !361)
