; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--vc1_pred.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--vc1_pred.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!956 = distinct !DISubprogram(name: "ff_vc1_pred_mv", scope: !957, file: !957, line: 211, type: !958, isLocal: false, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2973)
!957 = !DIFile(filename: "libavcodec/vc1_pred.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!958 = !DISubroutineType(types: !959)
!959 = !{null, !960, !990, !990, !990, !990, !990, !990, !1159, !990, !990}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "VC1Context", file: !926, line: 403, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VC1Context", file: !926, line: 173, size: 135936, align: 64, elements: !963)
!963 = !{!964, !2624, !2705, !2706, !2766, !2767, !2768, !2769, !2770, !2771, !2772, !2773, !2774, !2775, !2776, !2777, !2778, !2779, !2780, !2781, !2782, !2783, !2784, !2785, !2786, !2787, !2788, !2789, !2790, !2791, !2792, !2793, !2794, !2795, !2796, !2797, !2798, !2799, !2800, !2801, !2802, !2803, !2804, !2805, !2806, !2807, !2808, !2809, !2810, !2813, !2814, !2815, !2816, !2817, !2818, !2819, !2820, !2821, !2822, !2823, !2824, !2825, !2826, !2827, !2828, !2829, !2830, !2831, !2832, !2833, !2834, !2835, !2836, !2837, !2838, !2839, !2840, !2841, !2842, !2843, !2844, !2845, !2846, !2847, !2848, !2849, !2850, !2851, !2854, !2855, !2856, !2857, !2858, !2859, !2863, !2864, !2865, !2866, !2867, !2868, !2869, !2870, !2871, !2872, !2873, !2874, !2875, !2876, !2877, !2878, !2879, !2880, !2881, !2882, !2883, !2884, !2885, !2886, !2887, !2888, !2889, !2890, !2891, !2892, !2893, !2894, !2895, !2896, !2897, !2898, !2899, !2900, !2901, !2902, !2903, !2904, !2905, !2906, !2907, !2908, !2909, !2910, !2911, !2912, !2913, !2914, !2915, !2916, !2917, !2918, !2919, !2920, !2921, !2922, !2923, !2924, !2925, !2926, !2927, !2928, !2929, !2930, !2931, !2932, !2933, !2934, !2935, !2936, !2937, !2938, !2939, !2940, !2941, !2942, !2943, !2944, !2945, !2946, !2947, !2948, !2949, !2950, !2951, !2952, !2956, !2957, !2958, !2959, !2960, !2961, !2962, !2963, !2964, !2965, !2966, !2967, !2968, !2969, !2970, !2971, !2972}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !962, file: !926, line: 174, baseType: !965, size: 86208, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "MpegEncContext", file: !966, line: 582, baseType: !967)
!966 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !966, line: 81, size: 86208, align: 64, elements: !968)
!968 = !{!969, !1054, !1055, !1056, !1057, !1061, !1062, !1076, !1077, !1078, !1079, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1788, !1789, !1844, !1846, !1847, !1848, !1849, !1850, !1861, !1862, !1863, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1879, !1881, !1883, !1884, !1885, !1886, !1887, !1888, !1893, !1895, !1896, !1897, !1898, !1899, !1900, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1927, !1928, !1929, !1930, !1946, !1953, !1965, !1981, !2003, !2043, !2056, !2083, !2098, !2112, !2125, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2146, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2159, !2161, !2162, !2163, !2164, !2165, !2166, !2169, !2171, !2173, !2174, !2177, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2244, !2245, !2247, !2248, !2250, !2251, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2270, !2271, !2272, !2275, !2276, !2277, !2278, !2280, !2282, !2283, !2284, !2285, !2286, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2368, !2369, !2370, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2432, !2433, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2445, !2446, !2447, !2448, !2449, !2450, !2451, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2464, !2465, !2466, !2467, !2468, !2469, !2470, !2471, !2472, !2473, !2474, !2475, !2476, !2477, !2478, !2479, !2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488, !2489, !2490, !2499, !2500, !2501, !2502, !2506, !2507, !2511, !2515, !2519, !2520, !2525, !2529, !2530, !2531, !2532, !2533, !2534, !2535, !2536, !2540, !2541, !2545, !2546, !2547, !2548, !2549, !2550, !2551, !2552, !2553, !2554, !2555, !2556, !2557, !2559, !2560, !2561, !2611, !2612, !2616, !2617, !2618, !2619, !2620, !2621, !2622, !2623}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !967, file: !966, line: 82, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !973)
!973 = !{!974, !978, !982, !1013, !1014, !1015, !1016, !1020, !1026, !1028, !1032}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !972, file: !26, line: 72, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !972, file: !26, line: 78, baseType: !979, size: 64, align: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!975, !952}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !972, file: !26, line: 85, baseType: !983, size: 64, align: 64, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !986)
!986 = !{!987, !988, !989, !991, !992, !1009, !1010, !1011, !1012}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !985, file: !4, line: 247, baseType: !975, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !985, file: !4, line: 253, baseType: !975, size: 64, align: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !985, file: !4, line: 259, baseType: !990, size: 32, align: 32, offset: 128)
!990 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !985, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !985, file: !4, line: 271, baseType: !993, size: 64, align: 64, offset: 192)
!993 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !985, file: !4, line: 265, size: 64, align: 64, elements: !994)
!994 = !{!995, !999, !1001, !1002}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !993, file: !4, line: 266, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !997, line: 40, baseType: !998)
!997 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!998 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !993, file: !4, line: 267, baseType: !1000, size: 64, align: 64)
!1000 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !993, file: !4, line: 268, baseType: !975, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !993, file: !4, line: 270, baseType: !1003, size: 64, align: 32)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1004, line: 61, baseType: !1005)
!1004 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1004, line: 58, size: 64, align: 32, elements: !1006)
!1006 = !{!1007, !1008}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1005, file: !1004, line: 59, baseType: !990, size: 32, align: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1005, file: !1004, line: 60, baseType: !990, size: 32, align: 32, offset: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !985, file: !4, line: 272, baseType: !1000, size: 64, align: 64, offset: 256)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !985, file: !4, line: 273, baseType: !1000, size: 64, align: 64, offset: 320)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !985, file: !4, line: 275, baseType: !990, size: 32, align: 32, offset: 384)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !985, file: !4, line: 300, baseType: !975, size: 64, align: 64, offset: 448)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !972, file: !26, line: 93, baseType: !990, size: 32, align: 32, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !972, file: !26, line: 99, baseType: !990, size: 32, align: 32, offset: 224)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !972, file: !26, line: 108, baseType: !990, size: 32, align: 32, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !972, file: !26, line: 113, baseType: !1017, size: 64, align: 64, offset: 320)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!952, !952, !952}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !972, file: !26, line: 123, baseType: !1021, size: 64, align: 64, offset: 384)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!1024, !1024}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !972, file: !26, line: 130, baseType: !1027, size: 32, align: 32, offset: 448)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !972, file: !26, line: 136, baseType: !1029, size: 64, align: 64, offset: 512)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!1027, !952}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !972, file: !26, line: 142, baseType: !1033, size: 64, align: 64, offset: 576)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!990, !1036, !952, !975, !990}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1039)
!1039 = !{!1040, !1052, !1053}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1038, file: !4, line: 360, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1045)
!1045 = !{!1046, !1047, !1048, !1049, !1050, !1051}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1044, file: !4, line: 307, baseType: !975, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1044, file: !4, line: 313, baseType: !1000, size: 64, align: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1044, file: !4, line: 313, baseType: !1000, size: 64, align: 64, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1044, file: !4, line: 318, baseType: !1000, size: 64, align: 64, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1044, file: !4, line: 318, baseType: !1000, size: 64, align: 64, offset: 256)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1044, file: !4, line: 323, baseType: !990, size: 32, align: 32, offset: 320)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1038, file: !4, line: 364, baseType: !990, size: 32, align: 32, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1038, file: !4, line: 368, baseType: !990, size: 32, align: 32, offset: 96)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !967, file: !966, line: 84, baseType: !990, size: 32, align: 32, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !967, file: !966, line: 84, baseType: !990, size: 32, align: 32, offset: 96)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !967, file: !966, line: 85, baseType: !990, size: 32, align: 32, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !967, file: !966, line: 86, baseType: !1058, size: 384, align: 32, offset: 160)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 384, align: 32, elements: !1059)
!1059 = !{!1060}
!1060 = !DISubrange(count: 12)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !967, file: !966, line: 87, baseType: !990, size: 32, align: 32, offset: 544)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !967, file: !966, line: 90, baseType: !1063, size: 1088, align: 64, offset: 576)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !917, line: 35, baseType: !1064)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !917, line: 31, size: 1088, align: 64, elements: !1065)
!1065 = !{!1066, !1071, !1075}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1064, file: !917, line: 32, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1069)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !997, line: 48, baseType: !1070)
!1070 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1064, file: !917, line: 33, baseType: !1072, size: 512, align: 8, offset: 64)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1069, size: 512, align: 8, elements: !1073)
!1073 = !{!1074}
!1074 = !DISubrange(count: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1064, file: !917, line: 34, baseType: !1072, size: 512, align: 8, offset: 576)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !967, file: !966, line: 91, baseType: !1063, size: 1088, align: 64, offset: 1664)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !967, file: !966, line: 92, baseType: !1063, size: 1088, align: 64, offset: 2752)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !967, file: !966, line: 93, baseType: !1063, size: 1088, align: 64, offset: 3840)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !967, file: !966, line: 98, baseType: !1080, size: 64, align: 64, offset: 4928)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1082)
!1082 = !{!1083, !1086, !1087, !1088, !1355, !1356, !1357, !1358, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1510, !1514, !1515, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1693, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1081, file: !57, line: 1561, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1081, file: !57, line: 1562, baseType: !990, size: 32, align: 32, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1081, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1081, file: !57, line: 1565, baseType: !1089, size: 64, align: 64, offset: 128)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1091)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1092)
!1092 = !{!1093, !1094, !1095, !1096, !1097, !1098, !1101, !1104, !1107, !1110, !1115, !1116, !1117, !1125, !1126, !1127, !1129, !1135, !1141, !1150, !1154, !1155, !1205, !1326, !1330, !1331, !1335, !1339, !1344, !1348, !1349, !1350}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1091, file: !57, line: 3475, baseType: !975, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1091, file: !57, line: 3480, baseType: !975, size: 64, align: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1091, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1091, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1091, file: !57, line: 3487, baseType: !990, size: 32, align: 32, offset: 192)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1091, file: !57, line: 3488, baseType: !1099, size: 64, align: 64, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1091, file: !57, line: 3489, baseType: !1102, size: 64, align: 64, offset: 320)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1091, file: !57, line: 3490, baseType: !1105, size: 64, align: 64, offset: 384)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1091, file: !57, line: 3491, baseType: !1108, size: 64, align: 64, offset: 448)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1091, file: !57, line: 3492, baseType: !1111, size: 64, align: 64, offset: 512)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1113)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !997, line: 55, baseType: !1114)
!1114 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1091, file: !57, line: 3493, baseType: !1069, size: 8, align: 8, offset: 576)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1091, file: !57, line: 3494, baseType: !1084, size: 64, align: 64, offset: 640)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1091, file: !57, line: 3495, baseType: !1118, size: 64, align: 64, offset: 704)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1120)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1122)
!1122 = !{!1123, !1124}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1121, file: !57, line: 3402, baseType: !990, size: 32, align: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1121, file: !57, line: 3403, baseType: !975, size: 64, align: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1091, file: !57, line: 3507, baseType: !975, size: 64, align: 64, offset: 768)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1091, file: !57, line: 3516, baseType: !990, size: 32, align: 32, offset: 832)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1091, file: !57, line: 3517, baseType: !1128, size: 64, align: 64, offset: 896)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1091, file: !57, line: 3527, baseType: !1130, size: 64, align: 64, offset: 960)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!990, !1133}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1081)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1091, file: !57, line: 3535, baseType: !1136, size: 64, align: 64, offset: 1024)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!990, !1133, !1139}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1134)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1091, file: !57, line: 3541, baseType: !1142, size: 64, align: 64, offset: 1088)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1144)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1146, line: 223, size: 128, align: 64, elements: !1147)
!1146 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1147 = !{!1148, !1149}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1145, file: !1146, line: 224, baseType: !1067, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1145, file: !1146, line: 225, baseType: !1067, size: 64, align: 64, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1091, file: !57, line: 3549, baseType: !1151, size: 64, align: 64, offset: 1152)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{null, !1128}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1091, file: !57, line: 3551, baseType: !1130, size: 64, align: 64, offset: 1216)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1091, file: !57, line: 3552, baseType: !1156, size: 64, align: 64, offset: 1280)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!990, !1133, !1159, !990, !1160}
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1163)
!1163 = !{!1164, !1167, !1170, !1171, !1172, !1204}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1162, file: !57, line: 3921, baseType: !1165, size: 16, align: 16)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !997, line: 49, baseType: !1166)
!1166 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1162, file: !57, line: 3922, baseType: !1168, size: 32, align: 32, offset: 32)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !997, line: 51, baseType: !1169)
!1169 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1162, file: !57, line: 3923, baseType: !1168, size: 32, align: 32, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1162, file: !57, line: 3924, baseType: !1169, size: 32, align: 32, offset: 96)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1162, file: !57, line: 3925, baseType: !1173, size: 64, align: 64, offset: 128)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1176)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1177)
!1177 = !{!1178, !1179, !1180, !1181, !1182, !1183, !1193, !1197, !1199, !1200, !1202, !1203}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1176, file: !57, line: 3886, baseType: !990, size: 32, align: 32)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1176, file: !57, line: 3887, baseType: !990, size: 32, align: 32, offset: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1176, file: !57, line: 3888, baseType: !990, size: 32, align: 32, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1176, file: !57, line: 3889, baseType: !990, size: 32, align: 32, offset: 96)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1176, file: !57, line: 3890, baseType: !990, size: 32, align: 32, offset: 128)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1176, file: !57, line: 3897, baseType: !1184, size: 768, align: 64, offset: 192)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1186)
!1186 = !{!1187, !1191}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1185, file: !57, line: 3855, baseType: !1188, size: 512, align: 64)
!1188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1159, size: 512, align: 64, elements: !1189)
!1189 = !{!1190}
!1190 = !DISubrange(count: 8)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1185, file: !57, line: 3857, baseType: !1192, size: 256, align: 32, offset: 512)
!1192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 256, align: 32, elements: !1189)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1176, file: !57, line: 3903, baseType: !1194, size: 256, align: 64, offset: 960)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1159, size: 256, align: 64, elements: !1195)
!1195 = !{!1196}
!1196 = !DISubrange(count: 4)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1176, file: !57, line: 3904, baseType: !1198, size: 128, align: 32, offset: 1216)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 128, align: 32, elements: !1195)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1176, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1176, file: !57, line: 3908, baseType: !1201, size: 64, align: 64, offset: 1408)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1176, file: !57, line: 3915, baseType: !1201, size: 64, align: 64, offset: 1472)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1176, file: !57, line: 3917, baseType: !990, size: 32, align: 32, offset: 1536)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1162, file: !57, line: 3926, baseType: !996, size: 64, align: 64, offset: 192)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1091, file: !57, line: 3564, baseType: !1206, size: 64, align: 64, offset: 1344)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!990, !1133, !1209, !1243, !1325}
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1212)
!1212 = !{!1213, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1239, !1240, !1241, !1242}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1211, file: !57, line: 1451, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1216, line: 94, baseType: !1217)
!1216 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1216, line: 81, size: 192, align: 64, elements: !1218)
!1218 = !{!1219, !1223, !1224}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1217, file: !1216, line: 82, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1216, line: 73, baseType: !1222)
!1222 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1216, line: 73, flags: DIFlagFwdDecl)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1217, file: !1216, line: 89, baseType: !1159, size: 64, align: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1217, file: !1216, line: 93, baseType: !990, size: 32, align: 32, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1211, file: !57, line: 1461, baseType: !996, size: 64, align: 64, offset: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1211, file: !57, line: 1467, baseType: !996, size: 64, align: 64, offset: 128)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1211, file: !57, line: 1468, baseType: !1159, size: 64, align: 64, offset: 192)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1211, file: !57, line: 1469, baseType: !990, size: 32, align: 32, offset: 256)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1211, file: !57, line: 1470, baseType: !990, size: 32, align: 32, offset: 288)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1211, file: !57, line: 1474, baseType: !990, size: 32, align: 32, offset: 320)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1211, file: !57, line: 1479, baseType: !1232, size: 64, align: 64, offset: 384)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1235)
!1235 = !{!1236, !1237, !1238}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1234, file: !57, line: 1412, baseType: !1159, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1234, file: !57, line: 1413, baseType: !990, size: 32, align: 32, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1234, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1211, file: !57, line: 1480, baseType: !990, size: 32, align: 32, offset: 448)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1211, file: !57, line: 1486, baseType: !996, size: 64, align: 64, offset: 512)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1211, file: !57, line: 1488, baseType: !996, size: 64, align: 64, offset: 576)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1211, file: !57, line: 1497, baseType: !996, size: 64, align: 64, offset: 640)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1245)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1246)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1247)
!1247 = !{!1248, !1249, !1250, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1277, !1279, !1280, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1313, !1314, !1315, !1316, !1317, !1318, !1321, !1322, !1323, !1324}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1246, file: !780, line: 282, baseType: !1188, size: 512, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1246, file: !780, line: 299, baseType: !1192, size: 256, align: 32, offset: 512)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1246, file: !780, line: 315, baseType: !1251, size: 64, align: 64, offset: 768)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1246, file: !780, line: 326, baseType: !990, size: 32, align: 32, offset: 832)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1246, file: !780, line: 326, baseType: !990, size: 32, align: 32, offset: 864)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1246, file: !780, line: 334, baseType: !990, size: 32, align: 32, offset: 896)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1246, file: !780, line: 341, baseType: !990, size: 32, align: 32, offset: 928)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1246, file: !780, line: 346, baseType: !990, size: 32, align: 32, offset: 960)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1246, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1246, file: !780, line: 356, baseType: !1003, size: 64, align: 32, offset: 1024)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1246, file: !780, line: 361, baseType: !996, size: 64, align: 64, offset: 1088)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1246, file: !780, line: 369, baseType: !996, size: 64, align: 64, offset: 1152)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1246, file: !780, line: 377, baseType: !996, size: 64, align: 64, offset: 1216)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1246, file: !780, line: 382, baseType: !990, size: 32, align: 32, offset: 1280)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1246, file: !780, line: 386, baseType: !990, size: 32, align: 32, offset: 1312)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1246, file: !780, line: 391, baseType: !990, size: 32, align: 32, offset: 1344)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1246, file: !780, line: 396, baseType: !952, size: 64, align: 64, offset: 1408)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1246, file: !780, line: 403, baseType: !1267, size: 512, align: 64, offset: 1472)
!1267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1113, size: 512, align: 64, elements: !1189)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1246, file: !780, line: 410, baseType: !990, size: 32, align: 32, offset: 1984)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1246, file: !780, line: 415, baseType: !990, size: 32, align: 32, offset: 2016)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1246, file: !780, line: 420, baseType: !990, size: 32, align: 32, offset: 2048)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1246, file: !780, line: 425, baseType: !990, size: 32, align: 32, offset: 2080)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1246, file: !780, line: 435, baseType: !996, size: 64, align: 64, offset: 2112)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1246, file: !780, line: 440, baseType: !990, size: 32, align: 32, offset: 2176)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1246, file: !780, line: 445, baseType: !1113, size: 64, align: 64, offset: 2240)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1246, file: !780, line: 459, baseType: !1276, size: 512, align: 64, offset: 2304)
!1276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1214, size: 512, align: 64, elements: !1189)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1246, file: !780, line: 473, baseType: !1278, size: 64, align: 64, offset: 2816)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1246, file: !780, line: 477, baseType: !990, size: 32, align: 32, offset: 2880)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1246, file: !780, line: 479, baseType: !1281, size: 64, align: 64, offset: 2944)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1284)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1285)
!1285 = !{!1286, !1287, !1288, !1289, !1294}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1284, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1284, file: !780, line: 203, baseType: !1159, size: 64, align: 64, offset: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1284, file: !780, line: 204, baseType: !990, size: 32, align: 32, offset: 128)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1284, file: !780, line: 205, baseType: !1290, size: 64, align: 64, offset: 192)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1292, line: 86, baseType: !1293)
!1292 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1293 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1292, line: 86, flags: DIFlagFwdDecl)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1284, file: !780, line: 206, baseType: !1214, size: 64, align: 64, offset: 256)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1246, file: !780, line: 480, baseType: !990, size: 32, align: 32, offset: 3008)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1246, file: !780, line: 505, baseType: !990, size: 32, align: 32, offset: 3040)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1246, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1246, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1246, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1246, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1246, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1246, file: !780, line: 532, baseType: !996, size: 64, align: 64, offset: 3264)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1246, file: !780, line: 539, baseType: !996, size: 64, align: 64, offset: 3328)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1246, file: !780, line: 547, baseType: !996, size: 64, align: 64, offset: 3392)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1246, file: !780, line: 554, baseType: !1290, size: 64, align: 64, offset: 3456)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1246, file: !780, line: 563, baseType: !990, size: 32, align: 32, offset: 3520)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1246, file: !780, line: 572, baseType: !990, size: 32, align: 32, offset: 3552)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1246, file: !780, line: 581, baseType: !990, size: 32, align: 32, offset: 3584)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1246, file: !780, line: 588, baseType: !1310, size: 64, align: 64, offset: 3648)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !997, line: 36, baseType: !1312)
!1312 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1246, file: !780, line: 593, baseType: !990, size: 32, align: 32, offset: 3712)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1246, file: !780, line: 596, baseType: !990, size: 32, align: 32, offset: 3744)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1246, file: !780, line: 599, baseType: !1214, size: 64, align: 64, offset: 3776)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1246, file: !780, line: 605, baseType: !1214, size: 64, align: 64, offset: 3840)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1246, file: !780, line: 616, baseType: !1214, size: 64, align: 64, offset: 3904)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1246, file: !780, line: 626, baseType: !1319, size: 64, align: 64, offset: 3968)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1320, line: 216, baseType: !1114)
!1320 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1246, file: !780, line: 627, baseType: !1319, size: 64, align: 64, offset: 4032)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1246, file: !780, line: 628, baseType: !1319, size: 64, align: 64, offset: 4096)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1246, file: !780, line: 629, baseType: !1319, size: 64, align: 64, offset: 4160)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1246, file: !780, line: 645, baseType: !1214, size: 64, align: 64, offset: 4224)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1091, file: !57, line: 3566, baseType: !1327, size: 64, align: 64, offset: 1408)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!990, !1133, !952, !1325, !1209}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1091, file: !57, line: 3567, baseType: !1130, size: 64, align: 64, offset: 1472)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1091, file: !57, line: 3576, baseType: !1332, size: 64, align: 64, offset: 1536)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!990, !1133, !1243}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1091, file: !57, line: 3577, baseType: !1336, size: 64, align: 64, offset: 1600)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{!990, !1133, !1209}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1091, file: !57, line: 3584, baseType: !1340, size: 64, align: 64, offset: 1664)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{!990, !1133, !1343}
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1091, file: !57, line: 3589, baseType: !1345, size: 64, align: 64, offset: 1728)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DISubroutineType(types: !1347)
!1347 = !{null, !1133}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1091, file: !57, line: 3594, baseType: !990, size: 32, align: 32, offset: 1792)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1091, file: !57, line: 3600, baseType: !975, size: 64, align: 64, offset: 1856)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1091, file: !57, line: 3609, baseType: !1351, size: 64, align: 64, offset: 1920)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1354)
!1354 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1081, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1081, file: !57, line: 1581, baseType: !1169, size: 32, align: 32, offset: 224)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1081, file: !57, line: 1583, baseType: !952, size: 64, align: 64, offset: 256)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1081, file: !57, line: 1591, baseType: !1359, size: 64, align: 64, offset: 320)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1146, line: 129, size: 1664, align: 64, elements: !1361)
!1361 = !{!1362, !1363, !1364, !1365, !1366, !1384, !1385, !1391, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1360, file: !1146, line: 136, baseType: !990, size: 32, align: 32)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1360, file: !1146, line: 151, baseType: !990, size: 32, align: 32, offset: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1360, file: !1146, line: 157, baseType: !990, size: 32, align: 32, offset: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1360, file: !1146, line: 159, baseType: !1343, size: 64, align: 64, offset: 128)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1360, file: !1146, line: 161, baseType: !1367, size: 64, align: 64, offset: 192)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1146, line: 117, baseType: !1369)
!1369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1146, line: 100, size: 832, align: 64, elements: !1370)
!1370 = !{!1371, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1369, file: !1146, line: 105, baseType: !1372, size: 256, align: 64)
!1372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1373, size: 256, align: 64, elements: !1195)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1216, line: 238, baseType: !1375)
!1375 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1216, line: 238, flags: DIFlagFwdDecl)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1369, file: !1146, line: 110, baseType: !990, size: 32, align: 32, offset: 256)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1369, file: !1146, line: 111, baseType: !990, size: 32, align: 32, offset: 288)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1369, file: !1146, line: 111, baseType: !990, size: 32, align: 32, offset: 320)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1369, file: !1146, line: 112, baseType: !1192, size: 256, align: 32, offset: 352)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1369, file: !1146, line: 113, baseType: !1198, size: 128, align: 32, offset: 608)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1369, file: !1146, line: 114, baseType: !990, size: 32, align: 32, offset: 736)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1369, file: !1146, line: 115, baseType: !990, size: 32, align: 32, offset: 768)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1369, file: !1146, line: 116, baseType: !990, size: 32, align: 32, offset: 800)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1360, file: !1146, line: 163, baseType: !952, size: 64, align: 64, offset: 256)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1360, file: !1146, line: 165, baseType: !1386, size: 128, align: 64, offset: 320)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1146, line: 122, baseType: !1387)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1146, line: 119, size: 128, align: 64, elements: !1388)
!1388 = !{!1389, !1390}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1387, file: !1146, line: 120, baseType: !1209, size: 64, align: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1387, file: !1146, line: 121, baseType: !1343, size: 64, align: 64, offset: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1360, file: !1146, line: 166, baseType: !1392, size: 128, align: 64, offset: 448)
!1392 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1146, line: 127, baseType: !1393)
!1393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1146, line: 124, size: 128, align: 64, elements: !1394)
!1394 = !{!1395, !1468}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1393, file: !1146, line: 125, baseType: !1396, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1399)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1400)
!1400 = !{!1401, !1402, !1426, !1430, !1431, !1465, !1466, !1467}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1399, file: !57, line: 5751, baseType: !1084, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1399, file: !57, line: 5756, baseType: !1403, size: 64, align: 64, offset: 64)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1405)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1406)
!1406 = !{!1407, !1408, !1411, !1412, !1413, !1417, !1421, !1425}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1405, file: !57, line: 5797, baseType: !975, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1405, file: !57, line: 5804, baseType: !1409, size: 64, align: 64, offset: 64)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1405, file: !57, line: 5815, baseType: !1084, size: 64, align: 64, offset: 128)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1405, file: !57, line: 5825, baseType: !990, size: 32, align: 32, offset: 192)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1405, file: !57, line: 5826, baseType: !1414, size: 64, align: 64, offset: 256)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{!990, !1397}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1405, file: !57, line: 5827, baseType: !1418, size: 64, align: 64, offset: 320)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DISubroutineType(types: !1420)
!1420 = !{!990, !1397, !1209}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1405, file: !57, line: 5828, baseType: !1422, size: 64, align: 64, offset: 384)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{null, !1397}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1405, file: !57, line: 5829, baseType: !1422, size: 64, align: 64, offset: 448)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1399, file: !57, line: 5762, baseType: !1427, size: 64, align: 64, offset: 128)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1429)
!1429 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1399, file: !57, line: 5768, baseType: !952, size: 64, align: 64, offset: 192)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1399, file: !57, line: 5775, baseType: !1432, size: 64, align: 64, offset: 256)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1434)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1435)
!1435 = !{!1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1434, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1434, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1434, file: !57, line: 3948, baseType: !1168, size: 32, align: 32, offset: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1434, file: !57, line: 3958, baseType: !1159, size: 64, align: 64, offset: 128)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1434, file: !57, line: 3962, baseType: !990, size: 32, align: 32, offset: 192)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1434, file: !57, line: 3968, baseType: !990, size: 32, align: 32, offset: 224)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1434, file: !57, line: 3973, baseType: !996, size: 64, align: 64, offset: 256)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1434, file: !57, line: 3986, baseType: !990, size: 32, align: 32, offset: 320)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1434, file: !57, line: 3999, baseType: !990, size: 32, align: 32, offset: 352)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1434, file: !57, line: 4004, baseType: !990, size: 32, align: 32, offset: 384)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1434, file: !57, line: 4005, baseType: !990, size: 32, align: 32, offset: 416)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1434, file: !57, line: 4010, baseType: !990, size: 32, align: 32, offset: 448)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1434, file: !57, line: 4011, baseType: !990, size: 32, align: 32, offset: 480)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1434, file: !57, line: 4020, baseType: !1003, size: 64, align: 32, offset: 512)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1434, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1434, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1434, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1434, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1434, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1434, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1434, file: !57, line: 4039, baseType: !990, size: 32, align: 32, offset: 768)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1434, file: !57, line: 4046, baseType: !1113, size: 64, align: 64, offset: 832)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1434, file: !57, line: 4050, baseType: !990, size: 32, align: 32, offset: 896)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1434, file: !57, line: 4054, baseType: !990, size: 32, align: 32, offset: 928)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1434, file: !57, line: 4061, baseType: !990, size: 32, align: 32, offset: 960)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1434, file: !57, line: 4065, baseType: !990, size: 32, align: 32, offset: 992)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1434, file: !57, line: 4073, baseType: !990, size: 32, align: 32, offset: 1024)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1434, file: !57, line: 4080, baseType: !990, size: 32, align: 32, offset: 1056)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1434, file: !57, line: 4084, baseType: !990, size: 32, align: 32, offset: 1088)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1399, file: !57, line: 5781, baseType: !1432, size: 64, align: 64, offset: 320)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1399, file: !57, line: 5787, baseType: !1003, size: 64, align: 32, offset: 384)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1399, file: !57, line: 5793, baseType: !1003, size: 64, align: 32, offset: 448)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1393, file: !1146, line: 126, baseType: !990, size: 32, align: 32, offset: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1360, file: !1146, line: 172, baseType: !1209, size: 64, align: 64, offset: 576)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1360, file: !1146, line: 177, baseType: !1159, size: 64, align: 64, offset: 640)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1360, file: !1146, line: 178, baseType: !1169, size: 32, align: 32, offset: 704)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1360, file: !1146, line: 180, baseType: !952, size: 64, align: 64, offset: 768)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1360, file: !1146, line: 185, baseType: !990, size: 32, align: 32, offset: 832)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1360, file: !1146, line: 190, baseType: !952, size: 64, align: 64, offset: 896)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1360, file: !1146, line: 195, baseType: !990, size: 32, align: 32, offset: 960)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1360, file: !1146, line: 200, baseType: !1209, size: 64, align: 64, offset: 1024)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1360, file: !1146, line: 201, baseType: !990, size: 32, align: 32, offset: 1088)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1360, file: !1146, line: 202, baseType: !1343, size: 64, align: 64, offset: 1152)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1360, file: !1146, line: 203, baseType: !990, size: 32, align: 32, offset: 1216)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1360, file: !1146, line: 205, baseType: !990, size: 32, align: 32, offset: 1248)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1360, file: !1146, line: 206, baseType: !990, size: 32, align: 32, offset: 1280)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1360, file: !1146, line: 209, baseType: !1319, size: 64, align: 64, offset: 1344)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1360, file: !1146, line: 212, baseType: !1319, size: 64, align: 64, offset: 1408)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1360, file: !1146, line: 213, baseType: !1343, size: 64, align: 64, offset: 1472)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1360, file: !1146, line: 215, baseType: !990, size: 32, align: 32, offset: 1536)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1360, file: !1146, line: 217, baseType: !990, size: 32, align: 32, offset: 1568)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1360, file: !1146, line: 220, baseType: !990, size: 32, align: 32, offset: 1600)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1081, file: !57, line: 1598, baseType: !952, size: 64, align: 64, offset: 384)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1081, file: !57, line: 1606, baseType: !996, size: 64, align: 64, offset: 448)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1081, file: !57, line: 1614, baseType: !990, size: 32, align: 32, offset: 512)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1081, file: !57, line: 1622, baseType: !990, size: 32, align: 32, offset: 544)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1081, file: !57, line: 1628, baseType: !990, size: 32, align: 32, offset: 576)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1081, file: !57, line: 1636, baseType: !990, size: 32, align: 32, offset: 608)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1081, file: !57, line: 1643, baseType: !990, size: 32, align: 32, offset: 640)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1081, file: !57, line: 1657, baseType: !1159, size: 64, align: 64, offset: 704)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1081, file: !57, line: 1658, baseType: !990, size: 32, align: 32, offset: 768)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1081, file: !57, line: 1679, baseType: !1003, size: 64, align: 32, offset: 800)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1081, file: !57, line: 1688, baseType: !990, size: 32, align: 32, offset: 864)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1081, file: !57, line: 1712, baseType: !990, size: 32, align: 32, offset: 896)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1081, file: !57, line: 1729, baseType: !990, size: 32, align: 32, offset: 928)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1081, file: !57, line: 1729, baseType: !990, size: 32, align: 32, offset: 960)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1081, file: !57, line: 1744, baseType: !990, size: 32, align: 32, offset: 992)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1081, file: !57, line: 1744, baseType: !990, size: 32, align: 32, offset: 1024)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1081, file: !57, line: 1751, baseType: !990, size: 32, align: 32, offset: 1056)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1081, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1081, file: !57, line: 1791, baseType: !1507, size: 64, align: 64, offset: 1152)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DISubroutineType(types: !1509)
!1509 = !{null, !1080, !1243, !1325, !990, !990, !990}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1081, file: !57, line: 1808, baseType: !1511, size: 64, align: 64, offset: 1216)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DISubroutineType(types: !1513)
!1513 = !{!516, !1080, !1102}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1081, file: !57, line: 1816, baseType: !990, size: 32, align: 32, offset: 1280)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1081, file: !57, line: 1825, baseType: !1516, size: 32, align: 32, offset: 1312)
!1516 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1081, file: !57, line: 1830, baseType: !990, size: 32, align: 32, offset: 1344)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1081, file: !57, line: 1838, baseType: !1516, size: 32, align: 32, offset: 1376)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1081, file: !57, line: 1846, baseType: !990, size: 32, align: 32, offset: 1408)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1081, file: !57, line: 1851, baseType: !990, size: 32, align: 32, offset: 1440)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1081, file: !57, line: 1861, baseType: !1516, size: 32, align: 32, offset: 1472)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1081, file: !57, line: 1868, baseType: !1516, size: 32, align: 32, offset: 1504)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1081, file: !57, line: 1875, baseType: !1516, size: 32, align: 32, offset: 1536)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1081, file: !57, line: 1882, baseType: !1516, size: 32, align: 32, offset: 1568)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1081, file: !57, line: 1889, baseType: !1516, size: 32, align: 32, offset: 1600)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1081, file: !57, line: 1896, baseType: !1516, size: 32, align: 32, offset: 1632)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1081, file: !57, line: 1903, baseType: !1516, size: 32, align: 32, offset: 1664)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1081, file: !57, line: 1910, baseType: !990, size: 32, align: 32, offset: 1696)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1081, file: !57, line: 1915, baseType: !990, size: 32, align: 32, offset: 1728)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1081, file: !57, line: 1926, baseType: !1325, size: 64, align: 64, offset: 1792)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1081, file: !57, line: 1935, baseType: !1003, size: 64, align: 32, offset: 1856)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1081, file: !57, line: 1942, baseType: !990, size: 32, align: 32, offset: 1920)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1081, file: !57, line: 1948, baseType: !990, size: 32, align: 32, offset: 1952)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1081, file: !57, line: 1954, baseType: !990, size: 32, align: 32, offset: 1984)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1081, file: !57, line: 1960, baseType: !990, size: 32, align: 32, offset: 2016)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1081, file: !57, line: 1984, baseType: !990, size: 32, align: 32, offset: 2048)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1081, file: !57, line: 1991, baseType: !990, size: 32, align: 32, offset: 2080)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1081, file: !57, line: 1996, baseType: !990, size: 32, align: 32, offset: 2112)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1081, file: !57, line: 2004, baseType: !990, size: 32, align: 32, offset: 2144)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1081, file: !57, line: 2011, baseType: !990, size: 32, align: 32, offset: 2176)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1081, file: !57, line: 2018, baseType: !990, size: 32, align: 32, offset: 2208)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1081, file: !57, line: 2027, baseType: !990, size: 32, align: 32, offset: 2240)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1081, file: !57, line: 2034, baseType: !990, size: 32, align: 32, offset: 2272)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1081, file: !57, line: 2044, baseType: !990, size: 32, align: 32, offset: 2304)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1081, file: !57, line: 2054, baseType: !1546, size: 64, align: 64, offset: 2368)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1081, file: !57, line: 2061, baseType: !1546, size: 64, align: 64, offset: 2432)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1081, file: !57, line: 2066, baseType: !990, size: 32, align: 32, offset: 2496)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1081, file: !57, line: 2070, baseType: !990, size: 32, align: 32, offset: 2528)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1081, file: !57, line: 2078, baseType: !990, size: 32, align: 32, offset: 2560)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1081, file: !57, line: 2085, baseType: !990, size: 32, align: 32, offset: 2592)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1081, file: !57, line: 2092, baseType: !990, size: 32, align: 32, offset: 2624)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1081, file: !57, line: 2099, baseType: !990, size: 32, align: 32, offset: 2656)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1081, file: !57, line: 2106, baseType: !990, size: 32, align: 32, offset: 2688)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1081, file: !57, line: 2113, baseType: !990, size: 32, align: 32, offset: 2720)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1081, file: !57, line: 2120, baseType: !990, size: 32, align: 32, offset: 2752)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1081, file: !57, line: 2125, baseType: !990, size: 32, align: 32, offset: 2784)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1081, file: !57, line: 2133, baseType: !990, size: 32, align: 32, offset: 2816)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1081, file: !57, line: 2140, baseType: !990, size: 32, align: 32, offset: 2848)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1081, file: !57, line: 2145, baseType: !990, size: 32, align: 32, offset: 2880)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1081, file: !57, line: 2153, baseType: !990, size: 32, align: 32, offset: 2912)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1081, file: !57, line: 2158, baseType: !990, size: 32, align: 32, offset: 2944)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1081, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1081, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1081, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1081, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1081, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1081, file: !57, line: 2203, baseType: !990, size: 32, align: 32, offset: 3136)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1081, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1081, file: !57, line: 2212, baseType: !990, size: 32, align: 32, offset: 3200)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1081, file: !57, line: 2213, baseType: !990, size: 32, align: 32, offset: 3232)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1081, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1081, file: !57, line: 2232, baseType: !990, size: 32, align: 32, offset: 3296)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1081, file: !57, line: 2243, baseType: !990, size: 32, align: 32, offset: 3328)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1081, file: !57, line: 2249, baseType: !990, size: 32, align: 32, offset: 3360)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1081, file: !57, line: 2256, baseType: !990, size: 32, align: 32, offset: 3392)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1081, file: !57, line: 2263, baseType: !1113, size: 64, align: 64, offset: 3456)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1081, file: !57, line: 2270, baseType: !1113, size: 64, align: 64, offset: 3520)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1081, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1081, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1081, file: !57, line: 2367, baseType: !1582, size: 64, align: 64, offset: 3648)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DISubroutineType(types: !1584)
!1584 = !{!990, !1080, !1343, !990}
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1081, file: !57, line: 2383, baseType: !990, size: 32, align: 32, offset: 3712)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1081, file: !57, line: 2386, baseType: !1516, size: 32, align: 32, offset: 3744)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1081, file: !57, line: 2387, baseType: !1516, size: 32, align: 32, offset: 3776)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1081, file: !57, line: 2394, baseType: !990, size: 32, align: 32, offset: 3808)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1081, file: !57, line: 2401, baseType: !990, size: 32, align: 32, offset: 3840)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1081, file: !57, line: 2408, baseType: !990, size: 32, align: 32, offset: 3872)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1081, file: !57, line: 2415, baseType: !990, size: 32, align: 32, offset: 3904)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1081, file: !57, line: 2422, baseType: !990, size: 32, align: 32, offset: 3936)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1081, file: !57, line: 2423, baseType: !1594, size: 64, align: 64, offset: 3968)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1596)
!1596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1597)
!1597 = !{!1598, !1599, !1600, !1601}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1596, file: !57, line: 827, baseType: !990, size: 32, align: 32)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1596, file: !57, line: 828, baseType: !990, size: 32, align: 32, offset: 32)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1596, file: !57, line: 829, baseType: !990, size: 32, align: 32, offset: 64)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1596, file: !57, line: 830, baseType: !1516, size: 32, align: 32, offset: 96)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1081, file: !57, line: 2430, baseType: !996, size: 64, align: 64, offset: 4032)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1081, file: !57, line: 2437, baseType: !996, size: 64, align: 64, offset: 4096)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1081, file: !57, line: 2444, baseType: !1516, size: 32, align: 32, offset: 4160)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1081, file: !57, line: 2451, baseType: !1516, size: 32, align: 32, offset: 4192)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1081, file: !57, line: 2458, baseType: !990, size: 32, align: 32, offset: 4224)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1081, file: !57, line: 2469, baseType: !990, size: 32, align: 32, offset: 4256)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1081, file: !57, line: 2475, baseType: !990, size: 32, align: 32, offset: 4288)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1081, file: !57, line: 2481, baseType: !990, size: 32, align: 32, offset: 4320)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1081, file: !57, line: 2485, baseType: !990, size: 32, align: 32, offset: 4352)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1081, file: !57, line: 2489, baseType: !990, size: 32, align: 32, offset: 4384)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1081, file: !57, line: 2493, baseType: !990, size: 32, align: 32, offset: 4416)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1081, file: !57, line: 2501, baseType: !990, size: 32, align: 32, offset: 4448)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1081, file: !57, line: 2506, baseType: !990, size: 32, align: 32, offset: 4480)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1081, file: !57, line: 2510, baseType: !990, size: 32, align: 32, offset: 4512)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1081, file: !57, line: 2514, baseType: !996, size: 64, align: 64, offset: 4544)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1081, file: !57, line: 2528, baseType: !1618, size: 64, align: 64, offset: 4608)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DISubroutineType(types: !1620)
!1620 = !{null, !1080, !952, !990, !990}
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1081, file: !57, line: 2534, baseType: !990, size: 32, align: 32, offset: 4672)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1081, file: !57, line: 2545, baseType: !990, size: 32, align: 32, offset: 4704)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1081, file: !57, line: 2547, baseType: !990, size: 32, align: 32, offset: 4736)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1081, file: !57, line: 2549, baseType: !990, size: 32, align: 32, offset: 4768)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1081, file: !57, line: 2551, baseType: !990, size: 32, align: 32, offset: 4800)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1081, file: !57, line: 2553, baseType: !990, size: 32, align: 32, offset: 4832)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1081, file: !57, line: 2555, baseType: !990, size: 32, align: 32, offset: 4864)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1081, file: !57, line: 2557, baseType: !990, size: 32, align: 32, offset: 4896)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1081, file: !57, line: 2559, baseType: !990, size: 32, align: 32, offset: 4928)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1081, file: !57, line: 2563, baseType: !990, size: 32, align: 32, offset: 4960)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1081, file: !57, line: 2571, baseType: !1201, size: 64, align: 64, offset: 4992)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1081, file: !57, line: 2579, baseType: !1201, size: 64, align: 64, offset: 5056)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1081, file: !57, line: 2586, baseType: !990, size: 32, align: 32, offset: 5120)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1081, file: !57, line: 2615, baseType: !990, size: 32, align: 32, offset: 5152)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1081, file: !57, line: 2627, baseType: !990, size: 32, align: 32, offset: 5184)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1081, file: !57, line: 2637, baseType: !990, size: 32, align: 32, offset: 5216)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1081, file: !57, line: 2681, baseType: !990, size: 32, align: 32, offset: 5248)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1081, file: !57, line: 2709, baseType: !996, size: 64, align: 64, offset: 5312)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1081, file: !57, line: 2716, baseType: !1640, size: 64, align: 64, offset: 5376)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1642)
!1642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1643)
!1643 = !{!1644, !1645, !1646, !1647, !1648, !1649, !1650, !1654, !1658, !1659, !1660, !1661, !1666, !1667, !1668, !1669, !1670}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1642, file: !57, line: 3642, baseType: !975, size: 64, align: 64)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1642, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1642, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1642, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1642, file: !57, line: 3669, baseType: !990, size: 32, align: 32, offset: 160)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1642, file: !57, line: 3682, baseType: !1340, size: 64, align: 64, offset: 192)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1642, file: !57, line: 3698, baseType: !1651, size: 64, align: 64, offset: 256)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DISubroutineType(types: !1653)
!1653 = !{!990, !1133, !1067, !1168}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1642, file: !57, line: 3712, baseType: !1655, size: 64, align: 64, offset: 320)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DISubroutineType(types: !1657)
!1657 = !{!990, !1133, !990, !1067, !1168}
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1642, file: !57, line: 3726, baseType: !1651, size: 64, align: 64, offset: 384)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1642, file: !57, line: 3737, baseType: !1130, size: 64, align: 64, offset: 448)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1642, file: !57, line: 3746, baseType: !990, size: 32, align: 32, offset: 512)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1642, file: !57, line: 3757, baseType: !1662, size: 64, align: 64, offset: 576)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DISubroutineType(types: !1664)
!1664 = !{null, !1665}
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1642, file: !57, line: 3766, baseType: !1130, size: 64, align: 64, offset: 640)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1642, file: !57, line: 3774, baseType: !1130, size: 64, align: 64, offset: 704)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1642, file: !57, line: 3780, baseType: !990, size: 32, align: 32, offset: 768)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1642, file: !57, line: 3785, baseType: !990, size: 32, align: 32, offset: 800)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1642, file: !57, line: 3795, baseType: !1671, size: 64, align: 64, offset: 832)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DISubroutineType(types: !1673)
!1673 = !{!990, !1133, !1214}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1081, file: !57, line: 2728, baseType: !952, size: 64, align: 64, offset: 5440)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1081, file: !57, line: 2735, baseType: !1267, size: 512, align: 64, offset: 5504)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1081, file: !57, line: 2742, baseType: !990, size: 32, align: 32, offset: 6016)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1081, file: !57, line: 2755, baseType: !990, size: 32, align: 32, offset: 6048)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1081, file: !57, line: 2776, baseType: !990, size: 32, align: 32, offset: 6080)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1081, file: !57, line: 2783, baseType: !990, size: 32, align: 32, offset: 6112)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1081, file: !57, line: 2791, baseType: !990, size: 32, align: 32, offset: 6144)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1081, file: !57, line: 2802, baseType: !1343, size: 64, align: 64, offset: 6208)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1081, file: !57, line: 2811, baseType: !990, size: 32, align: 32, offset: 6272)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1081, file: !57, line: 2821, baseType: !990, size: 32, align: 32, offset: 6304)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1081, file: !57, line: 2830, baseType: !990, size: 32, align: 32, offset: 6336)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1081, file: !57, line: 2840, baseType: !990, size: 32, align: 32, offset: 6368)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1081, file: !57, line: 2851, baseType: !1687, size: 64, align: 64, offset: 6400)
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64, align: 64)
!1688 = !DISubroutineType(types: !1689)
!1689 = !{!990, !1080, !1690, !952, !1325, !990, !990}
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DISubroutineType(types: !1692)
!1692 = !{!990, !1080, !952}
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1081, file: !57, line: 2871, baseType: !1694, size: 64, align: 64, offset: 6464)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64, align: 64)
!1695 = !DISubroutineType(types: !1696)
!1696 = !{!990, !1080, !1697, !952, !1325, !990}
!1697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1698, size: 64, align: 64)
!1698 = !DISubroutineType(types: !1699)
!1699 = !{!990, !1080, !952, !990, !990}
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1081, file: !57, line: 2878, baseType: !990, size: 32, align: 32, offset: 6528)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1081, file: !57, line: 2885, baseType: !990, size: 32, align: 32, offset: 6560)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1081, file: !57, line: 3005, baseType: !990, size: 32, align: 32, offset: 6592)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1081, file: !57, line: 3013, baseType: !900, size: 32, align: 32, offset: 6624)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1081, file: !57, line: 3020, baseType: !900, size: 32, align: 32, offset: 6656)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1081, file: !57, line: 3027, baseType: !900, size: 32, align: 32, offset: 6688)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1081, file: !57, line: 3037, baseType: !1159, size: 64, align: 64, offset: 6720)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1081, file: !57, line: 3038, baseType: !990, size: 32, align: 32, offset: 6784)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1081, file: !57, line: 3050, baseType: !1113, size: 64, align: 64, offset: 6848)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1081, file: !57, line: 3065, baseType: !990, size: 32, align: 32, offset: 6912)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1081, file: !57, line: 3083, baseType: !990, size: 32, align: 32, offset: 6944)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1081, file: !57, line: 3092, baseType: !1003, size: 64, align: 32, offset: 6976)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1081, file: !57, line: 3099, baseType: !516, size: 32, align: 32, offset: 7040)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1081, file: !57, line: 3106, baseType: !1003, size: 64, align: 32, offset: 7072)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1081, file: !57, line: 3113, baseType: !1715, size: 64, align: 64, offset: 7168)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64, align: 64)
!1716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1717)
!1717 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !57, line: 740, baseType: !1718)
!1718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !57, line: 712, size: 384, align: 64, elements: !1719)
!1719 = !{!1720, !1721, !1722, !1723, !1724, !1725, !1728}
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1718, file: !57, line: 713, baseType: !56, size: 32, align: 32)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1718, file: !57, line: 714, baseType: !46, size: 32, align: 32, offset: 32)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1718, file: !57, line: 720, baseType: !975, size: 64, align: 64, offset: 64)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1718, file: !57, line: 724, baseType: !975, size: 64, align: 64, offset: 128)
