; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--h261enc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--h261enc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RLTable = type { i32, i32, [2 x i16]*, i8*, i8*, [2 x i8*], [2 x i8*], [2 x i8*], [32 x %struct.RL_VLC_ELEM*] }
%struct.RL_VLC_ELEM = type { i16, i8, i8 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!900 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !57, line: 798, size: 32, align: 32, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908}
!902 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!903 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!904 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!905 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!906 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!907 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!908 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OutputFormat", file: !910, line: 123, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/mpegutils.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!911 = !{!912, !913, !914, !915}
!912 = !DIEnumerator(name: "FMT_MPEG1", value: 0)
!913 = !DIEnumerator(name: "FMT_H261", value: 1)
!914 = !DIEnumerator(name: "FMT_H263", value: 2)
!915 = !DIEnumerator(name: "FMT_MJPEG", value: 3)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !917, line: 37, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!918 = !{!919, !920, !921, !922, !923, !924}
!919 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!920 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!921 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!922 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!923 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!924 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!925 = !{!926, !2600, !949}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "H261Context", file: !928, line: 47, baseType: !929)
!928 = !DIFile(filename: "libavcodec/h261.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H261Context", file: !928, line: 37, size: 86464, align: 64, elements: !930)
!930 = !{!931, !2593, !2594, !2595, !2596, !2597, !2598, !2599}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !929, file: !928, line: 38, baseType: !932, size: 86208, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "MpegEncContext", file: !933, line: 582, baseType: !934)
!933 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !933, line: 81, size: 86208, align: 64, elements: !935)
!935 = !{!936, !1022, !1023, !1024, !1025, !1029, !1030, !1045, !1046, !1047, !1048, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1757, !1758, !1813, !1815, !1816, !1817, !1818, !1819, !1830, !1831, !1832, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1848, !1850, !1852, !1853, !1854, !1855, !1856, !1857, !1862, !1864, !1865, !1866, !1867, !1868, !1869, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1896, !1897, !1898, !1899, !1915, !1922, !1934, !1950, !1972, !2012, !2025, !2052, !2067, !2081, !2094, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2115, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2128, !2130, !2131, !2132, !2133, !2134, !2135, !2138, !2140, !2142, !2143, !2146, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2213, !2214, !2216, !2217, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2239, !2240, !2241, !2244, !2245, !2246, !2247, !2249, !2251, !2252, !2253, !2254, !2255, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2337, !2338, !2339, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2445, !2446, !2447, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2468, !2469, !2470, !2471, !2475, !2476, !2480, !2484, !2488, !2489, !2494, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2509, !2510, !2514, !2515, !2516, !2517, !2518, !2519, !2520, !2521, !2522, !2523, !2524, !2525, !2526, !2528, !2529, !2530, !2580, !2581, !2585, !2586, !2587, !2588, !2589, !2590, !2591, !2592}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !934, file: !933, line: 82, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !940)
!940 = !{!941, !945, !950, !981, !982, !983, !984, !988, !994, !996, !1000}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !939, file: !26, line: 72, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !939, file: !26, line: 78, baseType: !946, size: 64, align: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!942, !949}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !939, file: !26, line: 85, baseType: !951, size: 64, align: 64, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !954)
!954 = !{!955, !956, !957, !959, !960, !977, !978, !979, !980}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !953, file: !4, line: 247, baseType: !942, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !953, file: !4, line: 253, baseType: !942, size: 64, align: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !953, file: !4, line: 259, baseType: !958, size: 32, align: 32, offset: 128)
!958 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !953, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !953, file: !4, line: 271, baseType: !961, size: 64, align: 64, offset: 192)
!961 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !953, file: !4, line: 265, size: 64, align: 64, elements: !962)
!962 = !{!963, !967, !969, !970}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !961, file: !4, line: 266, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !965, line: 197, baseType: !966)
!965 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!966 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !961, file: !4, line: 267, baseType: !968, size: 64, align: 64)
!968 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !961, file: !4, line: 268, baseType: !942, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !961, file: !4, line: 270, baseType: !971, size: 64, align: 32)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !972, line: 61, baseType: !973)
!972 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !972, line: 58, size: 64, align: 32, elements: !974)
!974 = !{!975, !976}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !973, file: !972, line: 59, baseType: !958, size: 32, align: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !973, file: !972, line: 60, baseType: !958, size: 32, align: 32, offset: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !953, file: !4, line: 272, baseType: !968, size: 64, align: 64, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !953, file: !4, line: 273, baseType: !968, size: 64, align: 64, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !953, file: !4, line: 275, baseType: !958, size: 32, align: 32, offset: 384)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !953, file: !4, line: 300, baseType: !942, size: 64, align: 64, offset: 448)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !939, file: !26, line: 93, baseType: !958, size: 32, align: 32, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !939, file: !26, line: 99, baseType: !958, size: 32, align: 32, offset: 224)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !939, file: !26, line: 108, baseType: !958, size: 32, align: 32, offset: 256)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !939, file: !26, line: 113, baseType: !985, size: 64, align: 64, offset: 320)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!949, !949, !949}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !939, file: !26, line: 123, baseType: !989, size: 64, align: 64, offset: 384)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!992, !992}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !939, file: !26, line: 130, baseType: !995, size: 32, align: 32, offset: 448)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !939, file: !26, line: 136, baseType: !997, size: 64, align: 64, offset: 512)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!995, !949}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !939, file: !26, line: 142, baseType: !1001, size: 64, align: 64, offset: 576)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!958, !1004, !949, !942, !958}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1007)
!1007 = !{!1008, !1020, !1021}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1006, file: !4, line: 360, baseType: !1009, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1012)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1013)
!1013 = !{!1014, !1015, !1016, !1017, !1018, !1019}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1012, file: !4, line: 307, baseType: !942, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1012, file: !4, line: 313, baseType: !968, size: 64, align: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1012, file: !4, line: 313, baseType: !968, size: 64, align: 64, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1012, file: !4, line: 318, baseType: !968, size: 64, align: 64, offset: 192)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1012, file: !4, line: 318, baseType: !968, size: 64, align: 64, offset: 256)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1012, file: !4, line: 323, baseType: !958, size: 32, align: 32, offset: 320)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1006, file: !4, line: 364, baseType: !958, size: 32, align: 32, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1006, file: !4, line: 368, baseType: !958, size: 32, align: 32, offset: 96)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !934, file: !933, line: 84, baseType: !958, size: 32, align: 32, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !934, file: !933, line: 84, baseType: !958, size: 32, align: 32, offset: 96)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !934, file: !933, line: 85, baseType: !958, size: 32, align: 32, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !934, file: !933, line: 86, baseType: !1026, size: 384, align: 32, offset: 160)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 384, align: 32, elements: !1027)
!1027 = !{!1028}
!1028 = !DISubrange(count: 12)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !934, file: !933, line: 87, baseType: !958, size: 32, align: 32, offset: 544)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !934, file: !933, line: 90, baseType: !1031, size: 1088, align: 64, offset: 576)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !917, line: 35, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !917, line: 31, size: 1088, align: 64, elements: !1033)
!1033 = !{!1034, !1040, !1044}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1032, file: !917, line: 32, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1038, line: 48, baseType: !1039)
!1038 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1039 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1032, file: !917, line: 33, baseType: !1041, size: 512, align: 8, offset: 64)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1037, size: 512, align: 8, elements: !1042)
!1042 = !{!1043}
!1043 = !DISubrange(count: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1032, file: !917, line: 34, baseType: !1041, size: 512, align: 8, offset: 576)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !934, file: !933, line: 91, baseType: !1031, size: 1088, align: 64, offset: 1664)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !934, file: !933, line: 92, baseType: !1031, size: 1088, align: 64, offset: 2752)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !934, file: !933, line: 93, baseType: !1031, size: 1088, align: 64, offset: 3840)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !934, file: !933, line: 98, baseType: !1049, size: 64, align: 64, offset: 4928)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1051)
!1051 = !{!1052, !1055, !1056, !1057, !1324, !1325, !1326, !1327, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1479, !1483, !1484, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1662, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1050, file: !57, line: 1561, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1050, file: !57, line: 1562, baseType: !958, size: 32, align: 32, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1050, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1050, file: !57, line: 1565, baseType: !1058, size: 64, align: 64, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1061)
!1061 = !{!1062, !1063, !1064, !1065, !1066, !1067, !1070, !1073, !1076, !1079, !1084, !1085, !1086, !1094, !1095, !1096, !1098, !1104, !1110, !1119, !1123, !1124, !1174, !1295, !1299, !1300, !1304, !1308, !1313, !1317, !1318, !1319}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1060, file: !57, line: 3475, baseType: !942, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1060, file: !57, line: 3480, baseType: !942, size: 64, align: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1060, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1060, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1060, file: !57, line: 3487, baseType: !958, size: 32, align: 32, offset: 192)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1060, file: !57, line: 3488, baseType: !1068, size: 64, align: 64, offset: 256)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1060, file: !57, line: 3489, baseType: !1071, size: 64, align: 64, offset: 320)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1060, file: !57, line: 3490, baseType: !1074, size: 64, align: 64, offset: 384)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1060, file: !57, line: 3491, baseType: !1077, size: 64, align: 64, offset: 448)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1060, file: !57, line: 3492, baseType: !1080, size: 64, align: 64, offset: 512)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1082)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1038, line: 55, baseType: !1083)
!1083 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1060, file: !57, line: 3493, baseType: !1037, size: 8, align: 8, offset: 576)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1060, file: !57, line: 3494, baseType: !1053, size: 64, align: 64, offset: 640)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1060, file: !57, line: 3495, baseType: !1087, size: 64, align: 64, offset: 704)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1089)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1091)
!1091 = !{!1092, !1093}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1090, file: !57, line: 3402, baseType: !958, size: 32, align: 32)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1090, file: !57, line: 3403, baseType: !942, size: 64, align: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1060, file: !57, line: 3507, baseType: !942, size: 64, align: 64, offset: 768)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1060, file: !57, line: 3516, baseType: !958, size: 32, align: 32, offset: 832)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1060, file: !57, line: 3517, baseType: !1097, size: 64, align: 64, offset: 896)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1060, file: !57, line: 3527, baseType: !1099, size: 64, align: 64, offset: 960)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!958, !1102}
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1050)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1060, file: !57, line: 3535, baseType: !1105, size: 64, align: 64, offset: 1024)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!958, !1102, !1108}
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1103)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1060, file: !57, line: 3541, baseType: !1111, size: 64, align: 64, offset: 1088)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1113)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1115, line: 223, size: 128, align: 64, elements: !1116)
!1115 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1116 = !{!1117, !1118}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1114, file: !1115, line: 224, baseType: !1035, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1114, file: !1115, line: 225, baseType: !1035, size: 64, align: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1060, file: !57, line: 3549, baseType: !1120, size: 64, align: 64, offset: 1152)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{null, !1097}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1060, file: !57, line: 3551, baseType: !1099, size: 64, align: 64, offset: 1216)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1060, file: !57, line: 3552, baseType: !1125, size: 64, align: 64, offset: 1280)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!958, !1102, !1128, !958, !1129}
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1131)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1132)
!1132 = !{!1133, !1136, !1139, !1140, !1141, !1173}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1131, file: !57, line: 3921, baseType: !1134, size: 16, align: 16)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1038, line: 49, baseType: !1135)
!1135 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1131, file: !57, line: 3922, baseType: !1137, size: 32, align: 32, offset: 32)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1038, line: 51, baseType: !1138)
!1138 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1131, file: !57, line: 3923, baseType: !1137, size: 32, align: 32, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1131, file: !57, line: 3924, baseType: !1138, size: 32, align: 32, offset: 96)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1131, file: !57, line: 3925, baseType: !1142, size: 64, align: 64, offset: 128)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1150, !1151, !1152, !1162, !1166, !1168, !1169, !1171, !1172}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1145, file: !57, line: 3886, baseType: !958, size: 32, align: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1145, file: !57, line: 3887, baseType: !958, size: 32, align: 32, offset: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1145, file: !57, line: 3888, baseType: !958, size: 32, align: 32, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1145, file: !57, line: 3889, baseType: !958, size: 32, align: 32, offset: 96)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1145, file: !57, line: 3890, baseType: !958, size: 32, align: 32, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1145, file: !57, line: 3897, baseType: !1153, size: 768, align: 64, offset: 192)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1155)
!1155 = !{!1156, !1160}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1154, file: !57, line: 3855, baseType: !1157, size: 512, align: 64)
!1157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1128, size: 512, align: 64, elements: !1158)
!1158 = !{!1159}
!1159 = !DISubrange(count: 8)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1154, file: !57, line: 3857, baseType: !1161, size: 256, align: 32, offset: 512)
!1161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 256, align: 32, elements: !1158)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1145, file: !57, line: 3903, baseType: !1163, size: 256, align: 64, offset: 960)
!1163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1128, size: 256, align: 64, elements: !1164)
!1164 = !{!1165}
!1165 = !DISubrange(count: 4)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1145, file: !57, line: 3904, baseType: !1167, size: 128, align: 32, offset: 1216)
!1167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 128, align: 32, elements: !1164)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1145, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1145, file: !57, line: 3908, baseType: !1170, size: 64, align: 64, offset: 1408)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1145, file: !57, line: 3915, baseType: !1170, size: 64, align: 64, offset: 1472)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1145, file: !57, line: 3917, baseType: !958, size: 32, align: 32, offset: 1536)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1131, file: !57, line: 3926, baseType: !964, size: 64, align: 64, offset: 192)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1060, file: !57, line: 3564, baseType: !1175, size: 64, align: 64, offset: 1344)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!958, !1102, !1178, !1212, !1294}
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1180)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1181)
!1181 = !{!1182, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1208, !1209, !1210, !1211}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1180, file: !57, line: 1451, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1185, line: 94, baseType: !1186)
!1185 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1185, line: 81, size: 192, align: 64, elements: !1187)
!1187 = !{!1188, !1192, !1193}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1186, file: !1185, line: 82, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1185, line: 73, baseType: !1191)
!1191 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1185, line: 73, flags: DIFlagFwdDecl)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1186, file: !1185, line: 89, baseType: !1128, size: 64, align: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1186, file: !1185, line: 93, baseType: !958, size: 32, align: 32, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1180, file: !57, line: 1461, baseType: !964, size: 64, align: 64, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1180, file: !57, line: 1467, baseType: !964, size: 64, align: 64, offset: 128)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1180, file: !57, line: 1468, baseType: !1128, size: 64, align: 64, offset: 192)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1180, file: !57, line: 1469, baseType: !958, size: 32, align: 32, offset: 256)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1180, file: !57, line: 1470, baseType: !958, size: 32, align: 32, offset: 288)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1180, file: !57, line: 1474, baseType: !958, size: 32, align: 32, offset: 320)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1180, file: !57, line: 1479, baseType: !1201, size: 64, align: 64, offset: 384)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1203)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1204)
!1204 = !{!1205, !1206, !1207}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1203, file: !57, line: 1412, baseType: !1128, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1203, file: !57, line: 1413, baseType: !958, size: 32, align: 32, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1203, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1180, file: !57, line: 1480, baseType: !958, size: 32, align: 32, offset: 448)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1180, file: !57, line: 1486, baseType: !964, size: 64, align: 64, offset: 512)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1180, file: !57, line: 1488, baseType: !964, size: 64, align: 64, offset: 576)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1180, file: !57, line: 1497, baseType: !964, size: 64, align: 64, offset: 640)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1214)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1216)
!1216 = !{!1217, !1218, !1219, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1246, !1248, !1249, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1282, !1283, !1284, !1285, !1286, !1287, !1290, !1291, !1292, !1293}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1215, file: !780, line: 282, baseType: !1157, size: 512, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1215, file: !780, line: 299, baseType: !1161, size: 256, align: 32, offset: 512)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1215, file: !780, line: 315, baseType: !1220, size: 64, align: 64, offset: 768)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1215, file: !780, line: 326, baseType: !958, size: 32, align: 32, offset: 832)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1215, file: !780, line: 326, baseType: !958, size: 32, align: 32, offset: 864)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1215, file: !780, line: 334, baseType: !958, size: 32, align: 32, offset: 896)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1215, file: !780, line: 341, baseType: !958, size: 32, align: 32, offset: 928)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1215, file: !780, line: 346, baseType: !958, size: 32, align: 32, offset: 960)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1215, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1215, file: !780, line: 356, baseType: !971, size: 64, align: 32, offset: 1024)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1215, file: !780, line: 361, baseType: !964, size: 64, align: 64, offset: 1088)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1215, file: !780, line: 369, baseType: !964, size: 64, align: 64, offset: 1152)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1215, file: !780, line: 377, baseType: !964, size: 64, align: 64, offset: 1216)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1215, file: !780, line: 382, baseType: !958, size: 32, align: 32, offset: 1280)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1215, file: !780, line: 386, baseType: !958, size: 32, align: 32, offset: 1312)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1215, file: !780, line: 391, baseType: !958, size: 32, align: 32, offset: 1344)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1215, file: !780, line: 396, baseType: !949, size: 64, align: 64, offset: 1408)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1215, file: !780, line: 403, baseType: !1236, size: 512, align: 64, offset: 1472)
!1236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1082, size: 512, align: 64, elements: !1158)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1215, file: !780, line: 410, baseType: !958, size: 32, align: 32, offset: 1984)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1215, file: !780, line: 415, baseType: !958, size: 32, align: 32, offset: 2016)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1215, file: !780, line: 420, baseType: !958, size: 32, align: 32, offset: 2048)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1215, file: !780, line: 425, baseType: !958, size: 32, align: 32, offset: 2080)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1215, file: !780, line: 435, baseType: !964, size: 64, align: 64, offset: 2112)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1215, file: !780, line: 440, baseType: !958, size: 32, align: 32, offset: 2176)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1215, file: !780, line: 445, baseType: !1082, size: 64, align: 64, offset: 2240)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1215, file: !780, line: 459, baseType: !1245, size: 512, align: 64, offset: 2304)
!1245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1183, size: 512, align: 64, elements: !1158)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1215, file: !780, line: 473, baseType: !1247, size: 64, align: 64, offset: 2816)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1215, file: !780, line: 477, baseType: !958, size: 32, align: 32, offset: 2880)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1215, file: !780, line: 479, baseType: !1250, size: 64, align: 64, offset: 2944)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1253)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1254)
!1254 = !{!1255, !1256, !1257, !1258, !1263}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1253, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1253, file: !780, line: 203, baseType: !1128, size: 64, align: 64, offset: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1253, file: !780, line: 204, baseType: !958, size: 32, align: 32, offset: 128)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1253, file: !780, line: 205, baseType: !1259, size: 64, align: 64, offset: 192)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1261, line: 86, baseType: !1262)
!1261 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1262 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1261, line: 86, flags: DIFlagFwdDecl)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1253, file: !780, line: 206, baseType: !1183, size: 64, align: 64, offset: 256)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1215, file: !780, line: 480, baseType: !958, size: 32, align: 32, offset: 3008)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1215, file: !780, line: 505, baseType: !958, size: 32, align: 32, offset: 3040)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1215, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1215, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1215, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1215, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1215, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1215, file: !780, line: 532, baseType: !964, size: 64, align: 64, offset: 3264)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1215, file: !780, line: 539, baseType: !964, size: 64, align: 64, offset: 3328)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1215, file: !780, line: 547, baseType: !964, size: 64, align: 64, offset: 3392)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1215, file: !780, line: 554, baseType: !1259, size: 64, align: 64, offset: 3456)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1215, file: !780, line: 563, baseType: !958, size: 32, align: 32, offset: 3520)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1215, file: !780, line: 572, baseType: !958, size: 32, align: 32, offset: 3552)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1215, file: !780, line: 581, baseType: !958, size: 32, align: 32, offset: 3584)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1215, file: !780, line: 588, baseType: !1279, size: 64, align: 64, offset: 3648)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !965, line: 194, baseType: !1281)
!1281 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1215, file: !780, line: 593, baseType: !958, size: 32, align: 32, offset: 3712)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1215, file: !780, line: 596, baseType: !958, size: 32, align: 32, offset: 3744)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1215, file: !780, line: 599, baseType: !1183, size: 64, align: 64, offset: 3776)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1215, file: !780, line: 605, baseType: !1183, size: 64, align: 64, offset: 3840)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1215, file: !780, line: 616, baseType: !1183, size: 64, align: 64, offset: 3904)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1215, file: !780, line: 626, baseType: !1288, size: 64, align: 64, offset: 3968)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1289, line: 216, baseType: !1083)
!1289 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1215, file: !780, line: 627, baseType: !1288, size: 64, align: 64, offset: 4032)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1215, file: !780, line: 628, baseType: !1288, size: 64, align: 64, offset: 4096)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1215, file: !780, line: 629, baseType: !1288, size: 64, align: 64, offset: 4160)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1215, file: !780, line: 645, baseType: !1183, size: 64, align: 64, offset: 4224)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1060, file: !57, line: 3566, baseType: !1296, size: 64, align: 64, offset: 1408)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!958, !1102, !949, !1294, !1178}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1060, file: !57, line: 3567, baseType: !1099, size: 64, align: 64, offset: 1472)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1060, file: !57, line: 3576, baseType: !1301, size: 64, align: 64, offset: 1536)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!958, !1102, !1212}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1060, file: !57, line: 3577, baseType: !1305, size: 64, align: 64, offset: 1600)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DISubroutineType(types: !1307)
!1307 = !{!958, !1102, !1178}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1060, file: !57, line: 3584, baseType: !1309, size: 64, align: 64, offset: 1664)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{!958, !1102, !1312}
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1060, file: !57, line: 3589, baseType: !1314, size: 64, align: 64, offset: 1728)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DISubroutineType(types: !1316)
!1316 = !{null, !1102}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1060, file: !57, line: 3594, baseType: !958, size: 32, align: 32, offset: 1792)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1060, file: !57, line: 3600, baseType: !942, size: 64, align: 64, offset: 1856)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1060, file: !57, line: 3609, baseType: !1320, size: 64, align: 64, offset: 1920)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1323)
!1323 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1050, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1050, file: !57, line: 1581, baseType: !1138, size: 32, align: 32, offset: 224)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1050, file: !57, line: 1583, baseType: !949, size: 64, align: 64, offset: 256)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1050, file: !57, line: 1591, baseType: !1328, size: 64, align: 64, offset: 320)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1115, line: 129, size: 1664, align: 64, elements: !1330)
!1330 = !{!1331, !1332, !1333, !1334, !1335, !1353, !1354, !1360, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1329, file: !1115, line: 136, baseType: !958, size: 32, align: 32)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1329, file: !1115, line: 151, baseType: !958, size: 32, align: 32, offset: 32)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1329, file: !1115, line: 157, baseType: !958, size: 32, align: 32, offset: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1329, file: !1115, line: 159, baseType: !1312, size: 64, align: 64, offset: 128)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1329, file: !1115, line: 161, baseType: !1336, size: 64, align: 64, offset: 192)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1115, line: 117, baseType: !1338)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1115, line: 100, size: 832, align: 64, elements: !1339)
!1339 = !{!1340, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1338, file: !1115, line: 105, baseType: !1341, size: 256, align: 64)
!1341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1342, size: 256, align: 64, elements: !1164)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1185, line: 238, baseType: !1344)
!1344 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1185, line: 238, flags: DIFlagFwdDecl)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1338, file: !1115, line: 110, baseType: !958, size: 32, align: 32, offset: 256)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1338, file: !1115, line: 111, baseType: !958, size: 32, align: 32, offset: 288)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1338, file: !1115, line: 111, baseType: !958, size: 32, align: 32, offset: 320)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1338, file: !1115, line: 112, baseType: !1161, size: 256, align: 32, offset: 352)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1338, file: !1115, line: 113, baseType: !1167, size: 128, align: 32, offset: 608)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1338, file: !1115, line: 114, baseType: !958, size: 32, align: 32, offset: 736)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1338, file: !1115, line: 115, baseType: !958, size: 32, align: 32, offset: 768)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1338, file: !1115, line: 116, baseType: !958, size: 32, align: 32, offset: 800)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1329, file: !1115, line: 163, baseType: !949, size: 64, align: 64, offset: 256)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1329, file: !1115, line: 165, baseType: !1355, size: 128, align: 64, offset: 320)
!1355 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1115, line: 122, baseType: !1356)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1115, line: 119, size: 128, align: 64, elements: !1357)
!1357 = !{!1358, !1359}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1356, file: !1115, line: 120, baseType: !1178, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1356, file: !1115, line: 121, baseType: !1312, size: 64, align: 64, offset: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1329, file: !1115, line: 166, baseType: !1361, size: 128, align: 64, offset: 448)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1115, line: 127, baseType: !1362)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1115, line: 124, size: 128, align: 64, elements: !1363)
!1363 = !{!1364, !1437}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1362, file: !1115, line: 125, baseType: !1365, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1368)
!1368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1369)
!1369 = !{!1370, !1371, !1395, !1399, !1400, !1434, !1435, !1436}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1368, file: !57, line: 5751, baseType: !1053, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1368, file: !57, line: 5756, baseType: !1372, size: 64, align: 64, offset: 64)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1374)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1375)
!1375 = !{!1376, !1377, !1380, !1381, !1382, !1386, !1390, !1394}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1374, file: !57, line: 5797, baseType: !942, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1374, file: !57, line: 5804, baseType: !1378, size: 64, align: 64, offset: 64)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1374, file: !57, line: 5815, baseType: !1053, size: 64, align: 64, offset: 128)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1374, file: !57, line: 5825, baseType: !958, size: 32, align: 32, offset: 192)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1374, file: !57, line: 5826, baseType: !1383, size: 64, align: 64, offset: 256)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DISubroutineType(types: !1385)
!1385 = !{!958, !1366}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1374, file: !57, line: 5827, baseType: !1387, size: 64, align: 64, offset: 320)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DISubroutineType(types: !1389)
!1389 = !{!958, !1366, !1178}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1374, file: !57, line: 5828, baseType: !1391, size: 64, align: 64, offset: 384)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DISubroutineType(types: !1393)
!1393 = !{null, !1366}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1374, file: !57, line: 5829, baseType: !1391, size: 64, align: 64, offset: 448)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1368, file: !57, line: 5762, baseType: !1396, size: 64, align: 64, offset: 128)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1398)
!1398 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1368, file: !57, line: 5768, baseType: !949, size: 64, align: 64, offset: 192)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1368, file: !57, line: 5775, baseType: !1401, size: 64, align: 64, offset: 256)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1403)
!1403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1404)
!1404 = !{!1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1403, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1403, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1403, file: !57, line: 3948, baseType: !1137, size: 32, align: 32, offset: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1403, file: !57, line: 3958, baseType: !1128, size: 64, align: 64, offset: 128)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1403, file: !57, line: 3962, baseType: !958, size: 32, align: 32, offset: 192)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1403, file: !57, line: 3968, baseType: !958, size: 32, align: 32, offset: 224)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1403, file: !57, line: 3973, baseType: !964, size: 64, align: 64, offset: 256)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1403, file: !57, line: 3986, baseType: !958, size: 32, align: 32, offset: 320)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1403, file: !57, line: 3999, baseType: !958, size: 32, align: 32, offset: 352)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1403, file: !57, line: 4004, baseType: !958, size: 32, align: 32, offset: 384)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1403, file: !57, line: 4005, baseType: !958, size: 32, align: 32, offset: 416)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1403, file: !57, line: 4010, baseType: !958, size: 32, align: 32, offset: 448)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1403, file: !57, line: 4011, baseType: !958, size: 32, align: 32, offset: 480)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1403, file: !57, line: 4020, baseType: !971, size: 64, align: 32, offset: 512)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1403, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1403, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1403, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1403, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1403, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1403, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1403, file: !57, line: 4039, baseType: !958, size: 32, align: 32, offset: 768)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1403, file: !57, line: 4046, baseType: !1082, size: 64, align: 64, offset: 832)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1403, file: !57, line: 4050, baseType: !958, size: 32, align: 32, offset: 896)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1403, file: !57, line: 4054, baseType: !958, size: 32, align: 32, offset: 928)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1403, file: !57, line: 4061, baseType: !958, size: 32, align: 32, offset: 960)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1403, file: !57, line: 4065, baseType: !958, size: 32, align: 32, offset: 992)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1403, file: !57, line: 4073, baseType: !958, size: 32, align: 32, offset: 1024)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1403, file: !57, line: 4080, baseType: !958, size: 32, align: 32, offset: 1056)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1403, file: !57, line: 4084, baseType: !958, size: 32, align: 32, offset: 1088)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1368, file: !57, line: 5781, baseType: !1401, size: 64, align: 64, offset: 320)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1368, file: !57, line: 5787, baseType: !971, size: 64, align: 32, offset: 384)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1368, file: !57, line: 5793, baseType: !971, size: 64, align: 32, offset: 448)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1362, file: !1115, line: 126, baseType: !958, size: 32, align: 32, offset: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1329, file: !1115, line: 172, baseType: !1178, size: 64, align: 64, offset: 576)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1329, file: !1115, line: 177, baseType: !1128, size: 64, align: 64, offset: 640)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1329, file: !1115, line: 178, baseType: !1138, size: 32, align: 32, offset: 704)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1329, file: !1115, line: 180, baseType: !949, size: 64, align: 64, offset: 768)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1329, file: !1115, line: 185, baseType: !958, size: 32, align: 32, offset: 832)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1329, file: !1115, line: 190, baseType: !949, size: 64, align: 64, offset: 896)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1329, file: !1115, line: 195, baseType: !958, size: 32, align: 32, offset: 960)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1329, file: !1115, line: 200, baseType: !1178, size: 64, align: 64, offset: 1024)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1329, file: !1115, line: 201, baseType: !958, size: 32, align: 32, offset: 1088)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1329, file: !1115, line: 202, baseType: !1312, size: 64, align: 64, offset: 1152)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1329, file: !1115, line: 203, baseType: !958, size: 32, align: 32, offset: 1216)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1329, file: !1115, line: 205, baseType: !958, size: 32, align: 32, offset: 1248)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1329, file: !1115, line: 206, baseType: !958, size: 32, align: 32, offset: 1280)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1329, file: !1115, line: 209, baseType: !1288, size: 64, align: 64, offset: 1344)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1329, file: !1115, line: 212, baseType: !1288, size: 64, align: 64, offset: 1408)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1329, file: !1115, line: 213, baseType: !1312, size: 64, align: 64, offset: 1472)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1329, file: !1115, line: 215, baseType: !958, size: 32, align: 32, offset: 1536)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1329, file: !1115, line: 217, baseType: !958, size: 32, align: 32, offset: 1568)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1329, file: !1115, line: 220, baseType: !958, size: 32, align: 32, offset: 1600)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1050, file: !57, line: 1598, baseType: !949, size: 64, align: 64, offset: 384)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1050, file: !57, line: 1606, baseType: !964, size: 64, align: 64, offset: 448)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1050, file: !57, line: 1614, baseType: !958, size: 32, align: 32, offset: 512)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1050, file: !57, line: 1622, baseType: !958, size: 32, align: 32, offset: 544)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1050, file: !57, line: 1628, baseType: !958, size: 32, align: 32, offset: 576)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1050, file: !57, line: 1636, baseType: !958, size: 32, align: 32, offset: 608)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1050, file: !57, line: 1643, baseType: !958, size: 32, align: 32, offset: 640)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1050, file: !57, line: 1657, baseType: !1128, size: 64, align: 64, offset: 704)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1050, file: !57, line: 1658, baseType: !958, size: 32, align: 32, offset: 768)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1050, file: !57, line: 1679, baseType: !971, size: 64, align: 32, offset: 800)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1050, file: !57, line: 1688, baseType: !958, size: 32, align: 32, offset: 864)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1050, file: !57, line: 1712, baseType: !958, size: 32, align: 32, offset: 896)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1050, file: !57, line: 1729, baseType: !958, size: 32, align: 32, offset: 928)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1050, file: !57, line: 1729, baseType: !958, size: 32, align: 32, offset: 960)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1050, file: !57, line: 1744, baseType: !958, size: 32, align: 32, offset: 992)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1050, file: !57, line: 1744, baseType: !958, size: 32, align: 32, offset: 1024)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1050, file: !57, line: 1751, baseType: !958, size: 32, align: 32, offset: 1056)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1050, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1050, file: !57, line: 1791, baseType: !1476, size: 64, align: 64, offset: 1152)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DISubroutineType(types: !1478)
!1478 = !{null, !1049, !1212, !1294, !958, !958, !958}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1050, file: !57, line: 1808, baseType: !1480, size: 64, align: 64, offset: 1216)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DISubroutineType(types: !1482)
!1482 = !{!516, !1049, !1071}
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1050, file: !57, line: 1816, baseType: !958, size: 32, align: 32, offset: 1280)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1050, file: !57, line: 1825, baseType: !1485, size: 32, align: 32, offset: 1312)
!1485 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1050, file: !57, line: 1830, baseType: !958, size: 32, align: 32, offset: 1344)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1050, file: !57, line: 1838, baseType: !1485, size: 32, align: 32, offset: 1376)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1050, file: !57, line: 1846, baseType: !958, size: 32, align: 32, offset: 1408)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1050, file: !57, line: 1851, baseType: !958, size: 32, align: 32, offset: 1440)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1050, file: !57, line: 1861, baseType: !1485, size: 32, align: 32, offset: 1472)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1050, file: !57, line: 1868, baseType: !1485, size: 32, align: 32, offset: 1504)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1050, file: !57, line: 1875, baseType: !1485, size: 32, align: 32, offset: 1536)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1050, file: !57, line: 1882, baseType: !1485, size: 32, align: 32, offset: 1568)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1050, file: !57, line: 1889, baseType: !1485, size: 32, align: 32, offset: 1600)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1050, file: !57, line: 1896, baseType: !1485, size: 32, align: 32, offset: 1632)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1050, file: !57, line: 1903, baseType: !1485, size: 32, align: 32, offset: 1664)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1050, file: !57, line: 1910, baseType: !958, size: 32, align: 32, offset: 1696)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1050, file: !57, line: 1915, baseType: !958, size: 32, align: 32, offset: 1728)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1050, file: !57, line: 1926, baseType: !1294, size: 64, align: 64, offset: 1792)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1050, file: !57, line: 1935, baseType: !971, size: 64, align: 32, offset: 1856)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1050, file: !57, line: 1942, baseType: !958, size: 32, align: 32, offset: 1920)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1050, file: !57, line: 1948, baseType: !958, size: 32, align: 32, offset: 1952)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1050, file: !57, line: 1954, baseType: !958, size: 32, align: 32, offset: 1984)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1050, file: !57, line: 1960, baseType: !958, size: 32, align: 32, offset: 2016)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1050, file: !57, line: 1984, baseType: !958, size: 32, align: 32, offset: 2048)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1050, file: !57, line: 1991, baseType: !958, size: 32, align: 32, offset: 2080)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1050, file: !57, line: 1996, baseType: !958, size: 32, align: 32, offset: 2112)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1050, file: !57, line: 2004, baseType: !958, size: 32, align: 32, offset: 2144)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1050, file: !57, line: 2011, baseType: !958, size: 32, align: 32, offset: 2176)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1050, file: !57, line: 2018, baseType: !958, size: 32, align: 32, offset: 2208)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1050, file: !57, line: 2027, baseType: !958, size: 32, align: 32, offset: 2240)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1050, file: !57, line: 2034, baseType: !958, size: 32, align: 32, offset: 2272)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1050, file: !57, line: 2044, baseType: !958, size: 32, align: 32, offset: 2304)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1050, file: !57, line: 2054, baseType: !1515, size: 64, align: 64, offset: 2368)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1050, file: !57, line: 2061, baseType: !1515, size: 64, align: 64, offset: 2432)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1050, file: !57, line: 2066, baseType: !958, size: 32, align: 32, offset: 2496)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1050, file: !57, line: 2070, baseType: !958, size: 32, align: 32, offset: 2528)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1050, file: !57, line: 2078, baseType: !958, size: 32, align: 32, offset: 2560)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1050, file: !57, line: 2085, baseType: !958, size: 32, align: 32, offset: 2592)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1050, file: !57, line: 2092, baseType: !958, size: 32, align: 32, offset: 2624)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1050, file: !57, line: 2099, baseType: !958, size: 32, align: 32, offset: 2656)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1050, file: !57, line: 2106, baseType: !958, size: 32, align: 32, offset: 2688)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1050, file: !57, line: 2113, baseType: !958, size: 32, align: 32, offset: 2720)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1050, file: !57, line: 2120, baseType: !958, size: 32, align: 32, offset: 2752)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1050, file: !57, line: 2125, baseType: !958, size: 32, align: 32, offset: 2784)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1050, file: !57, line: 2133, baseType: !958, size: 32, align: 32, offset: 2816)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1050, file: !57, line: 2140, baseType: !958, size: 32, align: 32, offset: 2848)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1050, file: !57, line: 2145, baseType: !958, size: 32, align: 32, offset: 2880)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1050, file: !57, line: 2153, baseType: !958, size: 32, align: 32, offset: 2912)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1050, file: !57, line: 2158, baseType: !958, size: 32, align: 32, offset: 2944)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1050, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1050, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1050, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1050, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1050, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1050, file: !57, line: 2203, baseType: !958, size: 32, align: 32, offset: 3136)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1050, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1050, file: !57, line: 2212, baseType: !958, size: 32, align: 32, offset: 3200)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1050, file: !57, line: 2213, baseType: !958, size: 32, align: 32, offset: 3232)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1050, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1050, file: !57, line: 2232, baseType: !958, size: 32, align: 32, offset: 3296)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1050, file: !57, line: 2243, baseType: !958, size: 32, align: 32, offset: 3328)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1050, file: !57, line: 2249, baseType: !958, size: 32, align: 32, offset: 3360)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1050, file: !57, line: 2256, baseType: !958, size: 32, align: 32, offset: 3392)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1050, file: !57, line: 2263, baseType: !1082, size: 64, align: 64, offset: 3456)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1050, file: !57, line: 2270, baseType: !1082, size: 64, align: 64, offset: 3520)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1050, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1050, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1050, file: !57, line: 2367, baseType: !1551, size: 64, align: 64, offset: 3648)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1552, size: 64, align: 64)
!1552 = !DISubroutineType(types: !1553)
!1553 = !{!958, !1049, !1312, !958}
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1050, file: !57, line: 2383, baseType: !958, size: 32, align: 32, offset: 3712)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1050, file: !57, line: 2386, baseType: !1485, size: 32, align: 32, offset: 3744)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1050, file: !57, line: 2387, baseType: !1485, size: 32, align: 32, offset: 3776)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1050, file: !57, line: 2394, baseType: !958, size: 32, align: 32, offset: 3808)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1050, file: !57, line: 2401, baseType: !958, size: 32, align: 32, offset: 3840)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1050, file: !57, line: 2408, baseType: !958, size: 32, align: 32, offset: 3872)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1050, file: !57, line: 2415, baseType: !958, size: 32, align: 32, offset: 3904)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1050, file: !57, line: 2422, baseType: !958, size: 32, align: 32, offset: 3936)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1050, file: !57, line: 2423, baseType: !1563, size: 64, align: 64, offset: 3968)
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1564 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1565)
!1565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1566)
!1566 = !{!1567, !1568, !1569, !1570}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1565, file: !57, line: 827, baseType: !958, size: 32, align: 32)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1565, file: !57, line: 828, baseType: !958, size: 32, align: 32, offset: 32)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1565, file: !57, line: 829, baseType: !958, size: 32, align: 32, offset: 64)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1565, file: !57, line: 830, baseType: !1485, size: 32, align: 32, offset: 96)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1050, file: !57, line: 2430, baseType: !964, size: 64, align: 64, offset: 4032)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1050, file: !57, line: 2437, baseType: !964, size: 64, align: 64, offset: 4096)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1050, file: !57, line: 2444, baseType: !1485, size: 32, align: 32, offset: 4160)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1050, file: !57, line: 2451, baseType: !1485, size: 32, align: 32, offset: 4192)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1050, file: !57, line: 2458, baseType: !958, size: 32, align: 32, offset: 4224)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1050, file: !57, line: 2469, baseType: !958, size: 32, align: 32, offset: 4256)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1050, file: !57, line: 2475, baseType: !958, size: 32, align: 32, offset: 4288)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1050, file: !57, line: 2481, baseType: !958, size: 32, align: 32, offset: 4320)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1050, file: !57, line: 2485, baseType: !958, size: 32, align: 32, offset: 4352)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1050, file: !57, line: 2489, baseType: !958, size: 32, align: 32, offset: 4384)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1050, file: !57, line: 2493, baseType: !958, size: 32, align: 32, offset: 4416)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1050, file: !57, line: 2501, baseType: !958, size: 32, align: 32, offset: 4448)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1050, file: !57, line: 2506, baseType: !958, size: 32, align: 32, offset: 4480)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1050, file: !57, line: 2510, baseType: !958, size: 32, align: 32, offset: 4512)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1050, file: !57, line: 2514, baseType: !964, size: 64, align: 64, offset: 4544)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1050, file: !57, line: 2528, baseType: !1587, size: 64, align: 64, offset: 4608)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64, align: 64)
!1588 = !DISubroutineType(types: !1589)
!1589 = !{null, !1049, !949, !958, !958}
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1050, file: !57, line: 2534, baseType: !958, size: 32, align: 32, offset: 4672)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1050, file: !57, line: 2545, baseType: !958, size: 32, align: 32, offset: 4704)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1050, file: !57, line: 2547, baseType: !958, size: 32, align: 32, offset: 4736)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1050, file: !57, line: 2549, baseType: !958, size: 32, align: 32, offset: 4768)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1050, file: !57, line: 2551, baseType: !958, size: 32, align: 32, offset: 4800)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1050, file: !57, line: 2553, baseType: !958, size: 32, align: 32, offset: 4832)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1050, file: !57, line: 2555, baseType: !958, size: 32, align: 32, offset: 4864)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1050, file: !57, line: 2557, baseType: !958, size: 32, align: 32, offset: 4896)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1050, file: !57, line: 2559, baseType: !958, size: 32, align: 32, offset: 4928)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1050, file: !57, line: 2563, baseType: !958, size: 32, align: 32, offset: 4960)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1050, file: !57, line: 2571, baseType: !1170, size: 64, align: 64, offset: 4992)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1050, file: !57, line: 2579, baseType: !1170, size: 64, align: 64, offset: 5056)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1050, file: !57, line: 2586, baseType: !958, size: 32, align: 32, offset: 5120)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1050, file: !57, line: 2615, baseType: !958, size: 32, align: 32, offset: 5152)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1050, file: !57, line: 2627, baseType: !958, size: 32, align: 32, offset: 5184)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1050, file: !57, line: 2637, baseType: !958, size: 32, align: 32, offset: 5216)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1050, file: !57, line: 2681, baseType: !958, size: 32, align: 32, offset: 5248)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1050, file: !57, line: 2709, baseType: !964, size: 64, align: 64, offset: 5312)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1050, file: !57, line: 2716, baseType: !1609, size: 64, align: 64, offset: 5376)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1611)
!1611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1612)
!1612 = !{!1613, !1614, !1615, !1616, !1617, !1618, !1619, !1623, !1627, !1628, !1629, !1630, !1635, !1636, !1637, !1638, !1639}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1611, file: !57, line: 3642, baseType: !942, size: 64, align: 64)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1611, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1611, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1611, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1611, file: !57, line: 3669, baseType: !958, size: 32, align: 32, offset: 160)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1611, file: !57, line: 3682, baseType: !1309, size: 64, align: 64, offset: 192)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1611, file: !57, line: 3698, baseType: !1620, size: 64, align: 64, offset: 256)
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64, align: 64)
!1621 = !DISubroutineType(types: !1622)
!1622 = !{!958, !1102, !1035, !1137}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1611, file: !57, line: 3712, baseType: !1624, size: 64, align: 64, offset: 320)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DISubroutineType(types: !1626)
!1626 = !{!958, !1102, !958, !1035, !1137}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1611, file: !57, line: 3726, baseType: !1620, size: 64, align: 64, offset: 384)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1611, file: !57, line: 3737, baseType: !1099, size: 64, align: 64, offset: 448)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1611, file: !57, line: 3746, baseType: !958, size: 32, align: 32, offset: 512)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1611, file: !57, line: 3757, baseType: !1631, size: 64, align: 64, offset: 576)
!1631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1632, size: 64, align: 64)
!1632 = !DISubroutineType(types: !1633)
!1633 = !{null, !1634}
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1611, file: !57, line: 3766, baseType: !1099, size: 64, align: 64, offset: 640)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1611, file: !57, line: 3774, baseType: !1099, size: 64, align: 64, offset: 704)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1611, file: !57, line: 3780, baseType: !958, size: 32, align: 32, offset: 768)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1611, file: !57, line: 3785, baseType: !958, size: 32, align: 32, offset: 800)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1611, file: !57, line: 3795, baseType: !1640, size: 64, align: 64, offset: 832)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DISubroutineType(types: !1642)
!1642 = !{!958, !1102, !1183}
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1050, file: !57, line: 2728, baseType: !949, size: 64, align: 64, offset: 5440)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1050, file: !57, line: 2735, baseType: !1236, size: 512, align: 64, offset: 5504)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1050, file: !57, line: 2742, baseType: !958, size: 32, align: 32, offset: 6016)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1050, file: !57, line: 2755, baseType: !958, size: 32, align: 32, offset: 6048)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1050, file: !57, line: 2776, baseType: !958, size: 32, align: 32, offset: 6080)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1050, file: !57, line: 2783, baseType: !958, size: 32, align: 32, offset: 6112)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1050, file: !57, line: 2791, baseType: !958, size: 32, align: 32, offset: 6144)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1050, file: !57, line: 2802, baseType: !1312, size: 64, align: 64, offset: 6208)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1050, file: !57, line: 2811, baseType: !958, size: 32, align: 32, offset: 6272)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1050, file: !57, line: 2821, baseType: !958, size: 32, align: 32, offset: 6304)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1050, file: !57, line: 2830, baseType: !958, size: 32, align: 32, offset: 6336)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1050, file: !57, line: 2840, baseType: !958, size: 32, align: 32, offset: 6368)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1050, file: !57, line: 2851, baseType: !1656, size: 64, align: 64, offset: 6400)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DISubroutineType(types: !1658)
!1658 = !{!958, !1049, !1659, !949, !1294, !958, !958}
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DISubroutineType(types: !1661)
!1661 = !{!958, !1049, !949}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1050, file: !57, line: 2871, baseType: !1663, size: 64, align: 64, offset: 6464)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DISubroutineType(types: !1665)
!1665 = !{!958, !1049, !1666, !949, !1294, !958}
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = !DISubroutineType(types: !1668)
!1668 = !{!958, !1049, !949, !958, !958}
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1050, file: !57, line: 2878, baseType: !958, size: 32, align: 32, offset: 6528)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1050, file: !57, line: 2885, baseType: !958, size: 32, align: 32, offset: 6560)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1050, file: !57, line: 3005, baseType: !958, size: 32, align: 32, offset: 6592)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1050, file: !57, line: 3013, baseType: !900, size: 32, align: 32, offset: 6624)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1050, file: !57, line: 3020, baseType: !900, size: 32, align: 32, offset: 6656)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1050, file: !57, line: 3027, baseType: !900, size: 32, align: 32, offset: 6688)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1050, file: !57, line: 3037, baseType: !1128, size: 64, align: 64, offset: 6720)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1050, file: !57, line: 3038, baseType: !958, size: 32, align: 32, offset: 6784)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1050, file: !57, line: 3050, baseType: !1082, size: 64, align: 64, offset: 6848)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1050, file: !57, line: 3065, baseType: !958, size: 32, align: 32, offset: 6912)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1050, file: !57, line: 3083, baseType: !958, size: 32, align: 32, offset: 6944)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1050, file: !57, line: 3092, baseType: !971, size: 64, align: 32, offset: 6976)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1050, file: !57, line: 3099, baseType: !516, size: 32, align: 32, offset: 7040)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1050, file: !57, line: 3106, baseType: !971, size: 64, align: 32, offset: 7072)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1050, file: !57, line: 3113, baseType: !1684, size: 64, align: 64, offset: 7168)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1686)
!1686 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !57, line: 740, baseType: !1687)
