; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--intrax8.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--intrax8.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.VLC = type { i32, [2 x i16]*, i32, i32 }

!865 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !35, line: 810, size: 32, align: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !888, line: 37, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!889 = !{!890, !891, !892, !893, !894, !895}
!890 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!891 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!892 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!893 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!894 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!895 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!896 = !{!897, !898, !899, !900, !908}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!898 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!899 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!901 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !903, line: 221, size: 32, align: 8, elements: !904)
!903 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!904 = !{!905}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !902, file: !903, line: 221, baseType: !906, size: 32, align: 32)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !907, line: 51, baseType: !899)
!907 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !907, line: 48, baseType: !909)
!909 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!910 = !{!911, !923, !931, !946, !951, !952, !953, !954, !957, !961, !962, !966, !970, !973, !1713, !1717, !1725, !1730}
!911 = distinct !DIGlobalVariable(name: "sizes", scope: !912, file: !913, line: 54, type: !917, isLocal: true, isDefinition: true, variable: [54 x i16]* @x8_vlc_init.sizes)
!912 = distinct !DISubprogram(name: "x8_vlc_init", scope: !913, file: !913, line: 49, type: !914, isLocal: true, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !916)
!913 = !DIFile(filename: "libavcodec/intrax8.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!914 = !DISubroutineType(types: !915)
!915 = !{!898}
!916 = !{}
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 864, align: 16, elements: !921)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !907, line: 49, baseType: !920)
!920 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!921 = !{!922}
!922 = !DISubrange(count: 54)
!923 = distinct !DIGlobalVariable(name: "table", scope: !912, file: !913, line: 66, type: !924, isLocal: true, isDefinition: true, variable: [28150 x [2 x i16]]* @x8_vlc_init.table)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 900800, align: 16, elements: !928)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !926, line: 195, baseType: !927)
!926 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!927 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!928 = !{!929, !930}
!929 = !DISubrange(count: 28150)
!930 = !DISubrange(count: 2)
!931 = distinct !DIGlobalVariable(name: "j_ac_vlc", scope: !0, file: !913, line: 45, type: !932, isLocal: true, isDefinition: true, variable: [2 x [2 x [8 x %struct.VLC]]]* @j_ac_vlc)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 6144, align: 64, elements: !944)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "VLC", file: !934, line: 30, baseType: !935)
!934 = !DIFile(filename: "libavcodec/vlc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VLC", file: !934, line: 26, size: 192, align: 64, elements: !936)
!936 = !{!937, !938, !942, !943}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !935, file: !934, line: 27, baseType: !898, size: 32, align: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !935, file: !934, line: 28, baseType: !939, size: 64, align: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 32, align: 16, elements: !941)
!941 = !{!930}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !935, file: !934, line: 29, baseType: !898, size: 32, align: 32, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "table_allocated", scope: !935, file: !934, line: 29, baseType: !898, size: 32, align: 32, offset: 160)
!944 = !{!930, !930, !945}
!945 = !DISubrange(count: 8)
!946 = distinct !DIGlobalVariable(name: "x8_ac0_highquant_table", scope: !0, file: !947, line: 423, type: !948, isLocal: true, isDefinition: true, variable: [8 x [77 x [2 x i16]]]* @x8_ac0_highquant_table)
!947 = !DIFile(filename: "libavcodec/intrax8huf.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 19712, align: 16, elements: !949)
!949 = !{!945, !950, !930}
!950 = !DISubrange(count: 77)
!951 = distinct !DIGlobalVariable(name: "x8_ac1_highquant_table", scope: !0, file: !947, line: 781, type: !948, isLocal: true, isDefinition: true, variable: [8 x [77 x [2 x i16]]]* @x8_ac1_highquant_table)
!952 = distinct !DIGlobalVariable(name: "x8_ac0_lowquant_table", scope: !0, file: !947, line: 244, type: !948, isLocal: true, isDefinition: true, variable: [8 x [77 x [2 x i16]]]* @x8_ac0_lowquant_table)
!953 = distinct !DIGlobalVariable(name: "x8_ac1_lowquant_table", scope: !0, file: !947, line: 602, type: !948, isLocal: true, isDefinition: true, variable: [8 x [77 x [2 x i16]]]* @x8_ac1_lowquant_table)
!954 = distinct !DIGlobalVariable(name: "j_dc_vlc", scope: !0, file: !913, line: 46, type: !955, isLocal: true, isDefinition: true, variable: [2 x [8 x %struct.VLC]]* @j_dc_vlc)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 3072, align: 64, elements: !956)
!956 = !{!930, !945}
!957 = distinct !DIGlobalVariable(name: "x8_dc_highquant_table", scope: !0, file: !947, line: 152, type: !958, isLocal: true, isDefinition: true, variable: [8 x [34 x [2 x i16]]]* @x8_dc_highquant_table)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 8704, align: 16, elements: !959)
!959 = !{!945, !960, !930}
!960 = !DISubrange(count: 34)
!961 = distinct !DIGlobalVariable(name: "x8_dc_lowquant_table", scope: !0, file: !947, line: 61, type: !958, isLocal: true, isDefinition: true, variable: [8 x [34 x [2 x i16]]]* @x8_dc_lowquant_table)
!962 = distinct !DIGlobalVariable(name: "j_orient_vlc", scope: !0, file: !913, line: 47, type: !963, isLocal: true, isDefinition: true, variable: [2 x [4 x %struct.VLC]]* @j_orient_vlc)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 1536, align: 64, elements: !964)
!964 = !{!930, !965}
!965 = !DISubrange(count: 4)
!966 = distinct !DIGlobalVariable(name: "x8_orient_highquant_table", scope: !0, file: !947, line: 47, type: !967, isLocal: true, isDefinition: true, variable: [2 x [12 x [2 x i16]]]* @x8_orient_highquant_table)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 768, align: 16, elements: !968)
!968 = !{!930, !969, !930}
!969 = !DISubrange(count: 12)
!970 = distinct !DIGlobalVariable(name: "x8_orient_lowquant_table", scope: !0, file: !947, line: 24, type: !971, isLocal: true, isDefinition: true, variable: [4 x [12 x [2 x i16]]]* @x8_orient_lowquant_table)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 1536, align: 16, elements: !972)
!972 = !{!965, !969, !930}
!973 = distinct !DIGlobalVariable(name: "prediction_table", scope: !974, file: !913, line: 365, type: !1711, isLocal: true, isDefinition: true, variable: [3 x [12 x i8]]* @x8_setup_spatial_predictor.prediction_table)
!974 = distinct !DISubprogram(name: "x8_setup_spatial_predictor", scope: !913, file: !913, line: 322, type: !975, isLocal: true, isDefinition: true, scopeLine: 323, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !916)
!975 = !DISubroutineType(types: !976)
!976 = !{!898, !977, !1107}
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "IntraX8Context", file: !980, line: 75, baseType: !981)
!980 = !DIFile(filename: "libavcodec/intrax8.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IntraX8Context", file: !980, line: 29, size: 8768, align: 64, elements: !982)
!982 = !{!983, !987, !988, !992, !993, !995, !1008, !1031, !1032, !1616, !1617, !1620, !1640, !1662, !1675, !1676, !1677, !1678, !1679, !1680, !1691, !1692, !1693, !1694, !1696, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "j_ac_vlc", scope: !981, file: !980, line: 30, baseType: !984, size: 256, align: 64)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 256, align: 64, elements: !986)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!986 = !{!965}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "j_orient_vlc", scope: !981, file: !980, line: 31, baseType: !985, size: 64, align: 64, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "j_dc_vlc", scope: !981, file: !980, line: 32, baseType: !989, size: 192, align: 64, offset: 320)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 192, align: 64, elements: !990)
!990 = !{!991}
!991 = !DISubrange(count: 3)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "use_quant_matrix", scope: !981, file: !980, line: 34, baseType: !898, size: 32, align: 32, offset: 512)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_table", scope: !981, file: !980, line: 37, baseType: !994, size: 64, align: 64, offset: 576)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !981, file: !980, line: 38, baseType: !996, size: 3264, align: 64, offset: 640)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !997, size: 3264, align: 64, elements: !990)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !888, line: 35, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !888, line: 31, size: 1088, align: 64, elements: !999)
!999 = !{!1000, !1003, !1007}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !998, file: !888, line: 32, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !998, file: !888, line: 33, baseType: !1004, size: 512, align: 8, offset: 64)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 512, align: 8, elements: !1005)
!1005 = !{!1006}
!1006 = !DISubrange(count: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !998, file: !888, line: 34, baseType: !1004, size: 512, align: 8, offset: 576)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "wdsp", scope: !981, file: !980, line: 39, baseType: !1009, size: 704, align: 64, offset: 3904)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "WMV2DSPContext", file: !1010, line: 33, baseType: !1011)
!1010 = !DIFile(filename: "libavcodec/wmv2dsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WMV2DSPContext", file: !1010, line: 26, size: 704, align: 64, elements: !1012)
!1012 = !{!1013, !1021, !1022, !1030}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "idct_add", scope: !1011, file: !1010, line: 27, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{null, !994, !1017, !1020}
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1018, line: 149, baseType: !1019)
!1018 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1019 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "idct_put", scope: !1011, file: !1010, line: 28, baseType: !1014, size: 64, align: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "put_mspel_pixels_tab", scope: !1011, file: !1010, line: 30, baseType: !1023, size: 512, align: 64, offset: 128)
!1023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1024, size: 512, align: 64, elements: !1029)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "qpel_mc_func", file: !1025, line: 65, baseType: !1026)
!1025 = !DIFile(filename: "libavcodec/qpeldsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{null, !994, !1001, !1017}
!1029 = !{!945}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "idct_perm", scope: !1011, file: !1010, line: 32, baseType: !898, size: 32, align: 32, offset: 640)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "idct_permutation", scope: !981, file: !980, line: 40, baseType: !1004, size: 512, align: 8, offset: 4608)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !981, file: !980, line: 41, baseType: !1033, size: 64, align: 64, offset: 5120)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1036)
!1036 = !{!1037, !1081, !1082, !1083, !1341, !1342, !1343, !1344, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1370, !1374, !1375, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1554, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1035, file: !35, line: 1561, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1042)
!1042 = !{!1043, !1047, !1051, !1055, !1056, !1057, !1058, !1062, !1068, !1070, !1074}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1041, file: !4, line: 72, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1046 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1041, file: !4, line: 78, baseType: !1048, size: 64, align: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!1044, !897}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1041, file: !4, line: 85, baseType: !1052, size: 64, align: 64, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1054)
!1054 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1041, file: !4, line: 93, baseType: !898, size: 32, align: 32, offset: 192)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1041, file: !4, line: 99, baseType: !898, size: 32, align: 32, offset: 224)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1041, file: !4, line: 108, baseType: !898, size: 32, align: 32, offset: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1041, file: !4, line: 113, baseType: !1059, size: 64, align: 64, offset: 320)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!897, !897, !897}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1041, file: !4, line: 123, baseType: !1063, size: 64, align: 64, offset: 384)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!1066, !1066}
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1041)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1041, file: !4, line: 130, baseType: !1069, size: 32, align: 32, offset: 448)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1041, file: !4, line: 136, baseType: !1071, size: 64, align: 64, offset: 512)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!1069, !897}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1041, file: !4, line: 142, baseType: !1075, size: 64, align: 64, offset: 576)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!898, !1078, !897, !1044, !898}
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1035, file: !35, line: 1562, baseType: !898, size: 32, align: 32, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1035, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1035, file: !35, line: 1565, baseType: !1084, size: 64, align: 64, offset: 128)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1086)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1087)
!1087 = !{!1088, !1089, !1090, !1091, !1092, !1093, !1102, !1105, !1108, !1111, !1116, !1117, !1118, !1126, !1127, !1128, !1130, !1134, !1140, !1145, !1149, !1150, !1192, !1312, !1316, !1317, !1321, !1325, !1330, !1334, !1335, !1336}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1086, file: !35, line: 3475, baseType: !1044, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1086, file: !35, line: 3480, baseType: !1044, size: 64, align: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1086, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1086, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1086, file: !35, line: 3487, baseType: !898, size: 32, align: 32, offset: 192)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1086, file: !35, line: 3488, baseType: !1094, size: 64, align: 64, offset: 256)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1096)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1097, line: 61, baseType: !1098)
!1097 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1097, line: 58, size: 64, align: 32, elements: !1099)
!1099 = !{!1100, !1101}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1098, file: !1097, line: 59, baseType: !898, size: 32, align: 32)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1098, file: !1097, line: 60, baseType: !898, size: 32, align: 32, offset: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1086, file: !35, line: 3489, baseType: !1103, size: 64, align: 64, offset: 320)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1086, file: !35, line: 3490, baseType: !1106, size: 64, align: 64, offset: 384)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !898)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1086, file: !35, line: 3491, baseType: !1109, size: 64, align: 64, offset: 448)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1086, file: !35, line: 3492, baseType: !1112, size: 64, align: 64, offset: 512)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1114)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !907, line: 55, baseType: !1115)
!1115 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1086, file: !35, line: 3493, baseType: !908, size: 8, align: 8, offset: 576)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1086, file: !35, line: 3494, baseType: !1038, size: 64, align: 64, offset: 640)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1086, file: !35, line: 3495, baseType: !1119, size: 64, align: 64, offset: 704)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1121)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1123)
!1123 = !{!1124, !1125}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1122, file: !35, line: 3402, baseType: !898, size: 32, align: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1122, file: !35, line: 3403, baseType: !1044, size: 64, align: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1086, file: !35, line: 3507, baseType: !1044, size: 64, align: 64, offset: 768)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1086, file: !35, line: 3516, baseType: !898, size: 32, align: 32, offset: 832)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1086, file: !35, line: 3517, baseType: !1129, size: 64, align: 64, offset: 896)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1086, file: !35, line: 3527, baseType: !1131, size: 64, align: 64, offset: 960)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!898, !1033}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1086, file: !35, line: 3535, baseType: !1135, size: 64, align: 64, offset: 1024)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!898, !1033, !1138}
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1034)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1086, file: !35, line: 3541, baseType: !1141, size: 64, align: 64, offset: 1088)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1143)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1144)
!1144 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1086, file: !35, line: 3549, baseType: !1146, size: 64, align: 64, offset: 1152)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{null, !1129}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1086, file: !35, line: 3551, baseType: !1131, size: 64, align: 64, offset: 1216)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1086, file: !35, line: 3552, baseType: !1151, size: 64, align: 64, offset: 1280)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!898, !1033, !994, !898, !1154}
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1157)
!1157 = !{!1158, !1159, !1160, !1161, !1162, !1190}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1156, file: !35, line: 3921, baseType: !919, size: 16, align: 16)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1156, file: !35, line: 3922, baseType: !906, size: 32, align: 32, offset: 32)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1156, file: !35, line: 3923, baseType: !906, size: 32, align: 32, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1156, file: !35, line: 3924, baseType: !899, size: 32, align: 32, offset: 96)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1156, file: !35, line: 3925, baseType: !1163, size: 64, align: 64, offset: 128)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1166)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1167)
!1167 = !{!1168, !1169, !1170, !1171, !1172, !1173, !1181, !1183, !1185, !1186, !1188, !1189}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1166, file: !35, line: 3886, baseType: !898, size: 32, align: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1166, file: !35, line: 3887, baseType: !898, size: 32, align: 32, offset: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1166, file: !35, line: 3888, baseType: !898, size: 32, align: 32, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1166, file: !35, line: 3889, baseType: !898, size: 32, align: 32, offset: 96)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1166, file: !35, line: 3890, baseType: !898, size: 32, align: 32, offset: 128)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1166, file: !35, line: 3897, baseType: !1174, size: 768, align: 64, offset: 192)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1176)
!1176 = !{!1177, !1179}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1175, file: !35, line: 3855, baseType: !1178, size: 512, align: 64)
!1178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !994, size: 512, align: 64, elements: !1029)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1175, file: !35, line: 3857, baseType: !1180, size: 256, align: 32, offset: 512)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 256, align: 32, elements: !1029)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1166, file: !35, line: 3903, baseType: !1182, size: 256, align: 64, offset: 960)
!1182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !994, size: 256, align: 64, elements: !986)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1166, file: !35, line: 3904, baseType: !1184, size: 128, align: 32, offset: 1216)
!1184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 128, align: 32, elements: !986)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1166, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1166, file: !35, line: 3908, baseType: !1187, size: 64, align: 64, offset: 1408)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1166, file: !35, line: 3915, baseType: !1187, size: 64, align: 64, offset: 1472)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1166, file: !35, line: 3917, baseType: !898, size: 32, align: 32, offset: 1536)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1156, file: !35, line: 3926, baseType: !1191, size: 64, align: 64, offset: 192)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !926, line: 197, baseType: !1019)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1086, file: !35, line: 3564, baseType: !1193, size: 64, align: 64, offset: 1344)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!898, !1033, !1196, !1230, !1311}
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1199)
!1199 = !{!1200, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1226, !1227, !1228, !1229}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1198, file: !35, line: 1451, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1203, line: 94, baseType: !1204)
!1203 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1203, line: 81, size: 192, align: 64, elements: !1205)
!1205 = !{!1206, !1210, !1211}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1204, file: !1203, line: 82, baseType: !1207, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1203, line: 73, baseType: !1209)
!1209 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1203, line: 73, flags: DIFlagFwdDecl)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1204, file: !1203, line: 89, baseType: !994, size: 64, align: 64, offset: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1204, file: !1203, line: 93, baseType: !898, size: 32, align: 32, offset: 128)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1198, file: !35, line: 1461, baseType: !1191, size: 64, align: 64, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1198, file: !35, line: 1467, baseType: !1191, size: 64, align: 64, offset: 128)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1198, file: !35, line: 1468, baseType: !994, size: 64, align: 64, offset: 192)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1198, file: !35, line: 1469, baseType: !898, size: 32, align: 32, offset: 256)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1198, file: !35, line: 1470, baseType: !898, size: 32, align: 32, offset: 288)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1198, file: !35, line: 1474, baseType: !898, size: 32, align: 32, offset: 320)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1198, file: !35, line: 1479, baseType: !1219, size: 64, align: 64, offset: 384)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1221)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1222)
!1222 = !{!1223, !1224, !1225}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1221, file: !35, line: 1412, baseType: !994, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1221, file: !35, line: 1413, baseType: !898, size: 32, align: 32, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1221, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1198, file: !35, line: 1480, baseType: !898, size: 32, align: 32, offset: 448)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1198, file: !35, line: 1486, baseType: !1191, size: 64, align: 64, offset: 512)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1198, file: !35, line: 1488, baseType: !1191, size: 64, align: 64, offset: 576)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1198, file: !35, line: 1497, baseType: !1191, size: 64, align: 64, offset: 640)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1232)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1233)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1234)
!1234 = !{!1235, !1236, !1237, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1264, !1266, !1267, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1300, !1301, !1302, !1303, !1304, !1305, !1307, !1308, !1309, !1310}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1233, file: !758, line: 282, baseType: !1178, size: 512, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1233, file: !758, line: 299, baseType: !1180, size: 256, align: 32, offset: 512)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1233, file: !758, line: 315, baseType: !1238, size: 64, align: 64, offset: 768)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1233, file: !758, line: 326, baseType: !898, size: 32, align: 32, offset: 832)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1233, file: !758, line: 326, baseType: !898, size: 32, align: 32, offset: 864)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1233, file: !758, line: 334, baseType: !898, size: 32, align: 32, offset: 896)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1233, file: !758, line: 341, baseType: !898, size: 32, align: 32, offset: 928)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1233, file: !758, line: 346, baseType: !898, size: 32, align: 32, offset: 960)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1233, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1233, file: !758, line: 356, baseType: !1096, size: 64, align: 32, offset: 1024)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1233, file: !758, line: 361, baseType: !1191, size: 64, align: 64, offset: 1088)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1233, file: !758, line: 369, baseType: !1191, size: 64, align: 64, offset: 1152)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1233, file: !758, line: 377, baseType: !1191, size: 64, align: 64, offset: 1216)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1233, file: !758, line: 382, baseType: !898, size: 32, align: 32, offset: 1280)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1233, file: !758, line: 386, baseType: !898, size: 32, align: 32, offset: 1312)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1233, file: !758, line: 391, baseType: !898, size: 32, align: 32, offset: 1344)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1233, file: !758, line: 396, baseType: !897, size: 64, align: 64, offset: 1408)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1233, file: !758, line: 403, baseType: !1254, size: 512, align: 64, offset: 1472)
!1254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1114, size: 512, align: 64, elements: !1029)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1233, file: !758, line: 410, baseType: !898, size: 32, align: 32, offset: 1984)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1233, file: !758, line: 415, baseType: !898, size: 32, align: 32, offset: 2016)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1233, file: !758, line: 420, baseType: !898, size: 32, align: 32, offset: 2048)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1233, file: !758, line: 425, baseType: !898, size: 32, align: 32, offset: 2080)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1233, file: !758, line: 435, baseType: !1191, size: 64, align: 64, offset: 2112)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1233, file: !758, line: 440, baseType: !898, size: 32, align: 32, offset: 2176)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1233, file: !758, line: 445, baseType: !1114, size: 64, align: 64, offset: 2240)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1233, file: !758, line: 459, baseType: !1263, size: 512, align: 64, offset: 2304)
!1263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1201, size: 512, align: 64, elements: !1029)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1233, file: !758, line: 473, baseType: !1265, size: 64, align: 64, offset: 2816)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1233, file: !758, line: 477, baseType: !898, size: 32, align: 32, offset: 2880)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1233, file: !758, line: 479, baseType: !1268, size: 64, align: 64, offset: 2944)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1271)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1272)
!1272 = !{!1273, !1274, !1275, !1276, !1281}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1271, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1271, file: !758, line: 203, baseType: !994, size: 64, align: 64, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1271, file: !758, line: 204, baseType: !898, size: 32, align: 32, offset: 128)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1271, file: !758, line: 205, baseType: !1277, size: 64, align: 64, offset: 192)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1279, line: 86, baseType: !1280)
!1279 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1280 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1279, line: 86, flags: DIFlagFwdDecl)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1271, file: !758, line: 206, baseType: !1201, size: 64, align: 64, offset: 256)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1233, file: !758, line: 480, baseType: !898, size: 32, align: 32, offset: 3008)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1233, file: !758, line: 505, baseType: !898, size: 32, align: 32, offset: 3040)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1233, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1233, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1233, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1233, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1233, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1233, file: !758, line: 532, baseType: !1191, size: 64, align: 64, offset: 3264)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1233, file: !758, line: 539, baseType: !1191, size: 64, align: 64, offset: 3328)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1233, file: !758, line: 547, baseType: !1191, size: 64, align: 64, offset: 3392)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1233, file: !758, line: 554, baseType: !1277, size: 64, align: 64, offset: 3456)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1233, file: !758, line: 563, baseType: !898, size: 32, align: 32, offset: 3520)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1233, file: !758, line: 572, baseType: !898, size: 32, align: 32, offset: 3552)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1233, file: !758, line: 581, baseType: !898, size: 32, align: 32, offset: 3584)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1233, file: !758, line: 588, baseType: !1297, size: 64, align: 64, offset: 3648)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !926, line: 194, baseType: !1299)
!1299 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1233, file: !758, line: 593, baseType: !898, size: 32, align: 32, offset: 3712)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1233, file: !758, line: 596, baseType: !898, size: 32, align: 32, offset: 3744)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1233, file: !758, line: 599, baseType: !1201, size: 64, align: 64, offset: 3776)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1233, file: !758, line: 605, baseType: !1201, size: 64, align: 64, offset: 3840)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1233, file: !758, line: 616, baseType: !1201, size: 64, align: 64, offset: 3904)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1233, file: !758, line: 626, baseType: !1306, size: 64, align: 64, offset: 3968)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1018, line: 216, baseType: !1115)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1233, file: !758, line: 627, baseType: !1306, size: 64, align: 64, offset: 4032)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1233, file: !758, line: 628, baseType: !1306, size: 64, align: 64, offset: 4096)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1233, file: !758, line: 629, baseType: !1306, size: 64, align: 64, offset: 4160)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1233, file: !758, line: 645, baseType: !1201, size: 64, align: 64, offset: 4224)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1086, file: !35, line: 3566, baseType: !1313, size: 64, align: 64, offset: 1408)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!898, !1033, !897, !1311, !1196}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1086, file: !35, line: 3567, baseType: !1131, size: 64, align: 64, offset: 1472)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1086, file: !35, line: 3576, baseType: !1318, size: 64, align: 64, offset: 1536)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DISubroutineType(types: !1320)
!1320 = !{!898, !1033, !1230}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1086, file: !35, line: 3577, baseType: !1322, size: 64, align: 64, offset: 1600)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DISubroutineType(types: !1324)
!1324 = !{!898, !1033, !1196}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1086, file: !35, line: 3584, baseType: !1326, size: 64, align: 64, offset: 1664)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{!898, !1033, !1329}
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1086, file: !35, line: 3589, baseType: !1331, size: 64, align: 64, offset: 1728)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{null, !1033}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1086, file: !35, line: 3594, baseType: !898, size: 32, align: 32, offset: 1792)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1086, file: !35, line: 3600, baseType: !1044, size: 64, align: 64, offset: 1856)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1086, file: !35, line: 3609, baseType: !1337, size: 64, align: 64, offset: 1920)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1340)
!1340 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1035, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1035, file: !35, line: 1581, baseType: !899, size: 32, align: 32, offset: 224)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1035, file: !35, line: 1583, baseType: !897, size: 64, align: 64, offset: 256)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1035, file: !35, line: 1591, baseType: !1345, size: 64, align: 64, offset: 320)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1035, file: !35, line: 1598, baseType: !897, size: 64, align: 64, offset: 384)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1035, file: !35, line: 1606, baseType: !1191, size: 64, align: 64, offset: 448)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1035, file: !35, line: 1614, baseType: !898, size: 32, align: 32, offset: 512)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1035, file: !35, line: 1622, baseType: !898, size: 32, align: 32, offset: 544)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1035, file: !35, line: 1628, baseType: !898, size: 32, align: 32, offset: 576)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1035, file: !35, line: 1636, baseType: !898, size: 32, align: 32, offset: 608)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1035, file: !35, line: 1643, baseType: !898, size: 32, align: 32, offset: 640)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1035, file: !35, line: 1657, baseType: !994, size: 64, align: 64, offset: 704)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1035, file: !35, line: 1658, baseType: !898, size: 32, align: 32, offset: 768)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1035, file: !35, line: 1679, baseType: !1096, size: 64, align: 32, offset: 800)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1035, file: !35, line: 1688, baseType: !898, size: 32, align: 32, offset: 864)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1035, file: !35, line: 1712, baseType: !898, size: 32, align: 32, offset: 896)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1035, file: !35, line: 1729, baseType: !898, size: 32, align: 32, offset: 928)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1035, file: !35, line: 1729, baseType: !898, size: 32, align: 32, offset: 960)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1035, file: !35, line: 1744, baseType: !898, size: 32, align: 32, offset: 992)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1035, file: !35, line: 1744, baseType: !898, size: 32, align: 32, offset: 1024)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1035, file: !35, line: 1751, baseType: !898, size: 32, align: 32, offset: 1056)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1035, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1035, file: !35, line: 1791, baseType: !1366, size: 64, align: 64, offset: 1152)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DISubroutineType(types: !1368)
!1368 = !{null, !1369, !1230, !1311, !898, !898, !898}
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1035, file: !35, line: 1808, baseType: !1371, size: 64, align: 64, offset: 1216)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DISubroutineType(types: !1373)
!1373 = !{!494, !1369, !1103}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1035, file: !35, line: 1816, baseType: !898, size: 32, align: 32, offset: 1280)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1035, file: !35, line: 1825, baseType: !1376, size: 32, align: 32, offset: 1312)
!1376 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1035, file: !35, line: 1830, baseType: !898, size: 32, align: 32, offset: 1344)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1035, file: !35, line: 1838, baseType: !1376, size: 32, align: 32, offset: 1376)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1035, file: !35, line: 1846, baseType: !898, size: 32, align: 32, offset: 1408)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1035, file: !35, line: 1851, baseType: !898, size: 32, align: 32, offset: 1440)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1035, file: !35, line: 1861, baseType: !1376, size: 32, align: 32, offset: 1472)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1035, file: !35, line: 1868, baseType: !1376, size: 32, align: 32, offset: 1504)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1035, file: !35, line: 1875, baseType: !1376, size: 32, align: 32, offset: 1536)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1035, file: !35, line: 1882, baseType: !1376, size: 32, align: 32, offset: 1568)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1035, file: !35, line: 1889, baseType: !1376, size: 32, align: 32, offset: 1600)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1035, file: !35, line: 1896, baseType: !1376, size: 32, align: 32, offset: 1632)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1035, file: !35, line: 1903, baseType: !1376, size: 32, align: 32, offset: 1664)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1035, file: !35, line: 1910, baseType: !898, size: 32, align: 32, offset: 1696)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1035, file: !35, line: 1915, baseType: !898, size: 32, align: 32, offset: 1728)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1035, file: !35, line: 1926, baseType: !1311, size: 64, align: 64, offset: 1792)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1035, file: !35, line: 1935, baseType: !1096, size: 64, align: 32, offset: 1856)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1035, file: !35, line: 1942, baseType: !898, size: 32, align: 32, offset: 1920)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1035, file: !35, line: 1948, baseType: !898, size: 32, align: 32, offset: 1952)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1035, file: !35, line: 1954, baseType: !898, size: 32, align: 32, offset: 1984)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1035, file: !35, line: 1960, baseType: !898, size: 32, align: 32, offset: 2016)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1035, file: !35, line: 1984, baseType: !898, size: 32, align: 32, offset: 2048)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1035, file: !35, line: 1991, baseType: !898, size: 32, align: 32, offset: 2080)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1035, file: !35, line: 1996, baseType: !898, size: 32, align: 32, offset: 2112)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1035, file: !35, line: 2004, baseType: !898, size: 32, align: 32, offset: 2144)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1035, file: !35, line: 2011, baseType: !898, size: 32, align: 32, offset: 2176)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1035, file: !35, line: 2018, baseType: !898, size: 32, align: 32, offset: 2208)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1035, file: !35, line: 2027, baseType: !898, size: 32, align: 32, offset: 2240)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1035, file: !35, line: 2034, baseType: !898, size: 32, align: 32, offset: 2272)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1035, file: !35, line: 2044, baseType: !898, size: 32, align: 32, offset: 2304)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1035, file: !35, line: 2054, baseType: !1406, size: 64, align: 64, offset: 2368)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1035, file: !35, line: 2061, baseType: !1406, size: 64, align: 64, offset: 2432)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1035, file: !35, line: 2066, baseType: !898, size: 32, align: 32, offset: 2496)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1035, file: !35, line: 2070, baseType: !898, size: 32, align: 32, offset: 2528)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1035, file: !35, line: 2078, baseType: !898, size: 32, align: 32, offset: 2560)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1035, file: !35, line: 2085, baseType: !898, size: 32, align: 32, offset: 2592)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1035, file: !35, line: 2092, baseType: !898, size: 32, align: 32, offset: 2624)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1035, file: !35, line: 2099, baseType: !898, size: 32, align: 32, offset: 2656)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1035, file: !35, line: 2106, baseType: !898, size: 32, align: 32, offset: 2688)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1035, file: !35, line: 2113, baseType: !898, size: 32, align: 32, offset: 2720)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1035, file: !35, line: 2120, baseType: !898, size: 32, align: 32, offset: 2752)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1035, file: !35, line: 2125, baseType: !898, size: 32, align: 32, offset: 2784)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1035, file: !35, line: 2133, baseType: !898, size: 32, align: 32, offset: 2816)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1035, file: !35, line: 2140, baseType: !898, size: 32, align: 32, offset: 2848)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1035, file: !35, line: 2145, baseType: !898, size: 32, align: 32, offset: 2880)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1035, file: !35, line: 2153, baseType: !898, size: 32, align: 32, offset: 2912)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1035, file: !35, line: 2158, baseType: !898, size: 32, align: 32, offset: 2944)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1035, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1035, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1035, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1035, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1035, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1035, file: !35, line: 2203, baseType: !898, size: 32, align: 32, offset: 3136)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1035, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1035, file: !35, line: 2212, baseType: !898, size: 32, align: 32, offset: 3200)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1035, file: !35, line: 2213, baseType: !898, size: 32, align: 32, offset: 3232)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1035, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1035, file: !35, line: 2232, baseType: !898, size: 32, align: 32, offset: 3296)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1035, file: !35, line: 2243, baseType: !898, size: 32, align: 32, offset: 3328)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1035, file: !35, line: 2249, baseType: !898, size: 32, align: 32, offset: 3360)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1035, file: !35, line: 2256, baseType: !898, size: 32, align: 32, offset: 3392)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1035, file: !35, line: 2263, baseType: !1114, size: 64, align: 64, offset: 3456)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1035, file: !35, line: 2270, baseType: !1114, size: 64, align: 64, offset: 3520)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1035, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1035, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1035, file: !35, line: 2367, baseType: !1442, size: 64, align: 64, offset: 3648)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{!898, !1369, !1329, !898}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1035, file: !35, line: 2383, baseType: !898, size: 32, align: 32, offset: 3712)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1035, file: !35, line: 2386, baseType: !1376, size: 32, align: 32, offset: 3744)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1035, file: !35, line: 2387, baseType: !1376, size: 32, align: 32, offset: 3776)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1035, file: !35, line: 2394, baseType: !898, size: 32, align: 32, offset: 3808)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1035, file: !35, line: 2401, baseType: !898, size: 32, align: 32, offset: 3840)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1035, file: !35, line: 2408, baseType: !898, size: 32, align: 32, offset: 3872)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1035, file: !35, line: 2415, baseType: !898, size: 32, align: 32, offset: 3904)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1035, file: !35, line: 2422, baseType: !898, size: 32, align: 32, offset: 3936)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1035, file: !35, line: 2423, baseType: !1454, size: 64, align: 64, offset: 3968)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1456)
!1456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1457)
!1457 = !{!1458, !1459, !1460, !1461}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1456, file: !35, line: 827, baseType: !898, size: 32, align: 32)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1456, file: !35, line: 828, baseType: !898, size: 32, align: 32, offset: 32)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1456, file: !35, line: 829, baseType: !898, size: 32, align: 32, offset: 64)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1456, file: !35, line: 830, baseType: !1376, size: 32, align: 32, offset: 96)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1035, file: !35, line: 2430, baseType: !1191, size: 64, align: 64, offset: 4032)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1035, file: !35, line: 2437, baseType: !1191, size: 64, align: 64, offset: 4096)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1035, file: !35, line: 2444, baseType: !1376, size: 32, align: 32, offset: 4160)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1035, file: !35, line: 2451, baseType: !1376, size: 32, align: 32, offset: 4192)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1035, file: !35, line: 2458, baseType: !898, size: 32, align: 32, offset: 4224)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1035, file: !35, line: 2469, baseType: !898, size: 32, align: 32, offset: 4256)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1035, file: !35, line: 2475, baseType: !898, size: 32, align: 32, offset: 4288)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1035, file: !35, line: 2481, baseType: !898, size: 32, align: 32, offset: 4320)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1035, file: !35, line: 2485, baseType: !898, size: 32, align: 32, offset: 4352)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1035, file: !35, line: 2489, baseType: !898, size: 32, align: 32, offset: 4384)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1035, file: !35, line: 2493, baseType: !898, size: 32, align: 32, offset: 4416)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1035, file: !35, line: 2501, baseType: !898, size: 32, align: 32, offset: 4448)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1035, file: !35, line: 2506, baseType: !898, size: 32, align: 32, offset: 4480)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1035, file: !35, line: 2510, baseType: !898, size: 32, align: 32, offset: 4512)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1035, file: !35, line: 2514, baseType: !1191, size: 64, align: 64, offset: 4544)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1035, file: !35, line: 2528, baseType: !1478, size: 64, align: 64, offset: 4608)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DISubroutineType(types: !1480)
!1480 = !{null, !1369, !897, !898, !898}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1035, file: !35, line: 2534, baseType: !898, size: 32, align: 32, offset: 4672)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1035, file: !35, line: 2545, baseType: !898, size: 32, align: 32, offset: 4704)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1035, file: !35, line: 2547, baseType: !898, size: 32, align: 32, offset: 4736)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1035, file: !35, line: 2549, baseType: !898, size: 32, align: 32, offset: 4768)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1035, file: !35, line: 2551, baseType: !898, size: 32, align: 32, offset: 4800)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1035, file: !35, line: 2553, baseType: !898, size: 32, align: 32, offset: 4832)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1035, file: !35, line: 2555, baseType: !898, size: 32, align: 32, offset: 4864)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1035, file: !35, line: 2557, baseType: !898, size: 32, align: 32, offset: 4896)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1035, file: !35, line: 2559, baseType: !898, size: 32, align: 32, offset: 4928)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1035, file: !35, line: 2563, baseType: !898, size: 32, align: 32, offset: 4960)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1035, file: !35, line: 2571, baseType: !1187, size: 64, align: 64, offset: 4992)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1035, file: !35, line: 2579, baseType: !1187, size: 64, align: 64, offset: 5056)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1035, file: !35, line: 2586, baseType: !898, size: 32, align: 32, offset: 5120)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1035, file: !35, line: 2615, baseType: !898, size: 32, align: 32, offset: 5152)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1035, file: !35, line: 2627, baseType: !898, size: 32, align: 32, offset: 5184)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1035, file: !35, line: 2637, baseType: !898, size: 32, align: 32, offset: 5216)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1035, file: !35, line: 2681, baseType: !898, size: 32, align: 32, offset: 5248)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1035, file: !35, line: 2709, baseType: !1191, size: 64, align: 64, offset: 5312)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1035, file: !35, line: 2716, baseType: !1500, size: 64, align: 64, offset: 5376)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1502)
!1502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1503)
!1503 = !{!1504, !1505, !1506, !1507, !1508, !1509, !1510, !1514, !1518, !1519, !1520, !1521, !1527, !1528, !1529, !1530, !1531}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1502, file: !35, line: 3642, baseType: !1044, size: 64, align: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1502, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1502, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1502, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1502, file: !35, line: 3669, baseType: !898, size: 32, align: 32, offset: 160)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1502, file: !35, line: 3682, baseType: !1326, size: 64, align: 64, offset: 192)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1502, file: !35, line: 3698, baseType: !1511, size: 64, align: 64, offset: 256)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DISubroutineType(types: !1513)
!1513 = !{!898, !1033, !1001, !906}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1502, file: !35, line: 3712, baseType: !1515, size: 64, align: 64, offset: 320)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DISubroutineType(types: !1517)
!1517 = !{!898, !1033, !898, !1001, !906}
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1502, file: !35, line: 3726, baseType: !1511, size: 64, align: 64, offset: 384)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1502, file: !35, line: 3737, baseType: !1131, size: 64, align: 64, offset: 448)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1502, file: !35, line: 3746, baseType: !898, size: 32, align: 32, offset: 512)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1502, file: !35, line: 3757, baseType: !1522, size: 64, align: 64, offset: 576)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!1523 = !DISubroutineType(types: !1524)
!1524 = !{null, !1525}
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64, align: 64)
!1526 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1502, file: !35, line: 3766, baseType: !1131, size: 64, align: 64, offset: 640)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1502, file: !35, line: 3774, baseType: !1131, size: 64, align: 64, offset: 704)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1502, file: !35, line: 3780, baseType: !898, size: 32, align: 32, offset: 768)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1502, file: !35, line: 3785, baseType: !898, size: 32, align: 32, offset: 800)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1502, file: !35, line: 3795, baseType: !1532, size: 64, align: 64, offset: 832)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64, align: 64)
!1533 = !DISubroutineType(types: !1534)
!1534 = !{!898, !1033, !1201}
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1035, file: !35, line: 2728, baseType: !897, size: 64, align: 64, offset: 5440)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1035, file: !35, line: 2735, baseType: !1254, size: 512, align: 64, offset: 5504)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1035, file: !35, line: 2742, baseType: !898, size: 32, align: 32, offset: 6016)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1035, file: !35, line: 2755, baseType: !898, size: 32, align: 32, offset: 6048)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1035, file: !35, line: 2776, baseType: !898, size: 32, align: 32, offset: 6080)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1035, file: !35, line: 2783, baseType: !898, size: 32, align: 32, offset: 6112)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1035, file: !35, line: 2791, baseType: !898, size: 32, align: 32, offset: 6144)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1035, file: !35, line: 2802, baseType: !1329, size: 64, align: 64, offset: 6208)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1035, file: !35, line: 2811, baseType: !898, size: 32, align: 32, offset: 6272)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1035, file: !35, line: 2821, baseType: !898, size: 32, align: 32, offset: 6304)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1035, file: !35, line: 2830, baseType: !898, size: 32, align: 32, offset: 6336)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1035, file: !35, line: 2840, baseType: !898, size: 32, align: 32, offset: 6368)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1035, file: !35, line: 2851, baseType: !1548, size: 64, align: 64, offset: 6400)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DISubroutineType(types: !1550)
!1550 = !{!898, !1369, !1551, !897, !1311, !898, !898}
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1552, size: 64, align: 64)
!1552 = !DISubroutineType(types: !1553)
!1553 = !{!898, !1369, !897}
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1035, file: !35, line: 2871, baseType: !1555, size: 64, align: 64, offset: 6464)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1556 = !DISubroutineType(types: !1557)
!1557 = !{!898, !1369, !1558, !897, !1311, !898}
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DISubroutineType(types: !1560)
!1560 = !{!898, !1369, !897, !898, !898}
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1035, file: !35, line: 2878, baseType: !898, size: 32, align: 32, offset: 6528)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1035, file: !35, line: 2885, baseType: !898, size: 32, align: 32, offset: 6560)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1035, file: !35, line: 3005, baseType: !898, size: 32, align: 32, offset: 6592)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1035, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1035, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1035, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1035, file: !35, line: 3037, baseType: !994, size: 64, align: 64, offset: 6720)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1035, file: !35, line: 3038, baseType: !898, size: 32, align: 32, offset: 6784)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1035, file: !35, line: 3050, baseType: !1114, size: 64, align: 64, offset: 6848)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1035, file: !35, line: 3065, baseType: !898, size: 32, align: 32, offset: 6912)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1035, file: !35, line: 3083, baseType: !898, size: 32, align: 32, offset: 6944)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1035, file: !35, line: 3092, baseType: !1096, size: 64, align: 32, offset: 6976)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1035, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1035, file: !35, line: 3106, baseType: !1096, size: 64, align: 32, offset: 7072)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1035, file: !35, line: 3113, baseType: !1576, size: 64, align: 64, offset: 7168)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1578)
!1578 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1579)
!1579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1580)
!1580 = !{!1581, !1582, !1583, !1584, !1585, !1586, !1589}
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1579, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1579, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1579, file: !35, line: 720, baseType: !1044, size: 64, align: 64, offset: 64)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1579, file: !35, line: 724, baseType: !1044, size: 64, align: 64, offset: 128)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1579, file: !35, line: 728, baseType: !898, size: 32, align: 32, offset: 192)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1579, file: !35, line: 734, baseType: !1587, size: 64, align: 64, offset: 256)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64, align: 64)
!1588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1044)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1579, file: !35, line: 739, baseType: !1590, size: 64, align: 64, offset: 320)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64, align: 64)
!1591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1122)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1035, file: !35, line: 3129, baseType: !1191, size: 64, align: 64, offset: 7232)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1035, file: !35, line: 3130, baseType: !1191, size: 64, align: 64, offset: 7296)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1035, file: !35, line: 3131, baseType: !1191, size: 64, align: 64, offset: 7360)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1035, file: !35, line: 3132, baseType: !1191, size: 64, align: 64, offset: 7424)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1035, file: !35, line: 3139, baseType: !1187, size: 64, align: 64, offset: 7488)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1035, file: !35, line: 3147, baseType: !898, size: 32, align: 32, offset: 7552)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1035, file: !35, line: 3165, baseType: !898, size: 32, align: 32, offset: 7584)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1035, file: !35, line: 3172, baseType: !898, size: 32, align: 32, offset: 7616)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1035, file: !35, line: 3180, baseType: !898, size: 32, align: 32, offset: 7648)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1035, file: !35, line: 3191, baseType: !1406, size: 64, align: 64, offset: 7680)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1035, file: !35, line: 3199, baseType: !994, size: 64, align: 64, offset: 7744)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1035, file: !35, line: 3207, baseType: !1187, size: 64, align: 64, offset: 7808)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1035, file: !35, line: 3214, baseType: !899, size: 32, align: 32, offset: 7872)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1035, file: !35, line: 3224, baseType: !1219, size: 64, align: 64, offset: 7936)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1035, file: !35, line: 3225, baseType: !898, size: 32, align: 32, offset: 8000)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1035, file: !35, line: 3249, baseType: !1201, size: 64, align: 64, offset: 8064)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1035, file: !35, line: 3256, baseType: !898, size: 32, align: 32, offset: 8128)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1035, file: !35, line: 3271, baseType: !898, size: 32, align: 32, offset: 8160)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1035, file: !35, line: 3279, baseType: !1191, size: 64, align: 64, offset: 8192)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1035, file: !35, line: 3301, baseType: !1201, size: 64, align: 64, offset: 8256)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1035, file: !35, line: 3310, baseType: !898, size: 32, align: 32, offset: 8320)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1035, file: !35, line: 3337, baseType: !898, size: 32, align: 32, offset: 8352)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1035, file: !35, line: 3351, baseType: !898, size: 32, align: 32, offset: 8384)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1035, file: !35, line: 3359, baseType: !898, size: 32, align: 32, offset: 8416)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !981, file: !980, line: 42, baseType: !1311, size: 64, align: 64, offset: 5184)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !981, file: !980, line: 43, baseType: !1618, size: 64, align: 64, offset: 5248)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 1024, align: 16, elements: !1005)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "dsp", scope: !981, file: !980, line: 46, baseType: !1621, size: 960, align: 64, offset: 5312)
!1621 = !DIDerivedType(tag: DW_TAG_typedef, name: "IntraX8DSPContext", file: !1622, line: 34, baseType: !1623)
!1622 = !DIFile(filename: "libavcodec/intrax8dsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IntraX8DSPContext", file: !1622, line: 25, size: 960, align: 64, elements: !1624)
!1624 = !{!1625, !1629, !1630, !1636}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "v_loop_filter", scope: !1623, file: !1622, line: 26, baseType: !1626, size: 64, align: 64)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DISubroutineType(types: !1628)
!1628 = !{null, !994, !1017, !898}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "h_loop_filter", scope: !1623, file: !1622, line: 27, baseType: !1626, size: 64, align: 64, offset: 64)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_compensation", scope: !1623, file: !1622, line: 29, baseType: !1631, size: 768, align: 64, offset: 128)
!1631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1632, size: 768, align: 64, elements: !1635)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64, align: 64)
!1633 = !DISubroutineType(types: !1634)
!1634 = !{null, !994, !994, !1017}
!1635 = !{!969}
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "setup_spatial_compensation", scope: !1623, file: !1622, line: 31, baseType: !1637, size: 64, align: 64, offset: 896)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DISubroutineType(types: !1639)
!1639 = !{null, !994, !994, !1017, !1311, !1311, !898}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "idsp", scope: !981, file: !980, line: 47, baseType: !1641, size: 960, align: 64, offset: 6272)
!1641 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDCTDSPContext", file: !888, line: 100, baseType: !1642)
!1642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDCTDSPContext", file: !888, line: 53, size: 960, align: 64, elements: !1643)
!1643 = !{!1644, !1651, !1652, !1653, !1657, !1658, !1659, !1660, !1661}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "put_pixels_clamped", scope: !1642, file: !888, line: 55, baseType: !1645, size: 64, align: 64)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{null, !1648, !1650, !1017}
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!1650 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !994)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "put_signed_pixels_clamped", scope: !1642, file: !888, line: 58, baseType: !1645, size: 64, align: 64, offset: 64)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "add_pixels_clamped", scope: !1642, file: !888, line: 61, baseType: !1645, size: 64, align: 64, offset: 128)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !1642, file: !888, line: 65, baseType: !1654, size: 64, align: 64, offset: 192)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DISubroutineType(types: !1656)
!1656 = !{null, !1020}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "idct_put", scope: !1642, file: !888, line: 72, baseType: !1014, size: 64, align: 64, offset: 256)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "idct_add", scope: !1642, file: !888, line: 79, baseType: !1014, size: 64, align: 64, offset: 320)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "idct_permutation", scope: !1642, file: !888, line: 96, baseType: !1004, size: 512, align: 8, offset: 384)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "perm_type", scope: !1642, file: !888, line: 97, baseType: !887, size: 32, align: 32, offset: 896)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg4_studio_profile", scope: !1642, file: !888, line: 99, baseType: !898, size: 32, align: 32, offset: 928)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "bdsp", scope: !981, file: !980, line: 48, baseType: !1663, size: 256, align: 64, offset: 7232)
!1663 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlockDSPContext", file: !1664, line: 40, baseType: !1665)
!1664 = !DIFile(filename: "libavcodec/blockdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BlockDSPContext", file: !1664, line: 35, size: 256, align: 64, elements: !1666)
!1666 = !{!1667, !1668, !1669}
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "clear_block", scope: !1665, file: !1664, line: 36, baseType: !1654, size: 64, align: 64)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "clear_blocks", scope: !1665, file: !1664, line: 37, baseType: !1654, size: 64, align: 64, offset: 64)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "fill_block_tab", scope: !1665, file: !1664, line: 39, baseType: !1670, size: 128, align: 64, offset: 128)
!1670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1671, size: 128, align: 64, elements: !941)
!1671 = !DIDerivedType(tag: DW_TAG_typedef, name: "op_fill_func", file: !1664, line: 32, baseType: !1672)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DISubroutineType(types: !1674)
!1674 = !{null, !994, !908, !1017, !898}
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "quant", scope: !981, file: !980, line: 49, baseType: !898, size: 32, align: 32, offset: 7488)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "dquant", scope: !981, file: !980, line: 50, baseType: !898, size: 32, align: 32, offset: 7520)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "qsum", scope: !981, file: !980, line: 51, baseType: !898, size: 32, align: 32, offset: 7552)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "loopfilter", scope: !981, file: !980, line: 52, baseType: !898, size: 32, align: 32, offset: 7584)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !981, file: !980, line: 53, baseType: !1329, size: 64, align: 64, offset: 7616)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "gb", scope: !981, file: !980, line: 54, baseType: !1681, size: 64, align: 64, offset: 7680)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1683, line: 70, baseType: !1684)
!1683 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1683, line: 61, size: 256, align: 64, elements: !1685)
!1685 = !{!1686, !1687, !1688, !1689, !1690}
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1684, file: !1683, line: 62, baseType: !1001, size: 64, align: 64)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1684, file: !1683, line: 62, baseType: !1001, size: 64, align: 64, offset: 64)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1684, file: !1683, line: 67, baseType: !898, size: 32, align: 32, offset: 128)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1684, file: !1683, line: 68, baseType: !898, size: 32, align: 32, offset: 160)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1684, file: !1683, line: 69, baseType: !898, size: 32, align: 32, offset: 192)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "quant_dc_chroma", scope: !981, file: !980, line: 57, baseType: !898, size: 32, align: 32, offset: 7744)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "divide_quant_dc_luma", scope: !981, file: !980, line: 58, baseType: !898, size: 32, align: 32, offset: 7776)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "divide_quant_dc_chroma", scope: !981, file: !980, line: 59, baseType: !898, size: 32, align: 32, offset: 7808)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !981, file: !980, line: 60, baseType: !1695, size: 192, align: 64, offset: 7872)
!1695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !994, size: 192, align: 64, elements: !990)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "scratchpad", scope: !981, file: !980, line: 61, baseType: !1697, size: 336, align: 8, offset: 8064)
!1697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 336, align: 8, elements: !1698)
!1698 = !{!1699}
!1699 = !DISubrange(count: 42)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "edges", scope: !981, file: !980, line: 64, baseType: !898, size: 32, align: 32, offset: 8416)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "flat_dc", scope: !981, file: !980, line: 65, baseType: !898, size: 32, align: 32, offset: 8448)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "predicted_dc", scope: !981, file: !980, line: 66, baseType: !898, size: 32, align: 32, offset: 8480)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "raw_orient", scope: !981, file: !980, line: 67, baseType: !898, size: 32, align: 32, offset: 8512)
