; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mjpegdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mjpegdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVProfile = type { i32, i8* }
%struct.AVCodecHWConfigInternal = type { %struct.AVCodecHWConfig, %struct.AVHWAccel* }
%struct.AVCodecHWConfig = type { i32, i32, i32 }
%struct.AVHWAccel = type { i8*, i32, i32, i32, i32, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, i8*, i32)*, i32 (%struct.AVCodecContext*, i32, i8*, i32)*, i32 (%struct.AVCodecContext*, i8*, i32)*, {}*, i32, void (%struct.MpegEncContext*)*, {}*, {}*, i32, i32, i32 (%struct.AVCodecContext*, %struct.AVBufferRef*)* }

!950 = !{!951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014}
!951 = !DIEnumerator(name: "SOF0", value: 192)
!952 = !DIEnumerator(name: "SOF1", value: 193)
!953 = !DIEnumerator(name: "SOF2", value: 194)
!954 = !DIEnumerator(name: "SOF3", value: 195)
!955 = !DIEnumerator(name: "SOF5", value: 197)
!956 = !DIEnumerator(name: "SOF6", value: 198)
!957 = !DIEnumerator(name: "SOF7", value: 199)
!958 = !DIEnumerator(name: "JPG", value: 200)
!959 = !DIEnumerator(name: "SOF9", value: 201)
!960 = !DIEnumerator(name: "SOF10", value: 202)
!961 = !DIEnumerator(name: "SOF11", value: 203)
!962 = !DIEnumerator(name: "SOF13", value: 205)
!963 = !DIEnumerator(name: "SOF14", value: 206)
!964 = !DIEnumerator(name: "SOF15", value: 207)
!965 = !DIEnumerator(name: "DHT", value: 196)
!966 = !DIEnumerator(name: "DAC", value: 204)
!967 = !DIEnumerator(name: "RST0", value: 208)
!968 = !DIEnumerator(name: "RST1", value: 209)
!969 = !DIEnumerator(name: "RST2", value: 210)
!970 = !DIEnumerator(name: "RST3", value: 211)
!971 = !DIEnumerator(name: "RST4", value: 212)
!972 = !DIEnumerator(name: "RST5", value: 213)
!973 = !DIEnumerator(name: "RST6", value: 214)
!974 = !DIEnumerator(name: "RST7", value: 215)
!975 = !DIEnumerator(name: "SOI", value: 216)
!976 = !DIEnumerator(name: "EOI", value: 217)
!977 = !DIEnumerator(name: "SOS", value: 218)
!978 = !DIEnumerator(name: "DQT", value: 219)
!979 = !DIEnumerator(name: "DNL", value: 220)
!980 = !DIEnumerator(name: "DRI", value: 221)
!981 = !DIEnumerator(name: "DHP", value: 222)
!982 = !DIEnumerator(name: "EXP", value: 223)
!983 = !DIEnumerator(name: "APP0", value: 224)
!984 = !DIEnumerator(name: "APP1", value: 225)
!985 = !DIEnumerator(name: "APP2", value: 226)
!986 = !DIEnumerator(name: "APP3", value: 227)
!987 = !DIEnumerator(name: "APP4", value: 228)
!988 = !DIEnumerator(name: "APP5", value: 229)
!989 = !DIEnumerator(name: "APP6", value: 230)
!990 = !DIEnumerator(name: "APP7", value: 231)
!991 = !DIEnumerator(name: "APP8", value: 232)
!992 = !DIEnumerator(name: "APP9", value: 233)
!993 = !DIEnumerator(name: "APP10", value: 234)
!994 = !DIEnumerator(name: "APP11", value: 235)
!995 = !DIEnumerator(name: "APP12", value: 236)
!996 = !DIEnumerator(name: "APP13", value: 237)
!997 = !DIEnumerator(name: "APP14", value: 238)
!998 = !DIEnumerator(name: "APP15", value: 239)
!999 = !DIEnumerator(name: "JPG0", value: 240)
!1000 = !DIEnumerator(name: "JPG1", value: 241)
!1001 = !DIEnumerator(name: "JPG2", value: 242)
!1002 = !DIEnumerator(name: "JPG3", value: 243)
!1003 = !DIEnumerator(name: "JPG4", value: 244)
!1004 = !DIEnumerator(name: "JPG5", value: 245)
!1005 = !DIEnumerator(name: "JPG6", value: 246)
!1006 = !DIEnumerator(name: "SOF48", value: 247)
!1007 = !DIEnumerator(name: "LSE", value: 248)
!1008 = !DIEnumerator(name: "JPG9", value: 249)
!1009 = !DIEnumerator(name: "JPG10", value: 250)
!1010 = !DIEnumerator(name: "JPG11", value: 251)
!1011 = !DIEnumerator(name: "JPG12", value: 252)
!1012 = !DIEnumerator(name: "JPG13", value: 253)
!1013 = !DIEnumerator(name: "COM", value: 254)
!1014 = !DIEnumerator(name: "TEM", value: 1)
!1015 = !{!1016, !1025, !1024, !1026, !1027, !1030, !1033, !1031, !1022, !1139, !1140, !1145, !1146}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1019, line: 221, size: 32, align: 8, elements: !1020)
!1019 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1020 = !{!1021}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1018, file: !1019, line: 221, baseType: !1022, size: 32, align: 32)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1023, line: 51, baseType: !1024)
!1023 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1024 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1025 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1023, line: 49, baseType: !1029)
!1029 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1023, line: 48, baseType: !1032)
!1032 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1036)
!1036 = !{!1037, !1041, !1043, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1058, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1091, !1093, !1094, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1127, !1128, !1129, !1130, !1131, !1132, !1135, !1136, !1137, !1138}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1035, file: !780, line: 282, baseType: !1038, size: 512, align: 64)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1030, size: 512, align: 64, elements: !1039)
!1039 = !{!1040}
!1040 = !DISubrange(count: 8)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1035, file: !780, line: 299, baseType: !1042, size: 256, align: 32, offset: 512)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 256, align: 32, elements: !1039)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1035, file: !780, line: 315, baseType: !1044, size: 64, align: 64, offset: 768)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1035, file: !780, line: 326, baseType: !1025, size: 32, align: 32, offset: 832)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1035, file: !780, line: 326, baseType: !1025, size: 32, align: 32, offset: 864)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1035, file: !780, line: 334, baseType: !1025, size: 32, align: 32, offset: 896)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1035, file: !780, line: 341, baseType: !1025, size: 32, align: 32, offset: 928)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1035, file: !780, line: 346, baseType: !1025, size: 32, align: 32, offset: 960)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1035, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1035, file: !780, line: 356, baseType: !1052, size: 64, align: 32, offset: 1024)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1053, line: 61, baseType: !1054)
!1053 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1053, line: 58, size: 64, align: 32, elements: !1055)
!1055 = !{!1056, !1057}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1054, file: !1053, line: 59, baseType: !1025, size: 32, align: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1054, file: !1053, line: 60, baseType: !1025, size: 32, align: 32, offset: 32)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1035, file: !780, line: 361, baseType: !1059, size: 64, align: 64, offset: 1088)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1023, line: 40, baseType: !1060)
!1060 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1035, file: !780, line: 369, baseType: !1059, size: 64, align: 64, offset: 1152)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1035, file: !780, line: 377, baseType: !1059, size: 64, align: 64, offset: 1216)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1035, file: !780, line: 382, baseType: !1025, size: 32, align: 32, offset: 1280)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1035, file: !780, line: 386, baseType: !1025, size: 32, align: 32, offset: 1312)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1035, file: !780, line: 391, baseType: !1025, size: 32, align: 32, offset: 1344)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1035, file: !780, line: 396, baseType: !1026, size: 64, align: 64, offset: 1408)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1035, file: !780, line: 403, baseType: !1068, size: 512, align: 64, offset: 1472)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1069, size: 512, align: 64, elements: !1039)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1023, line: 55, baseType: !1070)
!1070 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1035, file: !780, line: 410, baseType: !1025, size: 32, align: 32, offset: 1984)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1035, file: !780, line: 415, baseType: !1025, size: 32, align: 32, offset: 2016)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1035, file: !780, line: 420, baseType: !1025, size: 32, align: 32, offset: 2048)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1035, file: !780, line: 425, baseType: !1025, size: 32, align: 32, offset: 2080)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1035, file: !780, line: 435, baseType: !1059, size: 64, align: 64, offset: 2112)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1035, file: !780, line: 440, baseType: !1025, size: 32, align: 32, offset: 2176)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1035, file: !780, line: 445, baseType: !1069, size: 64, align: 64, offset: 2240)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1035, file: !780, line: 459, baseType: !1079, size: 512, align: 64, offset: 2304)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1080, size: 512, align: 64, elements: !1039)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1082, line: 94, baseType: !1083)
!1082 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1082, line: 81, size: 192, align: 64, elements: !1084)
!1084 = !{!1085, !1089, !1090}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1083, file: !1082, line: 82, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1082, line: 73, baseType: !1088)
!1088 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1082, line: 73, flags: DIFlagFwdDecl)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1083, file: !1082, line: 89, baseType: !1030, size: 64, align: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1083, file: !1082, line: 93, baseType: !1025, size: 32, align: 32, offset: 128)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1035, file: !780, line: 473, baseType: !1092, size: 64, align: 64, offset: 2816)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1035, file: !780, line: 477, baseType: !1025, size: 32, align: 32, offset: 2880)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1035, file: !780, line: 479, baseType: !1095, size: 64, align: 64, offset: 2944)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1099)
!1099 = !{!1100, !1101, !1102, !1103, !1108}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1098, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1098, file: !780, line: 203, baseType: !1030, size: 64, align: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1098, file: !780, line: 204, baseType: !1025, size: 32, align: 32, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1098, file: !780, line: 205, baseType: !1104, size: 64, align: 64, offset: 192)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1106, line: 86, baseType: !1107)
!1106 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1107 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1106, line: 86, flags: DIFlagFwdDecl)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1098, file: !780, line: 206, baseType: !1080, size: 64, align: 64, offset: 256)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1035, file: !780, line: 480, baseType: !1025, size: 32, align: 32, offset: 3008)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1035, file: !780, line: 505, baseType: !1025, size: 32, align: 32, offset: 3040)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1035, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1035, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1035, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1035, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1035, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1035, file: !780, line: 532, baseType: !1059, size: 64, align: 64, offset: 3264)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1035, file: !780, line: 539, baseType: !1059, size: 64, align: 64, offset: 3328)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1035, file: !780, line: 547, baseType: !1059, size: 64, align: 64, offset: 3392)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1035, file: !780, line: 554, baseType: !1104, size: 64, align: 64, offset: 3456)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1035, file: !780, line: 563, baseType: !1025, size: 32, align: 32, offset: 3520)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1035, file: !780, line: 572, baseType: !1025, size: 32, align: 32, offset: 3552)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1035, file: !780, line: 581, baseType: !1025, size: 32, align: 32, offset: 3584)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1035, file: !780, line: 588, baseType: !1124, size: 64, align: 64, offset: 3648)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1023, line: 36, baseType: !1126)
!1126 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1035, file: !780, line: 593, baseType: !1025, size: 32, align: 32, offset: 3712)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1035, file: !780, line: 596, baseType: !1025, size: 32, align: 32, offset: 3744)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1035, file: !780, line: 599, baseType: !1080, size: 64, align: 64, offset: 3776)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1035, file: !780, line: 605, baseType: !1080, size: 64, align: 64, offset: 3840)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1035, file: !780, line: 616, baseType: !1080, size: 64, align: 64, offset: 3904)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1035, file: !780, line: 626, baseType: !1133, size: 64, align: 64, offset: 3968)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1134, line: 216, baseType: !1070)
!1134 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1035, file: !780, line: 627, baseType: !1133, size: 64, align: 64, offset: 4032)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1035, file: !780, line: 628, baseType: !1133, size: 64, align: 64, offset: 4096)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1035, file: !780, line: 629, baseType: !1133, size: 64, align: 64, offset: 4160)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1035, file: !780, line: 645, baseType: !1080, size: 64, align: 64, offset: 4224)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1142)
!1142 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !1019, line: 222, size: 16, align: 8, elements: !1143)
!1143 = !{!1144}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1142, file: !1019, line: 222, baseType: !1028, size: 16, align: 16)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1148 = !{!1149, !1810, !1811, !2063, !2064}
!1149 = distinct !DIGlobalVariable(name: "ff_mjpeg_decoder", scope: !0, file: !1150, line: 2801, type: !1151, isLocal: false, isDefinition: true, variable: { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }* @ff_mjpeg_decoder)
!1150 = !DIFile(filename: "libavcodec/mjpegdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !57, line: 3610, baseType: !1152)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1153)
!1153 = !{!1154, !1158, !1159, !1160, !1161, !1162, !1165, !1168, !1171, !1174, !1177, !1178, !1251, !1259, !1260, !1261, !1263, !1712, !1718, !1726, !1730, !1731, !1768, !1772, !1776, !1777, !1781, !1785, !1786, !1790, !1791, !1792}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1152, file: !57, line: 3475, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1157)
!1157 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1152, file: !57, line: 3480, baseType: !1155, size: 64, align: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1152, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1152, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1152, file: !57, line: 3487, baseType: !1025, size: 32, align: 32, offset: 192)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1152, file: !57, line: 3488, baseType: !1163, size: 64, align: 64, offset: 256)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1152, file: !57, line: 3489, baseType: !1166, size: 64, align: 64, offset: 320)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1152, file: !57, line: 3490, baseType: !1169, size: 64, align: 64, offset: 384)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1025)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1152, file: !57, line: 3491, baseType: !1172, size: 64, align: 64, offset: 448)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1152, file: !57, line: 3492, baseType: !1175, size: 64, align: 64, offset: 512)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1069)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1152, file: !57, line: 3493, baseType: !1031, size: 8, align: 8, offset: 576)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1152, file: !57, line: 3494, baseType: !1179, size: 64, align: 64, offset: 640)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1181)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !1182)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !1183)
!1183 = !{!1184, !1185, !1189, !1210, !1211, !1212, !1213, !1217, !1223, !1225, !1229}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1182, file: !26, line: 72, baseType: !1155, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1182, file: !26, line: 78, baseType: !1186, size: 64, align: 64, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!1155, !1026}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1182, file: !26, line: 85, baseType: !1190, size: 64, align: 64, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1192)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !1193)
!1193 = !{!1194, !1195, !1196, !1197, !1198, !1206, !1207, !1208, !1209}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1192, file: !4, line: 247, baseType: !1155, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1192, file: !4, line: 253, baseType: !1155, size: 64, align: 64, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1192, file: !4, line: 259, baseType: !1025, size: 32, align: 32, offset: 128)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1192, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1192, file: !4, line: 271, baseType: !1199, size: 64, align: 64, offset: 192)
!1199 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1192, file: !4, line: 265, size: 64, align: 64, elements: !1200)
!1200 = !{!1201, !1202, !1204, !1205}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1199, file: !4, line: 266, baseType: !1059, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1199, file: !4, line: 267, baseType: !1203, size: 64, align: 64)
!1203 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1199, file: !4, line: 268, baseType: !1155, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1199, file: !4, line: 270, baseType: !1052, size: 64, align: 32)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1192, file: !4, line: 272, baseType: !1203, size: 64, align: 64, offset: 256)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1192, file: !4, line: 273, baseType: !1203, size: 64, align: 64, offset: 320)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1192, file: !4, line: 275, baseType: !1025, size: 32, align: 32, offset: 384)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1192, file: !4, line: 300, baseType: !1155, size: 64, align: 64, offset: 448)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1182, file: !26, line: 93, baseType: !1025, size: 32, align: 32, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1182, file: !26, line: 99, baseType: !1025, size: 32, align: 32, offset: 224)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1182, file: !26, line: 108, baseType: !1025, size: 32, align: 32, offset: 256)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1182, file: !26, line: 113, baseType: !1214, size: 64, align: 64, offset: 320)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!1026, !1026, !1026}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1182, file: !26, line: 123, baseType: !1218, size: 64, align: 64, offset: 384)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!1221, !1221}
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1182)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1182, file: !26, line: 130, baseType: !1224, size: 32, align: 32, offset: 448)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1182, file: !26, line: 136, baseType: !1226, size: 64, align: 64, offset: 512)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!1224, !1026}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1182, file: !26, line: 142, baseType: !1230, size: 64, align: 64, offset: 576)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!1025, !1233, !1026, !1155, !1025}
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1236)
!1236 = !{!1237, !1249, !1250}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1235, file: !4, line: 360, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1241)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1242)
!1242 = !{!1243, !1244, !1245, !1246, !1247, !1248}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1241, file: !4, line: 307, baseType: !1155, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1241, file: !4, line: 313, baseType: !1203, size: 64, align: 64, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1241, file: !4, line: 313, baseType: !1203, size: 64, align: 64, offset: 128)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1241, file: !4, line: 318, baseType: !1203, size: 64, align: 64, offset: 192)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1241, file: !4, line: 318, baseType: !1203, size: 64, align: 64, offset: 256)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1241, file: !4, line: 323, baseType: !1025, size: 32, align: 32, offset: 320)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1235, file: !4, line: 364, baseType: !1025, size: 32, align: 32, offset: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1235, file: !4, line: 368, baseType: !1025, size: 32, align: 32, offset: 96)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1152, file: !57, line: 3495, baseType: !1252, size: 64, align: 64, offset: 704)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1254)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1255)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1256)
!1256 = !{!1257, !1258}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1255, file: !57, line: 3402, baseType: !1025, size: 32, align: 32)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1255, file: !57, line: 3403, baseType: !1155, size: 64, align: 64, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1152, file: !57, line: 3507, baseType: !1155, size: 64, align: 64, offset: 768)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1152, file: !57, line: 3516, baseType: !1025, size: 32, align: 32, offset: 832)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1152, file: !57, line: 3517, baseType: !1262, size: 64, align: 64, offset: 896)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1152, file: !57, line: 3527, baseType: !1264, size: 64, align: 64, offset: 960)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!1025, !1267}
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1269)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1270)
!1270 = !{!1271, !1272, !1273, !1274, !1277, !1278, !1279, !1280, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1463, !1467, !1468, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1650, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1269, file: !57, line: 1561, baseType: !1179, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1269, file: !57, line: 1562, baseType: !1025, size: 32, align: 32, offset: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1269, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1269, file: !57, line: 1565, baseType: !1275, size: 64, align: 64, offset: 128)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1152)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1269, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1269, file: !57, line: 1581, baseType: !1024, size: 32, align: 32, offset: 224)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1269, file: !57, line: 1583, baseType: !1026, size: 64, align: 64, offset: 256)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1269, file: !57, line: 1591, baseType: !1281, size: 64, align: 64, offset: 320)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1283, line: 129, size: 1664, align: 64, elements: !1284)
!1283 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1284 = !{!1285, !1286, !1287, !1288, !1289, !1310, !1311, !1340, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1282, file: !1283, line: 136, baseType: !1025, size: 32, align: 32)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1282, file: !1283, line: 151, baseType: !1025, size: 32, align: 32, offset: 32)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1282, file: !1283, line: 157, baseType: !1025, size: 32, align: 32, offset: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1282, file: !1283, line: 159, baseType: !1033, size: 64, align: 64, offset: 128)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1282, file: !1283, line: 161, baseType: !1290, size: 64, align: 64, offset: 192)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1283, line: 117, baseType: !1292)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1283, line: 100, size: 832, align: 64, elements: !1293)
!1293 = !{!1294, !1301, !1302, !1303, !1304, !1305, !1307, !1308, !1309}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1292, file: !1283, line: 105, baseType: !1295, size: 256, align: 64)
!1295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1296, size: 256, align: 64, elements: !1299)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1082, line: 238, baseType: !1298)
!1298 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1082, line: 238, flags: DIFlagFwdDecl)
!1299 = !{!1300}
!1300 = !DISubrange(count: 4)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1292, file: !1283, line: 110, baseType: !1025, size: 32, align: 32, offset: 256)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1292, file: !1283, line: 111, baseType: !1025, size: 32, align: 32, offset: 288)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1292, file: !1283, line: 111, baseType: !1025, size: 32, align: 32, offset: 320)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1292, file: !1283, line: 112, baseType: !1042, size: 256, align: 32, offset: 352)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1292, file: !1283, line: 113, baseType: !1306, size: 128, align: 32, offset: 608)
!1306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 128, align: 32, elements: !1299)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1292, file: !1283, line: 114, baseType: !1025, size: 32, align: 32, offset: 736)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1292, file: !1283, line: 115, baseType: !1025, size: 32, align: 32, offset: 768)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1292, file: !1283, line: 116, baseType: !1025, size: 32, align: 32, offset: 800)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1282, file: !1283, line: 163, baseType: !1026, size: 64, align: 64, offset: 256)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1282, file: !1283, line: 165, baseType: !1312, size: 128, align: 64, offset: 320)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1283, line: 122, baseType: !1313)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1283, line: 119, size: 128, align: 64, elements: !1314)
!1314 = !{!1315, !1339}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1313, file: !1283, line: 120, baseType: !1316, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1318)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1319)
!1319 = !{!1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1335, !1336, !1337, !1338}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1318, file: !57, line: 1451, baseType: !1080, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1318, file: !57, line: 1461, baseType: !1059, size: 64, align: 64, offset: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1318, file: !57, line: 1467, baseType: !1059, size: 64, align: 64, offset: 128)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1318, file: !57, line: 1468, baseType: !1030, size: 64, align: 64, offset: 192)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1318, file: !57, line: 1469, baseType: !1025, size: 32, align: 32, offset: 256)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1318, file: !57, line: 1470, baseType: !1025, size: 32, align: 32, offset: 288)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1318, file: !57, line: 1474, baseType: !1025, size: 32, align: 32, offset: 320)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1318, file: !57, line: 1479, baseType: !1328, size: 64, align: 64, offset: 384)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1330)
!1330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1331)
!1331 = !{!1332, !1333, !1334}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1330, file: !57, line: 1412, baseType: !1030, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1330, file: !57, line: 1413, baseType: !1025, size: 32, align: 32, offset: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1330, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1318, file: !57, line: 1480, baseType: !1025, size: 32, align: 32, offset: 448)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1318, file: !57, line: 1486, baseType: !1059, size: 64, align: 64, offset: 512)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1318, file: !57, line: 1488, baseType: !1059, size: 64, align: 64, offset: 576)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1318, file: !57, line: 1497, baseType: !1059, size: 64, align: 64, offset: 640)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1313, file: !1283, line: 121, baseType: !1033, size: 64, align: 64, offset: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1282, file: !1283, line: 166, baseType: !1341, size: 128, align: 64, offset: 448)
!1341 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1283, line: 127, baseType: !1342)
!1342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1283, line: 124, size: 128, align: 64, elements: !1343)
!1343 = !{!1344, !1417}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1342, file: !1283, line: 125, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1348)
!1348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1349)
!1349 = !{!1350, !1351, !1375, !1379, !1380, !1414, !1415, !1416}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1348, file: !57, line: 5751, baseType: !1179, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1348, file: !57, line: 5756, baseType: !1352, size: 64, align: 64, offset: 64)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1354)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1355)
!1355 = !{!1356, !1357, !1360, !1361, !1362, !1366, !1370, !1374}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1354, file: !57, line: 5797, baseType: !1155, size: 64, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1354, file: !57, line: 5804, baseType: !1358, size: 64, align: 64, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1354, file: !57, line: 5815, baseType: !1179, size: 64, align: 64, offset: 128)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1354, file: !57, line: 5825, baseType: !1025, size: 32, align: 32, offset: 192)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1354, file: !57, line: 5826, baseType: !1363, size: 64, align: 64, offset: 256)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DISubroutineType(types: !1365)
!1365 = !{!1025, !1346}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1354, file: !57, line: 5827, baseType: !1367, size: 64, align: 64, offset: 320)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DISubroutineType(types: !1369)
!1369 = !{!1025, !1346, !1316}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1354, file: !57, line: 5828, baseType: !1371, size: 64, align: 64, offset: 384)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DISubroutineType(types: !1373)
!1373 = !{null, !1346}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1354, file: !57, line: 5829, baseType: !1371, size: 64, align: 64, offset: 448)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1348, file: !57, line: 5762, baseType: !1376, size: 64, align: 64, offset: 128)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1378)
!1378 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1348, file: !57, line: 5768, baseType: !1026, size: 64, align: 64, offset: 192)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1348, file: !57, line: 5775, baseType: !1381, size: 64, align: 64, offset: 256)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1383)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1384)
!1384 = !{!1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1383, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1383, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1383, file: !57, line: 3948, baseType: !1022, size: 32, align: 32, offset: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1383, file: !57, line: 3958, baseType: !1030, size: 64, align: 64, offset: 128)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1383, file: !57, line: 3962, baseType: !1025, size: 32, align: 32, offset: 192)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1383, file: !57, line: 3968, baseType: !1025, size: 32, align: 32, offset: 224)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1383, file: !57, line: 3973, baseType: !1059, size: 64, align: 64, offset: 256)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1383, file: !57, line: 3986, baseType: !1025, size: 32, align: 32, offset: 320)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1383, file: !57, line: 3999, baseType: !1025, size: 32, align: 32, offset: 352)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1383, file: !57, line: 4004, baseType: !1025, size: 32, align: 32, offset: 384)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1383, file: !57, line: 4005, baseType: !1025, size: 32, align: 32, offset: 416)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1383, file: !57, line: 4010, baseType: !1025, size: 32, align: 32, offset: 448)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1383, file: !57, line: 4011, baseType: !1025, size: 32, align: 32, offset: 480)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1383, file: !57, line: 4020, baseType: !1052, size: 64, align: 32, offset: 512)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1383, file: !57, line: 4025, baseType: !894, size: 32, align: 32, offset: 576)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1383, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1383, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1383, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1383, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1383, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1383, file: !57, line: 4039, baseType: !1025, size: 32, align: 32, offset: 768)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1383, file: !57, line: 4046, baseType: !1069, size: 64, align: 64, offset: 832)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1383, file: !57, line: 4050, baseType: !1025, size: 32, align: 32, offset: 896)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1383, file: !57, line: 4054, baseType: !1025, size: 32, align: 32, offset: 928)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1383, file: !57, line: 4061, baseType: !1025, size: 32, align: 32, offset: 960)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1383, file: !57, line: 4065, baseType: !1025, size: 32, align: 32, offset: 992)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1383, file: !57, line: 4073, baseType: !1025, size: 32, align: 32, offset: 1024)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1383, file: !57, line: 4080, baseType: !1025, size: 32, align: 32, offset: 1056)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1383, file: !57, line: 4084, baseType: !1025, size: 32, align: 32, offset: 1088)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1348, file: !57, line: 5781, baseType: !1381, size: 64, align: 64, offset: 320)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1348, file: !57, line: 5787, baseType: !1052, size: 64, align: 32, offset: 384)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1348, file: !57, line: 5793, baseType: !1052, size: 64, align: 32, offset: 448)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1342, file: !1283, line: 126, baseType: !1025, size: 32, align: 32, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1282, file: !1283, line: 172, baseType: !1316, size: 64, align: 64, offset: 576)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1282, file: !1283, line: 177, baseType: !1030, size: 64, align: 64, offset: 640)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1282, file: !1283, line: 178, baseType: !1024, size: 32, align: 32, offset: 704)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1282, file: !1283, line: 180, baseType: !1026, size: 64, align: 64, offset: 768)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1282, file: !1283, line: 185, baseType: !1025, size: 32, align: 32, offset: 832)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1282, file: !1283, line: 190, baseType: !1026, size: 64, align: 64, offset: 896)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1282, file: !1283, line: 195, baseType: !1025, size: 32, align: 32, offset: 960)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1282, file: !1283, line: 200, baseType: !1316, size: 64, align: 64, offset: 1024)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1282, file: !1283, line: 201, baseType: !1025, size: 32, align: 32, offset: 1088)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1282, file: !1283, line: 202, baseType: !1033, size: 64, align: 64, offset: 1152)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1282, file: !1283, line: 203, baseType: !1025, size: 32, align: 32, offset: 1216)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1282, file: !1283, line: 205, baseType: !1025, size: 32, align: 32, offset: 1248)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1282, file: !1283, line: 206, baseType: !1025, size: 32, align: 32, offset: 1280)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1282, file: !1283, line: 209, baseType: !1133, size: 64, align: 64, offset: 1344)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1282, file: !1283, line: 212, baseType: !1133, size: 64, align: 64, offset: 1408)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1282, file: !1283, line: 213, baseType: !1033, size: 64, align: 64, offset: 1472)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1282, file: !1283, line: 215, baseType: !1025, size: 32, align: 32, offset: 1536)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1282, file: !1283, line: 217, baseType: !1025, size: 32, align: 32, offset: 1568)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1282, file: !1283, line: 220, baseType: !1025, size: 32, align: 32, offset: 1600)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1269, file: !57, line: 1598, baseType: !1026, size: 64, align: 64, offset: 384)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1269, file: !57, line: 1606, baseType: !1059, size: 64, align: 64, offset: 448)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1269, file: !57, line: 1614, baseType: !1025, size: 32, align: 32, offset: 512)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1269, file: !57, line: 1622, baseType: !1025, size: 32, align: 32, offset: 544)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1269, file: !57, line: 1628, baseType: !1025, size: 32, align: 32, offset: 576)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1269, file: !57, line: 1636, baseType: !1025, size: 32, align: 32, offset: 608)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1269, file: !57, line: 1643, baseType: !1025, size: 32, align: 32, offset: 640)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1269, file: !57, line: 1657, baseType: !1030, size: 64, align: 64, offset: 704)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1269, file: !57, line: 1658, baseType: !1025, size: 32, align: 32, offset: 768)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1269, file: !57, line: 1679, baseType: !1052, size: 64, align: 32, offset: 800)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1269, file: !57, line: 1688, baseType: !1025, size: 32, align: 32, offset: 864)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1269, file: !57, line: 1712, baseType: !1025, size: 32, align: 32, offset: 896)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1269, file: !57, line: 1729, baseType: !1025, size: 32, align: 32, offset: 928)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1269, file: !57, line: 1729, baseType: !1025, size: 32, align: 32, offset: 960)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1269, file: !57, line: 1744, baseType: !1025, size: 32, align: 32, offset: 992)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1269, file: !57, line: 1744, baseType: !1025, size: 32, align: 32, offset: 1024)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1269, file: !57, line: 1751, baseType: !1025, size: 32, align: 32, offset: 1056)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1269, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1269, file: !57, line: 1791, baseType: !1456, size: 64, align: 64, offset: 1152)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DISubroutineType(types: !1458)
!1458 = !{null, !1459, !1460, !1462, !1025, !1025, !1025}
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1034)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1269, file: !57, line: 1808, baseType: !1464, size: 64, align: 64, offset: 1216)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DISubroutineType(types: !1466)
!1466 = !{!516, !1459, !1166}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1269, file: !57, line: 1816, baseType: !1025, size: 32, align: 32, offset: 1280)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1269, file: !57, line: 1825, baseType: !1469, size: 32, align: 32, offset: 1312)
!1469 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1269, file: !57, line: 1830, baseType: !1025, size: 32, align: 32, offset: 1344)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1269, file: !57, line: 1838, baseType: !1469, size: 32, align: 32, offset: 1376)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1269, file: !57, line: 1846, baseType: !1025, size: 32, align: 32, offset: 1408)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1269, file: !57, line: 1851, baseType: !1025, size: 32, align: 32, offset: 1440)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1269, file: !57, line: 1861, baseType: !1469, size: 32, align: 32, offset: 1472)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1269, file: !57, line: 1868, baseType: !1469, size: 32, align: 32, offset: 1504)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1269, file: !57, line: 1875, baseType: !1469, size: 32, align: 32, offset: 1536)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1269, file: !57, line: 1882, baseType: !1469, size: 32, align: 32, offset: 1568)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1269, file: !57, line: 1889, baseType: !1469, size: 32, align: 32, offset: 1600)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1269, file: !57, line: 1896, baseType: !1469, size: 32, align: 32, offset: 1632)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1269, file: !57, line: 1903, baseType: !1469, size: 32, align: 32, offset: 1664)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1269, file: !57, line: 1910, baseType: !1025, size: 32, align: 32, offset: 1696)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1269, file: !57, line: 1915, baseType: !1025, size: 32, align: 32, offset: 1728)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1269, file: !57, line: 1926, baseType: !1462, size: 64, align: 64, offset: 1792)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1269, file: !57, line: 1935, baseType: !1052, size: 64, align: 32, offset: 1856)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1269, file: !57, line: 1942, baseType: !1025, size: 32, align: 32, offset: 1920)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1269, file: !57, line: 1948, baseType: !1025, size: 32, align: 32, offset: 1952)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1269, file: !57, line: 1954, baseType: !1025, size: 32, align: 32, offset: 1984)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1269, file: !57, line: 1960, baseType: !1025, size: 32, align: 32, offset: 2016)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1269, file: !57, line: 1984, baseType: !1025, size: 32, align: 32, offset: 2048)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1269, file: !57, line: 1991, baseType: !1025, size: 32, align: 32, offset: 2080)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1269, file: !57, line: 1996, baseType: !1025, size: 32, align: 32, offset: 2112)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1269, file: !57, line: 2004, baseType: !1025, size: 32, align: 32, offset: 2144)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1269, file: !57, line: 2011, baseType: !1025, size: 32, align: 32, offset: 2176)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1269, file: !57, line: 2018, baseType: !1025, size: 32, align: 32, offset: 2208)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1269, file: !57, line: 2027, baseType: !1025, size: 32, align: 32, offset: 2240)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1269, file: !57, line: 2034, baseType: !1025, size: 32, align: 32, offset: 2272)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1269, file: !57, line: 2044, baseType: !1025, size: 32, align: 32, offset: 2304)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1269, file: !57, line: 2054, baseType: !1027, size: 64, align: 64, offset: 2368)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1269, file: !57, line: 2061, baseType: !1027, size: 64, align: 64, offset: 2432)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1269, file: !57, line: 2066, baseType: !1025, size: 32, align: 32, offset: 2496)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1269, file: !57, line: 2070, baseType: !1025, size: 32, align: 32, offset: 2528)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1269, file: !57, line: 2078, baseType: !1025, size: 32, align: 32, offset: 2560)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1269, file: !57, line: 2085, baseType: !1025, size: 32, align: 32, offset: 2592)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1269, file: !57, line: 2092, baseType: !1025, size: 32, align: 32, offset: 2624)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1269, file: !57, line: 2099, baseType: !1025, size: 32, align: 32, offset: 2656)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1269, file: !57, line: 2106, baseType: !1025, size: 32, align: 32, offset: 2688)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1269, file: !57, line: 2113, baseType: !1025, size: 32, align: 32, offset: 2720)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1269, file: !57, line: 2120, baseType: !1025, size: 32, align: 32, offset: 2752)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1269, file: !57, line: 2125, baseType: !1025, size: 32, align: 32, offset: 2784)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1269, file: !57, line: 2133, baseType: !1025, size: 32, align: 32, offset: 2816)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1269, file: !57, line: 2140, baseType: !1025, size: 32, align: 32, offset: 2848)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1269, file: !57, line: 2145, baseType: !1025, size: 32, align: 32, offset: 2880)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1269, file: !57, line: 2153, baseType: !1025, size: 32, align: 32, offset: 2912)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1269, file: !57, line: 2158, baseType: !1025, size: 32, align: 32, offset: 2944)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1269, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1269, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1269, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1269, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1269, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1269, file: !57, line: 2203, baseType: !1025, size: 32, align: 32, offset: 3136)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1269, file: !57, line: 2209, baseType: !894, size: 32, align: 32, offset: 3168)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1269, file: !57, line: 2212, baseType: !1025, size: 32, align: 32, offset: 3200)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1269, file: !57, line: 2213, baseType: !1025, size: 32, align: 32, offset: 3232)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1269, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1269, file: !57, line: 2232, baseType: !1025, size: 32, align: 32, offset: 3296)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1269, file: !57, line: 2243, baseType: !1025, size: 32, align: 32, offset: 3328)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1269, file: !57, line: 2249, baseType: !1025, size: 32, align: 32, offset: 3360)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1269, file: !57, line: 2256, baseType: !1025, size: 32, align: 32, offset: 3392)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1269, file: !57, line: 2263, baseType: !1069, size: 64, align: 64, offset: 3456)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1269, file: !57, line: 2270, baseType: !1069, size: 64, align: 64, offset: 3520)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1269, file: !57, line: 2277, baseType: !902, size: 32, align: 32, offset: 3584)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1269, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1269, file: !57, line: 2367, baseType: !1534, size: 64, align: 64, offset: 3648)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{!1025, !1459, !1033, !1025}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1269, file: !57, line: 2383, baseType: !1025, size: 32, align: 32, offset: 3712)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1269, file: !57, line: 2386, baseType: !1469, size: 32, align: 32, offset: 3744)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1269, file: !57, line: 2387, baseType: !1469, size: 32, align: 32, offset: 3776)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1269, file: !57, line: 2394, baseType: !1025, size: 32, align: 32, offset: 3808)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1269, file: !57, line: 2401, baseType: !1025, size: 32, align: 32, offset: 3840)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1269, file: !57, line: 2408, baseType: !1025, size: 32, align: 32, offset: 3872)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1269, file: !57, line: 2415, baseType: !1025, size: 32, align: 32, offset: 3904)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1269, file: !57, line: 2422, baseType: !1025, size: 32, align: 32, offset: 3936)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1269, file: !57, line: 2423, baseType: !1546, size: 64, align: 64, offset: 3968)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1548)
!1548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1549)
!1549 = !{!1550, !1551, !1552, !1553}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1548, file: !57, line: 827, baseType: !1025, size: 32, align: 32)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1548, file: !57, line: 828, baseType: !1025, size: 32, align: 32, offset: 32)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1548, file: !57, line: 829, baseType: !1025, size: 32, align: 32, offset: 64)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1548, file: !57, line: 830, baseType: !1469, size: 32, align: 32, offset: 96)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1269, file: !57, line: 2430, baseType: !1059, size: 64, align: 64, offset: 4032)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1269, file: !57, line: 2437, baseType: !1059, size: 64, align: 64, offset: 4096)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1269, file: !57, line: 2444, baseType: !1469, size: 32, align: 32, offset: 4160)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1269, file: !57, line: 2451, baseType: !1469, size: 32, align: 32, offset: 4192)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1269, file: !57, line: 2458, baseType: !1025, size: 32, align: 32, offset: 4224)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1269, file: !57, line: 2469, baseType: !1025, size: 32, align: 32, offset: 4256)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1269, file: !57, line: 2475, baseType: !1025, size: 32, align: 32, offset: 4288)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1269, file: !57, line: 2481, baseType: !1025, size: 32, align: 32, offset: 4320)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1269, file: !57, line: 2485, baseType: !1025, size: 32, align: 32, offset: 4352)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1269, file: !57, line: 2489, baseType: !1025, size: 32, align: 32, offset: 4384)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1269, file: !57, line: 2493, baseType: !1025, size: 32, align: 32, offset: 4416)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1269, file: !57, line: 2501, baseType: !1025, size: 32, align: 32, offset: 4448)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1269, file: !57, line: 2506, baseType: !1025, size: 32, align: 32, offset: 4480)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1269, file: !57, line: 2510, baseType: !1025, size: 32, align: 32, offset: 4512)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1269, file: !57, line: 2514, baseType: !1059, size: 64, align: 64, offset: 4544)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1269, file: !57, line: 2528, baseType: !1570, size: 64, align: 64, offset: 4608)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DISubroutineType(types: !1572)
!1572 = !{null, !1459, !1026, !1025, !1025}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1269, file: !57, line: 2534, baseType: !1025, size: 32, align: 32, offset: 4672)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1269, file: !57, line: 2545, baseType: !1025, size: 32, align: 32, offset: 4704)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1269, file: !57, line: 2547, baseType: !1025, size: 32, align: 32, offset: 4736)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1269, file: !57, line: 2549, baseType: !1025, size: 32, align: 32, offset: 4768)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1269, file: !57, line: 2551, baseType: !1025, size: 32, align: 32, offset: 4800)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1269, file: !57, line: 2553, baseType: !1025, size: 32, align: 32, offset: 4832)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1269, file: !57, line: 2555, baseType: !1025, size: 32, align: 32, offset: 4864)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1269, file: !57, line: 2557, baseType: !1025, size: 32, align: 32, offset: 4896)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1269, file: !57, line: 2559, baseType: !1025, size: 32, align: 32, offset: 4928)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1269, file: !57, line: 2563, baseType: !1025, size: 32, align: 32, offset: 4960)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1269, file: !57, line: 2571, baseType: !1584, size: 64, align: 64, offset: 4992)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1269, file: !57, line: 2579, baseType: !1584, size: 64, align: 64, offset: 5056)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1269, file: !57, line: 2586, baseType: !1025, size: 32, align: 32, offset: 5120)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1269, file: !57, line: 2615, baseType: !1025, size: 32, align: 32, offset: 5152)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1269, file: !57, line: 2627, baseType: !1025, size: 32, align: 32, offset: 5184)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1269, file: !57, line: 2637, baseType: !1025, size: 32, align: 32, offset: 5216)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1269, file: !57, line: 2681, baseType: !1025, size: 32, align: 32, offset: 5248)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1269, file: !57, line: 2709, baseType: !1059, size: 64, align: 64, offset: 5312)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1269, file: !57, line: 2716, baseType: !1593, size: 64, align: 64, offset: 5376)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1595)
!1595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1596)
!1596 = !{!1597, !1598, !1599, !1600, !1601, !1602, !1606, !1610, !1614, !1615, !1616, !1617, !1623, !1624, !1625, !1626, !1627}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1595, file: !57, line: 3642, baseType: !1155, size: 64, align: 64)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1595, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1595, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1595, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1595, file: !57, line: 3669, baseType: !1025, size: 32, align: 32, offset: 160)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1595, file: !57, line: 3682, baseType: !1603, size: 64, align: 64, offset: 192)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DISubroutineType(types: !1605)
!1605 = !{!1025, !1267, !1033}
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1595, file: !57, line: 3698, baseType: !1607, size: 64, align: 64, offset: 256)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DISubroutineType(types: !1609)
!1609 = !{!1025, !1267, !1146, !1022}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1595, file: !57, line: 3712, baseType: !1611, size: 64, align: 64, offset: 320)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DISubroutineType(types: !1613)
!1613 = !{!1025, !1267, !1025, !1146, !1022}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1595, file: !57, line: 3726, baseType: !1607, size: 64, align: 64, offset: 384)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1595, file: !57, line: 3737, baseType: !1264, size: 64, align: 64, offset: 448)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1595, file: !57, line: 3746, baseType: !1025, size: 32, align: 32, offset: 512)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1595, file: !57, line: 3757, baseType: !1618, size: 64, align: 64, offset: 576)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DISubroutineType(types: !1620)
!1620 = !{null, !1621}
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1622, size: 64, align: 64)
!1622 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !57, line: 3617, flags: DIFlagFwdDecl)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1595, file: !57, line: 3766, baseType: !1264, size: 64, align: 64, offset: 640)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1595, file: !57, line: 3774, baseType: !1264, size: 64, align: 64, offset: 704)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1595, file: !57, line: 3780, baseType: !1025, size: 32, align: 32, offset: 768)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1595, file: !57, line: 3785, baseType: !1025, size: 32, align: 32, offset: 800)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1595, file: !57, line: 3795, baseType: !1628, size: 64, align: 64, offset: 832)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64, align: 64)
!1629 = !DISubroutineType(types: !1630)
!1630 = !{!1025, !1267, !1080}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1269, file: !57, line: 2728, baseType: !1026, size: 64, align: 64, offset: 5440)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1269, file: !57, line: 2735, baseType: !1068, size: 512, align: 64, offset: 5504)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1269, file: !57, line: 2742, baseType: !1025, size: 32, align: 32, offset: 6016)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1269, file: !57, line: 2755, baseType: !1025, size: 32, align: 32, offset: 6048)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1269, file: !57, line: 2776, baseType: !1025, size: 32, align: 32, offset: 6080)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1269, file: !57, line: 2783, baseType: !1025, size: 32, align: 32, offset: 6112)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1269, file: !57, line: 2791, baseType: !1025, size: 32, align: 32, offset: 6144)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1269, file: !57, line: 2802, baseType: !1033, size: 64, align: 64, offset: 6208)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1269, file: !57, line: 2811, baseType: !1025, size: 32, align: 32, offset: 6272)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1269, file: !57, line: 2821, baseType: !1025, size: 32, align: 32, offset: 6304)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1269, file: !57, line: 2830, baseType: !1025, size: 32, align: 32, offset: 6336)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1269, file: !57, line: 2840, baseType: !1025, size: 32, align: 32, offset: 6368)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1269, file: !57, line: 2851, baseType: !1644, size: 64, align: 64, offset: 6400)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DISubroutineType(types: !1646)
!1646 = !{!1025, !1459, !1647, !1026, !1462, !1025, !1025}
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DISubroutineType(types: !1649)
!1649 = !{!1025, !1459, !1026}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1269, file: !57, line: 2871, baseType: !1651, size: 64, align: 64, offset: 6464)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DISubroutineType(types: !1653)
!1653 = !{!1025, !1459, !1654, !1026, !1462, !1025}
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DISubroutineType(types: !1656)
!1656 = !{!1025, !1459, !1026, !1025, !1025}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1269, file: !57, line: 2878, baseType: !1025, size: 32, align: 32, offset: 6528)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1269, file: !57, line: 2885, baseType: !1025, size: 32, align: 32, offset: 6560)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1269, file: !57, line: 3005, baseType: !1025, size: 32, align: 32, offset: 6592)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1269, file: !57, line: 3013, baseType: !914, size: 32, align: 32, offset: 6624)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1269, file: !57, line: 3020, baseType: !914, size: 32, align: 32, offset: 6656)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1269, file: !57, line: 3027, baseType: !914, size: 32, align: 32, offset: 6688)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1269, file: !57, line: 3037, baseType: !1030, size: 64, align: 64, offset: 6720)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1269, file: !57, line: 3038, baseType: !1025, size: 32, align: 32, offset: 6784)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1269, file: !57, line: 3050, baseType: !1069, size: 64, align: 64, offset: 6848)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1269, file: !57, line: 3065, baseType: !1025, size: 32, align: 32, offset: 6912)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1269, file: !57, line: 3083, baseType: !1025, size: 32, align: 32, offset: 6944)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1269, file: !57, line: 3092, baseType: !1052, size: 64, align: 32, offset: 6976)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1269, file: !57, line: 3099, baseType: !516, size: 32, align: 32, offset: 7040)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1269, file: !57, line: 3106, baseType: !1052, size: 64, align: 32, offset: 7072)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1269, file: !57, line: 3113, baseType: !1672, size: 64, align: 64, offset: 7168)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1674)
!1674 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !57, line: 740, baseType: !1675)
!1675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !57, line: 712, size: 384, align: 64, elements: !1676)
!1676 = !{!1677, !1678, !1679, !1680, !1681, !1682, !1685}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1675, file: !57, line: 713, baseType: !56, size: 32, align: 32)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1675, file: !57, line: 714, baseType: !46, size: 32, align: 32, offset: 32)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1675, file: !57, line: 720, baseType: !1155, size: 64, align: 64, offset: 64)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1675, file: !57, line: 724, baseType: !1155, size: 64, align: 64, offset: 128)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1675, file: !57, line: 728, baseType: !1025, size: 32, align: 32, offset: 192)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1675, file: !57, line: 734, baseType: !1683, size: 64, align: 64, offset: 256)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64, align: 64)
!1684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1155)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1675, file: !57, line: 739, baseType: !1686, size: 64, align: 64, offset: 320)
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64, align: 64)
!1687 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1255)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1269, file: !57, line: 3129, baseType: !1059, size: 64, align: 64, offset: 7232)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1269, file: !57, line: 3130, baseType: !1059, size: 64, align: 64, offset: 7296)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1269, file: !57, line: 3131, baseType: !1059, size: 64, align: 64, offset: 7360)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1269, file: !57, line: 3132, baseType: !1059, size: 64, align: 64, offset: 7424)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1269, file: !57, line: 3139, baseType: !1584, size: 64, align: 64, offset: 7488)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1269, file: !57, line: 3147, baseType: !1025, size: 32, align: 32, offset: 7552)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1269, file: !57, line: 3165, baseType: !1025, size: 32, align: 32, offset: 7584)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1269, file: !57, line: 3172, baseType: !1025, size: 32, align: 32, offset: 7616)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1269, file: !57, line: 3180, baseType: !1025, size: 32, align: 32, offset: 7648)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1269, file: !57, line: 3191, baseType: !1027, size: 64, align: 64, offset: 7680)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1269, file: !57, line: 3199, baseType: !1030, size: 64, align: 64, offset: 7744)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1269, file: !57, line: 3207, baseType: !1584, size: 64, align: 64, offset: 7808)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1269, file: !57, line: 3214, baseType: !1024, size: 32, align: 32, offset: 7872)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1269, file: !57, line: 3224, baseType: !1328, size: 64, align: 64, offset: 7936)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1269, file: !57, line: 3225, baseType: !1025, size: 32, align: 32, offset: 8000)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1269, file: !57, line: 3249, baseType: !1080, size: 64, align: 64, offset: 8064)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1269, file: !57, line: 3256, baseType: !1025, size: 32, align: 32, offset: 8128)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1269, file: !57, line: 3271, baseType: !1025, size: 32, align: 32, offset: 8160)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1269, file: !57, line: 3279, baseType: !1059, size: 64, align: 64, offset: 8192)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1269, file: !57, line: 3301, baseType: !1080, size: 64, align: 64, offset: 8256)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1269, file: !57, line: 3310, baseType: !1025, size: 32, align: 32, offset: 8320)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1269, file: !57, line: 3337, baseType: !1025, size: 32, align: 32, offset: 8352)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1269, file: !57, line: 3351, baseType: !1025, size: 32, align: 32, offset: 8384)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1269, file: !57, line: 3359, baseType: !1025, size: 32, align: 32, offset: 8416)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1152, file: !57, line: 3535, baseType: !1713, size: 64, align: 64, offset: 1024)
!1713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1714, size: 64, align: 64)
!1714 = !DISubroutineType(types: !1715)
!1715 = !{!1025, !1267, !1716}
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64, align: 64)
!1717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1268)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1152, file: !57, line: 3541, baseType: !1719, size: 64, align: 64, offset: 1088)
!1719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1720, size: 64, align: 64)
!1720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1721)
!1721 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1722)
!1722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1283, line: 223, size: 128, align: 64, elements: !1723)
!1723 = !{!1724, !1725}
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1722, file: !1283, line: 224, baseType: !1146, size: 64, align: 64)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1722, file: !1283, line: 225, baseType: !1146, size: 64, align: 64, offset: 64)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1152, file: !57, line: 3549, baseType: !1727, size: 64, align: 64, offset: 1152)
!1727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1728, size: 64, align: 64)
!1728 = !DISubroutineType(types: !1729)
!1729 = !{null, !1262}
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1152, file: !57, line: 3551, baseType: !1264, size: 64, align: 64, offset: 1216)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1152, file: !57, line: 3552, baseType: !1732, size: 64, align: 64, offset: 1280)
!1732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1733, size: 64, align: 64)
!1733 = !DISubroutineType(types: !1734)
!1734 = !{!1025, !1267, !1030, !1025, !1735}
!1735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1736, size: 64, align: 64)
!1736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1737)
!1737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1738)
!1738 = !{!1739, !1740, !1741, !1742, !1743, !1767}
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1737, file: !57, line: 3921, baseType: !1028, size: 16, align: 16)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1737, file: !57, line: 3922, baseType: !1022, size: 32, align: 32, offset: 32)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1737, file: !57, line: 3923, baseType: !1022, size: 32, align: 32, offset: 64)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1737, file: !57, line: 3924, baseType: !1024, size: 32, align: 32, offset: 96)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1737, file: !57, line: 3925, baseType: !1744, size: 64, align: 64, offset: 128)
!1744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1745, size: 64, align: 64)
!1745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1746, size: 64, align: 64)
!1746 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1747)
!1747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1748)
!1748 = !{!1749, !1750, !1751, !1752, !1753, !1754, !1760, !1762, !1763, !1764, !1765, !1766}
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1747, file: !57, line: 3886, baseType: !1025, size: 32, align: 32)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1747, file: !57, line: 3887, baseType: !1025, size: 32, align: 32, offset: 32)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1747, file: !57, line: 3888, baseType: !1025, size: 32, align: 32, offset: 64)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1747, file: !57, line: 3889, baseType: !1025, size: 32, align: 32, offset: 96)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1747, file: !57, line: 3890, baseType: !1025, size: 32, align: 32, offset: 128)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1747, file: !57, line: 3897, baseType: !1755, size: 768, align: 64, offset: 192)
!1755 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1756)
!1756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1757)
!1757 = !{!1758, !1759}
