; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--framequeue.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--framequeue.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.FFFrameQueueGlobal = type { i8 }
%struct.FFFrameQueue = type { %struct.FFFrameBucket*, i64, i64, i64, %struct.FFFrameBucket, i64, i64, i64, i64, i32 }
%struct.FFFrameBucket = type { %struct.AVFrame* }
%struct.AVFrame = type { [8 x i8*], [8 x i32], i8**, i32, i32, i32, i32, i32, i32, %struct.AVRational, i64, i64, i64, i32, i32, i32, i8*, [8 x i64], i32, i32, i32, i32, i64, i32, i64, [8 x %struct.AVBufferRef*], %struct.AVBufferRef**, i32, %struct.AVFrameSideData**, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, %struct.AVDictionary*, i32, i32, i32, i8*, i32, i32, %struct.AVBufferRef*, %struct.AVBufferRef*, %struct.AVBufferRef*, i64, i64, i64, i64, %struct.AVBufferRef* }
%struct.AVRational = type { i32, i32 }
%struct.AVFrameSideData = type { i32, i8*, i32, %struct.AVDictionary*, %struct.AVBufferRef* }
%struct.AVDictionary = type opaque
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

; Function Attrs: nounwind uwtable
define void @ff_framequeue_global_init(%struct.FFFrameQueueGlobal* %fqg) #0 !dbg !124 {
entry:
  %fqg.addr = alloca %struct.FFFrameQueueGlobal*, align 8

!92 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!93 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!94 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!95 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!96 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!97 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!98 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!99 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!100 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!101 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!102 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!103 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!104 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!105 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !39, line: 538, size: 32, align: 32, elements: !107)
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115}
!108 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!109 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!110 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!111 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!112 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!113 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!114 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!115 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !119, line: 197, baseType: !120)
!119 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!120 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!121 = !{i32 2, !"Dwarf Version", i32 4}
!122 = !{i32 2, !"Debug Info Version", i32 3}
!123 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!124 = distinct !DISubprogram(name: "ff_framequeue_global_init", scope: !125, file: !125, line: 30, type: !126, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !135)
!125 = !DIFile(filename: "libavfilter/framequeue.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!126 = !DISubroutineType(types: !127)
!127 = !{null, !128}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameQueueGlobal", file: !130, line: 48, baseType: !131)
!130 = !DIFile(filename: "libavfilter/framequeue.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameQueueGlobal", file: !130, line: 46, size: 8, align: 8, elements: !132)
!132 = !{!133}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !131, file: !130, line: 47, baseType: !134, size: 8, align: 8)
!134 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!135 = !{}
!136 = !DILocalVariable(name: "fqg", arg: 1, scope: !124, file: !125, line: 30, type: !128)
!137 = !DIExpression()
!138 = !DILocation(line: 30, column: 52, scope: !124)
!139 = !DILocation(line: 32, column: 1, scope: !124)
!140 = distinct !DISubprogram(name: "ff_framequeue_init", scope: !125, file: !125, line: 47, type: !141, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !135)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !143, !128}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameQueue", file: !130, line: 108, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameQueue", file: !130, line: 53, size: 640, align: 64, elements: !146)
!146 = !{!147, !262, !263, !264, !265, !266, !267, !268, !269, !270}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !145, file: !130, line: 58, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameBucket", file: !130, line: 36, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameBucket", file: !130, line: 34, size: 64, align: 64, elements: !151)
!151 = !{!152}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !150, file: !130, line: 35, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !15, line: 646, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !15, line: 268, size: 4288, align: 64, elements: !156)
!156 = !{!157, !165, !168, !170, !171, !172, !173, !174, !175, !176, !183, !184, !185, !186, !187, !188, !189, !190, !194, !195, !196, !197, !198, !199, !200, !201, !214, !216, !217, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !250, !251, !252, !253, !254, !255, !258, !259, !260, !261}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !155, file: !15, line: 282, baseType: !158, size: 512, align: 64)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 512, align: 64, elements: !163)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !161, line: 48, baseType: !162)
!161 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!162 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!163 = !{!164}
!164 = !DISubrange(count: 8)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !155, file: !15, line: 299, baseType: !166, size: 256, align: 32, offset: 512)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 256, align: 32, elements: !163)
!167 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !155, file: !15, line: 315, baseType: !169, size: 64, align: 64, offset: 768)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !155, file: !15, line: 326, baseType: !167, size: 32, align: 32, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !155, file: !15, line: 326, baseType: !167, size: 32, align: 32, offset: 864)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !155, file: !15, line: 334, baseType: !167, size: 32, align: 32, offset: 896)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !155, file: !15, line: 341, baseType: !167, size: 32, align: 32, offset: 928)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !155, file: !15, line: 346, baseType: !167, size: 32, align: 32, offset: 960)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !155, file: !15, line: 351, baseType: !3, size: 32, align: 32, offset: 992)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !155, file: !15, line: 356, baseType: !177, size: 64, align: 32, offset: 1024)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !178, line: 61, baseType: !179)
!178 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !178, line: 58, size: 64, align: 32, elements: !180)
!180 = !{!181, !182}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !179, file: !178, line: 59, baseType: !167, size: 32, align: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !179, file: !178, line: 60, baseType: !167, size: 32, align: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !155, file: !15, line: 361, baseType: !118, size: 64, align: 64, offset: 1088)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !155, file: !15, line: 369, baseType: !118, size: 64, align: 64, offset: 1152)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !155, file: !15, line: 377, baseType: !118, size: 64, align: 64, offset: 1216)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !155, file: !15, line: 382, baseType: !167, size: 32, align: 32, offset: 1280)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !155, file: !15, line: 386, baseType: !167, size: 32, align: 32, offset: 1312)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !155, file: !15, line: 391, baseType: !167, size: 32, align: 32, offset: 1344)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !155, file: !15, line: 396, baseType: !117, size: 64, align: 64, offset: 1408)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !155, file: !15, line: 403, baseType: !191, size: 512, align: 64, offset: 1472)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 512, align: 64, elements: !163)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !161, line: 55, baseType: !193)
!193 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !155, file: !15, line: 410, baseType: !167, size: 32, align: 32, offset: 1984)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !155, file: !15, line: 415, baseType: !167, size: 32, align: 32, offset: 2016)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !155, file: !15, line: 420, baseType: !167, size: 32, align: 32, offset: 2048)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !155, file: !15, line: 425, baseType: !167, size: 32, align: 32, offset: 2080)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !155, file: !15, line: 435, baseType: !118, size: 64, align: 64, offset: 2112)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !155, file: !15, line: 440, baseType: !167, size: 32, align: 32, offset: 2176)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !155, file: !15, line: 445, baseType: !192, size: 64, align: 64, offset: 2240)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !155, file: !15, line: 459, baseType: !202, size: 512, align: 64, offset: 2304)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 512, align: 64, elements: !163)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !205, line: 94, baseType: !206)
!205 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !205, line: 81, size: 192, align: 64, elements: !207)
!207 = !{!208, !212, !213}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !206, file: !205, line: 82, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !205, line: 73, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !205, line: 73, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !206, file: !205, line: 89, baseType: !159, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !206, file: !205, line: 93, baseType: !167, size: 32, align: 32, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !155, file: !15, line: 473, baseType: !215, size: 64, align: 64, offset: 2816)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !155, file: !15, line: 477, baseType: !167, size: 32, align: 32, offset: 2880)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !155, file: !15, line: 479, baseType: !218, size: 64, align: 64, offset: 2944)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !15, line: 207, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !15, line: 201, size: 320, align: 64, elements: !222)
!222 = !{!223, !224, !225, !226, !231}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !221, file: !15, line: 202, baseType: !14, size: 32, align: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !221, file: !15, line: 203, baseType: !159, size: 64, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !221, file: !15, line: 204, baseType: !167, size: 32, align: 32, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !221, file: !15, line: 205, baseType: !227, size: 64, align: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !229, line: 86, baseType: !230)
!229 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !229, line: 86, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !221, file: !15, line: 206, baseType: !203, size: 64, align: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !155, file: !15, line: 480, baseType: !167, size: 32, align: 32, offset: 3008)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !155, file: !15, line: 505, baseType: !167, size: 32, align: 32, offset: 3040)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !155, file: !15, line: 512, baseType: !38, size: 32, align: 32, offset: 3072)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !155, file: !15, line: 514, baseType: !45, size: 32, align: 32, offset: 3104)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !155, file: !15, line: 516, baseType: !63, size: 32, align: 32, offset: 3136)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !155, file: !15, line: 523, baseType: !87, size: 32, align: 32, offset: 3168)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !155, file: !15, line: 525, baseType: !106, size: 32, align: 32, offset: 3200)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !155, file: !15, line: 532, baseType: !118, size: 64, align: 64, offset: 3264)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !155, file: !15, line: 539, baseType: !118, size: 64, align: 64, offset: 3328)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !155, file: !15, line: 547, baseType: !118, size: 64, align: 64, offset: 3392)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !155, file: !15, line: 554, baseType: !227, size: 64, align: 64, offset: 3456)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !155, file: !15, line: 563, baseType: !167, size: 32, align: 32, offset: 3520)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !155, file: !15, line: 572, baseType: !167, size: 32, align: 32, offset: 3552)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !155, file: !15, line: 581, baseType: !167, size: 32, align: 32, offset: 3584)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !155, file: !15, line: 588, baseType: !247, size: 64, align: 64, offset: 3648)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !119, line: 194, baseType: !249)
!249 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !155, file: !15, line: 593, baseType: !167, size: 32, align: 32, offset: 3712)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !155, file: !15, line: 596, baseType: !167, size: 32, align: 32, offset: 3744)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !155, file: !15, line: 599, baseType: !203, size: 64, align: 64, offset: 3776)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !155, file: !15, line: 605, baseType: !203, size: 64, align: 64, offset: 3840)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !155, file: !15, line: 616, baseType: !203, size: 64, align: 64, offset: 3904)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !155, file: !15, line: 626, baseType: !256, size: 64, align: 64, offset: 3968)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !257, line: 216, baseType: !193)
!257 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!258 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !155, file: !15, line: 627, baseType: !256, size: 64, align: 64, offset: 4032)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !155, file: !15, line: 628, baseType: !256, size: 64, align: 64, offset: 4096)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !155, file: !15, line: 629, baseType: !256, size: 64, align: 64, offset: 4160)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !155, file: !15, line: 645, baseType: !203, size: 64, align: 64, offset: 4224)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !145, file: !130, line: 63, baseType: !256, size: 64, align: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !145, file: !130, line: 69, baseType: !256, size: 64, align: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "queued", scope: !145, file: !130, line: 74, baseType: !256, size: 64, align: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "first_bucket", scope: !145, file: !130, line: 79, baseType: !149, size: 64, align: 64, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "total_frames_head", scope: !145, file: !130, line: 84, baseType: !192, size: 64, align: 64, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "total_frames_tail", scope: !145, file: !130, line: 90, baseType: !192, size: 64, align: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "total_samples_head", scope: !145, file: !130, line: 95, baseType: !192, size: 64, align: 64, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "total_samples_tail", scope: !145, file: !130, line: 101, baseType: !192, size: 64, align: 64, offset: 512)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "samples_skipped", scope: !145, file: !130, line: 106, baseType: !167, size: 32, align: 32, offset: 576)
!271 = !DILocalVariable(name: "fq", arg: 1, scope: !140, file: !125, line: 47, type: !143)
!272 = !DILocation(line: 47, column: 39, scope: !140)
!273 = !DILocalVariable(name: "fqg", arg: 2, scope: !140, file: !125, line: 47, type: !128)
!274 = !DILocation(line: 47, column: 63, scope: !140)
!275 = !DILocation(line: 49, column: 18, scope: !140)
!276 = !DILocation(line: 49, column: 22, scope: !140)
!277 = !DILocation(line: 49, column: 5, scope: !140)
!278 = !DILocation(line: 49, column: 9, scope: !140)
!279 = !DILocation(line: 49, column: 15, scope: !140)
!280 = !DILocation(line: 50, column: 5, scope: !140)
!281 = !DILocation(line: 50, column: 9, scope: !140)
!282 = !DILocation(line: 50, column: 19, scope: !140)
!283 = !DILocation(line: 51, column: 1, scope: !140)
!284 = distinct !DISubprogram(name: "ff_framequeue_free", scope: !125, file: !125, line: 53, type: !285, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !135)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !143}
!287 = !DILocalVariable(name: "fq", arg: 1, scope: !284, file: !125, line: 53, type: !143)
!288 = !DILocation(line: 53, column: 39, scope: !284)
!289 = !DILocation(line: 55, column: 5, scope: !284)
!290 = !DILocation(line: 55, column: 12, scope: !291)
!291 = !DILexicalBlockFile(scope: !284, file: !125, discriminator: 1)
!292 = !DILocation(line: 55, column: 16, scope: !291)
!293 = !DILocation(line: 55, column: 5, scope: !291)
!294 = !DILocalVariable(name: "frame", scope: !295, file: !125, line: 56, type: !153)
!295 = distinct !DILexicalBlock(scope: !284, file: !125, line: 55, column: 24)
!296 = !DILocation(line: 56, column: 18, scope: !295)
!297 = !DILocation(line: 56, column: 45, scope: !295)
!298 = !DILocation(line: 56, column: 26, scope: !295)
!299 = !DILocation(line: 57, column: 9, scope: !295)
!300 = !DILocation(line: 55, column: 5, scope: !301)
!301 = !DILexicalBlockFile(scope: !284, file: !125, discriminator: 2)
!302 = distinct !{!302, !289}
!303 = !DILocation(line: 59, column: 9, scope: !304)
!304 = distinct !DILexicalBlock(scope: !284, file: !125, line: 59, column: 9)
!305 = !DILocation(line: 59, column: 13, scope: !304)
!306 = !DILocation(line: 59, column: 23, scope: !304)
!307 = !DILocation(line: 59, column: 27, scope: !304)
!308 = !DILocation(line: 59, column: 19, scope: !304)
!309 = !DILocation(line: 59, column: 9, scope: !284)
!310 = !DILocation(line: 60, column: 19, scope: !304)
!311 = !DILocation(line: 60, column: 23, scope: !304)
!312 = !DILocation(line: 60, column: 18, scope: !304)
!313 = !DILocation(line: 60, column: 9, scope: !304)
!314 = !DILocation(line: 61, column: 1, scope: !284)
!315 = distinct !DISubprogram(name: "ff_framequeue_take", scope: !125, file: !125, line: 98, type: !316, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !135)
!316 = !DISubroutineType(types: !317)
!317 = !{!153, !143}
!318 = !DILocalVariable(name: "fq", arg: 1, scope: !315, file: !125, line: 98, type: !143)
!319 = !DILocation(line: 98, column: 43, scope: !315)
!320 = !DILocalVariable(name: "b", scope: !315, file: !125, line: 100, type: !148)
!321 = !DILocation(line: 100, column: 20, scope: !315)
!322 = !DILocation(line: 102, column: 23, scope: !315)
!323 = !DILocation(line: 102, column: 5, scope: !315)
!324 = !DILocation(line: 104, column: 16, scope: !315)
!325 = !DILocation(line: 104, column: 9, scope: !315)
!326 = !DILocation(line: 104, column: 7, scope: !315)
!327 = !DILocation(line: 105, column: 5, scope: !315)
!328 = !DILocation(line: 105, column: 9, scope: !315)
!329 = !DILocation(line: 105, column: 15, scope: !315)
!330 = !DILocation(line: 106, column: 5, scope: !315)
!331 = !DILocation(line: 106, column: 9, scope: !315)
!332 = !DILocation(line: 106, column: 13, scope: !315)
