; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--rtpenc_chain.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--rtpenc_chain.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFormatContext = type { %struct.AVClass*, %struct.AVInputFormat*, %struct.AVOutputFormat*, i8*, %struct.AVIOContext*, i32, i32, %struct.AVStream**, [1024 x i8], i8*, i64, i64, i64, i32, i32, i32, i64, i64, i8*, i32, i32, %struct.AVProgram**, i32, i32, i32, i32, i32, i32, %struct.AVChapter**, %struct.AVDictionary*, i64, i32, i32, %struct.AVIOInterruptCB, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i8*, i8*, %struct.AVFormatInternal*, i32, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, i32, i8*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i64, i8*, i32, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVIOInterruptCB*, %struct.AVDictionary**)*, i8*, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVDictionary**)*, void (%struct.AVFormatContext*, %struct.AVIOContext*)*, i8*, i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }

!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !47, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !47, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !47, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !47, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !{i32 2, !"Dwarf Version", i32 4}
!939 = !{i32 2, !"Debug Info Version", i32 3}
!940 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!941 = distinct !DISubprogram(name: "ff_rtp_chain_mux_open", scope: !942, file: !942, line: 28, type: !943, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2211)
!942 = !DIFile(filename: "libavformat/rtpenc_chain.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!943 = !DISubroutineType(types: !944)
!944 = !{!945, !946, !947, !1357, !2109, !945, !945}
!945 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !919, line: 1947, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !950)
!950 = !{!951, !1037, !1144, !1287, !1288, !1353, !1354, !1355, !1986, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2040, !2041, !2042, !2043, !2044, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2075, !2076, !2079, !2080, !2081, !2082, !2083, !2084, !2086, !2087, !2088, !2089, !2097, !2098, !2102, !2106, !2107, !2108}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !949, file: !919, line: 1342, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !956)
!956 = !{!957, !961, !966, !996, !997, !998, !999, !1003, !1009, !1011, !1015}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !955, file: !26, line: 72, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!960 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !955, file: !26, line: 78, baseType: !962, size: 64, align: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!958, !965}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !955, file: !26, line: 85, baseType: !967, size: 64, align: 64, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !970)
!970 = !{!971, !972, !973, !974, !975, !992, !993, !994, !995}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !969, file: !4, line: 247, baseType: !958, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !969, file: !4, line: 253, baseType: !958, size: 64, align: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !969, file: !4, line: 259, baseType: !945, size: 32, align: 32, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !969, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !969, file: !4, line: 271, baseType: !976, size: 64, align: 64, offset: 192)
!976 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !969, file: !4, line: 265, size: 64, align: 64, elements: !977)
!977 = !{!978, !982, !984, !985}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !976, file: !4, line: 266, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !980, line: 40, baseType: !981)
!980 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!981 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !976, file: !4, line: 267, baseType: !983, size: 64, align: 64)
!983 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !976, file: !4, line: 268, baseType: !958, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !976, file: !4, line: 270, baseType: !986, size: 64, align: 32)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !987, line: 61, baseType: !988)
!987 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !987, line: 58, size: 64, align: 32, elements: !989)
!989 = !{!990, !991}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !988, file: !987, line: 59, baseType: !945, size: 32, align: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !988, file: !987, line: 60, baseType: !945, size: 32, align: 32, offset: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !969, file: !4, line: 272, baseType: !983, size: 64, align: 64, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !969, file: !4, line: 273, baseType: !983, size: 64, align: 64, offset: 320)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !969, file: !4, line: 275, baseType: !945, size: 32, align: 32, offset: 384)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !969, file: !4, line: 300, baseType: !958, size: 64, align: 64, offset: 448)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !955, file: !26, line: 93, baseType: !945, size: 32, align: 32, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !955, file: !26, line: 99, baseType: !945, size: 32, align: 32, offset: 224)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !955, file: !26, line: 108, baseType: !945, size: 32, align: 32, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !955, file: !26, line: 113, baseType: !1000, size: 64, align: 64, offset: 320)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!965, !965, !965}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !955, file: !26, line: 123, baseType: !1004, size: 64, align: 64, offset: 384)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!1007, !1007}
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !955, file: !26, line: 130, baseType: !1010, size: 32, align: 32, offset: 448)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !955, file: !26, line: 136, baseType: !1012, size: 64, align: 64, offset: 512)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!1010, !965}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !955, file: !26, line: 142, baseType: !1016, size: 64, align: 64, offset: 576)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!945, !1019, !965, !958, !945}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1022)
!1022 = !{!1023, !1035, !1036}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1021, file: !4, line: 360, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1028)
!1028 = !{!1029, !1030, !1031, !1032, !1033, !1034}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1027, file: !4, line: 307, baseType: !958, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1027, file: !4, line: 313, baseType: !983, size: 64, align: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1027, file: !4, line: 313, baseType: !983, size: 64, align: 64, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1027, file: !4, line: 318, baseType: !983, size: 64, align: 64, offset: 192)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1027, file: !4, line: 318, baseType: !983, size: 64, align: 64, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1027, file: !4, line: 323, baseType: !945, size: 32, align: 32, offset: 320)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1021, file: !4, line: 364, baseType: !945, size: 32, align: 32, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1021, file: !4, line: 368, baseType: !945, size: 32, align: 32, offset: 96)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !949, file: !919, line: 1349, baseType: !1038, size: 64, align: 64, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1040)
!1040 = !{!1041, !1042, !1043, !1044, !1045, !1051, !1052, !1053, !1054, !1055, !1056, !1070, !1075, !1115, !1116, !1120, !1125, !1126, !1127, !1131, !1137, !1143}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1039, file: !919, line: 638, baseType: !958, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1039, file: !919, line: 645, baseType: !958, size: 64, align: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1039, file: !919, line: 652, baseType: !945, size: 32, align: 32, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1039, file: !919, line: 659, baseType: !958, size: 64, align: 64, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1039, file: !919, line: 661, baseType: !1046, size: 64, align: 64, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1050 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !919, line: 443, flags: DIFlagFwdDecl)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1039, file: !919, line: 663, baseType: !952, size: 64, align: 64, offset: 320)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1039, file: !919, line: 670, baseType: !958, size: 64, align: 64, offset: 384)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1039, file: !919, line: 679, baseType: !1038, size: 64, align: 64, offset: 448)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1039, file: !919, line: 684, baseType: !945, size: 32, align: 32, offset: 512)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1039, file: !919, line: 689, baseType: !945, size: 32, align: 32, offset: 544)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1039, file: !919, line: 696, baseType: !1057, size: 64, align: 64, offset: 576)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!945, !1060}
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1063)
!1063 = !{!1064, !1065, !1068, !1069}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1062, file: !919, line: 449, baseType: !958, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1062, file: !919, line: 450, baseType: !1066, size: 64, align: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1062, file: !919, line: 451, baseType: !945, size: 32, align: 32, offset: 128)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1062, file: !919, line: 452, baseType: !958, size: 64, align: 64, offset: 192)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1039, file: !919, line: 703, baseType: !1071, size: 64, align: 64, offset: 640)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!945, !1074}
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1039, file: !919, line: 714, baseType: !1076, size: 64, align: 64, offset: 704)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!945, !1074, !1079}
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !47, line: 1499, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !47, line: 1445, size: 704, align: 64, elements: !1082)
!1082 = !{!1083, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1111, !1112, !1113, !1114}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1081, file: !47, line: 1451, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1086, line: 94, baseType: !1087)
!1086 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1086, line: 81, size: 192, align: 64, elements: !1088)
!1088 = !{!1089, !1093, !1096}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1087, file: !1086, line: 82, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1086, line: 73, baseType: !1092)
!1092 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1086, line: 73, flags: DIFlagFwdDecl)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1087, file: !1086, line: 89, baseType: !1094, size: 64, align: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !980, line: 48, baseType: !1067)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1087, file: !1086, line: 93, baseType: !945, size: 32, align: 32, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1081, file: !47, line: 1461, baseType: !979, size: 64, align: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1081, file: !47, line: 1467, baseType: !979, size: 64, align: 64, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1081, file: !47, line: 1468, baseType: !1094, size: 64, align: 64, offset: 192)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1081, file: !47, line: 1469, baseType: !945, size: 32, align: 32, offset: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1081, file: !47, line: 1470, baseType: !945, size: 32, align: 32, offset: 288)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1081, file: !47, line: 1474, baseType: !945, size: 32, align: 32, offset: 320)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1081, file: !47, line: 1479, baseType: !1104, size: 64, align: 64, offset: 384)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !47, line: 1415, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !47, line: 1411, size: 128, align: 64, elements: !1107)
!1107 = !{!1108, !1109, !1110}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1106, file: !47, line: 1412, baseType: !1094, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1106, file: !47, line: 1413, baseType: !945, size: 32, align: 32, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1106, file: !47, line: 1414, baseType: !46, size: 32, align: 32, offset: 96)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1081, file: !47, line: 1480, baseType: !945, size: 32, align: 32, offset: 448)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1081, file: !47, line: 1486, baseType: !979, size: 64, align: 64, offset: 512)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1081, file: !47, line: 1488, baseType: !979, size: 64, align: 64, offset: 576)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1081, file: !47, line: 1497, baseType: !979, size: 64, align: 64, offset: 640)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1039, file: !919, line: 720, baseType: !1071, size: 64, align: 64, offset: 768)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1039, file: !919, line: 730, baseType: !1117, size: 64, align: 64, offset: 832)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!945, !1074, !945, !979, !945}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1039, file: !919, line: 737, baseType: !1121, size: 64, align: 64, offset: 896)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!979, !1074, !945, !1124, !979}
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1039, file: !919, line: 744, baseType: !1071, size: 64, align: 64, offset: 960)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1039, file: !919, line: 750, baseType: !1071, size: 64, align: 64, offset: 1024)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1039, file: !919, line: 758, baseType: !1128, size: 64, align: 64, offset: 1088)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!945, !1074, !945, !979, !979, !979, !945}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1039, file: !919, line: 764, baseType: !1132, size: 64, align: 64, offset: 1152)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!945, !1074, !1135}
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1039, file: !919, line: 770, baseType: !1138, size: 64, align: 64, offset: 1216)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!945, !1074, !1141}
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1039, file: !919, line: 776, baseType: !1138, size: 64, align: 64, offset: 1280)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !949, file: !919, line: 1356, baseType: !1145, size: 64, align: 64, offset: 128)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1147)
!1147 = !{!1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1167, !1171, !1175, !1182, !1272, !1273, !1274, !1275, !1276, !1277, !1281}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1146, file: !919, line: 498, baseType: !958, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1146, file: !919, line: 504, baseType: !958, size: 64, align: 64, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1146, file: !919, line: 505, baseType: !958, size: 64, align: 64, offset: 128)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1146, file: !919, line: 506, baseType: !958, size: 64, align: 64, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1146, file: !919, line: 508, baseType: !77, size: 32, align: 32, offset: 256)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1146, file: !919, line: 509, baseType: !77, size: 32, align: 32, offset: 288)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1146, file: !919, line: 510, baseType: !77, size: 32, align: 32, offset: 320)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1146, file: !919, line: 517, baseType: !945, size: 32, align: 32, offset: 352)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1146, file: !919, line: 523, baseType: !1046, size: 64, align: 64, offset: 384)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1146, file: !919, line: 526, baseType: !952, size: 64, align: 64, offset: 448)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1146, file: !919, line: 535, baseType: !1145, size: 64, align: 64, offset: 512)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1146, file: !919, line: 539, baseType: !945, size: 32, align: 32, offset: 576)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1146, file: !919, line: 541, baseType: !1071, size: 64, align: 64, offset: 640)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1146, file: !919, line: 549, baseType: !1076, size: 64, align: 64, offset: 704)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1146, file: !919, line: 550, baseType: !1071, size: 64, align: 64, offset: 768)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1146, file: !919, line: 554, baseType: !1164, size: 64, align: 64, offset: 832)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!945, !1074, !1079, !1079, !945}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1146, file: !919, line: 563, baseType: !1168, size: 64, align: 64, offset: 896)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!945, !77, !945}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1146, file: !919, line: 565, baseType: !1172, size: 64, align: 64, offset: 960)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{null, !1074, !945, !1124, !1124}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1146, file: !919, line: 570, baseType: !1176, size: 64, align: 64, offset: 1024)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!945, !1074, !945, !965, !1179}
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1180, line: 216, baseType: !1181)
!1180 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1181 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1146, file: !919, line: 581, baseType: !1183, size: 64, align: 64, offset: 1088)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!945, !1074, !945, !1186, !1271}
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1189)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1190)
!1190 = !{!1191, !1195, !1197, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1225, !1227, !1228, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1189, file: !548, line: 282, baseType: !1192, size: 512, align: 64)
!1192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1094, size: 512, align: 64, elements: !1193)
!1193 = !{!1194}
!1194 = !DISubrange(count: 8)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1189, file: !548, line: 299, baseType: !1196, size: 256, align: 32, offset: 512)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 256, align: 32, elements: !1193)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1189, file: !548, line: 315, baseType: !1198, size: 64, align: 64, offset: 768)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1189, file: !548, line: 326, baseType: !945, size: 32, align: 32, offset: 832)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1189, file: !548, line: 326, baseType: !945, size: 32, align: 32, offset: 864)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1189, file: !548, line: 334, baseType: !945, size: 32, align: 32, offset: 896)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1189, file: !548, line: 341, baseType: !945, size: 32, align: 32, offset: 928)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1189, file: !548, line: 346, baseType: !945, size: 32, align: 32, offset: 960)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1189, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1189, file: !548, line: 356, baseType: !986, size: 64, align: 32, offset: 1024)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1189, file: !548, line: 361, baseType: !979, size: 64, align: 64, offset: 1088)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1189, file: !548, line: 369, baseType: !979, size: 64, align: 64, offset: 1152)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1189, file: !548, line: 377, baseType: !979, size: 64, align: 64, offset: 1216)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1189, file: !548, line: 382, baseType: !945, size: 32, align: 32, offset: 1280)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1189, file: !548, line: 386, baseType: !945, size: 32, align: 32, offset: 1312)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1189, file: !548, line: 391, baseType: !945, size: 32, align: 32, offset: 1344)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1189, file: !548, line: 396, baseType: !965, size: 64, align: 64, offset: 1408)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1189, file: !548, line: 403, baseType: !1214, size: 512, align: 64, offset: 1472)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1215, size: 512, align: 64, elements: !1193)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !980, line: 55, baseType: !1181)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1189, file: !548, line: 410, baseType: !945, size: 32, align: 32, offset: 1984)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1189, file: !548, line: 415, baseType: !945, size: 32, align: 32, offset: 2016)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1189, file: !548, line: 420, baseType: !945, size: 32, align: 32, offset: 2048)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1189, file: !548, line: 425, baseType: !945, size: 32, align: 32, offset: 2080)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1189, file: !548, line: 435, baseType: !979, size: 64, align: 64, offset: 2112)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1189, file: !548, line: 440, baseType: !945, size: 32, align: 32, offset: 2176)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1189, file: !548, line: 445, baseType: !1215, size: 64, align: 64, offset: 2240)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1189, file: !548, line: 459, baseType: !1224, size: 512, align: 64, offset: 2304)
!1224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 512, align: 64, elements: !1193)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1189, file: !548, line: 473, baseType: !1226, size: 64, align: 64, offset: 2816)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1189, file: !548, line: 477, baseType: !945, size: 32, align: 32, offset: 2880)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1189, file: !548, line: 479, baseType: !1229, size: 64, align: 64, offset: 2944)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1232)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1233)
!1233 = !{!1234, !1235, !1236, !1237, !1242}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1232, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1232, file: !548, line: 203, baseType: !1094, size: 64, align: 64, offset: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1232, file: !548, line: 204, baseType: !945, size: 32, align: 32, offset: 128)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1232, file: !548, line: 205, baseType: !1238, size: 64, align: 64, offset: 192)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1240, line: 86, baseType: !1241)
!1240 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1241 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1240, line: 86, flags: DIFlagFwdDecl)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1232, file: !548, line: 206, baseType: !1084, size: 64, align: 64, offset: 256)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1189, file: !548, line: 480, baseType: !945, size: 32, align: 32, offset: 3008)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1189, file: !548, line: 505, baseType: !945, size: 32, align: 32, offset: 3040)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1189, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1189, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1189, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1189, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1189, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1189, file: !548, line: 532, baseType: !979, size: 64, align: 64, offset: 3264)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1189, file: !548, line: 539, baseType: !979, size: 64, align: 64, offset: 3328)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1189, file: !548, line: 547, baseType: !979, size: 64, align: 64, offset: 3392)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1189, file: !548, line: 554, baseType: !1238, size: 64, align: 64, offset: 3456)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1189, file: !548, line: 563, baseType: !945, size: 32, align: 32, offset: 3520)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1189, file: !548, line: 572, baseType: !945, size: 32, align: 32, offset: 3552)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1189, file: !548, line: 581, baseType: !945, size: 32, align: 32, offset: 3584)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1189, file: !548, line: 588, baseType: !1258, size: 64, align: 64, offset: 3648)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !980, line: 36, baseType: !1260)
!1260 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1189, file: !548, line: 593, baseType: !945, size: 32, align: 32, offset: 3712)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1189, file: !548, line: 596, baseType: !945, size: 32, align: 32, offset: 3744)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1189, file: !548, line: 599, baseType: !1084, size: 64, align: 64, offset: 3776)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1189, file: !548, line: 605, baseType: !1084, size: 64, align: 64, offset: 3840)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1189, file: !548, line: 616, baseType: !1084, size: 64, align: 64, offset: 3904)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1189, file: !548, line: 626, baseType: !1179, size: 64, align: 64, offset: 3968)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1189, file: !548, line: 627, baseType: !1179, size: 64, align: 64, offset: 4032)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1189, file: !548, line: 628, baseType: !1179, size: 64, align: 64, offset: 4096)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1189, file: !548, line: 629, baseType: !1179, size: 64, align: 64, offset: 4160)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1189, file: !548, line: 645, baseType: !1084, size: 64, align: 64, offset: 4224)
!1271 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1146, file: !919, line: 587, baseType: !1132, size: 64, align: 64, offset: 1152)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1146, file: !919, line: 592, baseType: !1138, size: 64, align: 64, offset: 1216)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1146, file: !919, line: 597, baseType: !1138, size: 64, align: 64, offset: 1280)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1146, file: !919, line: 598, baseType: !77, size: 32, align: 32, offset: 1344)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1146, file: !919, line: 608, baseType: !1071, size: 64, align: 64, offset: 1408)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1146, file: !919, line: 617, baseType: !1278, size: 64, align: 64, offset: 1472)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{null, !1074}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1146, file: !919, line: 623, baseType: !1282, size: 64, align: 64, offset: 1536)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!945, !1074, !1285}
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1080)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !949, file: !919, line: 1365, baseType: !965, size: 64, align: 64, offset: 192)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !949, file: !919, line: 1379, baseType: !1289, size: 64, align: 64, offset: 256)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1291)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1292)
!1292 = !{!1293, !1294, !1295, !1296, !1297, !1298, !1299, !1303, !1304, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1320, !1321, !1325, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1343, !1344, !1345, !1346, !1350, !1351, !1352}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1291, file: !650, line: 174, baseType: !952, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1291, file: !650, line: 226, baseType: !1066, size: 64, align: 64, offset: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1291, file: !650, line: 227, baseType: !945, size: 32, align: 32, offset: 128)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1291, file: !650, line: 228, baseType: !1066, size: 64, align: 64, offset: 192)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1291, file: !650, line: 229, baseType: !1066, size: 64, align: 64, offset: 256)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1291, file: !650, line: 233, baseType: !965, size: 64, align: 64, offset: 320)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1291, file: !650, line: 235, baseType: !1300, size: 64, align: 64, offset: 384)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{!945, !965, !1094, !945}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1291, file: !650, line: 236, baseType: !1300, size: 64, align: 64, offset: 448)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1291, file: !650, line: 237, baseType: !1305, size: 64, align: 64, offset: 512)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DISubroutineType(types: !1307)
!1307 = !{!979, !965, !979, !945}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1291, file: !650, line: 238, baseType: !979, size: 64, align: 64, offset: 576)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1291, file: !650, line: 239, baseType: !945, size: 32, align: 32, offset: 640)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1291, file: !650, line: 240, baseType: !945, size: 32, align: 32, offset: 672)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1291, file: !650, line: 241, baseType: !945, size: 32, align: 32, offset: 704)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1291, file: !650, line: 242, baseType: !1181, size: 64, align: 64, offset: 768)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1291, file: !650, line: 243, baseType: !1066, size: 64, align: 64, offset: 832)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1291, file: !650, line: 244, baseType: !1315, size: 64, align: 64, offset: 896)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{!1181, !1181, !1318, !1271}
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1095)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1291, file: !650, line: 245, baseType: !945, size: 32, align: 32, offset: 960)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1291, file: !650, line: 249, baseType: !1322, size: 64, align: 64, offset: 1024)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DISubroutineType(types: !1324)
!1324 = !{!945, !965, !945}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1291, file: !650, line: 255, baseType: !1326, size: 64, align: 64, offset: 1088)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{!979, !965, !945, !979, !945}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1291, file: !650, line: 260, baseType: !945, size: 32, align: 32, offset: 1152)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1291, file: !650, line: 266, baseType: !979, size: 64, align: 64, offset: 1216)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1291, file: !650, line: 273, baseType: !945, size: 32, align: 32, offset: 1280)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1291, file: !650, line: 279, baseType: !979, size: 64, align: 64, offset: 1344)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1291, file: !650, line: 285, baseType: !945, size: 32, align: 32, offset: 1408)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1291, file: !650, line: 291, baseType: !945, size: 32, align: 32, offset: 1440)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1291, file: !650, line: 298, baseType: !945, size: 32, align: 32, offset: 1472)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1291, file: !650, line: 304, baseType: !945, size: 32, align: 32, offset: 1504)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1291, file: !650, line: 309, baseType: !958, size: 64, align: 64, offset: 1536)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1291, file: !650, line: 314, baseType: !958, size: 64, align: 64, offset: 1600)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1291, file: !650, line: 319, baseType: !1340, size: 64, align: 64, offset: 1664)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{!945, !965, !1094, !945, !649, !979}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1291, file: !650, line: 326, baseType: !945, size: 32, align: 32, offset: 1728)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1291, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1291, file: !650, line: 332, baseType: !979, size: 64, align: 64, offset: 1792)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1291, file: !650, line: 338, baseType: !1347, size: 64, align: 64, offset: 1856)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DISubroutineType(types: !1349)
!1349 = !{!945, !965}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1291, file: !650, line: 340, baseType: !979, size: 64, align: 64, offset: 1920)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1291, file: !650, line: 346, baseType: !1066, size: 64, align: 64, offset: 1984)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1291, file: !650, line: 351, baseType: !945, size: 32, align: 32, offset: 2048)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !949, file: !919, line: 1386, baseType: !945, size: 32, align: 32, offset: 320)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !949, file: !919, line: 1393, baseType: !1271, size: 32, align: 32, offset: 352)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !949, file: !919, line: 1405, baseType: !1356, size: 64, align: 64, offset: 384)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1359)
!1359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1360)
!1360 = !{!1361, !1362, !1363, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1834, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1934, !1940, !1941, !1945, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1977, !1978, !1979, !1980, !1981, !1982}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1359, file: !919, line: 866, baseType: !945, size: 32, align: 32)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1359, file: !919, line: 872, baseType: !945, size: 32, align: 32, offset: 32)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1359, file: !919, line: 878, baseType: !1364, size: 64, align: 64, offset: 64)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !47, line: 3360, baseType: !1366)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !47, line: 1556, size: 8448, align: 64, elements: !1367)
!1367 = !{!1368, !1369, !1370, !1371, !1509, !1510, !1511, !1512, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1538, !1542, !1543, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1722, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1366, file: !47, line: 1561, baseType: !952, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1366, file: !47, line: 1562, baseType: !945, size: 32, align: 32, offset: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1366, file: !47, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1366, file: !47, line: 1565, baseType: !1372, size: 64, align: 64, offset: 128)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1374)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !47, line: 3468, size: 1984, align: 64, elements: !1375)
!1375 = !{!1376, !1377, !1378, !1379, !1380, !1381, !1384, !1387, !1390, !1393, !1396, !1397, !1398, !1406, !1407, !1408, !1410, !1414, !1420, !1425, !1429, !1430, !1474, !1481, !1485, !1486, !1490, !1494, !1498, !1502, !1503, !1504}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1374, file: !47, line: 3475, baseType: !958, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1374, file: !47, line: 3480, baseType: !958, size: 64, align: 64, offset: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1374, file: !47, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1374, file: !47, line: 3482, baseType: !77, size: 32, align: 32, offset: 160)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1374, file: !47, line: 3487, baseType: !945, size: 32, align: 32, offset: 192)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1374, file: !47, line: 3488, baseType: !1382, size: 64, align: 64, offset: 256)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1374, file: !47, line: 3489, baseType: !1385, size: 64, align: 64, offset: 320)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1374, file: !47, line: 3490, baseType: !1388, size: 64, align: 64, offset: 384)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1374, file: !47, line: 3491, baseType: !1391, size: 64, align: 64, offset: 448)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1374, file: !47, line: 3492, baseType: !1394, size: 64, align: 64, offset: 512)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1215)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1374, file: !47, line: 3493, baseType: !1095, size: 8, align: 8, offset: 576)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1374, file: !47, line: 3494, baseType: !952, size: 64, align: 64, offset: 640)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1374, file: !47, line: 3495, baseType: !1399, size: 64, align: 64, offset: 704)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1401)
!1401 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !47, line: 3404, baseType: !1402)
!1402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !47, line: 3401, size: 128, align: 64, elements: !1403)
!1403 = !{!1404, !1405}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1402, file: !47, line: 3402, baseType: !945, size: 32, align: 32)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1402, file: !47, line: 3403, baseType: !958, size: 64, align: 64, offset: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1374, file: !47, line: 3507, baseType: !958, size: 64, align: 64, offset: 768)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1374, file: !47, line: 3516, baseType: !945, size: 32, align: 32, offset: 832)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1374, file: !47, line: 3517, baseType: !1409, size: 64, align: 64, offset: 896)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1374, file: !47, line: 3527, baseType: !1411, size: 64, align: 64, offset: 960)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DISubroutineType(types: !1413)
!1413 = !{!945, !1364}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1374, file: !47, line: 3535, baseType: !1415, size: 64, align: 64, offset: 1024)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DISubroutineType(types: !1417)
!1417 = !{!945, !1364, !1418}
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1365)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1374, file: !47, line: 3541, baseType: !1421, size: 64, align: 64, offset: 1088)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1423)
!1423 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !47, line: 3461, baseType: !1424)
!1424 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !47, line: 3461, flags: DIFlagFwdDecl)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1374, file: !47, line: 3549, baseType: !1426, size: 64, align: 64, offset: 1152)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DISubroutineType(types: !1428)
!1428 = !{null, !1409}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1374, file: !47, line: 3551, baseType: !1411, size: 64, align: 64, offset: 1216)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1374, file: !47, line: 3552, baseType: !1431, size: 64, align: 64, offset: 1280)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DISubroutineType(types: !1433)
!1433 = !{!945, !1364, !1094, !945, !1434}
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1436)
!1436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !47, line: 3920, size: 256, align: 64, elements: !1437)
!1437 = !{!1438, !1441, !1443, !1444, !1445, !1473}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1436, file: !47, line: 3921, baseType: !1439, size: 16, align: 16)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !980, line: 49, baseType: !1440)
!1440 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1436, file: !47, line: 3922, baseType: !1442, size: 32, align: 32, offset: 32)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !980, line: 51, baseType: !1271)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1436, file: !47, line: 3923, baseType: !1442, size: 32, align: 32, offset: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1436, file: !47, line: 3924, baseType: !1271, size: 32, align: 32, offset: 96)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1436, file: !47, line: 3925, baseType: !1446, size: 64, align: 64, offset: 128)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !47, line: 3918, baseType: !1449)
!1449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !47, line: 3885, size: 1600, align: 64, elements: !1450)
!1450 = !{!1451, !1452, !1453, !1454, !1455, !1456, !1462, !1466, !1468, !1469, !1471, !1472}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1449, file: !47, line: 3886, baseType: !945, size: 32, align: 32)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1449, file: !47, line: 3887, baseType: !945, size: 32, align: 32, offset: 32)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1449, file: !47, line: 3888, baseType: !945, size: 32, align: 32, offset: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1449, file: !47, line: 3889, baseType: !945, size: 32, align: 32, offset: 96)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1449, file: !47, line: 3890, baseType: !945, size: 32, align: 32, offset: 128)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1449, file: !47, line: 3897, baseType: !1457, size: 768, align: 64, offset: 192)
!1457 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !47, line: 3858, baseType: !1458)
!1458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !47, line: 3853, size: 768, align: 64, elements: !1459)
!1459 = !{!1460, !1461}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1458, file: !47, line: 3855, baseType: !1192, size: 512, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1458, file: !47, line: 3857, baseType: !1196, size: 256, align: 32, offset: 512)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1449, file: !47, line: 3903, baseType: !1463, size: 256, align: 64, offset: 960)
!1463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1094, size: 256, align: 64, elements: !1464)
!1464 = !{!1465}
!1465 = !DISubrange(count: 4)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1449, file: !47, line: 3904, baseType: !1467, size: 128, align: 32, offset: 1216)
!1467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 128, align: 32, elements: !1464)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1449, file: !47, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1449, file: !47, line: 3908, baseType: !1470, size: 64, align: 64, offset: 1408)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1449, file: !47, line: 3915, baseType: !1470, size: 64, align: 64, offset: 1472)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1449, file: !47, line: 3917, baseType: !945, size: 32, align: 32, offset: 1536)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1436, file: !47, line: 3926, baseType: !979, size: 64, align: 64, offset: 192)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1374, file: !47, line: 3564, baseType: !1475, size: 64, align: 64, offset: 1344)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{!945, !1364, !1079, !1478, !1480}
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1188)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1374, file: !47, line: 3566, baseType: !1482, size: 64, align: 64, offset: 1408)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DISubroutineType(types: !1484)
!1484 = !{!945, !1364, !965, !1480, !1079}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1374, file: !47, line: 3567, baseType: !1411, size: 64, align: 64, offset: 1472)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1374, file: !47, line: 3576, baseType: !1487, size: 64, align: 64, offset: 1536)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DISubroutineType(types: !1489)
!1489 = !{!945, !1364, !1478}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1374, file: !47, line: 3577, baseType: !1491, size: 64, align: 64, offset: 1600)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!945, !1364, !1079}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1374, file: !47, line: 3584, baseType: !1495, size: 64, align: 64, offset: 1664)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{!945, !1364, !1187}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1374, file: !47, line: 3589, baseType: !1499, size: 64, align: 64, offset: 1728)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DISubroutineType(types: !1501)
!1501 = !{null, !1364}
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1374, file: !47, line: 3594, baseType: !945, size: 32, align: 32, offset: 1792)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1374, file: !47, line: 3600, baseType: !958, size: 64, align: 64, offset: 1856)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1374, file: !47, line: 3609, baseType: !1505, size: 64, align: 64, offset: 1920)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1508)
!1508 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !47, line: 3609, flags: DIFlagFwdDecl)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1366, file: !47, line: 1566, baseType: !77, size: 32, align: 32, offset: 192)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1366, file: !47, line: 1581, baseType: !1271, size: 32, align: 32, offset: 224)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1366, file: !47, line: 1583, baseType: !965, size: 64, align: 64, offset: 256)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1366, file: !47, line: 1591, baseType: !1513, size: 64, align: 64, offset: 320)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !47, line: 1532, flags: DIFlagFwdDecl)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1366, file: !47, line: 1598, baseType: !965, size: 64, align: 64, offset: 384)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1366, file: !47, line: 1606, baseType: !979, size: 64, align: 64, offset: 448)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1366, file: !47, line: 1614, baseType: !945, size: 32, align: 32, offset: 512)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1366, file: !47, line: 1622, baseType: !945, size: 32, align: 32, offset: 544)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1366, file: !47, line: 1628, baseType: !945, size: 32, align: 32, offset: 576)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1366, file: !47, line: 1636, baseType: !945, size: 32, align: 32, offset: 608)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1366, file: !47, line: 1643, baseType: !945, size: 32, align: 32, offset: 640)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1366, file: !47, line: 1657, baseType: !1094, size: 64, align: 64, offset: 704)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1366, file: !47, line: 1658, baseType: !945, size: 32, align: 32, offset: 768)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1366, file: !47, line: 1679, baseType: !986, size: 64, align: 32, offset: 800)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1366, file: !47, line: 1688, baseType: !945, size: 32, align: 32, offset: 864)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1366, file: !47, line: 1712, baseType: !945, size: 32, align: 32, offset: 896)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1366, file: !47, line: 1729, baseType: !945, size: 32, align: 32, offset: 928)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1366, file: !47, line: 1729, baseType: !945, size: 32, align: 32, offset: 960)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1366, file: !47, line: 1744, baseType: !945, size: 32, align: 32, offset: 992)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1366, file: !47, line: 1744, baseType: !945, size: 32, align: 32, offset: 1024)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1366, file: !47, line: 1751, baseType: !945, size: 32, align: 32, offset: 1056)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1366, file: !47, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1366, file: !47, line: 1791, baseType: !1534, size: 64, align: 64, offset: 1152)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{null, !1537, !1478, !1480, !945, !945, !945}
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1366, file: !47, line: 1808, baseType: !1539, size: 64, align: 64, offset: 1216)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64, align: 64)
!1540 = !DISubroutineType(types: !1541)
!1541 = !{!667, !1537, !1385}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1366, file: !47, line: 1816, baseType: !945, size: 32, align: 32, offset: 1280)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1366, file: !47, line: 1825, baseType: !1544, size: 32, align: 32, offset: 1312)
!1544 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1366, file: !47, line: 1830, baseType: !945, size: 32, align: 32, offset: 1344)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1366, file: !47, line: 1838, baseType: !1544, size: 32, align: 32, offset: 1376)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1366, file: !47, line: 1846, baseType: !945, size: 32, align: 32, offset: 1408)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1366, file: !47, line: 1851, baseType: !945, size: 32, align: 32, offset: 1440)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1366, file: !47, line: 1861, baseType: !1544, size: 32, align: 32, offset: 1472)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1366, file: !47, line: 1868, baseType: !1544, size: 32, align: 32, offset: 1504)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1366, file: !47, line: 1875, baseType: !1544, size: 32, align: 32, offset: 1536)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1366, file: !47, line: 1882, baseType: !1544, size: 32, align: 32, offset: 1568)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1366, file: !47, line: 1889, baseType: !1544, size: 32, align: 32, offset: 1600)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1366, file: !47, line: 1896, baseType: !1544, size: 32, align: 32, offset: 1632)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1366, file: !47, line: 1903, baseType: !1544, size: 32, align: 32, offset: 1664)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1366, file: !47, line: 1910, baseType: !945, size: 32, align: 32, offset: 1696)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1366, file: !47, line: 1915, baseType: !945, size: 32, align: 32, offset: 1728)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1366, file: !47, line: 1926, baseType: !1480, size: 64, align: 64, offset: 1792)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1366, file: !47, line: 1935, baseType: !986, size: 64, align: 32, offset: 1856)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1366, file: !47, line: 1942, baseType: !945, size: 32, align: 32, offset: 1920)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1366, file: !47, line: 1948, baseType: !945, size: 32, align: 32, offset: 1952)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1366, file: !47, line: 1954, baseType: !945, size: 32, align: 32, offset: 1984)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1366, file: !47, line: 1960, baseType: !945, size: 32, align: 32, offset: 2016)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1366, file: !47, line: 1984, baseType: !945, size: 32, align: 32, offset: 2048)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1366, file: !47, line: 1991, baseType: !945, size: 32, align: 32, offset: 2080)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1366, file: !47, line: 1996, baseType: !945, size: 32, align: 32, offset: 2112)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1366, file: !47, line: 2004, baseType: !945, size: 32, align: 32, offset: 2144)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1366, file: !47, line: 2011, baseType: !945, size: 32, align: 32, offset: 2176)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1366, file: !47, line: 2018, baseType: !945, size: 32, align: 32, offset: 2208)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1366, file: !47, line: 2027, baseType: !945, size: 32, align: 32, offset: 2240)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1366, file: !47, line: 2034, baseType: !945, size: 32, align: 32, offset: 2272)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1366, file: !47, line: 2044, baseType: !945, size: 32, align: 32, offset: 2304)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1366, file: !47, line: 2054, baseType: !1574, size: 64, align: 64, offset: 2368)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1366, file: !47, line: 2061, baseType: !1574, size: 64, align: 64, offset: 2432)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1366, file: !47, line: 2066, baseType: !945, size: 32, align: 32, offset: 2496)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1366, file: !47, line: 2070, baseType: !945, size: 32, align: 32, offset: 2528)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1366, file: !47, line: 2078, baseType: !945, size: 32, align: 32, offset: 2560)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1366, file: !47, line: 2085, baseType: !945, size: 32, align: 32, offset: 2592)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1366, file: !47, line: 2092, baseType: !945, size: 32, align: 32, offset: 2624)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1366, file: !47, line: 2099, baseType: !945, size: 32, align: 32, offset: 2656)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1366, file: !47, line: 2106, baseType: !945, size: 32, align: 32, offset: 2688)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1366, file: !47, line: 2113, baseType: !945, size: 32, align: 32, offset: 2720)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1366, file: !47, line: 2120, baseType: !945, size: 32, align: 32, offset: 2752)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1366, file: !47, line: 2125, baseType: !945, size: 32, align: 32, offset: 2784)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1366, file: !47, line: 2133, baseType: !945, size: 32, align: 32, offset: 2816)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1366, file: !47, line: 2140, baseType: !945, size: 32, align: 32, offset: 2848)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1366, file: !47, line: 2145, baseType: !945, size: 32, align: 32, offset: 2880)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1366, file: !47, line: 2153, baseType: !945, size: 32, align: 32, offset: 2912)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1366, file: !47, line: 2158, baseType: !945, size: 32, align: 32, offset: 2944)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1366, file: !47, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1366, file: !47, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1366, file: !47, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1366, file: !47, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1366, file: !47, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1366, file: !47, line: 2203, baseType: !945, size: 32, align: 32, offset: 3136)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1366, file: !47, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1366, file: !47, line: 2212, baseType: !945, size: 32, align: 32, offset: 3200)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1366, file: !47, line: 2213, baseType: !945, size: 32, align: 32, offset: 3232)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1366, file: !47, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1366, file: !47, line: 2232, baseType: !945, size: 32, align: 32, offset: 3296)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1366, file: !47, line: 2243, baseType: !945, size: 32, align: 32, offset: 3328)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1366, file: !47, line: 2249, baseType: !945, size: 32, align: 32, offset: 3360)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1366, file: !47, line: 2256, baseType: !945, size: 32, align: 32, offset: 3392)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1366, file: !47, line: 2263, baseType: !1215, size: 64, align: 64, offset: 3456)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1366, file: !47, line: 2270, baseType: !1215, size: 64, align: 64, offset: 3520)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1366, file: !47, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1366, file: !47, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1366, file: !47, line: 2367, baseType: !1610, size: 64, align: 64, offset: 3648)
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64, align: 64)
!1611 = !DISubroutineType(types: !1612)
!1612 = !{!945, !1537, !1187, !945}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1366, file: !47, line: 2383, baseType: !945, size: 32, align: 32, offset: 3712)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1366, file: !47, line: 2386, baseType: !1544, size: 32, align: 32, offset: 3744)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1366, file: !47, line: 2387, baseType: !1544, size: 32, align: 32, offset: 3776)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1366, file: !47, line: 2394, baseType: !945, size: 32, align: 32, offset: 3808)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1366, file: !47, line: 2401, baseType: !945, size: 32, align: 32, offset: 3840)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1366, file: !47, line: 2408, baseType: !945, size: 32, align: 32, offset: 3872)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1366, file: !47, line: 2415, baseType: !945, size: 32, align: 32, offset: 3904)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1366, file: !47, line: 2422, baseType: !945, size: 32, align: 32, offset: 3936)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1366, file: !47, line: 2423, baseType: !1622, size: 64, align: 64, offset: 3968)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !47, line: 831, baseType: !1624)
!1624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !47, line: 826, size: 128, align: 32, elements: !1625)
!1625 = !{!1626, !1627, !1628, !1629}
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1624, file: !47, line: 827, baseType: !945, size: 32, align: 32)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1624, file: !47, line: 828, baseType: !945, size: 32, align: 32, offset: 32)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1624, file: !47, line: 829, baseType: !945, size: 32, align: 32, offset: 64)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1624, file: !47, line: 830, baseType: !1544, size: 32, align: 32, offset: 96)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1366, file: !47, line: 2430, baseType: !979, size: 64, align: 64, offset: 4032)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1366, file: !47, line: 2437, baseType: !979, size: 64, align: 64, offset: 4096)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1366, file: !47, line: 2444, baseType: !1544, size: 32, align: 32, offset: 4160)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1366, file: !47, line: 2451, baseType: !1544, size: 32, align: 32, offset: 4192)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1366, file: !47, line: 2458, baseType: !945, size: 32, align: 32, offset: 4224)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1366, file: !47, line: 2469, baseType: !945, size: 32, align: 32, offset: 4256)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1366, file: !47, line: 2475, baseType: !945, size: 32, align: 32, offset: 4288)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1366, file: !47, line: 2481, baseType: !945, size: 32, align: 32, offset: 4320)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1366, file: !47, line: 2485, baseType: !945, size: 32, align: 32, offset: 4352)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1366, file: !47, line: 2489, baseType: !945, size: 32, align: 32, offset: 4384)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1366, file: !47, line: 2493, baseType: !945, size: 32, align: 32, offset: 4416)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1366, file: !47, line: 2501, baseType: !945, size: 32, align: 32, offset: 4448)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1366, file: !47, line: 2506, baseType: !945, size: 32, align: 32, offset: 4480)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1366, file: !47, line: 2510, baseType: !945, size: 32, align: 32, offset: 4512)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1366, file: !47, line: 2514, baseType: !979, size: 64, align: 64, offset: 4544)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1366, file: !47, line: 2528, baseType: !1646, size: 64, align: 64, offset: 4608)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DISubroutineType(types: !1648)
!1648 = !{null, !1537, !965, !945, !945}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1366, file: !47, line: 2534, baseType: !945, size: 32, align: 32, offset: 4672)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1366, file: !47, line: 2545, baseType: !945, size: 32, align: 32, offset: 4704)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1366, file: !47, line: 2547, baseType: !945, size: 32, align: 32, offset: 4736)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1366, file: !47, line: 2549, baseType: !945, size: 32, align: 32, offset: 4768)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1366, file: !47, line: 2551, baseType: !945, size: 32, align: 32, offset: 4800)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1366, file: !47, line: 2553, baseType: !945, size: 32, align: 32, offset: 4832)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1366, file: !47, line: 2555, baseType: !945, size: 32, align: 32, offset: 4864)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1366, file: !47, line: 2557, baseType: !945, size: 32, align: 32, offset: 4896)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1366, file: !47, line: 2559, baseType: !945, size: 32, align: 32, offset: 4928)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1366, file: !47, line: 2563, baseType: !945, size: 32, align: 32, offset: 4960)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1366, file: !47, line: 2571, baseType: !1470, size: 64, align: 64, offset: 4992)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1366, file: !47, line: 2579, baseType: !1470, size: 64, align: 64, offset: 5056)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1366, file: !47, line: 2586, baseType: !945, size: 32, align: 32, offset: 5120)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1366, file: !47, line: 2615, baseType: !945, size: 32, align: 32, offset: 5152)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1366, file: !47, line: 2627, baseType: !945, size: 32, align: 32, offset: 5184)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1366, file: !47, line: 2637, baseType: !945, size: 32, align: 32, offset: 5216)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1366, file: !47, line: 2681, baseType: !945, size: 32, align: 32, offset: 5248)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1366, file: !47, line: 2709, baseType: !979, size: 64, align: 64, offset: 5312)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1366, file: !47, line: 2716, baseType: !1668, size: 64, align: 64, offset: 5376)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1670)
!1670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !47, line: 3636, size: 896, align: 64, elements: !1671)
!1671 = !{!1672, !1673, !1674, !1675, !1676, !1677, !1678, !1682, !1686, !1687, !1688, !1689, !1695, !1696, !1697, !1698, !1699}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1670, file: !47, line: 3642, baseType: !958, size: 64, align: 64)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1670, file: !47, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1670, file: !47, line: 3656, baseType: !77, size: 32, align: 32, offset: 96)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1670, file: !47, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1670, file: !47, line: 3669, baseType: !945, size: 32, align: 32, offset: 160)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1670, file: !47, line: 3682, baseType: !1495, size: 64, align: 64, offset: 192)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1670, file: !47, line: 3698, baseType: !1679, size: 64, align: 64, offset: 256)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DISubroutineType(types: !1681)
!1681 = !{!945, !1364, !1318, !1442}
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1670, file: !47, line: 3712, baseType: !1683, size: 64, align: 64, offset: 320)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64, align: 64)
!1684 = !DISubroutineType(types: !1685)
!1685 = !{!945, !1364, !945, !1318, !1442}
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1670, file: !47, line: 3726, baseType: !1679, size: 64, align: 64, offset: 384)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1670, file: !47, line: 3737, baseType: !1411, size: 64, align: 64, offset: 448)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1670, file: !47, line: 3746, baseType: !945, size: 32, align: 32, offset: 512)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1670, file: !47, line: 3757, baseType: !1690, size: 64, align: 64, offset: 576)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DISubroutineType(types: !1692)
!1692 = !{null, !1693}
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64, align: 64)
!1694 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !47, line: 3617, flags: DIFlagFwdDecl)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1670, file: !47, line: 3766, baseType: !1411, size: 64, align: 64, offset: 640)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1670, file: !47, line: 3774, baseType: !1411, size: 64, align: 64, offset: 704)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1670, file: !47, line: 3780, baseType: !945, size: 32, align: 32, offset: 768)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1670, file: !47, line: 3785, baseType: !945, size: 32, align: 32, offset: 800)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1670, file: !47, line: 3795, baseType: !1700, size: 64, align: 64, offset: 832)
!1700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1701, size: 64, align: 64)
!1701 = !DISubroutineType(types: !1702)
!1702 = !{!945, !1364, !1084}
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1366, file: !47, line: 2728, baseType: !965, size: 64, align: 64, offset: 5440)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1366, file: !47, line: 2735, baseType: !1214, size: 512, align: 64, offset: 5504)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1366, file: !47, line: 2742, baseType: !945, size: 32, align: 32, offset: 6016)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1366, file: !47, line: 2755, baseType: !945, size: 32, align: 32, offset: 6048)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1366, file: !47, line: 2776, baseType: !945, size: 32, align: 32, offset: 6080)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1366, file: !47, line: 2783, baseType: !945, size: 32, align: 32, offset: 6112)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1366, file: !47, line: 2791, baseType: !945, size: 32, align: 32, offset: 6144)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1366, file: !47, line: 2802, baseType: !1187, size: 64, align: 64, offset: 6208)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1366, file: !47, line: 2811, baseType: !945, size: 32, align: 32, offset: 6272)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1366, file: !47, line: 2821, baseType: !945, size: 32, align: 32, offset: 6304)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1366, file: !47, line: 2830, baseType: !945, size: 32, align: 32, offset: 6336)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1366, file: !47, line: 2840, baseType: !945, size: 32, align: 32, offset: 6368)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1366, file: !47, line: 2851, baseType: !1716, size: 64, align: 64, offset: 6400)
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64, align: 64)
!1717 = !DISubroutineType(types: !1718)
!1718 = !{!945, !1537, !1719, !965, !1480, !945, !945}
