; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--hlsplaylist.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--hlsplaylist.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVIOContext = type { %struct.AVClass*, i8*, i32, i8*, i8*, i8*, i32 (i8*, i8*, i32)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i64, i32, i32, i32, i64, i8*, i64 (i64, i8*, i32)*, i32, i32 (i8*, i32)*, i64 (i8*, i32, i64, i32)*, i32, i64, i32, i64, i32, i32, i32, i32, i8*, i8*, i32 (i8*, i8*, i32, i32, i64)*, i32, i32, i64, i32 (i8*)*, i64, i8*, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !44, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !44, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !44, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !912, line: 32, size: 32, align: 32, elements: !913)
!912 = !DIFile(filename: "libavformat/hlsplaylist.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!913 = !{!914, !915, !916, !917}
!914 = !DIEnumerator(name: "PLAYLIST_TYPE_NONE", value: 0)
!915 = !DIEnumerator(name: "PLAYLIST_TYPE_EVENT", value: 1)
!916 = !DIEnumerator(name: "PLAYLIST_TYPE_VOD", value: 2)
!917 = !DIEnumerator(name: "PLAYLIST_TYPE_NB", value: 3)
!918 = !{!919, !920, !923, !924}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !921, line: 40, baseType: !922)
!921 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!922 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!923 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!924 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!925 = !{i32 2, !"Dwarf Version", i32 4}
!926 = !{i32 2, !"Debug Info Version", i32 3}
!927 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!928 = distinct !DISubprogram(name: "ff_hls_write_playlist_version", scope: !929, file: !929, line: 31, type: !930, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1044)
!929 = !DIFile(filename: "libavformat/hlsplaylist.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!930 = !DISubroutineType(types: !931)
!931 = !{null, !932, !923}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !25, line: 352, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !25, line: 161, size: 2112, align: 64, elements: !935)
!935 = !{!936, !980, !983, !984, !985, !986, !987, !993, !994, !998, !999, !1000, !1001, !1002, !1004, !1005, !1011, !1012, !1016, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1034, !1035, !1036, !1037, !1041, !1042, !1043}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !934, file: !25, line: 174, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !941)
!941 = !{!942, !946, !950, !954, !955, !956, !957, !961, !967, !969, !973}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !940, file: !4, line: 72, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !940, file: !4, line: 78, baseType: !947, size: 64, align: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!943, !919}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !940, file: !4, line: 85, baseType: !951, size: 64, align: 64, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !940, file: !4, line: 93, baseType: !923, size: 32, align: 32, offset: 192)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !940, file: !4, line: 99, baseType: !923, size: 32, align: 32, offset: 224)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !940, file: !4, line: 108, baseType: !923, size: 32, align: 32, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !940, file: !4, line: 113, baseType: !958, size: 64, align: 64, offset: 320)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!919, !919, !919}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !940, file: !4, line: 123, baseType: !962, size: 64, align: 64, offset: 384)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!965, !965}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !940, file: !4, line: 130, baseType: !968, size: 32, align: 32, offset: 448)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !940, file: !4, line: 136, baseType: !970, size: 64, align: 64, offset: 512)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!968, !919}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !940, file: !4, line: 142, baseType: !974, size: 64, align: 64, offset: 576)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!923, !977, !919, !943, !923}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !934, file: !25, line: 226, baseType: !981, size: 64, align: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !934, file: !25, line: 227, baseType: !923, size: 32, align: 32, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !934, file: !25, line: 228, baseType: !981, size: 64, align: 64, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !934, file: !25, line: 229, baseType: !981, size: 64, align: 64, offset: 256)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !934, file: !25, line: 233, baseType: !919, size: 64, align: 64, offset: 320)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !934, file: !25, line: 235, baseType: !988, size: 64, align: 64, offset: 384)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!923, !919, !991, !923}
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !921, line: 48, baseType: !982)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !934, file: !25, line: 236, baseType: !988, size: 64, align: 64, offset: 448)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !934, file: !25, line: 237, baseType: !995, size: 64, align: 64, offset: 512)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!920, !919, !920, !923}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !934, file: !25, line: 238, baseType: !920, size: 64, align: 64, offset: 576)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !934, file: !25, line: 239, baseType: !923, size: 32, align: 32, offset: 640)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !934, file: !25, line: 240, baseType: !923, size: 32, align: 32, offset: 672)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !934, file: !25, line: 241, baseType: !923, size: 32, align: 32, offset: 704)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !934, file: !25, line: 242, baseType: !1003, size: 64, align: 64, offset: 768)
!1003 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !934, file: !25, line: 243, baseType: !981, size: 64, align: 64, offset: 832)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !934, file: !25, line: 244, baseType: !1006, size: 64, align: 64, offset: 896)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!1003, !1003, !1009, !924}
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !934, file: !25, line: 245, baseType: !923, size: 32, align: 32, offset: 960)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !934, file: !25, line: 249, baseType: !1013, size: 64, align: 64, offset: 1024)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!923, !919, !923}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !934, file: !25, line: 255, baseType: !1017, size: 64, align: 64, offset: 1088)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!920, !919, !923, !920, !923}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !934, file: !25, line: 260, baseType: !923, size: 32, align: 32, offset: 1152)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !934, file: !25, line: 266, baseType: !920, size: 64, align: 64, offset: 1216)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !934, file: !25, line: 273, baseType: !923, size: 32, align: 32, offset: 1280)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !934, file: !25, line: 279, baseType: !920, size: 64, align: 64, offset: 1344)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !934, file: !25, line: 285, baseType: !923, size: 32, align: 32, offset: 1408)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !934, file: !25, line: 291, baseType: !923, size: 32, align: 32, offset: 1440)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !934, file: !25, line: 298, baseType: !923, size: 32, align: 32, offset: 1472)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !934, file: !25, line: 304, baseType: !923, size: 32, align: 32, offset: 1504)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !934, file: !25, line: 309, baseType: !943, size: 64, align: 64, offset: 1536)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !934, file: !25, line: 314, baseType: !943, size: 64, align: 64, offset: 1600)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !934, file: !25, line: 319, baseType: !1031, size: 64, align: 64, offset: 1664)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!923, !919, !991, !923, !24, !920}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !934, file: !25, line: 326, baseType: !923, size: 32, align: 32, offset: 1728)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !934, file: !25, line: 331, baseType: !24, size: 32, align: 32, offset: 1760)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !934, file: !25, line: 332, baseType: !920, size: 64, align: 64, offset: 1792)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !934, file: !25, line: 338, baseType: !1038, size: 64, align: 64, offset: 1856)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!923, !919}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !934, file: !25, line: 340, baseType: !920, size: 64, align: 64, offset: 1920)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !934, file: !25, line: 346, baseType: !981, size: 64, align: 64, offset: 1984)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !934, file: !25, line: 351, baseType: !923, size: 32, align: 32, offset: 2048)
!1044 = !{}
!1045 = !DILocalVariable(name: "out", arg: 1, scope: !928, file: !929, line: 31, type: !932)
!1046 = !DIExpression()
!1047 = !DILocation(line: 31, column: 49, scope: !928)
!1048 = !DILocalVariable(name: "version", arg: 2, scope: !928, file: !929, line: 31, type: !923)
!1049 = !DILocation(line: 31, column: 58, scope: !928)
!1050 = !DILocation(line: 32, column: 10, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !928, file: !929, line: 32, column: 9)
!1052 = !DILocation(line: 32, column: 9, scope: !928)
!1053 = !DILocation(line: 33, column: 9, scope: !1051)
!1054 = !DILocation(line: 34, column: 17, scope: !928)
!1055 = !DILocation(line: 34, column: 5, scope: !928)
!1056 = !DILocation(line: 35, column: 17, scope: !928)
!1057 = !DILocation(line: 35, column: 45, scope: !928)
!1058 = !DILocation(line: 35, column: 5, scope: !928)
!1059 = !DILocation(line: 36, column: 1, scope: !928)
!1060 = !DILocation(line: 36, column: 1, scope: !1061)
!1061 = !DILexicalBlockFile(scope: !928, file: !929, discriminator: 1)
!1062 = distinct !DISubprogram(name: "ff_hls_write_audio_rendition", scope: !929, file: !929, line: 38, type: !1063, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1044)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{null, !932, !1065, !1065, !1065, !923, !923}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1066 = !DILocalVariable(name: "out", arg: 1, scope: !1062, file: !929, line: 38, type: !932)
!1067 = !DILocation(line: 38, column: 48, scope: !1062)
!1068 = !DILocalVariable(name: "agroup", arg: 2, scope: !1062, file: !929, line: 38, type: !1065)
!1069 = !DILocation(line: 38, column: 59, scope: !1062)
!1070 = !DILocalVariable(name: "filename", arg: 3, scope: !1062, file: !929, line: 39, type: !1065)
!1071 = !DILocation(line: 39, column: 41, scope: !1062)
!1072 = !DILocalVariable(name: "language", arg: 4, scope: !1062, file: !929, line: 39, type: !1065)
!1073 = !DILocation(line: 39, column: 57, scope: !1062)
!1074 = !DILocalVariable(name: "name_id", arg: 5, scope: !1062, file: !929, line: 39, type: !923)
!1075 = !DILocation(line: 39, column: 71, scope: !1062)
!1076 = !DILocalVariable(name: "is_default", arg: 6, scope: !1062, file: !929, line: 39, type: !923)
!1077 = !DILocation(line: 39, column: 84, scope: !1062)
!1078 = !DILocation(line: 40, column: 10, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1062, file: !929, line: 40, column: 9)
!1080 = !DILocation(line: 40, column: 14, scope: !1079)
!1081 = !DILocation(line: 40, column: 18, scope: !1082)
!1082 = !DILexicalBlockFile(scope: !1079, file: !929, discriminator: 1)
!1083 = !DILocation(line: 40, column: 25, scope: !1082)
!1084 = !DILocation(line: 40, column: 29, scope: !1085)
!1085 = !DILexicalBlockFile(scope: !1079, file: !929, discriminator: 2)
!1086 = !DILocation(line: 40, column: 9, scope: !1085)
!1087 = !DILocation(line: 41, column: 9, scope: !1079)
!1088 = !DILocation(line: 43, column: 17, scope: !1062)
!1089 = !DILocation(line: 43, column: 71, scope: !1062)
!1090 = !DILocation(line: 43, column: 5, scope: !1062)
!1091 = !DILocation(line: 44, column: 17, scope: !1062)
!1092 = !DILocation(line: 44, column: 56, scope: !1062)
!1093 = !DILocation(line: 44, column: 65, scope: !1062)
!1094 = !DILocation(line: 44, column: 5, scope: !1062)
!1095 = !DILocation(line: 45, column: 9, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1062, file: !929, line: 45, column: 9)
!1097 = !DILocation(line: 45, column: 9, scope: !1062)
!1098 = !DILocation(line: 46, column: 21, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1096, file: !929, line: 45, column: 19)
!1100 = !DILocation(line: 46, column: 46, scope: !1099)
!1101 = !DILocation(line: 46, column: 9, scope: !1099)
!1102 = !DILocation(line: 47, column: 5, scope: !1099)
!1103 = !DILocation(line: 48, column: 17, scope: !1062)
!1104 = !DILocation(line: 48, column: 38, scope: !1062)
!1105 = !DILocation(line: 48, column: 5, scope: !1062)
!1106 = !DILocation(line: 49, column: 1, scope: !1062)
!1107 = !DILocation(line: 49, column: 1, scope: !1108)
!1108 = !DILexicalBlockFile(scope: !1062, file: !929, discriminator: 1)
!1109 = distinct !DISubprogram(name: "ff_hls_write_stream_info", scope: !929, file: !929, line: 51, type: !1110, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1044)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{null, !1112, !932, !923, !1065, !1065, !1065, !1065}
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1115)
!1115 = !{!1116, !1117, !1118, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1714, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1815, !1821, !1829, !1833, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1865, !1866, !1867, !1868, !1869, !1870}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1114, file: !897, line: 866, baseType: !923, size: 32, align: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1114, file: !897, line: 872, baseType: !923, size: 32, align: 32, offset: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1114, file: !897, line: 878, baseType: !1119, size: 64, align: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !44, line: 3360, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !44, line: 1556, size: 8448, align: 64, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1126, !1389, !1390, !1391, !1392, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1418, !1422, !1423, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1602, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1121, file: !44, line: 1561, baseType: !937, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1121, file: !44, line: 1562, baseType: !923, size: 32, align: 32, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1121, file: !44, line: 1564, baseType: !33, size: 32, align: 32, offset: 96)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1121, file: !44, line: 1565, baseType: !1127, size: 64, align: 64, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !44, line: 3468, size: 1984, align: 64, elements: !1130)
!1130 = !{!1131, !1132, !1133, !1134, !1135, !1136, !1145, !1148, !1151, !1154, !1158, !1159, !1160, !1168, !1169, !1170, !1172, !1176, !1182, !1187, !1191, !1192, !1239, !1360, !1364, !1365, !1369, !1373, !1378, !1382, !1383, !1384}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1129, file: !44, line: 3475, baseType: !943, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1129, file: !44, line: 3480, baseType: !943, size: 64, align: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1129, file: !44, line: 3481, baseType: !33, size: 32, align: 32, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1129, file: !44, line: 3482, baseType: !43, size: 32, align: 32, offset: 160)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1129, file: !44, line: 3487, baseType: !923, size: 32, align: 32, offset: 192)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1129, file: !44, line: 3488, baseType: !1137, size: 64, align: 64, offset: 256)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1139)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1140, line: 61, baseType: !1141)
!1140 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1140, line: 58, size: 64, align: 32, elements: !1142)
!1142 = !{!1143, !1144}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1141, file: !1140, line: 59, baseType: !923, size: 32, align: 32)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1141, file: !1140, line: 60, baseType: !923, size: 32, align: 32, offset: 32)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1129, file: !44, line: 3489, baseType: !1146, size: 64, align: 64, offset: 320)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1129, file: !44, line: 3490, baseType: !1149, size: 64, align: 64, offset: 384)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1129, file: !44, line: 3491, baseType: !1152, size: 64, align: 64, offset: 448)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !703)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1129, file: !44, line: 3492, baseType: !1155, size: 64, align: 64, offset: 512)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1157)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !921, line: 55, baseType: !1003)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1129, file: !44, line: 3493, baseType: !992, size: 8, align: 8, offset: 576)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1129, file: !44, line: 3494, baseType: !937, size: 64, align: 64, offset: 640)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1129, file: !44, line: 3495, baseType: !1161, size: 64, align: 64, offset: 704)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1163)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !44, line: 3404, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !44, line: 3401, size: 128, align: 64, elements: !1165)
!1165 = !{!1166, !1167}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1164, file: !44, line: 3402, baseType: !923, size: 32, align: 32)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1164, file: !44, line: 3403, baseType: !943, size: 64, align: 64, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1129, file: !44, line: 3507, baseType: !943, size: 64, align: 64, offset: 768)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1129, file: !44, line: 3516, baseType: !923, size: 32, align: 32, offset: 832)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1129, file: !44, line: 3517, baseType: !1171, size: 64, align: 64, offset: 896)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1129, file: !44, line: 3527, baseType: !1173, size: 64, align: 64, offset: 960)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{!923, !1119}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1129, file: !44, line: 3535, baseType: !1177, size: 64, align: 64, offset: 1024)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!923, !1119, !1180}
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1120)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1129, file: !44, line: 3541, baseType: !1183, size: 64, align: 64, offset: 1088)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1185)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !44, line: 3461, baseType: !1186)
!1186 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !44, line: 3461, flags: DIFlagFwdDecl)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1129, file: !44, line: 3549, baseType: !1188, size: 64, align: 64, offset: 1152)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DISubroutineType(types: !1190)
!1190 = !{null, !1171}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1129, file: !44, line: 3551, baseType: !1173, size: 64, align: 64, offset: 1216)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1129, file: !44, line: 3552, baseType: !1193, size: 64, align: 64, offset: 1280)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!923, !1119, !991, !923, !1196}
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !44, line: 3920, size: 256, align: 64, elements: !1199)
!1199 = !{!1200, !1203, !1205, !1206, !1207, !1238}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1198, file: !44, line: 3921, baseType: !1201, size: 16, align: 16)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !921, line: 49, baseType: !1202)
!1202 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1198, file: !44, line: 3922, baseType: !1204, size: 32, align: 32, offset: 32)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !921, line: 51, baseType: !924)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1198, file: !44, line: 3923, baseType: !1204, size: 32, align: 32, offset: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1198, file: !44, line: 3924, baseType: !924, size: 32, align: 32, offset: 96)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1198, file: !44, line: 3925, baseType: !1208, size: 64, align: 64, offset: 128)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !44, line: 3918, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !44, line: 3885, size: 1600, align: 64, elements: !1212)
!1212 = !{!1213, !1214, !1215, !1216, !1217, !1218, !1228, !1232, !1234, !1235, !1236, !1237}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1211, file: !44, line: 3886, baseType: !923, size: 32, align: 32)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1211, file: !44, line: 3887, baseType: !923, size: 32, align: 32, offset: 32)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1211, file: !44, line: 3888, baseType: !923, size: 32, align: 32, offset: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1211, file: !44, line: 3889, baseType: !923, size: 32, align: 32, offset: 96)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1211, file: !44, line: 3890, baseType: !923, size: 32, align: 32, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1211, file: !44, line: 3897, baseType: !1219, size: 768, align: 64, offset: 192)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !44, line: 3858, baseType: !1220)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !44, line: 3853, size: 768, align: 64, elements: !1221)
!1221 = !{!1222, !1226}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1220, file: !44, line: 3855, baseType: !1223, size: 512, align: 64)
!1223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !991, size: 512, align: 64, elements: !1224)
!1224 = !{!1225}
!1225 = !DISubrange(count: 8)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1220, file: !44, line: 3857, baseType: !1227, size: 256, align: 32, offset: 512)
!1227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 256, align: 32, elements: !1224)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1211, file: !44, line: 3903, baseType: !1229, size: 256, align: 64, offset: 960)
!1229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !991, size: 256, align: 64, elements: !1230)
!1230 = !{!1231}
!1231 = !DISubrange(count: 4)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1211, file: !44, line: 3904, baseType: !1233, size: 128, align: 32, offset: 1216)
!1233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 128, align: 32, elements: !1230)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1211, file: !44, line: 3906, baseType: !720, size: 32, align: 32, offset: 1344)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1211, file: !44, line: 3908, baseType: !1065, size: 64, align: 64, offset: 1408)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1211, file: !44, line: 3915, baseType: !1065, size: 64, align: 64, offset: 1472)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1211, file: !44, line: 3917, baseType: !923, size: 32, align: 32, offset: 1536)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1198, file: !44, line: 3926, baseType: !920, size: 64, align: 64, offset: 192)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1129, file: !44, line: 3564, baseType: !1240, size: 64, align: 64, offset: 1344)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!923, !1119, !1243, !1277, !1359}
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !44, line: 1499, baseType: !1245)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !44, line: 1445, size: 704, align: 64, elements: !1246)
!1246 = !{!1247, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1273, !1274, !1275, !1276}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1245, file: !44, line: 1451, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1250, line: 94, baseType: !1251)
!1250 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1250, line: 81, size: 192, align: 64, elements: !1252)
!1252 = !{!1253, !1257, !1258}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1251, file: !1250, line: 82, baseType: !1254, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1250, line: 73, baseType: !1256)
!1256 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1250, line: 73, flags: DIFlagFwdDecl)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1251, file: !1250, line: 89, baseType: !991, size: 64, align: 64, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1251, file: !1250, line: 93, baseType: !923, size: 32, align: 32, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1245, file: !44, line: 1461, baseType: !920, size: 64, align: 64, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1245, file: !44, line: 1467, baseType: !920, size: 64, align: 64, offset: 128)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1245, file: !44, line: 1468, baseType: !991, size: 64, align: 64, offset: 192)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1245, file: !44, line: 1469, baseType: !923, size: 32, align: 32, offset: 256)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1245, file: !44, line: 1470, baseType: !923, size: 32, align: 32, offset: 288)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1245, file: !44, line: 1474, baseType: !923, size: 32, align: 32, offset: 320)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1245, file: !44, line: 1479, baseType: !1266, size: 64, align: 64, offset: 384)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !44, line: 1415, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !44, line: 1411, size: 128, align: 64, elements: !1269)
!1269 = !{!1270, !1271, !1272}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1268, file: !44, line: 1412, baseType: !991, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1268, file: !44, line: 1413, baseType: !923, size: 32, align: 32, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1268, file: !44, line: 1414, baseType: !726, size: 32, align: 32, offset: 96)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1245, file: !44, line: 1480, baseType: !923, size: 32, align: 32, offset: 448)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1245, file: !44, line: 1486, baseType: !920, size: 64, align: 64, offset: 512)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1245, file: !44, line: 1488, baseType: !920, size: 64, align: 64, offset: 576)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1245, file: !44, line: 1497, baseType: !920, size: 64, align: 64, offset: 640)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1279)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !767, line: 646, baseType: !1280)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !767, line: 268, size: 4288, align: 64, elements: !1281)
!1281 = !{!1282, !1283, !1284, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1311, !1313, !1314, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1347, !1348, !1349, !1350, !1351, !1352, !1355, !1356, !1357, !1358}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1280, file: !767, line: 282, baseType: !1223, size: 512, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1280, file: !767, line: 299, baseType: !1227, size: 256, align: 32, offset: 512)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1280, file: !767, line: 315, baseType: !1285, size: 64, align: 64, offset: 768)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1280, file: !767, line: 326, baseType: !923, size: 32, align: 32, offset: 832)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1280, file: !767, line: 326, baseType: !923, size: 32, align: 32, offset: 864)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1280, file: !767, line: 334, baseType: !923, size: 32, align: 32, offset: 896)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1280, file: !767, line: 341, baseType: !923, size: 32, align: 32, offset: 928)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1280, file: !767, line: 346, baseType: !923, size: 32, align: 32, offset: 960)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1280, file: !767, line: 351, baseType: !756, size: 32, align: 32, offset: 992)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1280, file: !767, line: 356, baseType: !1139, size: 64, align: 32, offset: 1024)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1280, file: !767, line: 361, baseType: !920, size: 64, align: 64, offset: 1088)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1280, file: !767, line: 369, baseType: !920, size: 64, align: 64, offset: 1152)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1280, file: !767, line: 377, baseType: !920, size: 64, align: 64, offset: 1216)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1280, file: !767, line: 382, baseType: !923, size: 32, align: 32, offset: 1280)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1280, file: !767, line: 386, baseType: !923, size: 32, align: 32, offset: 1312)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1280, file: !767, line: 391, baseType: !923, size: 32, align: 32, offset: 1344)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1280, file: !767, line: 396, baseType: !919, size: 64, align: 64, offset: 1408)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1280, file: !767, line: 403, baseType: !1301, size: 512, align: 64, offset: 1472)
!1301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1157, size: 512, align: 64, elements: !1224)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1280, file: !767, line: 410, baseType: !923, size: 32, align: 32, offset: 1984)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1280, file: !767, line: 415, baseType: !923, size: 32, align: 32, offset: 2016)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1280, file: !767, line: 420, baseType: !923, size: 32, align: 32, offset: 2048)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1280, file: !767, line: 425, baseType: !923, size: 32, align: 32, offset: 2080)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1280, file: !767, line: 435, baseType: !920, size: 64, align: 64, offset: 2112)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1280, file: !767, line: 440, baseType: !923, size: 32, align: 32, offset: 2176)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1280, file: !767, line: 445, baseType: !1157, size: 64, align: 64, offset: 2240)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1280, file: !767, line: 459, baseType: !1310, size: 512, align: 64, offset: 2304)
!1310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1248, size: 512, align: 64, elements: !1224)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1280, file: !767, line: 473, baseType: !1312, size: 64, align: 64, offset: 2816)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1280, file: !767, line: 477, baseType: !923, size: 32, align: 32, offset: 2880)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1280, file: !767, line: 479, baseType: !1315, size: 64, align: 64, offset: 2944)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !767, line: 207, baseType: !1318)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !767, line: 201, size: 320, align: 64, elements: !1319)
!1319 = !{!1320, !1321, !1322, !1323, !1328}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1318, file: !767, line: 202, baseType: !766, size: 32, align: 32)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1318, file: !767, line: 203, baseType: !991, size: 64, align: 64, offset: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1318, file: !767, line: 204, baseType: !923, size: 32, align: 32, offset: 128)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1318, file: !767, line: 205, baseType: !1324, size: 64, align: 64, offset: 192)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1326, line: 86, baseType: !1327)
!1326 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1327 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1326, line: 86, flags: DIFlagFwdDecl)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1318, file: !767, line: 206, baseType: !1248, size: 64, align: 64, offset: 256)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1280, file: !767, line: 480, baseType: !923, size: 32, align: 32, offset: 3008)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1280, file: !767, line: 505, baseType: !923, size: 32, align: 32, offset: 3040)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1280, file: !767, line: 512, baseType: !790, size: 32, align: 32, offset: 3072)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1280, file: !767, line: 514, baseType: !796, size: 32, align: 32, offset: 3104)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1280, file: !767, line: 516, baseType: !814, size: 32, align: 32, offset: 3136)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1280, file: !767, line: 523, baseType: !838, size: 32, align: 32, offset: 3168)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1280, file: !767, line: 525, baseType: !857, size: 32, align: 32, offset: 3200)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1280, file: !767, line: 532, baseType: !920, size: 64, align: 64, offset: 3264)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1280, file: !767, line: 539, baseType: !920, size: 64, align: 64, offset: 3328)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1280, file: !767, line: 547, baseType: !920, size: 64, align: 64, offset: 3392)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1280, file: !767, line: 554, baseType: !1324, size: 64, align: 64, offset: 3456)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1280, file: !767, line: 563, baseType: !923, size: 32, align: 32, offset: 3520)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1280, file: !767, line: 572, baseType: !923, size: 32, align: 32, offset: 3552)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1280, file: !767, line: 581, baseType: !923, size: 32, align: 32, offset: 3584)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1280, file: !767, line: 588, baseType: !1344, size: 64, align: 64, offset: 3648)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !921, line: 36, baseType: !1346)
!1346 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1280, file: !767, line: 593, baseType: !923, size: 32, align: 32, offset: 3712)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1280, file: !767, line: 596, baseType: !923, size: 32, align: 32, offset: 3744)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1280, file: !767, line: 599, baseType: !1248, size: 64, align: 64, offset: 3776)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1280, file: !767, line: 605, baseType: !1248, size: 64, align: 64, offset: 3840)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1280, file: !767, line: 616, baseType: !1248, size: 64, align: 64, offset: 3904)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1280, file: !767, line: 626, baseType: !1353, size: 64, align: 64, offset: 3968)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1354, line: 216, baseType: !1003)
!1354 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1280, file: !767, line: 627, baseType: !1353, size: 64, align: 64, offset: 4032)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1280, file: !767, line: 628, baseType: !1353, size: 64, align: 64, offset: 4096)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1280, file: !767, line: 629, baseType: !1353, size: 64, align: 64, offset: 4160)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1280, file: !767, line: 645, baseType: !1248, size: 64, align: 64, offset: 4224)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1129, file: !44, line: 3566, baseType: !1361, size: 64, align: 64, offset: 1408)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DISubroutineType(types: !1363)
!1363 = !{!923, !1119, !919, !1359, !1243}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1129, file: !44, line: 3567, baseType: !1173, size: 64, align: 64, offset: 1472)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1129, file: !44, line: 3576, baseType: !1366, size: 64, align: 64, offset: 1536)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DISubroutineType(types: !1368)
!1368 = !{!923, !1119, !1277}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1129, file: !44, line: 3577, baseType: !1370, size: 64, align: 64, offset: 1600)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DISubroutineType(types: !1372)
!1372 = !{!923, !1119, !1243}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1129, file: !44, line: 3584, baseType: !1374, size: 64, align: 64, offset: 1664)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DISubroutineType(types: !1376)
!1376 = !{!923, !1119, !1377}
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1129, file: !44, line: 3589, baseType: !1379, size: 64, align: 64, offset: 1728)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DISubroutineType(types: !1381)
!1381 = !{null, !1119}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1129, file: !44, line: 3594, baseType: !923, size: 32, align: 32, offset: 1792)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1129, file: !44, line: 3600, baseType: !943, size: 64, align: 64, offset: 1856)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1129, file: !44, line: 3609, baseType: !1385, size: 64, align: 64, offset: 1920)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1388)
!1388 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !44, line: 3609, flags: DIFlagFwdDecl)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1121, file: !44, line: 1566, baseType: !43, size: 32, align: 32, offset: 192)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1121, file: !44, line: 1581, baseType: !924, size: 32, align: 32, offset: 224)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1121, file: !44, line: 1583, baseType: !919, size: 64, align: 64, offset: 256)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1121, file: !44, line: 1591, baseType: !1393, size: 64, align: 64, offset: 320)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !44, line: 1532, flags: DIFlagFwdDecl)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1121, file: !44, line: 1598, baseType: !919, size: 64, align: 64, offset: 384)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1121, file: !44, line: 1606, baseType: !920, size: 64, align: 64, offset: 448)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1121, file: !44, line: 1614, baseType: !923, size: 32, align: 32, offset: 512)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1121, file: !44, line: 1622, baseType: !923, size: 32, align: 32, offset: 544)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1121, file: !44, line: 1628, baseType: !923, size: 32, align: 32, offset: 576)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1121, file: !44, line: 1636, baseType: !923, size: 32, align: 32, offset: 608)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1121, file: !44, line: 1643, baseType: !923, size: 32, align: 32, offset: 640)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1121, file: !44, line: 1657, baseType: !991, size: 64, align: 64, offset: 704)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1121, file: !44, line: 1658, baseType: !923, size: 32, align: 32, offset: 768)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1121, file: !44, line: 1679, baseType: !1139, size: 64, align: 32, offset: 800)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1121, file: !44, line: 1688, baseType: !923, size: 32, align: 32, offset: 864)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1121, file: !44, line: 1712, baseType: !923, size: 32, align: 32, offset: 896)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1121, file: !44, line: 1729, baseType: !923, size: 32, align: 32, offset: 928)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1121, file: !44, line: 1729, baseType: !923, size: 32, align: 32, offset: 960)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1121, file: !44, line: 1744, baseType: !923, size: 32, align: 32, offset: 992)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1121, file: !44, line: 1744, baseType: !923, size: 32, align: 32, offset: 1024)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1121, file: !44, line: 1751, baseType: !923, size: 32, align: 32, offset: 1056)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1121, file: !44, line: 1766, baseType: !503, size: 32, align: 32, offset: 1088)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1121, file: !44, line: 1791, baseType: !1414, size: 64, align: 64, offset: 1152)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{null, !1417, !1277, !1359, !923, !923, !923}
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1121, file: !44, line: 1808, baseType: !1419, size: 64, align: 64, offset: 1216)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DISubroutineType(types: !1421)
!1421 = !{!503, !1417, !1146}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1121, file: !44, line: 1816, baseType: !923, size: 32, align: 32, offset: 1280)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1121, file: !44, line: 1825, baseType: !1424, size: 32, align: 32, offset: 1312)
!1424 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1121, file: !44, line: 1830, baseType: !923, size: 32, align: 32, offset: 1344)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1121, file: !44, line: 1838, baseType: !1424, size: 32, align: 32, offset: 1376)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1121, file: !44, line: 1846, baseType: !923, size: 32, align: 32, offset: 1408)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1121, file: !44, line: 1851, baseType: !923, size: 32, align: 32, offset: 1440)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1121, file: !44, line: 1861, baseType: !1424, size: 32, align: 32, offset: 1472)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1121, file: !44, line: 1868, baseType: !1424, size: 32, align: 32, offset: 1504)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1121, file: !44, line: 1875, baseType: !1424, size: 32, align: 32, offset: 1536)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1121, file: !44, line: 1882, baseType: !1424, size: 32, align: 32, offset: 1568)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1121, file: !44, line: 1889, baseType: !1424, size: 32, align: 32, offset: 1600)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1121, file: !44, line: 1896, baseType: !1424, size: 32, align: 32, offset: 1632)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1121, file: !44, line: 1903, baseType: !1424, size: 32, align: 32, offset: 1664)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1121, file: !44, line: 1910, baseType: !923, size: 32, align: 32, offset: 1696)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1121, file: !44, line: 1915, baseType: !923, size: 32, align: 32, offset: 1728)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1121, file: !44, line: 1926, baseType: !1359, size: 64, align: 64, offset: 1792)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1121, file: !44, line: 1935, baseType: !1139, size: 64, align: 32, offset: 1856)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1121, file: !44, line: 1942, baseType: !923, size: 32, align: 32, offset: 1920)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1121, file: !44, line: 1948, baseType: !923, size: 32, align: 32, offset: 1952)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1121, file: !44, line: 1954, baseType: !923, size: 32, align: 32, offset: 1984)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1121, file: !44, line: 1960, baseType: !923, size: 32, align: 32, offset: 2016)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1121, file: !44, line: 1984, baseType: !923, size: 32, align: 32, offset: 2048)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1121, file: !44, line: 1991, baseType: !923, size: 32, align: 32, offset: 2080)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1121, file: !44, line: 1996, baseType: !923, size: 32, align: 32, offset: 2112)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1121, file: !44, line: 2004, baseType: !923, size: 32, align: 32, offset: 2144)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1121, file: !44, line: 2011, baseType: !923, size: 32, align: 32, offset: 2176)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1121, file: !44, line: 2018, baseType: !923, size: 32, align: 32, offset: 2208)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1121, file: !44, line: 2027, baseType: !923, size: 32, align: 32, offset: 2240)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1121, file: !44, line: 2034, baseType: !923, size: 32, align: 32, offset: 2272)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1121, file: !44, line: 2044, baseType: !923, size: 32, align: 32, offset: 2304)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1121, file: !44, line: 2054, baseType: !1454, size: 64, align: 64, offset: 2368)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1121, file: !44, line: 2061, baseType: !1454, size: 64, align: 64, offset: 2432)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1121, file: !44, line: 2066, baseType: !923, size: 32, align: 32, offset: 2496)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1121, file: !44, line: 2070, baseType: !923, size: 32, align: 32, offset: 2528)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1121, file: !44, line: 2078, baseType: !923, size: 32, align: 32, offset: 2560)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1121, file: !44, line: 2085, baseType: !923, size: 32, align: 32, offset: 2592)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1121, file: !44, line: 2092, baseType: !923, size: 32, align: 32, offset: 2624)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1121, file: !44, line: 2099, baseType: !923, size: 32, align: 32, offset: 2656)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1121, file: !44, line: 2106, baseType: !923, size: 32, align: 32, offset: 2688)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1121, file: !44, line: 2113, baseType: !923, size: 32, align: 32, offset: 2720)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1121, file: !44, line: 2120, baseType: !923, size: 32, align: 32, offset: 2752)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1121, file: !44, line: 2125, baseType: !923, size: 32, align: 32, offset: 2784)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1121, file: !44, line: 2133, baseType: !923, size: 32, align: 32, offset: 2816)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1121, file: !44, line: 2140, baseType: !923, size: 32, align: 32, offset: 2848)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1121, file: !44, line: 2145, baseType: !923, size: 32, align: 32, offset: 2880)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1121, file: !44, line: 2153, baseType: !923, size: 32, align: 32, offset: 2912)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1121, file: !44, line: 2158, baseType: !923, size: 32, align: 32, offset: 2944)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1121, file: !44, line: 2166, baseType: !796, size: 32, align: 32, offset: 2976)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1121, file: !44, line: 2173, baseType: !814, size: 32, align: 32, offset: 3008)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1121, file: !44, line: 2180, baseType: !838, size: 32, align: 32, offset: 3040)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1121, file: !44, line: 2187, baseType: !790, size: 32, align: 32, offset: 3072)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1121, file: !44, line: 2194, baseType: !857, size: 32, align: 32, offset: 3104)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1121, file: !44, line: 2203, baseType: !923, size: 32, align: 32, offset: 3136)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1121, file: !44, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1121, file: !44, line: 2212, baseType: !923, size: 32, align: 32, offset: 3200)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1121, file: !44, line: 2213, baseType: !923, size: 32, align: 32, offset: 3232)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1121, file: !44, line: 2220, baseType: !703, size: 32, align: 32, offset: 3264)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1121, file: !44, line: 2232, baseType: !923, size: 32, align: 32, offset: 3296)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1121, file: !44, line: 2243, baseType: !923, size: 32, align: 32, offset: 3328)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1121, file: !44, line: 2249, baseType: !923, size: 32, align: 32, offset: 3360)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1121, file: !44, line: 2256, baseType: !923, size: 32, align: 32, offset: 3392)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1121, file: !44, line: 2263, baseType: !1157, size: 64, align: 64, offset: 3456)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1121, file: !44, line: 2270, baseType: !1157, size: 64, align: 64, offset: 3520)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1121, file: !44, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1121, file: !44, line: 2285, baseType: !703, size: 32, align: 32, offset: 3616)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1121, file: !44, line: 2367, baseType: !1490, size: 64, align: 64, offset: 3648)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DISubroutineType(types: !1492)
!1492 = !{!923, !1417, !1377, !923}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1121, file: !44, line: 2383, baseType: !923, size: 32, align: 32, offset: 3712)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1121, file: !44, line: 2386, baseType: !1424, size: 32, align: 32, offset: 3744)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1121, file: !44, line: 2387, baseType: !1424, size: 32, align: 32, offset: 3776)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1121, file: !44, line: 2394, baseType: !923, size: 32, align: 32, offset: 3808)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1121, file: !44, line: 2401, baseType: !923, size: 32, align: 32, offset: 3840)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1121, file: !44, line: 2408, baseType: !923, size: 32, align: 32, offset: 3872)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1121, file: !44, line: 2415, baseType: !923, size: 32, align: 32, offset: 3904)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1121, file: !44, line: 2422, baseType: !923, size: 32, align: 32, offset: 3936)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1121, file: !44, line: 2423, baseType: !1502, size: 64, align: 64, offset: 3968)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !44, line: 831, baseType: !1504)
!1504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !44, line: 826, size: 128, align: 32, elements: !1505)
!1505 = !{!1506, !1507, !1508, !1509}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1504, file: !44, line: 827, baseType: !923, size: 32, align: 32)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1504, file: !44, line: 828, baseType: !923, size: 32, align: 32, offset: 32)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1504, file: !44, line: 829, baseType: !923, size: 32, align: 32, offset: 64)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1504, file: !44, line: 830, baseType: !1424, size: 32, align: 32, offset: 96)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1121, file: !44, line: 2430, baseType: !920, size: 64, align: 64, offset: 4032)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1121, file: !44, line: 2437, baseType: !920, size: 64, align: 64, offset: 4096)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1121, file: !44, line: 2444, baseType: !1424, size: 32, align: 32, offset: 4160)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1121, file: !44, line: 2451, baseType: !1424, size: 32, align: 32, offset: 4192)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1121, file: !44, line: 2458, baseType: !923, size: 32, align: 32, offset: 4224)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1121, file: !44, line: 2469, baseType: !923, size: 32, align: 32, offset: 4256)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1121, file: !44, line: 2475, baseType: !923, size: 32, align: 32, offset: 4288)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1121, file: !44, line: 2481, baseType: !923, size: 32, align: 32, offset: 4320)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1121, file: !44, line: 2485, baseType: !923, size: 32, align: 32, offset: 4352)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1121, file: !44, line: 2489, baseType: !923, size: 32, align: 32, offset: 4384)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1121, file: !44, line: 2493, baseType: !923, size: 32, align: 32, offset: 4416)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1121, file: !44, line: 2501, baseType: !923, size: 32, align: 32, offset: 4448)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1121, file: !44, line: 2506, baseType: !923, size: 32, align: 32, offset: 4480)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1121, file: !44, line: 2510, baseType: !923, size: 32, align: 32, offset: 4512)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1121, file: !44, line: 2514, baseType: !920, size: 64, align: 64, offset: 4544)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1121, file: !44, line: 2528, baseType: !1526, size: 64, align: 64, offset: 4608)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64, align: 64)
!1527 = !DISubroutineType(types: !1528)
!1528 = !{null, !1417, !919, !923, !923}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1121, file: !44, line: 2534, baseType: !923, size: 32, align: 32, offset: 4672)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1121, file: !44, line: 2545, baseType: !923, size: 32, align: 32, offset: 4704)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1121, file: !44, line: 2547, baseType: !923, size: 32, align: 32, offset: 4736)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1121, file: !44, line: 2549, baseType: !923, size: 32, align: 32, offset: 4768)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1121, file: !44, line: 2551, baseType: !923, size: 32, align: 32, offset: 4800)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1121, file: !44, line: 2553, baseType: !923, size: 32, align: 32, offset: 4832)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1121, file: !44, line: 2555, baseType: !923, size: 32, align: 32, offset: 4864)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1121, file: !44, line: 2557, baseType: !923, size: 32, align: 32, offset: 4896)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1121, file: !44, line: 2559, baseType: !923, size: 32, align: 32, offset: 4928)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1121, file: !44, line: 2563, baseType: !923, size: 32, align: 32, offset: 4960)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1121, file: !44, line: 2571, baseType: !1065, size: 64, align: 64, offset: 4992)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1121, file: !44, line: 2579, baseType: !1065, size: 64, align: 64, offset: 5056)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1121, file: !44, line: 2586, baseType: !923, size: 32, align: 32, offset: 5120)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1121, file: !44, line: 2615, baseType: !923, size: 32, align: 32, offset: 5152)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1121, file: !44, line: 2627, baseType: !923, size: 32, align: 32, offset: 5184)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1121, file: !44, line: 2637, baseType: !923, size: 32, align: 32, offset: 5216)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1121, file: !44, line: 2681, baseType: !923, size: 32, align: 32, offset: 5248)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1121, file: !44, line: 2709, baseType: !920, size: 64, align: 64, offset: 5312)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1121, file: !44, line: 2716, baseType: !1548, size: 64, align: 64, offset: 5376)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1550)
!1550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !44, line: 3636, size: 896, align: 64, elements: !1551)
!1551 = !{!1552, !1553, !1554, !1555, !1556, !1557, !1558, !1562, !1566, !1567, !1568, !1569, !1575, !1576, !1577, !1578, !1579}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1550, file: !44, line: 3642, baseType: !943, size: 64, align: 64)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1550, file: !44, line: 3649, baseType: !33, size: 32, align: 32, offset: 64)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1550, file: !44, line: 3656, baseType: !43, size: 32, align: 32, offset: 96)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1550, file: !44, line: 3663, baseType: !503, size: 32, align: 32, offset: 128)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1550, file: !44, line: 3669, baseType: !923, size: 32, align: 32, offset: 160)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1550, file: !44, line: 3682, baseType: !1374, size: 64, align: 64, offset: 192)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1550, file: !44, line: 3698, baseType: !1559, size: 64, align: 64, offset: 256)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64, align: 64)
!1560 = !DISubroutineType(types: !1561)
!1561 = !{!923, !1119, !1009, !1204}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1550, file: !44, line: 3712, baseType: !1563, size: 64, align: 64, offset: 320)
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1564 = !DISubroutineType(types: !1565)
!1565 = !{!923, !1119, !923, !1009, !1204}
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1550, file: !44, line: 3726, baseType: !1559, size: 64, align: 64, offset: 384)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1550, file: !44, line: 3737, baseType: !1173, size: 64, align: 64, offset: 448)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1550, file: !44, line: 3746, baseType: !923, size: 32, align: 32, offset: 512)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1550, file: !44, line: 3757, baseType: !1570, size: 64, align: 64, offset: 576)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DISubroutineType(types: !1572)
!1572 = !{null, !1573}
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !44, line: 3617, flags: DIFlagFwdDecl)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1550, file: !44, line: 3766, baseType: !1173, size: 64, align: 64, offset: 640)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1550, file: !44, line: 3774, baseType: !1173, size: 64, align: 64, offset: 704)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1550, file: !44, line: 3780, baseType: !923, size: 32, align: 32, offset: 768)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1550, file: !44, line: 3785, baseType: !923, size: 32, align: 32, offset: 800)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1550, file: !44, line: 3795, baseType: !1580, size: 64, align: 64, offset: 832)
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1581, size: 64, align: 64)
!1581 = !DISubroutineType(types: !1582)
!1582 = !{!923, !1119, !1248}
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1121, file: !44, line: 2728, baseType: !919, size: 64, align: 64, offset: 5440)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1121, file: !44, line: 2735, baseType: !1301, size: 512, align: 64, offset: 5504)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1121, file: !44, line: 2742, baseType: !923, size: 32, align: 32, offset: 6016)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1121, file: !44, line: 2755, baseType: !923, size: 32, align: 32, offset: 6048)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1121, file: !44, line: 2776, baseType: !923, size: 32, align: 32, offset: 6080)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1121, file: !44, line: 2783, baseType: !923, size: 32, align: 32, offset: 6112)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1121, file: !44, line: 2791, baseType: !923, size: 32, align: 32, offset: 6144)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1121, file: !44, line: 2802, baseType: !1377, size: 64, align: 64, offset: 6208)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1121, file: !44, line: 2811, baseType: !923, size: 32, align: 32, offset: 6272)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1121, file: !44, line: 2821, baseType: !923, size: 32, align: 32, offset: 6304)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1121, file: !44, line: 2830, baseType: !923, size: 32, align: 32, offset: 6336)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1121, file: !44, line: 2840, baseType: !923, size: 32, align: 32, offset: 6368)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1121, file: !44, line: 2851, baseType: !1596, size: 64, align: 64, offset: 6400)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{!923, !1417, !1599, !919, !1359, !923, !923}
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = !DISubroutineType(types: !1601)
!1601 = !{!923, !1417, !919}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1121, file: !44, line: 2871, baseType: !1603, size: 64, align: 64, offset: 6464)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DISubroutineType(types: !1605)
!1605 = !{!923, !1417, !1606, !919, !1359, !923}
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DISubroutineType(types: !1608)
!1608 = !{!923, !1417, !919, !923, !923}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1121, file: !44, line: 2878, baseType: !923, size: 32, align: 32, offset: 6528)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1121, file: !44, line: 2885, baseType: !923, size: 32, align: 32, offset: 6560)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1121, file: !44, line: 3005, baseType: !923, size: 32, align: 32, offset: 6592)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1121, file: !44, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1121, file: !44, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1121, file: !44, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1121, file: !44, line: 3037, baseType: !991, size: 64, align: 64, offset: 6720)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1121, file: !44, line: 3038, baseType: !923, size: 32, align: 32, offset: 6784)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1121, file: !44, line: 3050, baseType: !1157, size: 64, align: 64, offset: 6848)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1121, file: !44, line: 3065, baseType: !923, size: 32, align: 32, offset: 6912)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1121, file: !44, line: 3083, baseType: !923, size: 32, align: 32, offset: 6944)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1121, file: !44, line: 3092, baseType: !1139, size: 64, align: 32, offset: 6976)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1121, file: !44, line: 3099, baseType: !503, size: 32, align: 32, offset: 7040)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1121, file: !44, line: 3106, baseType: !1139, size: 64, align: 32, offset: 7072)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1121, file: !44, line: 3113, baseType: !1624, size: 64, align: 64, offset: 7168)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1626)
!1626 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !44, line: 740, baseType: !1627)
!1627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !44, line: 712, size: 384, align: 64, elements: !1628)
!1628 = !{!1629, !1630, !1631, !1632, !1633, !1634, !1637}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1627, file: !44, line: 713, baseType: !43, size: 32, align: 32)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1627, file: !44, line: 714, baseType: !33, size: 32, align: 32, offset: 32)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1627, file: !44, line: 720, baseType: !943, size: 64, align: 64, offset: 64)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1627, file: !44, line: 724, baseType: !943, size: 64, align: 64, offset: 128)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1627, file: !44, line: 728, baseType: !923, size: 32, align: 32, offset: 192)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1627, file: !44, line: 734, baseType: !1635, size: 64, align: 64, offset: 256)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1627, file: !44, line: 739, baseType: !1638, size: 64, align: 64, offset: 320)
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64, align: 64)
!1639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1164)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1121, file: !44, line: 3129, baseType: !920, size: 64, align: 64, offset: 7232)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1121, file: !44, line: 3130, baseType: !920, size: 64, align: 64, offset: 7296)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1121, file: !44, line: 3131, baseType: !920, size: 64, align: 64, offset: 7360)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1121, file: !44, line: 3132, baseType: !920, size: 64, align: 64, offset: 7424)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1121, file: !44, line: 3139, baseType: !1065, size: 64, align: 64, offset: 7488)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1121, file: !44, line: 3147, baseType: !923, size: 32, align: 32, offset: 7552)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1121, file: !44, line: 3165, baseType: !923, size: 32, align: 32, offset: 7584)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1121, file: !44, line: 3172, baseType: !923, size: 32, align: 32, offset: 7616)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1121, file: !44, line: 3180, baseType: !923, size: 32, align: 32, offset: 7648)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1121, file: !44, line: 3191, baseType: !1454, size: 64, align: 64, offset: 7680)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1121, file: !44, line: 3199, baseType: !991, size: 64, align: 64, offset: 7744)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1121, file: !44, line: 3207, baseType: !1065, size: 64, align: 64, offset: 7808)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1121, file: !44, line: 3214, baseType: !924, size: 32, align: 32, offset: 7872)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1121, file: !44, line: 3224, baseType: !1266, size: 64, align: 64, offset: 7936)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1121, file: !44, line: 3225, baseType: !923, size: 32, align: 32, offset: 8000)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1121, file: !44, line: 3249, baseType: !1248, size: 64, align: 64, offset: 8064)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1121, file: !44, line: 3256, baseType: !923, size: 32, align: 32, offset: 8128)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1121, file: !44, line: 3271, baseType: !923, size: 32, align: 32, offset: 8160)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1121, file: !44, line: 3279, baseType: !920, size: 64, align: 64, offset: 8192)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1121, file: !44, line: 3301, baseType: !1248, size: 64, align: 64, offset: 8256)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1121, file: !44, line: 3310, baseType: !923, size: 32, align: 32, offset: 8320)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1121, file: !44, line: 3337, baseType: !923, size: 32, align: 32, offset: 8352)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1121, file: !44, line: 3351, baseType: !923, size: 32, align: 32, offset: 8384)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1121, file: !44, line: 3359, baseType: !923, size: 32, align: 32, offset: 8416)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1114, file: !897, line: 880, baseType: !919, size: 64, align: 64, offset: 128)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1114, file: !897, line: 894, baseType: !1139, size: 64, align: 32, offset: 192)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !1114, file: !897, line: 904, baseType: !920, size: 64, align: 64, offset: 256)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1114, file: !897, line: 914, baseType: !920, size: 64, align: 64, offset: 320)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "nb_frames", scope: !1114, file: !897, line: 916, baseType: !920, size: 64, align: 64, offset: 384)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "disposition", scope: !1114, file: !897, line: 918, baseType: !923, size: 32, align: 32, offset: 448)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "discard", scope: !1114, file: !897, line: 920, baseType: !887, size: 32, align: 32, offset: 480)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1114, file: !897, line: 927, baseType: !1139, size: 64, align: 32, offset: 512)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1114, file: !897, line: 929, baseType: !1324, size: 64, align: 64, offset: 576)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "avg_frame_rate", scope: !1114, file: !897, line: 938, baseType: !1139, size: 64, align: 32, offset: 640)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "attached_pic", scope: !1114, file: !897, line: 947, baseType: !1244, size: 704, align: 64, offset: 704)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1114, file: !897, line: 967, baseType: !1266, size: 64, align: 64, offset: 1408)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1114, file: !897, line: 971, baseType: !923, size: 32, align: 32, offset: 1472)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "event_flags", scope: !1114, file: !897, line: 978, baseType: !923, size: 32, align: 32, offset: 1504)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "r_frame_rate", scope: !1114, file: !897, line: 989, baseType: !1139, size: 64, align: 32, offset: 1536)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "recommended_encoder_configuration", scope: !1114, file: !897, line: 1000, baseType: !1065, size: 64, align: 64, offset: 1600)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "codecpar", scope: !1114, file: !897, line: 1012, baseType: !1681, size: 64, align: 64, offset: 1664)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !44, line: 4085, baseType: !1683)
!1683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !44, line: 3936, size: 1152, align: 64, elements: !1684)
!1684 = !{!1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713}
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1683, file: !44, line: 3940, baseType: !33, size: 32, align: 32)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1683, file: !44, line: 3944, baseType: !43, size: 32, align: 32, offset: 32)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1683, file: !44, line: 3948, baseType: !1204, size: 32, align: 32, offset: 64)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1683, file: !44, line: 3958, baseType: !991, size: 64, align: 64, offset: 128)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1683, file: !44, line: 3962, baseType: !923, size: 32, align: 32, offset: 192)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1683, file: !44, line: 3968, baseType: !923, size: 32, align: 32, offset: 224)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1683, file: !44, line: 3973, baseType: !920, size: 64, align: 64, offset: 256)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1683, file: !44, line: 3986, baseType: !923, size: 32, align: 32, offset: 320)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1683, file: !44, line: 3999, baseType: !923, size: 32, align: 32, offset: 352)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1683, file: !44, line: 4004, baseType: !923, size: 32, align: 32, offset: 384)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1683, file: !44, line: 4005, baseType: !923, size: 32, align: 32, offset: 416)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1683, file: !44, line: 4010, baseType: !923, size: 32, align: 32, offset: 448)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1683, file: !44, line: 4011, baseType: !923, size: 32, align: 32, offset: 480)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1683, file: !44, line: 4020, baseType: !1139, size: 64, align: 32, offset: 512)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1683, file: !44, line: 4025, baseType: !867, size: 32, align: 32, offset: 576)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1683, file: !44, line: 4030, baseType: !790, size: 32, align: 32, offset: 608)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1683, file: !44, line: 4031, baseType: !796, size: 32, align: 32, offset: 640)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1683, file: !44, line: 4032, baseType: !814, size: 32, align: 32, offset: 672)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1683, file: !44, line: 4033, baseType: !838, size: 32, align: 32, offset: 704)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1683, file: !44, line: 4034, baseType: !857, size: 32, align: 32, offset: 736)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1683, file: !44, line: 4039, baseType: !923, size: 32, align: 32, offset: 768)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1683, file: !44, line: 4046, baseType: !1157, size: 64, align: 64, offset: 832)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1683, file: !44, line: 4050, baseType: !923, size: 32, align: 32, offset: 896)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1683, file: !44, line: 4054, baseType: !923, size: 32, align: 32, offset: 928)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1683, file: !44, line: 4061, baseType: !923, size: 32, align: 32, offset: 960)
