; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--rv40.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--rv40.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }

!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OutputFormat", file: !895, line: 123, size: 32, align: 32, elements: !896)
!895 = !DIFile(filename: "libavcodec/mpegutils.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!896 = !{!897, !898, !899, !900}
!897 = !DIEnumerator(name: "FMT_MPEG1", value: 0)
!898 = !DIEnumerator(name: "FMT_H261", value: 1)
!899 = !DIEnumerator(name: "FMT_H263", value: 2)
!900 = !DIEnumerator(name: "FMT_MJPEG", value: 3)
!901 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !902, line: 37, size: 32, align: 32, elements: !903)
!902 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!903 = !{!904, !905, !906, !907, !908, !909}
!904 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!905 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!906 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!907 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!908 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!909 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!910 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !911)
!911 = !{!912, !913, !914, !915, !916, !917, !918}
!912 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!913 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!914 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!915 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!916 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!917 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!918 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !920)
!920 = !{!921, !922, !923, !924}
!921 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!922 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!923 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!924 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!925 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RV40BlockTypes", file: !926, line: 42, size: 32, align: 32, elements: !927)
!926 = !DIFile(filename: "libavcodec/rv34.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!927 = !{!928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940}
!928 = !DIEnumerator(name: "RV34_MB_TYPE_INTRA", value: 0)
!929 = !DIEnumerator(name: "RV34_MB_TYPE_INTRA16x16", value: 1)
!930 = !DIEnumerator(name: "RV34_MB_P_16x16", value: 2)
!931 = !DIEnumerator(name: "RV34_MB_P_8x8", value: 3)
!932 = !DIEnumerator(name: "RV34_MB_B_FORWARD", value: 4)
!933 = !DIEnumerator(name: "RV34_MB_B_BACKWARD", value: 5)
!934 = !DIEnumerator(name: "RV34_MB_SKIP", value: 6)
!935 = !DIEnumerator(name: "RV34_MB_B_DIRECT", value: 7)
!936 = !DIEnumerator(name: "RV34_MB_P_16x8", value: 8)
!937 = !DIEnumerator(name: "RV34_MB_P_8x16", value: 9)
!938 = !DIEnumerator(name: "RV34_MB_B_BIDIR", value: 10)
!939 = !DIEnumerator(name: "RV34_MB_P_MIX16x16", value: 11)
!940 = !DIEnumerator(name: "RV34_MB_TYPES", value: 12)
!941 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RV40BlockPos", file: !942, line: 283, size: 32, align: 32, elements: !943)
!942 = !DIFile(filename: "libavcodec/rv40.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!943 = !{!944, !945, !946, !947}
!944 = !DIEnumerator(name: "POS_CUR", value: 0)
!945 = !DIEnumerator(name: "POS_TOP", value: 1)
!946 = !DIEnumerator(name: "POS_LEFT", value: 2)
!947 = !DIEnumerator(name: "POS_BOTTOM", value: 3)
!948 = !{!949, !950, !951, !959, !957}
!949 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!950 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !954, line: 221, size: 32, align: 8, elements: !955)
!954 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!955 = !{!956}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !953, file: !954, line: 221, baseType: !957, size: 32, align: 32)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !958, line: 51, baseType: !950)
!958 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !958, line: 48, baseType: !960)
!960 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!961 = !{!962, !2617, !2626, !2633, !2637, !2641, !2645, !2649, !2652, !2653, !2657, !2661, !2662, !2666, !2670, !2674, !2677, !2681, !2684, !2685, !2687, !2689, !2692, !2695, !2697, !2700, !2702, !2704, !2706, !2707, !2709, !2710, !2712, !2713, !2716}
!962 = distinct !DIGlobalVariable(name: "ff_rv40_decoder", scope: !0, file: !942, line: 570, type: !963, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_rv40_decoder)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !965)
!965 = !{!966, !970, !971, !972, !973, !974, !983, !986, !989, !992, !997, !998, !1074, !1082, !1083, !1084, !1086, !2532, !2538, !2546, !2550, !2551, !2588, !2592, !2596, !2597, !2601, !2605, !2606, !2610, !2611, !2612}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !964, file: !14, line: 3475, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!969 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !964, file: !14, line: 3480, baseType: !967, size: 64, align: 64, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !964, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !964, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !964, file: !14, line: 3487, baseType: !949, size: 32, align: 32, offset: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !964, file: !14, line: 3488, baseType: !975, size: 64, align: 64, offset: 256)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !978, line: 61, baseType: !979)
!978 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !978, line: 58, size: 64, align: 32, elements: !980)
!980 = !{!981, !982}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !979, file: !978, line: 59, baseType: !949, size: 32, align: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !979, file: !978, line: 60, baseType: !949, size: 32, align: 32, offset: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !964, file: !14, line: 3489, baseType: !984, size: 64, align: 64, offset: 320)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !964, file: !14, line: 3490, baseType: !987, size: 64, align: 64, offset: 384)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !964, file: !14, line: 3491, baseType: !990, size: 64, align: 64, offset: 448)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !964, file: !14, line: 3492, baseType: !993, size: 64, align: 64, offset: 512)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !958, line: 55, baseType: !996)
!996 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !964, file: !14, line: 3493, baseType: !959, size: 8, align: 8, offset: 576)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !964, file: !14, line: 3494, baseType: !999, size: 64, align: 64, offset: 640)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !1003)
!1003 = !{!1004, !1005, !1010, !1033, !1034, !1035, !1036, !1040, !1046, !1048, !1052}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1002, file: !713, line: 72, baseType: !967, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1002, file: !713, line: 78, baseType: !1006, size: 64, align: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!967, !1009}
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1002, file: !713, line: 85, baseType: !1011, size: 64, align: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019, !1029, !1030, !1031, !1032}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1013, file: !691, line: 247, baseType: !967, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1013, file: !691, line: 253, baseType: !967, size: 64, align: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1013, file: !691, line: 259, baseType: !949, size: 32, align: 32, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1013, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1013, file: !691, line: 271, baseType: !1020, size: 64, align: 64, offset: 192)
!1020 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1013, file: !691, line: 265, size: 64, align: 64, elements: !1021)
!1021 = !{!1022, !1025, !1027, !1028}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1020, file: !691, line: 266, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !958, line: 40, baseType: !1024)
!1024 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1020, file: !691, line: 267, baseType: !1026, size: 64, align: 64)
!1026 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1020, file: !691, line: 268, baseType: !967, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1020, file: !691, line: 270, baseType: !977, size: 64, align: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1013, file: !691, line: 272, baseType: !1026, size: 64, align: 64, offset: 256)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1013, file: !691, line: 273, baseType: !1026, size: 64, align: 64, offset: 320)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1013, file: !691, line: 275, baseType: !949, size: 32, align: 32, offset: 384)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1013, file: !691, line: 300, baseType: !967, size: 64, align: 64, offset: 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1002, file: !713, line: 93, baseType: !949, size: 32, align: 32, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1002, file: !713, line: 99, baseType: !949, size: 32, align: 32, offset: 224)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1002, file: !713, line: 108, baseType: !949, size: 32, align: 32, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1002, file: !713, line: 113, baseType: !1037, size: 64, align: 64, offset: 320)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!1009, !1009, !1009}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1002, file: !713, line: 123, baseType: !1041, size: 64, align: 64, offset: 384)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!1044, !1044}
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1002, file: !713, line: 130, baseType: !1047, size: 32, align: 32, offset: 448)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1002, file: !713, line: 136, baseType: !1049, size: 64, align: 64, offset: 512)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!1047, !1009}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1002, file: !713, line: 142, baseType: !1053, size: 64, align: 64, offset: 576)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!949, !1056, !1009, !967, !949}
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1059)
!1059 = !{!1060, !1072, !1073}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1058, file: !691, line: 360, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1064)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1065)
!1065 = !{!1066, !1067, !1068, !1069, !1070, !1071}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1064, file: !691, line: 307, baseType: !967, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1064, file: !691, line: 313, baseType: !1026, size: 64, align: 64, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1064, file: !691, line: 313, baseType: !1026, size: 64, align: 64, offset: 128)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1064, file: !691, line: 318, baseType: !1026, size: 64, align: 64, offset: 192)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1064, file: !691, line: 318, baseType: !1026, size: 64, align: 64, offset: 256)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1064, file: !691, line: 323, baseType: !949, size: 32, align: 32, offset: 320)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1058, file: !691, line: 364, baseType: !949, size: 32, align: 32, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1058, file: !691, line: 368, baseType: !949, size: 32, align: 32, offset: 96)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !964, file: !14, line: 3495, baseType: !1075, size: 64, align: 64, offset: 704)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1077)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1079)
!1079 = !{!1080, !1081}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1078, file: !14, line: 3402, baseType: !949, size: 32, align: 32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1078, file: !14, line: 3403, baseType: !967, size: 64, align: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !964, file: !14, line: 3507, baseType: !967, size: 64, align: 64, offset: 768)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !964, file: !14, line: 3516, baseType: !949, size: 32, align: 32, offset: 832)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !964, file: !14, line: 3517, baseType: !1085, size: 64, align: 64, offset: 896)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !964, file: !14, line: 3527, baseType: !1087, size: 64, align: 64, offset: 960)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!949, !1090}
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1093)
!1093 = !{!1094, !1095, !1096, !1097, !1100, !1101, !1102, !1103, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1383, !1387, !1388, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2470, !2477, !2478, !2479, !2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488, !2489, !2490, !2491, !2508, !2509, !2510, !2511, !2512, !2513, !2514, !2515, !2516, !2517, !2518, !2519, !2520, !2521, !2522, !2523, !2524, !2525, !2526, !2527, !2528, !2529, !2530, !2531}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1092, file: !14, line: 1561, baseType: !999, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1092, file: !14, line: 1562, baseType: !949, size: 32, align: 32, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1092, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1092, file: !14, line: 1565, baseType: !1098, size: 64, align: 64, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1092, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1092, file: !14, line: 1581, baseType: !950, size: 32, align: 32, offset: 224)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1092, file: !14, line: 1583, baseType: !1009, size: 64, align: 64, offset: 256)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1092, file: !14, line: 1591, baseType: !1104, size: 64, align: 64, offset: 320)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1106, line: 129, size: 1664, align: 64, elements: !1107)
!1106 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1107 = !{!1108, !1109, !1110, !1111, !1209, !1230, !1231, !1260, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1105, file: !1106, line: 136, baseType: !949, size: 32, align: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1105, file: !1106, line: 151, baseType: !949, size: 32, align: 32, offset: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1105, file: !1106, line: 157, baseType: !949, size: 32, align: 32, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1105, file: !1106, line: 159, baseType: !1112, size: 64, align: 64, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1115)
!1115 = !{!1116, !1121, !1123, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1161, !1163, !1164, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1197, !1198, !1199, !1200, !1201, !1202, !1205, !1206, !1207, !1208}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1114, file: !744, line: 282, baseType: !1117, size: 512, align: 64)
!1117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1118, size: 512, align: 64, elements: !1119)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!1119 = !{!1120}
!1120 = !DISubrange(count: 8)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1114, file: !744, line: 299, baseType: !1122, size: 256, align: 32, offset: 512)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 256, align: 32, elements: !1119)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1114, file: !744, line: 315, baseType: !1124, size: 64, align: 64, offset: 768)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1114, file: !744, line: 326, baseType: !949, size: 32, align: 32, offset: 832)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1114, file: !744, line: 326, baseType: !949, size: 32, align: 32, offset: 864)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1114, file: !744, line: 334, baseType: !949, size: 32, align: 32, offset: 896)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1114, file: !744, line: 341, baseType: !949, size: 32, align: 32, offset: 928)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1114, file: !744, line: 346, baseType: !949, size: 32, align: 32, offset: 960)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1114, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1114, file: !744, line: 356, baseType: !977, size: 64, align: 32, offset: 1024)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1114, file: !744, line: 361, baseType: !1023, size: 64, align: 64, offset: 1088)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1114, file: !744, line: 369, baseType: !1023, size: 64, align: 64, offset: 1152)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1114, file: !744, line: 377, baseType: !1023, size: 64, align: 64, offset: 1216)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1114, file: !744, line: 382, baseType: !949, size: 32, align: 32, offset: 1280)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1114, file: !744, line: 386, baseType: !949, size: 32, align: 32, offset: 1312)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1114, file: !744, line: 391, baseType: !949, size: 32, align: 32, offset: 1344)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1114, file: !744, line: 396, baseType: !1009, size: 64, align: 64, offset: 1408)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1114, file: !744, line: 403, baseType: !1140, size: 512, align: 64, offset: 1472)
!1140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !995, size: 512, align: 64, elements: !1119)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1114, file: !744, line: 410, baseType: !949, size: 32, align: 32, offset: 1984)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1114, file: !744, line: 415, baseType: !949, size: 32, align: 32, offset: 2016)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1114, file: !744, line: 420, baseType: !949, size: 32, align: 32, offset: 2048)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1114, file: !744, line: 425, baseType: !949, size: 32, align: 32, offset: 2080)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1114, file: !744, line: 435, baseType: !1023, size: 64, align: 64, offset: 2112)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1114, file: !744, line: 440, baseType: !949, size: 32, align: 32, offset: 2176)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1114, file: !744, line: 445, baseType: !995, size: 64, align: 64, offset: 2240)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1114, file: !744, line: 459, baseType: !1149, size: 512, align: 64, offset: 2304)
!1149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1150, size: 512, align: 64, elements: !1119)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1152, line: 94, baseType: !1153)
!1152 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1152, line: 81, size: 192, align: 64, elements: !1154)
!1154 = !{!1155, !1159, !1160}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1153, file: !1152, line: 82, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1152, line: 73, baseType: !1158)
!1158 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1152, line: 73, flags: DIFlagFwdDecl)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1153, file: !1152, line: 89, baseType: !1118, size: 64, align: 64, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1153, file: !1152, line: 93, baseType: !949, size: 32, align: 32, offset: 128)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1114, file: !744, line: 473, baseType: !1162, size: 64, align: 64, offset: 2816)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1114, file: !744, line: 477, baseType: !949, size: 32, align: 32, offset: 2880)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1114, file: !744, line: 479, baseType: !1165, size: 64, align: 64, offset: 2944)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1169)
!1169 = !{!1170, !1171, !1172, !1173, !1178}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1168, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1168, file: !744, line: 203, baseType: !1118, size: 64, align: 64, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1168, file: !744, line: 204, baseType: !949, size: 32, align: 32, offset: 128)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1168, file: !744, line: 205, baseType: !1174, size: 64, align: 64, offset: 192)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1176, line: 86, baseType: !1177)
!1176 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1177 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1176, line: 86, flags: DIFlagFwdDecl)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1168, file: !744, line: 206, baseType: !1150, size: 64, align: 64, offset: 256)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1114, file: !744, line: 480, baseType: !949, size: 32, align: 32, offset: 3008)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1114, file: !744, line: 505, baseType: !949, size: 32, align: 32, offset: 3040)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1114, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1114, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1114, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1114, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1114, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1114, file: !744, line: 532, baseType: !1023, size: 64, align: 64, offset: 3264)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1114, file: !744, line: 539, baseType: !1023, size: 64, align: 64, offset: 3328)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1114, file: !744, line: 547, baseType: !1023, size: 64, align: 64, offset: 3392)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1114, file: !744, line: 554, baseType: !1174, size: 64, align: 64, offset: 3456)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1114, file: !744, line: 563, baseType: !949, size: 32, align: 32, offset: 3520)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1114, file: !744, line: 572, baseType: !949, size: 32, align: 32, offset: 3552)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1114, file: !744, line: 581, baseType: !949, size: 32, align: 32, offset: 3584)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1114, file: !744, line: 588, baseType: !1194, size: 64, align: 64, offset: 3648)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !958, line: 36, baseType: !1196)
!1196 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1114, file: !744, line: 593, baseType: !949, size: 32, align: 32, offset: 3712)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1114, file: !744, line: 596, baseType: !949, size: 32, align: 32, offset: 3744)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1114, file: !744, line: 599, baseType: !1150, size: 64, align: 64, offset: 3776)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1114, file: !744, line: 605, baseType: !1150, size: 64, align: 64, offset: 3840)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1114, file: !744, line: 616, baseType: !1150, size: 64, align: 64, offset: 3904)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1114, file: !744, line: 626, baseType: !1203, size: 64, align: 64, offset: 3968)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1204, line: 216, baseType: !996)
!1204 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1114, file: !744, line: 627, baseType: !1203, size: 64, align: 64, offset: 4032)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1114, file: !744, line: 628, baseType: !1203, size: 64, align: 64, offset: 4096)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1114, file: !744, line: 629, baseType: !1203, size: 64, align: 64, offset: 4160)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1114, file: !744, line: 645, baseType: !1150, size: 64, align: 64, offset: 4224)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1105, file: !1106, line: 161, baseType: !1210, size: 64, align: 64, offset: 192)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1106, line: 117, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1106, line: 100, size: 832, align: 64, elements: !1213)
!1213 = !{!1214, !1221, !1222, !1223, !1224, !1225, !1227, !1228, !1229}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1212, file: !1106, line: 105, baseType: !1215, size: 256, align: 64)
!1215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1216, size: 256, align: 64, elements: !1219)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1152, line: 238, baseType: !1218)
!1218 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1152, line: 238, flags: DIFlagFwdDecl)
!1219 = !{!1220}
!1220 = !DISubrange(count: 4)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1212, file: !1106, line: 110, baseType: !949, size: 32, align: 32, offset: 256)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1212, file: !1106, line: 111, baseType: !949, size: 32, align: 32, offset: 288)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1212, file: !1106, line: 111, baseType: !949, size: 32, align: 32, offset: 320)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1212, file: !1106, line: 112, baseType: !1122, size: 256, align: 32, offset: 352)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1212, file: !1106, line: 113, baseType: !1226, size: 128, align: 32, offset: 608)
!1226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 128, align: 32, elements: !1219)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1212, file: !1106, line: 114, baseType: !949, size: 32, align: 32, offset: 736)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1212, file: !1106, line: 115, baseType: !949, size: 32, align: 32, offset: 768)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1212, file: !1106, line: 116, baseType: !949, size: 32, align: 32, offset: 800)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1105, file: !1106, line: 163, baseType: !1009, size: 64, align: 64, offset: 256)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1105, file: !1106, line: 165, baseType: !1232, size: 128, align: 64, offset: 320)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1106, line: 122, baseType: !1233)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1106, line: 119, size: 128, align: 64, elements: !1234)
!1234 = !{!1235, !1259}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1233, file: !1106, line: 120, baseType: !1236, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1238)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1239)
!1239 = !{!1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1255, !1256, !1257, !1258}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1238, file: !14, line: 1451, baseType: !1150, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1238, file: !14, line: 1461, baseType: !1023, size: 64, align: 64, offset: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1238, file: !14, line: 1467, baseType: !1023, size: 64, align: 64, offset: 128)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1238, file: !14, line: 1468, baseType: !1118, size: 64, align: 64, offset: 192)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1238, file: !14, line: 1469, baseType: !949, size: 32, align: 32, offset: 256)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1238, file: !14, line: 1470, baseType: !949, size: 32, align: 32, offset: 288)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1238, file: !14, line: 1474, baseType: !949, size: 32, align: 32, offset: 320)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1238, file: !14, line: 1479, baseType: !1248, size: 64, align: 64, offset: 384)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1250)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1251)
!1251 = !{!1252, !1253, !1254}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1250, file: !14, line: 1412, baseType: !1118, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1250, file: !14, line: 1413, baseType: !949, size: 32, align: 32, offset: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1250, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1238, file: !14, line: 1480, baseType: !949, size: 32, align: 32, offset: 448)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1238, file: !14, line: 1486, baseType: !1023, size: 64, align: 64, offset: 512)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1238, file: !14, line: 1488, baseType: !1023, size: 64, align: 64, offset: 576)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1238, file: !14, line: 1497, baseType: !1023, size: 64, align: 64, offset: 640)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1233, file: !1106, line: 121, baseType: !1112, size: 64, align: 64, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1105, file: !1106, line: 166, baseType: !1261, size: 128, align: 64, offset: 448)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1106, line: 127, baseType: !1262)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1106, line: 124, size: 128, align: 64, elements: !1263)
!1263 = !{!1264, !1337}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1262, file: !1106, line: 125, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1269)
!1269 = !{!1270, !1271, !1295, !1299, !1300, !1334, !1335, !1336}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1268, file: !14, line: 5751, baseType: !999, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1268, file: !14, line: 5756, baseType: !1272, size: 64, align: 64, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1275)
!1275 = !{!1276, !1277, !1280, !1281, !1282, !1286, !1290, !1294}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1274, file: !14, line: 5797, baseType: !967, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1274, file: !14, line: 5804, baseType: !1278, size: 64, align: 64, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1274, file: !14, line: 5815, baseType: !999, size: 64, align: 64, offset: 128)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1274, file: !14, line: 5825, baseType: !949, size: 32, align: 32, offset: 192)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1274, file: !14, line: 5826, baseType: !1283, size: 64, align: 64, offset: 256)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!949, !1266}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1274, file: !14, line: 5827, baseType: !1287, size: 64, align: 64, offset: 320)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{!949, !1266, !1236}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1274, file: !14, line: 5828, baseType: !1291, size: 64, align: 64, offset: 384)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{null, !1266}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1274, file: !14, line: 5829, baseType: !1291, size: 64, align: 64, offset: 448)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1268, file: !14, line: 5762, baseType: !1296, size: 64, align: 64, offset: 128)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1298)
!1298 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1268, file: !14, line: 5768, baseType: !1009, size: 64, align: 64, offset: 192)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1268, file: !14, line: 5775, baseType: !1301, size: 64, align: 64, offset: 256)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1303)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1304)
!1304 = !{!1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1303, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1303, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1303, file: !14, line: 3948, baseType: !957, size: 32, align: 32, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1303, file: !14, line: 3958, baseType: !1118, size: 64, align: 64, offset: 128)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1303, file: !14, line: 3962, baseType: !949, size: 32, align: 32, offset: 192)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1303, file: !14, line: 3968, baseType: !949, size: 32, align: 32, offset: 224)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1303, file: !14, line: 3973, baseType: !1023, size: 64, align: 64, offset: 256)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1303, file: !14, line: 3986, baseType: !949, size: 32, align: 32, offset: 320)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1303, file: !14, line: 3999, baseType: !949, size: 32, align: 32, offset: 352)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1303, file: !14, line: 4004, baseType: !949, size: 32, align: 32, offset: 384)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1303, file: !14, line: 4005, baseType: !949, size: 32, align: 32, offset: 416)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1303, file: !14, line: 4010, baseType: !949, size: 32, align: 32, offset: 448)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1303, file: !14, line: 4011, baseType: !949, size: 32, align: 32, offset: 480)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1303, file: !14, line: 4020, baseType: !977, size: 64, align: 32, offset: 512)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1303, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1303, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1303, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1303, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1303, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1303, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1303, file: !14, line: 4039, baseType: !949, size: 32, align: 32, offset: 768)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1303, file: !14, line: 4046, baseType: !995, size: 64, align: 64, offset: 832)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1303, file: !14, line: 4050, baseType: !949, size: 32, align: 32, offset: 896)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1303, file: !14, line: 4054, baseType: !949, size: 32, align: 32, offset: 928)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1303, file: !14, line: 4061, baseType: !949, size: 32, align: 32, offset: 960)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1303, file: !14, line: 4065, baseType: !949, size: 32, align: 32, offset: 992)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1303, file: !14, line: 4073, baseType: !949, size: 32, align: 32, offset: 1024)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1303, file: !14, line: 4080, baseType: !949, size: 32, align: 32, offset: 1056)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1303, file: !14, line: 4084, baseType: !949, size: 32, align: 32, offset: 1088)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1268, file: !14, line: 5781, baseType: !1301, size: 64, align: 64, offset: 320)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1268, file: !14, line: 5787, baseType: !977, size: 64, align: 32, offset: 384)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1268, file: !14, line: 5793, baseType: !977, size: 64, align: 32, offset: 448)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1262, file: !1106, line: 126, baseType: !949, size: 32, align: 32, offset: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1105, file: !1106, line: 172, baseType: !1236, size: 64, align: 64, offset: 576)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1105, file: !1106, line: 177, baseType: !1118, size: 64, align: 64, offset: 640)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1105, file: !1106, line: 178, baseType: !950, size: 32, align: 32, offset: 704)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1105, file: !1106, line: 180, baseType: !1009, size: 64, align: 64, offset: 768)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1105, file: !1106, line: 185, baseType: !949, size: 32, align: 32, offset: 832)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1105, file: !1106, line: 190, baseType: !1009, size: 64, align: 64, offset: 896)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1105, file: !1106, line: 195, baseType: !949, size: 32, align: 32, offset: 960)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1105, file: !1106, line: 200, baseType: !1236, size: 64, align: 64, offset: 1024)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1105, file: !1106, line: 201, baseType: !949, size: 32, align: 32, offset: 1088)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1105, file: !1106, line: 202, baseType: !1112, size: 64, align: 64, offset: 1152)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1105, file: !1106, line: 203, baseType: !949, size: 32, align: 32, offset: 1216)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1105, file: !1106, line: 205, baseType: !949, size: 32, align: 32, offset: 1248)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1105, file: !1106, line: 206, baseType: !949, size: 32, align: 32, offset: 1280)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1105, file: !1106, line: 209, baseType: !1203, size: 64, align: 64, offset: 1344)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1105, file: !1106, line: 212, baseType: !1203, size: 64, align: 64, offset: 1408)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1105, file: !1106, line: 213, baseType: !1112, size: 64, align: 64, offset: 1472)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1105, file: !1106, line: 215, baseType: !949, size: 32, align: 32, offset: 1536)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1105, file: !1106, line: 217, baseType: !949, size: 32, align: 32, offset: 1568)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1105, file: !1106, line: 220, baseType: !949, size: 32, align: 32, offset: 1600)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1092, file: !14, line: 1598, baseType: !1009, size: 64, align: 64, offset: 384)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1092, file: !14, line: 1606, baseType: !1023, size: 64, align: 64, offset: 448)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1092, file: !14, line: 1614, baseType: !949, size: 32, align: 32, offset: 512)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1092, file: !14, line: 1622, baseType: !949, size: 32, align: 32, offset: 544)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1092, file: !14, line: 1628, baseType: !949, size: 32, align: 32, offset: 576)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1092, file: !14, line: 1636, baseType: !949, size: 32, align: 32, offset: 608)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1092, file: !14, line: 1643, baseType: !949, size: 32, align: 32, offset: 640)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1092, file: !14, line: 1657, baseType: !1118, size: 64, align: 64, offset: 704)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1092, file: !14, line: 1658, baseType: !949, size: 32, align: 32, offset: 768)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1092, file: !14, line: 1679, baseType: !977, size: 64, align: 32, offset: 800)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1092, file: !14, line: 1688, baseType: !949, size: 32, align: 32, offset: 864)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1092, file: !14, line: 1712, baseType: !949, size: 32, align: 32, offset: 896)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1092, file: !14, line: 1729, baseType: !949, size: 32, align: 32, offset: 928)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1092, file: !14, line: 1729, baseType: !949, size: 32, align: 32, offset: 960)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1092, file: !14, line: 1744, baseType: !949, size: 32, align: 32, offset: 992)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1092, file: !14, line: 1744, baseType: !949, size: 32, align: 32, offset: 1024)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1092, file: !14, line: 1751, baseType: !949, size: 32, align: 32, offset: 1056)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1092, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1092, file: !14, line: 1791, baseType: !1376, size: 64, align: 64, offset: 1152)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DISubroutineType(types: !1378)
!1378 = !{null, !1379, !1380, !1382, !949, !949, !949}
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1113)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1092, file: !14, line: 1808, baseType: !1384, size: 64, align: 64, offset: 1216)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DISubroutineType(types: !1386)
!1386 = !{!473, !1379, !984}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1092, file: !14, line: 1816, baseType: !949, size: 32, align: 32, offset: 1280)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1092, file: !14, line: 1825, baseType: !1389, size: 32, align: 32, offset: 1312)
!1389 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1092, file: !14, line: 1830, baseType: !949, size: 32, align: 32, offset: 1344)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1092, file: !14, line: 1838, baseType: !1389, size: 32, align: 32, offset: 1376)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1092, file: !14, line: 1846, baseType: !949, size: 32, align: 32, offset: 1408)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1092, file: !14, line: 1851, baseType: !949, size: 32, align: 32, offset: 1440)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1092, file: !14, line: 1861, baseType: !1389, size: 32, align: 32, offset: 1472)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1092, file: !14, line: 1868, baseType: !1389, size: 32, align: 32, offset: 1504)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1092, file: !14, line: 1875, baseType: !1389, size: 32, align: 32, offset: 1536)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1092, file: !14, line: 1882, baseType: !1389, size: 32, align: 32, offset: 1568)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1092, file: !14, line: 1889, baseType: !1389, size: 32, align: 32, offset: 1600)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1092, file: !14, line: 1896, baseType: !1389, size: 32, align: 32, offset: 1632)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1092, file: !14, line: 1903, baseType: !1389, size: 32, align: 32, offset: 1664)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1092, file: !14, line: 1910, baseType: !949, size: 32, align: 32, offset: 1696)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1092, file: !14, line: 1915, baseType: !949, size: 32, align: 32, offset: 1728)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1092, file: !14, line: 1926, baseType: !1382, size: 64, align: 64, offset: 1792)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1092, file: !14, line: 1935, baseType: !977, size: 64, align: 32, offset: 1856)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1092, file: !14, line: 1942, baseType: !949, size: 32, align: 32, offset: 1920)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1092, file: !14, line: 1948, baseType: !949, size: 32, align: 32, offset: 1952)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1092, file: !14, line: 1954, baseType: !949, size: 32, align: 32, offset: 1984)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1092, file: !14, line: 1960, baseType: !949, size: 32, align: 32, offset: 2016)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1092, file: !14, line: 1984, baseType: !949, size: 32, align: 32, offset: 2048)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1092, file: !14, line: 1991, baseType: !949, size: 32, align: 32, offset: 2080)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1092, file: !14, line: 1996, baseType: !949, size: 32, align: 32, offset: 2112)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1092, file: !14, line: 2004, baseType: !949, size: 32, align: 32, offset: 2144)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1092, file: !14, line: 2011, baseType: !949, size: 32, align: 32, offset: 2176)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1092, file: !14, line: 2018, baseType: !949, size: 32, align: 32, offset: 2208)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1092, file: !14, line: 2027, baseType: !949, size: 32, align: 32, offset: 2240)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1092, file: !14, line: 2034, baseType: !949, size: 32, align: 32, offset: 2272)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1092, file: !14, line: 2044, baseType: !949, size: 32, align: 32, offset: 2304)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1092, file: !14, line: 2054, baseType: !1419, size: 64, align: 64, offset: 2368)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !958, line: 49, baseType: !1421)
!1421 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1092, file: !14, line: 2061, baseType: !1419, size: 64, align: 64, offset: 2432)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1092, file: !14, line: 2066, baseType: !949, size: 32, align: 32, offset: 2496)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1092, file: !14, line: 2070, baseType: !949, size: 32, align: 32, offset: 2528)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1092, file: !14, line: 2078, baseType: !949, size: 32, align: 32, offset: 2560)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1092, file: !14, line: 2085, baseType: !949, size: 32, align: 32, offset: 2592)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1092, file: !14, line: 2092, baseType: !949, size: 32, align: 32, offset: 2624)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1092, file: !14, line: 2099, baseType: !949, size: 32, align: 32, offset: 2656)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1092, file: !14, line: 2106, baseType: !949, size: 32, align: 32, offset: 2688)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1092, file: !14, line: 2113, baseType: !949, size: 32, align: 32, offset: 2720)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1092, file: !14, line: 2120, baseType: !949, size: 32, align: 32, offset: 2752)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1092, file: !14, line: 2125, baseType: !949, size: 32, align: 32, offset: 2784)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1092, file: !14, line: 2133, baseType: !949, size: 32, align: 32, offset: 2816)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1092, file: !14, line: 2140, baseType: !949, size: 32, align: 32, offset: 2848)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1092, file: !14, line: 2145, baseType: !949, size: 32, align: 32, offset: 2880)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1092, file: !14, line: 2153, baseType: !949, size: 32, align: 32, offset: 2912)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1092, file: !14, line: 2158, baseType: !949, size: 32, align: 32, offset: 2944)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1092, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1092, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1092, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1092, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1092, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1092, file: !14, line: 2203, baseType: !949, size: 32, align: 32, offset: 3136)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1092, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1092, file: !14, line: 2212, baseType: !949, size: 32, align: 32, offset: 3200)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1092, file: !14, line: 2213, baseType: !949, size: 32, align: 32, offset: 3232)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1092, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1092, file: !14, line: 2232, baseType: !949, size: 32, align: 32, offset: 3296)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1092, file: !14, line: 2243, baseType: !949, size: 32, align: 32, offset: 3328)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1092, file: !14, line: 2249, baseType: !949, size: 32, align: 32, offset: 3360)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1092, file: !14, line: 2256, baseType: !949, size: 32, align: 32, offset: 3392)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1092, file: !14, line: 2263, baseType: !995, size: 64, align: 64, offset: 3456)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1092, file: !14, line: 2270, baseType: !995, size: 64, align: 64, offset: 3520)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1092, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1092, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1092, file: !14, line: 2367, baseType: !1457, size: 64, align: 64, offset: 3648)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!949, !1379, !1112, !949}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1092, file: !14, line: 2383, baseType: !949, size: 32, align: 32, offset: 3712)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1092, file: !14, line: 2386, baseType: !1389, size: 32, align: 32, offset: 3744)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1092, file: !14, line: 2387, baseType: !1389, size: 32, align: 32, offset: 3776)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1092, file: !14, line: 2394, baseType: !949, size: 32, align: 32, offset: 3808)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1092, file: !14, line: 2401, baseType: !949, size: 32, align: 32, offset: 3840)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1092, file: !14, line: 2408, baseType: !949, size: 32, align: 32, offset: 3872)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1092, file: !14, line: 2415, baseType: !949, size: 32, align: 32, offset: 3904)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1092, file: !14, line: 2422, baseType: !949, size: 32, align: 32, offset: 3936)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1092, file: !14, line: 2423, baseType: !1469, size: 64, align: 64, offset: 3968)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1471)
!1471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1472)
!1472 = !{!1473, !1474, !1475, !1476}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1471, file: !14, line: 827, baseType: !949, size: 32, align: 32)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1471, file: !14, line: 828, baseType: !949, size: 32, align: 32, offset: 32)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1471, file: !14, line: 829, baseType: !949, size: 32, align: 32, offset: 64)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1471, file: !14, line: 830, baseType: !1389, size: 32, align: 32, offset: 96)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1092, file: !14, line: 2430, baseType: !1023, size: 64, align: 64, offset: 4032)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1092, file: !14, line: 2437, baseType: !1023, size: 64, align: 64, offset: 4096)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1092, file: !14, line: 2444, baseType: !1389, size: 32, align: 32, offset: 4160)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1092, file: !14, line: 2451, baseType: !1389, size: 32, align: 32, offset: 4192)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1092, file: !14, line: 2458, baseType: !949, size: 32, align: 32, offset: 4224)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1092, file: !14, line: 2469, baseType: !949, size: 32, align: 32, offset: 4256)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1092, file: !14, line: 2475, baseType: !949, size: 32, align: 32, offset: 4288)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1092, file: !14, line: 2481, baseType: !949, size: 32, align: 32, offset: 4320)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1092, file: !14, line: 2485, baseType: !949, size: 32, align: 32, offset: 4352)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1092, file: !14, line: 2489, baseType: !949, size: 32, align: 32, offset: 4384)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1092, file: !14, line: 2493, baseType: !949, size: 32, align: 32, offset: 4416)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1092, file: !14, line: 2501, baseType: !949, size: 32, align: 32, offset: 4448)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1092, file: !14, line: 2506, baseType: !949, size: 32, align: 32, offset: 4480)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1092, file: !14, line: 2510, baseType: !949, size: 32, align: 32, offset: 4512)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1092, file: !14, line: 2514, baseType: !1023, size: 64, align: 64, offset: 4544)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1092, file: !14, line: 2528, baseType: !1493, size: 64, align: 64, offset: 4608)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DISubroutineType(types: !1495)
!1495 = !{null, !1379, !1009, !949, !949}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1092, file: !14, line: 2534, baseType: !949, size: 32, align: 32, offset: 4672)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1092, file: !14, line: 2545, baseType: !949, size: 32, align: 32, offset: 4704)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1092, file: !14, line: 2547, baseType: !949, size: 32, align: 32, offset: 4736)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1092, file: !14, line: 2549, baseType: !949, size: 32, align: 32, offset: 4768)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1092, file: !14, line: 2551, baseType: !949, size: 32, align: 32, offset: 4800)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1092, file: !14, line: 2553, baseType: !949, size: 32, align: 32, offset: 4832)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1092, file: !14, line: 2555, baseType: !949, size: 32, align: 32, offset: 4864)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1092, file: !14, line: 2557, baseType: !949, size: 32, align: 32, offset: 4896)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1092, file: !14, line: 2559, baseType: !949, size: 32, align: 32, offset: 4928)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1092, file: !14, line: 2563, baseType: !949, size: 32, align: 32, offset: 4960)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1092, file: !14, line: 2571, baseType: !1507, size: 64, align: 64, offset: 4992)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1092, file: !14, line: 2579, baseType: !1507, size: 64, align: 64, offset: 5056)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1092, file: !14, line: 2586, baseType: !949, size: 32, align: 32, offset: 5120)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1092, file: !14, line: 2615, baseType: !949, size: 32, align: 32, offset: 5152)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1092, file: !14, line: 2627, baseType: !949, size: 32, align: 32, offset: 5184)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1092, file: !14, line: 2637, baseType: !949, size: 32, align: 32, offset: 5216)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1092, file: !14, line: 2681, baseType: !949, size: 32, align: 32, offset: 5248)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1092, file: !14, line: 2709, baseType: !1023, size: 64, align: 64, offset: 5312)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1092, file: !14, line: 2716, baseType: !1516, size: 64, align: 64, offset: 5376)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1518)
!1518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1519)
!1519 = !{!1520, !1521, !1522, !1523, !1524, !1525, !1529, !1535, !1539, !1540, !1541, !1542, !2443, !2444, !2445, !2446, !2447}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1518, file: !14, line: 3642, baseType: !967, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1518, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1518, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1518, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1518, file: !14, line: 3669, baseType: !949, size: 32, align: 32, offset: 160)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1518, file: !14, line: 3682, baseType: !1526, size: 64, align: 64, offset: 192)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64, align: 64)
!1527 = !DISubroutineType(types: !1528)
!1528 = !{!949, !1090, !1112}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1518, file: !14, line: 3698, baseType: !1530, size: 64, align: 64, offset: 256)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DISubroutineType(types: !1532)
!1532 = !{!949, !1090, !1533, !957}
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64, align: 64)
!1534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1518, file: !14, line: 3712, baseType: !1536, size: 64, align: 64, offset: 320)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DISubroutineType(types: !1538)
!1538 = !{!949, !1090, !949, !1533, !957}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1518, file: !14, line: 3726, baseType: !1530, size: 64, align: 64, offset: 384)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1518, file: !14, line: 3737, baseType: !1087, size: 64, align: 64, offset: 448)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1518, file: !14, line: 3746, baseType: !949, size: 32, align: 32, offset: 512)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1518, file: !14, line: 3757, baseType: !1543, size: 64, align: 64, offset: 576)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DISubroutineType(types: !1545)
!1545 = !{null, !1546}
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !1548, line: 81, size: 86208, align: 64, elements: !1549)
!1548 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1549 = !{!1550, !1552, !1553, !1554, !1555, !1559, !1560, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1607, !1608, !1663, !1665, !1666, !1667, !1668, !1669, !1680, !1681, !1682, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1698, !1700, !1702, !1703, !1704, !1705, !1706, !1707, !1712, !1714, !1715, !1716, !1717, !1718, !1719, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1746, !1747, !1748, !1749, !1765, !1772, !1784, !1800, !1822, !1862, !1875, !1902, !1917, !1931, !1944, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1965, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1978, !1980, !1981, !1982, !1983, !1984, !1985, !1988, !1990, !1992, !1993, !1996, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2063, !2064, !2066, !2067, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2089, !2090, !2091, !2094, !2095, !2096, !2097, !2099, !2101, !2102, !2103, !2104, !2105, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2187, !2188, !2189, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2318, !2319, !2320, !2321, !2325, !2326, !2330, !2334, !2338, !2339, !2344, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2359, !2360, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2378, !2379, !2380, !2430, !2431, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1547, file: !1548, line: 82, baseType: !1551, size: 64, align: 64)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !1547, file: !1548, line: 84, baseType: !949, size: 32, align: 32, offset: 64)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !1547, file: !1548, line: 84, baseType: !949, size: 32, align: 32, offset: 96)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !1547, file: !1548, line: 85, baseType: !949, size: 32, align: 32, offset: 128)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !1547, file: !1548, line: 86, baseType: !1556, size: 384, align: 32, offset: 160)
!1556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 384, align: 32, elements: !1557)
!1557 = !{!1558}
!1558 = !DISubrange(count: 12)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !1547, file: !1548, line: 87, baseType: !949, size: 32, align: 32, offset: 544)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !1547, file: !1548, line: 90, baseType: !1561, size: 1088, align: 64, offset: 576)
!1561 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !902, line: 35, baseType: !1562)
!1562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !902, line: 31, size: 1088, align: 64, elements: !1563)
!1563 = !{!1564, !1565, !1569}
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1562, file: !902, line: 32, baseType: !1533, size: 64, align: 64)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1562, file: !902, line: 33, baseType: !1566, size: 512, align: 8, offset: 64)
!1566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 512, align: 8, elements: !1567)
!1567 = !{!1568}
!1568 = !DISubrange(count: 64)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1562, file: !902, line: 34, baseType: !1566, size: 512, align: 8, offset: 576)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !1547, file: !1548, line: 91, baseType: !1561, size: 1088, align: 64, offset: 1664)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !1547, file: !1548, line: 92, baseType: !1561, size: 1088, align: 64, offset: 2752)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !1547, file: !1548, line: 93, baseType: !1561, size: 1088, align: 64, offset: 3840)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1547, file: !1548, line: 98, baseType: !1379, size: 64, align: 64, offset: 4928)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1547, file: !1548, line: 100, baseType: !949, size: 32, align: 32, offset: 4992)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1547, file: !1548, line: 100, baseType: !949, size: 32, align: 32, offset: 5024)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1547, file: !1548, line: 101, baseType: !949, size: 32, align: 32, offset: 5056)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "intra_only", scope: !1547, file: !1548, line: 102, baseType: !949, size: 32, align: 32, offset: 5088)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1547, file: !1548, line: 103, baseType: !1023, size: 64, align: 64, offset: 5120)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "out_format", scope: !1547, file: !1548, line: 104, baseType: !894, size: 32, align: 32, offset: 5184)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "h263_pred", scope: !1547, file: !1548, line: 105, baseType: !949, size: 32, align: 32, offset: 5216)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "pb_frame", scope: !1547, file: !1548, line: 106, baseType: !949, size: 32, align: 32, offset: 5248)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "h263_plus", scope: !1547, file: !1548, line: 109, baseType: !949, size: 32, align: 32, offset: 5280)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "h263_flv", scope: !1547, file: !1548, line: 110, baseType: !949, size: 32, align: 32, offset: 5312)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1547, file: !1548, line: 112, baseType: !13, size: 32, align: 32, offset: 5344)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_qscale", scope: !1547, file: !1548, line: 113, baseType: !949, size: 32, align: 32, offset: 5376)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1547, file: !1548, line: 114, baseType: !949, size: 32, align: 32, offset: 5408)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1547, file: !1548, line: 115, baseType: !949, size: 32, align: 32, offset: 5440)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "luma_elim_threshold", scope: !1547, file: !1548, line: 116, baseType: !949, size: 32, align: 32, offset: 5472)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_elim_threshold", scope: !1547, file: !1548, line: 117, baseType: !949, size: 32, align: 32, offset: 5504)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1547, file: !1548, line: 118, baseType: !949, size: 32, align: 32, offset: 5536)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1547, file: !1548, line: 119, baseType: !949, size: 32, align: 32, offset: 5568)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1547, file: !1548, line: 120, baseType: !949, size: 32, align: 32, offset: 5600)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "context_initialized", scope: !1547, file: !1548, line: 124, baseType: !949, size: 32, align: 32, offset: 5632)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture_number", scope: !1547, file: !1548, line: 125, baseType: !949, size: 32, align: 32, offset: 5664)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1547, file: !1548, line: 126, baseType: !949, size: 32, align: 32, offset: 5696)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "picture_number", scope: !1547, file: !1548, line: 127, baseType: !949, size: 32, align: 32, offset: 5728)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "picture_in_gop_number", scope: !1547, file: !1548, line: 128, baseType: !949, size: 32, align: 32, offset: 5760)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !1547, file: !1548, line: 129, baseType: !949, size: 32, align: 32, offset: 5792)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !1547, file: !1548, line: 129, baseType: !949, size: 32, align: 32, offset: 5824)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "mb_stride", scope: !1547, file: !1548, line: 130, baseType: !949, size: 32, align: 32, offset: 5856)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "b8_stride", scope: !1547, file: !1548, line: 131, baseType: !949, size: 32, align: 32, offset: 5888)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "h_edge_pos", scope: !1547, file: !1548, line: 132, baseType: !949, size: 32, align: 32, offset: 5920)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "v_edge_pos", scope: !1547, file: !1548, line: 132, baseType: !949, size: 32, align: 32, offset: 5952)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "mb_num", scope: !1547, file: !1548, line: 133, baseType: !949, size: 32, align: 32, offset: 5984)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1547, file: !1548, line: 134, baseType: !1606, size: 64, align: 64, offset: 6016)
!1606 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1204, line: 149, baseType: !1024)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "uvlinesize", scope: !1547, file: !1548, line: 135, baseType: !1606, size: 64, align: 64, offset: 6080)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "picture", scope: !1547, file: !1548, line: 136, baseType: !1609, size: 64, align: 64, offset: 6144)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !1611, line: 91, baseType: !1612)
!1611 = !DIFile(filename: "libavcodec/mpegpicture.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Picture", file: !1611, line: 45, size: 2624, align: 64, elements: !1613)
!1613 = !{!1614, !1616, !1627, !1628, !1629, !1631, !1637, !1638, !1640, !1641, !1642, !1643, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1612, file: !1611, line: 46, baseType: !1615, size: 64, align: 64)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "tf", scope: !1612, file: !1611, line: 47, baseType: !1617, size: 256, align: 64, offset: 64)
!1617 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadFrame", file: !1618, line: 40, baseType: !1619)
!1618 = !DIFile(filename: "libavcodec/thread.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadFrame", file: !1618, line: 34, size: 256, align: 64, elements: !1620)
!1620 = !{!1621, !1622, !1626}
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1619, file: !1618, line: 35, baseType: !1112, size: 64, align: 64)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1619, file: !1618, line: 36, baseType: !1623, size: 128, align: 64, offset: 64)
!1623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1090, size: 128, align: 64, elements: !1624)
!1624 = !{!1625}
!1625 = !DISubrange(count: 2)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1619, file: !1618, line: 39, baseType: !1150, size: 64, align: 64, offset: 192)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table_buf", scope: !1612, file: !1611, line: 49, baseType: !1150, size: 64, align: 64, offset: 320)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1612, file: !1611, line: 50, baseType: !1194, size: 64, align: 64, offset: 384)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val_buf", scope: !1612, file: !1611, line: 52, baseType: !1630, size: 128, align: 64, offset: 448)
!1630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1150, size: 128, align: 64, elements: !1624)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val", scope: !1612, file: !1611, line: 53, baseType: !1632, size: 128, align: 64, offset: 576)
!1632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1633, size: 128, align: 64, elements: !1624)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1635, size: 32, align: 16, elements: !1624)
!1635 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !958, line: 37, baseType: !1636)
!1636 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_buf", scope: !1612, file: !1611, line: 55, baseType: !1150, size: 64, align: 64, offset: 704)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !1612, file: !1611, line: 56, baseType: !1639, size: 64, align: 64, offset: 768)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "mbskip_table_buf", scope: !1612, file: !1611, line: 58, baseType: !1150, size: 64, align: 64, offset: 832)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "mbskip_table", scope: !1612, file: !1611, line: 59, baseType: !1118, size: 64, align: 64, offset: 896)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "ref_index_buf", scope: !1612, file: !1611, line: 61, baseType: !1630, size: 128, align: 64, offset: 960)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "ref_index", scope: !1612, file: !1611, line: 62, baseType: !1644, size: 128, align: 64, offset: 1088)
!1644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1194, size: 128, align: 64, elements: !1624)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var_buf", scope: !1612, file: !1611, line: 64, baseType: !1150, size: 64, align: 64, offset: 1216)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var", scope: !1612, file: !1611, line: 65, baseType: !1419, size: 64, align: 64, offset: 1280)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var_buf", scope: !1612, file: !1611, line: 67, baseType: !1150, size: 64, align: 64, offset: 1344)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var", scope: !1612, file: !1611, line: 68, baseType: !1419, size: 64, align: 64, offset: 1408)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_mb_width", scope: !1612, file: !1611, line: 70, baseType: !949, size: 32, align: 32, offset: 1472)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_mb_height", scope: !1612, file: !1611, line: 71, baseType: !949, size: 32, align: 32, offset: 1504)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "mb_mean_buf", scope: !1612, file: !1611, line: 73, baseType: !1150, size: 64, align: 64, offset: 1536)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "mb_mean", scope: !1612, file: !1611, line: 74, baseType: !1118, size: 64, align: 64, offset: 1600)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_buf", scope: !1612, file: !1611, line: 76, baseType: !1150, size: 64, align: 64, offset: 1664)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_picture_private", scope: !1612, file: !1611, line: 77, baseType: !1009, size: 64, align: 64, offset: 1728)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "field_picture", scope: !1612, file: !1611, line: 79, baseType: !949, size: 32, align: 32, offset: 1792)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var_sum", scope: !1612, file: !1611, line: 81, baseType: !1023, size: 64, align: 64, offset: 1856)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var_sum", scope: !1612, file: !1611, line: 82, baseType: !1023, size: 64, align: 64, offset: 1920)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_score", scope: !1612, file: !1611, line: 84, baseType: !949, size: 32, align: 32, offset: 1984)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "needs_realloc", scope: !1612, file: !1611, line: 85, baseType: !949, size: 32, align: 32, offset: 2016)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !1612, file: !1611, line: 87, baseType: !949, size: 32, align: 32, offset: 2048)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !1612, file: !1611, line: 88, baseType: !949, size: 32, align: 32, offset: 2080)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "encoding_error", scope: !1612, file: !1611, line: 90, baseType: !1140, size: 512, align: 64, offset: 2112)
