; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--aac_ac3_parser.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--aac_ac3_parser.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecParserContext = type { i8*, %struct.AVCodecParser*, i64, i64, i64, i32, i32, i64, i64, i64, i64, i32, i32, [4 x i64], [4 x i64], [4 x i64], i32, i64, [4 x i64], i32, i64, i32, i32, i32, [4 x i64], i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVCodecParser = type { [5 x i32], i32, i32 (%struct.AVCodecParserContext*)*, {}*, void (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecContext*, i8*, i32)*, %struct.AVCodecParser* }

!827 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!828 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!829 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !495, line: 493, size: 32, align: 32, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847}
!831 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!832 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!833 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!834 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!835 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!836 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!837 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!838 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!839 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!840 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!841 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!842 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!843 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!844 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!845 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!846 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!847 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!848 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !495, line: 538, size: 32, align: 32, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857}
!850 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!851 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!852 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!853 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!854 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!855 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!856 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!857 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !35, line: 1534, size: 32, align: 32, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865}
!860 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!861 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!862 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!863 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!864 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!865 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !35, line: 810, size: 32, align: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !35, line: 5085, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892}
!889 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!890 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!891 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!892 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!893 = !{i32 2, !"Dwarf Version", i32 4}
!894 = !{i32 2, !"Debug Info Version", i32 3}
!895 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!896 = distinct !DISubprogram(name: "ff_aac_ac3_parse", scope: !897, file: !897, line: 28, type: !898, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1566)
!897 = !DIFile(filename: "libavcodec/aac_ac3_parser.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !DISubroutineType(types: !899)
!899 = !{!900, !901, !930, !1565, !1222, !1425, !900}
!900 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64, align: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParserContext", file: !35, line: 5257, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParserContext", file: !35, line: 5092, size: 2816, align: 64, elements: !904)
!904 = !{!905, !907, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !903, file: !35, line: 5093, baseType: !906, size: 64, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !903, file: !35, line: 5094, baseType: !908, size: 64, align: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParser", file: !35, line: 5259, size: 512, align: 64, elements: !910)
!910 = !{!911, !915, !916, !920, !922, !926, !1529}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !909, file: !35, line: 5260, baseType: !912, size: 160, align: 32)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !900, size: 160, align: 32, elements: !913)
!913 = !{!914}
!914 = !DISubrange(count: 5)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !909, file: !35, line: 5261, baseType: !900, size: 32, align: 32, offset: 160)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "parser_init", scope: !909, file: !35, line: 5262, baseType: !917, size: 64, align: 64, offset: 192)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!900, !901}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "parser_parse", scope: !909, file: !35, line: 5265, baseType: !921, size: 64, align: 64, offset: 256)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "parser_close", scope: !909, file: !35, line: 5269, baseType: !923, size: 64, align: 64, offset: 320)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{null, !901}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !909, file: !35, line: 5270, baseType: !927, size: 64, align: 64, offset: 384)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!900, !930, !1425, !900}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !933)
!933 = !{!934, !978, !979, !980, !1252, !1253, !1254, !1255, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1281, !1285, !1286, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1467, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !932, file: !35, line: 1561, baseType: !935, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !939)
!939 = !{!940, !944, !948, !952, !953, !954, !955, !959, !965, !967, !971}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !938, file: !4, line: 72, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !938, file: !4, line: 78, baseType: !945, size: 64, align: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!941, !906}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !938, file: !4, line: 85, baseType: !949, size: 64, align: 64, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !938, file: !4, line: 93, baseType: !900, size: 32, align: 32, offset: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !938, file: !4, line: 99, baseType: !900, size: 32, align: 32, offset: 224)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !938, file: !4, line: 108, baseType: !900, size: 32, align: 32, offset: 256)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !938, file: !4, line: 113, baseType: !956, size: 64, align: 64, offset: 320)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{!906, !906, !906}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !938, file: !4, line: 123, baseType: !960, size: 64, align: 64, offset: 384)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!963, !963}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !938, file: !4, line: 130, baseType: !966, size: 32, align: 32, offset: 448)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !938, file: !4, line: 136, baseType: !968, size: 64, align: 64, offset: 512)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!966, !906}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !938, file: !4, line: 142, baseType: !972, size: 64, align: 64, offset: 576)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!900, !975, !906, !941, !900}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !932, file: !35, line: 1562, baseType: !900, size: 32, align: 32, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !932, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !932, file: !35, line: 1565, baseType: !981, size: 64, align: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !984)
!984 = !{!985, !986, !987, !988, !989, !990, !999, !1002, !1005, !1008, !1014, !1017, !1018, !1026, !1027, !1028, !1030, !1034, !1040, !1045, !1049, !1050, !1102, !1223, !1227, !1228, !1232, !1236, !1241, !1245, !1246, !1247}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !983, file: !35, line: 3475, baseType: !941, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !983, file: !35, line: 3480, baseType: !941, size: 64, align: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !983, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !983, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !983, file: !35, line: 3487, baseType: !900, size: 32, align: 32, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !983, file: !35, line: 3488, baseType: !991, size: 64, align: 64, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !994, line: 61, baseType: !995)
!994 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !994, line: 58, size: 64, align: 32, elements: !996)
!996 = !{!997, !998}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !995, file: !994, line: 59, baseType: !900, size: 32, align: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !995, file: !994, line: 60, baseType: !900, size: 32, align: 32, offset: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !983, file: !35, line: 3489, baseType: !1000, size: 64, align: 64, offset: 320)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !983, file: !35, line: 3490, baseType: !1003, size: 64, align: 64, offset: 384)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !900)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !983, file: !35, line: 3491, baseType: !1006, size: 64, align: 64, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !983, file: !35, line: 3492, baseType: !1009, size: 64, align: 64, offset: 512)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1011)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1012, line: 55, baseType: !1013)
!1012 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1013 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !983, file: !35, line: 3493, baseType: !1015, size: 8, align: 8, offset: 576)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1012, line: 48, baseType: !1016)
!1016 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !983, file: !35, line: 3494, baseType: !935, size: 64, align: 64, offset: 640)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !983, file: !35, line: 3495, baseType: !1019, size: 64, align: 64, offset: 704)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1021)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1023)
!1023 = !{!1024, !1025}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1022, file: !35, line: 3402, baseType: !900, size: 32, align: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1022, file: !35, line: 3403, baseType: !941, size: 64, align: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !983, file: !35, line: 3507, baseType: !941, size: 64, align: 64, offset: 768)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !983, file: !35, line: 3516, baseType: !900, size: 32, align: 32, offset: 832)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !983, file: !35, line: 3517, baseType: !1029, size: 64, align: 64, offset: 896)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !983, file: !35, line: 3527, baseType: !1031, size: 64, align: 64, offset: 960)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!900, !930}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !983, file: !35, line: 3535, baseType: !1035, size: 64, align: 64, offset: 1024)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!900, !930, !1038}
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !983, file: !35, line: 3541, baseType: !1041, size: 64, align: 64, offset: 1088)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1044)
!1044 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !983, file: !35, line: 3549, baseType: !1046, size: 64, align: 64, offset: 1152)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{null, !1029}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !983, file: !35, line: 3551, baseType: !1031, size: 64, align: 64, offset: 1216)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !983, file: !35, line: 3552, baseType: !1051, size: 64, align: 64, offset: 1280)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!900, !930, !1054, !900, !1055}
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1058)
!1058 = !{!1059, !1062, !1065, !1066, !1067, !1099}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1057, file: !35, line: 3921, baseType: !1060, size: 16, align: 16)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1012, line: 49, baseType: !1061)
!1061 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1057, file: !35, line: 3922, baseType: !1063, size: 32, align: 32, offset: 32)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1012, line: 51, baseType: !1064)
!1064 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1057, file: !35, line: 3923, baseType: !1063, size: 32, align: 32, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1057, file: !35, line: 3924, baseType: !1064, size: 32, align: 32, offset: 96)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1057, file: !35, line: 3925, baseType: !1068, size: 64, align: 64, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1071)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1076, !1077, !1078, !1088, !1092, !1094, !1095, !1097, !1098}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1071, file: !35, line: 3886, baseType: !900, size: 32, align: 32)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1071, file: !35, line: 3887, baseType: !900, size: 32, align: 32, offset: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1071, file: !35, line: 3888, baseType: !900, size: 32, align: 32, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1071, file: !35, line: 3889, baseType: !900, size: 32, align: 32, offset: 96)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1071, file: !35, line: 3890, baseType: !900, size: 32, align: 32, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1071, file: !35, line: 3897, baseType: !1079, size: 768, align: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1080)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1081)
!1081 = !{!1082, !1086}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1080, file: !35, line: 3855, baseType: !1083, size: 512, align: 64)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1054, size: 512, align: 64, elements: !1084)
!1084 = !{!1085}
!1085 = !DISubrange(count: 8)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1080, file: !35, line: 3857, baseType: !1087, size: 256, align: 32, offset: 512)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !900, size: 256, align: 32, elements: !1084)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1071, file: !35, line: 3903, baseType: !1089, size: 256, align: 64, offset: 960)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1054, size: 256, align: 64, elements: !1090)
!1090 = !{!1091}
!1091 = !DISubrange(count: 4)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1071, file: !35, line: 3904, baseType: !1093, size: 128, align: 32, offset: 1216)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !900, size: 128, align: 32, elements: !1090)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1071, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1071, file: !35, line: 3908, baseType: !1096, size: 64, align: 64, offset: 1408)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1071, file: !35, line: 3915, baseType: !1096, size: 64, align: 64, offset: 1472)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1071, file: !35, line: 3917, baseType: !900, size: 32, align: 32, offset: 1536)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1057, file: !35, line: 3926, baseType: !1100, size: 64, align: 64, offset: 192)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1012, line: 40, baseType: !1101)
!1101 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !983, file: !35, line: 3564, baseType: !1103, size: 64, align: 64, offset: 1344)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!900, !930, !1106, !1140, !1222}
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1109)
!1109 = !{!1110, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1136, !1137, !1138, !1139}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1108, file: !35, line: 1451, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1113, line: 94, baseType: !1114)
!1113 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1113, line: 81, size: 192, align: 64, elements: !1115)
!1115 = !{!1116, !1120, !1121}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1114, file: !1113, line: 82, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1113, line: 73, baseType: !1119)
!1119 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1113, line: 73, flags: DIFlagFwdDecl)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1114, file: !1113, line: 89, baseType: !1054, size: 64, align: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1114, file: !1113, line: 93, baseType: !900, size: 32, align: 32, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1108, file: !35, line: 1461, baseType: !1100, size: 64, align: 64, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1108, file: !35, line: 1467, baseType: !1100, size: 64, align: 64, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1108, file: !35, line: 1468, baseType: !1054, size: 64, align: 64, offset: 192)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1108, file: !35, line: 1469, baseType: !900, size: 32, align: 32, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1108, file: !35, line: 1470, baseType: !900, size: 32, align: 32, offset: 288)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1108, file: !35, line: 1474, baseType: !900, size: 32, align: 32, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1108, file: !35, line: 1479, baseType: !1129, size: 64, align: 64, offset: 384)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1131)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1132)
!1132 = !{!1133, !1134, !1135}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1131, file: !35, line: 1412, baseType: !1054, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1131, file: !35, line: 1413, baseType: !900, size: 32, align: 32, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1131, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1108, file: !35, line: 1480, baseType: !900, size: 32, align: 32, offset: 448)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1108, file: !35, line: 1486, baseType: !1100, size: 64, align: 64, offset: 512)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1108, file: !35, line: 1488, baseType: !1100, size: 64, align: 64, offset: 576)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1108, file: !35, line: 1497, baseType: !1100, size: 64, align: 64, offset: 640)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1142)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1143)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1144)
!1144 = !{!1145, !1146, !1147, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1174, !1176, !1177, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1210, !1211, !1212, !1213, !1214, !1215, !1218, !1219, !1220, !1221}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1143, file: !758, line: 282, baseType: !1083, size: 512, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1143, file: !758, line: 299, baseType: !1087, size: 256, align: 32, offset: 512)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1143, file: !758, line: 315, baseType: !1148, size: 64, align: 64, offset: 768)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1143, file: !758, line: 326, baseType: !900, size: 32, align: 32, offset: 832)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1143, file: !758, line: 326, baseType: !900, size: 32, align: 32, offset: 864)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1143, file: !758, line: 334, baseType: !900, size: 32, align: 32, offset: 896)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1143, file: !758, line: 341, baseType: !900, size: 32, align: 32, offset: 928)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1143, file: !758, line: 346, baseType: !900, size: 32, align: 32, offset: 960)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1143, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1143, file: !758, line: 356, baseType: !993, size: 64, align: 32, offset: 1024)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1143, file: !758, line: 361, baseType: !1100, size: 64, align: 64, offset: 1088)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1143, file: !758, line: 369, baseType: !1100, size: 64, align: 64, offset: 1152)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1143, file: !758, line: 377, baseType: !1100, size: 64, align: 64, offset: 1216)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1143, file: !758, line: 382, baseType: !900, size: 32, align: 32, offset: 1280)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1143, file: !758, line: 386, baseType: !900, size: 32, align: 32, offset: 1312)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1143, file: !758, line: 391, baseType: !900, size: 32, align: 32, offset: 1344)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1143, file: !758, line: 396, baseType: !906, size: 64, align: 64, offset: 1408)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1143, file: !758, line: 403, baseType: !1164, size: 512, align: 64, offset: 1472)
!1164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1011, size: 512, align: 64, elements: !1084)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1143, file: !758, line: 410, baseType: !900, size: 32, align: 32, offset: 1984)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1143, file: !758, line: 415, baseType: !900, size: 32, align: 32, offset: 2016)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1143, file: !758, line: 420, baseType: !900, size: 32, align: 32, offset: 2048)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1143, file: !758, line: 425, baseType: !900, size: 32, align: 32, offset: 2080)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1143, file: !758, line: 435, baseType: !1100, size: 64, align: 64, offset: 2112)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1143, file: !758, line: 440, baseType: !900, size: 32, align: 32, offset: 2176)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1143, file: !758, line: 445, baseType: !1011, size: 64, align: 64, offset: 2240)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1143, file: !758, line: 459, baseType: !1173, size: 512, align: 64, offset: 2304)
!1173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1111, size: 512, align: 64, elements: !1084)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1143, file: !758, line: 473, baseType: !1175, size: 64, align: 64, offset: 2816)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1143, file: !758, line: 477, baseType: !900, size: 32, align: 32, offset: 2880)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1143, file: !758, line: 479, baseType: !1178, size: 64, align: 64, offset: 2944)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1182)
!1182 = !{!1183, !1184, !1185, !1186, !1191}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1181, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1181, file: !758, line: 203, baseType: !1054, size: 64, align: 64, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1181, file: !758, line: 204, baseType: !900, size: 32, align: 32, offset: 128)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1181, file: !758, line: 205, baseType: !1187, size: 64, align: 64, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1189, line: 86, baseType: !1190)
!1189 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1190 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1189, line: 86, flags: DIFlagFwdDecl)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1181, file: !758, line: 206, baseType: !1111, size: 64, align: 64, offset: 256)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1143, file: !758, line: 480, baseType: !900, size: 32, align: 32, offset: 3008)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1143, file: !758, line: 505, baseType: !900, size: 32, align: 32, offset: 3040)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1143, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1143, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1143, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1143, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1143, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1143, file: !758, line: 532, baseType: !1100, size: 64, align: 64, offset: 3264)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1143, file: !758, line: 539, baseType: !1100, size: 64, align: 64, offset: 3328)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1143, file: !758, line: 547, baseType: !1100, size: 64, align: 64, offset: 3392)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1143, file: !758, line: 554, baseType: !1187, size: 64, align: 64, offset: 3456)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1143, file: !758, line: 563, baseType: !900, size: 32, align: 32, offset: 3520)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1143, file: !758, line: 572, baseType: !900, size: 32, align: 32, offset: 3552)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1143, file: !758, line: 581, baseType: !900, size: 32, align: 32, offset: 3584)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1143, file: !758, line: 588, baseType: !1207, size: 64, align: 64, offset: 3648)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1012, line: 36, baseType: !1209)
!1209 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1143, file: !758, line: 593, baseType: !900, size: 32, align: 32, offset: 3712)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1143, file: !758, line: 596, baseType: !900, size: 32, align: 32, offset: 3744)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1143, file: !758, line: 599, baseType: !1111, size: 64, align: 64, offset: 3776)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1143, file: !758, line: 605, baseType: !1111, size: 64, align: 64, offset: 3840)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1143, file: !758, line: 616, baseType: !1111, size: 64, align: 64, offset: 3904)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1143, file: !758, line: 626, baseType: !1216, size: 64, align: 64, offset: 3968)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1217, line: 216, baseType: !1013)
!1217 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1143, file: !758, line: 627, baseType: !1216, size: 64, align: 64, offset: 4032)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1143, file: !758, line: 628, baseType: !1216, size: 64, align: 64, offset: 4096)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1143, file: !758, line: 629, baseType: !1216, size: 64, align: 64, offset: 4160)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1143, file: !758, line: 645, baseType: !1111, size: 64, align: 64, offset: 4224)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !983, file: !35, line: 3566, baseType: !1224, size: 64, align: 64, offset: 1408)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!900, !930, !906, !1222, !1106}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !983, file: !35, line: 3567, baseType: !1031, size: 64, align: 64, offset: 1472)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !983, file: !35, line: 3576, baseType: !1229, size: 64, align: 64, offset: 1536)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!900, !930, !1140}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !983, file: !35, line: 3577, baseType: !1233, size: 64, align: 64, offset: 1600)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!900, !930, !1106}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !983, file: !35, line: 3584, baseType: !1237, size: 64, align: 64, offset: 1664)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{!900, !930, !1240}
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !983, file: !35, line: 3589, baseType: !1242, size: 64, align: 64, offset: 1728)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{null, !930}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !983, file: !35, line: 3594, baseType: !900, size: 32, align: 32, offset: 1792)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !983, file: !35, line: 3600, baseType: !941, size: 64, align: 64, offset: 1856)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !983, file: !35, line: 3609, baseType: !1248, size: 64, align: 64, offset: 1920)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1251)
!1251 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !932, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !932, file: !35, line: 1581, baseType: !1064, size: 32, align: 32, offset: 224)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !932, file: !35, line: 1583, baseType: !906, size: 64, align: 64, offset: 256)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !932, file: !35, line: 1591, baseType: !1256, size: 64, align: 64, offset: 320)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !932, file: !35, line: 1598, baseType: !906, size: 64, align: 64, offset: 384)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !932, file: !35, line: 1606, baseType: !1100, size: 64, align: 64, offset: 448)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !932, file: !35, line: 1614, baseType: !900, size: 32, align: 32, offset: 512)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !932, file: !35, line: 1622, baseType: !900, size: 32, align: 32, offset: 544)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !932, file: !35, line: 1628, baseType: !900, size: 32, align: 32, offset: 576)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !932, file: !35, line: 1636, baseType: !900, size: 32, align: 32, offset: 608)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !932, file: !35, line: 1643, baseType: !900, size: 32, align: 32, offset: 640)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !932, file: !35, line: 1657, baseType: !1054, size: 64, align: 64, offset: 704)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !932, file: !35, line: 1658, baseType: !900, size: 32, align: 32, offset: 768)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !932, file: !35, line: 1679, baseType: !993, size: 64, align: 32, offset: 800)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !932, file: !35, line: 1688, baseType: !900, size: 32, align: 32, offset: 864)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !932, file: !35, line: 1712, baseType: !900, size: 32, align: 32, offset: 896)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !932, file: !35, line: 1729, baseType: !900, size: 32, align: 32, offset: 928)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !932, file: !35, line: 1729, baseType: !900, size: 32, align: 32, offset: 960)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !932, file: !35, line: 1744, baseType: !900, size: 32, align: 32, offset: 992)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !932, file: !35, line: 1744, baseType: !900, size: 32, align: 32, offset: 1024)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !932, file: !35, line: 1751, baseType: !900, size: 32, align: 32, offset: 1056)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !932, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !932, file: !35, line: 1791, baseType: !1277, size: 64, align: 64, offset: 1152)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{null, !1280, !1140, !1222, !900, !900, !900}
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !932, file: !35, line: 1808, baseType: !1282, size: 64, align: 64, offset: 1216)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!494, !1280, !1000}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !932, file: !35, line: 1816, baseType: !900, size: 32, align: 32, offset: 1280)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !932, file: !35, line: 1825, baseType: !1287, size: 32, align: 32, offset: 1312)
!1287 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !932, file: !35, line: 1830, baseType: !900, size: 32, align: 32, offset: 1344)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !932, file: !35, line: 1838, baseType: !1287, size: 32, align: 32, offset: 1376)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !932, file: !35, line: 1846, baseType: !900, size: 32, align: 32, offset: 1408)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !932, file: !35, line: 1851, baseType: !900, size: 32, align: 32, offset: 1440)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !932, file: !35, line: 1861, baseType: !1287, size: 32, align: 32, offset: 1472)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !932, file: !35, line: 1868, baseType: !1287, size: 32, align: 32, offset: 1504)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !932, file: !35, line: 1875, baseType: !1287, size: 32, align: 32, offset: 1536)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !932, file: !35, line: 1882, baseType: !1287, size: 32, align: 32, offset: 1568)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !932, file: !35, line: 1889, baseType: !1287, size: 32, align: 32, offset: 1600)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !932, file: !35, line: 1896, baseType: !1287, size: 32, align: 32, offset: 1632)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !932, file: !35, line: 1903, baseType: !1287, size: 32, align: 32, offset: 1664)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !932, file: !35, line: 1910, baseType: !900, size: 32, align: 32, offset: 1696)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !932, file: !35, line: 1915, baseType: !900, size: 32, align: 32, offset: 1728)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !932, file: !35, line: 1926, baseType: !1222, size: 64, align: 64, offset: 1792)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !932, file: !35, line: 1935, baseType: !993, size: 64, align: 32, offset: 1856)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !932, file: !35, line: 1942, baseType: !900, size: 32, align: 32, offset: 1920)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !932, file: !35, line: 1948, baseType: !900, size: 32, align: 32, offset: 1952)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !932, file: !35, line: 1954, baseType: !900, size: 32, align: 32, offset: 1984)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !932, file: !35, line: 1960, baseType: !900, size: 32, align: 32, offset: 2016)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !932, file: !35, line: 1984, baseType: !900, size: 32, align: 32, offset: 2048)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !932, file: !35, line: 1991, baseType: !900, size: 32, align: 32, offset: 2080)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !932, file: !35, line: 1996, baseType: !900, size: 32, align: 32, offset: 2112)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !932, file: !35, line: 2004, baseType: !900, size: 32, align: 32, offset: 2144)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !932, file: !35, line: 2011, baseType: !900, size: 32, align: 32, offset: 2176)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !932, file: !35, line: 2018, baseType: !900, size: 32, align: 32, offset: 2208)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !932, file: !35, line: 2027, baseType: !900, size: 32, align: 32, offset: 2240)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !932, file: !35, line: 2034, baseType: !900, size: 32, align: 32, offset: 2272)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !932, file: !35, line: 2044, baseType: !900, size: 32, align: 32, offset: 2304)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !932, file: !35, line: 2054, baseType: !1317, size: 64, align: 64, offset: 2368)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !932, file: !35, line: 2061, baseType: !1317, size: 64, align: 64, offset: 2432)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !932, file: !35, line: 2066, baseType: !900, size: 32, align: 32, offset: 2496)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !932, file: !35, line: 2070, baseType: !900, size: 32, align: 32, offset: 2528)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !932, file: !35, line: 2078, baseType: !900, size: 32, align: 32, offset: 2560)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !932, file: !35, line: 2085, baseType: !900, size: 32, align: 32, offset: 2592)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !932, file: !35, line: 2092, baseType: !900, size: 32, align: 32, offset: 2624)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !932, file: !35, line: 2099, baseType: !900, size: 32, align: 32, offset: 2656)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !932, file: !35, line: 2106, baseType: !900, size: 32, align: 32, offset: 2688)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !932, file: !35, line: 2113, baseType: !900, size: 32, align: 32, offset: 2720)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !932, file: !35, line: 2120, baseType: !900, size: 32, align: 32, offset: 2752)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !932, file: !35, line: 2125, baseType: !900, size: 32, align: 32, offset: 2784)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !932, file: !35, line: 2133, baseType: !900, size: 32, align: 32, offset: 2816)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !932, file: !35, line: 2140, baseType: !900, size: 32, align: 32, offset: 2848)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !932, file: !35, line: 2145, baseType: !900, size: 32, align: 32, offset: 2880)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !932, file: !35, line: 2153, baseType: !900, size: 32, align: 32, offset: 2912)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !932, file: !35, line: 2158, baseType: !900, size: 32, align: 32, offset: 2944)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !932, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !932, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !932, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !932, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !932, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !932, file: !35, line: 2203, baseType: !900, size: 32, align: 32, offset: 3136)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !932, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !932, file: !35, line: 2212, baseType: !900, size: 32, align: 32, offset: 3200)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !932, file: !35, line: 2213, baseType: !900, size: 32, align: 32, offset: 3232)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !932, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !932, file: !35, line: 2232, baseType: !900, size: 32, align: 32, offset: 3296)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !932, file: !35, line: 2243, baseType: !900, size: 32, align: 32, offset: 3328)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !932, file: !35, line: 2249, baseType: !900, size: 32, align: 32, offset: 3360)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !932, file: !35, line: 2256, baseType: !900, size: 32, align: 32, offset: 3392)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !932, file: !35, line: 2263, baseType: !1011, size: 64, align: 64, offset: 3456)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !932, file: !35, line: 2270, baseType: !1011, size: 64, align: 64, offset: 3520)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !932, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !932, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !932, file: !35, line: 2367, baseType: !1353, size: 64, align: 64, offset: 3648)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DISubroutineType(types: !1355)
!1355 = !{!900, !1280, !1240, !900}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !932, file: !35, line: 2383, baseType: !900, size: 32, align: 32, offset: 3712)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !932, file: !35, line: 2386, baseType: !1287, size: 32, align: 32, offset: 3744)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !932, file: !35, line: 2387, baseType: !1287, size: 32, align: 32, offset: 3776)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !932, file: !35, line: 2394, baseType: !900, size: 32, align: 32, offset: 3808)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !932, file: !35, line: 2401, baseType: !900, size: 32, align: 32, offset: 3840)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !932, file: !35, line: 2408, baseType: !900, size: 32, align: 32, offset: 3872)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !932, file: !35, line: 2415, baseType: !900, size: 32, align: 32, offset: 3904)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !932, file: !35, line: 2422, baseType: !900, size: 32, align: 32, offset: 3936)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !932, file: !35, line: 2423, baseType: !1365, size: 64, align: 64, offset: 3968)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1367)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1368)
!1368 = !{!1369, !1370, !1371, !1372}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1367, file: !35, line: 827, baseType: !900, size: 32, align: 32)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1367, file: !35, line: 828, baseType: !900, size: 32, align: 32, offset: 32)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1367, file: !35, line: 829, baseType: !900, size: 32, align: 32, offset: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1367, file: !35, line: 830, baseType: !1287, size: 32, align: 32, offset: 96)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !932, file: !35, line: 2430, baseType: !1100, size: 64, align: 64, offset: 4032)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !932, file: !35, line: 2437, baseType: !1100, size: 64, align: 64, offset: 4096)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !932, file: !35, line: 2444, baseType: !1287, size: 32, align: 32, offset: 4160)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !932, file: !35, line: 2451, baseType: !1287, size: 32, align: 32, offset: 4192)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !932, file: !35, line: 2458, baseType: !900, size: 32, align: 32, offset: 4224)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !932, file: !35, line: 2469, baseType: !900, size: 32, align: 32, offset: 4256)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !932, file: !35, line: 2475, baseType: !900, size: 32, align: 32, offset: 4288)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !932, file: !35, line: 2481, baseType: !900, size: 32, align: 32, offset: 4320)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !932, file: !35, line: 2485, baseType: !900, size: 32, align: 32, offset: 4352)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !932, file: !35, line: 2489, baseType: !900, size: 32, align: 32, offset: 4384)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !932, file: !35, line: 2493, baseType: !900, size: 32, align: 32, offset: 4416)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !932, file: !35, line: 2501, baseType: !900, size: 32, align: 32, offset: 4448)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !932, file: !35, line: 2506, baseType: !900, size: 32, align: 32, offset: 4480)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !932, file: !35, line: 2510, baseType: !900, size: 32, align: 32, offset: 4512)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !932, file: !35, line: 2514, baseType: !1100, size: 64, align: 64, offset: 4544)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !932, file: !35, line: 2528, baseType: !1389, size: 64, align: 64, offset: 4608)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DISubroutineType(types: !1391)
!1391 = !{null, !1280, !906, !900, !900}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !932, file: !35, line: 2534, baseType: !900, size: 32, align: 32, offset: 4672)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !932, file: !35, line: 2545, baseType: !900, size: 32, align: 32, offset: 4704)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !932, file: !35, line: 2547, baseType: !900, size: 32, align: 32, offset: 4736)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !932, file: !35, line: 2549, baseType: !900, size: 32, align: 32, offset: 4768)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !932, file: !35, line: 2551, baseType: !900, size: 32, align: 32, offset: 4800)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !932, file: !35, line: 2553, baseType: !900, size: 32, align: 32, offset: 4832)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !932, file: !35, line: 2555, baseType: !900, size: 32, align: 32, offset: 4864)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !932, file: !35, line: 2557, baseType: !900, size: 32, align: 32, offset: 4896)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !932, file: !35, line: 2559, baseType: !900, size: 32, align: 32, offset: 4928)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !932, file: !35, line: 2563, baseType: !900, size: 32, align: 32, offset: 4960)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !932, file: !35, line: 2571, baseType: !1096, size: 64, align: 64, offset: 4992)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !932, file: !35, line: 2579, baseType: !1096, size: 64, align: 64, offset: 5056)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !932, file: !35, line: 2586, baseType: !900, size: 32, align: 32, offset: 5120)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !932, file: !35, line: 2615, baseType: !900, size: 32, align: 32, offset: 5152)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !932, file: !35, line: 2627, baseType: !900, size: 32, align: 32, offset: 5184)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !932, file: !35, line: 2637, baseType: !900, size: 32, align: 32, offset: 5216)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !932, file: !35, line: 2681, baseType: !900, size: 32, align: 32, offset: 5248)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !932, file: !35, line: 2709, baseType: !1100, size: 64, align: 64, offset: 5312)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !932, file: !35, line: 2716, baseType: !1411, size: 64, align: 64, offset: 5376)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1413)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1414)
!1414 = !{!1415, !1416, !1417, !1418, !1419, !1420, !1421, !1427, !1431, !1432, !1433, !1434, !1440, !1441, !1442, !1443, !1444}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1413, file: !35, line: 3642, baseType: !941, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1413, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1413, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1413, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1413, file: !35, line: 3669, baseType: !900, size: 32, align: 32, offset: 160)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1413, file: !35, line: 3682, baseType: !1237, size: 64, align: 64, offset: 192)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1413, file: !35, line: 3698, baseType: !1422, size: 64, align: 64, offset: 256)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{!900, !930, !1425, !1063}
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1413, file: !35, line: 3712, baseType: !1428, size: 64, align: 64, offset: 320)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{!900, !930, !900, !1425, !1063}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1413, file: !35, line: 3726, baseType: !1422, size: 64, align: 64, offset: 384)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1413, file: !35, line: 3737, baseType: !1031, size: 64, align: 64, offset: 448)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1413, file: !35, line: 3746, baseType: !900, size: 32, align: 32, offset: 512)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1413, file: !35, line: 3757, baseType: !1435, size: 64, align: 64, offset: 576)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DISubroutineType(types: !1437)
!1437 = !{null, !1438}
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1413, file: !35, line: 3766, baseType: !1031, size: 64, align: 64, offset: 640)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1413, file: !35, line: 3774, baseType: !1031, size: 64, align: 64, offset: 704)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1413, file: !35, line: 3780, baseType: !900, size: 32, align: 32, offset: 768)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1413, file: !35, line: 3785, baseType: !900, size: 32, align: 32, offset: 800)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1413, file: !35, line: 3795, baseType: !1445, size: 64, align: 64, offset: 832)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DISubroutineType(types: !1447)
!1447 = !{!900, !930, !1111}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !932, file: !35, line: 2728, baseType: !906, size: 64, align: 64, offset: 5440)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !932, file: !35, line: 2735, baseType: !1164, size: 512, align: 64, offset: 5504)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !932, file: !35, line: 2742, baseType: !900, size: 32, align: 32, offset: 6016)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !932, file: !35, line: 2755, baseType: !900, size: 32, align: 32, offset: 6048)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !932, file: !35, line: 2776, baseType: !900, size: 32, align: 32, offset: 6080)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !932, file: !35, line: 2783, baseType: !900, size: 32, align: 32, offset: 6112)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !932, file: !35, line: 2791, baseType: !900, size: 32, align: 32, offset: 6144)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !932, file: !35, line: 2802, baseType: !1240, size: 64, align: 64, offset: 6208)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !932, file: !35, line: 2811, baseType: !900, size: 32, align: 32, offset: 6272)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !932, file: !35, line: 2821, baseType: !900, size: 32, align: 32, offset: 6304)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !932, file: !35, line: 2830, baseType: !900, size: 32, align: 32, offset: 6336)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !932, file: !35, line: 2840, baseType: !900, size: 32, align: 32, offset: 6368)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !932, file: !35, line: 2851, baseType: !1461, size: 64, align: 64, offset: 6400)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!900, !1280, !1464, !906, !1222, !900, !900}
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DISubroutineType(types: !1466)
!1466 = !{!900, !1280, !906}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !932, file: !35, line: 2871, baseType: !1468, size: 64, align: 64, offset: 6464)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!900, !1280, !1471, !906, !1222, !900}
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DISubroutineType(types: !1473)
!1473 = !{!900, !1280, !906, !900, !900}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !932, file: !35, line: 2878, baseType: !900, size: 32, align: 32, offset: 6528)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !932, file: !35, line: 2885, baseType: !900, size: 32, align: 32, offset: 6560)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !932, file: !35, line: 3005, baseType: !900, size: 32, align: 32, offset: 6592)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !932, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !932, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !932, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !932, file: !35, line: 3037, baseType: !1054, size: 64, align: 64, offset: 6720)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !932, file: !35, line: 3038, baseType: !900, size: 32, align: 32, offset: 6784)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !932, file: !35, line: 3050, baseType: !1011, size: 64, align: 64, offset: 6848)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !932, file: !35, line: 3065, baseType: !900, size: 32, align: 32, offset: 6912)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !932, file: !35, line: 3083, baseType: !900, size: 32, align: 32, offset: 6944)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !932, file: !35, line: 3092, baseType: !993, size: 64, align: 32, offset: 6976)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !932, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !932, file: !35, line: 3106, baseType: !993, size: 64, align: 32, offset: 7072)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !932, file: !35, line: 3113, baseType: !1489, size: 64, align: 64, offset: 7168)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1491)
!1491 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1492)
!1492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1493)
!1493 = !{!1494, !1495, !1496, !1497, !1498, !1499, !1502}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1492, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1492, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1492, file: !35, line: 720, baseType: !941, size: 64, align: 64, offset: 64)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1492, file: !35, line: 724, baseType: !941, size: 64, align: 64, offset: 128)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1492, file: !35, line: 728, baseType: !900, size: 32, align: 32, offset: 192)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1492, file: !35, line: 734, baseType: !1500, size: 64, align: 64, offset: 256)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1492, file: !35, line: 739, baseType: !1503, size: 64, align: 64, offset: 320)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1022)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !932, file: !35, line: 3129, baseType: !1100, size: 64, align: 64, offset: 7232)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !932, file: !35, line: 3130, baseType: !1100, size: 64, align: 64, offset: 7296)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !932, file: !35, line: 3131, baseType: !1100, size: 64, align: 64, offset: 7360)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !932, file: !35, line: 3132, baseType: !1100, size: 64, align: 64, offset: 7424)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !932, file: !35, line: 3139, baseType: !1096, size: 64, align: 64, offset: 7488)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !932, file: !35, line: 3147, baseType: !900, size: 32, align: 32, offset: 7552)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !932, file: !35, line: 3165, baseType: !900, size: 32, align: 32, offset: 7584)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !932, file: !35, line: 3172, baseType: !900, size: 32, align: 32, offset: 7616)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !932, file: !35, line: 3180, baseType: !900, size: 32, align: 32, offset: 7648)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !932, file: !35, line: 3191, baseType: !1317, size: 64, align: 64, offset: 7680)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !932, file: !35, line: 3199, baseType: !1054, size: 64, align: 64, offset: 7744)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !932, file: !35, line: 3207, baseType: !1096, size: 64, align: 64, offset: 7808)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !932, file: !35, line: 3214, baseType: !1064, size: 32, align: 32, offset: 7872)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !932, file: !35, line: 3224, baseType: !1129, size: 64, align: 64, offset: 7936)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !932, file: !35, line: 3225, baseType: !900, size: 32, align: 32, offset: 8000)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !932, file: !35, line: 3249, baseType: !1111, size: 64, align: 64, offset: 8064)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !932, file: !35, line: 3256, baseType: !900, size: 32, align: 32, offset: 8128)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !932, file: !35, line: 3271, baseType: !900, size: 32, align: 32, offset: 8160)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !932, file: !35, line: 3279, baseType: !1100, size: 64, align: 64, offset: 8192)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !932, file: !35, line: 3301, baseType: !1111, size: 64, align: 64, offset: 8256)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !932, file: !35, line: 3310, baseType: !900, size: 32, align: 32, offset: 8320)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !932, file: !35, line: 3337, baseType: !900, size: 32, align: 32, offset: 8352)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !932, file: !35, line: 3351, baseType: !900, size: 32, align: 32, offset: 8384)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !932, file: !35, line: 3359, baseType: !900, size: 32, align: 32, offset: 8416)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !909, file: !35, line: 5271, baseType: !908, size: 64, align: 64, offset: 448)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !903, file: !35, line: 5095, baseType: !1100, size: 64, align: 64, offset: 128)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "cur_offset", scope: !903, file: !35, line: 5096, baseType: !1100, size: 64, align: 64, offset: 192)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame_offset", scope: !903, file: !35, line: 5098, baseType: !1100, size: 64, align: 64, offset: 256)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !903, file: !35, line: 5100, baseType: !900, size: 32, align: 32, offset: 320)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !903, file: !35, line: 5110, baseType: !900, size: 32, align: 32, offset: 352)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !903, file: !35, line: 5111, baseType: !1100, size: 64, align: 64, offset: 384)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !903, file: !35, line: 5112, baseType: !1100, size: 64, align: 64, offset: 448)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "last_pts", scope: !903, file: !35, line: 5115, baseType: !1100, size: 64, align: 64, offset: 512)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "last_dts", scope: !903, file: !35, line: 5116, baseType: !1100, size: 64, align: 64, offset: 576)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "fetch_timestamp", scope: !903, file: !35, line: 5117, baseType: !900, size: 32, align: 32, offset: 640)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_start_index", scope: !903, file: !35, line: 5120, baseType: !900, size: 32, align: 32, offset: 672)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_offset", scope: !903, file: !35, line: 5121, baseType: !1542, size: 256, align: 64, offset: 704)
!1542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1100, size: 256, align: 64, elements: !1090)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pts", scope: !903, file: !35, line: 5122, baseType: !1542, size: 256, align: 64, offset: 960)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_dts", scope: !903, file: !35, line: 5123, baseType: !1542, size: 256, align: 64, offset: 1216)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !903, file: !35, line: 5125, baseType: !900, size: 32, align: 32, offset: 1472)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !903, file: !35, line: 5132, baseType: !1100, size: 64, align: 64, offset: 1536)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_end", scope: !903, file: !35, line: 5133, baseType: !1542, size: 256, align: 64, offset: 1600)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !903, file: !35, line: 5141, baseType: !900, size: 32, align: 32, offset: 1856)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !903, file: !35, line: 5148, baseType: !1100, size: 64, align: 64, offset: 1920)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "dts_sync_point", scope: !903, file: !35, line: 5161, baseType: !900, size: 32, align: 32, offset: 1984)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "dts_ref_dts_delta", scope: !903, file: !35, line: 5176, baseType: !900, size: 32, align: 32, offset: 2016)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "pts_dts_delta", scope: !903, file: !35, line: 5190, baseType: !900, size: 32, align: 32, offset: 2048)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pos", scope: !903, file: !35, line: 5197, baseType: !1542, size: 256, align: 64, offset: 2112)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !903, file: !35, line: 5202, baseType: !1100, size: 64, align: 64, offset: 2368)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !903, file: !35, line: 5207, baseType: !1100, size: 64, align: 64, offset: 2432)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !903, file: !35, line: 5214, baseType: !900, size: 32, align: 32, offset: 2496)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !903, file: !35, line: 5216, baseType: !858, size: 32, align: 32, offset: 2528)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "picture_structure", scope: !903, file: !35, line: 5226, baseType: !887, size: 32, align: 32, offset: 2560)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "output_picture_number", scope: !903, file: !35, line: 5234, baseType: !900, size: 32, align: 32, offset: 2592)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !903, file: !35, line: 5239, baseType: !900, size: 32, align: 32, offset: 2624)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !903, file: !35, line: 5240, baseType: !900, size: 32, align: 32, offset: 2656)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !903, file: !35, line: 5245, baseType: !900, size: 32, align: 32, offset: 2688)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !903, file: !35, line: 5246, baseType: !900, size: 32, align: 32, offset: 2720)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !903, file: !35, line: 5256, baseType: !900, size: 32, align: 32, offset: 2752)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1566 = !{}
!1567 = !DILocalVariable(name: "s1", arg: 1, scope: !896, file: !897, line: 28, type: !901)
!1568 = !DIExpression()
!1569 = !DILocation(line: 28, column: 44, scope: !896)
!1570 = !DILocalVariable(name: "avctx", arg: 2, scope: !896, file: !897, line: 29, type: !930)
!1571 = !DILocation(line: 29, column: 38, scope: !896)
!1572 = !DILocalVariable(name: "poutbuf", arg: 3, scope: !896, file: !897, line: 30, type: !1565)
!1573 = !DILocation(line: 30, column: 38, scope: !896)
!1574 = !DILocalVariable(name: "poutbuf_size", arg: 4, scope: !896, file: !897, line: 30, type: !1222)
!1575 = !DILocation(line: 30, column: 52, scope: !896)
!1576 = !DILocalVariable(name: "buf", arg: 5, scope: !896, file: !897, line: 31, type: !1425)
!1577 = !DILocation(line: 31, column: 37, scope: !896)
!1578 = !DILocalVariable(name: "buf_size", arg: 6, scope: !896, file: !897, line: 31, type: !900)
!1579 = !DILocation(line: 31, column: 46, scope: !896)
!1580 = !DILocalVariable(name: "s", scope: !896, file: !897, line: 33, type: !1581)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64, align: 64)
!1582 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACAC3ParseContext", file: !1583, line: 59, baseType: !1584)
!1583 = !DIFile(filename: "libavcodec/aac_ac3_parser.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACAC3ParseContext", file: !1583, line: 40, size: 896, align: 64, elements: !1585)
!1585 = !{!1586, !1600, !1601, !1602, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !1584, file: !1583, line: 41, baseType: !1587, size: 384, align: 64)
!1587 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParseContext", file: !1588, line: 38, baseType: !1589)
!1588 = !DIFile(filename: "libavcodec/parser.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParseContext", file: !1588, line: 28, size: 384, align: 64, elements: !1590)
!1590 = !{!1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1589, file: !1588, line: 29, baseType: !1054, size: 64, align: 64)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1589, file: !1588, line: 30, baseType: !900, size: 32, align: 32, offset: 64)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "last_index", scope: !1589, file: !1588, line: 31, baseType: !900, size: 32, align: 32, offset: 96)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1589, file: !1588, line: 32, baseType: !1064, size: 32, align: 32, offset: 128)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1589, file: !1588, line: 33, baseType: !1063, size: 32, align: 32, offset: 160)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "frame_start_found", scope: !1589, file: !1588, line: 34, baseType: !900, size: 32, align: 32, offset: 192)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "overread", scope: !1589, file: !1588, line: 35, baseType: !900, size: 32, align: 32, offset: 224)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "overread_index", scope: !1589, file: !1588, line: 36, baseType: !900, size: 32, align: 32, offset: 256)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "state64", scope: !1589, file: !1588, line: 37, baseType: !1011, size: 64, align: 64, offset: 320)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1584, file: !1583, line: 42, baseType: !900, size: 32, align: 32, offset: 384)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !1584, file: !1583, line: 43, baseType: !900, size: 32, align: 32, offset: 416)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !1584, file: !1583, line: 44, baseType: !1603, size: 64, align: 64, offset: 448)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DISubroutineType(types: !1605)
!1605 = !{!900, !1011, !1606, !1222, !1222}
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1584, file: !1583, line: 47, baseType: !900, size: 32, align: 32, offset: 512)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1584, file: !1583, line: 48, baseType: !900, size: 32, align: 32, offset: 544)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1584, file: !1583, line: 49, baseType: !900, size: 32, align: 32, offset: 576)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1584, file: !1583, line: 50, baseType: !900, size: 32, align: 32, offset: 608)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1584, file: !1583, line: 51, baseType: !1011, size: 64, align: 64, offset: 640)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "service_type", scope: !1584, file: !1583, line: 52, baseType: !900, size: 32, align: 32, offset: 704)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_size", scope: !1584, file: !1583, line: 54, baseType: !900, size: 32, align: 32, offset: 736)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1584, file: !1583, line: 55, baseType: !1011, size: 64, align: 64, offset: 768)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "need_next_header", scope: !1584, file: !1583, line: 57, baseType: !900, size: 32, align: 32, offset: 832)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1584, file: !1583, line: 58, baseType: !34, size: 32, align: 32, offset: 864)
!1617 = !DILocation(line: 33, column: 25, scope: !896)
!1618 = !DILocation(line: 33, column: 29, scope: !896)
!1619 = !DILocation(line: 33, column: 33, scope: !896)
!1620 = !DILocalVariable(name: "pc", scope: !896, file: !897, line: 34, type: !1621)
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1622 = !DILocation(line: 34, column: 19, scope: !896)
!1623 = !DILocation(line: 34, column: 25, scope: !896)
!1624 = !DILocation(line: 34, column: 28, scope: !896)
!1625 = !DILocalVariable(name: "len", scope: !896, file: !897, line: 35, type: !900)
!1626 = !DILocation(line: 35, column: 9, scope: !896)
!1627 = !DILocalVariable(name: "i", scope: !896, file: !897, line: 35, type: !900)
!1628 = !DILocation(line: 35, column: 14, scope: !896)
!1629 = !DILocalVariable(name: "new_frame_start", scope: !896, file: !897, line: 36, type: !900)
!1630 = !DILocation(line: 36, column: 9, scope: !896)
!1631 = !DILocalVariable(name: "got_frame", scope: !896, file: !897, line: 37, type: !900)
!1632 = !DILocation(line: 37, column: 9, scope: !896)
!1633 = !DILocation(line: 37, column: 5, scope: !896)
!1634 = !DILocation(line: 40, column: 6, scope: !896)
!1635 = !DILocation(line: 41, column: 8, scope: !1636)
!1636 = distinct !DILexicalBlock(scope: !896, file: !897, line: 41, column: 8)
!1637 = !DILocation(line: 41, column: 11, scope: !1636)
!1638 = !DILocation(line: 41, column: 29, scope: !1636)
!1639 = !DILocation(line: 41, column: 26, scope: !1636)
!1640 = !DILocation(line: 41, column: 8, scope: !896)
!1641 = !DILocation(line: 42, column: 12, scope: !1642)
!1642 = distinct !DILexicalBlock(scope: !1643, file: !897, line: 42, column: 12)
!1643 = distinct !DILexicalBlock(scope: !1636, file: !897, line: 41, column: 38)
!1644 = !DILocation(line: 42, column: 15, scope: !1642)
!1645 = !DILocation(line: 42, column: 30, scope: !1642)
!1646 = !DILocation(line: 42, column: 34, scope: !1647)
!1647 = !DILexicalBlockFile(scope: !1642, file: !897, discriminator: 1)
!1648 = !DILocation(line: 42, column: 37, scope: !1647)
!1649 = !DILocation(line: 42, column: 12, scope: !1647)
!1650 = !DILocation(line: 43, column: 16, scope: !1651)
!1651 = distinct !DILexicalBlock(scope: !1642, file: !897, line: 42, column: 54)
!1652 = !DILocation(line: 43, column: 19, scope: !1651)
!1653 = !DILocation(line: 43, column: 14, scope: !1651)
!1654 = !DILocation(line: 44, column: 13, scope: !1651)
!1655 = !DILocation(line: 44, column: 16, scope: !1651)
!1656 = !DILocation(line: 44, column: 31, scope: !1651)
!1657 = !DILocation(line: 45, column: 9, scope: !1651)
!1658 = !DILocation(line: 46, column: 16, scope: !1659)
!1659 = distinct !DILexicalBlock(scope: !1642, file: !897, line: 45, column: 14)
!1660 = !DILocation(line: 47, column: 19, scope: !1661)
!1661 = distinct !DILexicalBlock(scope: !1659, file: !897, line: 47, column: 13)
!1662 = !DILocation(line: 47, column: 22, scope: !1661)
!1663 = !DILocation(line: 47, column: 18, scope: !1661)
!1664 = !DILocation(line: 47, column: 17, scope: !1661)
!1665 = !DILocation(line: 47, column: 38, scope: !1666)
!1666 = !DILexicalBlockFile(scope: !1667, file: !897, discriminator: 1)
!1667 = distinct !DILexicalBlock(scope: !1661, file: !897, line: 47, column: 13)
!1668 = !DILocation(line: 47, column: 40, scope: !1666)
!1669 = !DILocation(line: 47, column: 39, scope: !1666)
!1670 = !DILocation(line: 47, column: 13, scope: !1666)
!1671 = !DILocation(line: 48, column: 29, scope: !1672)
!1672 = distinct !DILexicalBlock(scope: !1667, file: !897, line: 47, column: 54)
!1673 = !DILocation(line: 48, column: 32, scope: !1672)
!1674 = !DILocation(line: 48, column: 37, scope: !1672)
!1675 = !DILocation(line: 48, column: 48, scope: !1672)
!1676 = !DILocation(line: 48, column: 44, scope: !1672)
!1677 = !DILocation(line: 48, column: 42, scope: !1672)
!1678 = !DILocation(line: 48, column: 17, scope: !1672)
