; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mpeg4audio.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mpeg4audio.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MPEG4AudioConfig = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.GetBitContext = type { i8*, i8*, i32, i32, i32 }
%union.unaligned_32 = type { i32 }

@avpriv_mpeg4audio_sample_rates = constant [16 x i32] [i32 96000, i32 88200, i32 64000, i32 48000, i32 44100, i32 32000, i32 24000, i32 22050, i32 16000, i32 12000, i32 11025, i32 8000, i32 7350, i32 0, i32 0, i32 0], align 16
@ff_mpeg4audio_channels = constant [8 x i8] c"\00\01\02\03\04\05\06\08", align 1
@.str = private unnamed_addr constant [24 x i8] c"Invalid sample rate %d\0A\00", align 1

; Function Attrs: nounwind uwtable
define i32 @ff_mpeg4audio_get_config_gb(%struct.MPEG4AudioConfig* %c, %struct.GetBitContext* %gb, i32 %sync_extension) #0 !dbg !78 {
entry:
  %retval = alloca i32, align 4
  %c.addr = alloca %struct.MPEG4AudioConfig*, align 8
  %gb.addr = alloca %struct.GetBitContext*, align 8
  %sync_extension.addr = alloca i32, align 4
  %specific_config_bitindex = alloca i32, align 4
  %ret = alloca i32, align 4
  %start_bit_index = alloca i32, align 4
  store %struct.MPEG4AudioConfig* %c, %struct.MPEG4AudioConfig** %c.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !49, globals: !63)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mpeg4audio.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AudioObjectType", file: !4, line: 72, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavcodec/mpeg4audio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!6 = !DIEnumerator(name: "AOT_NULL", value: 0)
!7 = !DIEnumerator(name: "AOT_AAC_MAIN", value: 1)
!8 = !DIEnumerator(name: "AOT_AAC_LC", value: 2)
!9 = !DIEnumerator(name: "AOT_AAC_SSR", value: 3)
!10 = !DIEnumerator(name: "AOT_AAC_LTP", value: 4)
!11 = !DIEnumerator(name: "AOT_SBR", value: 5)
!12 = !DIEnumerator(name: "AOT_AAC_SCALABLE", value: 6)
!13 = !DIEnumerator(name: "AOT_TWINVQ", value: 7)
!14 = !DIEnumerator(name: "AOT_CELP", value: 8)
!15 = !DIEnumerator(name: "AOT_HVXC", value: 9)
!16 = !DIEnumerator(name: "AOT_TTSI", value: 12)
!17 = !DIEnumerator(name: "AOT_MAINSYNTH", value: 13)
!18 = !DIEnumerator(name: "AOT_WAVESYNTH", value: 14)
!19 = !DIEnumerator(name: "AOT_MIDI", value: 15)
!20 = !DIEnumerator(name: "AOT_SAFX", value: 16)
!21 = !DIEnumerator(name: "AOT_ER_AAC_LC", value: 17)
!22 = !DIEnumerator(name: "AOT_ER_AAC_LTP", value: 19)
!23 = !DIEnumerator(name: "AOT_ER_AAC_SCALABLE", value: 20)
!24 = !DIEnumerator(name: "AOT_ER_TWINVQ", value: 21)
!25 = !DIEnumerator(name: "AOT_ER_BSAC", value: 22)
!26 = !DIEnumerator(name: "AOT_ER_AAC_LD", value: 23)
!27 = !DIEnumerator(name: "AOT_ER_CELP", value: 24)
!28 = !DIEnumerator(name: "AOT_ER_HVXC", value: 25)
!29 = !DIEnumerator(name: "AOT_ER_HILN", value: 26)
!30 = !DIEnumerator(name: "AOT_ER_PARAM", value: 27)
!31 = !DIEnumerator(name: "AOT_SSC", value: 28)
!32 = !DIEnumerator(name: "AOT_PS", value: 29)
!33 = !DIEnumerator(name: "AOT_SURROUND", value: 30)
!34 = !DIEnumerator(name: "AOT_ESCAPE", value: 31)
!35 = !DIEnumerator(name: "AOT_L1", value: 32)
!36 = !DIEnumerator(name: "AOT_L2", value: 33)
!37 = !DIEnumerator(name: "AOT_L3", value: 34)
!38 = !DIEnumerator(name: "AOT_DST", value: 35)
!39 = !DIEnumerator(name: "AOT_ALS", value: 36)
!40 = !DIEnumerator(name: "AOT_SLS", value: 37)
!41 = !DIEnumerator(name: "AOT_SLS_NON_CORE", value: 38)
!42 = !DIEnumerator(name: "AOT_ER_AAC_ELD", value: 39)
!43 = !DIEnumerator(name: "AOT_SMR_SIMPLE", value: 40)
!44 = !DIEnumerator(name: "AOT_SMR_MAIN", value: 41)
!45 = !DIEnumerator(name: "AOT_USAC_NOSBR", value: 42)
!46 = !DIEnumerator(name: "AOT_SAOC", value: 43)
!47 = !DIEnumerator(name: "AOT_LD_SURROUND", value: 44)
!48 = !DIEnumerator(name: "AOT_USAC", value: 45)
!49 = !{!50, !51, !52, !60, !62}
!50 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !55, line: 221, size: 32, align: 8, elements: !56)
!55 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!56 = !{!57}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !54, file: !55, line: 221, baseType: !58, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !59, line: 51, baseType: !50)
!59 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !59, line: 48, baseType: !61)
!61 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!63 = !{!64, !70}
!64 = distinct !DIGlobalVariable(name: "avpriv_mpeg4audio_sample_rates", scope: !0, file: !65, line: 62, type: !66, isLocal: false, isDefinition: true, variable: [16 x i32]* @avpriv_mpeg4audio_sample_rates)
!65 = !DIFile(filename: "libavcodec/mpeg4audio.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 512, align: 32, elements: !68)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!68 = !{!69}
!69 = !DISubrange(count: 16)
!70 = distinct !DIGlobalVariable(name: "ff_mpeg4audio_channels", scope: !0, file: !65, line: 67, type: !71, isLocal: false, isDefinition: true, variable: [8 x i8]* @ff_mpeg4audio_channels)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 64, align: 8, elements: !73)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!73 = !{!74}
!74 = !DISubrange(count: 8)
!75 = !{i32 2, !"Dwarf Version", i32 4}
!76 = !{i32 2, !"Debug Info Version", i32 3}
!77 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!78 = distinct !DISubprogram(name: "ff_mpeg4audio_get_config_gb", scope: !65, file: !65, line: 86, type: !79, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!79 = !DISubroutineType(types: !80)
!80 = !{!51, !81, !97, !51}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPEG4AudioConfig", file: !4, line: 46, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPEG4AudioConfig", file: !4, line: 33, size: 384, align: 32, elements: !84)
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !83, file: !4, line: 34, baseType: !51, size: 32, align: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_index", scope: !83, file: !4, line: 35, baseType: !51, size: 32, align: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !83, file: !4, line: 36, baseType: !51, size: 32, align: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "chan_config", scope: !83, file: !4, line: 37, baseType: !51, size: 32, align: 32, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "sbr", scope: !83, file: !4, line: 38, baseType: !51, size: 32, align: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ext_object_type", scope: !83, file: !4, line: 39, baseType: !51, size: 32, align: 32, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ext_sampling_index", scope: !83, file: !4, line: 40, baseType: !51, size: 32, align: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ext_sample_rate", scope: !83, file: !4, line: 41, baseType: !51, size: 32, align: 32, offset: 224)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ext_chan_config", scope: !83, file: !4, line: 42, baseType: !51, size: 32, align: 32, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !83, file: !4, line: 43, baseType: !51, size: 32, align: 32, offset: 288)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ps", scope: !83, file: !4, line: 44, baseType: !51, size: 32, align: 32, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "frame_length_short", scope: !83, file: !4, line: 45, baseType: !51, size: 32, align: 32, offset: 352)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !99, line: 70, baseType: !100)
!99 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !99, line: 61, size: 256, align: 64, elements: !101)
!101 = !{!102, !104, !105, !106, !107}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !100, file: !99, line: 62, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !100, file: !99, line: 62, baseType: !103, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !100, file: !99, line: 67, baseType: !51, size: 32, align: 32, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !100, file: !99, line: 68, baseType: !51, size: 32, align: 32, offset: 160)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !100, file: !99, line: 69, baseType: !51, size: 32, align: 32, offset: 192)
!108 = !{}
!109 = !DILocalVariable(name: "c", arg: 1, scope: !78, file: !65, line: 86, type: !81)
!110 = !DIExpression()
!111 = !DILocation(line: 86, column: 51, scope: !78)
!112 = !DILocalVariable(name: "gb", arg: 2, scope: !78, file: !65, line: 86, type: !97)
!113 = !DILocation(line: 86, column: 69, scope: !78)
!114 = !DILocalVariable(name: "sync_extension", arg: 3, scope: !78, file: !65, line: 87, type: !51)
!115 = !DILocation(line: 87, column: 37, scope: !78)
!116 = !DILocalVariable(name: "specific_config_bitindex", scope: !78, file: !65, line: 89, type: !51)
!117 = !DILocation(line: 89, column: 9, scope: !78)
!118 = !DILocalVariable(name: "ret", scope: !78, file: !65, line: 89, type: !51)
!119 = !DILocation(line: 89, column: 35, scope: !78)
!120 = !DILocalVariable(name: "start_bit_index", scope: !78, file: !65, line: 90, type: !51)
!121 = !DILocation(line: 90, column: 9, scope: !78)
!122 = !DILocation(line: 90, column: 42, scope: !78)
!123 = !DILocation(line: 90, column: 27, scope: !78)
!124 = !DILocation(line: 91, column: 38, scope: !78)
!125 = !DILocation(line: 91, column: 22, scope: !78)
!126 = !DILocation(line: 91, column: 5, scope: !78)
!127 = !DILocation(line: 91, column: 8, scope: !78)
!128 = !DILocation(line: 91, column: 20, scope: !78)
!129 = !DILocation(line: 92, column: 38, scope: !78)
!130 = !DILocation(line: 92, column: 43, scope: !78)
!131 = !DILocation(line: 92, column: 46, scope: !78)
!132 = !DILocation(line: 92, column: 22, scope: !78)
!133 = !DILocation(line: 92, column: 5, scope: !78)
!134 = !DILocation(line: 92, column: 8, scope: !78)
!135 = !DILocation(line: 92, column: 20, scope: !78)
!136 = !DILocation(line: 93, column: 31, scope: !78)
!137 = !DILocation(line: 93, column: 22, scope: !78)
!138 = !DILocation(line: 93, column: 5, scope: !78)
!139 = !DILocation(line: 93, column: 8, scope: !78)
!140 = !DILocation(line: 93, column: 20, scope: !78)
!141 = !DILocation(line: 94, column: 9, scope: !142)
!142 = distinct !DILexicalBlock(scope: !78, file: !65, line: 94, column: 9)
!143 = !DILocation(line: 94, column: 12, scope: !142)
!144 = !DILocation(line: 94, column: 24, scope: !142)
!145 = !DILocation(line: 94, column: 9, scope: !78)
!146 = !DILocation(line: 95, column: 46, scope: !142)
!147 = !DILocation(line: 95, column: 49, scope: !142)
!148 = !DILocation(line: 95, column: 23, scope: !142)
!149 = !DILocation(line: 95, column: 9, scope: !142)
!150 = !DILocation(line: 95, column: 12, scope: !142)
!151 = !DILocation(line: 95, column: 21, scope: !142)
!152 = !DILocation(line: 96, column: 5, scope: !78)
!153 = !DILocation(line: 96, column: 8, scope: !78)
!154 = !DILocation(line: 96, column: 12, scope: !78)
!155 = !DILocation(line: 97, column: 5, scope: !78)
!156 = !DILocation(line: 97, column: 8, scope: !78)
!157 = !DILocation(line: 97, column: 11, scope: !78)
!158 = !DILocation(line: 98, column: 9, scope: !159)
!159 = distinct !DILexicalBlock(scope: !78, file: !65, line: 98, column: 9)
!160 = !DILocation(line: 98, column: 12, scope: !159)
!161 = !DILocation(line: 98, column: 24, scope: !159)
!162 = !DILocation(line: 98, column: 35, scope: !159)
!163 = !DILocation(line: 98, column: 39, scope: !164)
!164 = !DILexicalBlockFile(scope: !159, file: !65, discriminator: 1)
!165 = !DILocation(line: 98, column: 42, scope: !164)
!166 = !DILocation(line: 98, column: 54, scope: !164)
!167 = !DILocation(line: 98, column: 64, scope: !164)
!168 = !DILocation(line: 100, column: 21, scope: !159)
!169 = !DILocation(line: 100, column: 11, scope: !159)
!170 = !DILocation(line: 100, column: 28, scope: !159)
!171 = !DILocation(line: 100, column: 35, scope: !159)
!172 = !DILocation(line: 100, column: 50, scope: !164)
!173 = !DILocation(line: 100, column: 40, scope: !164)
!174 = !DILocation(line: 100, column: 57, scope: !164)
!175 = !DILocation(line: 98, column: 9, scope: !176)
