; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--nuv.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--nuv.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProbeData = type { i8*, i8*, i32, i8* }

!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !917, line: 42, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "libavformat/nuv.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!918 = !{!919, !920, !921, !922, !923}
!919 = !DIEnumerator(name: "NUV_VIDEO", value: 86)
!920 = !DIEnumerator(name: "NUV_EXTRADATA", value: 68)
!921 = !DIEnumerator(name: "NUV_AUDIO", value: 65)
!922 = !DIEnumerator(name: "NUV_SEEKP", value: 82)
!923 = !DIEnumerator(name: "NUV_MYTHEXT", value: 88)
!924 = !{!925, !926, !927, !935}
!925 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!926 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!928 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !930, line: 221, size: 32, align: 8, elements: !931)
!930 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!931 = !{!932}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !929, file: !930, line: 221, baseType: !933, size: 32, align: 32)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !934, line: 51, baseType: !926)
!934 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !934, line: 40, baseType: !936)
!936 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!937 = !{!938, !2150}
!938 = distinct !DIGlobalVariable(name: "ff_nuv_demuxer", scope: !0, file: !917, line: 398, type: !939, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_nuv_demuxer)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !897, line: 777, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !941)
!941 = !{!942, !946, !947, !948, !949, !959, !1001, !1002, !1004, !1005, !1006, !1020, !2131, !2132, !2133, !2137, !2141, !2142, !2143, !2147, !2148, !2149}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !940, file: !897, line: 638, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !940, file: !897, line: 645, baseType: !943, size: 64, align: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !940, file: !897, line: 652, baseType: !925, size: 32, align: 32, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !940, file: !897, line: 659, baseType: !943, size: 64, align: 64, offset: 192)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !940, file: !897, line: 661, baseType: !950, size: 64, align: 64, offset: 256)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !955, line: 44, size: 64, align: 32, elements: !956)
!955 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!956 = !{!957, !958}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !954, file: !955, line: 45, baseType: !3, size: 32, align: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !954, file: !955, line: 46, baseType: !926, size: 32, align: 32, offset: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !940, file: !897, line: 663, baseType: !960, size: 64, align: 64, offset: 320)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !964)
!964 = !{!965, !966, !971, !975, !976, !977, !978, !982, !988, !990, !994}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !963, file: !464, line: 72, baseType: !943, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !963, file: !464, line: 78, baseType: !967, size: 64, align: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!943, !970}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !963, file: !464, line: 85, baseType: !972, size: 64, align: 64, offset: 128)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !963, file: !464, line: 93, baseType: !925, size: 32, align: 32, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !963, file: !464, line: 99, baseType: !925, size: 32, align: 32, offset: 224)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !963, file: !464, line: 108, baseType: !925, size: 32, align: 32, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !963, file: !464, line: 113, baseType: !979, size: 64, align: 64, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!970, !970, !970}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !963, file: !464, line: 123, baseType: !983, size: 64, align: 64, offset: 384)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!986, !986}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !963, file: !464, line: 130, baseType: !989, size: 32, align: 32, offset: 448)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !963, file: !464, line: 136, baseType: !991, size: 64, align: 64, offset: 512)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!989, !970}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !963, file: !464, line: 142, baseType: !995, size: 64, align: 64, offset: 576)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!925, !998, !970, !943, !925}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !940, file: !897, line: 670, baseType: !943, size: 64, align: 64, offset: 384)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !940, file: !897, line: 679, baseType: !1003, size: 64, align: 64, offset: 448)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !940, file: !897, line: 684, baseType: !925, size: 32, align: 32, offset: 512)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !940, file: !897, line: 689, baseType: !925, size: 32, align: 32, offset: 544)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !940, file: !897, line: 696, baseType: !1007, size: 64, align: 64, offset: 576)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!925, !1010}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1012)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1013)
!1013 = !{!1014, !1015, !1018, !1019}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1012, file: !897, line: 449, baseType: !943, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1012, file: !897, line: 450, baseType: !1016, size: 64, align: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1012, file: !897, line: 451, baseType: !925, size: 32, align: 32, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1012, file: !897, line: 452, baseType: !943, size: 64, align: 64, offset: 192)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !940, file: !897, line: 703, baseType: !1021, size: 64, align: 64, offset: 640)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!925, !1024}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1227, !1228, !1293, !1294, !1295, !1988, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2042, !2043, !2044, !2045, !2046, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2097, !2098, !2101, !2102, !2103, !2104, !2105, !2106, !2108, !2109, !2110, !2111, !2119, !2120, !2124, !2128, !2129, !2130}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1025, file: !897, line: 1342, baseType: !960, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1025, file: !897, line: 1349, baseType: !1003, size: 64, align: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1025, file: !897, line: 1356, baseType: !1030, size: 64, align: 64, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1086, !1087, !1091, !1095, !1100, !1107, !1202, !1208, !1214, !1215, !1216, !1217, !1221}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1031, file: !897, line: 498, baseType: !943, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1031, file: !897, line: 504, baseType: !943, size: 64, align: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1031, file: !897, line: 505, baseType: !943, size: 64, align: 64, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1031, file: !897, line: 506, baseType: !943, size: 64, align: 64, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1031, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1031, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1031, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1031, file: !897, line: 517, baseType: !925, size: 32, align: 32, offset: 352)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1031, file: !897, line: 523, baseType: !950, size: 64, align: 64, offset: 384)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1031, file: !897, line: 526, baseType: !960, size: 64, align: 64, offset: 448)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1031, file: !897, line: 535, baseType: !1030, size: 64, align: 64, offset: 512)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1031, file: !897, line: 539, baseType: !925, size: 32, align: 32, offset: 576)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1031, file: !897, line: 541, baseType: !1021, size: 64, align: 64, offset: 640)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1031, file: !897, line: 549, baseType: !1047, size: 64, align: 64, offset: 704)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!925, !1024, !1050}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1053)
!1053 = !{!1054, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1082, !1083, !1084, !1085}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1052, file: !4, line: 1451, baseType: !1055, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1057, line: 94, baseType: !1058)
!1057 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1057, line: 81, size: 192, align: 64, elements: !1059)
!1059 = !{!1060, !1064, !1067}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1058, file: !1057, line: 82, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1057, line: 73, baseType: !1063)
!1063 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1057, line: 73, flags: DIFlagFwdDecl)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1058, file: !1057, line: 89, baseType: !1065, size: 64, align: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !934, line: 48, baseType: !1017)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1058, file: !1057, line: 93, baseType: !925, size: 32, align: 32, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1052, file: !4, line: 1461, baseType: !935, size: 64, align: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1052, file: !4, line: 1467, baseType: !935, size: 64, align: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1052, file: !4, line: 1468, baseType: !1065, size: 64, align: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1052, file: !4, line: 1469, baseType: !925, size: 32, align: 32, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1052, file: !4, line: 1470, baseType: !925, size: 32, align: 32, offset: 288)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1052, file: !4, line: 1474, baseType: !925, size: 32, align: 32, offset: 320)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1052, file: !4, line: 1479, baseType: !1075, size: 64, align: 64, offset: 384)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1077)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1078)
!1078 = !{!1079, !1080, !1081}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1077, file: !4, line: 1412, baseType: !1065, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1077, file: !4, line: 1413, baseType: !925, size: 32, align: 32, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1077, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1052, file: !4, line: 1480, baseType: !925, size: 32, align: 32, offset: 448)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1052, file: !4, line: 1486, baseType: !935, size: 64, align: 64, offset: 512)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1052, file: !4, line: 1488, baseType: !935, size: 64, align: 64, offset: 576)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1052, file: !4, line: 1497, baseType: !935, size: 64, align: 64, offset: 640)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1031, file: !897, line: 550, baseType: !1021, size: 64, align: 64, offset: 768)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1031, file: !897, line: 554, baseType: !1088, size: 64, align: 64, offset: 832)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!925, !1024, !1050, !1050, !925}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1031, file: !897, line: 563, baseType: !1092, size: 64, align: 64, offset: 896)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!925, !3, !925}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1031, file: !897, line: 565, baseType: !1096, size: 64, align: 64, offset: 960)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{null, !1024, !925, !1099, !1099}
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1031, file: !897, line: 570, baseType: !1101, size: 64, align: 64, offset: 1024)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!925, !1024, !925, !970, !1104}
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1105, line: 216, baseType: !1106)
!1105 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1106 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1031, file: !897, line: 581, baseType: !1108, size: 64, align: 64, offset: 1088)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!925, !1024, !925, !1111, !926}
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1115)
!1115 = !{!1116, !1120, !1122, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1156, !1158, !1159, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1114, file: !526, line: 282, baseType: !1117, size: 512, align: 64)
!1117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 512, align: 64, elements: !1118)
!1118 = !{!1119}
!1119 = !DISubrange(count: 8)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1114, file: !526, line: 299, baseType: !1121, size: 256, align: 32, offset: 512)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 256, align: 32, elements: !1118)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1114, file: !526, line: 315, baseType: !1123, size: 64, align: 64, offset: 768)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1114, file: !526, line: 326, baseType: !925, size: 32, align: 32, offset: 832)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1114, file: !526, line: 326, baseType: !925, size: 32, align: 32, offset: 864)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1114, file: !526, line: 334, baseType: !925, size: 32, align: 32, offset: 896)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1114, file: !526, line: 341, baseType: !925, size: 32, align: 32, offset: 928)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1114, file: !526, line: 346, baseType: !925, size: 32, align: 32, offset: 960)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1114, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1114, file: !526, line: 356, baseType: !1131, size: 64, align: 32, offset: 1024)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1132, line: 61, baseType: !1133)
!1132 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1132, line: 58, size: 64, align: 32, elements: !1134)
!1134 = !{!1135, !1136}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1133, file: !1132, line: 59, baseType: !925, size: 32, align: 32)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1133, file: !1132, line: 60, baseType: !925, size: 32, align: 32, offset: 32)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1114, file: !526, line: 361, baseType: !935, size: 64, align: 64, offset: 1088)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1114, file: !526, line: 369, baseType: !935, size: 64, align: 64, offset: 1152)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1114, file: !526, line: 377, baseType: !935, size: 64, align: 64, offset: 1216)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1114, file: !526, line: 382, baseType: !925, size: 32, align: 32, offset: 1280)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1114, file: !526, line: 386, baseType: !925, size: 32, align: 32, offset: 1312)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1114, file: !526, line: 391, baseType: !925, size: 32, align: 32, offset: 1344)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1114, file: !526, line: 396, baseType: !970, size: 64, align: 64, offset: 1408)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1114, file: !526, line: 403, baseType: !1145, size: 512, align: 64, offset: 1472)
!1145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1146, size: 512, align: 64, elements: !1118)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !934, line: 55, baseType: !1106)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1114, file: !526, line: 410, baseType: !925, size: 32, align: 32, offset: 1984)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1114, file: !526, line: 415, baseType: !925, size: 32, align: 32, offset: 2016)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1114, file: !526, line: 420, baseType: !925, size: 32, align: 32, offset: 2048)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1114, file: !526, line: 425, baseType: !925, size: 32, align: 32, offset: 2080)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1114, file: !526, line: 435, baseType: !935, size: 64, align: 64, offset: 2112)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1114, file: !526, line: 440, baseType: !925, size: 32, align: 32, offset: 2176)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1114, file: !526, line: 445, baseType: !1146, size: 64, align: 64, offset: 2240)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1114, file: !526, line: 459, baseType: !1155, size: 512, align: 64, offset: 2304)
!1155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 512, align: 64, elements: !1118)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1114, file: !526, line: 473, baseType: !1157, size: 64, align: 64, offset: 2816)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1114, file: !526, line: 477, baseType: !925, size: 32, align: 32, offset: 2880)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1114, file: !526, line: 479, baseType: !1160, size: 64, align: 64, offset: 2944)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1163)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1164)
!1164 = !{!1165, !1166, !1167, !1168, !1173}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1163, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1163, file: !526, line: 203, baseType: !1065, size: 64, align: 64, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1163, file: !526, line: 204, baseType: !925, size: 32, align: 32, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1163, file: !526, line: 205, baseType: !1169, size: 64, align: 64, offset: 192)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1171, line: 86, baseType: !1172)
!1171 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1172 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1171, line: 86, flags: DIFlagFwdDecl)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1163, file: !526, line: 206, baseType: !1055, size: 64, align: 64, offset: 256)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1114, file: !526, line: 480, baseType: !925, size: 32, align: 32, offset: 3008)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1114, file: !526, line: 505, baseType: !925, size: 32, align: 32, offset: 3040)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1114, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1114, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1114, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1114, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1114, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1114, file: !526, line: 532, baseType: !935, size: 64, align: 64, offset: 3264)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1114, file: !526, line: 539, baseType: !935, size: 64, align: 64, offset: 3328)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1114, file: !526, line: 547, baseType: !935, size: 64, align: 64, offset: 3392)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1114, file: !526, line: 554, baseType: !1169, size: 64, align: 64, offset: 3456)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1114, file: !526, line: 563, baseType: !925, size: 32, align: 32, offset: 3520)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1114, file: !526, line: 572, baseType: !925, size: 32, align: 32, offset: 3552)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1114, file: !526, line: 581, baseType: !925, size: 32, align: 32, offset: 3584)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1114, file: !526, line: 588, baseType: !1189, size: 64, align: 64, offset: 3648)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !934, line: 36, baseType: !1191)
!1191 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1114, file: !526, line: 593, baseType: !925, size: 32, align: 32, offset: 3712)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1114, file: !526, line: 596, baseType: !925, size: 32, align: 32, offset: 3744)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1114, file: !526, line: 599, baseType: !1055, size: 64, align: 64, offset: 3776)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1114, file: !526, line: 605, baseType: !1055, size: 64, align: 64, offset: 3840)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1114, file: !526, line: 616, baseType: !1055, size: 64, align: 64, offset: 3904)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1114, file: !526, line: 626, baseType: !1104, size: 64, align: 64, offset: 3968)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1114, file: !526, line: 627, baseType: !1104, size: 64, align: 64, offset: 4032)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1114, file: !526, line: 628, baseType: !1104, size: 64, align: 64, offset: 4096)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1114, file: !526, line: 629, baseType: !1104, size: 64, align: 64, offset: 4160)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1114, file: !526, line: 645, baseType: !1055, size: 64, align: 64, offset: 4224)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1031, file: !897, line: 587, baseType: !1203, size: 64, align: 64, offset: 1152)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!925, !1024, !1206}
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1031, file: !897, line: 592, baseType: !1209, size: 64, align: 64, offset: 1216)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!925, !1024, !1212}
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1031, file: !897, line: 597, baseType: !1209, size: 64, align: 64, offset: 1280)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1031, file: !897, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1031, file: !897, line: 608, baseType: !1021, size: 64, align: 64, offset: 1408)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1031, file: !897, line: 617, baseType: !1218, size: 64, align: 64, offset: 1472)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{null, !1024}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1031, file: !897, line: 623, baseType: !1222, size: 64, align: 64, offset: 1536)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!925, !1024, !1225}
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1051)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1025, file: !897, line: 1365, baseType: !970, size: 64, align: 64, offset: 192)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1025, file: !897, line: 1379, baseType: !1229, size: 64, align: 64, offset: 256)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1231)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1232)
!1232 = !{!1233, !1234, !1235, !1236, !1237, !1238, !1239, !1243, !1244, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1260, !1261, !1265, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1283, !1284, !1285, !1286, !1290, !1291, !1292}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1231, file: !628, line: 174, baseType: !960, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1231, file: !628, line: 226, baseType: !1016, size: 64, align: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1231, file: !628, line: 227, baseType: !925, size: 32, align: 32, offset: 128)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1231, file: !628, line: 228, baseType: !1016, size: 64, align: 64, offset: 192)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1231, file: !628, line: 229, baseType: !1016, size: 64, align: 64, offset: 256)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1231, file: !628, line: 233, baseType: !970, size: 64, align: 64, offset: 320)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1231, file: !628, line: 235, baseType: !1240, size: 64, align: 64, offset: 384)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!925, !970, !1065, !925}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1231, file: !628, line: 236, baseType: !1240, size: 64, align: 64, offset: 448)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1231, file: !628, line: 237, baseType: !1245, size: 64, align: 64, offset: 512)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!935, !970, !935, !925}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1231, file: !628, line: 238, baseType: !935, size: 64, align: 64, offset: 576)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1231, file: !628, line: 239, baseType: !925, size: 32, align: 32, offset: 640)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1231, file: !628, line: 240, baseType: !925, size: 32, align: 32, offset: 672)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1231, file: !628, line: 241, baseType: !925, size: 32, align: 32, offset: 704)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1231, file: !628, line: 242, baseType: !1106, size: 64, align: 64, offset: 768)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1231, file: !628, line: 243, baseType: !1016, size: 64, align: 64, offset: 832)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1231, file: !628, line: 244, baseType: !1255, size: 64, align: 64, offset: 896)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!1106, !1106, !1258, !926}
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1066)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1231, file: !628, line: 245, baseType: !925, size: 32, align: 32, offset: 960)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1231, file: !628, line: 249, baseType: !1262, size: 64, align: 64, offset: 1024)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!925, !970, !925}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1231, file: !628, line: 255, baseType: !1266, size: 64, align: 64, offset: 1088)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!935, !970, !925, !935, !925}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1231, file: !628, line: 260, baseType: !925, size: 32, align: 32, offset: 1152)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1231, file: !628, line: 266, baseType: !935, size: 64, align: 64, offset: 1216)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1231, file: !628, line: 273, baseType: !925, size: 32, align: 32, offset: 1280)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1231, file: !628, line: 279, baseType: !935, size: 64, align: 64, offset: 1344)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1231, file: !628, line: 285, baseType: !925, size: 32, align: 32, offset: 1408)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1231, file: !628, line: 291, baseType: !925, size: 32, align: 32, offset: 1440)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1231, file: !628, line: 298, baseType: !925, size: 32, align: 32, offset: 1472)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1231, file: !628, line: 304, baseType: !925, size: 32, align: 32, offset: 1504)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1231, file: !628, line: 309, baseType: !943, size: 64, align: 64, offset: 1536)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1231, file: !628, line: 314, baseType: !943, size: 64, align: 64, offset: 1600)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1231, file: !628, line: 319, baseType: !1280, size: 64, align: 64, offset: 1664)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!925, !970, !1065, !925, !627, !935}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1231, file: !628, line: 326, baseType: !925, size: 32, align: 32, offset: 1728)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1231, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1231, file: !628, line: 332, baseType: !935, size: 64, align: 64, offset: 1792)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1231, file: !628, line: 338, baseType: !1287, size: 64, align: 64, offset: 1856)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{!925, !970}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1231, file: !628, line: 340, baseType: !935, size: 64, align: 64, offset: 1920)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1231, file: !628, line: 346, baseType: !1016, size: 64, align: 64, offset: 1984)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1231, file: !628, line: 351, baseType: !925, size: 32, align: 32, offset: 2048)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1025, file: !897, line: 1386, baseType: !925, size: 32, align: 32, offset: 320)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1025, file: !897, line: 1393, baseType: !926, size: 32, align: 32, offset: 352)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1025, file: !897, line: 1405, baseType: !1296, size: 64, align: 64, offset: 384)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1299)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1300)
!1300 = !{!1301, !1302, !1303, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1773, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1874, !1880, !1881, !1885, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1917, !1918, !1919, !1920, !1921, !1922}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1299, file: !897, line: 866, baseType: !925, size: 32, align: 32)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1299, file: !897, line: 872, baseType: !925, size: 32, align: 32, offset: 32)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1299, file: !897, line: 878, baseType: !1304, size: 64, align: 64, offset: 64)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1306)
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1307)
!1307 = !{!1308, !1309, !1310, !1311, !1448, !1449, !1450, !1451, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1477, !1481, !1482, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1661, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1306, file: !4, line: 1561, baseType: !960, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1306, file: !4, line: 1562, baseType: !925, size: 32, align: 32, offset: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1306, file: !4, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1306, file: !4, line: 1565, baseType: !1312, size: 64, align: 64, offset: 128)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1314)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1315)
!1315 = !{!1316, !1317, !1318, !1319, !1320, !1321, !1324, !1327, !1330, !1333, !1336, !1337, !1338, !1346, !1347, !1348, !1350, !1354, !1360, !1365, !1369, !1370, !1413, !1420, !1424, !1425, !1429, !1433, !1437, !1441, !1442, !1443}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1314, file: !4, line: 3475, baseType: !943, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1314, file: !4, line: 3480, baseType: !943, size: 64, align: 64, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1314, file: !4, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1314, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1314, file: !4, line: 3487, baseType: !925, size: 32, align: 32, offset: 192)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1314, file: !4, line: 3488, baseType: !1322, size: 64, align: 64, offset: 256)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1131)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1314, file: !4, line: 3489, baseType: !1325, size: 64, align: 64, offset: 320)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1314, file: !4, line: 3490, baseType: !1328, size: 64, align: 64, offset: 384)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1314, file: !4, line: 3491, baseType: !1331, size: 64, align: 64, offset: 448)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1314, file: !4, line: 3492, baseType: !1334, size: 64, align: 64, offset: 512)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1146)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1314, file: !4, line: 3493, baseType: !1066, size: 8, align: 8, offset: 576)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1314, file: !4, line: 3494, baseType: !960, size: 64, align: 64, offset: 640)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1314, file: !4, line: 3495, baseType: !1339, size: 64, align: 64, offset: 704)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1341)
!1341 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1342)
!1342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1343)
!1343 = !{!1344, !1345}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1342, file: !4, line: 3402, baseType: !925, size: 32, align: 32)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1342, file: !4, line: 3403, baseType: !943, size: 64, align: 64, offset: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1314, file: !4, line: 3507, baseType: !943, size: 64, align: 64, offset: 768)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1314, file: !4, line: 3516, baseType: !925, size: 32, align: 32, offset: 832)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1314, file: !4, line: 3517, baseType: !1349, size: 64, align: 64, offset: 896)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1314, file: !4, line: 3527, baseType: !1351, size: 64, align: 64, offset: 960)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{!925, !1304}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1314, file: !4, line: 3535, baseType: !1355, size: 64, align: 64, offset: 1024)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{!925, !1304, !1358}
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1305)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1314, file: !4, line: 3541, baseType: !1361, size: 64, align: 64, offset: 1088)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1363)
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1364)
!1364 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1314, file: !4, line: 3549, baseType: !1366, size: 64, align: 64, offset: 1152)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DISubroutineType(types: !1368)
!1368 = !{null, !1349}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1314, file: !4, line: 3551, baseType: !1351, size: 64, align: 64, offset: 1216)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1314, file: !4, line: 3552, baseType: !1371, size: 64, align: 64, offset: 1280)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DISubroutineType(types: !1373)
!1373 = !{!925, !1304, !1065, !925, !1374}
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1376)
!1376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1377)
!1377 = !{!1378, !1381, !1382, !1383, !1384, !1412}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1376, file: !4, line: 3921, baseType: !1379, size: 16, align: 16)
!1379 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !934, line: 49, baseType: !1380)
!1380 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1376, file: !4, line: 3922, baseType: !933, size: 32, align: 32, offset: 32)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1376, file: !4, line: 3923, baseType: !933, size: 32, align: 32, offset: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1376, file: !4, line: 3924, baseType: !926, size: 32, align: 32, offset: 96)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1376, file: !4, line: 3925, baseType: !1385, size: 64, align: 64, offset: 128)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1388)
!1388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1389)
!1389 = !{!1390, !1391, !1392, !1393, !1394, !1395, !1401, !1405, !1407, !1408, !1410, !1411}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1388, file: !4, line: 3886, baseType: !925, size: 32, align: 32)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1388, file: !4, line: 3887, baseType: !925, size: 32, align: 32, offset: 32)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1388, file: !4, line: 3888, baseType: !925, size: 32, align: 32, offset: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1388, file: !4, line: 3889, baseType: !925, size: 32, align: 32, offset: 96)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1388, file: !4, line: 3890, baseType: !925, size: 32, align: 32, offset: 128)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1388, file: !4, line: 3897, baseType: !1396, size: 768, align: 64, offset: 192)
!1396 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1397)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1398)
!1398 = !{!1399, !1400}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1397, file: !4, line: 3855, baseType: !1117, size: 512, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1397, file: !4, line: 3857, baseType: !1121, size: 256, align: 32, offset: 512)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1388, file: !4, line: 3903, baseType: !1402, size: 256, align: 64, offset: 960)
!1402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 256, align: 64, elements: !1403)
!1403 = !{!1404}
!1404 = !DISubrange(count: 4)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1388, file: !4, line: 3904, baseType: !1406, size: 128, align: 32, offset: 1216)
!1406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 128, align: 32, elements: !1403)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1388, file: !4, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1388, file: !4, line: 3908, baseType: !1409, size: 64, align: 64, offset: 1408)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1388, file: !4, line: 3915, baseType: !1409, size: 64, align: 64, offset: 1472)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1388, file: !4, line: 3917, baseType: !925, size: 32, align: 32, offset: 1536)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1376, file: !4, line: 3926, baseType: !935, size: 64, align: 64, offset: 192)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1314, file: !4, line: 3564, baseType: !1414, size: 64, align: 64, offset: 1344)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{!925, !1304, !1050, !1417, !1419}
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1113)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1314, file: !4, line: 3566, baseType: !1421, size: 64, align: 64, offset: 1408)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DISubroutineType(types: !1423)
!1423 = !{!925, !1304, !970, !1419, !1050}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1314, file: !4, line: 3567, baseType: !1351, size: 64, align: 64, offset: 1472)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1314, file: !4, line: 3576, baseType: !1426, size: 64, align: 64, offset: 1536)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DISubroutineType(types: !1428)
!1428 = !{!925, !1304, !1417}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1314, file: !4, line: 3577, baseType: !1430, size: 64, align: 64, offset: 1600)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DISubroutineType(types: !1432)
!1432 = !{!925, !1304, !1050}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1314, file: !4, line: 3584, baseType: !1434, size: 64, align: 64, offset: 1664)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DISubroutineType(types: !1436)
!1436 = !{!925, !1304, !1112}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1314, file: !4, line: 3589, baseType: !1438, size: 64, align: 64, offset: 1728)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DISubroutineType(types: !1440)
!1440 = !{null, !1304}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1314, file: !4, line: 3594, baseType: !925, size: 32, align: 32, offset: 1792)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1314, file: !4, line: 3600, baseType: !943, size: 64, align: 64, offset: 1856)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1314, file: !4, line: 3609, baseType: !1444, size: 64, align: 64, offset: 1920)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1447)
!1447 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1306, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1306, file: !4, line: 1581, baseType: !926, size: 32, align: 32, offset: 224)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1306, file: !4, line: 1583, baseType: !970, size: 64, align: 64, offset: 256)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1306, file: !4, line: 1591, baseType: !1452, size: 64, align: 64, offset: 320)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1306, file: !4, line: 1598, baseType: !970, size: 64, align: 64, offset: 384)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1306, file: !4, line: 1606, baseType: !935, size: 64, align: 64, offset: 448)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1306, file: !4, line: 1614, baseType: !925, size: 32, align: 32, offset: 512)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1306, file: !4, line: 1622, baseType: !925, size: 32, align: 32, offset: 544)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1306, file: !4, line: 1628, baseType: !925, size: 32, align: 32, offset: 576)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1306, file: !4, line: 1636, baseType: !925, size: 32, align: 32, offset: 608)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1306, file: !4, line: 1643, baseType: !925, size: 32, align: 32, offset: 640)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1306, file: !4, line: 1657, baseType: !1065, size: 64, align: 64, offset: 704)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1306, file: !4, line: 1658, baseType: !925, size: 32, align: 32, offset: 768)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1306, file: !4, line: 1679, baseType: !1131, size: 64, align: 32, offset: 800)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1306, file: !4, line: 1688, baseType: !925, size: 32, align: 32, offset: 864)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1306, file: !4, line: 1712, baseType: !925, size: 32, align: 32, offset: 896)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1306, file: !4, line: 1729, baseType: !925, size: 32, align: 32, offset: 928)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1306, file: !4, line: 1729, baseType: !925, size: 32, align: 32, offset: 960)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1306, file: !4, line: 1744, baseType: !925, size: 32, align: 32, offset: 992)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1306, file: !4, line: 1744, baseType: !925, size: 32, align: 32, offset: 1024)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1306, file: !4, line: 1751, baseType: !925, size: 32, align: 32, offset: 1056)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1306, file: !4, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1306, file: !4, line: 1791, baseType: !1473, size: 64, align: 64, offset: 1152)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DISubroutineType(types: !1475)
!1475 = !{null, !1476, !1417, !1419, !925, !925, !925}
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1306, file: !4, line: 1808, baseType: !1478, size: 64, align: 64, offset: 1216)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DISubroutineType(types: !1480)
!1480 = !{!645, !1476, !1325}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1306, file: !4, line: 1816, baseType: !925, size: 32, align: 32, offset: 1280)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1306, file: !4, line: 1825, baseType: !1483, size: 32, align: 32, offset: 1312)
!1483 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1306, file: !4, line: 1830, baseType: !925, size: 32, align: 32, offset: 1344)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1306, file: !4, line: 1838, baseType: !1483, size: 32, align: 32, offset: 1376)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1306, file: !4, line: 1846, baseType: !925, size: 32, align: 32, offset: 1408)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1306, file: !4, line: 1851, baseType: !925, size: 32, align: 32, offset: 1440)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1306, file: !4, line: 1861, baseType: !1483, size: 32, align: 32, offset: 1472)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1306, file: !4, line: 1868, baseType: !1483, size: 32, align: 32, offset: 1504)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1306, file: !4, line: 1875, baseType: !1483, size: 32, align: 32, offset: 1536)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1306, file: !4, line: 1882, baseType: !1483, size: 32, align: 32, offset: 1568)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1306, file: !4, line: 1889, baseType: !1483, size: 32, align: 32, offset: 1600)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1306, file: !4, line: 1896, baseType: !1483, size: 32, align: 32, offset: 1632)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1306, file: !4, line: 1903, baseType: !1483, size: 32, align: 32, offset: 1664)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1306, file: !4, line: 1910, baseType: !925, size: 32, align: 32, offset: 1696)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1306, file: !4, line: 1915, baseType: !925, size: 32, align: 32, offset: 1728)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1306, file: !4, line: 1926, baseType: !1419, size: 64, align: 64, offset: 1792)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1306, file: !4, line: 1935, baseType: !1131, size: 64, align: 32, offset: 1856)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1306, file: !4, line: 1942, baseType: !925, size: 32, align: 32, offset: 1920)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1306, file: !4, line: 1948, baseType: !925, size: 32, align: 32, offset: 1952)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1306, file: !4, line: 1954, baseType: !925, size: 32, align: 32, offset: 1984)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1306, file: !4, line: 1960, baseType: !925, size: 32, align: 32, offset: 2016)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1306, file: !4, line: 1984, baseType: !925, size: 32, align: 32, offset: 2048)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1306, file: !4, line: 1991, baseType: !925, size: 32, align: 32, offset: 2080)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1306, file: !4, line: 1996, baseType: !925, size: 32, align: 32, offset: 2112)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1306, file: !4, line: 2004, baseType: !925, size: 32, align: 32, offset: 2144)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1306, file: !4, line: 2011, baseType: !925, size: 32, align: 32, offset: 2176)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1306, file: !4, line: 2018, baseType: !925, size: 32, align: 32, offset: 2208)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1306, file: !4, line: 2027, baseType: !925, size: 32, align: 32, offset: 2240)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1306, file: !4, line: 2034, baseType: !925, size: 32, align: 32, offset: 2272)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1306, file: !4, line: 2044, baseType: !925, size: 32, align: 32, offset: 2304)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1306, file: !4, line: 2054, baseType: !1513, size: 64, align: 64, offset: 2368)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1306, file: !4, line: 2061, baseType: !1513, size: 64, align: 64, offset: 2432)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1306, file: !4, line: 2066, baseType: !925, size: 32, align: 32, offset: 2496)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1306, file: !4, line: 2070, baseType: !925, size: 32, align: 32, offset: 2528)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1306, file: !4, line: 2078, baseType: !925, size: 32, align: 32, offset: 2560)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1306, file: !4, line: 2085, baseType: !925, size: 32, align: 32, offset: 2592)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1306, file: !4, line: 2092, baseType: !925, size: 32, align: 32, offset: 2624)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1306, file: !4, line: 2099, baseType: !925, size: 32, align: 32, offset: 2656)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1306, file: !4, line: 2106, baseType: !925, size: 32, align: 32, offset: 2688)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1306, file: !4, line: 2113, baseType: !925, size: 32, align: 32, offset: 2720)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1306, file: !4, line: 2120, baseType: !925, size: 32, align: 32, offset: 2752)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1306, file: !4, line: 2125, baseType: !925, size: 32, align: 32, offset: 2784)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1306, file: !4, line: 2133, baseType: !925, size: 32, align: 32, offset: 2816)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1306, file: !4, line: 2140, baseType: !925, size: 32, align: 32, offset: 2848)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1306, file: !4, line: 2145, baseType: !925, size: 32, align: 32, offset: 2880)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1306, file: !4, line: 2153, baseType: !925, size: 32, align: 32, offset: 2912)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1306, file: !4, line: 2158, baseType: !925, size: 32, align: 32, offset: 2944)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1306, file: !4, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1306, file: !4, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1306, file: !4, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1306, file: !4, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1306, file: !4, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1306, file: !4, line: 2203, baseType: !925, size: 32, align: 32, offset: 3136)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1306, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1306, file: !4, line: 2212, baseType: !925, size: 32, align: 32, offset: 3200)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1306, file: !4, line: 2213, baseType: !925, size: 32, align: 32, offset: 3232)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1306, file: !4, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1306, file: !4, line: 2232, baseType: !925, size: 32, align: 32, offset: 3296)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1306, file: !4, line: 2243, baseType: !925, size: 32, align: 32, offset: 3328)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1306, file: !4, line: 2249, baseType: !925, size: 32, align: 32, offset: 3360)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1306, file: !4, line: 2256, baseType: !925, size: 32, align: 32, offset: 3392)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1306, file: !4, line: 2263, baseType: !1146, size: 64, align: 64, offset: 3456)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1306, file: !4, line: 2270, baseType: !1146, size: 64, align: 64, offset: 3520)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1306, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1306, file: !4, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1306, file: !4, line: 2367, baseType: !1549, size: 64, align: 64, offset: 3648)
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64, align: 64)
!1550 = !DISubroutineType(types: !1551)
!1551 = !{!925, !1476, !1112, !925}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1306, file: !4, line: 2383, baseType: !925, size: 32, align: 32, offset: 3712)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1306, file: !4, line: 2386, baseType: !1483, size: 32, align: 32, offset: 3744)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1306, file: !4, line: 2387, baseType: !1483, size: 32, align: 32, offset: 3776)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1306, file: !4, line: 2394, baseType: !925, size: 32, align: 32, offset: 3808)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1306, file: !4, line: 2401, baseType: !925, size: 32, align: 32, offset: 3840)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1306, file: !4, line: 2408, baseType: !925, size: 32, align: 32, offset: 3872)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1306, file: !4, line: 2415, baseType: !925, size: 32, align: 32, offset: 3904)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1306, file: !4, line: 2422, baseType: !925, size: 32, align: 32, offset: 3936)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1306, file: !4, line: 2423, baseType: !1561, size: 64, align: 64, offset: 3968)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1563)
!1563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1564)
!1564 = !{!1565, !1566, !1567, !1568}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1563, file: !4, line: 827, baseType: !925, size: 32, align: 32)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1563, file: !4, line: 828, baseType: !925, size: 32, align: 32, offset: 32)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1563, file: !4, line: 829, baseType: !925, size: 32, align: 32, offset: 64)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1563, file: !4, line: 830, baseType: !1483, size: 32, align: 32, offset: 96)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1306, file: !4, line: 2430, baseType: !935, size: 64, align: 64, offset: 4032)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1306, file: !4, line: 2437, baseType: !935, size: 64, align: 64, offset: 4096)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1306, file: !4, line: 2444, baseType: !1483, size: 32, align: 32, offset: 4160)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1306, file: !4, line: 2451, baseType: !1483, size: 32, align: 32, offset: 4192)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1306, file: !4, line: 2458, baseType: !925, size: 32, align: 32, offset: 4224)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1306, file: !4, line: 2469, baseType: !925, size: 32, align: 32, offset: 4256)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1306, file: !4, line: 2475, baseType: !925, size: 32, align: 32, offset: 4288)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1306, file: !4, line: 2481, baseType: !925, size: 32, align: 32, offset: 4320)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1306, file: !4, line: 2485, baseType: !925, size: 32, align: 32, offset: 4352)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1306, file: !4, line: 2489, baseType: !925, size: 32, align: 32, offset: 4384)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1306, file: !4, line: 2493, baseType: !925, size: 32, align: 32, offset: 4416)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1306, file: !4, line: 2501, baseType: !925, size: 32, align: 32, offset: 4448)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1306, file: !4, line: 2506, baseType: !925, size: 32, align: 32, offset: 4480)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1306, file: !4, line: 2510, baseType: !925, size: 32, align: 32, offset: 4512)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1306, file: !4, line: 2514, baseType: !935, size: 64, align: 64, offset: 4544)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1306, file: !4, line: 2528, baseType: !1585, size: 64, align: 64, offset: 4608)
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1586 = !DISubroutineType(types: !1587)
!1587 = !{null, !1476, !970, !925, !925}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1306, file: !4, line: 2534, baseType: !925, size: 32, align: 32, offset: 4672)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1306, file: !4, line: 2545, baseType: !925, size: 32, align: 32, offset: 4704)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1306, file: !4, line: 2547, baseType: !925, size: 32, align: 32, offset: 4736)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1306, file: !4, line: 2549, baseType: !925, size: 32, align: 32, offset: 4768)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1306, file: !4, line: 2551, baseType: !925, size: 32, align: 32, offset: 4800)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1306, file: !4, line: 2553, baseType: !925, size: 32, align: 32, offset: 4832)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1306, file: !4, line: 2555, baseType: !925, size: 32, align: 32, offset: 4864)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1306, file: !4, line: 2557, baseType: !925, size: 32, align: 32, offset: 4896)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1306, file: !4, line: 2559, baseType: !925, size: 32, align: 32, offset: 4928)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1306, file: !4, line: 2563, baseType: !925, size: 32, align: 32, offset: 4960)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1306, file: !4, line: 2571, baseType: !1409, size: 64, align: 64, offset: 4992)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1306, file: !4, line: 2579, baseType: !1409, size: 64, align: 64, offset: 5056)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1306, file: !4, line: 2586, baseType: !925, size: 32, align: 32, offset: 5120)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1306, file: !4, line: 2615, baseType: !925, size: 32, align: 32, offset: 5152)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1306, file: !4, line: 2627, baseType: !925, size: 32, align: 32, offset: 5184)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1306, file: !4, line: 2637, baseType: !925, size: 32, align: 32, offset: 5216)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1306, file: !4, line: 2681, baseType: !925, size: 32, align: 32, offset: 5248)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1306, file: !4, line: 2709, baseType: !935, size: 64, align: 64, offset: 5312)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1306, file: !4, line: 2716, baseType: !1607, size: 64, align: 64, offset: 5376)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1609)
!1609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1610)
!1610 = !{!1611, !1612, !1613, !1614, !1615, !1616, !1617, !1621, !1625, !1626, !1627, !1628, !1634, !1635, !1636, !1637, !1638}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1609, file: !4, line: 3642, baseType: !943, size: 64, align: 64)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1609, file: !4, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1609, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1609, file: !4, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1609, file: !4, line: 3669, baseType: !925, size: 32, align: 32, offset: 160)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1609, file: !4, line: 3682, baseType: !1434, size: 64, align: 64, offset: 192)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1609, file: !4, line: 3698, baseType: !1618, size: 64, align: 64, offset: 256)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DISubroutineType(types: !1620)
!1620 = !{!925, !1304, !1258, !933}
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1609, file: !4, line: 3712, baseType: !1622, size: 64, align: 64, offset: 320)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DISubroutineType(types: !1624)
!1624 = !{!925, !1304, !925, !1258, !933}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1609, file: !4, line: 3726, baseType: !1618, size: 64, align: 64, offset: 384)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1609, file: !4, line: 3737, baseType: !1351, size: 64, align: 64, offset: 448)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1609, file: !4, line: 3746, baseType: !925, size: 32, align: 32, offset: 512)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1609, file: !4, line: 3757, baseType: !1629, size: 64, align: 64, offset: 576)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DISubroutineType(types: !1631)
!1631 = !{null, !1632}
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64, align: 64)
!1633 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1609, file: !4, line: 3766, baseType: !1351, size: 64, align: 64, offset: 640)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1609, file: !4, line: 3774, baseType: !1351, size: 64, align: 64, offset: 704)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1609, file: !4, line: 3780, baseType: !925, size: 32, align: 32, offset: 768)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1609, file: !4, line: 3785, baseType: !925, size: 32, align: 32, offset: 800)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1609, file: !4, line: 3795, baseType: !1639, size: 64, align: 64, offset: 832)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DISubroutineType(types: !1641)
!1641 = !{!925, !1304, !1055}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1306, file: !4, line: 2728, baseType: !970, size: 64, align: 64, offset: 5440)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1306, file: !4, line: 2735, baseType: !1145, size: 512, align: 64, offset: 5504)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1306, file: !4, line: 2742, baseType: !925, size: 32, align: 32, offset: 6016)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1306, file: !4, line: 2755, baseType: !925, size: 32, align: 32, offset: 6048)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1306, file: !4, line: 2776, baseType: !925, size: 32, align: 32, offset: 6080)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1306, file: !4, line: 2783, baseType: !925, size: 32, align: 32, offset: 6112)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1306, file: !4, line: 2791, baseType: !925, size: 32, align: 32, offset: 6144)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1306, file: !4, line: 2802, baseType: !1112, size: 64, align: 64, offset: 6208)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1306, file: !4, line: 2811, baseType: !925, size: 32, align: 32, offset: 6272)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1306, file: !4, line: 2821, baseType: !925, size: 32, align: 32, offset: 6304)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1306, file: !4, line: 2830, baseType: !925, size: 32, align: 32, offset: 6336)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1306, file: !4, line: 2840, baseType: !925, size: 32, align: 32, offset: 6368)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1306, file: !4, line: 2851, baseType: !1655, size: 64, align: 64, offset: 6400)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DISubroutineType(types: !1657)
!1657 = !{!925, !1476, !1658, !970, !1419, !925, !925}
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DISubroutineType(types: !1660)
!1660 = !{!925, !1476, !970}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1306, file: !4, line: 2871, baseType: !1662, size: 64, align: 64, offset: 6464)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DISubroutineType(types: !1664)
!1664 = !{!925, !1476, !1665, !970, !1419, !925}
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DISubroutineType(types: !1667)
!1667 = !{!925, !1476, !970, !925, !925}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1306, file: !4, line: 2878, baseType: !925, size: 32, align: 32, offset: 6528)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1306, file: !4, line: 2885, baseType: !925, size: 32, align: 32, offset: 6560)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1306, file: !4, line: 3005, baseType: !925, size: 32, align: 32, offset: 6592)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1306, file: !4, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1306, file: !4, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1306, file: !4, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1306, file: !4, line: 3037, baseType: !1065, size: 64, align: 64, offset: 6720)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1306, file: !4, line: 3038, baseType: !925, size: 32, align: 32, offset: 6784)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1306, file: !4, line: 3050, baseType: !1146, size: 64, align: 64, offset: 6848)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1306, file: !4, line: 3065, baseType: !925, size: 32, align: 32, offset: 6912)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1306, file: !4, line: 3083, baseType: !925, size: 32, align: 32, offset: 6944)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1306, file: !4, line: 3092, baseType: !1131, size: 64, align: 32, offset: 6976)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1306, file: !4, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1306, file: !4, line: 3106, baseType: !1131, size: 64, align: 32, offset: 7072)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1306, file: !4, line: 3113, baseType: !1683, size: 64, align: 64, offset: 7168)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64, align: 64)
!1684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1685)
!1685 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1686)
!1686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1687)
!1687 = !{!1688, !1689, !1690, !1691, !1692, !1693, !1696}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1686, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1686, file: !4, line: 714, baseType: !636, size: 32, align: 32, offset: 32)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1686, file: !4, line: 720, baseType: !943, size: 64, align: 64, offset: 64)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1686, file: !4, line: 724, baseType: !943, size: 64, align: 64, offset: 128)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1686, file: !4, line: 728, baseType: !925, size: 32, align: 32, offset: 192)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1686, file: !4, line: 734, baseType: !1694, size: 64, align: 64, offset: 256)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64, align: 64)
!1695 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1686, file: !4, line: 739, baseType: !1697, size: 64, align: 64, offset: 320)
!1697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1698, size: 64, align: 64)
!1698 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1342)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1306, file: !4, line: 3129, baseType: !935, size: 64, align: 64, offset: 7232)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1306, file: !4, line: 3130, baseType: !935, size: 64, align: 64, offset: 7296)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1306, file: !4, line: 3131, baseType: !935, size: 64, align: 64, offset: 7360)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1306, file: !4, line: 3132, baseType: !935, size: 64, align: 64, offset: 7424)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1306, file: !4, line: 3139, baseType: !1409, size: 64, align: 64, offset: 7488)
