; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--fic.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--fic.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!866 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!867 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!868 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!869 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!870 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!871 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!872 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!873 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!874 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !14, line: 1534, size: 32, align: 32, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881}
!876 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!877 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!878 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!879 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!880 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!881 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!882 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893}
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!887 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!888 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!889 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902}
!896 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!897 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!898 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!899 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!900 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!901 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!902 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !{!910, !911, !912, !917, !925, !914, !930}
!910 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!911 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64, align: 64)
!913 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !915, line: 48, baseType: !916)
!915 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!916 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !920, line: 222, size: 16, align: 8, elements: !921)
!920 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!921 = !{!922}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !919, file: !920, line: 222, baseType: !923, size: 16, align: 16)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !915, line: 49, baseType: !924)
!924 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !920, line: 221, size: 32, align: 8, elements: !928)
!928 = !{!929}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !927, file: !920, line: 221, baseType: !930, size: 32, align: 32)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !915, line: 51, baseType: !911)
!931 = !{!932, !1689, !1690, !1696, !1700, !1704}
!932 = distinct !DIGlobalVariable(name: "ff_fic_decoder", scope: !0, file: !933, line: 485, type: !934, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_fic_decoder)
!933 = !DIFile(filename: "libavcodec/fic.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !936)
!936 = !{!937, !941, !942, !943, !944, !945, !954, !957, !960, !963, !968, !969, !1045, !1053, !1054, !1055, !1057, !1604, !1610, !1618, !1622, !1623, !1660, !1664, !1668, !1669, !1673, !1677, !1678, !1682, !1683, !1684}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !935, file: !14, line: 3475, baseType: !938, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!940 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !935, file: !14, line: 3480, baseType: !938, size: 64, align: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !935, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !935, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !935, file: !14, line: 3487, baseType: !910, size: 32, align: 32, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !935, file: !14, line: 3488, baseType: !946, size: 64, align: 64, offset: 256)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !949, line: 61, baseType: !950)
!949 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !949, line: 58, size: 64, align: 32, elements: !951)
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !950, file: !949, line: 59, baseType: !910, size: 32, align: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !950, file: !949, line: 60, baseType: !910, size: 32, align: 32, offset: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !935, file: !14, line: 3489, baseType: !955, size: 64, align: 64, offset: 320)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !935, file: !14, line: 3490, baseType: !958, size: 64, align: 64, offset: 384)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !935, file: !14, line: 3491, baseType: !961, size: 64, align: 64, offset: 448)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !935, file: !14, line: 3492, baseType: !964, size: 64, align: 64, offset: 512)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !915, line: 55, baseType: !967)
!967 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !935, file: !14, line: 3493, baseType: !914, size: 8, align: 8, offset: 576)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !935, file: !14, line: 3494, baseType: !970, size: 64, align: 64, offset: 640)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !974)
!974 = !{!975, !976, !981, !1004, !1005, !1006, !1007, !1011, !1017, !1019, !1023}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !973, file: !713, line: 72, baseType: !938, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !973, file: !713, line: 78, baseType: !977, size: 64, align: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!938, !980}
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !973, file: !713, line: 85, baseType: !982, size: 64, align: 64, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !985)
!985 = !{!986, !987, !988, !989, !990, !1000, !1001, !1002, !1003}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !984, file: !691, line: 247, baseType: !938, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !984, file: !691, line: 253, baseType: !938, size: 64, align: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !984, file: !691, line: 259, baseType: !910, size: 32, align: 32, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !984, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !984, file: !691, line: 271, baseType: !991, size: 64, align: 64, offset: 192)
!991 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !984, file: !691, line: 265, size: 64, align: 64, elements: !992)
!992 = !{!993, !996, !998, !999}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !991, file: !691, line: 266, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !915, line: 40, baseType: !995)
!995 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !991, file: !691, line: 267, baseType: !997, size: 64, align: 64)
!997 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !991, file: !691, line: 268, baseType: !938, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !991, file: !691, line: 270, baseType: !948, size: 64, align: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !984, file: !691, line: 272, baseType: !997, size: 64, align: 64, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !984, file: !691, line: 273, baseType: !997, size: 64, align: 64, offset: 320)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !984, file: !691, line: 275, baseType: !910, size: 32, align: 32, offset: 384)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !984, file: !691, line: 300, baseType: !938, size: 64, align: 64, offset: 448)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !973, file: !713, line: 93, baseType: !910, size: 32, align: 32, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !973, file: !713, line: 99, baseType: !910, size: 32, align: 32, offset: 224)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !973, file: !713, line: 108, baseType: !910, size: 32, align: 32, offset: 256)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !973, file: !713, line: 113, baseType: !1008, size: 64, align: 64, offset: 320)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!980, !980, !980}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !973, file: !713, line: 123, baseType: !1012, size: 64, align: 64, offset: 384)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!1015, !1015}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !973, file: !713, line: 130, baseType: !1018, size: 32, align: 32, offset: 448)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !973, file: !713, line: 136, baseType: !1020, size: 64, align: 64, offset: 512)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!1018, !980}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !973, file: !713, line: 142, baseType: !1024, size: 64, align: 64, offset: 576)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!910, !1027, !980, !938, !910}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1030)
!1030 = !{!1031, !1043, !1044}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1029, file: !691, line: 360, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1036)
!1036 = !{!1037, !1038, !1039, !1040, !1041, !1042}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1035, file: !691, line: 307, baseType: !938, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1035, file: !691, line: 313, baseType: !997, size: 64, align: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1035, file: !691, line: 313, baseType: !997, size: 64, align: 64, offset: 128)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1035, file: !691, line: 318, baseType: !997, size: 64, align: 64, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1035, file: !691, line: 318, baseType: !997, size: 64, align: 64, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1035, file: !691, line: 323, baseType: !910, size: 32, align: 32, offset: 320)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1029, file: !691, line: 364, baseType: !910, size: 32, align: 32, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1029, file: !691, line: 368, baseType: !910, size: 32, align: 32, offset: 96)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !935, file: !14, line: 3495, baseType: !1046, size: 64, align: 64, offset: 704)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1050)
!1050 = !{!1051, !1052}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1049, file: !14, line: 3402, baseType: !910, size: 32, align: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1049, file: !14, line: 3403, baseType: !938, size: 64, align: 64, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !935, file: !14, line: 3507, baseType: !938, size: 64, align: 64, offset: 768)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !935, file: !14, line: 3516, baseType: !910, size: 32, align: 32, offset: 832)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !935, file: !14, line: 3517, baseType: !1056, size: 64, align: 64, offset: 896)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !935, file: !14, line: 3527, baseType: !1058, size: 64, align: 64, offset: 960)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!910, !1061}
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1064)
!1064 = !{!1065, !1066, !1067, !1068, !1071, !1072, !1073, !1074, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1354, !1358, !1359, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1542, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1063, file: !14, line: 1561, baseType: !970, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1063, file: !14, line: 1562, baseType: !910, size: 32, align: 32, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1063, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1063, file: !14, line: 1565, baseType: !1069, size: 64, align: 64, offset: 128)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1063, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1063, file: !14, line: 1581, baseType: !911, size: 32, align: 32, offset: 224)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1063, file: !14, line: 1583, baseType: !980, size: 64, align: 64, offset: 256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1063, file: !14, line: 1591, baseType: !1075, size: 64, align: 64, offset: 320)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1077, line: 129, size: 1664, align: 64, elements: !1078)
!1077 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1078 = !{!1079, !1080, !1081, !1082, !1180, !1201, !1202, !1231, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1076, file: !1077, line: 136, baseType: !910, size: 32, align: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1076, file: !1077, line: 151, baseType: !910, size: 32, align: 32, offset: 32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1076, file: !1077, line: 157, baseType: !910, size: 32, align: 32, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1076, file: !1077, line: 159, baseType: !1083, size: 64, align: 64, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1085)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1086)
!1086 = !{!1087, !1092, !1094, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1132, !1134, !1135, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1168, !1169, !1170, !1171, !1172, !1173, !1176, !1177, !1178, !1179}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1085, file: !744, line: 282, baseType: !1088, size: 512, align: 64)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1089, size: 512, align: 64, elements: !1090)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64, align: 64)
!1090 = !{!1091}
!1091 = !DISubrange(count: 8)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1085, file: !744, line: 299, baseType: !1093, size: 256, align: 32, offset: 512)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 256, align: 32, elements: !1090)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1085, file: !744, line: 315, baseType: !1095, size: 64, align: 64, offset: 768)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1085, file: !744, line: 326, baseType: !910, size: 32, align: 32, offset: 832)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1085, file: !744, line: 326, baseType: !910, size: 32, align: 32, offset: 864)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1085, file: !744, line: 334, baseType: !910, size: 32, align: 32, offset: 896)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1085, file: !744, line: 341, baseType: !910, size: 32, align: 32, offset: 928)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1085, file: !744, line: 346, baseType: !910, size: 32, align: 32, offset: 960)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1085, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1085, file: !744, line: 356, baseType: !948, size: 64, align: 32, offset: 1024)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1085, file: !744, line: 361, baseType: !994, size: 64, align: 64, offset: 1088)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1085, file: !744, line: 369, baseType: !994, size: 64, align: 64, offset: 1152)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1085, file: !744, line: 377, baseType: !994, size: 64, align: 64, offset: 1216)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1085, file: !744, line: 382, baseType: !910, size: 32, align: 32, offset: 1280)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1085, file: !744, line: 386, baseType: !910, size: 32, align: 32, offset: 1312)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1085, file: !744, line: 391, baseType: !910, size: 32, align: 32, offset: 1344)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1085, file: !744, line: 396, baseType: !980, size: 64, align: 64, offset: 1408)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1085, file: !744, line: 403, baseType: !1111, size: 512, align: 64, offset: 1472)
!1111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !966, size: 512, align: 64, elements: !1090)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1085, file: !744, line: 410, baseType: !910, size: 32, align: 32, offset: 1984)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1085, file: !744, line: 415, baseType: !910, size: 32, align: 32, offset: 2016)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1085, file: !744, line: 420, baseType: !910, size: 32, align: 32, offset: 2048)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1085, file: !744, line: 425, baseType: !910, size: 32, align: 32, offset: 2080)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1085, file: !744, line: 435, baseType: !994, size: 64, align: 64, offset: 2112)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1085, file: !744, line: 440, baseType: !910, size: 32, align: 32, offset: 2176)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1085, file: !744, line: 445, baseType: !966, size: 64, align: 64, offset: 2240)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1085, file: !744, line: 459, baseType: !1120, size: 512, align: 64, offset: 2304)
!1120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1121, size: 512, align: 64, elements: !1090)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1123, line: 94, baseType: !1124)
!1123 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1123, line: 81, size: 192, align: 64, elements: !1125)
!1125 = !{!1126, !1130, !1131}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1124, file: !1123, line: 82, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1123, line: 73, baseType: !1129)
!1129 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1123, line: 73, flags: DIFlagFwdDecl)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1124, file: !1123, line: 89, baseType: !1089, size: 64, align: 64, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1124, file: !1123, line: 93, baseType: !910, size: 32, align: 32, offset: 128)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1085, file: !744, line: 473, baseType: !1133, size: 64, align: 64, offset: 2816)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1085, file: !744, line: 477, baseType: !910, size: 32, align: 32, offset: 2880)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1085, file: !744, line: 479, baseType: !1136, size: 64, align: 64, offset: 2944)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1139)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1140)
!1140 = !{!1141, !1142, !1143, !1144, !1149}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1139, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1139, file: !744, line: 203, baseType: !1089, size: 64, align: 64, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1139, file: !744, line: 204, baseType: !910, size: 32, align: 32, offset: 128)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1139, file: !744, line: 205, baseType: !1145, size: 64, align: 64, offset: 192)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1147, line: 86, baseType: !1148)
!1147 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1148 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1147, line: 86, flags: DIFlagFwdDecl)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1139, file: !744, line: 206, baseType: !1121, size: 64, align: 64, offset: 256)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1085, file: !744, line: 480, baseType: !910, size: 32, align: 32, offset: 3008)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1085, file: !744, line: 505, baseType: !910, size: 32, align: 32, offset: 3040)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1085, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1085, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1085, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1085, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1085, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1085, file: !744, line: 532, baseType: !994, size: 64, align: 64, offset: 3264)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1085, file: !744, line: 539, baseType: !994, size: 64, align: 64, offset: 3328)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1085, file: !744, line: 547, baseType: !994, size: 64, align: 64, offset: 3392)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1085, file: !744, line: 554, baseType: !1145, size: 64, align: 64, offset: 3456)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1085, file: !744, line: 563, baseType: !910, size: 32, align: 32, offset: 3520)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1085, file: !744, line: 572, baseType: !910, size: 32, align: 32, offset: 3552)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1085, file: !744, line: 581, baseType: !910, size: 32, align: 32, offset: 3584)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1085, file: !744, line: 588, baseType: !1165, size: 64, align: 64, offset: 3648)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !915, line: 36, baseType: !1167)
!1167 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1085, file: !744, line: 593, baseType: !910, size: 32, align: 32, offset: 3712)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1085, file: !744, line: 596, baseType: !910, size: 32, align: 32, offset: 3744)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1085, file: !744, line: 599, baseType: !1121, size: 64, align: 64, offset: 3776)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1085, file: !744, line: 605, baseType: !1121, size: 64, align: 64, offset: 3840)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1085, file: !744, line: 616, baseType: !1121, size: 64, align: 64, offset: 3904)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1085, file: !744, line: 626, baseType: !1174, size: 64, align: 64, offset: 3968)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1175, line: 216, baseType: !967)
!1175 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1085, file: !744, line: 627, baseType: !1174, size: 64, align: 64, offset: 4032)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1085, file: !744, line: 628, baseType: !1174, size: 64, align: 64, offset: 4096)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1085, file: !744, line: 629, baseType: !1174, size: 64, align: 64, offset: 4160)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1085, file: !744, line: 645, baseType: !1121, size: 64, align: 64, offset: 4224)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1076, file: !1077, line: 161, baseType: !1181, size: 64, align: 64, offset: 192)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1077, line: 117, baseType: !1183)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1077, line: 100, size: 832, align: 64, elements: !1184)
!1184 = !{!1185, !1192, !1193, !1194, !1195, !1196, !1198, !1199, !1200}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1183, file: !1077, line: 105, baseType: !1186, size: 256, align: 64)
!1186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1187, size: 256, align: 64, elements: !1190)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1123, line: 238, baseType: !1189)
!1189 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1123, line: 238, flags: DIFlagFwdDecl)
!1190 = !{!1191}
!1191 = !DISubrange(count: 4)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1183, file: !1077, line: 110, baseType: !910, size: 32, align: 32, offset: 256)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1183, file: !1077, line: 111, baseType: !910, size: 32, align: 32, offset: 288)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1183, file: !1077, line: 111, baseType: !910, size: 32, align: 32, offset: 320)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1183, file: !1077, line: 112, baseType: !1093, size: 256, align: 32, offset: 352)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1183, file: !1077, line: 113, baseType: !1197, size: 128, align: 32, offset: 608)
!1197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 128, align: 32, elements: !1190)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1183, file: !1077, line: 114, baseType: !910, size: 32, align: 32, offset: 736)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1183, file: !1077, line: 115, baseType: !910, size: 32, align: 32, offset: 768)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1183, file: !1077, line: 116, baseType: !910, size: 32, align: 32, offset: 800)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1076, file: !1077, line: 163, baseType: !980, size: 64, align: 64, offset: 256)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1076, file: !1077, line: 165, baseType: !1203, size: 128, align: 64, offset: 320)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1077, line: 122, baseType: !1204)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1077, line: 119, size: 128, align: 64, elements: !1205)
!1205 = !{!1206, !1230}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1204, file: !1077, line: 120, baseType: !1207, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1210)
!1210 = !{!1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1226, !1227, !1228, !1229}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1209, file: !14, line: 1451, baseType: !1121, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1209, file: !14, line: 1461, baseType: !994, size: 64, align: 64, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1209, file: !14, line: 1467, baseType: !994, size: 64, align: 64, offset: 128)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1209, file: !14, line: 1468, baseType: !1089, size: 64, align: 64, offset: 192)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1209, file: !14, line: 1469, baseType: !910, size: 32, align: 32, offset: 256)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1209, file: !14, line: 1470, baseType: !910, size: 32, align: 32, offset: 288)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1209, file: !14, line: 1474, baseType: !910, size: 32, align: 32, offset: 320)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1209, file: !14, line: 1479, baseType: !1219, size: 64, align: 64, offset: 384)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1221)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1222)
!1222 = !{!1223, !1224, !1225}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1221, file: !14, line: 1412, baseType: !1089, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1221, file: !14, line: 1413, baseType: !910, size: 32, align: 32, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1221, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1209, file: !14, line: 1480, baseType: !910, size: 32, align: 32, offset: 448)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1209, file: !14, line: 1486, baseType: !994, size: 64, align: 64, offset: 512)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1209, file: !14, line: 1488, baseType: !994, size: 64, align: 64, offset: 576)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1209, file: !14, line: 1497, baseType: !994, size: 64, align: 64, offset: 640)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1204, file: !1077, line: 121, baseType: !1083, size: 64, align: 64, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1076, file: !1077, line: 166, baseType: !1232, size: 128, align: 64, offset: 448)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1077, line: 127, baseType: !1233)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1077, line: 124, size: 128, align: 64, elements: !1234)
!1234 = !{!1235, !1308}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1233, file: !1077, line: 125, baseType: !1236, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1240)
!1240 = !{!1241, !1242, !1266, !1270, !1271, !1305, !1306, !1307}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1239, file: !14, line: 5751, baseType: !970, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1239, file: !14, line: 5756, baseType: !1243, size: 64, align: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1245)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1246)
!1246 = !{!1247, !1248, !1251, !1252, !1253, !1257, !1261, !1265}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1245, file: !14, line: 5797, baseType: !938, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1245, file: !14, line: 5804, baseType: !1249, size: 64, align: 64, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1245, file: !14, line: 5815, baseType: !970, size: 64, align: 64, offset: 128)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1245, file: !14, line: 5825, baseType: !910, size: 32, align: 32, offset: 192)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1245, file: !14, line: 5826, baseType: !1254, size: 64, align: 64, offset: 256)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!910, !1237}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1245, file: !14, line: 5827, baseType: !1258, size: 64, align: 64, offset: 320)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!910, !1237, !1207}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1245, file: !14, line: 5828, baseType: !1262, size: 64, align: 64, offset: 384)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{null, !1237}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1245, file: !14, line: 5829, baseType: !1262, size: 64, align: 64, offset: 448)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1239, file: !14, line: 5762, baseType: !1267, size: 64, align: 64, offset: 128)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1269)
!1269 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1239, file: !14, line: 5768, baseType: !980, size: 64, align: 64, offset: 192)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1239, file: !14, line: 5775, baseType: !1272, size: 64, align: 64, offset: 256)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1275)
!1275 = !{!1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1274, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1274, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1274, file: !14, line: 3948, baseType: !930, size: 32, align: 32, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1274, file: !14, line: 3958, baseType: !1089, size: 64, align: 64, offset: 128)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1274, file: !14, line: 3962, baseType: !910, size: 32, align: 32, offset: 192)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1274, file: !14, line: 3968, baseType: !910, size: 32, align: 32, offset: 224)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1274, file: !14, line: 3973, baseType: !994, size: 64, align: 64, offset: 256)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1274, file: !14, line: 3986, baseType: !910, size: 32, align: 32, offset: 320)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1274, file: !14, line: 3999, baseType: !910, size: 32, align: 32, offset: 352)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1274, file: !14, line: 4004, baseType: !910, size: 32, align: 32, offset: 384)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1274, file: !14, line: 4005, baseType: !910, size: 32, align: 32, offset: 416)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1274, file: !14, line: 4010, baseType: !910, size: 32, align: 32, offset: 448)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1274, file: !14, line: 4011, baseType: !910, size: 32, align: 32, offset: 480)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1274, file: !14, line: 4020, baseType: !948, size: 64, align: 32, offset: 512)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1274, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1274, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1274, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1274, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1274, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1274, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1274, file: !14, line: 4039, baseType: !910, size: 32, align: 32, offset: 768)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1274, file: !14, line: 4046, baseType: !966, size: 64, align: 64, offset: 832)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1274, file: !14, line: 4050, baseType: !910, size: 32, align: 32, offset: 896)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1274, file: !14, line: 4054, baseType: !910, size: 32, align: 32, offset: 928)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1274, file: !14, line: 4061, baseType: !910, size: 32, align: 32, offset: 960)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1274, file: !14, line: 4065, baseType: !910, size: 32, align: 32, offset: 992)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1274, file: !14, line: 4073, baseType: !910, size: 32, align: 32, offset: 1024)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1274, file: !14, line: 4080, baseType: !910, size: 32, align: 32, offset: 1056)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1274, file: !14, line: 4084, baseType: !910, size: 32, align: 32, offset: 1088)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1239, file: !14, line: 5781, baseType: !1272, size: 64, align: 64, offset: 320)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1239, file: !14, line: 5787, baseType: !948, size: 64, align: 32, offset: 384)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1239, file: !14, line: 5793, baseType: !948, size: 64, align: 32, offset: 448)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1233, file: !1077, line: 126, baseType: !910, size: 32, align: 32, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1076, file: !1077, line: 172, baseType: !1207, size: 64, align: 64, offset: 576)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1076, file: !1077, line: 177, baseType: !1089, size: 64, align: 64, offset: 640)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1076, file: !1077, line: 178, baseType: !911, size: 32, align: 32, offset: 704)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1076, file: !1077, line: 180, baseType: !980, size: 64, align: 64, offset: 768)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1076, file: !1077, line: 185, baseType: !910, size: 32, align: 32, offset: 832)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1076, file: !1077, line: 190, baseType: !980, size: 64, align: 64, offset: 896)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1076, file: !1077, line: 195, baseType: !910, size: 32, align: 32, offset: 960)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1076, file: !1077, line: 200, baseType: !1207, size: 64, align: 64, offset: 1024)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1076, file: !1077, line: 201, baseType: !910, size: 32, align: 32, offset: 1088)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1076, file: !1077, line: 202, baseType: !1083, size: 64, align: 64, offset: 1152)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1076, file: !1077, line: 203, baseType: !910, size: 32, align: 32, offset: 1216)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1076, file: !1077, line: 205, baseType: !910, size: 32, align: 32, offset: 1248)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1076, file: !1077, line: 206, baseType: !910, size: 32, align: 32, offset: 1280)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1076, file: !1077, line: 209, baseType: !1174, size: 64, align: 64, offset: 1344)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1076, file: !1077, line: 212, baseType: !1174, size: 64, align: 64, offset: 1408)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1076, file: !1077, line: 213, baseType: !1083, size: 64, align: 64, offset: 1472)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1076, file: !1077, line: 215, baseType: !910, size: 32, align: 32, offset: 1536)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1076, file: !1077, line: 217, baseType: !910, size: 32, align: 32, offset: 1568)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1076, file: !1077, line: 220, baseType: !910, size: 32, align: 32, offset: 1600)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1063, file: !14, line: 1598, baseType: !980, size: 64, align: 64, offset: 384)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1063, file: !14, line: 1606, baseType: !994, size: 64, align: 64, offset: 448)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1063, file: !14, line: 1614, baseType: !910, size: 32, align: 32, offset: 512)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1063, file: !14, line: 1622, baseType: !910, size: 32, align: 32, offset: 544)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1063, file: !14, line: 1628, baseType: !910, size: 32, align: 32, offset: 576)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1063, file: !14, line: 1636, baseType: !910, size: 32, align: 32, offset: 608)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1063, file: !14, line: 1643, baseType: !910, size: 32, align: 32, offset: 640)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1063, file: !14, line: 1657, baseType: !1089, size: 64, align: 64, offset: 704)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1063, file: !14, line: 1658, baseType: !910, size: 32, align: 32, offset: 768)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1063, file: !14, line: 1679, baseType: !948, size: 64, align: 32, offset: 800)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1063, file: !14, line: 1688, baseType: !910, size: 32, align: 32, offset: 864)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1063, file: !14, line: 1712, baseType: !910, size: 32, align: 32, offset: 896)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1063, file: !14, line: 1729, baseType: !910, size: 32, align: 32, offset: 928)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1063, file: !14, line: 1729, baseType: !910, size: 32, align: 32, offset: 960)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1063, file: !14, line: 1744, baseType: !910, size: 32, align: 32, offset: 992)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1063, file: !14, line: 1744, baseType: !910, size: 32, align: 32, offset: 1024)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1063, file: !14, line: 1751, baseType: !910, size: 32, align: 32, offset: 1056)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1063, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1063, file: !14, line: 1791, baseType: !1347, size: 64, align: 64, offset: 1152)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DISubroutineType(types: !1349)
!1349 = !{null, !1350, !1351, !1353, !910, !910, !910}
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1084)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1063, file: !14, line: 1808, baseType: !1355, size: 64, align: 64, offset: 1216)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{!473, !1350, !955}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1063, file: !14, line: 1816, baseType: !910, size: 32, align: 32, offset: 1280)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1063, file: !14, line: 1825, baseType: !1360, size: 32, align: 32, offset: 1312)
!1360 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1063, file: !14, line: 1830, baseType: !910, size: 32, align: 32, offset: 1344)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1063, file: !14, line: 1838, baseType: !1360, size: 32, align: 32, offset: 1376)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1063, file: !14, line: 1846, baseType: !910, size: 32, align: 32, offset: 1408)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1063, file: !14, line: 1851, baseType: !910, size: 32, align: 32, offset: 1440)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1063, file: !14, line: 1861, baseType: !1360, size: 32, align: 32, offset: 1472)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1063, file: !14, line: 1868, baseType: !1360, size: 32, align: 32, offset: 1504)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1063, file: !14, line: 1875, baseType: !1360, size: 32, align: 32, offset: 1536)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1063, file: !14, line: 1882, baseType: !1360, size: 32, align: 32, offset: 1568)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1063, file: !14, line: 1889, baseType: !1360, size: 32, align: 32, offset: 1600)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1063, file: !14, line: 1896, baseType: !1360, size: 32, align: 32, offset: 1632)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1063, file: !14, line: 1903, baseType: !1360, size: 32, align: 32, offset: 1664)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1063, file: !14, line: 1910, baseType: !910, size: 32, align: 32, offset: 1696)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1063, file: !14, line: 1915, baseType: !910, size: 32, align: 32, offset: 1728)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1063, file: !14, line: 1926, baseType: !1353, size: 64, align: 64, offset: 1792)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1063, file: !14, line: 1935, baseType: !948, size: 64, align: 32, offset: 1856)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1063, file: !14, line: 1942, baseType: !910, size: 32, align: 32, offset: 1920)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1063, file: !14, line: 1948, baseType: !910, size: 32, align: 32, offset: 1952)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1063, file: !14, line: 1954, baseType: !910, size: 32, align: 32, offset: 1984)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1063, file: !14, line: 1960, baseType: !910, size: 32, align: 32, offset: 2016)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1063, file: !14, line: 1984, baseType: !910, size: 32, align: 32, offset: 2048)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1063, file: !14, line: 1991, baseType: !910, size: 32, align: 32, offset: 2080)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1063, file: !14, line: 1996, baseType: !910, size: 32, align: 32, offset: 2112)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1063, file: !14, line: 2004, baseType: !910, size: 32, align: 32, offset: 2144)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1063, file: !14, line: 2011, baseType: !910, size: 32, align: 32, offset: 2176)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1063, file: !14, line: 2018, baseType: !910, size: 32, align: 32, offset: 2208)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1063, file: !14, line: 2027, baseType: !910, size: 32, align: 32, offset: 2240)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1063, file: !14, line: 2034, baseType: !910, size: 32, align: 32, offset: 2272)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1063, file: !14, line: 2044, baseType: !910, size: 32, align: 32, offset: 2304)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1063, file: !14, line: 2054, baseType: !1390, size: 64, align: 64, offset: 2368)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1063, file: !14, line: 2061, baseType: !1390, size: 64, align: 64, offset: 2432)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1063, file: !14, line: 2066, baseType: !910, size: 32, align: 32, offset: 2496)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1063, file: !14, line: 2070, baseType: !910, size: 32, align: 32, offset: 2528)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1063, file: !14, line: 2078, baseType: !910, size: 32, align: 32, offset: 2560)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1063, file: !14, line: 2085, baseType: !910, size: 32, align: 32, offset: 2592)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1063, file: !14, line: 2092, baseType: !910, size: 32, align: 32, offset: 2624)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1063, file: !14, line: 2099, baseType: !910, size: 32, align: 32, offset: 2656)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1063, file: !14, line: 2106, baseType: !910, size: 32, align: 32, offset: 2688)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1063, file: !14, line: 2113, baseType: !910, size: 32, align: 32, offset: 2720)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1063, file: !14, line: 2120, baseType: !910, size: 32, align: 32, offset: 2752)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1063, file: !14, line: 2125, baseType: !910, size: 32, align: 32, offset: 2784)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1063, file: !14, line: 2133, baseType: !910, size: 32, align: 32, offset: 2816)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1063, file: !14, line: 2140, baseType: !910, size: 32, align: 32, offset: 2848)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1063, file: !14, line: 2145, baseType: !910, size: 32, align: 32, offset: 2880)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1063, file: !14, line: 2153, baseType: !910, size: 32, align: 32, offset: 2912)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1063, file: !14, line: 2158, baseType: !910, size: 32, align: 32, offset: 2944)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1063, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1063, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1063, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1063, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1063, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1063, file: !14, line: 2203, baseType: !910, size: 32, align: 32, offset: 3136)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1063, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1063, file: !14, line: 2212, baseType: !910, size: 32, align: 32, offset: 3200)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1063, file: !14, line: 2213, baseType: !910, size: 32, align: 32, offset: 3232)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1063, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1063, file: !14, line: 2232, baseType: !910, size: 32, align: 32, offset: 3296)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1063, file: !14, line: 2243, baseType: !910, size: 32, align: 32, offset: 3328)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1063, file: !14, line: 2249, baseType: !910, size: 32, align: 32, offset: 3360)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1063, file: !14, line: 2256, baseType: !910, size: 32, align: 32, offset: 3392)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1063, file: !14, line: 2263, baseType: !966, size: 64, align: 64, offset: 3456)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1063, file: !14, line: 2270, baseType: !966, size: 64, align: 64, offset: 3520)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1063, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1063, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1063, file: !14, line: 2367, baseType: !1426, size: 64, align: 64, offset: 3648)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DISubroutineType(types: !1428)
!1428 = !{!910, !1350, !1083, !910}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1063, file: !14, line: 2383, baseType: !910, size: 32, align: 32, offset: 3712)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1063, file: !14, line: 2386, baseType: !1360, size: 32, align: 32, offset: 3744)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1063, file: !14, line: 2387, baseType: !1360, size: 32, align: 32, offset: 3776)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1063, file: !14, line: 2394, baseType: !910, size: 32, align: 32, offset: 3808)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1063, file: !14, line: 2401, baseType: !910, size: 32, align: 32, offset: 3840)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1063, file: !14, line: 2408, baseType: !910, size: 32, align: 32, offset: 3872)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1063, file: !14, line: 2415, baseType: !910, size: 32, align: 32, offset: 3904)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1063, file: !14, line: 2422, baseType: !910, size: 32, align: 32, offset: 3936)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1063, file: !14, line: 2423, baseType: !1438, size: 64, align: 64, offset: 3968)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1440)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1441)
!1441 = !{!1442, !1443, !1444, !1445}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1440, file: !14, line: 827, baseType: !910, size: 32, align: 32)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1440, file: !14, line: 828, baseType: !910, size: 32, align: 32, offset: 32)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1440, file: !14, line: 829, baseType: !910, size: 32, align: 32, offset: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1440, file: !14, line: 830, baseType: !1360, size: 32, align: 32, offset: 96)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1063, file: !14, line: 2430, baseType: !994, size: 64, align: 64, offset: 4032)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1063, file: !14, line: 2437, baseType: !994, size: 64, align: 64, offset: 4096)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1063, file: !14, line: 2444, baseType: !1360, size: 32, align: 32, offset: 4160)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1063, file: !14, line: 2451, baseType: !1360, size: 32, align: 32, offset: 4192)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1063, file: !14, line: 2458, baseType: !910, size: 32, align: 32, offset: 4224)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1063, file: !14, line: 2469, baseType: !910, size: 32, align: 32, offset: 4256)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1063, file: !14, line: 2475, baseType: !910, size: 32, align: 32, offset: 4288)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1063, file: !14, line: 2481, baseType: !910, size: 32, align: 32, offset: 4320)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1063, file: !14, line: 2485, baseType: !910, size: 32, align: 32, offset: 4352)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1063, file: !14, line: 2489, baseType: !910, size: 32, align: 32, offset: 4384)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1063, file: !14, line: 2493, baseType: !910, size: 32, align: 32, offset: 4416)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1063, file: !14, line: 2501, baseType: !910, size: 32, align: 32, offset: 4448)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1063, file: !14, line: 2506, baseType: !910, size: 32, align: 32, offset: 4480)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1063, file: !14, line: 2510, baseType: !910, size: 32, align: 32, offset: 4512)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1063, file: !14, line: 2514, baseType: !994, size: 64, align: 64, offset: 4544)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1063, file: !14, line: 2528, baseType: !1462, size: 64, align: 64, offset: 4608)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{null, !1350, !980, !910, !910}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1063, file: !14, line: 2534, baseType: !910, size: 32, align: 32, offset: 4672)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1063, file: !14, line: 2545, baseType: !910, size: 32, align: 32, offset: 4704)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1063, file: !14, line: 2547, baseType: !910, size: 32, align: 32, offset: 4736)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1063, file: !14, line: 2549, baseType: !910, size: 32, align: 32, offset: 4768)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1063, file: !14, line: 2551, baseType: !910, size: 32, align: 32, offset: 4800)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1063, file: !14, line: 2553, baseType: !910, size: 32, align: 32, offset: 4832)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1063, file: !14, line: 2555, baseType: !910, size: 32, align: 32, offset: 4864)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1063, file: !14, line: 2557, baseType: !910, size: 32, align: 32, offset: 4896)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1063, file: !14, line: 2559, baseType: !910, size: 32, align: 32, offset: 4928)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1063, file: !14, line: 2563, baseType: !910, size: 32, align: 32, offset: 4960)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1063, file: !14, line: 2571, baseType: !1476, size: 64, align: 64, offset: 4992)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1063, file: !14, line: 2579, baseType: !1476, size: 64, align: 64, offset: 5056)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1063, file: !14, line: 2586, baseType: !910, size: 32, align: 32, offset: 5120)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1063, file: !14, line: 2615, baseType: !910, size: 32, align: 32, offset: 5152)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1063, file: !14, line: 2627, baseType: !910, size: 32, align: 32, offset: 5184)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1063, file: !14, line: 2637, baseType: !910, size: 32, align: 32, offset: 5216)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1063, file: !14, line: 2681, baseType: !910, size: 32, align: 32, offset: 5248)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1063, file: !14, line: 2709, baseType: !994, size: 64, align: 64, offset: 5312)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1063, file: !14, line: 2716, baseType: !1485, size: 64, align: 64, offset: 5376)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1487)
!1487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1488)
!1488 = !{!1489, !1490, !1491, !1492, !1493, !1494, !1498, !1502, !1506, !1507, !1508, !1509, !1515, !1516, !1517, !1518, !1519}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1487, file: !14, line: 3642, baseType: !938, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1487, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1487, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1487, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1487, file: !14, line: 3669, baseType: !910, size: 32, align: 32, offset: 160)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1487, file: !14, line: 3682, baseType: !1495, size: 64, align: 64, offset: 192)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{!910, !1061, !1083}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1487, file: !14, line: 3698, baseType: !1499, size: 64, align: 64, offset: 256)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DISubroutineType(types: !1501)
!1501 = !{!910, !1061, !912, !930}
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1487, file: !14, line: 3712, baseType: !1503, size: 64, align: 64, offset: 320)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DISubroutineType(types: !1505)
!1505 = !{!910, !1061, !910, !912, !930}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1487, file: !14, line: 3726, baseType: !1499, size: 64, align: 64, offset: 384)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1487, file: !14, line: 3737, baseType: !1058, size: 64, align: 64, offset: 448)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1487, file: !14, line: 3746, baseType: !910, size: 32, align: 32, offset: 512)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1487, file: !14, line: 3757, baseType: !1510, size: 64, align: 64, offset: 576)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DISubroutineType(types: !1512)
!1512 = !{null, !1513}
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1487, file: !14, line: 3766, baseType: !1058, size: 64, align: 64, offset: 640)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1487, file: !14, line: 3774, baseType: !1058, size: 64, align: 64, offset: 704)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1487, file: !14, line: 3780, baseType: !910, size: 32, align: 32, offset: 768)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1487, file: !14, line: 3785, baseType: !910, size: 32, align: 32, offset: 800)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1487, file: !14, line: 3795, baseType: !1520, size: 64, align: 64, offset: 832)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DISubroutineType(types: !1522)
!1522 = !{!910, !1061, !1121}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1063, file: !14, line: 2728, baseType: !980, size: 64, align: 64, offset: 5440)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1063, file: !14, line: 2735, baseType: !1111, size: 512, align: 64, offset: 5504)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1063, file: !14, line: 2742, baseType: !910, size: 32, align: 32, offset: 6016)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1063, file: !14, line: 2755, baseType: !910, size: 32, align: 32, offset: 6048)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1063, file: !14, line: 2776, baseType: !910, size: 32, align: 32, offset: 6080)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1063, file: !14, line: 2783, baseType: !910, size: 32, align: 32, offset: 6112)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1063, file: !14, line: 2791, baseType: !910, size: 32, align: 32, offset: 6144)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1063, file: !14, line: 2802, baseType: !1083, size: 64, align: 64, offset: 6208)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1063, file: !14, line: 2811, baseType: !910, size: 32, align: 32, offset: 6272)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1063, file: !14, line: 2821, baseType: !910, size: 32, align: 32, offset: 6304)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1063, file: !14, line: 2830, baseType: !910, size: 32, align: 32, offset: 6336)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1063, file: !14, line: 2840, baseType: !910, size: 32, align: 32, offset: 6368)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1063, file: !14, line: 2851, baseType: !1536, size: 64, align: 64, offset: 6400)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DISubroutineType(types: !1538)
!1538 = !{!910, !1350, !1539, !980, !1353, !910, !910}
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64, align: 64)
!1540 = !DISubroutineType(types: !1541)
!1541 = !{!910, !1350, !980}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1063, file: !14, line: 2871, baseType: !1543, size: 64, align: 64, offset: 6464)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DISubroutineType(types: !1545)
!1545 = !{!910, !1350, !1546, !980, !1353, !910}
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DISubroutineType(types: !1548)
!1548 = !{!910, !1350, !980, !910, !910}
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1063, file: !14, line: 2878, baseType: !910, size: 32, align: 32, offset: 6528)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1063, file: !14, line: 2885, baseType: !910, size: 32, align: 32, offset: 6560)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1063, file: !14, line: 3005, baseType: !910, size: 32, align: 32, offset: 6592)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1063, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1063, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1063, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1063, file: !14, line: 3037, baseType: !1089, size: 64, align: 64, offset: 6720)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1063, file: !14, line: 3038, baseType: !910, size: 32, align: 32, offset: 6784)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1063, file: !14, line: 3050, baseType: !966, size: 64, align: 64, offset: 6848)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1063, file: !14, line: 3065, baseType: !910, size: 32, align: 32, offset: 6912)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1063, file: !14, line: 3083, baseType: !910, size: 32, align: 32, offset: 6944)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1063, file: !14, line: 3092, baseType: !948, size: 64, align: 32, offset: 6976)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1063, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1063, file: !14, line: 3106, baseType: !948, size: 64, align: 32, offset: 7072)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1063, file: !14, line: 3113, baseType: !1564, size: 64, align: 64, offset: 7168)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1566)
!1566 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1567)
!1567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1568)
!1568 = !{!1569, !1570, !1571, !1572, !1573, !1574, !1577}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1567, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1567, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1567, file: !14, line: 720, baseType: !938, size: 64, align: 64, offset: 64)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1567, file: !14, line: 724, baseType: !938, size: 64, align: 64, offset: 128)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1567, file: !14, line: 728, baseType: !910, size: 32, align: 32, offset: 192)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1567, file: !14, line: 734, baseType: !1575, size: 64, align: 64, offset: 256)
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1576, size: 64, align: 64)
!1576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1567, file: !14, line: 739, baseType: !1578, size: 64, align: 64, offset: 320)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64, align: 64)
!1579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1049)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1063, file: !14, line: 3129, baseType: !994, size: 64, align: 64, offset: 7232)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1063, file: !14, line: 3130, baseType: !994, size: 64, align: 64, offset: 7296)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1063, file: !14, line: 3131, baseType: !994, size: 64, align: 64, offset: 7360)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1063, file: !14, line: 3132, baseType: !994, size: 64, align: 64, offset: 7424)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1063, file: !14, line: 3139, baseType: !1476, size: 64, align: 64, offset: 7488)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1063, file: !14, line: 3147, baseType: !910, size: 32, align: 32, offset: 7552)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1063, file: !14, line: 3165, baseType: !910, size: 32, align: 32, offset: 7584)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1063, file: !14, line: 3172, baseType: !910, size: 32, align: 32, offset: 7616)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1063, file: !14, line: 3180, baseType: !910, size: 32, align: 32, offset: 7648)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1063, file: !14, line: 3191, baseType: !1390, size: 64, align: 64, offset: 7680)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1063, file: !14, line: 3199, baseType: !1089, size: 64, align: 64, offset: 7744)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1063, file: !14, line: 3207, baseType: !1476, size: 64, align: 64, offset: 7808)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1063, file: !14, line: 3214, baseType: !911, size: 32, align: 32, offset: 7872)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1063, file: !14, line: 3224, baseType: !1219, size: 64, align: 64, offset: 7936)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1063, file: !14, line: 3225, baseType: !910, size: 32, align: 32, offset: 8000)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1063, file: !14, line: 3249, baseType: !1121, size: 64, align: 64, offset: 8064)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1063, file: !14, line: 3256, baseType: !910, size: 32, align: 32, offset: 8128)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1063, file: !14, line: 3271, baseType: !910, size: 32, align: 32, offset: 8160)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1063, file: !14, line: 3279, baseType: !994, size: 64, align: 64, offset: 8192)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1063, file: !14, line: 3301, baseType: !1121, size: 64, align: 64, offset: 8256)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1063, file: !14, line: 3310, baseType: !910, size: 32, align: 32, offset: 8320)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1063, file: !14, line: 3337, baseType: !910, size: 32, align: 32, offset: 8352)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1063, file: !14, line: 3351, baseType: !910, size: 32, align: 32, offset: 8384)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1063, file: !14, line: 3359, baseType: !910, size: 32, align: 32, offset: 8416)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !935, file: !14, line: 3535, baseType: !1605, size: 64, align: 64, offset: 1024)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DISubroutineType(types: !1607)
!1607 = !{!910, !1061, !1608}
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1062)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !935, file: !14, line: 3541, baseType: !1611, size: 64, align: 64, offset: 1088)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1613)
!1613 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1614)
!1614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1077, line: 223, size: 128, align: 64, elements: !1615)
!1615 = !{!1616, !1617}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1614, file: !1077, line: 224, baseType: !912, size: 64, align: 64)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1614, file: !1077, line: 225, baseType: !912, size: 64, align: 64, offset: 64)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !935, file: !14, line: 3549, baseType: !1619, size: 64, align: 64, offset: 1152)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DISubroutineType(types: !1621)
!1621 = !{null, !1056}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !935, file: !14, line: 3551, baseType: !1058, size: 64, align: 64, offset: 1216)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !935, file: !14, line: 3552, baseType: !1624, size: 64, align: 64, offset: 1280)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DISubroutineType(types: !1626)
!1626 = !{!910, !1061, !1089, !910, !1627}
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64, align: 64)
!1628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1629)
!1629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1630)
!1630 = !{!1631, !1632, !1633, !1634, !1635, !1659}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1629, file: !14, line: 3921, baseType: !923, size: 16, align: 16)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1629, file: !14, line: 3922, baseType: !930, size: 32, align: 32, offset: 32)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1629, file: !14, line: 3923, baseType: !930, size: 32, align: 32, offset: 64)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1629, file: !14, line: 3924, baseType: !911, size: 32, align: 32, offset: 96)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1629, file: !14, line: 3925, baseType: !1636, size: 64, align: 64, offset: 128)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1639)
!1639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1640)
!1640 = !{!1641, !1642, !1643, !1644, !1645, !1646, !1652, !1654, !1655, !1656, !1657, !1658}
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1639, file: !14, line: 3886, baseType: !910, size: 32, align: 32)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1639, file: !14, line: 3887, baseType: !910, size: 32, align: 32, offset: 32)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1639, file: !14, line: 3888, baseType: !910, size: 32, align: 32, offset: 64)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1639, file: !14, line: 3889, baseType: !910, size: 32, align: 32, offset: 96)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1639, file: !14, line: 3890, baseType: !910, size: 32, align: 32, offset: 128)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1639, file: !14, line: 3897, baseType: !1647, size: 768, align: 64, offset: 192)
!1647 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1648)
!1648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1649)
!1649 = !{!1650, !1651}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1648, file: !14, line: 3855, baseType: !1088, size: 512, align: 64)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1648, file: !14, line: 3857, baseType: !1093, size: 256, align: 32, offset: 512)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1639, file: !14, line: 3903, baseType: !1653, size: 256, align: 64, offset: 960)
!1653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1089, size: 256, align: 64, elements: !1190)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1639, file: !14, line: 3904, baseType: !1197, size: 128, align: 32, offset: 1216)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1639, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1639, file: !14, line: 3908, baseType: !1476, size: 64, align: 64, offset: 1408)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1639, file: !14, line: 3915, baseType: !1476, size: 64, align: 64, offset: 1472)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1639, file: !14, line: 3917, baseType: !910, size: 32, align: 32, offset: 1536)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1629, file: !14, line: 3926, baseType: !994, size: 64, align: 64, offset: 192)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !935, file: !14, line: 3564, baseType: !1661, size: 64, align: 64, offset: 1344)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64, align: 64)
!1662 = !DISubroutineType(types: !1663)
!1663 = !{!910, !1061, !1207, !1351, !1353}
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !935, file: !14, line: 3566, baseType: !1665, size: 64, align: 64, offset: 1408)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DISubroutineType(types: !1667)
!1667 = !{!910, !1061, !980, !1353, !1207}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !935, file: !14, line: 3567, baseType: !1058, size: 64, align: 64, offset: 1472)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !935, file: !14, line: 3576, baseType: !1670, size: 64, align: 64, offset: 1536)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{!910, !1061, !1351}
