; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mpeg4video_parser.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mpeg4video_parser.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecParserContext = type { i8*, %struct.AVCodecParser*, i64, i64, i64, i32, i32, i64, i64, i64, i64, i32, i32, [4 x i64], [4 x i64], [4 x i64], i32, i64, [4 x i64], i32, i64, i32, i32, i32, [4 x i64], i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!864 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!865 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !531, line: 493, size: 32, align: 32, elements: !866)
!866 = !{!867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!867 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!868 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!869 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!870 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!871 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!872 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!873 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!874 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!875 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!876 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!877 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!878 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!879 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!880 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!881 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!882 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!883 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !531, line: 538, size: 32, align: 32, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892, !893}
!886 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!887 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!888 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!889 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!890 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!891 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!892 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!893 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902, !903, !904, !905}
!896 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!897 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!898 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!906 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OutputFormat", file: !907, line: 123, size: 32, align: 32, elements: !908)
!907 = !DIFile(filename: "libavcodec/mpegutils.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!908 = !{!909, !910, !911, !912}
!909 = !DIEnumerator(name: "FMT_MPEG1", value: 0)
!910 = !DIEnumerator(name: "FMT_H261", value: 1)
!911 = !DIEnumerator(name: "FMT_H263", value: 2)
!912 = !DIEnumerator(name: "FMT_MJPEG", value: 3)
!913 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !914, line: 37, size: 32, align: 32, elements: !915)
!914 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!915 = !{!916, !917, !918, !919, !920, !921}
!916 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!917 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!918 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!919 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!920 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!921 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!922 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !923)
!923 = !{!924, !925, !926, !927, !928, !929, !930}
!924 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!925 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!926 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!927 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!928 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!929 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!930 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!931 = !{!932, !933}
!932 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!933 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!934 = !{!935}
!935 = distinct !DIGlobalVariable(name: "ff_mpeg4video_parser", scope: !0, file: !936, line: 156, type: !937, isLocal: false, isDefinition: true, variable: { [5 x i32], i32, i32 (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecParserContext*, %struct.AVCodecContext*, i8**, i32*, i8*, i32)*, void (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecContext*, i8*, i32)*, %struct.AVCodecParser* }* @ff_mpeg4video_parser)
!936 = !DIFile(filename: "libavcodec/mpeg4video_parser.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParser", file: !4, line: 5272, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParser", file: !4, line: 5259, size: 512, align: 64, elements: !939)
!939 = !{!940, !944, !945, !997, !2650, !2654, !2658}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !938, file: !4, line: 5260, baseType: !941, size: 160, align: 32)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 160, align: 32, elements: !942)
!942 = !{!943}
!943 = !DISubrange(count: 5)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !938, file: !4, line: 5261, baseType: !932, size: 32, align: 32, offset: 160)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "parser_init", scope: !938, file: !4, line: 5262, baseType: !946, size: 64, align: 64, offset: 192)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!932, !949}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParserContext", file: !4, line: 5257, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParserContext", file: !4, line: 5092, size: 2816, align: 64, elements: !952)
!952 = !{!953, !955, !957, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !951, file: !4, line: 5093, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !951, file: !4, line: 5094, baseType: !956, size: 64, align: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !951, file: !4, line: 5095, baseType: !958, size: 64, align: 64, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !959, line: 40, baseType: !960)
!959 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!960 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "cur_offset", scope: !951, file: !4, line: 5096, baseType: !958, size: 64, align: 64, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame_offset", scope: !951, file: !4, line: 5098, baseType: !958, size: 64, align: 64, offset: 256)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !951, file: !4, line: 5100, baseType: !932, size: 32, align: 32, offset: 320)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !951, file: !4, line: 5110, baseType: !932, size: 32, align: 32, offset: 352)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !951, file: !4, line: 5111, baseType: !958, size: 64, align: 64, offset: 384)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !951, file: !4, line: 5112, baseType: !958, size: 64, align: 64, offset: 448)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "last_pts", scope: !951, file: !4, line: 5115, baseType: !958, size: 64, align: 64, offset: 512)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "last_dts", scope: !951, file: !4, line: 5116, baseType: !958, size: 64, align: 64, offset: 576)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "fetch_timestamp", scope: !951, file: !4, line: 5117, baseType: !932, size: 32, align: 32, offset: 640)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_start_index", scope: !951, file: !4, line: 5120, baseType: !932, size: 32, align: 32, offset: 672)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_offset", scope: !951, file: !4, line: 5121, baseType: !972, size: 256, align: 64, offset: 704)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 256, align: 64, elements: !973)
!973 = !{!974}
!974 = !DISubrange(count: 4)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pts", scope: !951, file: !4, line: 5122, baseType: !972, size: 256, align: 64, offset: 960)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_dts", scope: !951, file: !4, line: 5123, baseType: !972, size: 256, align: 64, offset: 1216)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !951, file: !4, line: 5125, baseType: !932, size: 32, align: 32, offset: 1472)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !951, file: !4, line: 5132, baseType: !958, size: 64, align: 64, offset: 1536)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_end", scope: !951, file: !4, line: 5133, baseType: !972, size: 256, align: 64, offset: 1600)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !951, file: !4, line: 5141, baseType: !932, size: 32, align: 32, offset: 1856)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !951, file: !4, line: 5148, baseType: !958, size: 64, align: 64, offset: 1920)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "dts_sync_point", scope: !951, file: !4, line: 5161, baseType: !932, size: 32, align: 32, offset: 1984)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "dts_ref_dts_delta", scope: !951, file: !4, line: 5176, baseType: !932, size: 32, align: 32, offset: 2016)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "pts_dts_delta", scope: !951, file: !4, line: 5190, baseType: !932, size: 32, align: 32, offset: 2048)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pos", scope: !951, file: !4, line: 5197, baseType: !972, size: 256, align: 64, offset: 2112)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !951, file: !4, line: 5202, baseType: !958, size: 64, align: 64, offset: 2368)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !951, file: !4, line: 5207, baseType: !958, size: 64, align: 64, offset: 2432)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !951, file: !4, line: 5214, baseType: !932, size: 32, align: 32, offset: 2496)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !951, file: !4, line: 5216, baseType: !3, size: 32, align: 32, offset: 2528)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "picture_structure", scope: !951, file: !4, line: 5226, baseType: !12, size: 32, align: 32, offset: 2560)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "output_picture_number", scope: !951, file: !4, line: 5234, baseType: !932, size: 32, align: 32, offset: 2592)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !951, file: !4, line: 5239, baseType: !932, size: 32, align: 32, offset: 2624)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !951, file: !4, line: 5240, baseType: !932, size: 32, align: 32, offset: 2656)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !951, file: !4, line: 5245, baseType: !932, size: 32, align: 32, offset: 2688)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !951, file: !4, line: 5246, baseType: !932, size: 32, align: 32, offset: 2720)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !951, file: !4, line: 5256, baseType: !932, size: 32, align: 32, offset: 2752)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "parser_parse", scope: !938, file: !4, line: 5265, baseType: !998, size: 64, align: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!932, !949, !1001, !2649, !1325, !1150, !932}
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1004)
!1004 = !{!1005, !1087, !1088, !1089, !1355, !1356, !1357, !1358, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1511, !1515, !1516, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !2568, !2569, !2570, !2571, !2572, !2573, !2574, !2575, !2576, !2577, !2578, !2579, !2580, !2587, !2594, !2595, !2596, !2597, !2598, !2599, !2600, !2601, !2602, !2603, !2604, !2605, !2606, !2607, !2608, !2625, !2626, !2627, !2628, !2629, !2630, !2631, !2632, !2633, !2634, !2635, !2636, !2637, !2638, !2639, !2640, !2641, !2642, !2643, !2644, !2645, !2646, !2647, !2648}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1003, file: !4, line: 1561, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !41, line: 143, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !41, line: 67, size: 640, align: 64, elements: !1010)
!1010 = !{!1011, !1015, !1019, !1046, !1047, !1048, !1049, !1053, !1059, !1061, !1065}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1009, file: !41, line: 72, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1014)
!1014 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1009, file: !41, line: 78, baseType: !1016, size: 64, align: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!1012, !954}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1009, file: !41, line: 85, baseType: !1020, size: 64, align: 64, offset: 128)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !19, line: 246, size: 512, align: 64, elements: !1023)
!1023 = !{!1024, !1025, !1026, !1027, !1028, !1042, !1043, !1044, !1045}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1022, file: !19, line: 247, baseType: !1012, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1022, file: !19, line: 253, baseType: !1012, size: 64, align: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1022, file: !19, line: 259, baseType: !932, size: 32, align: 32, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1022, file: !19, line: 260, baseType: !18, size: 32, align: 32, offset: 160)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1022, file: !19, line: 271, baseType: !1029, size: 64, align: 64, offset: 192)
!1029 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1022, file: !19, line: 265, size: 64, align: 64, elements: !1030)
!1030 = !{!1031, !1032, !1034, !1035}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1029, file: !19, line: 266, baseType: !958, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1029, file: !19, line: 267, baseType: !1033, size: 64, align: 64)
!1033 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1029, file: !19, line: 268, baseType: !1012, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1029, file: !19, line: 270, baseType: !1036, size: 64, align: 32)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1037, line: 61, baseType: !1038)
!1037 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1037, line: 58, size: 64, align: 32, elements: !1039)
!1039 = !{!1040, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1038, file: !1037, line: 59, baseType: !932, size: 32, align: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1038, file: !1037, line: 60, baseType: !932, size: 32, align: 32, offset: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1022, file: !19, line: 272, baseType: !1033, size: 64, align: 64, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1022, file: !19, line: 273, baseType: !1033, size: 64, align: 64, offset: 320)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1022, file: !19, line: 275, baseType: !932, size: 32, align: 32, offset: 384)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1022, file: !19, line: 300, baseType: !1012, size: 64, align: 64, offset: 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1009, file: !41, line: 93, baseType: !932, size: 32, align: 32, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1009, file: !41, line: 99, baseType: !932, size: 32, align: 32, offset: 224)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1009, file: !41, line: 108, baseType: !932, size: 32, align: 32, offset: 256)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1009, file: !41, line: 113, baseType: !1050, size: 64, align: 64, offset: 320)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!954, !954, !954}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1009, file: !41, line: 123, baseType: !1054, size: 64, align: 64, offset: 384)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!1057, !1057}
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1009, file: !41, line: 130, baseType: !1060, size: 32, align: 32, offset: 448)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !41, line: 48, baseType: !40)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1009, file: !41, line: 136, baseType: !1062, size: 64, align: 64, offset: 512)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!1060, !954}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1009, file: !41, line: 142, baseType: !1066, size: 64, align: 64, offset: 576)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!932, !1069, !954, !1012, !932}
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !19, line: 329, size: 128, align: 64, elements: !1072)
!1072 = !{!1073, !1085, !1086}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1071, file: !19, line: 360, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !19, line: 324, baseType: !1077)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !19, line: 306, size: 384, align: 64, elements: !1078)
!1078 = !{!1079, !1080, !1081, !1082, !1083, !1084}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1077, file: !19, line: 307, baseType: !1012, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1077, file: !19, line: 313, baseType: !1033, size: 64, align: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1077, file: !19, line: 313, baseType: !1033, size: 64, align: 64, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1077, file: !19, line: 318, baseType: !1033, size: 64, align: 64, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1077, file: !19, line: 318, baseType: !1033, size: 64, align: 64, offset: 256)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1077, file: !19, line: 323, baseType: !932, size: 32, align: 32, offset: 320)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1071, file: !19, line: 364, baseType: !932, size: 32, align: 32, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1071, file: !19, line: 368, baseType: !932, size: 32, align: 32, offset: 96)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1003, file: !4, line: 1562, baseType: !932, size: 32, align: 32, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1003, file: !4, line: 1564, baseType: !61, size: 32, align: 32, offset: 96)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1003, file: !4, line: 1565, baseType: !1090, size: 64, align: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1093)
!1093 = !{!1094, !1095, !1096, !1097, !1098, !1099, !1102, !1105, !1108, !1111, !1116, !1119, !1120, !1128, !1129, !1130, !1132, !1136, !1142, !1153, !1157, !1158, !1205, !1326, !1330, !1331, !1335, !1339, !1344, !1348, !1349, !1350}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1092, file: !4, line: 3475, baseType: !1012, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1092, file: !4, line: 3480, baseType: !1012, size: 64, align: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1092, file: !4, line: 3481, baseType: !61, size: 32, align: 32, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1092, file: !4, line: 3482, baseType: !71, size: 32, align: 32, offset: 160)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1092, file: !4, line: 3487, baseType: !932, size: 32, align: 32, offset: 192)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1092, file: !4, line: 3488, baseType: !1100, size: 64, align: 64, offset: 256)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1092, file: !4, line: 3489, baseType: !1103, size: 64, align: 64, offset: 320)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !530)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1092, file: !4, line: 3490, baseType: !1106, size: 64, align: 64, offset: 384)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1092, file: !4, line: 3491, baseType: !1109, size: 64, align: 64, offset: 448)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !730)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1092, file: !4, line: 3492, baseType: !1112, size: 64, align: 64, offset: 512)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1114)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !959, line: 55, baseType: !1115)
!1115 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1092, file: !4, line: 3493, baseType: !1117, size: 8, align: 8, offset: 576)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !959, line: 48, baseType: !1118)
!1118 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1092, file: !4, line: 3494, baseType: !1006, size: 64, align: 64, offset: 640)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1092, file: !4, line: 3495, baseType: !1121, size: 64, align: 64, offset: 704)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1123)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1124)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1125)
!1125 = !{!1126, !1127}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1124, file: !4, line: 3402, baseType: !932, size: 32, align: 32)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1124, file: !4, line: 3403, baseType: !1012, size: 64, align: 64, offset: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1092, file: !4, line: 3507, baseType: !1012, size: 64, align: 64, offset: 768)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1092, file: !4, line: 3516, baseType: !932, size: 32, align: 32, offset: 832)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1092, file: !4, line: 3517, baseType: !1131, size: 64, align: 64, offset: 896)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1092, file: !4, line: 3527, baseType: !1133, size: 64, align: 64, offset: 960)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!932, !1001}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1092, file: !4, line: 3535, baseType: !1137, size: 64, align: 64, offset: 1024)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!932, !1001, !1140}
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1092, file: !4, line: 3541, baseType: !1143, size: 64, align: 64, offset: 1088)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1145)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1147, line: 223, size: 128, align: 64, elements: !1148)
!1147 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1148 = !{!1149, !1152}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1146, file: !1147, line: 224, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1117)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1146, file: !1147, line: 225, baseType: !1150, size: 64, align: 64, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1092, file: !4, line: 3549, baseType: !1154, size: 64, align: 64, offset: 1152)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{null, !1131}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1092, file: !4, line: 3551, baseType: !1133, size: 64, align: 64, offset: 1216)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1092, file: !4, line: 3552, baseType: !1159, size: 64, align: 64, offset: 1280)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!932, !1001, !1162, !932, !1163}
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1166)
!1166 = !{!1167, !1170, !1172, !1173, !1174, !1204}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1165, file: !4, line: 3921, baseType: !1168, size: 16, align: 16)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !959, line: 49, baseType: !1169)
!1169 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1165, file: !4, line: 3922, baseType: !1171, size: 32, align: 32, offset: 32)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !959, line: 51, baseType: !933)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1165, file: !4, line: 3923, baseType: !1171, size: 32, align: 32, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1165, file: !4, line: 3924, baseType: !933, size: 32, align: 32, offset: 96)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1165, file: !4, line: 3925, baseType: !1175, size: 64, align: 64, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1178)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1179)
!1179 = !{!1180, !1181, !1182, !1183, !1184, !1185, !1195, !1197, !1199, !1200, !1202, !1203}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1178, file: !4, line: 3886, baseType: !932, size: 32, align: 32)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1178, file: !4, line: 3887, baseType: !932, size: 32, align: 32, offset: 32)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1178, file: !4, line: 3888, baseType: !932, size: 32, align: 32, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1178, file: !4, line: 3889, baseType: !932, size: 32, align: 32, offset: 96)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1178, file: !4, line: 3890, baseType: !932, size: 32, align: 32, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1178, file: !4, line: 3897, baseType: !1186, size: 768, align: 64, offset: 192)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1187)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1188)
!1188 = !{!1189, !1193}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1187, file: !4, line: 3855, baseType: !1190, size: 512, align: 64)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1162, size: 512, align: 64, elements: !1191)
!1191 = !{!1192}
!1192 = !DISubrange(count: 8)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1187, file: !4, line: 3857, baseType: !1194, size: 256, align: 32, offset: 512)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 256, align: 32, elements: !1191)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1178, file: !4, line: 3903, baseType: !1196, size: 256, align: 64, offset: 960)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1162, size: 256, align: 64, elements: !973)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1178, file: !4, line: 3904, baseType: !1198, size: 128, align: 32, offset: 1216)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 128, align: 32, elements: !973)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1178, file: !4, line: 3906, baseType: !747, size: 32, align: 32, offset: 1344)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1178, file: !4, line: 3908, baseType: !1201, size: 64, align: 64, offset: 1408)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1178, file: !4, line: 3915, baseType: !1201, size: 64, align: 64, offset: 1472)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1178, file: !4, line: 3917, baseType: !932, size: 32, align: 32, offset: 1536)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1165, file: !4, line: 3926, baseType: !958, size: 64, align: 64, offset: 192)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1092, file: !4, line: 3564, baseType: !1206, size: 64, align: 64, offset: 1344)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!932, !1001, !1209, !1243, !1325}
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1212)
!1212 = !{!1213, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1239, !1240, !1241, !1242}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1211, file: !4, line: 1451, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1216, line: 94, baseType: !1217)
!1216 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1216, line: 81, size: 192, align: 64, elements: !1218)
!1218 = !{!1219, !1223, !1224}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1217, file: !1216, line: 82, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1216, line: 73, baseType: !1222)
!1222 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1216, line: 73, flags: DIFlagFwdDecl)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1217, file: !1216, line: 89, baseType: !1162, size: 64, align: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1217, file: !1216, line: 93, baseType: !932, size: 32, align: 32, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1211, file: !4, line: 1461, baseType: !958, size: 64, align: 64, offset: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1211, file: !4, line: 1467, baseType: !958, size: 64, align: 64, offset: 128)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1211, file: !4, line: 1468, baseType: !1162, size: 64, align: 64, offset: 192)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1211, file: !4, line: 1469, baseType: !932, size: 32, align: 32, offset: 256)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1211, file: !4, line: 1470, baseType: !932, size: 32, align: 32, offset: 288)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1211, file: !4, line: 1474, baseType: !932, size: 32, align: 32, offset: 320)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1211, file: !4, line: 1479, baseType: !1232, size: 64, align: 64, offset: 384)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1235)
!1235 = !{!1236, !1237, !1238}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1234, file: !4, line: 1412, baseType: !1162, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1234, file: !4, line: 1413, baseType: !932, size: 32, align: 32, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1234, file: !4, line: 1414, baseType: !753, size: 32, align: 32, offset: 96)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1211, file: !4, line: 1480, baseType: !932, size: 32, align: 32, offset: 448)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1211, file: !4, line: 1486, baseType: !958, size: 64, align: 64, offset: 512)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1211, file: !4, line: 1488, baseType: !958, size: 64, align: 64, offset: 576)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1211, file: !4, line: 1497, baseType: !958, size: 64, align: 64, offset: 640)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1245)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !794, line: 646, baseType: !1246)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !794, line: 268, size: 4288, align: 64, elements: !1247)
!1247 = !{!1248, !1249, !1250, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1277, !1279, !1280, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1313, !1314, !1315, !1316, !1317, !1318, !1321, !1322, !1323, !1324}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1246, file: !794, line: 282, baseType: !1190, size: 512, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1246, file: !794, line: 299, baseType: !1194, size: 256, align: 32, offset: 512)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1246, file: !794, line: 315, baseType: !1251, size: 64, align: 64, offset: 768)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1246, file: !794, line: 326, baseType: !932, size: 32, align: 32, offset: 832)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1246, file: !794, line: 326, baseType: !932, size: 32, align: 32, offset: 864)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1246, file: !794, line: 334, baseType: !932, size: 32, align: 32, offset: 896)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1246, file: !794, line: 341, baseType: !932, size: 32, align: 32, offset: 928)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1246, file: !794, line: 346, baseType: !932, size: 32, align: 32, offset: 960)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1246, file: !794, line: 351, baseType: !783, size: 32, align: 32, offset: 992)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1246, file: !794, line: 356, baseType: !1036, size: 64, align: 32, offset: 1024)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1246, file: !794, line: 361, baseType: !958, size: 64, align: 64, offset: 1088)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1246, file: !794, line: 369, baseType: !958, size: 64, align: 64, offset: 1152)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1246, file: !794, line: 377, baseType: !958, size: 64, align: 64, offset: 1216)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1246, file: !794, line: 382, baseType: !932, size: 32, align: 32, offset: 1280)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1246, file: !794, line: 386, baseType: !932, size: 32, align: 32, offset: 1312)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1246, file: !794, line: 391, baseType: !932, size: 32, align: 32, offset: 1344)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1246, file: !794, line: 396, baseType: !954, size: 64, align: 64, offset: 1408)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1246, file: !794, line: 403, baseType: !1267, size: 512, align: 64, offset: 1472)
!1267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1114, size: 512, align: 64, elements: !1191)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1246, file: !794, line: 410, baseType: !932, size: 32, align: 32, offset: 1984)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1246, file: !794, line: 415, baseType: !932, size: 32, align: 32, offset: 2016)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1246, file: !794, line: 420, baseType: !932, size: 32, align: 32, offset: 2048)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1246, file: !794, line: 425, baseType: !932, size: 32, align: 32, offset: 2080)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1246, file: !794, line: 435, baseType: !958, size: 64, align: 64, offset: 2112)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1246, file: !794, line: 440, baseType: !932, size: 32, align: 32, offset: 2176)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1246, file: !794, line: 445, baseType: !1114, size: 64, align: 64, offset: 2240)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1246, file: !794, line: 459, baseType: !1276, size: 512, align: 64, offset: 2304)
!1276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1214, size: 512, align: 64, elements: !1191)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1246, file: !794, line: 473, baseType: !1278, size: 64, align: 64, offset: 2816)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1246, file: !794, line: 477, baseType: !932, size: 32, align: 32, offset: 2880)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1246, file: !794, line: 479, baseType: !1281, size: 64, align: 64, offset: 2944)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !794, line: 207, baseType: !1284)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !794, line: 201, size: 320, align: 64, elements: !1285)
!1285 = !{!1286, !1287, !1288, !1289, !1294}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1284, file: !794, line: 202, baseType: !793, size: 32, align: 32)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1284, file: !794, line: 203, baseType: !1162, size: 64, align: 64, offset: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1284, file: !794, line: 204, baseType: !932, size: 32, align: 32, offset: 128)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1284, file: !794, line: 205, baseType: !1290, size: 64, align: 64, offset: 192)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1292, line: 86, baseType: !1293)
!1292 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1293 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1292, line: 86, flags: DIFlagFwdDecl)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1284, file: !794, line: 206, baseType: !1214, size: 64, align: 64, offset: 256)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1246, file: !794, line: 480, baseType: !932, size: 32, align: 32, offset: 3008)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1246, file: !794, line: 505, baseType: !932, size: 32, align: 32, offset: 3040)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1246, file: !794, line: 512, baseType: !817, size: 32, align: 32, offset: 3072)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1246, file: !794, line: 514, baseType: !823, size: 32, align: 32, offset: 3104)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1246, file: !794, line: 516, baseType: !841, size: 32, align: 32, offset: 3136)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1246, file: !794, line: 523, baseType: !865, size: 32, align: 32, offset: 3168)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1246, file: !794, line: 525, baseType: !884, size: 32, align: 32, offset: 3200)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1246, file: !794, line: 532, baseType: !958, size: 64, align: 64, offset: 3264)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1246, file: !794, line: 539, baseType: !958, size: 64, align: 64, offset: 3328)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1246, file: !794, line: 547, baseType: !958, size: 64, align: 64, offset: 3392)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1246, file: !794, line: 554, baseType: !1290, size: 64, align: 64, offset: 3456)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1246, file: !794, line: 563, baseType: !932, size: 32, align: 32, offset: 3520)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1246, file: !794, line: 572, baseType: !932, size: 32, align: 32, offset: 3552)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1246, file: !794, line: 581, baseType: !932, size: 32, align: 32, offset: 3584)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1246, file: !794, line: 588, baseType: !1310, size: 64, align: 64, offset: 3648)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !959, line: 36, baseType: !1312)
!1312 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1246, file: !794, line: 593, baseType: !932, size: 32, align: 32, offset: 3712)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1246, file: !794, line: 596, baseType: !932, size: 32, align: 32, offset: 3744)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1246, file: !794, line: 599, baseType: !1214, size: 64, align: 64, offset: 3776)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1246, file: !794, line: 605, baseType: !1214, size: 64, align: 64, offset: 3840)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1246, file: !794, line: 616, baseType: !1214, size: 64, align: 64, offset: 3904)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1246, file: !794, line: 626, baseType: !1319, size: 64, align: 64, offset: 3968)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1320, line: 216, baseType: !1115)
!1320 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1246, file: !794, line: 627, baseType: !1319, size: 64, align: 64, offset: 4032)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1246, file: !794, line: 628, baseType: !1319, size: 64, align: 64, offset: 4096)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1246, file: !794, line: 629, baseType: !1319, size: 64, align: 64, offset: 4160)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1246, file: !794, line: 645, baseType: !1214, size: 64, align: 64, offset: 4224)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1092, file: !4, line: 3566, baseType: !1327, size: 64, align: 64, offset: 1408)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!932, !1001, !954, !1325, !1209}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1092, file: !4, line: 3567, baseType: !1133, size: 64, align: 64, offset: 1472)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1092, file: !4, line: 3576, baseType: !1332, size: 64, align: 64, offset: 1536)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!932, !1001, !1243}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1092, file: !4, line: 3577, baseType: !1336, size: 64, align: 64, offset: 1600)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{!932, !1001, !1209}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1092, file: !4, line: 3584, baseType: !1340, size: 64, align: 64, offset: 1664)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{!932, !1001, !1343}
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1092, file: !4, line: 3589, baseType: !1345, size: 64, align: 64, offset: 1728)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DISubroutineType(types: !1347)
!1347 = !{null, !1001}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1092, file: !4, line: 3594, baseType: !932, size: 32, align: 32, offset: 1792)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1092, file: !4, line: 3600, baseType: !1012, size: 64, align: 64, offset: 1856)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1092, file: !4, line: 3609, baseType: !1351, size: 64, align: 64, offset: 1920)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1354)
!1354 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1003, file: !4, line: 1566, baseType: !71, size: 32, align: 32, offset: 192)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1003, file: !4, line: 1581, baseType: !933, size: 32, align: 32, offset: 224)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1003, file: !4, line: 1583, baseType: !954, size: 64, align: 64, offset: 256)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1003, file: !4, line: 1591, baseType: !1359, size: 64, align: 64, offset: 320)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1147, line: 129, size: 1664, align: 64, elements: !1361)
!1361 = !{!1362, !1363, !1364, !1365, !1366, !1384, !1385, !1391, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1360, file: !1147, line: 136, baseType: !932, size: 32, align: 32)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1360, file: !1147, line: 151, baseType: !932, size: 32, align: 32, offset: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1360, file: !1147, line: 157, baseType: !932, size: 32, align: 32, offset: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1360, file: !1147, line: 159, baseType: !1343, size: 64, align: 64, offset: 128)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1360, file: !1147, line: 161, baseType: !1367, size: 64, align: 64, offset: 192)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1147, line: 117, baseType: !1369)
!1369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1147, line: 100, size: 832, align: 64, elements: !1370)
!1370 = !{!1371, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1369, file: !1147, line: 105, baseType: !1372, size: 256, align: 64)
!1372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1373, size: 256, align: 64, elements: !973)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1216, line: 238, baseType: !1375)
!1375 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1216, line: 238, flags: DIFlagFwdDecl)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1369, file: !1147, line: 110, baseType: !932, size: 32, align: 32, offset: 256)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1369, file: !1147, line: 111, baseType: !932, size: 32, align: 32, offset: 288)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1369, file: !1147, line: 111, baseType: !932, size: 32, align: 32, offset: 320)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1369, file: !1147, line: 112, baseType: !1194, size: 256, align: 32, offset: 352)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1369, file: !1147, line: 113, baseType: !1198, size: 128, align: 32, offset: 608)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1369, file: !1147, line: 114, baseType: !932, size: 32, align: 32, offset: 736)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1369, file: !1147, line: 115, baseType: !932, size: 32, align: 32, offset: 768)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1369, file: !1147, line: 116, baseType: !932, size: 32, align: 32, offset: 800)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1360, file: !1147, line: 163, baseType: !954, size: 64, align: 64, offset: 256)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1360, file: !1147, line: 165, baseType: !1386, size: 128, align: 64, offset: 320)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1147, line: 122, baseType: !1387)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1147, line: 119, size: 128, align: 64, elements: !1388)
!1388 = !{!1389, !1390}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1387, file: !1147, line: 120, baseType: !1209, size: 64, align: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1387, file: !1147, line: 121, baseType: !1343, size: 64, align: 64, offset: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1360, file: !1147, line: 166, baseType: !1392, size: 128, align: 64, offset: 448)
!1392 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1147, line: 127, baseType: !1393)
!1393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1147, line: 124, size: 128, align: 64, elements: !1394)
!1394 = !{!1395, !1468}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1393, file: !1147, line: 125, baseType: !1396, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !1399)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !1400)
!1400 = !{!1401, !1402, !1426, !1430, !1431, !1465, !1466, !1467}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1399, file: !4, line: 5751, baseType: !1006, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1399, file: !4, line: 5756, baseType: !1403, size: 64, align: 64, offset: 64)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1405)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !1406)
!1406 = !{!1407, !1408, !1411, !1412, !1413, !1417, !1421, !1425}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1405, file: !4, line: 5797, baseType: !1012, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1405, file: !4, line: 5804, baseType: !1409, size: 64, align: 64, offset: 64)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1405, file: !4, line: 5815, baseType: !1006, size: 64, align: 64, offset: 128)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1405, file: !4, line: 5825, baseType: !932, size: 32, align: 32, offset: 192)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1405, file: !4, line: 5826, baseType: !1414, size: 64, align: 64, offset: 256)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{!932, !1397}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1405, file: !4, line: 5827, baseType: !1418, size: 64, align: 64, offset: 320)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DISubroutineType(types: !1420)
!1420 = !{!932, !1397, !1209}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1405, file: !4, line: 5828, baseType: !1422, size: 64, align: 64, offset: 384)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{null, !1397}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1405, file: !4, line: 5829, baseType: !1422, size: 64, align: 64, offset: 448)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1399, file: !4, line: 5762, baseType: !1427, size: 64, align: 64, offset: 128)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !1429)
!1429 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1399, file: !4, line: 5768, baseType: !954, size: 64, align: 64, offset: 192)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1399, file: !4, line: 5775, baseType: !1432, size: 64, align: 64, offset: 256)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !1434)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !1435)
!1435 = !{!1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1434, file: !4, line: 3940, baseType: !61, size: 32, align: 32)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1434, file: !4, line: 3944, baseType: !71, size: 32, align: 32, offset: 32)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1434, file: !4, line: 3948, baseType: !1171, size: 32, align: 32, offset: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1434, file: !4, line: 3958, baseType: !1162, size: 64, align: 64, offset: 128)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1434, file: !4, line: 3962, baseType: !932, size: 32, align: 32, offset: 192)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1434, file: !4, line: 3968, baseType: !932, size: 32, align: 32, offset: 224)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1434, file: !4, line: 3973, baseType: !958, size: 64, align: 64, offset: 256)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1434, file: !4, line: 3986, baseType: !932, size: 32, align: 32, offset: 320)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1434, file: !4, line: 3999, baseType: !932, size: 32, align: 32, offset: 352)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1434, file: !4, line: 4004, baseType: !932, size: 32, align: 32, offset: 384)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1434, file: !4, line: 4005, baseType: !932, size: 32, align: 32, offset: 416)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1434, file: !4, line: 4010, baseType: !932, size: 32, align: 32, offset: 448)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1434, file: !4, line: 4011, baseType: !932, size: 32, align: 32, offset: 480)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1434, file: !4, line: 4020, baseType: !1036, size: 64, align: 32, offset: 512)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1434, file: !4, line: 4025, baseType: !3, size: 32, align: 32, offset: 576)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1434, file: !4, line: 4030, baseType: !817, size: 32, align: 32, offset: 608)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1434, file: !4, line: 4031, baseType: !823, size: 32, align: 32, offset: 640)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1434, file: !4, line: 4032, baseType: !841, size: 32, align: 32, offset: 672)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1434, file: !4, line: 4033, baseType: !865, size: 32, align: 32, offset: 704)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1434, file: !4, line: 4034, baseType: !884, size: 32, align: 32, offset: 736)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1434, file: !4, line: 4039, baseType: !932, size: 32, align: 32, offset: 768)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1434, file: !4, line: 4046, baseType: !1114, size: 64, align: 64, offset: 832)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1434, file: !4, line: 4050, baseType: !932, size: 32, align: 32, offset: 896)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1434, file: !4, line: 4054, baseType: !932, size: 32, align: 32, offset: 928)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1434, file: !4, line: 4061, baseType: !932, size: 32, align: 32, offset: 960)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1434, file: !4, line: 4065, baseType: !932, size: 32, align: 32, offset: 992)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1434, file: !4, line: 4073, baseType: !932, size: 32, align: 32, offset: 1024)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1434, file: !4, line: 4080, baseType: !932, size: 32, align: 32, offset: 1056)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1434, file: !4, line: 4084, baseType: !932, size: 32, align: 32, offset: 1088)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1399, file: !4, line: 5781, baseType: !1432, size: 64, align: 64, offset: 320)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1399, file: !4, line: 5787, baseType: !1036, size: 64, align: 32, offset: 384)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1399, file: !4, line: 5793, baseType: !1036, size: 64, align: 32, offset: 448)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1393, file: !1147, line: 126, baseType: !932, size: 32, align: 32, offset: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1360, file: !1147, line: 172, baseType: !1209, size: 64, align: 64, offset: 576)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1360, file: !1147, line: 177, baseType: !1162, size: 64, align: 64, offset: 640)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1360, file: !1147, line: 178, baseType: !933, size: 32, align: 32, offset: 704)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1360, file: !1147, line: 180, baseType: !954, size: 64, align: 64, offset: 768)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1360, file: !1147, line: 185, baseType: !932, size: 32, align: 32, offset: 832)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1360, file: !1147, line: 190, baseType: !954, size: 64, align: 64, offset: 896)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1360, file: !1147, line: 195, baseType: !932, size: 32, align: 32, offset: 960)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1360, file: !1147, line: 200, baseType: !1209, size: 64, align: 64, offset: 1024)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1360, file: !1147, line: 201, baseType: !932, size: 32, align: 32, offset: 1088)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1360, file: !1147, line: 202, baseType: !1343, size: 64, align: 64, offset: 1152)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1360, file: !1147, line: 203, baseType: !932, size: 32, align: 32, offset: 1216)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1360, file: !1147, line: 205, baseType: !932, size: 32, align: 32, offset: 1248)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1360, file: !1147, line: 206, baseType: !932, size: 32, align: 32, offset: 1280)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1360, file: !1147, line: 209, baseType: !1319, size: 64, align: 64, offset: 1344)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1360, file: !1147, line: 212, baseType: !1319, size: 64, align: 64, offset: 1408)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1360, file: !1147, line: 213, baseType: !1343, size: 64, align: 64, offset: 1472)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1360, file: !1147, line: 215, baseType: !932, size: 32, align: 32, offset: 1536)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1360, file: !1147, line: 217, baseType: !932, size: 32, align: 32, offset: 1568)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1360, file: !1147, line: 220, baseType: !932, size: 32, align: 32, offset: 1600)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1003, file: !4, line: 1598, baseType: !954, size: 64, align: 64, offset: 384)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1003, file: !4, line: 1606, baseType: !958, size: 64, align: 64, offset: 448)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1003, file: !4, line: 1614, baseType: !932, size: 32, align: 32, offset: 512)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1003, file: !4, line: 1622, baseType: !932, size: 32, align: 32, offset: 544)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1003, file: !4, line: 1628, baseType: !932, size: 32, align: 32, offset: 576)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1003, file: !4, line: 1636, baseType: !932, size: 32, align: 32, offset: 608)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1003, file: !4, line: 1643, baseType: !932, size: 32, align: 32, offset: 640)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1003, file: !4, line: 1657, baseType: !1162, size: 64, align: 64, offset: 704)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1003, file: !4, line: 1658, baseType: !932, size: 32, align: 32, offset: 768)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1003, file: !4, line: 1679, baseType: !1036, size: 64, align: 32, offset: 800)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1003, file: !4, line: 1688, baseType: !932, size: 32, align: 32, offset: 864)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1003, file: !4, line: 1712, baseType: !932, size: 32, align: 32, offset: 896)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1003, file: !4, line: 1729, baseType: !932, size: 32, align: 32, offset: 928)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1003, file: !4, line: 1729, baseType: !932, size: 32, align: 32, offset: 960)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1003, file: !4, line: 1744, baseType: !932, size: 32, align: 32, offset: 992)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1003, file: !4, line: 1744, baseType: !932, size: 32, align: 32, offset: 1024)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1003, file: !4, line: 1751, baseType: !932, size: 32, align: 32, offset: 1056)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1003, file: !4, line: 1766, baseType: !530, size: 32, align: 32, offset: 1088)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1003, file: !4, line: 1791, baseType: !1507, size: 64, align: 64, offset: 1152)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DISubroutineType(types: !1509)
!1509 = !{null, !1510, !1243, !1325, !932, !932, !932}
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1003, file: !4, line: 1808, baseType: !1512, size: 64, align: 64, offset: 1216)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64, align: 64)
!1513 = !DISubroutineType(types: !1514)
!1514 = !{!530, !1510, !1103}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1003, file: !4, line: 1816, baseType: !932, size: 32, align: 32, offset: 1280)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1003, file: !4, line: 1825, baseType: !1517, size: 32, align: 32, offset: 1312)
!1517 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1003, file: !4, line: 1830, baseType: !932, size: 32, align: 32, offset: 1344)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1003, file: !4, line: 1838, baseType: !1517, size: 32, align: 32, offset: 1376)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1003, file: !4, line: 1846, baseType: !932, size: 32, align: 32, offset: 1408)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1003, file: !4, line: 1851, baseType: !932, size: 32, align: 32, offset: 1440)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1003, file: !4, line: 1861, baseType: !1517, size: 32, align: 32, offset: 1472)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1003, file: !4, line: 1868, baseType: !1517, size: 32, align: 32, offset: 1504)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1003, file: !4, line: 1875, baseType: !1517, size: 32, align: 32, offset: 1536)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1003, file: !4, line: 1882, baseType: !1517, size: 32, align: 32, offset: 1568)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1003, file: !4, line: 1889, baseType: !1517, size: 32, align: 32, offset: 1600)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1003, file: !4, line: 1896, baseType: !1517, size: 32, align: 32, offset: 1632)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1003, file: !4, line: 1903, baseType: !1517, size: 32, align: 32, offset: 1664)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1003, file: !4, line: 1910, baseType: !932, size: 32, align: 32, offset: 1696)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1003, file: !4, line: 1915, baseType: !932, size: 32, align: 32, offset: 1728)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1003, file: !4, line: 1926, baseType: !1325, size: 64, align: 64, offset: 1792)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1003, file: !4, line: 1935, baseType: !1036, size: 64, align: 32, offset: 1856)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1003, file: !4, line: 1942, baseType: !932, size: 32, align: 32, offset: 1920)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1003, file: !4, line: 1948, baseType: !932, size: 32, align: 32, offset: 1952)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1003, file: !4, line: 1954, baseType: !932, size: 32, align: 32, offset: 1984)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1003, file: !4, line: 1960, baseType: !932, size: 32, align: 32, offset: 2016)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1003, file: !4, line: 1984, baseType: !932, size: 32, align: 32, offset: 2048)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1003, file: !4, line: 1991, baseType: !932, size: 32, align: 32, offset: 2080)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1003, file: !4, line: 1996, baseType: !932, size: 32, align: 32, offset: 2112)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1003, file: !4, line: 2004, baseType: !932, size: 32, align: 32, offset: 2144)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1003, file: !4, line: 2011, baseType: !932, size: 32, align: 32, offset: 2176)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1003, file: !4, line: 2018, baseType: !932, size: 32, align: 32, offset: 2208)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1003, file: !4, line: 2027, baseType: !932, size: 32, align: 32, offset: 2240)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1003, file: !4, line: 2034, baseType: !932, size: 32, align: 32, offset: 2272)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1003, file: !4, line: 2044, baseType: !932, size: 32, align: 32, offset: 2304)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1003, file: !4, line: 2054, baseType: !1547, size: 64, align: 64, offset: 2368)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1003, file: !4, line: 2061, baseType: !1547, size: 64, align: 64, offset: 2432)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1003, file: !4, line: 2066, baseType: !932, size: 32, align: 32, offset: 2496)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1003, file: !4, line: 2070, baseType: !932, size: 32, align: 32, offset: 2528)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1003, file: !4, line: 2078, baseType: !932, size: 32, align: 32, offset: 2560)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1003, file: !4, line: 2085, baseType: !932, size: 32, align: 32, offset: 2592)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1003, file: !4, line: 2092, baseType: !932, size: 32, align: 32, offset: 2624)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1003, file: !4, line: 2099, baseType: !932, size: 32, align: 32, offset: 2656)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1003, file: !4, line: 2106, baseType: !932, size: 32, align: 32, offset: 2688)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1003, file: !4, line: 2113, baseType: !932, size: 32, align: 32, offset: 2720)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1003, file: !4, line: 2120, baseType: !932, size: 32, align: 32, offset: 2752)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1003, file: !4, line: 2125, baseType: !932, size: 32, align: 32, offset: 2784)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1003, file: !4, line: 2133, baseType: !932, size: 32, align: 32, offset: 2816)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1003, file: !4, line: 2140, baseType: !932, size: 32, align: 32, offset: 2848)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1003, file: !4, line: 2145, baseType: !932, size: 32, align: 32, offset: 2880)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1003, file: !4, line: 2153, baseType: !932, size: 32, align: 32, offset: 2912)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1003, file: !4, line: 2158, baseType: !932, size: 32, align: 32, offset: 2944)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1003, file: !4, line: 2166, baseType: !823, size: 32, align: 32, offset: 2976)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1003, file: !4, line: 2173, baseType: !841, size: 32, align: 32, offset: 3008)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1003, file: !4, line: 2180, baseType: !865, size: 32, align: 32, offset: 3040)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1003, file: !4, line: 2187, baseType: !817, size: 32, align: 32, offset: 3072)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1003, file: !4, line: 2194, baseType: !884, size: 32, align: 32, offset: 3104)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1003, file: !4, line: 2203, baseType: !932, size: 32, align: 32, offset: 3136)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1003, file: !4, line: 2209, baseType: !3, size: 32, align: 32, offset: 3168)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1003, file: !4, line: 2212, baseType: !932, size: 32, align: 32, offset: 3200)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1003, file: !4, line: 2213, baseType: !932, size: 32, align: 32, offset: 3232)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1003, file: !4, line: 2220, baseType: !730, size: 32, align: 32, offset: 3264)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1003, file: !4, line: 2232, baseType: !932, size: 32, align: 32, offset: 3296)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1003, file: !4, line: 2243, baseType: !932, size: 32, align: 32, offset: 3328)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1003, file: !4, line: 2249, baseType: !932, size: 32, align: 32, offset: 3360)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1003, file: !4, line: 2256, baseType: !932, size: 32, align: 32, offset: 3392)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1003, file: !4, line: 2263, baseType: !1114, size: 64, align: 64, offset: 3456)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1003, file: !4, line: 2270, baseType: !1114, size: 64, align: 64, offset: 3520)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1003, file: !4, line: 2277, baseType: !894, size: 32, align: 32, offset: 3584)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1003, file: !4, line: 2285, baseType: !730, size: 32, align: 32, offset: 3616)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1003, file: !4, line: 2367, baseType: !1583, size: 64, align: 64, offset: 3648)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DISubroutineType(types: !1585)
!1585 = !{!932, !1510, !1343, !932}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1003, file: !4, line: 2383, baseType: !932, size: 32, align: 32, offset: 3712)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1003, file: !4, line: 2386, baseType: !1517, size: 32, align: 32, offset: 3744)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1003, file: !4, line: 2387, baseType: !1517, size: 32, align: 32, offset: 3776)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1003, file: !4, line: 2394, baseType: !932, size: 32, align: 32, offset: 3808)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1003, file: !4, line: 2401, baseType: !932, size: 32, align: 32, offset: 3840)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1003, file: !4, line: 2408, baseType: !932, size: 32, align: 32, offset: 3872)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1003, file: !4, line: 2415, baseType: !932, size: 32, align: 32, offset: 3904)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1003, file: !4, line: 2422, baseType: !932, size: 32, align: 32, offset: 3936)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1003, file: !4, line: 2423, baseType: !1595, size: 64, align: 64, offset: 3968)
!1595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1596, size: 64, align: 64)
!1596 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1597)
!1597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1598)
!1598 = !{!1599, !1600, !1601, !1602}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1597, file: !4, line: 827, baseType: !932, size: 32, align: 32)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1597, file: !4, line: 828, baseType: !932, size: 32, align: 32, offset: 32)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1597, file: !4, line: 829, baseType: !932, size: 32, align: 32, offset: 64)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1597, file: !4, line: 830, baseType: !1517, size: 32, align: 32, offset: 96)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1003, file: !4, line: 2430, baseType: !958, size: 64, align: 64, offset: 4032)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1003, file: !4, line: 2437, baseType: !958, size: 64, align: 64, offset: 4096)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1003, file: !4, line: 2444, baseType: !1517, size: 32, align: 32, offset: 4160)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1003, file: !4, line: 2451, baseType: !1517, size: 32, align: 32, offset: 4192)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1003, file: !4, line: 2458, baseType: !932, size: 32, align: 32, offset: 4224)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1003, file: !4, line: 2469, baseType: !932, size: 32, align: 32, offset: 4256)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1003, file: !4, line: 2475, baseType: !932, size: 32, align: 32, offset: 4288)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1003, file: !4, line: 2481, baseType: !932, size: 32, align: 32, offset: 4320)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1003, file: !4, line: 2485, baseType: !932, size: 32, align: 32, offset: 4352)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1003, file: !4, line: 2489, baseType: !932, size: 32, align: 32, offset: 4384)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1003, file: !4, line: 2493, baseType: !932, size: 32, align: 32, offset: 4416)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1003, file: !4, line: 2501, baseType: !932, size: 32, align: 32, offset: 4448)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1003, file: !4, line: 2506, baseType: !932, size: 32, align: 32, offset: 4480)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1003, file: !4, line: 2510, baseType: !932, size: 32, align: 32, offset: 4512)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1003, file: !4, line: 2514, baseType: !958, size: 64, align: 64, offset: 4544)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1003, file: !4, line: 2528, baseType: !1619, size: 64, align: 64, offset: 4608)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DISubroutineType(types: !1621)
!1621 = !{null, !1510, !954, !932, !932}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1003, file: !4, line: 2534, baseType: !932, size: 32, align: 32, offset: 4672)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1003, file: !4, line: 2545, baseType: !932, size: 32, align: 32, offset: 4704)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1003, file: !4, line: 2547, baseType: !932, size: 32, align: 32, offset: 4736)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1003, file: !4, line: 2549, baseType: !932, size: 32, align: 32, offset: 4768)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1003, file: !4, line: 2551, baseType: !932, size: 32, align: 32, offset: 4800)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1003, file: !4, line: 2553, baseType: !932, size: 32, align: 32, offset: 4832)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1003, file: !4, line: 2555, baseType: !932, size: 32, align: 32, offset: 4864)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1003, file: !4, line: 2557, baseType: !932, size: 32, align: 32, offset: 4896)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1003, file: !4, line: 2559, baseType: !932, size: 32, align: 32, offset: 4928)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1003, file: !4, line: 2563, baseType: !932, size: 32, align: 32, offset: 4960)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1003, file: !4, line: 2571, baseType: !1201, size: 64, align: 64, offset: 4992)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1003, file: !4, line: 2579, baseType: !1201, size: 64, align: 64, offset: 5056)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1003, file: !4, line: 2586, baseType: !932, size: 32, align: 32, offset: 5120)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1003, file: !4, line: 2615, baseType: !932, size: 32, align: 32, offset: 5152)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1003, file: !4, line: 2627, baseType: !932, size: 32, align: 32, offset: 5184)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1003, file: !4, line: 2637, baseType: !932, size: 32, align: 32, offset: 5216)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1003, file: !4, line: 2681, baseType: !932, size: 32, align: 32, offset: 5248)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1003, file: !4, line: 2709, baseType: !958, size: 64, align: 64, offset: 5312)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1003, file: !4, line: 2716, baseType: !1641, size: 64, align: 64, offset: 5376)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1643)
!1643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1644)
!1644 = !{!1645, !1646, !1647, !1648, !1649, !1650, !1651, !1655, !1659, !1660, !1661, !1662, !2560, !2561, !2562, !2563, !2564}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1643, file: !4, line: 3642, baseType: !1012, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1643, file: !4, line: 3649, baseType: !61, size: 32, align: 32, offset: 64)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1643, file: !4, line: 3656, baseType: !71, size: 32, align: 32, offset: 96)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1643, file: !4, line: 3663, baseType: !530, size: 32, align: 32, offset: 128)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1643, file: !4, line: 3669, baseType: !932, size: 32, align: 32, offset: 160)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1643, file: !4, line: 3682, baseType: !1340, size: 64, align: 64, offset: 192)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1643, file: !4, line: 3698, baseType: !1652, size: 64, align: 64, offset: 256)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{!932, !1001, !1150, !1171}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1643, file: !4, line: 3712, baseType: !1656, size: 64, align: 64, offset: 320)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DISubroutineType(types: !1658)
!1658 = !{!932, !1001, !932, !1150, !1171}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1643, file: !4, line: 3726, baseType: !1652, size: 64, align: 64, offset: 384)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1643, file: !4, line: 3737, baseType: !1133, size: 64, align: 64, offset: 448)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1643, file: !4, line: 3746, baseType: !932, size: 32, align: 32, offset: 512)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1643, file: !4, line: 3757, baseType: !1663, size: 64, align: 64, offset: 576)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DISubroutineType(types: !1665)
!1665 = !{null, !1666}
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !1668, line: 81, size: 86208, align: 64, elements: !1669)
!1668 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
