; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--h264_metadata_bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--h264_metadata_bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, {}*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }

!652 = !DIEnumerator(name: "H264_NAL_RESERVED17", value: 17)
!653 = !DIEnumerator(name: "H264_NAL_RESERVED18", value: 18)
!654 = !DIEnumerator(name: "H264_NAL_AUXILIARY_SLICE", value: 19)
!655 = !DIEnumerator(name: "H264_NAL_EXTEN_SLICE", value: 20)
!656 = !DIEnumerator(name: "H264_NAL_DEPTH_EXTEN_SLICE", value: 21)
!657 = !DIEnumerator(name: "H264_NAL_RESERVED22", value: 22)
!658 = !DIEnumerator(name: "H264_NAL_RESERVED23", value: 23)
!659 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED24", value: 24)
!660 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED25", value: 25)
!661 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED26", value: 26)
!662 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED27", value: 27)
!663 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED28", value: 28)
!664 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED29", value: 29)
!665 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED30", value: 30)
!666 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED31", value: 31)
!667 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !668, line: 43, size: 32, align: 32, elements: !669)
!668 = !DIFile(filename: "libavcodec/h264_metadata_bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!669 = !{!670, !671}
!670 = !DIEnumerator(name: "LEVEL_UNSET", value: -2)
!671 = !DIEnumerator(name: "LEVEL_AUTO", value: -1)
!672 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !633, line: 69, size: 32, align: 32, elements: !673)
!673 = !{!674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686}
!674 = !DIEnumerator(name: "H264_MAX_SPS_COUNT", value: 32)
!675 = !DIEnumerator(name: "H264_MAX_PPS_COUNT", value: 256)
!676 = !DIEnumerator(name: "H264_MAX_DPB_FRAMES", value: 16)
!677 = !DIEnumerator(name: "H264_MAX_REFS", value: 32)
!678 = !DIEnumerator(name: "H264_MAX_RPLM_COUNT", value: 33)
!679 = !DIEnumerator(name: "H264_MAX_MMCO_COUNT", value: 67)
!680 = !DIEnumerator(name: "H264_MAX_SLICE_GROUPS", value: 8)
!681 = !DIEnumerator(name: "H264_MAX_CPB_CNT", value: 32)
!682 = !DIEnumerator(name: "H264_MAX_MB_PIC_SIZE", value: 139264)
!683 = !DIEnumerator(name: "H264_MAX_MB_WIDTH", value: 1055)
!684 = !DIEnumerator(name: "H264_MAX_MB_HEIGHT", value: 1055)
!685 = !DIEnumerator(name: "H264_MAX_WIDTH", value: 16880)
!686 = !DIEnumerator(name: "H264_MAX_HEIGHT", value: 16880)
!687 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !668, line: 31, size: 32, align: 32, elements: !688)
!688 = !{!689, !690, !691, !692}
!689 = !DIEnumerator(name: "PASS", value: 0)
!690 = !DIEnumerator(name: "INSERT", value: 1)
!691 = !DIEnumerator(name: "REMOVE", value: 2)
!692 = !DIEnumerator(name: "EXTRACT", value: 3)
!693 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !694, line: 27, size: 32, align: 32, elements: !695)
!694 = !DIFile(filename: "libavcodec/h264_sei.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!695 = !{!696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707}
!696 = !DIEnumerator(name: "H264_SEI_TYPE_BUFFERING_PERIOD", value: 0)
!697 = !DIEnumerator(name: "H264_SEI_TYPE_PIC_TIMING", value: 1)
!698 = !DIEnumerator(name: "H264_SEI_TYPE_PAN_SCAN_RECT", value: 2)
!699 = !DIEnumerator(name: "H264_SEI_TYPE_FILLER_PAYLOAD", value: 3)
!700 = !DIEnumerator(name: "H264_SEI_TYPE_USER_DATA_REGISTERED", value: 4)
!701 = !DIEnumerator(name: "H264_SEI_TYPE_USER_DATA_UNREGISTERED", value: 5)
!702 = !DIEnumerator(name: "H264_SEI_TYPE_RECOVERY_POINT", value: 6)
!703 = !DIEnumerator(name: "H264_SEI_TYPE_FRAME_PACKING", value: 45)
!704 = !DIEnumerator(name: "H264_SEI_TYPE_DISPLAY_ORIENTATION", value: 47)
!705 = !DIEnumerator(name: "H264_SEI_TYPE_GREEN_METADATA", value: 56)
!706 = !DIEnumerator(name: "H264_SEI_TYPE_MASTERING_DISPLAY_COLOUR_VOLUME", value: 137)
!707 = !DIEnumerator(name: "H264_SEI_TYPE_ALTERNATIVE_TRANSFER", value: 147)
!708 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !668, line: 38, size: 32, align: 32, elements: !709)
!709 = !{!710, !711}
!710 = !DIEnumerator(name: "FLIP_HORIZONTAL", value: 1)
!711 = !DIEnumerator(name: "FLIP_VERTICAL", value: 2)
!712 = !{!713, !714, !715, !719}
!713 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!714 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64, align: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !717, line: 48, baseType: !718)
!717 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!718 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !717, line: 49, baseType: !720)
!720 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!721 = !{!722, !917, !921, !922, !928, !1065}
!722 = distinct !DIGlobalVariable(name: "ff_h264_metadata_bsf", scope: !0, file: !668, line: 793, type: !723, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_h264_metadata_bsf)
!723 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !726)
!726 = !{!727, !731, !734, !816, !817, !874, !912, !916}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !725, file: !4, line: 5797, baseType: !728, size: 64, align: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !730)
!730 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !725, file: !4, line: 5804, baseType: !732, size: 64, align: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !725, file: !4, line: 5815, baseType: !735, size: 64, align: 64, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64, align: 64)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !739)
!739 = !{!740, !741, !746, !775, !776, !777, !778, !782, !788, !790, !794}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !738, file: !486, line: 72, baseType: !728, size: 64, align: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !738, file: !486, line: 78, baseType: !742, size: 64, align: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64, align: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!728, !745}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !738, file: !486, line: 85, baseType: !747, size: 64, align: 64, offset: 128)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64, align: 64)
!748 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !750)
!750 = !{!751, !752, !753, !754, !755, !771, !772, !773, !774}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !749, file: !464, line: 247, baseType: !728, size: 64, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !749, file: !464, line: 253, baseType: !728, size: 64, align: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !749, file: !464, line: 259, baseType: !713, size: 32, align: 32, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !749, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !749, file: !464, line: 271, baseType: !756, size: 64, align: 64, offset: 192)
!756 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !749, file: !464, line: 265, size: 64, align: 64, elements: !757)
!757 = !{!758, !761, !763, !764}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !756, file: !464, line: 266, baseType: !759, size: 64, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !717, line: 40, baseType: !760)
!760 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !756, file: !464, line: 267, baseType: !762, size: 64, align: 64)
!762 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !756, file: !464, line: 268, baseType: !728, size: 64, align: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !756, file: !464, line: 270, baseType: !765, size: 64, align: 32)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !766, line: 61, baseType: !767)
!766 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !766, line: 58, size: 64, align: 32, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !767, file: !766, line: 59, baseType: !713, size: 32, align: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !767, file: !766, line: 60, baseType: !713, size: 32, align: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !749, file: !464, line: 272, baseType: !762, size: 64, align: 64, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !749, file: !464, line: 273, baseType: !762, size: 64, align: 64, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !749, file: !464, line: 275, baseType: !713, size: 32, align: 32, offset: 384)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !749, file: !464, line: 300, baseType: !728, size: 64, align: 64, offset: 448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !738, file: !486, line: 93, baseType: !713, size: 32, align: 32, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !738, file: !486, line: 99, baseType: !713, size: 32, align: 32, offset: 224)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !738, file: !486, line: 108, baseType: !713, size: 32, align: 32, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !738, file: !486, line: 113, baseType: !779, size: 64, align: 64, offset: 320)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64, align: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!745, !745, !745}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !738, file: !486, line: 123, baseType: !783, size: 64, align: 64, offset: 384)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64, align: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!786, !786}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64, align: 64)
!787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !738)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !738, file: !486, line: 130, baseType: !789, size: 32, align: 32, offset: 448)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !738, file: !486, line: 136, baseType: !791, size: 64, align: 64, offset: 512)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64, align: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!789, !745}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !738, file: !486, line: 142, baseType: !795, size: 64, align: 64, offset: 576)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64, align: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!713, !798, !745, !728, !713}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64, align: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !801)
!801 = !{!802, !814, !815}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !800, file: !464, line: 360, baseType: !803, size: 64, align: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64, align: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64, align: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !807)
!807 = !{!808, !809, !810, !811, !812, !813}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !806, file: !464, line: 307, baseType: !728, size: 64, align: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !806, file: !464, line: 313, baseType: !762, size: 64, align: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !806, file: !464, line: 313, baseType: !762, size: 64, align: 64, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !806, file: !464, line: 318, baseType: !762, size: 64, align: 64, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !806, file: !464, line: 318, baseType: !762, size: 64, align: 64, offset: 256)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !806, file: !464, line: 323, baseType: !713, size: 32, align: 32, offset: 320)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !800, file: !464, line: 364, baseType: !713, size: 32, align: 32, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !800, file: !464, line: 368, baseType: !713, size: 32, align: 32, offset: 96)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !725, file: !4, line: 5825, baseType: !713, size: 32, align: 32, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !725, file: !4, line: 5826, baseType: !818, size: 64, align: 64, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64, align: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!713, !821}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64, align: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !824)
!824 = !{!825, !826, !829, !833, !834, !871, !872, !873}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !823, file: !4, line: 5751, baseType: !735, size: 64, align: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !823, file: !4, line: 5756, baseType: !827, size: 64, align: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64, align: 64)
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !725)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !823, file: !4, line: 5762, baseType: !830, size: 64, align: 64, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64, align: 64)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !832)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !823, file: !4, line: 5768, baseType: !745, size: 64, align: 64, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !823, file: !4, line: 5775, baseType: !835, size: 64, align: 64, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64, align: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !838)
!838 = !{!839, !840, !841, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !864, !865, !866, !867, !868, !869, !870}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !837, file: !4, line: 3940, baseType: !506, size: 32, align: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !837, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !837, file: !4, line: 3948, baseType: !842, size: 32, align: 32, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !717, line: 51, baseType: !714)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !837, file: !4, line: 3958, baseType: !715, size: 64, align: 64, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !837, file: !4, line: 3962, baseType: !713, size: 32, align: 32, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !837, file: !4, line: 3968, baseType: !713, size: 32, align: 32, offset: 224)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !837, file: !4, line: 3973, baseType: !759, size: 64, align: 64, offset: 256)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !837, file: !4, line: 3986, baseType: !713, size: 32, align: 32, offset: 320)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !837, file: !4, line: 3999, baseType: !713, size: 32, align: 32, offset: 352)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !837, file: !4, line: 4004, baseType: !713, size: 32, align: 32, offset: 384)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !837, file: !4, line: 4005, baseType: !713, size: 32, align: 32, offset: 416)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !837, file: !4, line: 4010, baseType: !713, size: 32, align: 32, offset: 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !837, file: !4, line: 4011, baseType: !713, size: 32, align: 32, offset: 480)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !837, file: !4, line: 4020, baseType: !765, size: 64, align: 32, offset: 512)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !837, file: !4, line: 4025, baseType: !516, size: 32, align: 32, offset: 576)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !837, file: !4, line: 4030, baseType: !524, size: 32, align: 32, offset: 608)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !837, file: !4, line: 4031, baseType: !531, size: 32, align: 32, offset: 640)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !837, file: !4, line: 4032, baseType: !549, size: 32, align: 32, offset: 672)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !837, file: !4, line: 4033, baseType: !573, size: 32, align: 32, offset: 704)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !837, file: !4, line: 4034, baseType: !592, size: 32, align: 32, offset: 736)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !837, file: !4, line: 4039, baseType: !713, size: 32, align: 32, offset: 768)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !837, file: !4, line: 4046, baseType: !862, size: 64, align: 64, offset: 832)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !717, line: 55, baseType: !863)
!863 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !837, file: !4, line: 4050, baseType: !713, size: 32, align: 32, offset: 896)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !837, file: !4, line: 4054, baseType: !713, size: 32, align: 32, offset: 928)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !837, file: !4, line: 4061, baseType: !713, size: 32, align: 32, offset: 960)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !837, file: !4, line: 4065, baseType: !713, size: 32, align: 32, offset: 992)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !837, file: !4, line: 4073, baseType: !713, size: 32, align: 32, offset: 1024)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !837, file: !4, line: 4080, baseType: !713, size: 32, align: 32, offset: 1056)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !837, file: !4, line: 4084, baseType: !713, size: 32, align: 32, offset: 1088)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !823, file: !4, line: 5781, baseType: !835, size: 64, align: 64, offset: 320)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !823, file: !4, line: 5787, baseType: !765, size: 64, align: 32, offset: 384)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !823, file: !4, line: 5793, baseType: !765, size: 64, align: 32, offset: 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !725, file: !4, line: 5827, baseType: !875, size: 64, align: 64, offset: 320)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64, align: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!713, !821, !878}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64, align: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !881)
!881 = !{!882, !894, !895, !896, !897, !898, !899, !900, !908, !909, !910, !911}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !880, file: !4, line: 1451, baseType: !883, size: 64, align: 64)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64, align: 64)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !885, line: 94, baseType: !886)
!885 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !885, line: 81, size: 192, align: 64, elements: !887)
!887 = !{!888, !892, !893}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !886, file: !885, line: 82, baseType: !889, size: 64, align: 64)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64, align: 64)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !885, line: 73, baseType: !891)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !885, line: 73, flags: DIFlagFwdDecl)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !886, file: !885, line: 89, baseType: !715, size: 64, align: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !886, file: !885, line: 93, baseType: !713, size: 32, align: 32, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !880, file: !4, line: 1461, baseType: !759, size: 64, align: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !880, file: !4, line: 1467, baseType: !759, size: 64, align: 64, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !880, file: !4, line: 1468, baseType: !715, size: 64, align: 64, offset: 192)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !880, file: !4, line: 1469, baseType: !713, size: 32, align: 32, offset: 256)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !880, file: !4, line: 1470, baseType: !713, size: 32, align: 32, offset: 288)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !880, file: !4, line: 1474, baseType: !713, size: 32, align: 32, offset: 320)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !880, file: !4, line: 1479, baseType: !901, size: 64, align: 64, offset: 384)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64, align: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !904)
!904 = !{!905, !906, !907}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !903, file: !4, line: 1412, baseType: !715, size: 64, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !903, file: !4, line: 1413, baseType: !713, size: 32, align: 32, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !903, file: !4, line: 1414, baseType: !602, size: 32, align: 32, offset: 96)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !880, file: !4, line: 1480, baseType: !713, size: 32, align: 32, offset: 448)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !880, file: !4, line: 1486, baseType: !759, size: 64, align: 64, offset: 512)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !880, file: !4, line: 1488, baseType: !759, size: 64, align: 64, offset: 576)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !880, file: !4, line: 1497, baseType: !759, size: 64, align: 64, offset: 640)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !725, file: !4, line: 5828, baseType: !913, size: 64, align: 64, offset: 384)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64, align: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !821}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !725, file: !4, line: 5829, baseType: !913, size: 64, align: 64, offset: 448)
!917 = distinct !DIGlobalVariable(name: "h264_metadata_codec_ids", scope: !0, file: !668, line: 789, type: !918, isLocal: true, isDefinition: true, variable: [2 x i32]* @h264_metadata_codec_ids)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !733, size: 64, align: 32, elements: !919)
!919 = !{!920}
!920 = !DISubrange(count: 2)
!921 = distinct !DIGlobalVariable(name: "h264_metadata_class", scope: !0, file: !668, line: 782, type: !736, isLocal: true, isDefinition: true, variable: %struct.AVClass* @h264_metadata_class)
!922 = distinct !DIGlobalVariable(name: "h264_metadata_options", scope: !0, file: !668, line: 663, type: !923, isLocal: true, isDefinition: true, variable: <{ %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption }>* @h264_metadata_options)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !924, size: 26112, align: 64, elements: !926)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !464, line: 301, baseType: !749)
!926 = !{!927}
!927 = !DISubrange(count: 51)
!928 = distinct !DIGlobalVariable(name: "sar_idc", scope: !929, file: !668, line: 97, type: !1061, isLocal: true, isDefinition: true, variable: [17 x %struct.AVRational]* @h264_metadata_update_sps.sar_idc)
!929 = distinct !DISubprogram(name: "h264_metadata_update_sps", scope: !668, file: !668, line: 88, type: !930, isLocal: true, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1060)
!930 = !DISubroutineType(types: !931)
!931 = !{!713, !821, !932}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264RawSPS", file: !934, line: 165, baseType: !935)
!934 = !DIFile(filename: "libavcodec/cbs_h264.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264RawSPS", file: !934, line: 112, size: 20032, align: 32, elements: !936)
!936 = !{!937, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !966, !979, !980, !981, !982, !983, !984, !986, !987, !988, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "nal_unit_header", scope: !935, file: !934, line: 113, baseType: !938, size: 40, align: 8)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264RawNALUnitHeader", file: !934, line: 47, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264RawNALUnitHeader", file: !934, line: 40, size: 40, align: 8, elements: !940)
!940 = !{!941, !942, !943, !944, !945}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "forbidden_zero_bit", scope: !939, file: !934, line: 41, baseType: !716, size: 8, align: 8)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !939, file: !934, line: 42, baseType: !716, size: 8, align: 8, offset: 8)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "nal_unit_type", scope: !939, file: !934, line: 43, baseType: !716, size: 8, align: 8, offset: 16)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "svc_extension_flag", scope: !939, file: !934, line: 45, baseType: !716, size: 8, align: 8, offset: 24)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "avc_3d_extension_flag", scope: !939, file: !934, line: 46, baseType: !716, size: 8, align: 8, offset: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !935, file: !934, line: 115, baseType: !716, size: 8, align: 8, offset: 40)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "constraint_set0_flag", scope: !935, file: !934, line: 116, baseType: !716, size: 8, align: 8, offset: 48)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "constraint_set1_flag", scope: !935, file: !934, line: 117, baseType: !716, size: 8, align: 8, offset: 56)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "constraint_set2_flag", scope: !935, file: !934, line: 118, baseType: !716, size: 8, align: 8, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "constraint_set3_flag", scope: !935, file: !934, line: 119, baseType: !716, size: 8, align: 8, offset: 72)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "constraint_set4_flag", scope: !935, file: !934, line: 120, baseType: !716, size: 8, align: 8, offset: 80)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "constraint_set5_flag", scope: !935, file: !934, line: 121, baseType: !716, size: 8, align: 8, offset: 88)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_zero_2bits", scope: !935, file: !934, line: 122, baseType: !716, size: 8, align: 8, offset: 96)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !935, file: !934, line: 123, baseType: !716, size: 8, align: 8, offset: 104)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !935, file: !934, line: 125, baseType: !716, size: 8, align: 8, offset: 112)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !935, file: !934, line: 127, baseType: !716, size: 8, align: 8, offset: 120)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !935, file: !934, line: 128, baseType: !716, size: 8, align: 8, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !935, file: !934, line: 129, baseType: !716, size: 8, align: 8, offset: 136)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !935, file: !934, line: 130, baseType: !716, size: 8, align: 8, offset: 144)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "qpprime_y_zero_transform_bypass_flag", scope: !935, file: !934, line: 131, baseType: !716, size: 8, align: 8, offset: 152)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !935, file: !934, line: 133, baseType: !716, size: 8, align: 8, offset: 160)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !935, file: !934, line: 134, baseType: !963, size: 96, align: 8, offset: 168)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 96, align: 8, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 12)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list_4x4", scope: !935, file: !934, line: 135, baseType: !967, size: 3072, align: 8, offset: 264)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 3072, align: 8, elements: !977)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264RawScalingList", file: !934, line: 51, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264RawScalingList", file: !934, line: 49, size: 512, align: 8, elements: !970)
!970 = !{!971}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "delta_scale", scope: !969, file: !934, line: 50, baseType: !972, size: 512, align: 8)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !973, size: 512, align: 8, elements: !975)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !717, line: 36, baseType: !974)
!974 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!975 = !{!976}
!976 = !DISubrange(count: 64)
!977 = !{!978}
!978 = !DISubrange(count: 6)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list_8x8", scope: !935, file: !934, line: 136, baseType: !967, size: 3072, align: 8, offset: 3336)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !935, file: !934, line: 138, baseType: !716, size: 8, align: 8, offset: 6408)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !935, file: !934, line: 139, baseType: !716, size: 8, align: 8, offset: 6416)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !935, file: !934, line: 140, baseType: !716, size: 8, align: 8, offset: 6424)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !935, file: !934, line: 141, baseType: !716, size: 8, align: 8, offset: 6432)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !935, file: !934, line: 142, baseType: !985, size: 32, align: 32, offset: 6464)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !717, line: 38, baseType: !713)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !935, file: !934, line: 143, baseType: !985, size: 32, align: 32, offset: 6496)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !935, file: !934, line: 144, baseType: !716, size: 8, align: 8, offset: 6528)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !935, file: !934, line: 145, baseType: !989, size: 8192, align: 32, offset: 6560)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 8192, align: 32, elements: !990)
!990 = !{!991}
!991 = !DISubrange(count: 256)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "max_num_ref_frames", scope: !935, file: !934, line: 147, baseType: !716, size: 8, align: 8, offset: 14752)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_allowed_flag", scope: !935, file: !934, line: 148, baseType: !716, size: 8, align: 8, offset: 14760)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !935, file: !934, line: 150, baseType: !719, size: 16, align: 16, offset: 14768)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !935, file: !934, line: 151, baseType: !719, size: 16, align: 16, offset: 14784)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !935, file: !934, line: 153, baseType: !716, size: 8, align: 8, offset: 14800)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !935, file: !934, line: 154, baseType: !716, size: 8, align: 8, offset: 14808)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !935, file: !934, line: 155, baseType: !716, size: 8, align: 8, offset: 14816)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !935, file: !934, line: 157, baseType: !716, size: 8, align: 8, offset: 14824)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "frame_crop_left_offset", scope: !935, file: !934, line: 158, baseType: !719, size: 16, align: 16, offset: 14832)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "frame_crop_right_offset", scope: !935, file: !934, line: 159, baseType: !719, size: 16, align: 16, offset: 14848)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "frame_crop_top_offset", scope: !935, file: !934, line: 160, baseType: !719, size: 16, align: 16, offset: 14864)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "frame_crop_bottom_offset", scope: !935, file: !934, line: 161, baseType: !719, size: 16, align: 16, offset: 14880)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !935, file: !934, line: 163, baseType: !716, size: 8, align: 8, offset: 14896)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !935, file: !934, line: 164, baseType: !1006, size: 5120, align: 32, offset: 14912)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264RawVUI", file: !934, line: 110, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264RawVUI", file: !934, line: 68, size: 5120, align: 32, elements: !1008)
!1008 = !{!1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !1007, file: !934, line: 69, baseType: !716, size: 8, align: 8)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !1007, file: !934, line: 70, baseType: !716, size: 8, align: 8, offset: 8)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !1007, file: !934, line: 71, baseType: !719, size: 16, align: 16, offset: 16)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !1007, file: !934, line: 72, baseType: !719, size: 16, align: 16, offset: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !1007, file: !934, line: 74, baseType: !716, size: 8, align: 8, offset: 48)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !1007, file: !934, line: 75, baseType: !716, size: 8, align: 8, offset: 56)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !1007, file: !934, line: 77, baseType: !716, size: 8, align: 8, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !1007, file: !934, line: 78, baseType: !716, size: 8, align: 8, offset: 72)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !1007, file: !934, line: 79, baseType: !716, size: 8, align: 8, offset: 80)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !1007, file: !934, line: 80, baseType: !716, size: 8, align: 8, offset: 88)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !1007, file: !934, line: 81, baseType: !716, size: 8, align: 8, offset: 96)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !1007, file: !934, line: 82, baseType: !716, size: 8, align: 8, offset: 104)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !1007, file: !934, line: 83, baseType: !716, size: 8, align: 8, offset: 112)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_loc_info_present_flag", scope: !1007, file: !934, line: 85, baseType: !716, size: 8, align: 8, offset: 120)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !1007, file: !934, line: 86, baseType: !716, size: 8, align: 8, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !1007, file: !934, line: 87, baseType: !716, size: 8, align: 8, offset: 136)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !1007, file: !934, line: 89, baseType: !716, size: 8, align: 8, offset: 144)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !1007, file: !934, line: 90, baseType: !842, size: 32, align: 32, offset: 160)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !1007, file: !934, line: 91, baseType: !842, size: 32, align: 32, offset: 192)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !1007, file: !934, line: 92, baseType: !716, size: 8, align: 8, offset: 224)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !1007, file: !934, line: 94, baseType: !716, size: 8, align: 8, offset: 232)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !1007, file: !934, line: 95, baseType: !1031, size: 2368, align: 32, offset: 256)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264RawHRD", file: !934, line: 66, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264RawHRD", file: !934, line: 53, size: 2368, align: 32, elements: !1033)
!1033 = !{!1034, !1035, !1036, !1037, !1041, !1042, !1044, !1045, !1046, !1047}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !1032, file: !934, line: 54, baseType: !716, size: 8, align: 8)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !1032, file: !934, line: 55, baseType: !716, size: 8, align: 8, offset: 8)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !1032, file: !934, line: 56, baseType: !716, size: 8, align: 8, offset: 16)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !1032, file: !934, line: 58, baseType: !1038, size: 1024, align: 32, offset: 32)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !842, size: 1024, align: 32, elements: !1039)
!1039 = !{!1040}
!1040 = !DISubrange(count: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !1032, file: !934, line: 59, baseType: !1038, size: 1024, align: 32, offset: 1056)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !1032, file: !934, line: 60, baseType: !1043, size: 256, align: 8, offset: 2080)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 256, align: 8, elements: !1039)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !1032, file: !934, line: 62, baseType: !716, size: 8, align: 8, offset: 2336)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !1032, file: !934, line: 63, baseType: !716, size: 8, align: 8, offset: 2344)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !1032, file: !934, line: 64, baseType: !716, size: 8, align: 8, offset: 2352)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !1032, file: !934, line: 65, baseType: !716, size: 8, align: 8, offset: 2360)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !1007, file: !934, line: 96, baseType: !716, size: 8, align: 8, offset: 2624)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !1007, file: !934, line: 97, baseType: !1031, size: 2368, align: 32, offset: 2656)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !1007, file: !934, line: 98, baseType: !716, size: 8, align: 8, offset: 5024)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !1007, file: !934, line: 100, baseType: !716, size: 8, align: 8, offset: 5032)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !1007, file: !934, line: 102, baseType: !716, size: 8, align: 8, offset: 5040)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !1007, file: !934, line: 103, baseType: !716, size: 8, align: 8, offset: 5048)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !1007, file: !934, line: 104, baseType: !716, size: 8, align: 8, offset: 5056)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !1007, file: !934, line: 105, baseType: !716, size: 8, align: 8, offset: 5064)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !1007, file: !934, line: 106, baseType: !716, size: 8, align: 8, offset: 5072)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !1007, file: !934, line: 107, baseType: !716, size: 8, align: 8, offset: 5080)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "max_num_reorder_frames", scope: !1007, file: !934, line: 108, baseType: !716, size: 8, align: 8, offset: 5088)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !1007, file: !934, line: 109, baseType: !716, size: 8, align: 8, offset: 5096)
!1060 = !{}
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 1088, align: 32, elements: !1063)
!1062 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !765)
!1063 = !{!1064}
!1064 = !DISubrange(count: 17)
!1065 = distinct !DIGlobalVariable(name: "primary_pic_type_table", scope: !1066, file: !668, line: 312, type: !1067, isLocal: true, isDefinition: true, variable: [8 x i32]* @h264_metadata_filter.primary_pic_type_table)
!1066 = distinct !DISubprogram(name: "h264_metadata_filter", scope: !668, file: !668, line: 280, type: !876, isLocal: true, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1060)
!1067 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1068, size: 256, align: 32, elements: !1069)
!1068 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !713)
!1069 = !{!1070}
!1070 = !DISubrange(count: 8)
!1071 = !{i32 2, !"Dwarf Version", i32 4}
!1072 = !{i32 2, !"Debug Info Version", i32 3}
!1073 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1074 = distinct !DISubprogram(name: "h264_metadata_init", scope: !668, file: !668, line: 617, type: !819, isLocal: true, isDefinition: true, scopeLine: 618, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1060)
!1075 = !DILocalVariable(name: "bsf", arg: 1, scope: !1074, file: !668, line: 617, type: !821)
!1076 = !DIExpression()
!1077 = !DILocation(line: 617, column: 45, scope: !1074)
!1078 = !DILocalVariable(name: "ctx", scope: !1074, file: !668, line: 619, type: !1079)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264MetadataContext", file: !668, line: 85, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264MetadataContext", file: !668, line: 48, size: 1344, align: 64, elements: !1082)
!1082 = !{!1083, !1084, !1102, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1081, file: !668, line: 49, baseType: !735, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "cbc", scope: !1081, file: !668, line: 51, baseType: !1085, size: 64, align: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamContext", file: !1087, line: 204, baseType: !1088)
!1087 = !DIFile(filename: "libavcodec/cbs.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamContext", file: !1087, line: 159, size: 384, align: 64, elements: !1089)
!1089 = !{!1090, !1091, !1095, !1096, !1099, !1100, !1101}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !1088, file: !1087, line: 164, baseType: !745, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1088, file: !1087, line: 169, baseType: !1092, size: 64, align: 64, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1094)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamType", file: !1087, line: 43, flags: DIFlagFwdDecl)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1088, file: !1087, line: 180, baseType: !745, size: 64, align: 64, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "decompose_unit_types", scope: !1088, file: !1087, line: 188, baseType: !1097, size: 64, align: 64, offset: 192)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamUnitType", file: !1087, line: 53, baseType: !842)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "nb_decompose_unit_types", scope: !1088, file: !1087, line: 192, baseType: !713, size: 32, align: 32, offset: 256)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "trace_enable", scope: !1088, file: !1087, line: 197, baseType: !713, size: 32, align: 32, offset: 288)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !1088, file: !1087, line: 203, baseType: !713, size: 32, align: 32, offset: 320)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "access_unit", scope: !1081, file: !668, line: 52, baseType: !1103, size: 384, align: 64, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamFragment", file: !1087, line: 154, baseType: !1104)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamFragment", file: !1087, line: 116, size: 384, align: 64, elements: !1105)
!1105 = !{!1106, !1107, !1110, !1111, !1112, !1113}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1104, file: !1087, line: 122, baseType: !715, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !1104, file: !1087, line: 129, baseType: !1108, size: 64, align: 64, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1109, line: 216, baseType: !863)
!1109 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_padding", scope: !1104, file: !1087, line: 133, baseType: !1108, size: 64, align: 64, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "data_ref", scope: !1104, file: !1087, line: 139, baseType: !883, size: 64, align: 64, offset: 192)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "nb_units", scope: !1104, file: !1087, line: 147, baseType: !713, size: 32, align: 32, offset: 256)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1104, file: !1087, line: 153, baseType: !1114, size: 64, align: 64, offset: 320)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamUnit", file: !1087, line: 107, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamUnit", file: !1087, line: 64, size: 448, align: 64, elements: !1117)
!1117 = !{!1118, !1119, !1120, !1121, !1122, !1123, !1124}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1116, file: !1087, line: 68, baseType: !1098, size: 32, align: 32)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1116, file: !1087, line: 75, baseType: !715, size: 64, align: 64, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !1116, file: !1087, line: 80, baseType: !1108, size: 64, align: 64, offset: 128)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_padding", scope: !1116, file: !1087, line: 86, baseType: !1108, size: 64, align: 64, offset: 192)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "data_ref", scope: !1116, file: !1087, line: 92, baseType: !883, size: 64, align: 64, offset: 256)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "content", scope: !1116, file: !1087, line: 101, baseType: !745, size: 64, align: 64, offset: 320)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "content_ref", scope: !1116, file: !1087, line: 106, baseType: !883, size: 64, align: 64, offset: 384)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "done_first_au", scope: !1081, file: !668, line: 54, baseType: !713, size: 32, align: 32, offset: 512)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "aud", scope: !1081, file: !668, line: 56, baseType: !713, size: 32, align: 32, offset: 544)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1081, file: !668, line: 58, baseType: !765, size: 64, align: 32, offset: 576)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !1081, file: !668, line: 60, baseType: !713, size: 32, align: 32, offset: 640)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !1081, file: !668, line: 61, baseType: !713, size: 32, align: 32, offset: 672)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !1081, file: !668, line: 62, baseType: !713, size: 32, align: 32, offset: 704)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !1081, file: !668, line: 63, baseType: !713, size: 32, align: 32, offset: 736)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !1081, file: !668, line: 64, baseType: !713, size: 32, align: 32, offset: 768)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type", scope: !1081, file: !668, line: 66, baseType: !713, size: 32, align: 32, offset: 800)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "tick_rate", scope: !1081, file: !668, line: 68, baseType: !765, size: 64, align: 32, offset: 832)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !1081, file: !668, line: 69, baseType: !713, size: 32, align: 32, offset: 896)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1081, file: !668, line: 71, baseType: !713, size: 32, align: 32, offset: 928)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1081, file: !668, line: 72, baseType: !713, size: 32, align: 32, offset: 960)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1081, file: !668, line: 73, baseType: !713, size: 32, align: 32, offset: 992)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1081, file: !668, line: 74, baseType: !713, size: 32, align: 32, offset: 1024)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "sei_user_data", scope: !1081, file: !668, line: 76, baseType: !728, size: 64, align: 64, offset: 1088)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "delete_filler", scope: !1081, file: !668, line: 78, baseType: !713, size: 32, align: 32, offset: 1152)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "display_orientation", scope: !1081, file: !668, line: 80, baseType: !713, size: 32, align: 32, offset: 1184)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "rotate", scope: !1081, file: !668, line: 81, baseType: !762, size: 64, align: 64, offset: 1216)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "flip", scope: !1081, file: !668, line: 82, baseType: !713, size: 32, align: 32, offset: 1280)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1081, file: !668, line: 84, baseType: !713, size: 32, align: 32, offset: 1312)
!1146 = !DILocation(line: 619, column: 26, scope: !1074)
!1147 = !DILocation(line: 619, column: 32, scope: !1074)
!1148 = !DILocation(line: 619, column: 37, scope: !1074)
!1149 = !DILocalVariable(name: "au", scope: !1074, file: !668, line: 620, type: !1150)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1151 = !DILocation(line: 620, column: 29, scope: !1074)
!1152 = !DILocation(line: 620, column: 35, scope: !1074)
!1153 = !DILocation(line: 620, column: 40, scope: !1074)
!1154 = !DILocalVariable(name: "err", scope: !1074, file: !668, line: 621, type: !713)
!1155 = !DILocation(line: 621, column: 9, scope: !1074)
!1156 = !DILocalVariable(name: "i", scope: !1074, file: !668, line: 621, type: !713)
!1157 = !DILocation(line: 621, column: 14, scope: !1074)
!1158 = !DILocation(line: 623, column: 24, scope: !1074)
!1159 = !DILocation(line: 623, column: 29, scope: !1074)
!1160 = !DILocation(line: 623, column: 52, scope: !1074)
!1161 = !DILocation(line: 623, column: 11, scope: !1074)
!1162 = !DILocation(line: 623, column: 9, scope: !1074)
!1163 = !DILocation(line: 624, column: 9, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1074, file: !668, line: 624, column: 9)
!1165 = !DILocation(line: 624, column: 13, scope: !1164)
!1166 = !DILocation(line: 624, column: 9, scope: !1074)
!1167 = !DILocation(line: 625, column: 16, scope: !1164)
!1168 = !DILocation(line: 625, column: 9, scope: !1164)
!1169 = !DILocation(line: 627, column: 9, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1074, file: !668, line: 627, column: 9)
!1171 = !DILocation(line: 627, column: 14, scope: !1170)
!1172 = !DILocation(line: 627, column: 22, scope: !1170)
!1173 = !DILocation(line: 627, column: 9, scope: !1074)
!1174 = !DILocation(line: 628, column: 37, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1170, file: !668, line: 627, column: 33)
!1176 = !DILocation(line: 628, column: 42, scope: !1175)
!1177 = !DILocation(line: 628, column: 47, scope: !1175)
!1178 = !DILocation(line: 628, column: 51, scope: !1175)
!1179 = !DILocation(line: 628, column: 56, scope: !1175)
!1180 = !DILocation(line: 628, column: 15, scope: !1175)
!1181 = !DILocation(line: 628, column: 13, scope: !1175)
!1182 = !DILocation(line: 629, column: 13, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1175, file: !668, line: 629, column: 13)
!1184 = !DILocation(line: 629, column: 17, scope: !1183)
!1185 = !DILocation(line: 629, column: 13, scope: !1175)
!1186 = !DILocation(line: 630, column: 20, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1183, file: !668, line: 629, column: 22)
!1188 = !DILocation(line: 630, column: 13, scope: !1187)
!1189 = !DILocation(line: 631, column: 13, scope: !1187)
!1190 = !DILocation(line: 634, column: 16, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1175, file: !668, line: 634, column: 9)
!1192 = !DILocation(line: 634, column: 14, scope: !1191)
!1193 = !DILocation(line: 634, column: 21, scope: !1194)
!1194 = !DILexicalBlockFile(scope: !1195, file: !668, discriminator: 1)
!1195 = distinct !DILexicalBlock(scope: !1191, file: !668, line: 634, column: 9)
!1196 = !DILocation(line: 634, column: 25, scope: !1194)
!1197 = !DILocation(line: 634, column: 29, scope: !1194)
!1198 = !DILocation(line: 634, column: 23, scope: !1194)
!1199 = !DILocation(line: 634, column: 9, scope: !1194)
!1200 = !DILocation(line: 635, column: 27, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1202, file: !668, line: 635, column: 17)
!1202 = distinct !DILexicalBlock(scope: !1195, file: !668, line: 634, column: 44)
!1203 = !DILocation(line: 635, column: 17, scope: !1201)
!1204 = !DILocation(line: 635, column: 21, scope: !1201)
!1205 = !DILocation(line: 635, column: 30, scope: !1201)
!1206 = !DILocation(line: 635, column: 35, scope: !1201)
!1207 = !DILocation(line: 635, column: 17, scope: !1202)
!1208 = !DILocation(line: 636, column: 48, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1201, file: !668, line: 635, column: 52)
!1210 = !DILocation(line: 636, column: 63, scope: !1209)
!1211 = !DILocation(line: 636, column: 53, scope: !1209)
!1212 = !DILocation(line: 636, column: 57, scope: !1209)
!1213 = !DILocation(line: 636, column: 66, scope: !1209)
!1214 = !DILocation(line: 636, column: 23, scope: !1209)
!1215 = !DILocation(line: 636, column: 21, scope: !1209)
!1216 = !DILocation(line: 637, column: 21, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !1209, file: !668, line: 637, column: 21)
!1218 = !DILocation(line: 637, column: 25, scope: !1217)
!1219 = !DILocation(line: 637, column: 21, scope: !1209)
!1220 = !DILocation(line: 638, column: 21, scope: !1217)
!1221 = !DILocation(line: 639, column: 13, scope: !1209)
!1222 = !DILocation(line: 640, column: 9, scope: !1202)
!1223 = !DILocation(line: 634, column: 40, scope: !1224)
!1224 = !DILexicalBlockFile(scope: !1195, file: !668, discriminator: 2)
!1225 = !DILocation(line: 634, column: 9, scope: !1224)
!1226 = distinct !{!1226, !1227}
!1227 = !DILocation(line: 634, column: 9, scope: !1175)
!1228 = !DILocation(line: 642, column: 38, scope: !1175)
!1229 = !DILocation(line: 642, column: 43, scope: !1175)
!1230 = !DILocation(line: 642, column: 48, scope: !1175)
!1231 = !DILocation(line: 642, column: 53, scope: !1175)
!1232 = !DILocation(line: 642, column: 62, scope: !1175)
!1233 = !DILocation(line: 642, column: 15, scope: !1175)
!1234 = !DILocation(line: 642, column: 13, scope: !1175)
!1235 = !DILocation(line: 643, column: 13, scope: !1236)
!1236 = distinct !DILexicalBlock(scope: !1175, file: !668, line: 643, column: 13)
!1237 = !DILocation(line: 643, column: 17, scope: !1236)
!1238 = !DILocation(line: 643, column: 13, scope: !1175)
!1239 = !DILocation(line: 644, column: 20, scope: !1240)
!1240 = distinct !DILexicalBlock(scope: !1236, file: !668, line: 643, column: 22)
!1241 = !DILocation(line: 644, column: 13, scope: !1240)
!1242 = !DILocation(line: 645, column: 13, scope: !1240)
!1243 = !DILocation(line: 647, column: 5, scope: !1175)
!1244 = !DILocation(line: 649, column: 9, scope: !1074)
!1245 = !DILocation(line: 649, column: 5, scope: !1074)
!1246 = !DILocation(line: 651, column: 28, scope: !1074)
!1247 = !DILocation(line: 651, column: 33, scope: !1074)
!1248 = !DILocation(line: 651, column: 38, scope: !1074)
!1249 = !DILocation(line: 651, column: 5, scope: !1074)
!1250 = !DILocation(line: 652, column: 12, scope: !1074)
!1251 = !DILocation(line: 652, column: 5, scope: !1074)
!1252 = !DILocation(line: 653, column: 1, scope: !1074)
!1253 = !DILocalVariable(name: "bsf", arg: 1, scope: !1066, file: !668, line: 280, type: !821)
!1254 = !DILocation(line: 280, column: 47, scope: !1066)
!1255 = !DILocalVariable(name: "out", arg: 2, scope: !1066, file: !668, line: 280, type: !878)
!1256 = !DILocation(line: 280, column: 62, scope: !1066)
!1257 = !DILocalVariable(name: "ctx", scope: !1066, file: !668, line: 282, type: !1079)
!1258 = !DILocation(line: 282, column: 26, scope: !1066)
!1259 = !DILocation(line: 282, column: 32, scope: !1066)
!1260 = !DILocation(line: 282, column: 37, scope: !1066)
!1261 = !DILocalVariable(name: "in", scope: !1066, file: !668, line: 283, type: !878)
!1262 = !DILocation(line: 283, column: 15, scope: !1066)
!1263 = !DILocalVariable(name: "au", scope: !1066, file: !668, line: 284, type: !1150)
!1264 = !DILocation(line: 284, column: 29, scope: !1066)
!1265 = !DILocation(line: 284, column: 35, scope: !1066)
!1266 = !DILocation(line: 284, column: 40, scope: !1066)
!1267 = !DILocalVariable(name: "err", scope: !1066, file: !668, line: 285, type: !713)
!1268 = !DILocation(line: 285, column: 9, scope: !1066)
!1269 = !DILocalVariable(name: "i", scope: !1066, file: !668, line: 285, type: !713)
!1270 = !DILocation(line: 285, column: 14, scope: !1066)
!1271 = !DILocalVariable(name: "j", scope: !1066, file: !668, line: 285, type: !713)
!1272 = !DILocation(line: 285, column: 17, scope: !1066)
!1273 = !DILocalVariable(name: "has_sps", scope: !1066, file: !668, line: 285, type: !713)
!1274 = !DILocation(line: 285, column: 20, scope: !1066)
!1275 = !DILocalVariable(name: "aud", scope: !1066, file: !668, line: 286, type: !1276)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264RawAUD", file: !934, line: 232, baseType: !1277)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264RawAUD", file: !934, line: 228, size: 48, align: 8, elements: !1278)
!1278 = !{!1279, !1280}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "nal_unit_header", scope: !1277, file: !934, line: 229, baseType: !938, size: 40, align: 8)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "primary_pic_type", scope: !1277, file: !934, line: 231, baseType: !716, size: 8, align: 8, offset: 40)
!1281 = !DILocation(line: 286, column: 16, scope: !1066)
!1282 = !DILocalVariable(name: "displaymatrix_side_data", scope: !1066, file: !668, line: 287, type: !715)
!1283 = !DILocation(line: 287, column: 14, scope: !1066)
!1284 = !DILocalVariable(name: "displaymatrix_side_data_size", scope: !1066, file: !668, line: 288, type: !1108)
!1285 = !DILocation(line: 288, column: 12, scope: !1066)
!1286 = !DILocation(line: 290, column: 29, scope: !1066)
!1287 = !DILocation(line: 290, column: 11, scope: !1066)
!1288 = !DILocation(line: 290, column: 9, scope: !1066)
!1289 = !DILocation(line: 291, column: 9, scope: !1290)
!1290 = distinct !DILexicalBlock(scope: !1066, file: !668, line: 291, column: 9)
!1291 = !DILocation(line: 291, column: 13, scope: !1290)
!1292 = !DILocation(line: 291, column: 9, scope: !1066)
!1293 = !DILocation(line: 292, column: 16, scope: !1290)
!1294 = !DILocation(line: 292, column: 9, scope: !1290)
!1295 = !DILocation(line: 294, column: 30, scope: !1066)
!1296 = !DILocation(line: 294, column: 35, scope: !1066)
!1297 = !DILocation(line: 294, column: 40, scope: !1066)
!1298 = !DILocation(line: 294, column: 44, scope: !1066)
!1299 = !DILocation(line: 294, column: 11, scope: !1066)
!1300 = !DILocation(line: 294, column: 9, scope: !1066)
!1301 = !DILocation(line: 295, column: 9, scope: !1302)
!1302 = distinct !DILexicalBlock(scope: !1066, file: !668, line: 295, column: 9)
!1303 = !DILocation(line: 295, column: 13, scope: !1302)
!1304 = !DILocation(line: 295, column: 9, scope: !1066)
!1305 = !DILocation(line: 296, column: 16, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1302, file: !668, line: 295, column: 18)
!1307 = !DILocation(line: 296, column: 9, scope: !1306)
!1308 = !DILocation(line: 297, column: 9, scope: !1306)
!1309 = !DILocation(line: 300, column: 9, scope: !1310)
!1310 = distinct !DILexicalBlock(scope: !1066, file: !668, line: 300, column: 9)
!1311 = !DILocation(line: 300, column: 13, scope: !1310)
!1312 = !DILocation(line: 300, column: 22, scope: !1310)
!1313 = !DILocation(line: 300, column: 9, scope: !1066)
!1314 = !DILocation(line: 301, column: 16, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1310, file: !668, line: 300, column: 28)
!1316 = !DILocation(line: 301, column: 9, scope: !1315)
!1317 = !DILocation(line: 302, column: 13, scope: !1315)
!1318 = !DILocation(line: 303, column: 9, scope: !1315)
!1319 = !DILocation(line: 307, column: 9, scope: !1320)
!1320 = distinct !DILexicalBlock(scope: !1066, file: !668, line: 307, column: 9)
!1321 = !DILocation(line: 307, column: 13, scope: !1320)
!1322 = !DILocation(line: 307, column: 22, scope: !1320)
!1323 = !DILocation(line: 307, column: 27, scope: !1320)
!1324 = !DILocation(line: 307, column: 9, scope: !1066)
!1325 = !DILocation(line: 308, column: 13, scope: !1326)
!1326 = distinct !DILexicalBlock(scope: !1327, file: !668, line: 308, column: 13)
!1327 = distinct !DILexicalBlock(scope: !1320, file: !668, line: 307, column: 44)
!1328 = !DILocation(line: 308, column: 18, scope: !1326)
!1329 = !DILocation(line: 308, column: 22, scope: !1326)
!1330 = !DILocation(line: 308, column: 13, scope: !1327)
!1331 = !DILocation(line: 309, column: 32, scope: !1326)
!1332 = !DILocation(line: 309, column: 37, scope: !1326)
!1333 = !DILocation(line: 309, column: 42, scope: !1326)
!1334 = !DILocation(line: 309, column: 13, scope: !1326)
!1335 = !DILocation(line: 310, column: 5, scope: !1327)
!1336 = !DILocation(line: 311, column: 13, scope: !1337)
!1337 = distinct !DILexicalBlock(scope: !1338, file: !668, line: 311, column: 13)
!1338 = distinct !DILexicalBlock(scope: !1320, file: !668, line: 310, column: 12)
!1339 = !DILocation(line: 311, column: 18, scope: !1337)
!1340 = !DILocation(line: 311, column: 22, scope: !1337)
!1341 = !DILocation(line: 311, column: 13, scope: !1338)
!1342 = !DILocalVariable(name: "primary_pic_type_mask", scope: !1343, file: !668, line: 322, type: !713)
!1343 = distinct !DILexicalBlock(scope: !1337, file: !668, line: 311, column: 33)
!1344 = !DILocation(line: 322, column: 17, scope: !1343)
!1345 = !DILocation(line: 324, column: 20, scope: !1346)
!1346 = distinct !DILexicalBlock(scope: !1343, file: !668, line: 324, column: 13)
!1347 = !DILocation(line: 324, column: 18, scope: !1346)
!1348 = !DILocation(line: 324, column: 25, scope: !1349)
!1349 = !DILexicalBlockFile(scope: !1350, file: !668, discriminator: 1)
!1350 = distinct !DILexicalBlock(scope: !1346, file: !668, line: 324, column: 13)
!1351 = !DILocation(line: 324, column: 29, scope: !1349)
!1352 = !DILocation(line: 324, column: 33, scope: !1349)
!1353 = !DILocation(line: 324, column: 27, scope: !1349)
!1354 = !DILocation(line: 324, column: 13, scope: !1349)
!1355 = !DILocation(line: 325, column: 31, scope: !1356)
!1356 = distinct !DILexicalBlock(scope: !1357, file: !668, line: 325, column: 21)
!1357 = distinct !DILexicalBlock(scope: !1350, file: !668, line: 324, column: 48)
!1358 = !DILocation(line: 325, column: 21, scope: !1356)
!1359 = !DILocation(line: 325, column: 25, scope: !1356)
!1360 = !DILocation(line: 325, column: 34, scope: !1356)
!1361 = !DILocation(line: 325, column: 39, scope: !1356)
!1362 = !DILocation(line: 325, column: 57, scope: !1356)
!1363 = !DILocation(line: 326, column: 31, scope: !1356)
!1364 = !DILocation(line: 326, column: 21, scope: !1356)
!1365 = !DILocation(line: 326, column: 25, scope: !1356)
!1366 = !DILocation(line: 326, column: 34, scope: !1356)
!1367 = !DILocation(line: 326, column: 39, scope: !1356)
!1368 = !DILocation(line: 325, column: 21, scope: !1369)
!1369 = !DILexicalBlockFile(scope: !1357, file: !668, discriminator: 1)
!1370 = !DILocalVariable(name: "slice", scope: !1371, file: !668, line: 327, type: !1372)
!1371 = distinct !DILexicalBlock(scope: !1356, file: !668, line: 326, column: 62)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264RawSlice", file: !934, line: 431, baseType: !1374)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264RawSlice", file: !934, line: 424, size: 17664, align: 64, elements: !1375)
!1375 = !{!1376, !1449, !1450, !1451, !1452}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1374, file: !934, line: 425, baseType: !1377, size: 17376, align: 32)
!1377 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264RawSliceHeader", file: !934, line: 422, baseType: !1378)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264RawSliceHeader", file: !934, line: 346, size: 17376, align: 32, elements: !1379)
!1379 = !{!1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1409, !1410, !1411, !1412, !1413, !1415, !1416, !1417, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "nal_unit_header", scope: !1378, file: !934, line: 347, baseType: !938, size: 40, align: 8)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "first_mb_in_slice", scope: !1378, file: !934, line: 349, baseType: !842, size: 32, align: 32, offset: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !1378, file: !934, line: 350, baseType: !716, size: 8, align: 8, offset: 96)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !1378, file: !934, line: 352, baseType: !716, size: 8, align: 8, offset: 104)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "colour_plane_id", scope: !1378, file: !934, line: 354, baseType: !716, size: 8, align: 8, offset: 112)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !1378, file: !934, line: 356, baseType: !719, size: 16, align: 16, offset: 128)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !1378, file: !934, line: 357, baseType: !716, size: 8, align: 8, offset: 144)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !1378, file: !934, line: 358, baseType: !716, size: 8, align: 8, offset: 152)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !1378, file: !934, line: 360, baseType: !719, size: 16, align: 16, offset: 160)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_lsb", scope: !1378, file: !934, line: 362, baseType: !719, size: 16, align: 16, offset: 176)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt_bottom", scope: !1378, file: !934, line: 363, baseType: !985, size: 32, align: 32, offset: 192)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !1378, file: !934, line: 364, baseType: !1392, size: 64, align: 32, offset: 224)
!1392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 64, align: 32, elements: !919)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt", scope: !1378, file: !934, line: 366, baseType: !716, size: 8, align: 8, offset: 288)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "direct_spatial_mv_pred_flag", scope: !1378, file: !934, line: 367, baseType: !716, size: 8, align: 8, offset: 296)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_active_override_flag", scope: !1378, file: !934, line: 369, baseType: !716, size: 8, align: 8, offset: 304)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !1378, file: !934, line: 370, baseType: !716, size: 8, align: 8, offset: 312)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !1378, file: !934, line: 371, baseType: !716, size: 8, align: 8, offset: 320)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_modification_flag_l0", scope: !1378, file: !934, line: 373, baseType: !716, size: 8, align: 8, offset: 328)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_modification_flag_l1", scope: !1378, file: !934, line: 374, baseType: !716, size: 8, align: 8, offset: 336)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "rplm_l0", scope: !1378, file: !934, line: 379, baseType: !1401, size: 3168, align: 32, offset: 352)
!1401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1402, size: 3168, align: 32, elements: !1407)
!1402 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1378, file: !934, line: 375, size: 96, align: 32, elements: !1403)
!1403 = !{!1404, !1405, !1406}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "modification_of_pic_nums_idc", scope: !1402, file: !934, line: 376, baseType: !716, size: 8, align: 8)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1", scope: !1402, file: !934, line: 377, baseType: !985, size: 32, align: 32, offset: 32)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !1402, file: !934, line: 378, baseType: !716, size: 8, align: 8, offset: 64)
!1407 = !{!1408}
!1408 = !DISubrange(count: 33)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "rplm_l1", scope: !1378, file: !934, line: 379, baseType: !1401, size: 3168, align: 32, offset: 3520)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "luma_log2_weight_denom", scope: !1378, file: !934, line: 381, baseType: !716, size: 8, align: 8, offset: 6688)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_log2_weight_denom", scope: !1378, file: !934, line: 382, baseType: !716, size: 8, align: 8, offset: 6696)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "luma_weight_l0_flag", scope: !1378, file: !934, line: 384, baseType: !1043, size: 256, align: 8, offset: 6704)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "luma_weight_l0", scope: !1378, file: !934, line: 385, baseType: !1414, size: 256, align: 8, offset: 6960)
!1414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !973, size: 256, align: 8, elements: !1039)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "luma_offset_l0", scope: !1378, file: !934, line: 386, baseType: !1414, size: 256, align: 8, offset: 7216)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_weight_l0_flag", scope: !1378, file: !934, line: 387, baseType: !1043, size: 256, align: 8, offset: 7472)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_weight_l0", scope: !1378, file: !934, line: 388, baseType: !1418, size: 512, align: 8, offset: 7728)
!1418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !973, size: 512, align: 8, elements: !1419)
!1419 = !{!1040, !920}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_offset_l0", scope: !1378, file: !934, line: 389, baseType: !1418, size: 512, align: 8, offset: 8240)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "luma_weight_l1_flag", scope: !1378, file: !934, line: 391, baseType: !1043, size: 256, align: 8, offset: 8752)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "luma_weight_l1", scope: !1378, file: !934, line: 392, baseType: !1414, size: 256, align: 8, offset: 9008)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "luma_offset_l1", scope: !1378, file: !934, line: 393, baseType: !1414, size: 256, align: 8, offset: 9264)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_weight_l1_flag", scope: !1378, file: !934, line: 394, baseType: !1043, size: 256, align: 8, offset: 9520)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_weight_l1", scope: !1378, file: !934, line: 395, baseType: !1418, size: 512, align: 8, offset: 9776)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_offset_l1", scope: !1378, file: !934, line: 396, baseType: !1418, size: 512, align: 8, offset: 10288)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !1378, file: !934, line: 398, baseType: !716, size: 8, align: 8, offset: 10800)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !1378, file: !934, line: 399, baseType: !716, size: 8, align: 8, offset: 10808)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_marking_mode_flag", scope: !1378, file: !934, line: 401, baseType: !716, size: 8, align: 8, offset: 10816)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !1378, file: !934, line: 408, baseType: !1431, size: 6432, align: 32, offset: 10848)
!1431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1432, size: 6432, align: 32, elements: !1439)
!1432 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1378, file: !934, line: 402, size: 96, align: 32, elements: !1433)
!1433 = !{!1434, !1435, !1436, !1437, !1438}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !1432, file: !934, line: 403, baseType: !716, size: 8, align: 8)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !1432, file: !934, line: 404, baseType: !985, size: 32, align: 32, offset: 32)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !1432, file: !934, line: 405, baseType: !716, size: 8, align: 8, offset: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !1432, file: !934, line: 406, baseType: !716, size: 8, align: 8, offset: 72)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !1432, file: !934, line: 407, baseType: !716, size: 8, align: 8, offset: 80)
!1439 = !{!1440}
!1440 = !DISubrange(count: 67)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "cabac_init_idc", scope: !1378, file: !934, line: 410, baseType: !716, size: 8, align: 8, offset: 17280)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !1378, file: !934, line: 412, baseType: !973, size: 8, align: 8, offset: 17288)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "sp_for_switch_flag", scope: !1378, file: !934, line: 414, baseType: !716, size: 8, align: 8, offset: 17296)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qs_delta", scope: !1378, file: !934, line: 415, baseType: !973, size: 8, align: 8, offset: 17304)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "disable_deblocking_filter_idc", scope: !1378, file: !934, line: 417, baseType: !716, size: 8, align: 8, offset: 17312)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "slice_alpha_c0_offset_div2", scope: !1378, file: !934, line: 418, baseType: !973, size: 8, align: 8, offset: 17320)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "slice_beta_offset_div2", scope: !1378, file: !934, line: 419, baseType: !973, size: 8, align: 8, offset: 17328)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_cycle", scope: !1378, file: !934, line: 421, baseType: !719, size: 16, align: 16, offset: 17344)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1374, file: !934, line: 427, baseType: !715, size: 64, align: 64, offset: 17408)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !1374, file: !934, line: 428, baseType: !1108, size: 64, align: 64, offset: 17472)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_start", scope: !1374, file: !934, line: 429, baseType: !713, size: 32, align: 32, offset: 17536)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "data_ref", scope: !1374, file: !934, line: 430, baseType: !883, size: 64, align: 64, offset: 17600)
!1453 = !DILocation(line: 327, column: 35, scope: !1371)
!1454 = !DILocation(line: 327, column: 53, scope: !1371)
!1455 = !DILocation(line: 327, column: 43, scope: !1371)
!1456 = !DILocation(line: 327, column: 47, scope: !1371)
!1457 = !DILocation(line: 327, column: 56, scope: !1371)
!1458 = !DILocation(line: 328, column: 28, scope: !1459)
!1459 = distinct !DILexicalBlock(scope: !1371, file: !668, line: 328, column: 21)
!1460 = !DILocation(line: 328, column: 26, scope: !1459)
!1461 = !DILocation(line: 328, column: 33, scope: !1462)
!1462 = !DILexicalBlockFile(scope: !1463, file: !668, discriminator: 1)
!1463 = distinct !DILexicalBlock(scope: !1459, file: !668, line: 328, column: 21)
!1464 = !DILocation(line: 328, column: 35, scope: !1462)
!1465 = !DILocation(line: 328, column: 21, scope: !1462)
!1466 = !DILocation(line: 329, column: 55, scope: !1467)
!1467 = distinct !DILexicalBlock(scope: !1468, file: !668, line: 329, column: 30)
!1468 = distinct !DILexicalBlock(scope: !1463, file: !668, line: 328, column: 114)
!1469 = !DILocation(line: 329, column: 32, scope: !1467)
!1470 = !DILocation(line: 330, column: 38, scope: !1467)
!1471 = !DILocation(line: 330, column: 45, scope: !1467)
!1472 = !DILocation(line: 330, column: 52, scope: !1467)
!1473 = !DILocation(line: 330, column: 35, scope: !1467)
!1474 = !DILocation(line: 329, column: 58, scope: !1467)
!1475 = !DILocation(line: 329, column: 30, scope: !1468)
!1476 = !DILocation(line: 331, column: 62, scope: !1467)
!1477 = !DILocation(line: 331, column: 59, scope: !1467)
!1478 = !DILocation(line: 331, column: 55, scope: !1467)
!1479 = !DILocation(line: 331, column: 52, scope: !1467)
!1480 = !DILocation(line: 331, column: 30, scope: !1467)
!1481 = !DILocation(line: 332, column: 21, scope: !1468)
!1482 = !DILocation(line: 328, column: 110, scope: !1483)
!1483 = !DILexicalBlockFile(scope: !1463, file: !668, discriminator: 2)
!1484 = !DILocation(line: 328, column: 21, scope: !1483)
!1485 = distinct !{!1485, !1486}
!1486 = !DILocation(line: 328, column: 21, scope: !1371)
!1487 = !DILocation(line: 333, column: 17, scope: !1371)
!1488 = !DILocation(line: 334, column: 13, scope: !1357)
!1489 = !DILocation(line: 324, column: 44, scope: !1490)
!1490 = !DILexicalBlockFile(scope: !1350, file: !668, discriminator: 2)
!1491 = !DILocation(line: 324, column: 13, scope: !1490)
!1492 = distinct !{!1492, !1493}
!1493 = !DILocation(line: 324, column: 13, scope: !1343)
!1494 = !DILocation(line: 335, column: 20, scope: !1495)
!1495 = distinct !DILexicalBlock(scope: !1343, file: !668, line: 335, column: 13)
!1496 = !DILocation(line: 335, column: 18, scope: !1495)
!1497 = !DILocation(line: 335, column: 25, scope: !1498)
!1498 = !DILexicalBlockFile(scope: !1499, file: !668, discriminator: 1)
!1499 = distinct !DILexicalBlock(scope: !1495, file: !668, line: 335, column: 13)
!1500 = !DILocation(line: 335, column: 27, scope: !1498)
!1501 = !DILocation(line: 335, column: 13, scope: !1498)
!1502 = !DILocation(line: 336, column: 21, scope: !1503)
!1503 = distinct !DILexicalBlock(scope: !1499, file: !668, line: 336, column: 21)
!1504 = !DILocation(line: 336, column: 51, scope: !1503)
!1505 = !DILocation(line: 336, column: 48, scope: !1503)
!1506 = !DILocation(line: 336, column: 43, scope: !1503)
!1507 = !DILocation(line: 336, column: 21, scope: !1499)
!1508 = !DILocation(line: 337, column: 21, scope: !1503)
!1509 = !DILocation(line: 336, column: 52, scope: !1510)
!1510 = !DILexicalBlockFile(scope: !1503, file: !668, discriminator: 1)
!1511 = !DILocation(line: 335, column: 102, scope: !1512)
!1512 = !DILexicalBlockFile(scope: !1499, file: !668, discriminator: 2)
!1513 = !DILocation(line: 335, column: 13, scope: !1512)
!1514 = distinct !{!1514, !1515}
!1515 = !DILocation(line: 335, column: 13, scope: !1343)
!1516 = !DILocation(line: 338, column: 17, scope: !1517)
!1517 = distinct !DILexicalBlock(scope: !1343, file: !668, line: 338, column: 17)
!1518 = !DILocation(line: 338, column: 19, scope: !1517)
!1519 = !DILocation(line: 338, column: 17, scope: !1343)
!1520 = !DILocation(line: 339, column: 24, scope: !1521)
!1521 = distinct !DILexicalBlock(scope: !1517, file: !668, line: 338, column: 94)
!1522 = !DILocation(line: 339, column: 17, scope: !1521)
!1523 = !DILocation(line: 341, column: 21, scope: !1521)
!1524 = !DILocation(line: 342, column: 17, scope: !1521)
!1525 = !DILocation(line: 345, column: 32, scope: !1343)
!1526 = !DILocation(line: 346, column: 33, scope: !1343)
!1527 = !DILocation(line: 347, column: 37, scope: !1343)
!1528 = !DILocation(line: 345, column: 19, scope: !1343)
!1529 = !DILocation(line: 350, column: 46, scope: !1343)
!1530 = !DILocation(line: 350, column: 51, scope: !1343)
!1531 = !DILocation(line: 350, column: 56, scope: !1343)
!1532 = !DILocation(line: 351, column: 63, scope: !1343)
!1533 = !DILocation(line: 350, column: 19, scope: !1343)
!1534 = !DILocation(line: 350, column: 17, scope: !1343)
!1535 = !DILocation(line: 352, column: 17, scope: !1536)
!1536 = distinct !DILexicalBlock(scope: !1343, file: !668, line: 352, column: 17)
!1537 = !DILocation(line: 352, column: 21, scope: !1536)
!1538 = !DILocation(line: 352, column: 17, scope: !1343)
!1539 = !DILocation(line: 353, column: 24, scope: !1540)
!1540 = distinct !DILexicalBlock(scope: !1536, file: !668, line: 352, column: 26)
!1541 = !DILocation(line: 353, column: 17, scope: !1540)
!1542 = !DILocation(line: 354, column: 17, scope: !1540)
!1543 = !DILocation(line: 356, column: 9, scope: !1343)
!1544 = !DILocation(line: 359, column: 13, scope: !1066)
!1545 = !DILocation(line: 360, column: 12, scope: !1546)
!1546 = distinct !DILexicalBlock(scope: !1066, file: !668, line: 360, column: 5)
!1547 = !DILocation(line: 360, column: 10, scope: !1546)
!1548 = !DILocation(line: 360, column: 17, scope: !1549)
!1549 = !DILexicalBlockFile(scope: !1550, file: !668, discriminator: 1)
!1550 = distinct !DILexicalBlock(scope: !1546, file: !668, line: 360, column: 5)
!1551 = !DILocation(line: 360, column: 21, scope: !1549)
!1552 = !DILocation(line: 360, column: 25, scope: !1549)
!1553 = !DILocation(line: 360, column: 19, scope: !1549)
!1554 = !DILocation(line: 360, column: 5, scope: !1549)
!1555 = !DILocation(line: 361, column: 23, scope: !1556)
!1556 = distinct !DILexicalBlock(scope: !1557, file: !668, line: 361, column: 13)
!1557 = distinct !DILexicalBlock(scope: !1550, file: !668, line: 360, column: 40)
!1558 = !DILocation(line: 361, column: 13, scope: !1556)
!1559 = !DILocation(line: 361, column: 17, scope: !1556)
!1560 = !DILocation(line: 361, column: 26, scope: !1556)
!1561 = !DILocation(line: 361, column: 31, scope: !1556)
!1562 = !DILocation(line: 361, column: 13, scope: !1557)
!1563 = !DILocation(line: 362, column: 44, scope: !1564)
!1564 = distinct !DILexicalBlock(scope: !1556, file: !668, line: 361, column: 48)
!1565 = !DILocation(line: 362, column: 59, scope: !1564)
!1566 = !DILocation(line: 362, column: 49, scope: !1564)
!1567 = !DILocation(line: 362, column: 53, scope: !1564)
!1568 = !DILocation(line: 362, column: 62, scope: !1564)
!1569 = !DILocation(line: 362, column: 19, scope: !1564)
!1570 = !DILocation(line: 362, column: 17, scope: !1564)
!1571 = !DILocation(line: 363, column: 17, scope: !1572)
!1572 = distinct !DILexicalBlock(scope: !1564, file: !668, line: 363, column: 17)
!1573 = !DILocation(line: 363, column: 21, scope: !1572)
!1574 = !DILocation(line: 363, column: 17, scope: !1564)
!1575 = !DILocation(line: 364, column: 17, scope: !1572)
!1576 = !DILocation(line: 365, column: 21, scope: !1564)
!1577 = !DILocation(line: 366, column: 9, scope: !1564)
!1578 = !DILocation(line: 367, column: 5, scope: !1557)
!1579 = !DILocation(line: 360, column: 36, scope: !1580)
!1580 = !DILexicalBlockFile(scope: !1550, file: !668, discriminator: 2)
!1581 = !DILocation(line: 360, column: 5, scope: !1580)
!1582 = distinct !{!1582, !1583}
!1583 = !DILocation(line: 360, column: 5, scope: !1066)
!1584 = !DILocation(line: 371, column: 9, scope: !1585)
!1585 = distinct !DILexicalBlock(scope: !1066, file: !668, line: 371, column: 9)
!1586 = !DILocation(line: 371, column: 14, scope: !1585)
!1587 = !DILocation(line: 371, column: 28, scope: !1585)
!1588 = !DILocation(line: 371, column: 32, scope: !1589)
!1589 = !DILexicalBlockFile(scope: !1585, file: !668, discriminator: 1)
!1590 = !DILocation(line: 371, column: 40, scope: !1589)
!1591 = !DILocation(line: 371, column: 44, scope: !1592)
!1592 = !DILexicalBlockFile(scope: !1585, file: !668, discriminator: 2)
!1593 = !DILocation(line: 371, column: 49, scope: !1592)
!1594 = !DILocation(line: 371, column: 9, scope: !1592)
!1595 = !DILocalVariable(name: "payload", scope: !1596, file: !668, line: 372, type: !1597)
!1596 = distinct !DILexicalBlock(scope: !1585, file: !668, line: 371, column: 65)
!1597 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264RawSEIPayload", file: !934, line: 337, baseType: !1598)
!1598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264RawSEIPayload", file: !934, line: 318, size: 4224, align: 64, elements: !1599)
!1599 = !{!1600, !1601, !1602}
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "payload_type", scope: !1598, file: !934, line: 319, baseType: !842, size: 32, align: 32)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "payload_size", scope: !1598, file: !934, line: 320, baseType: !842, size: 32, align: 32, offset: 32)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !1598, file: !934, line: 336, baseType: !1603, size: 4160, align: 64, offset: 64)
!1603 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1598, file: !934, line: 321, size: 4160, align: 64, elements: !1604)
!1604 = !{!1605, !1616, !1646, !1659, !1668, !1679, !1687, !1697, !1708}
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "buffering_period", scope: !1603, file: !934, line: 322, baseType: !1606, size: 4128, align: 32)
!1606 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264RawSEIBufferingPeriod", file: !934, line: 240, baseType: !1607)
!1607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264RawSEIBufferingPeriod", file: !934, line: 234, size: 4128, align: 32, elements: !1608)
!1608 = !{!1609, !1610, !1615}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !1607, file: !934, line: 235, baseType: !716, size: 8, align: 8)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !1607, file: !934, line: 239, baseType: !1611, size: 2048, align: 32, offset: 32)
!1611 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1607, file: !934, line: 236, size: 2048, align: 32, elements: !1612)
!1612 = !{!1613, !1614}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !1611, file: !934, line: 237, baseType: !1038, size: 1024, align: 32)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !1611, file: !934, line: 238, baseType: !1038, size: 1024, align: 32, offset: 1024)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "vcl", scope: !1607, file: !934, line: 239, baseType: !1611, size: 2048, align: 32, offset: 2080)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "pic_timing", scope: !1603, file: !934, line: 323, baseType: !1617, size: 576, align: 32)
!1617 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264RawSEIPicTiming", file: !934, line: 265, baseType: !1618)
!1618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264RawSEIPicTiming", file: !934, line: 259, size: 576, align: 32, elements: !1619)
!1619 = !{!1620, !1621, !1622, !1623, !1627}
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay", scope: !1618, file: !934, line: 260, baseType: !842, size: 32, align: 32)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay", scope: !1618, file: !934, line: 261, baseType: !842, size: 32, align: 32, offset: 32)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct", scope: !1618, file: !934, line: 262, baseType: !716, size: 8, align: 8, offset: 64)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "clock_timestamp_flag", scope: !1618, file: !934, line: 263, baseType: !1624, size: 24, align: 8, offset: 72)
!1624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 24, align: 8, elements: !1625)
!1625 = !{!1626}
!1626 = !DISubrange(count: 3)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !1618, file: !934, line: 264, baseType: !1628, size: 480, align: 32, offset: 96)
!1628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1629, size: 480, align: 32, elements: !1625)
!1629 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264RawSEIPicTimestamp", file: !934, line: 257, baseType: !1630)
!1630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264RawSEIPicTimestamp", file: !934, line: 242, size: 160, align: 32, elements: !1631)
!1631 = !{!1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645}
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "ct_type", scope: !1630, file: !934, line: 243, baseType: !716, size: 8, align: 8)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "nuit_field_based_flag", scope: !1630, file: !934, line: 244, baseType: !716, size: 8, align: 8, offset: 8)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "counting_type", scope: !1630, file: !934, line: 245, baseType: !716, size: 8, align: 8, offset: 16)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "full_timestamp_flag", scope: !1630, file: !934, line: 246, baseType: !716, size: 8, align: 8, offset: 24)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "discontinuity_flag", scope: !1630, file: !934, line: 247, baseType: !716, size: 8, align: 8, offset: 32)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "cnt_dropped_flag", scope: !1630, file: !934, line: 248, baseType: !716, size: 8, align: 8, offset: 40)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "n_frames", scope: !1630, file: !934, line: 249, baseType: !716, size: 8, align: 8, offset: 48)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "seconds_flag", scope: !1630, file: !934, line: 250, baseType: !716, size: 8, align: 8, offset: 56)
