; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--aptx.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--aptx.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!878 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!879 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!880 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "channels", file: !888, line: 30, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/aptx.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!889 = !{!890, !891, !892}
!890 = !DIEnumerator(name: "LEFT", value: 0)
!891 = !DIEnumerator(name: "RIGHT", value: 1)
!892 = !DIEnumerator(name: "NB_CHANNELS", value: 2)
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "subbands", file: !888, line: 36, size: 32, align: 32, elements: !894)
!894 = !{!895, !896, !897, !898, !899}
!895 = !DIEnumerator(name: "LF", value: 0)
!896 = !DIEnumerator(name: "MLF", value: 1)
!897 = !DIEnumerator(name: "MHF", value: 2)
!898 = !DIEnumerator(name: "HF", value: 3)
!899 = !DIEnumerator(name: "NB_SUBBANDS", value: 4)
!900 = !{!901, !902, !903, !925, !927, !932, !934, !935, !937, !938}
!901 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!902 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "av_alias32", file: !905, line: 41, baseType: !906)
!905 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!906 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !905, line: 36, size: 32, align: 32, elements: !907)
!907 = !{!908, !911, !917, !923}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !906, file: !905, line: 37, baseType: !909, size: 32, align: 32)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !910, line: 51, baseType: !902)
!910 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!911 = !DIDerivedType(tag: DW_TAG_member, name: "u16", scope: !906, file: !905, line: 38, baseType: !912, size: 32, align: 16)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !913, size: 32, align: 16, elements: !915)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !910, line: 49, baseType: !914)
!914 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!915 = !{!916}
!916 = !DISubrange(count: 2)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !906, file: !905, line: 39, baseType: !918, size: 32, align: 8)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !919, size: 32, align: 8, elements: !921)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !910, line: 48, baseType: !920)
!920 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!921 = !{!922}
!922 = !DISubrange(count: 4)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "f32", scope: !906, file: !905, line: 40, baseType: !924, size: 32, align: 32)
!924 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!928 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !905, line: 222, size: 16, align: 8, elements: !930)
!930 = !{!931}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !929, file: !905, line: 222, baseType: !913, size: 16, align: 16)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !910, line: 40, baseType: !933)
!933 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !910, line: 38, baseType: !901)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !904)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!939 = !{!940, !1658, !1659, !1660, !1661, !1668, !1685, !1689, !1690, !1691, !1693, !1697, !1698, !1699, !1701, !1705, !1706, !1707, !1709, !1713, !1714, !1715, !1717, !1721, !1722, !1726, !1728, !1732, !1733, !1735, !1737, !1738, !1739, !1741, !1742, !1746, !1747, !1751, !1753, !1756, !1757}
!940 = distinct !DIGlobalVariable(name: "ff_aptx_decoder", scope: !0, file: !888, line: 1091, type: !941, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_aptx_decoder)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !943)
!943 = !{!944, !948, !949, !950, !951, !952, !961, !964, !967, !970, !975, !976, !1018, !1026, !1027, !1028, !1030, !1573, !1579, !1587, !1591, !1592, !1629, !1633, !1637, !1638, !1642, !1646, !1647, !1651, !1652, !1653}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !942, file: !14, line: 3475, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !942, file: !14, line: 3480, baseType: !945, size: 64, align: 64, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !942, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !942, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !942, file: !14, line: 3487, baseType: !901, size: 32, align: 32, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !942, file: !14, line: 3488, baseType: !953, size: 64, align: 64, offset: 256)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !956, line: 61, baseType: !957)
!956 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !956, line: 58, size: 64, align: 32, elements: !958)
!958 = !{!959, !960}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !957, file: !956, line: 59, baseType: !901, size: 32, align: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !957, file: !956, line: 60, baseType: !901, size: 32, align: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !942, file: !14, line: 3489, baseType: !962, size: 64, align: 64, offset: 320)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !942, file: !14, line: 3490, baseType: !965, size: 64, align: 64, offset: 384)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !942, file: !14, line: 3491, baseType: !968, size: 64, align: 64, offset: 448)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !942, file: !14, line: 3492, baseType: !971, size: 64, align: 64, offset: 512)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !910, line: 55, baseType: !974)
!974 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !942, file: !14, line: 3493, baseType: !919, size: 8, align: 8, offset: 576)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !942, file: !14, line: 3494, baseType: !977, size: 64, align: 64, offset: 640)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !981)
!981 = !{!982, !983, !988, !992, !993, !994, !995, !999, !1005, !1007, !1011}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !980, file: !691, line: 72, baseType: !945, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !980, file: !691, line: 78, baseType: !984, size: 64, align: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!945, !987}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !980, file: !691, line: 85, baseType: !989, size: 64, align: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !980, file: !691, line: 93, baseType: !901, size: 32, align: 32, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !980, file: !691, line: 99, baseType: !901, size: 32, align: 32, offset: 224)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !980, file: !691, line: 108, baseType: !901, size: 32, align: 32, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !980, file: !691, line: 113, baseType: !996, size: 64, align: 64, offset: 320)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!987, !987, !987}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !980, file: !691, line: 123, baseType: !1000, size: 64, align: 64, offset: 384)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!1003, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !980, file: !691, line: 130, baseType: !1006, size: 32, align: 32, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !980, file: !691, line: 136, baseType: !1008, size: 64, align: 64, offset: 512)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!1006, !987}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !980, file: !691, line: 142, baseType: !1012, size: 64, align: 64, offset: 576)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!901, !1015, !987, !945, !901}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !942, file: !14, line: 3495, baseType: !1019, size: 64, align: 64, offset: 704)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1021)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1023)
!1023 = !{!1024, !1025}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1022, file: !14, line: 3402, baseType: !901, size: 32, align: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1022, file: !14, line: 3403, baseType: !945, size: 64, align: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !942, file: !14, line: 3507, baseType: !945, size: 64, align: 64, offset: 768)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !942, file: !14, line: 3516, baseType: !901, size: 32, align: 32, offset: 832)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !942, file: !14, line: 3517, baseType: !1029, size: 64, align: 64, offset: 896)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !942, file: !14, line: 3527, baseType: !1031, size: 64, align: 64, offset: 960)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!901, !1034}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1037)
!1037 = !{!1038, !1039, !1040, !1041, !1044, !1045, !1046, !1047, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1324, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1511, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1036, file: !14, line: 1561, baseType: !977, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1036, file: !14, line: 1562, baseType: !901, size: 32, align: 32, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1036, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1036, file: !14, line: 1565, baseType: !1042, size: 64, align: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1036, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1036, file: !14, line: 1581, baseType: !902, size: 32, align: 32, offset: 224)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1036, file: !14, line: 1583, baseType: !987, size: 64, align: 64, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1036, file: !14, line: 1591, baseType: !1048, size: 64, align: 64, offset: 320)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1050, line: 129, size: 1664, align: 64, elements: !1051)
!1050 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1051 = !{!1052, !1053, !1054, !1055, !1152, !1171, !1172, !1201, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1049, file: !1050, line: 136, baseType: !901, size: 32, align: 32)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1049, file: !1050, line: 151, baseType: !901, size: 32, align: 32, offset: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1049, file: !1050, line: 157, baseType: !901, size: 32, align: 32, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1049, file: !1050, line: 159, baseType: !1056, size: 64, align: 64, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1059)
!1059 = !{!1060, !1064, !1066, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1104, !1106, !1107, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1140, !1141, !1142, !1143, !1144, !1145, !1148, !1149, !1150, !1151}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1058, file: !722, line: 282, baseType: !1061, size: 512, align: 64)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 512, align: 64, elements: !1062)
!1062 = !{!1063}
!1063 = !DISubrange(count: 8)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1058, file: !722, line: 299, baseType: !1065, size: 256, align: 32, offset: 512)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 256, align: 32, elements: !1062)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1058, file: !722, line: 315, baseType: !1067, size: 64, align: 64, offset: 768)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1058, file: !722, line: 326, baseType: !901, size: 32, align: 32, offset: 832)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1058, file: !722, line: 326, baseType: !901, size: 32, align: 32, offset: 864)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1058, file: !722, line: 334, baseType: !901, size: 32, align: 32, offset: 896)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1058, file: !722, line: 341, baseType: !901, size: 32, align: 32, offset: 928)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1058, file: !722, line: 346, baseType: !901, size: 32, align: 32, offset: 960)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1058, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1058, file: !722, line: 356, baseType: !955, size: 64, align: 32, offset: 1024)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1058, file: !722, line: 361, baseType: !932, size: 64, align: 64, offset: 1088)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1058, file: !722, line: 369, baseType: !932, size: 64, align: 64, offset: 1152)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1058, file: !722, line: 377, baseType: !932, size: 64, align: 64, offset: 1216)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1058, file: !722, line: 382, baseType: !901, size: 32, align: 32, offset: 1280)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1058, file: !722, line: 386, baseType: !901, size: 32, align: 32, offset: 1312)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1058, file: !722, line: 391, baseType: !901, size: 32, align: 32, offset: 1344)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1058, file: !722, line: 396, baseType: !987, size: 64, align: 64, offset: 1408)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1058, file: !722, line: 403, baseType: !1083, size: 512, align: 64, offset: 1472)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !973, size: 512, align: 64, elements: !1062)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1058, file: !722, line: 410, baseType: !901, size: 32, align: 32, offset: 1984)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1058, file: !722, line: 415, baseType: !901, size: 32, align: 32, offset: 2016)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1058, file: !722, line: 420, baseType: !901, size: 32, align: 32, offset: 2048)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1058, file: !722, line: 425, baseType: !901, size: 32, align: 32, offset: 2080)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1058, file: !722, line: 435, baseType: !932, size: 64, align: 64, offset: 2112)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1058, file: !722, line: 440, baseType: !901, size: 32, align: 32, offset: 2176)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1058, file: !722, line: 445, baseType: !973, size: 64, align: 64, offset: 2240)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1058, file: !722, line: 459, baseType: !1092, size: 512, align: 64, offset: 2304)
!1092 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1093, size: 512, align: 64, elements: !1062)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1095, line: 94, baseType: !1096)
!1095 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1095, line: 81, size: 192, align: 64, elements: !1097)
!1097 = !{!1098, !1102, !1103}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1096, file: !1095, line: 82, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1095, line: 73, baseType: !1101)
!1101 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1095, line: 73, flags: DIFlagFwdDecl)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1096, file: !1095, line: 89, baseType: !937, size: 64, align: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1096, file: !1095, line: 93, baseType: !901, size: 32, align: 32, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1058, file: !722, line: 473, baseType: !1105, size: 64, align: 64, offset: 2816)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1058, file: !722, line: 477, baseType: !901, size: 32, align: 32, offset: 2880)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1058, file: !722, line: 479, baseType: !1108, size: 64, align: 64, offset: 2944)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1112)
!1112 = !{!1113, !1114, !1115, !1116, !1121}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1111, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1111, file: !722, line: 203, baseType: !937, size: 64, align: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1111, file: !722, line: 204, baseType: !901, size: 32, align: 32, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1111, file: !722, line: 205, baseType: !1117, size: 64, align: 64, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1119, line: 86, baseType: !1120)
!1119 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1120 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1119, line: 86, flags: DIFlagFwdDecl)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1111, file: !722, line: 206, baseType: !1093, size: 64, align: 64, offset: 256)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1058, file: !722, line: 480, baseType: !901, size: 32, align: 32, offset: 3008)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1058, file: !722, line: 505, baseType: !901, size: 32, align: 32, offset: 3040)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1058, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1058, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1058, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1058, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1058, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1058, file: !722, line: 532, baseType: !932, size: 64, align: 64, offset: 3264)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1058, file: !722, line: 539, baseType: !932, size: 64, align: 64, offset: 3328)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1058, file: !722, line: 547, baseType: !932, size: 64, align: 64, offset: 3392)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1058, file: !722, line: 554, baseType: !1117, size: 64, align: 64, offset: 3456)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1058, file: !722, line: 563, baseType: !901, size: 32, align: 32, offset: 3520)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1058, file: !722, line: 572, baseType: !901, size: 32, align: 32, offset: 3552)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1058, file: !722, line: 581, baseType: !901, size: 32, align: 32, offset: 3584)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1058, file: !722, line: 588, baseType: !1137, size: 64, align: 64, offset: 3648)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !910, line: 36, baseType: !1139)
!1139 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1058, file: !722, line: 593, baseType: !901, size: 32, align: 32, offset: 3712)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1058, file: !722, line: 596, baseType: !901, size: 32, align: 32, offset: 3744)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1058, file: !722, line: 599, baseType: !1093, size: 64, align: 64, offset: 3776)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1058, file: !722, line: 605, baseType: !1093, size: 64, align: 64, offset: 3840)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1058, file: !722, line: 616, baseType: !1093, size: 64, align: 64, offset: 3904)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1058, file: !722, line: 626, baseType: !1146, size: 64, align: 64, offset: 3968)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1147, line: 216, baseType: !974)
!1147 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1058, file: !722, line: 627, baseType: !1146, size: 64, align: 64, offset: 4032)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1058, file: !722, line: 628, baseType: !1146, size: 64, align: 64, offset: 4096)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1058, file: !722, line: 629, baseType: !1146, size: 64, align: 64, offset: 4160)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1058, file: !722, line: 645, baseType: !1093, size: 64, align: 64, offset: 4224)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1049, file: !1050, line: 161, baseType: !1153, size: 64, align: 64, offset: 192)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1050, line: 117, baseType: !1155)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1050, line: 100, size: 832, align: 64, elements: !1156)
!1156 = !{!1157, !1162, !1163, !1164, !1165, !1166, !1168, !1169, !1170}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1155, file: !1050, line: 105, baseType: !1158, size: 256, align: 64)
!1158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1159, size: 256, align: 64, elements: !921)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1095, line: 238, baseType: !1161)
!1161 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1095, line: 238, flags: DIFlagFwdDecl)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1155, file: !1050, line: 110, baseType: !901, size: 32, align: 32, offset: 256)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1155, file: !1050, line: 111, baseType: !901, size: 32, align: 32, offset: 288)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1155, file: !1050, line: 111, baseType: !901, size: 32, align: 32, offset: 320)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1155, file: !1050, line: 112, baseType: !1065, size: 256, align: 32, offset: 352)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1155, file: !1050, line: 113, baseType: !1167, size: 128, align: 32, offset: 608)
!1167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 128, align: 32, elements: !921)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1155, file: !1050, line: 114, baseType: !901, size: 32, align: 32, offset: 736)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1155, file: !1050, line: 115, baseType: !901, size: 32, align: 32, offset: 768)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1155, file: !1050, line: 116, baseType: !901, size: 32, align: 32, offset: 800)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1049, file: !1050, line: 163, baseType: !987, size: 64, align: 64, offset: 256)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1049, file: !1050, line: 165, baseType: !1173, size: 128, align: 64, offset: 320)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1050, line: 122, baseType: !1174)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1050, line: 119, size: 128, align: 64, elements: !1175)
!1175 = !{!1176, !1200}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1174, file: !1050, line: 120, baseType: !1177, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1180)
!1180 = !{!1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1196, !1197, !1198, !1199}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1179, file: !14, line: 1451, baseType: !1093, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1179, file: !14, line: 1461, baseType: !932, size: 64, align: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1179, file: !14, line: 1467, baseType: !932, size: 64, align: 64, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1179, file: !14, line: 1468, baseType: !937, size: 64, align: 64, offset: 192)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1179, file: !14, line: 1469, baseType: !901, size: 32, align: 32, offset: 256)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1179, file: !14, line: 1470, baseType: !901, size: 32, align: 32, offset: 288)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1179, file: !14, line: 1474, baseType: !901, size: 32, align: 32, offset: 320)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1179, file: !14, line: 1479, baseType: !1189, size: 64, align: 64, offset: 384)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1192)
!1192 = !{!1193, !1194, !1195}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1191, file: !14, line: 1412, baseType: !937, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1191, file: !14, line: 1413, baseType: !901, size: 32, align: 32, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1191, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1179, file: !14, line: 1480, baseType: !901, size: 32, align: 32, offset: 448)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1179, file: !14, line: 1486, baseType: !932, size: 64, align: 64, offset: 512)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1179, file: !14, line: 1488, baseType: !932, size: 64, align: 64, offset: 576)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1179, file: !14, line: 1497, baseType: !932, size: 64, align: 64, offset: 640)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1174, file: !1050, line: 121, baseType: !1056, size: 64, align: 64, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1049, file: !1050, line: 166, baseType: !1202, size: 128, align: 64, offset: 448)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1050, line: 127, baseType: !1203)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1050, line: 124, size: 128, align: 64, elements: !1204)
!1204 = !{!1205, !1278}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1203, file: !1050, line: 125, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1210)
!1210 = !{!1211, !1212, !1236, !1240, !1241, !1275, !1276, !1277}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1209, file: !14, line: 5751, baseType: !977, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1209, file: !14, line: 5756, baseType: !1213, size: 64, align: 64, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1216)
!1216 = !{!1217, !1218, !1221, !1222, !1223, !1227, !1231, !1235}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1215, file: !14, line: 5797, baseType: !945, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1215, file: !14, line: 5804, baseType: !1219, size: 64, align: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1215, file: !14, line: 5815, baseType: !977, size: 64, align: 64, offset: 128)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1215, file: !14, line: 5825, baseType: !901, size: 32, align: 32, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1215, file: !14, line: 5826, baseType: !1224, size: 64, align: 64, offset: 256)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!901, !1207}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1215, file: !14, line: 5827, baseType: !1228, size: 64, align: 64, offset: 320)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!901, !1207, !1177}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1215, file: !14, line: 5828, baseType: !1232, size: 64, align: 64, offset: 384)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{null, !1207}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1215, file: !14, line: 5829, baseType: !1232, size: 64, align: 64, offset: 448)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1209, file: !14, line: 5762, baseType: !1237, size: 64, align: 64, offset: 128)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1239)
!1239 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1209, file: !14, line: 5768, baseType: !987, size: 64, align: 64, offset: 192)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1209, file: !14, line: 5775, baseType: !1242, size: 64, align: 64, offset: 256)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1244)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1245)
!1245 = !{!1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1244, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1244, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1244, file: !14, line: 3948, baseType: !909, size: 32, align: 32, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1244, file: !14, line: 3958, baseType: !937, size: 64, align: 64, offset: 128)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1244, file: !14, line: 3962, baseType: !901, size: 32, align: 32, offset: 192)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1244, file: !14, line: 3968, baseType: !901, size: 32, align: 32, offset: 224)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1244, file: !14, line: 3973, baseType: !932, size: 64, align: 64, offset: 256)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1244, file: !14, line: 3986, baseType: !901, size: 32, align: 32, offset: 320)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1244, file: !14, line: 3999, baseType: !901, size: 32, align: 32, offset: 352)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1244, file: !14, line: 4004, baseType: !901, size: 32, align: 32, offset: 384)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1244, file: !14, line: 4005, baseType: !901, size: 32, align: 32, offset: 416)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1244, file: !14, line: 4010, baseType: !901, size: 32, align: 32, offset: 448)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1244, file: !14, line: 4011, baseType: !901, size: 32, align: 32, offset: 480)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1244, file: !14, line: 4020, baseType: !955, size: 64, align: 32, offset: 512)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1244, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1244, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1244, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1244, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1244, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1244, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1244, file: !14, line: 4039, baseType: !901, size: 32, align: 32, offset: 768)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1244, file: !14, line: 4046, baseType: !973, size: 64, align: 64, offset: 832)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1244, file: !14, line: 4050, baseType: !901, size: 32, align: 32, offset: 896)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1244, file: !14, line: 4054, baseType: !901, size: 32, align: 32, offset: 928)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1244, file: !14, line: 4061, baseType: !901, size: 32, align: 32, offset: 960)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1244, file: !14, line: 4065, baseType: !901, size: 32, align: 32, offset: 992)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1244, file: !14, line: 4073, baseType: !901, size: 32, align: 32, offset: 1024)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1244, file: !14, line: 4080, baseType: !901, size: 32, align: 32, offset: 1056)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1244, file: !14, line: 4084, baseType: !901, size: 32, align: 32, offset: 1088)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1209, file: !14, line: 5781, baseType: !1242, size: 64, align: 64, offset: 320)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1209, file: !14, line: 5787, baseType: !955, size: 64, align: 32, offset: 384)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1209, file: !14, line: 5793, baseType: !955, size: 64, align: 32, offset: 448)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1203, file: !1050, line: 126, baseType: !901, size: 32, align: 32, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1049, file: !1050, line: 172, baseType: !1177, size: 64, align: 64, offset: 576)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1049, file: !1050, line: 177, baseType: !937, size: 64, align: 64, offset: 640)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1049, file: !1050, line: 178, baseType: !902, size: 32, align: 32, offset: 704)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1049, file: !1050, line: 180, baseType: !987, size: 64, align: 64, offset: 768)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1049, file: !1050, line: 185, baseType: !901, size: 32, align: 32, offset: 832)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1049, file: !1050, line: 190, baseType: !987, size: 64, align: 64, offset: 896)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1049, file: !1050, line: 195, baseType: !901, size: 32, align: 32, offset: 960)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1049, file: !1050, line: 200, baseType: !1177, size: 64, align: 64, offset: 1024)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1049, file: !1050, line: 201, baseType: !901, size: 32, align: 32, offset: 1088)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1049, file: !1050, line: 202, baseType: !1056, size: 64, align: 64, offset: 1152)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1049, file: !1050, line: 203, baseType: !901, size: 32, align: 32, offset: 1216)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1049, file: !1050, line: 205, baseType: !901, size: 32, align: 32, offset: 1248)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1049, file: !1050, line: 206, baseType: !901, size: 32, align: 32, offset: 1280)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1049, file: !1050, line: 209, baseType: !1146, size: 64, align: 64, offset: 1344)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1049, file: !1050, line: 212, baseType: !1146, size: 64, align: 64, offset: 1408)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1049, file: !1050, line: 213, baseType: !1056, size: 64, align: 64, offset: 1472)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1049, file: !1050, line: 215, baseType: !901, size: 32, align: 32, offset: 1536)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1049, file: !1050, line: 217, baseType: !901, size: 32, align: 32, offset: 1568)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1049, file: !1050, line: 220, baseType: !901, size: 32, align: 32, offset: 1600)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1036, file: !14, line: 1598, baseType: !987, size: 64, align: 64, offset: 384)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1036, file: !14, line: 1606, baseType: !932, size: 64, align: 64, offset: 448)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1036, file: !14, line: 1614, baseType: !901, size: 32, align: 32, offset: 512)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1036, file: !14, line: 1622, baseType: !901, size: 32, align: 32, offset: 544)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1036, file: !14, line: 1628, baseType: !901, size: 32, align: 32, offset: 576)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1036, file: !14, line: 1636, baseType: !901, size: 32, align: 32, offset: 608)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1036, file: !14, line: 1643, baseType: !901, size: 32, align: 32, offset: 640)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1036, file: !14, line: 1657, baseType: !937, size: 64, align: 64, offset: 704)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1036, file: !14, line: 1658, baseType: !901, size: 32, align: 32, offset: 768)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1036, file: !14, line: 1679, baseType: !955, size: 64, align: 32, offset: 800)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1036, file: !14, line: 1688, baseType: !901, size: 32, align: 32, offset: 864)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1036, file: !14, line: 1712, baseType: !901, size: 32, align: 32, offset: 896)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1036, file: !14, line: 1729, baseType: !901, size: 32, align: 32, offset: 928)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1036, file: !14, line: 1729, baseType: !901, size: 32, align: 32, offset: 960)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1036, file: !14, line: 1744, baseType: !901, size: 32, align: 32, offset: 992)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1036, file: !14, line: 1744, baseType: !901, size: 32, align: 32, offset: 1024)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1036, file: !14, line: 1751, baseType: !901, size: 32, align: 32, offset: 1056)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1036, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1036, file: !14, line: 1791, baseType: !1317, size: 64, align: 64, offset: 1152)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{null, !1320, !1321, !1323, !901, !901, !901}
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1057)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1036, file: !14, line: 1808, baseType: !1325, size: 64, align: 64, offset: 1216)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DISubroutineType(types: !1327)
!1327 = !{!473, !1320, !962}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1036, file: !14, line: 1816, baseType: !901, size: 32, align: 32, offset: 1280)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1036, file: !14, line: 1825, baseType: !924, size: 32, align: 32, offset: 1312)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1036, file: !14, line: 1830, baseType: !901, size: 32, align: 32, offset: 1344)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1036, file: !14, line: 1838, baseType: !924, size: 32, align: 32, offset: 1376)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1036, file: !14, line: 1846, baseType: !901, size: 32, align: 32, offset: 1408)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1036, file: !14, line: 1851, baseType: !901, size: 32, align: 32, offset: 1440)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1036, file: !14, line: 1861, baseType: !924, size: 32, align: 32, offset: 1472)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1036, file: !14, line: 1868, baseType: !924, size: 32, align: 32, offset: 1504)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1036, file: !14, line: 1875, baseType: !924, size: 32, align: 32, offset: 1536)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1036, file: !14, line: 1882, baseType: !924, size: 32, align: 32, offset: 1568)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1036, file: !14, line: 1889, baseType: !924, size: 32, align: 32, offset: 1600)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1036, file: !14, line: 1896, baseType: !924, size: 32, align: 32, offset: 1632)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1036, file: !14, line: 1903, baseType: !924, size: 32, align: 32, offset: 1664)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1036, file: !14, line: 1910, baseType: !901, size: 32, align: 32, offset: 1696)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1036, file: !14, line: 1915, baseType: !901, size: 32, align: 32, offset: 1728)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1036, file: !14, line: 1926, baseType: !1323, size: 64, align: 64, offset: 1792)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1036, file: !14, line: 1935, baseType: !955, size: 64, align: 32, offset: 1856)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1036, file: !14, line: 1942, baseType: !901, size: 32, align: 32, offset: 1920)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1036, file: !14, line: 1948, baseType: !901, size: 32, align: 32, offset: 1952)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1036, file: !14, line: 1954, baseType: !901, size: 32, align: 32, offset: 1984)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1036, file: !14, line: 1960, baseType: !901, size: 32, align: 32, offset: 2016)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1036, file: !14, line: 1984, baseType: !901, size: 32, align: 32, offset: 2048)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1036, file: !14, line: 1991, baseType: !901, size: 32, align: 32, offset: 2080)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1036, file: !14, line: 1996, baseType: !901, size: 32, align: 32, offset: 2112)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1036, file: !14, line: 2004, baseType: !901, size: 32, align: 32, offset: 2144)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1036, file: !14, line: 2011, baseType: !901, size: 32, align: 32, offset: 2176)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1036, file: !14, line: 2018, baseType: !901, size: 32, align: 32, offset: 2208)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1036, file: !14, line: 2027, baseType: !901, size: 32, align: 32, offset: 2240)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1036, file: !14, line: 2034, baseType: !901, size: 32, align: 32, offset: 2272)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1036, file: !14, line: 2044, baseType: !901, size: 32, align: 32, offset: 2304)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1036, file: !14, line: 2054, baseType: !1359, size: 64, align: 64, offset: 2368)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1036, file: !14, line: 2061, baseType: !1359, size: 64, align: 64, offset: 2432)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1036, file: !14, line: 2066, baseType: !901, size: 32, align: 32, offset: 2496)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1036, file: !14, line: 2070, baseType: !901, size: 32, align: 32, offset: 2528)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1036, file: !14, line: 2078, baseType: !901, size: 32, align: 32, offset: 2560)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1036, file: !14, line: 2085, baseType: !901, size: 32, align: 32, offset: 2592)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1036, file: !14, line: 2092, baseType: !901, size: 32, align: 32, offset: 2624)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1036, file: !14, line: 2099, baseType: !901, size: 32, align: 32, offset: 2656)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1036, file: !14, line: 2106, baseType: !901, size: 32, align: 32, offset: 2688)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1036, file: !14, line: 2113, baseType: !901, size: 32, align: 32, offset: 2720)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1036, file: !14, line: 2120, baseType: !901, size: 32, align: 32, offset: 2752)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1036, file: !14, line: 2125, baseType: !901, size: 32, align: 32, offset: 2784)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1036, file: !14, line: 2133, baseType: !901, size: 32, align: 32, offset: 2816)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1036, file: !14, line: 2140, baseType: !901, size: 32, align: 32, offset: 2848)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1036, file: !14, line: 2145, baseType: !901, size: 32, align: 32, offset: 2880)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1036, file: !14, line: 2153, baseType: !901, size: 32, align: 32, offset: 2912)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1036, file: !14, line: 2158, baseType: !901, size: 32, align: 32, offset: 2944)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1036, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1036, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1036, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1036, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1036, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1036, file: !14, line: 2203, baseType: !901, size: 32, align: 32, offset: 3136)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1036, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1036, file: !14, line: 2212, baseType: !901, size: 32, align: 32, offset: 3200)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1036, file: !14, line: 2213, baseType: !901, size: 32, align: 32, offset: 3232)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1036, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1036, file: !14, line: 2232, baseType: !901, size: 32, align: 32, offset: 3296)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1036, file: !14, line: 2243, baseType: !901, size: 32, align: 32, offset: 3328)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1036, file: !14, line: 2249, baseType: !901, size: 32, align: 32, offset: 3360)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1036, file: !14, line: 2256, baseType: !901, size: 32, align: 32, offset: 3392)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1036, file: !14, line: 2263, baseType: !973, size: 64, align: 64, offset: 3456)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1036, file: !14, line: 2270, baseType: !973, size: 64, align: 64, offset: 3520)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1036, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1036, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1036, file: !14, line: 2367, baseType: !1395, size: 64, align: 64, offset: 3648)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DISubroutineType(types: !1397)
!1397 = !{!901, !1320, !1056, !901}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1036, file: !14, line: 2383, baseType: !901, size: 32, align: 32, offset: 3712)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1036, file: !14, line: 2386, baseType: !924, size: 32, align: 32, offset: 3744)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1036, file: !14, line: 2387, baseType: !924, size: 32, align: 32, offset: 3776)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1036, file: !14, line: 2394, baseType: !901, size: 32, align: 32, offset: 3808)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1036, file: !14, line: 2401, baseType: !901, size: 32, align: 32, offset: 3840)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1036, file: !14, line: 2408, baseType: !901, size: 32, align: 32, offset: 3872)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1036, file: !14, line: 2415, baseType: !901, size: 32, align: 32, offset: 3904)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1036, file: !14, line: 2422, baseType: !901, size: 32, align: 32, offset: 3936)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1036, file: !14, line: 2423, baseType: !1407, size: 64, align: 64, offset: 3968)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1409)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1410)
!1410 = !{!1411, !1412, !1413, !1414}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1409, file: !14, line: 827, baseType: !901, size: 32, align: 32)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1409, file: !14, line: 828, baseType: !901, size: 32, align: 32, offset: 32)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1409, file: !14, line: 829, baseType: !901, size: 32, align: 32, offset: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1409, file: !14, line: 830, baseType: !924, size: 32, align: 32, offset: 96)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1036, file: !14, line: 2430, baseType: !932, size: 64, align: 64, offset: 4032)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1036, file: !14, line: 2437, baseType: !932, size: 64, align: 64, offset: 4096)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1036, file: !14, line: 2444, baseType: !924, size: 32, align: 32, offset: 4160)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1036, file: !14, line: 2451, baseType: !924, size: 32, align: 32, offset: 4192)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1036, file: !14, line: 2458, baseType: !901, size: 32, align: 32, offset: 4224)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1036, file: !14, line: 2469, baseType: !901, size: 32, align: 32, offset: 4256)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1036, file: !14, line: 2475, baseType: !901, size: 32, align: 32, offset: 4288)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1036, file: !14, line: 2481, baseType: !901, size: 32, align: 32, offset: 4320)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1036, file: !14, line: 2485, baseType: !901, size: 32, align: 32, offset: 4352)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1036, file: !14, line: 2489, baseType: !901, size: 32, align: 32, offset: 4384)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1036, file: !14, line: 2493, baseType: !901, size: 32, align: 32, offset: 4416)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1036, file: !14, line: 2501, baseType: !901, size: 32, align: 32, offset: 4448)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1036, file: !14, line: 2506, baseType: !901, size: 32, align: 32, offset: 4480)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1036, file: !14, line: 2510, baseType: !901, size: 32, align: 32, offset: 4512)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1036, file: !14, line: 2514, baseType: !932, size: 64, align: 64, offset: 4544)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1036, file: !14, line: 2528, baseType: !1431, size: 64, align: 64, offset: 4608)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DISubroutineType(types: !1433)
!1433 = !{null, !1320, !987, !901, !901}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1036, file: !14, line: 2534, baseType: !901, size: 32, align: 32, offset: 4672)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1036, file: !14, line: 2545, baseType: !901, size: 32, align: 32, offset: 4704)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1036, file: !14, line: 2547, baseType: !901, size: 32, align: 32, offset: 4736)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1036, file: !14, line: 2549, baseType: !901, size: 32, align: 32, offset: 4768)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1036, file: !14, line: 2551, baseType: !901, size: 32, align: 32, offset: 4800)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1036, file: !14, line: 2553, baseType: !901, size: 32, align: 32, offset: 4832)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1036, file: !14, line: 2555, baseType: !901, size: 32, align: 32, offset: 4864)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1036, file: !14, line: 2557, baseType: !901, size: 32, align: 32, offset: 4896)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1036, file: !14, line: 2559, baseType: !901, size: 32, align: 32, offset: 4928)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1036, file: !14, line: 2563, baseType: !901, size: 32, align: 32, offset: 4960)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1036, file: !14, line: 2571, baseType: !1445, size: 64, align: 64, offset: 4992)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1036, file: !14, line: 2579, baseType: !1445, size: 64, align: 64, offset: 5056)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1036, file: !14, line: 2586, baseType: !901, size: 32, align: 32, offset: 5120)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1036, file: !14, line: 2615, baseType: !901, size: 32, align: 32, offset: 5152)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1036, file: !14, line: 2627, baseType: !901, size: 32, align: 32, offset: 5184)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1036, file: !14, line: 2637, baseType: !901, size: 32, align: 32, offset: 5216)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1036, file: !14, line: 2681, baseType: !901, size: 32, align: 32, offset: 5248)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1036, file: !14, line: 2709, baseType: !932, size: 64, align: 64, offset: 5312)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1036, file: !14, line: 2716, baseType: !1454, size: 64, align: 64, offset: 5376)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1456)
!1456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1457)
!1457 = !{!1458, !1459, !1460, !1461, !1462, !1463, !1467, !1471, !1475, !1476, !1477, !1478, !1484, !1485, !1486, !1487, !1488}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1456, file: !14, line: 3642, baseType: !945, size: 64, align: 64)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1456, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1456, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1456, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1456, file: !14, line: 3669, baseType: !901, size: 32, align: 32, offset: 160)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1456, file: !14, line: 3682, baseType: !1464, size: 64, align: 64, offset: 192)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DISubroutineType(types: !1466)
!1466 = !{!901, !1034, !1056}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1456, file: !14, line: 3698, baseType: !1468, size: 64, align: 64, offset: 256)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!901, !1034, !925, !909}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1456, file: !14, line: 3712, baseType: !1472, size: 64, align: 64, offset: 320)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DISubroutineType(types: !1474)
!1474 = !{!901, !1034, !901, !925, !909}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1456, file: !14, line: 3726, baseType: !1468, size: 64, align: 64, offset: 384)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1456, file: !14, line: 3737, baseType: !1031, size: 64, align: 64, offset: 448)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1456, file: !14, line: 3746, baseType: !901, size: 32, align: 32, offset: 512)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1456, file: !14, line: 3757, baseType: !1479, size: 64, align: 64, offset: 576)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{null, !1482}
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1456, file: !14, line: 3766, baseType: !1031, size: 64, align: 64, offset: 640)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1456, file: !14, line: 3774, baseType: !1031, size: 64, align: 64, offset: 704)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1456, file: !14, line: 3780, baseType: !901, size: 32, align: 32, offset: 768)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1456, file: !14, line: 3785, baseType: !901, size: 32, align: 32, offset: 800)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1456, file: !14, line: 3795, baseType: !1489, size: 64, align: 64, offset: 832)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{!901, !1034, !1093}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1036, file: !14, line: 2728, baseType: !987, size: 64, align: 64, offset: 5440)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1036, file: !14, line: 2735, baseType: !1083, size: 512, align: 64, offset: 5504)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1036, file: !14, line: 2742, baseType: !901, size: 32, align: 32, offset: 6016)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1036, file: !14, line: 2755, baseType: !901, size: 32, align: 32, offset: 6048)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1036, file: !14, line: 2776, baseType: !901, size: 32, align: 32, offset: 6080)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1036, file: !14, line: 2783, baseType: !901, size: 32, align: 32, offset: 6112)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1036, file: !14, line: 2791, baseType: !901, size: 32, align: 32, offset: 6144)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1036, file: !14, line: 2802, baseType: !1056, size: 64, align: 64, offset: 6208)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1036, file: !14, line: 2811, baseType: !901, size: 32, align: 32, offset: 6272)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1036, file: !14, line: 2821, baseType: !901, size: 32, align: 32, offset: 6304)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1036, file: !14, line: 2830, baseType: !901, size: 32, align: 32, offset: 6336)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1036, file: !14, line: 2840, baseType: !901, size: 32, align: 32, offset: 6368)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1036, file: !14, line: 2851, baseType: !1505, size: 64, align: 64, offset: 6400)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DISubroutineType(types: !1507)
!1507 = !{!901, !1320, !1508, !987, !1323, !901, !901}
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DISubroutineType(types: !1510)
!1510 = !{!901, !1320, !987}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1036, file: !14, line: 2871, baseType: !1512, size: 64, align: 64, offset: 6464)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64, align: 64)
!1513 = !DISubroutineType(types: !1514)
!1514 = !{!901, !1320, !1515, !987, !1323, !901}
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DISubroutineType(types: !1517)
!1517 = !{!901, !1320, !987, !901, !901}
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1036, file: !14, line: 2878, baseType: !901, size: 32, align: 32, offset: 6528)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1036, file: !14, line: 2885, baseType: !901, size: 32, align: 32, offset: 6560)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1036, file: !14, line: 3005, baseType: !901, size: 32, align: 32, offset: 6592)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1036, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1036, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1036, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1036, file: !14, line: 3037, baseType: !937, size: 64, align: 64, offset: 6720)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1036, file: !14, line: 3038, baseType: !901, size: 32, align: 32, offset: 6784)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1036, file: !14, line: 3050, baseType: !973, size: 64, align: 64, offset: 6848)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1036, file: !14, line: 3065, baseType: !901, size: 32, align: 32, offset: 6912)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1036, file: !14, line: 3083, baseType: !901, size: 32, align: 32, offset: 6944)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1036, file: !14, line: 3092, baseType: !955, size: 64, align: 32, offset: 6976)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1036, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1036, file: !14, line: 3106, baseType: !955, size: 64, align: 32, offset: 7072)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1036, file: !14, line: 3113, baseType: !1533, size: 64, align: 64, offset: 7168)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64, align: 64)
!1534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1535)
!1535 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1536)
!1536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1537)
!1537 = !{!1538, !1539, !1540, !1541, !1542, !1543, !1546}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1536, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1536, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1536, file: !14, line: 720, baseType: !945, size: 64, align: 64, offset: 64)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1536, file: !14, line: 724, baseType: !945, size: 64, align: 64, offset: 128)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1536, file: !14, line: 728, baseType: !901, size: 32, align: 32, offset: 192)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1536, file: !14, line: 734, baseType: !1544, size: 64, align: 64, offset: 256)
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1536, file: !14, line: 739, baseType: !1547, size: 64, align: 64, offset: 320)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1022)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1036, file: !14, line: 3129, baseType: !932, size: 64, align: 64, offset: 7232)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1036, file: !14, line: 3130, baseType: !932, size: 64, align: 64, offset: 7296)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1036, file: !14, line: 3131, baseType: !932, size: 64, align: 64, offset: 7360)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1036, file: !14, line: 3132, baseType: !932, size: 64, align: 64, offset: 7424)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1036, file: !14, line: 3139, baseType: !1445, size: 64, align: 64, offset: 7488)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1036, file: !14, line: 3147, baseType: !901, size: 32, align: 32, offset: 7552)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1036, file: !14, line: 3165, baseType: !901, size: 32, align: 32, offset: 7584)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1036, file: !14, line: 3172, baseType: !901, size: 32, align: 32, offset: 7616)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1036, file: !14, line: 3180, baseType: !901, size: 32, align: 32, offset: 7648)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1036, file: !14, line: 3191, baseType: !1359, size: 64, align: 64, offset: 7680)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1036, file: !14, line: 3199, baseType: !937, size: 64, align: 64, offset: 7744)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1036, file: !14, line: 3207, baseType: !1445, size: 64, align: 64, offset: 7808)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1036, file: !14, line: 3214, baseType: !902, size: 32, align: 32, offset: 7872)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1036, file: !14, line: 3224, baseType: !1189, size: 64, align: 64, offset: 7936)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1036, file: !14, line: 3225, baseType: !901, size: 32, align: 32, offset: 8000)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1036, file: !14, line: 3249, baseType: !1093, size: 64, align: 64, offset: 8064)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1036, file: !14, line: 3256, baseType: !901, size: 32, align: 32, offset: 8128)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1036, file: !14, line: 3271, baseType: !901, size: 32, align: 32, offset: 8160)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1036, file: !14, line: 3279, baseType: !932, size: 64, align: 64, offset: 8192)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1036, file: !14, line: 3301, baseType: !1093, size: 64, align: 64, offset: 8256)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1036, file: !14, line: 3310, baseType: !901, size: 32, align: 32, offset: 8320)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1036, file: !14, line: 3337, baseType: !901, size: 32, align: 32, offset: 8352)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1036, file: !14, line: 3351, baseType: !901, size: 32, align: 32, offset: 8384)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1036, file: !14, line: 3359, baseType: !901, size: 32, align: 32, offset: 8416)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !942, file: !14, line: 3535, baseType: !1574, size: 64, align: 64, offset: 1024)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DISubroutineType(types: !1576)
!1576 = !{!901, !1034, !1577}
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64, align: 64)
!1578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1035)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !942, file: !14, line: 3541, baseType: !1580, size: 64, align: 64, offset: 1088)
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1581, size: 64, align: 64)
!1581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1582)
!1582 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1583)
!1583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1050, line: 223, size: 128, align: 64, elements: !1584)
!1584 = !{!1585, !1586}
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1583, file: !1050, line: 224, baseType: !925, size: 64, align: 64)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1583, file: !1050, line: 225, baseType: !925, size: 64, align: 64, offset: 64)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !942, file: !14, line: 3549, baseType: !1588, size: 64, align: 64, offset: 1152)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DISubroutineType(types: !1590)
!1590 = !{null, !1029}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !942, file: !14, line: 3551, baseType: !1031, size: 64, align: 64, offset: 1216)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !942, file: !14, line: 3552, baseType: !1593, size: 64, align: 64, offset: 1280)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DISubroutineType(types: !1595)
!1595 = !{!901, !1034, !937, !901, !1596}
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1598)
!1598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1599)
!1599 = !{!1600, !1601, !1602, !1603, !1604, !1628}
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1598, file: !14, line: 3921, baseType: !913, size: 16, align: 16)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1598, file: !14, line: 3922, baseType: !909, size: 32, align: 32, offset: 32)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1598, file: !14, line: 3923, baseType: !909, size: 32, align: 32, offset: 64)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1598, file: !14, line: 3924, baseType: !902, size: 32, align: 32, offset: 96)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1598, file: !14, line: 3925, baseType: !1605, size: 64, align: 64, offset: 128)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1608)
!1608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1609)
!1609 = !{!1610, !1611, !1612, !1613, !1614, !1615, !1621, !1623, !1624, !1625, !1626, !1627}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1608, file: !14, line: 3886, baseType: !901, size: 32, align: 32)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1608, file: !14, line: 3887, baseType: !901, size: 32, align: 32, offset: 32)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1608, file: !14, line: 3888, baseType: !901, size: 32, align: 32, offset: 64)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1608, file: !14, line: 3889, baseType: !901, size: 32, align: 32, offset: 96)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1608, file: !14, line: 3890, baseType: !901, size: 32, align: 32, offset: 128)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1608, file: !14, line: 3897, baseType: !1616, size: 768, align: 64, offset: 192)
!1616 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1617)
!1617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1618)
!1618 = !{!1619, !1620}
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1617, file: !14, line: 3855, baseType: !1061, size: 512, align: 64)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1617, file: !14, line: 3857, baseType: !1065, size: 256, align: 32, offset: 512)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1608, file: !14, line: 3903, baseType: !1622, size: 256, align: 64, offset: 960)
!1622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 256, align: 64, elements: !921)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1608, file: !14, line: 3904, baseType: !1167, size: 128, align: 32, offset: 1216)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1608, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1608, file: !14, line: 3908, baseType: !1445, size: 64, align: 64, offset: 1408)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1608, file: !14, line: 3915, baseType: !1445, size: 64, align: 64, offset: 1472)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1608, file: !14, line: 3917, baseType: !901, size: 32, align: 32, offset: 1536)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1598, file: !14, line: 3926, baseType: !932, size: 64, align: 64, offset: 192)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !942, file: !14, line: 3564, baseType: !1630, size: 64, align: 64, offset: 1344)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DISubroutineType(types: !1632)
!1632 = !{!901, !1034, !1177, !1321, !1323}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !942, file: !14, line: 3566, baseType: !1634, size: 64, align: 64, offset: 1408)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DISubroutineType(types: !1636)
!1636 = !{!901, !1034, !987, !1323, !1177}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !942, file: !14, line: 3567, baseType: !1031, size: 64, align: 64, offset: 1472)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !942, file: !14, line: 3576, baseType: !1639, size: 64, align: 64, offset: 1536)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DISubroutineType(types: !1641)
!1641 = !{!901, !1034, !1321}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !942, file: !14, line: 3577, baseType: !1643, size: 64, align: 64, offset: 1600)
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64, align: 64)
!1644 = !DISubroutineType(types: !1645)
!1645 = !{!901, !1034, !1177}
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !942, file: !14, line: 3584, baseType: !1464, size: 64, align: 64, offset: 1664)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !942, file: !14, line: 3589, baseType: !1648, size: 64, align: 64, offset: 1728)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DISubroutineType(types: !1650)
!1650 = !{null, !1034}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !942, file: !14, line: 3594, baseType: !901, size: 32, align: 32, offset: 1792)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !942, file: !14, line: 3600, baseType: !945, size: 64, align: 64, offset: 1856)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !942, file: !14, line: 3609, baseType: !1654, size: 64, align: 64, offset: 1920)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1657)
!1657 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1658 = distinct !DIGlobalVariable(name: "ff_aptx_hd_decoder", scope: !0, file: !888, line: 1109, type: !941, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_aptx_hd_decoder)
!1659 = distinct !DIGlobalVariable(name: "ff_aptx_encoder", scope: !0, file: !888, line: 1127, type: !941, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_aptx_encoder)
!1660 = distinct !DIGlobalVariable(name: "ff_aptx_hd_encoder", scope: !0, file: !888, line: 1146, type: !941, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_aptx_hd_encoder)
!1661 = distinct !DIGlobalVariable(name: "quantization_factors", scope: !0, file: !888, line: 451, type: !1662, isLocal: true, isDefinition: true, variable: [32 x i16]* @quantization_factors)
!1662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1663, size: 512, align: 16, elements: !1666)
!1663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1664)
!1664 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !910, line: 37, baseType: !1665)
!1665 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1666 = !{!1667}
!1667 = !DISubrange(count: 32)
!1668 = distinct !DIGlobalVariable(name: "tables", scope: !0, file: !888, line: 396, type: !1669, isLocal: true, isDefinition: true, variable: [2 x [4 x %struct.anon]]* @tables)
!1669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1670, size: 3072, align: 64, elements: !1684)
!1670 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConstTables", file: !888, line: 394, baseType: !1671)
!1671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1672)
!1672 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !888, line: 386, size: 384, align: 64, elements: !1673)
!1673 = !{!1674, !1677, !1678, !1679, !1681, !1682, !1683}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_intervals", scope: !1672, file: !888, line: 387, baseType: !1675, size: 64, align: 64)
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64, align: 64)
!1676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
