; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--exr.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--exr.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ExrCompr", file: !910, line: 60, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/exr.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!911 = !{!912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922}
!912 = !DIEnumerator(name: "EXR_RAW", value: 0)
!913 = !DIEnumerator(name: "EXR_RLE", value: 1)
!914 = !DIEnumerator(name: "EXR_ZIP1", value: 2)
!915 = !DIEnumerator(name: "EXR_ZIP16", value: 3)
!916 = !DIEnumerator(name: "EXR_PIZ", value: 4)
!917 = !DIEnumerator(name: "EXR_PXR24", value: 5)
!918 = !DIEnumerator(name: "EXR_B44", value: 6)
!919 = !DIEnumerator(name: "EXR_B44A", value: 7)
!920 = !DIEnumerator(name: "EXR_DWA", value: 8)
!921 = !DIEnumerator(name: "EXR_DWB", value: 9)
!922 = !DIEnumerator(name: "EXR_UNKN", value: 10)
!923 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ExrPixelType", file: !910, line: 74, size: 32, align: 32, elements: !924)
!924 = !{!925, !926, !927, !928}
!925 = !DIEnumerator(name: "EXR_UINT", value: 0)
!926 = !DIEnumerator(name: "EXR_HALF", value: 1)
!927 = !DIEnumerator(name: "EXR_FLOAT", value: 2)
!928 = !DIEnumerator(name: "EXR_UNKNOWN", value: 3)
!929 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ExrTileLevelMode", file: !910, line: 81, size: 32, align: 32, elements: !930)
!930 = !{!931, !932, !933, !934}
!931 = !DIEnumerator(name: "EXR_TILE_LEVEL_ONE", value: 0)
!932 = !DIEnumerator(name: "EXR_TILE_LEVEL_MIPMAP", value: 1)
!933 = !DIEnumerator(name: "EXR_TILE_LEVEL_RIPMAP", value: 2)
!934 = !DIEnumerator(name: "EXR_TILE_LEVEL_UNKNOWN", value: 3)
!935 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ExrTileLevelRound", file: !910, line: 88, size: 32, align: 32, elements: !936)
!936 = !{!937, !938, !939}
!937 = !DIEnumerator(name: "EXR_TILE_ROUND_UP", value: 0)
!938 = !DIEnumerator(name: "EXR_TILE_ROUND_DOWN", value: 1)
!939 = !DIEnumerator(name: "EXR_TILE_ROUND_UNKNOWN", value: 2)
!940 = !{!941, !942, !943, !944, !949, !957, !958, !955, !964, !946, !967, !968, !972}
!941 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!942 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !947, line: 48, baseType: !948)
!947 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!948 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !952, line: 220, size: 64, align: 8, elements: !953)
!952 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!953 = !{!954}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !951, file: !952, line: 220, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !947, line: 55, baseType: !956)
!956 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !952, line: 221, size: 32, align: 8, elements: !961)
!961 = !{!962}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !960, file: !952, line: 221, baseType: !963, size: 32, align: 32)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !947, line: 51, baseType: !942)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !947, line: 49, baseType: !966)
!966 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !952, line: 222, size: 16, align: 8, elements: !970)
!970 = !{!971}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !969, file: !952, line: 222, baseType: !965, size: 16, align: 16)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!974 = !{!975, !1728, !1729}
!975 = distinct !DIGlobalVariable(name: "ff_exr_decoder", scope: !0, file: !910, line: 1947, type: !976, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_exr_decoder)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !978)
!978 = !{!979, !983, !984, !985, !986, !987, !996, !999, !1002, !1005, !1008, !1009, !1085, !1093, !1094, !1095, !1097, !1643, !1649, !1657, !1661, !1662, !1699, !1703, !1707, !1708, !1712, !1716, !1717, !1721, !1722, !1723}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !977, file: !14, line: 3475, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !977, file: !14, line: 3480, baseType: !980, size: 64, align: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !977, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !977, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !977, file: !14, line: 3487, baseType: !941, size: 32, align: 32, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !977, file: !14, line: 3488, baseType: !988, size: 64, align: 64, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !991, line: 61, baseType: !992)
!991 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !991, line: 58, size: 64, align: 32, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !992, file: !991, line: 59, baseType: !941, size: 32, align: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !992, file: !991, line: 60, baseType: !941, size: 32, align: 32, offset: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !977, file: !14, line: 3489, baseType: !997, size: 64, align: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !977, file: !14, line: 3490, baseType: !1000, size: 64, align: 64, offset: 384)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !977, file: !14, line: 3491, baseType: !1003, size: 64, align: 64, offset: 448)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !977, file: !14, line: 3492, baseType: !1006, size: 64, align: 64, offset: 512)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !977, file: !14, line: 3493, baseType: !946, size: 8, align: 8, offset: 576)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !977, file: !14, line: 3494, baseType: !1010, size: 64, align: 64, offset: 640)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !1014)
!1014 = !{!1015, !1016, !1020, !1044, !1045, !1046, !1047, !1051, !1057, !1059, !1063}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1013, file: !713, line: 72, baseType: !980, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1013, file: !713, line: 78, baseType: !1017, size: 64, align: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!980, !943}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1013, file: !713, line: 85, baseType: !1021, size: 64, align: 64, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1040, !1041, !1042, !1043}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1023, file: !691, line: 247, baseType: !980, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1023, file: !691, line: 253, baseType: !980, size: 64, align: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1023, file: !691, line: 259, baseType: !941, size: 32, align: 32, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1023, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1023, file: !691, line: 271, baseType: !1030, size: 64, align: 64, offset: 192)
!1030 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1023, file: !691, line: 265, size: 64, align: 64, elements: !1031)
!1031 = !{!1032, !1036, !1038, !1039}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1030, file: !691, line: 266, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1034, line: 197, baseType: !1035)
!1034 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1035 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1030, file: !691, line: 267, baseType: !1037, size: 64, align: 64)
!1037 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1030, file: !691, line: 268, baseType: !980, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1030, file: !691, line: 270, baseType: !990, size: 64, align: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1023, file: !691, line: 272, baseType: !1037, size: 64, align: 64, offset: 256)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1023, file: !691, line: 273, baseType: !1037, size: 64, align: 64, offset: 320)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1023, file: !691, line: 275, baseType: !941, size: 32, align: 32, offset: 384)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1023, file: !691, line: 300, baseType: !980, size: 64, align: 64, offset: 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1013, file: !713, line: 93, baseType: !941, size: 32, align: 32, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1013, file: !713, line: 99, baseType: !941, size: 32, align: 32, offset: 224)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1013, file: !713, line: 108, baseType: !941, size: 32, align: 32, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1013, file: !713, line: 113, baseType: !1048, size: 64, align: 64, offset: 320)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!943, !943, !943}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1013, file: !713, line: 123, baseType: !1052, size: 64, align: 64, offset: 384)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!1055, !1055}
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1013, file: !713, line: 130, baseType: !1058, size: 32, align: 32, offset: 448)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1013, file: !713, line: 136, baseType: !1060, size: 64, align: 64, offset: 512)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!1058, !943}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1013, file: !713, line: 142, baseType: !1064, size: 64, align: 64, offset: 576)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!941, !1067, !943, !980, !941}
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1070)
!1070 = !{!1071, !1083, !1084}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1069, file: !691, line: 360, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1075)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1076)
!1076 = !{!1077, !1078, !1079, !1080, !1081, !1082}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1075, file: !691, line: 307, baseType: !980, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1075, file: !691, line: 313, baseType: !1037, size: 64, align: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1075, file: !691, line: 313, baseType: !1037, size: 64, align: 64, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1075, file: !691, line: 318, baseType: !1037, size: 64, align: 64, offset: 192)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1075, file: !691, line: 318, baseType: !1037, size: 64, align: 64, offset: 256)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1075, file: !691, line: 323, baseType: !941, size: 32, align: 32, offset: 320)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1069, file: !691, line: 364, baseType: !941, size: 32, align: 32, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1069, file: !691, line: 368, baseType: !941, size: 32, align: 32, offset: 96)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !977, file: !14, line: 3495, baseType: !1086, size: 64, align: 64, offset: 704)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1088)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1090)
!1090 = !{!1091, !1092}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1089, file: !14, line: 3402, baseType: !941, size: 32, align: 32)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1089, file: !14, line: 3403, baseType: !980, size: 64, align: 64, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !977, file: !14, line: 3507, baseType: !980, size: 64, align: 64, offset: 768)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !977, file: !14, line: 3516, baseType: !941, size: 32, align: 32, offset: 832)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !977, file: !14, line: 3517, baseType: !1096, size: 64, align: 64, offset: 896)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !977, file: !14, line: 3527, baseType: !1098, size: 64, align: 64, offset: 960)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!941, !1101}
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1104)
!1104 = !{!1105, !1106, !1107, !1108, !1111, !1112, !1113, !1114, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1394, !1398, !1399, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1581, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1103, file: !14, line: 1561, baseType: !1010, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1103, file: !14, line: 1562, baseType: !941, size: 32, align: 32, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1103, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1103, file: !14, line: 1565, baseType: !1109, size: 64, align: 64, offset: 128)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1103, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1103, file: !14, line: 1581, baseType: !942, size: 32, align: 32, offset: 224)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1103, file: !14, line: 1583, baseType: !943, size: 64, align: 64, offset: 256)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1103, file: !14, line: 1591, baseType: !1115, size: 64, align: 64, offset: 320)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1117, line: 129, size: 1664, align: 64, elements: !1118)
!1117 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1118 = !{!1119, !1120, !1121, !1122, !1220, !1241, !1242, !1271, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1116, file: !1117, line: 136, baseType: !941, size: 32, align: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1116, file: !1117, line: 151, baseType: !941, size: 32, align: 32, offset: 32)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1116, file: !1117, line: 157, baseType: !941, size: 32, align: 32, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1116, file: !1117, line: 159, baseType: !1123, size: 64, align: 64, offset: 128)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1125)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1126)
!1126 = !{!1127, !1132, !1134, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1172, !1174, !1175, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1208, !1209, !1210, !1211, !1212, !1213, !1216, !1217, !1218, !1219}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1125, file: !744, line: 282, baseType: !1128, size: 512, align: 64)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1129, size: 512, align: 64, elements: !1130)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!1130 = !{!1131}
!1131 = !DISubrange(count: 8)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1125, file: !744, line: 299, baseType: !1133, size: 256, align: 32, offset: 512)
!1133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 256, align: 32, elements: !1130)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1125, file: !744, line: 315, baseType: !1135, size: 64, align: 64, offset: 768)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1125, file: !744, line: 326, baseType: !941, size: 32, align: 32, offset: 832)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1125, file: !744, line: 326, baseType: !941, size: 32, align: 32, offset: 864)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1125, file: !744, line: 334, baseType: !941, size: 32, align: 32, offset: 896)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1125, file: !744, line: 341, baseType: !941, size: 32, align: 32, offset: 928)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1125, file: !744, line: 346, baseType: !941, size: 32, align: 32, offset: 960)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1125, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1125, file: !744, line: 356, baseType: !990, size: 64, align: 32, offset: 1024)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1125, file: !744, line: 361, baseType: !1033, size: 64, align: 64, offset: 1088)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1125, file: !744, line: 369, baseType: !1033, size: 64, align: 64, offset: 1152)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1125, file: !744, line: 377, baseType: !1033, size: 64, align: 64, offset: 1216)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1125, file: !744, line: 382, baseType: !941, size: 32, align: 32, offset: 1280)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1125, file: !744, line: 386, baseType: !941, size: 32, align: 32, offset: 1312)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1125, file: !744, line: 391, baseType: !941, size: 32, align: 32, offset: 1344)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1125, file: !744, line: 396, baseType: !943, size: 64, align: 64, offset: 1408)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1125, file: !744, line: 403, baseType: !1151, size: 512, align: 64, offset: 1472)
!1151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 512, align: 64, elements: !1130)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1125, file: !744, line: 410, baseType: !941, size: 32, align: 32, offset: 1984)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1125, file: !744, line: 415, baseType: !941, size: 32, align: 32, offset: 2016)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1125, file: !744, line: 420, baseType: !941, size: 32, align: 32, offset: 2048)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1125, file: !744, line: 425, baseType: !941, size: 32, align: 32, offset: 2080)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1125, file: !744, line: 435, baseType: !1033, size: 64, align: 64, offset: 2112)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1125, file: !744, line: 440, baseType: !941, size: 32, align: 32, offset: 2176)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1125, file: !744, line: 445, baseType: !955, size: 64, align: 64, offset: 2240)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1125, file: !744, line: 459, baseType: !1160, size: 512, align: 64, offset: 2304)
!1160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1161, size: 512, align: 64, elements: !1130)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1163, line: 94, baseType: !1164)
!1163 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1163, line: 81, size: 192, align: 64, elements: !1165)
!1165 = !{!1166, !1170, !1171}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1164, file: !1163, line: 82, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1163, line: 73, baseType: !1169)
!1169 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1163, line: 73, flags: DIFlagFwdDecl)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1164, file: !1163, line: 89, baseType: !1129, size: 64, align: 64, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1164, file: !1163, line: 93, baseType: !941, size: 32, align: 32, offset: 128)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1125, file: !744, line: 473, baseType: !1173, size: 64, align: 64, offset: 2816)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1125, file: !744, line: 477, baseType: !941, size: 32, align: 32, offset: 2880)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1125, file: !744, line: 479, baseType: !1176, size: 64, align: 64, offset: 2944)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1180)
!1180 = !{!1181, !1182, !1183, !1184, !1189}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1179, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1179, file: !744, line: 203, baseType: !1129, size: 64, align: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1179, file: !744, line: 204, baseType: !941, size: 32, align: 32, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1179, file: !744, line: 205, baseType: !1185, size: 64, align: 64, offset: 192)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1187, line: 86, baseType: !1188)
!1187 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1188 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1187, line: 86, flags: DIFlagFwdDecl)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1179, file: !744, line: 206, baseType: !1161, size: 64, align: 64, offset: 256)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1125, file: !744, line: 480, baseType: !941, size: 32, align: 32, offset: 3008)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1125, file: !744, line: 505, baseType: !941, size: 32, align: 32, offset: 3040)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1125, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1125, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1125, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1125, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1125, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1125, file: !744, line: 532, baseType: !1033, size: 64, align: 64, offset: 3264)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1125, file: !744, line: 539, baseType: !1033, size: 64, align: 64, offset: 3328)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1125, file: !744, line: 547, baseType: !1033, size: 64, align: 64, offset: 3392)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1125, file: !744, line: 554, baseType: !1185, size: 64, align: 64, offset: 3456)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1125, file: !744, line: 563, baseType: !941, size: 32, align: 32, offset: 3520)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1125, file: !744, line: 572, baseType: !941, size: 32, align: 32, offset: 3552)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1125, file: !744, line: 581, baseType: !941, size: 32, align: 32, offset: 3584)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1125, file: !744, line: 588, baseType: !1205, size: 64, align: 64, offset: 3648)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1034, line: 194, baseType: !1207)
!1207 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1125, file: !744, line: 593, baseType: !941, size: 32, align: 32, offset: 3712)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1125, file: !744, line: 596, baseType: !941, size: 32, align: 32, offset: 3744)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1125, file: !744, line: 599, baseType: !1161, size: 64, align: 64, offset: 3776)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1125, file: !744, line: 605, baseType: !1161, size: 64, align: 64, offset: 3840)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1125, file: !744, line: 616, baseType: !1161, size: 64, align: 64, offset: 3904)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1125, file: !744, line: 626, baseType: !1214, size: 64, align: 64, offset: 3968)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1215, line: 216, baseType: !956)
!1215 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1125, file: !744, line: 627, baseType: !1214, size: 64, align: 64, offset: 4032)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1125, file: !744, line: 628, baseType: !1214, size: 64, align: 64, offset: 4096)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1125, file: !744, line: 629, baseType: !1214, size: 64, align: 64, offset: 4160)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1125, file: !744, line: 645, baseType: !1161, size: 64, align: 64, offset: 4224)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1116, file: !1117, line: 161, baseType: !1221, size: 64, align: 64, offset: 192)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1117, line: 117, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1117, line: 100, size: 832, align: 64, elements: !1224)
!1224 = !{!1225, !1232, !1233, !1234, !1235, !1236, !1238, !1239, !1240}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1223, file: !1117, line: 105, baseType: !1226, size: 256, align: 64)
!1226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1227, size: 256, align: 64, elements: !1230)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1163, line: 238, baseType: !1229)
!1229 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1163, line: 238, flags: DIFlagFwdDecl)
!1230 = !{!1231}
!1231 = !DISubrange(count: 4)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1223, file: !1117, line: 110, baseType: !941, size: 32, align: 32, offset: 256)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1223, file: !1117, line: 111, baseType: !941, size: 32, align: 32, offset: 288)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1223, file: !1117, line: 111, baseType: !941, size: 32, align: 32, offset: 320)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1223, file: !1117, line: 112, baseType: !1133, size: 256, align: 32, offset: 352)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1223, file: !1117, line: 113, baseType: !1237, size: 128, align: 32, offset: 608)
!1237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 128, align: 32, elements: !1230)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1223, file: !1117, line: 114, baseType: !941, size: 32, align: 32, offset: 736)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1223, file: !1117, line: 115, baseType: !941, size: 32, align: 32, offset: 768)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1223, file: !1117, line: 116, baseType: !941, size: 32, align: 32, offset: 800)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1116, file: !1117, line: 163, baseType: !943, size: 64, align: 64, offset: 256)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1116, file: !1117, line: 165, baseType: !1243, size: 128, align: 64, offset: 320)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1117, line: 122, baseType: !1244)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1117, line: 119, size: 128, align: 64, elements: !1245)
!1245 = !{!1246, !1270}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1244, file: !1117, line: 120, baseType: !1247, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1249)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1250)
!1250 = !{!1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1266, !1267, !1268, !1269}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1249, file: !14, line: 1451, baseType: !1161, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1249, file: !14, line: 1461, baseType: !1033, size: 64, align: 64, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1249, file: !14, line: 1467, baseType: !1033, size: 64, align: 64, offset: 128)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1249, file: !14, line: 1468, baseType: !1129, size: 64, align: 64, offset: 192)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1249, file: !14, line: 1469, baseType: !941, size: 32, align: 32, offset: 256)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1249, file: !14, line: 1470, baseType: !941, size: 32, align: 32, offset: 288)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1249, file: !14, line: 1474, baseType: !941, size: 32, align: 32, offset: 320)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1249, file: !14, line: 1479, baseType: !1259, size: 64, align: 64, offset: 384)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1261)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1262)
!1262 = !{!1263, !1264, !1265}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1261, file: !14, line: 1412, baseType: !1129, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1261, file: !14, line: 1413, baseType: !941, size: 32, align: 32, offset: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1261, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1249, file: !14, line: 1480, baseType: !941, size: 32, align: 32, offset: 448)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1249, file: !14, line: 1486, baseType: !1033, size: 64, align: 64, offset: 512)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1249, file: !14, line: 1488, baseType: !1033, size: 64, align: 64, offset: 576)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1249, file: !14, line: 1497, baseType: !1033, size: 64, align: 64, offset: 640)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1244, file: !1117, line: 121, baseType: !1123, size: 64, align: 64, offset: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1116, file: !1117, line: 166, baseType: !1272, size: 128, align: 64, offset: 448)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1117, line: 127, baseType: !1273)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1117, line: 124, size: 128, align: 64, elements: !1274)
!1274 = !{!1275, !1348}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1273, file: !1117, line: 125, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1279)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1280)
!1280 = !{!1281, !1282, !1306, !1310, !1311, !1345, !1346, !1347}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1279, file: !14, line: 5751, baseType: !1010, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1279, file: !14, line: 5756, baseType: !1283, size: 64, align: 64, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1285)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1286)
!1286 = !{!1287, !1288, !1291, !1292, !1293, !1297, !1301, !1305}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1285, file: !14, line: 5797, baseType: !980, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1285, file: !14, line: 5804, baseType: !1289, size: 64, align: 64, offset: 64)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1285, file: !14, line: 5815, baseType: !1010, size: 64, align: 64, offset: 128)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1285, file: !14, line: 5825, baseType: !941, size: 32, align: 32, offset: 192)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1285, file: !14, line: 5826, baseType: !1294, size: 64, align: 64, offset: 256)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!941, !1277}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1285, file: !14, line: 5827, baseType: !1298, size: 64, align: 64, offset: 320)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!941, !1277, !1247}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1285, file: !14, line: 5828, baseType: !1302, size: 64, align: 64, offset: 384)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{null, !1277}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1285, file: !14, line: 5829, baseType: !1302, size: 64, align: 64, offset: 448)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1279, file: !14, line: 5762, baseType: !1307, size: 64, align: 64, offset: 128)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1309)
!1309 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1279, file: !14, line: 5768, baseType: !943, size: 64, align: 64, offset: 192)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1279, file: !14, line: 5775, baseType: !1312, size: 64, align: 64, offset: 256)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1314)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1315)
!1315 = !{!1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1314, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1314, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1314, file: !14, line: 3948, baseType: !963, size: 32, align: 32, offset: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1314, file: !14, line: 3958, baseType: !1129, size: 64, align: 64, offset: 128)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1314, file: !14, line: 3962, baseType: !941, size: 32, align: 32, offset: 192)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1314, file: !14, line: 3968, baseType: !941, size: 32, align: 32, offset: 224)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1314, file: !14, line: 3973, baseType: !1033, size: 64, align: 64, offset: 256)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1314, file: !14, line: 3986, baseType: !941, size: 32, align: 32, offset: 320)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1314, file: !14, line: 3999, baseType: !941, size: 32, align: 32, offset: 352)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1314, file: !14, line: 4004, baseType: !941, size: 32, align: 32, offset: 384)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1314, file: !14, line: 4005, baseType: !941, size: 32, align: 32, offset: 416)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1314, file: !14, line: 4010, baseType: !941, size: 32, align: 32, offset: 448)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1314, file: !14, line: 4011, baseType: !941, size: 32, align: 32, offset: 480)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1314, file: !14, line: 4020, baseType: !990, size: 64, align: 32, offset: 512)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1314, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1314, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1314, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1314, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1314, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1314, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1314, file: !14, line: 4039, baseType: !941, size: 32, align: 32, offset: 768)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1314, file: !14, line: 4046, baseType: !955, size: 64, align: 64, offset: 832)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1314, file: !14, line: 4050, baseType: !941, size: 32, align: 32, offset: 896)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1314, file: !14, line: 4054, baseType: !941, size: 32, align: 32, offset: 928)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1314, file: !14, line: 4061, baseType: !941, size: 32, align: 32, offset: 960)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1314, file: !14, line: 4065, baseType: !941, size: 32, align: 32, offset: 992)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1314, file: !14, line: 4073, baseType: !941, size: 32, align: 32, offset: 1024)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1314, file: !14, line: 4080, baseType: !941, size: 32, align: 32, offset: 1056)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1314, file: !14, line: 4084, baseType: !941, size: 32, align: 32, offset: 1088)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1279, file: !14, line: 5781, baseType: !1312, size: 64, align: 64, offset: 320)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1279, file: !14, line: 5787, baseType: !990, size: 64, align: 32, offset: 384)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1279, file: !14, line: 5793, baseType: !990, size: 64, align: 32, offset: 448)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1273, file: !1117, line: 126, baseType: !941, size: 32, align: 32, offset: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1116, file: !1117, line: 172, baseType: !1247, size: 64, align: 64, offset: 576)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1116, file: !1117, line: 177, baseType: !1129, size: 64, align: 64, offset: 640)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1116, file: !1117, line: 178, baseType: !942, size: 32, align: 32, offset: 704)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1116, file: !1117, line: 180, baseType: !943, size: 64, align: 64, offset: 768)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1116, file: !1117, line: 185, baseType: !941, size: 32, align: 32, offset: 832)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1116, file: !1117, line: 190, baseType: !943, size: 64, align: 64, offset: 896)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1116, file: !1117, line: 195, baseType: !941, size: 32, align: 32, offset: 960)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1116, file: !1117, line: 200, baseType: !1247, size: 64, align: 64, offset: 1024)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1116, file: !1117, line: 201, baseType: !941, size: 32, align: 32, offset: 1088)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1116, file: !1117, line: 202, baseType: !1123, size: 64, align: 64, offset: 1152)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1116, file: !1117, line: 203, baseType: !941, size: 32, align: 32, offset: 1216)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1116, file: !1117, line: 205, baseType: !941, size: 32, align: 32, offset: 1248)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1116, file: !1117, line: 206, baseType: !941, size: 32, align: 32, offset: 1280)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1116, file: !1117, line: 209, baseType: !1214, size: 64, align: 64, offset: 1344)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1116, file: !1117, line: 212, baseType: !1214, size: 64, align: 64, offset: 1408)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1116, file: !1117, line: 213, baseType: !1123, size: 64, align: 64, offset: 1472)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1116, file: !1117, line: 215, baseType: !941, size: 32, align: 32, offset: 1536)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1116, file: !1117, line: 217, baseType: !941, size: 32, align: 32, offset: 1568)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1116, file: !1117, line: 220, baseType: !941, size: 32, align: 32, offset: 1600)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1103, file: !14, line: 1598, baseType: !943, size: 64, align: 64, offset: 384)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1103, file: !14, line: 1606, baseType: !1033, size: 64, align: 64, offset: 448)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1103, file: !14, line: 1614, baseType: !941, size: 32, align: 32, offset: 512)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1103, file: !14, line: 1622, baseType: !941, size: 32, align: 32, offset: 544)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1103, file: !14, line: 1628, baseType: !941, size: 32, align: 32, offset: 576)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1103, file: !14, line: 1636, baseType: !941, size: 32, align: 32, offset: 608)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1103, file: !14, line: 1643, baseType: !941, size: 32, align: 32, offset: 640)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1103, file: !14, line: 1657, baseType: !1129, size: 64, align: 64, offset: 704)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1103, file: !14, line: 1658, baseType: !941, size: 32, align: 32, offset: 768)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1103, file: !14, line: 1679, baseType: !990, size: 64, align: 32, offset: 800)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1103, file: !14, line: 1688, baseType: !941, size: 32, align: 32, offset: 864)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1103, file: !14, line: 1712, baseType: !941, size: 32, align: 32, offset: 896)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1103, file: !14, line: 1729, baseType: !941, size: 32, align: 32, offset: 928)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1103, file: !14, line: 1729, baseType: !941, size: 32, align: 32, offset: 960)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1103, file: !14, line: 1744, baseType: !941, size: 32, align: 32, offset: 992)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1103, file: !14, line: 1744, baseType: !941, size: 32, align: 32, offset: 1024)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1103, file: !14, line: 1751, baseType: !941, size: 32, align: 32, offset: 1056)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1103, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1103, file: !14, line: 1791, baseType: !1387, size: 64, align: 64, offset: 1152)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DISubroutineType(types: !1389)
!1389 = !{null, !1390, !1391, !1393, !941, !941, !941}
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1124)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1103, file: !14, line: 1808, baseType: !1395, size: 64, align: 64, offset: 1216)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DISubroutineType(types: !1397)
!1397 = !{!473, !1390, !997}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1103, file: !14, line: 1816, baseType: !941, size: 32, align: 32, offset: 1280)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1103, file: !14, line: 1825, baseType: !1400, size: 32, align: 32, offset: 1312)
!1400 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1103, file: !14, line: 1830, baseType: !941, size: 32, align: 32, offset: 1344)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1103, file: !14, line: 1838, baseType: !1400, size: 32, align: 32, offset: 1376)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1103, file: !14, line: 1846, baseType: !941, size: 32, align: 32, offset: 1408)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1103, file: !14, line: 1851, baseType: !941, size: 32, align: 32, offset: 1440)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1103, file: !14, line: 1861, baseType: !1400, size: 32, align: 32, offset: 1472)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1103, file: !14, line: 1868, baseType: !1400, size: 32, align: 32, offset: 1504)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1103, file: !14, line: 1875, baseType: !1400, size: 32, align: 32, offset: 1536)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1103, file: !14, line: 1882, baseType: !1400, size: 32, align: 32, offset: 1568)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1103, file: !14, line: 1889, baseType: !1400, size: 32, align: 32, offset: 1600)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1103, file: !14, line: 1896, baseType: !1400, size: 32, align: 32, offset: 1632)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1103, file: !14, line: 1903, baseType: !1400, size: 32, align: 32, offset: 1664)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1103, file: !14, line: 1910, baseType: !941, size: 32, align: 32, offset: 1696)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1103, file: !14, line: 1915, baseType: !941, size: 32, align: 32, offset: 1728)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1103, file: !14, line: 1926, baseType: !1393, size: 64, align: 64, offset: 1792)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1103, file: !14, line: 1935, baseType: !990, size: 64, align: 32, offset: 1856)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1103, file: !14, line: 1942, baseType: !941, size: 32, align: 32, offset: 1920)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1103, file: !14, line: 1948, baseType: !941, size: 32, align: 32, offset: 1952)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1103, file: !14, line: 1954, baseType: !941, size: 32, align: 32, offset: 1984)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1103, file: !14, line: 1960, baseType: !941, size: 32, align: 32, offset: 2016)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1103, file: !14, line: 1984, baseType: !941, size: 32, align: 32, offset: 2048)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1103, file: !14, line: 1991, baseType: !941, size: 32, align: 32, offset: 2080)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1103, file: !14, line: 1996, baseType: !941, size: 32, align: 32, offset: 2112)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1103, file: !14, line: 2004, baseType: !941, size: 32, align: 32, offset: 2144)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1103, file: !14, line: 2011, baseType: !941, size: 32, align: 32, offset: 2176)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1103, file: !14, line: 2018, baseType: !941, size: 32, align: 32, offset: 2208)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1103, file: !14, line: 2027, baseType: !941, size: 32, align: 32, offset: 2240)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1103, file: !14, line: 2034, baseType: !941, size: 32, align: 32, offset: 2272)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1103, file: !14, line: 2044, baseType: !941, size: 32, align: 32, offset: 2304)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1103, file: !14, line: 2054, baseType: !964, size: 64, align: 64, offset: 2368)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1103, file: !14, line: 2061, baseType: !964, size: 64, align: 64, offset: 2432)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1103, file: !14, line: 2066, baseType: !941, size: 32, align: 32, offset: 2496)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1103, file: !14, line: 2070, baseType: !941, size: 32, align: 32, offset: 2528)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1103, file: !14, line: 2078, baseType: !941, size: 32, align: 32, offset: 2560)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1103, file: !14, line: 2085, baseType: !941, size: 32, align: 32, offset: 2592)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1103, file: !14, line: 2092, baseType: !941, size: 32, align: 32, offset: 2624)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1103, file: !14, line: 2099, baseType: !941, size: 32, align: 32, offset: 2656)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1103, file: !14, line: 2106, baseType: !941, size: 32, align: 32, offset: 2688)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1103, file: !14, line: 2113, baseType: !941, size: 32, align: 32, offset: 2720)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1103, file: !14, line: 2120, baseType: !941, size: 32, align: 32, offset: 2752)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1103, file: !14, line: 2125, baseType: !941, size: 32, align: 32, offset: 2784)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1103, file: !14, line: 2133, baseType: !941, size: 32, align: 32, offset: 2816)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1103, file: !14, line: 2140, baseType: !941, size: 32, align: 32, offset: 2848)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1103, file: !14, line: 2145, baseType: !941, size: 32, align: 32, offset: 2880)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1103, file: !14, line: 2153, baseType: !941, size: 32, align: 32, offset: 2912)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1103, file: !14, line: 2158, baseType: !941, size: 32, align: 32, offset: 2944)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1103, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1103, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1103, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1103, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1103, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1103, file: !14, line: 2203, baseType: !941, size: 32, align: 32, offset: 3136)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1103, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1103, file: !14, line: 2212, baseType: !941, size: 32, align: 32, offset: 3200)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1103, file: !14, line: 2213, baseType: !941, size: 32, align: 32, offset: 3232)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1103, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1103, file: !14, line: 2232, baseType: !941, size: 32, align: 32, offset: 3296)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1103, file: !14, line: 2243, baseType: !941, size: 32, align: 32, offset: 3328)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1103, file: !14, line: 2249, baseType: !941, size: 32, align: 32, offset: 3360)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1103, file: !14, line: 2256, baseType: !941, size: 32, align: 32, offset: 3392)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1103, file: !14, line: 2263, baseType: !955, size: 64, align: 64, offset: 3456)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1103, file: !14, line: 2270, baseType: !955, size: 64, align: 64, offset: 3520)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1103, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1103, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1103, file: !14, line: 2367, baseType: !1465, size: 64, align: 64, offset: 3648)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!941, !1390, !1123, !941}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1103, file: !14, line: 2383, baseType: !941, size: 32, align: 32, offset: 3712)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1103, file: !14, line: 2386, baseType: !1400, size: 32, align: 32, offset: 3744)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1103, file: !14, line: 2387, baseType: !1400, size: 32, align: 32, offset: 3776)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1103, file: !14, line: 2394, baseType: !941, size: 32, align: 32, offset: 3808)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1103, file: !14, line: 2401, baseType: !941, size: 32, align: 32, offset: 3840)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1103, file: !14, line: 2408, baseType: !941, size: 32, align: 32, offset: 3872)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1103, file: !14, line: 2415, baseType: !941, size: 32, align: 32, offset: 3904)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1103, file: !14, line: 2422, baseType: !941, size: 32, align: 32, offset: 3936)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1103, file: !14, line: 2423, baseType: !1477, size: 64, align: 64, offset: 3968)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1479)
!1479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1480)
!1480 = !{!1481, !1482, !1483, !1484}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1479, file: !14, line: 827, baseType: !941, size: 32, align: 32)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1479, file: !14, line: 828, baseType: !941, size: 32, align: 32, offset: 32)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1479, file: !14, line: 829, baseType: !941, size: 32, align: 32, offset: 64)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1479, file: !14, line: 830, baseType: !1400, size: 32, align: 32, offset: 96)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1103, file: !14, line: 2430, baseType: !1033, size: 64, align: 64, offset: 4032)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1103, file: !14, line: 2437, baseType: !1033, size: 64, align: 64, offset: 4096)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1103, file: !14, line: 2444, baseType: !1400, size: 32, align: 32, offset: 4160)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1103, file: !14, line: 2451, baseType: !1400, size: 32, align: 32, offset: 4192)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1103, file: !14, line: 2458, baseType: !941, size: 32, align: 32, offset: 4224)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1103, file: !14, line: 2469, baseType: !941, size: 32, align: 32, offset: 4256)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1103, file: !14, line: 2475, baseType: !941, size: 32, align: 32, offset: 4288)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1103, file: !14, line: 2481, baseType: !941, size: 32, align: 32, offset: 4320)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1103, file: !14, line: 2485, baseType: !941, size: 32, align: 32, offset: 4352)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1103, file: !14, line: 2489, baseType: !941, size: 32, align: 32, offset: 4384)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1103, file: !14, line: 2493, baseType: !941, size: 32, align: 32, offset: 4416)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1103, file: !14, line: 2501, baseType: !941, size: 32, align: 32, offset: 4448)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1103, file: !14, line: 2506, baseType: !941, size: 32, align: 32, offset: 4480)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1103, file: !14, line: 2510, baseType: !941, size: 32, align: 32, offset: 4512)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1103, file: !14, line: 2514, baseType: !1033, size: 64, align: 64, offset: 4544)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1103, file: !14, line: 2528, baseType: !1501, size: 64, align: 64, offset: 4608)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{null, !1390, !943, !941, !941}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1103, file: !14, line: 2534, baseType: !941, size: 32, align: 32, offset: 4672)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1103, file: !14, line: 2545, baseType: !941, size: 32, align: 32, offset: 4704)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1103, file: !14, line: 2547, baseType: !941, size: 32, align: 32, offset: 4736)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1103, file: !14, line: 2549, baseType: !941, size: 32, align: 32, offset: 4768)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1103, file: !14, line: 2551, baseType: !941, size: 32, align: 32, offset: 4800)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1103, file: !14, line: 2553, baseType: !941, size: 32, align: 32, offset: 4832)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1103, file: !14, line: 2555, baseType: !941, size: 32, align: 32, offset: 4864)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1103, file: !14, line: 2557, baseType: !941, size: 32, align: 32, offset: 4896)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1103, file: !14, line: 2559, baseType: !941, size: 32, align: 32, offset: 4928)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1103, file: !14, line: 2563, baseType: !941, size: 32, align: 32, offset: 4960)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1103, file: !14, line: 2571, baseType: !1515, size: 64, align: 64, offset: 4992)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1103, file: !14, line: 2579, baseType: !1515, size: 64, align: 64, offset: 5056)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1103, file: !14, line: 2586, baseType: !941, size: 32, align: 32, offset: 5120)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1103, file: !14, line: 2615, baseType: !941, size: 32, align: 32, offset: 5152)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1103, file: !14, line: 2627, baseType: !941, size: 32, align: 32, offset: 5184)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1103, file: !14, line: 2637, baseType: !941, size: 32, align: 32, offset: 5216)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1103, file: !14, line: 2681, baseType: !941, size: 32, align: 32, offset: 5248)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1103, file: !14, line: 2709, baseType: !1033, size: 64, align: 64, offset: 5312)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1103, file: !14, line: 2716, baseType: !1524, size: 64, align: 64, offset: 5376)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1526)
!1526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1527)
!1527 = !{!1528, !1529, !1530, !1531, !1532, !1533, !1537, !1541, !1545, !1546, !1547, !1548, !1554, !1555, !1556, !1557, !1558}
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1526, file: !14, line: 3642, baseType: !980, size: 64, align: 64)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1526, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1526, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1526, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1526, file: !14, line: 3669, baseType: !941, size: 32, align: 32, offset: 160)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1526, file: !14, line: 3682, baseType: !1534, size: 64, align: 64, offset: 192)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{!941, !1101, !1123}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1526, file: !14, line: 3698, baseType: !1538, size: 64, align: 64, offset: 256)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DISubroutineType(types: !1540)
!1540 = !{!941, !1101, !944, !963}
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1526, file: !14, line: 3712, baseType: !1542, size: 64, align: 64, offset: 320)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DISubroutineType(types: !1544)
!1544 = !{!941, !1101, !941, !944, !963}
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1526, file: !14, line: 3726, baseType: !1538, size: 64, align: 64, offset: 384)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1526, file: !14, line: 3737, baseType: !1098, size: 64, align: 64, offset: 448)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1526, file: !14, line: 3746, baseType: !941, size: 32, align: 32, offset: 512)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1526, file: !14, line: 3757, baseType: !1549, size: 64, align: 64, offset: 576)
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64, align: 64)
!1550 = !DISubroutineType(types: !1551)
!1551 = !{null, !1552}
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1553 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1526, file: !14, line: 3766, baseType: !1098, size: 64, align: 64, offset: 640)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1526, file: !14, line: 3774, baseType: !1098, size: 64, align: 64, offset: 704)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1526, file: !14, line: 3780, baseType: !941, size: 32, align: 32, offset: 768)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1526, file: !14, line: 3785, baseType: !941, size: 32, align: 32, offset: 800)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1526, file: !14, line: 3795, baseType: !1559, size: 64, align: 64, offset: 832)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64, align: 64)
!1560 = !DISubroutineType(types: !1561)
!1561 = !{!941, !1101, !1161}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1103, file: !14, line: 2728, baseType: !943, size: 64, align: 64, offset: 5440)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1103, file: !14, line: 2735, baseType: !1151, size: 512, align: 64, offset: 5504)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1103, file: !14, line: 2742, baseType: !941, size: 32, align: 32, offset: 6016)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1103, file: !14, line: 2755, baseType: !941, size: 32, align: 32, offset: 6048)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1103, file: !14, line: 2776, baseType: !941, size: 32, align: 32, offset: 6080)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1103, file: !14, line: 2783, baseType: !941, size: 32, align: 32, offset: 6112)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1103, file: !14, line: 2791, baseType: !941, size: 32, align: 32, offset: 6144)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1103, file: !14, line: 2802, baseType: !1123, size: 64, align: 64, offset: 6208)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1103, file: !14, line: 2811, baseType: !941, size: 32, align: 32, offset: 6272)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1103, file: !14, line: 2821, baseType: !941, size: 32, align: 32, offset: 6304)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1103, file: !14, line: 2830, baseType: !941, size: 32, align: 32, offset: 6336)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1103, file: !14, line: 2840, baseType: !941, size: 32, align: 32, offset: 6368)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1103, file: !14, line: 2851, baseType: !1575, size: 64, align: 64, offset: 6400)
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1576, size: 64, align: 64)
!1576 = !DISubroutineType(types: !1577)
!1577 = !{!941, !1390, !1578, !943, !1393, !941, !941}
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64, align: 64)
!1579 = !DISubroutineType(types: !1580)
!1580 = !{!941, !1390, !943}
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1103, file: !14, line: 2871, baseType: !1582, size: 64, align: 64, offset: 6464)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DISubroutineType(types: !1584)
!1584 = !{!941, !1390, !1585, !943, !1393, !941}
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1586 = !DISubroutineType(types: !1587)
!1587 = !{!941, !1390, !943, !941, !941}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1103, file: !14, line: 2878, baseType: !941, size: 32, align: 32, offset: 6528)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1103, file: !14, line: 2885, baseType: !941, size: 32, align: 32, offset: 6560)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1103, file: !14, line: 3005, baseType: !941, size: 32, align: 32, offset: 6592)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1103, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1103, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1103, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1103, file: !14, line: 3037, baseType: !1129, size: 64, align: 64, offset: 6720)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1103, file: !14, line: 3038, baseType: !941, size: 32, align: 32, offset: 6784)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1103, file: !14, line: 3050, baseType: !955, size: 64, align: 64, offset: 6848)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1103, file: !14, line: 3065, baseType: !941, size: 32, align: 32, offset: 6912)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1103, file: !14, line: 3083, baseType: !941, size: 32, align: 32, offset: 6944)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1103, file: !14, line: 3092, baseType: !990, size: 64, align: 32, offset: 6976)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1103, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1103, file: !14, line: 3106, baseType: !990, size: 64, align: 32, offset: 7072)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1103, file: !14, line: 3113, baseType: !1603, size: 64, align: 64, offset: 7168)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1605)
!1605 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1606)
!1606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1607)
!1607 = !{!1608, !1609, !1610, !1611, !1612, !1613, !1616}
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1606, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1606, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1606, file: !14, line: 720, baseType: !980, size: 64, align: 64, offset: 64)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1606, file: !14, line: 724, baseType: !980, size: 64, align: 64, offset: 128)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1606, file: !14, line: 728, baseType: !941, size: 32, align: 32, offset: 192)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1606, file: !14, line: 734, baseType: !1614, size: 64, align: 64, offset: 256)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1615, size: 64, align: 64)
!1615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1606, file: !14, line: 739, baseType: !1617, size: 64, align: 64, offset: 320)
!1617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1618, size: 64, align: 64)
!1618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1089)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1103, file: !14, line: 3129, baseType: !1033, size: 64, align: 64, offset: 7232)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1103, file: !14, line: 3130, baseType: !1033, size: 64, align: 64, offset: 7296)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1103, file: !14, line: 3131, baseType: !1033, size: 64, align: 64, offset: 7360)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1103, file: !14, line: 3132, baseType: !1033, size: 64, align: 64, offset: 7424)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1103, file: !14, line: 3139, baseType: !1515, size: 64, align: 64, offset: 7488)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1103, file: !14, line: 3147, baseType: !941, size: 32, align: 32, offset: 7552)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1103, file: !14, line: 3165, baseType: !941, size: 32, align: 32, offset: 7584)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1103, file: !14, line: 3172, baseType: !941, size: 32, align: 32, offset: 7616)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1103, file: !14, line: 3180, baseType: !941, size: 32, align: 32, offset: 7648)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1103, file: !14, line: 3191, baseType: !964, size: 64, align: 64, offset: 7680)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1103, file: !14, line: 3199, baseType: !1129, size: 64, align: 64, offset: 7744)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1103, file: !14, line: 3207, baseType: !1515, size: 64, align: 64, offset: 7808)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1103, file: !14, line: 3214, baseType: !942, size: 32, align: 32, offset: 7872)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1103, file: !14, line: 3224, baseType: !1259, size: 64, align: 64, offset: 7936)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1103, file: !14, line: 3225, baseType: !941, size: 32, align: 32, offset: 8000)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1103, file: !14, line: 3249, baseType: !1161, size: 64, align: 64, offset: 8064)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1103, file: !14, line: 3256, baseType: !941, size: 32, align: 32, offset: 8128)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1103, file: !14, line: 3271, baseType: !941, size: 32, align: 32, offset: 8160)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1103, file: !14, line: 3279, baseType: !1033, size: 64, align: 64, offset: 8192)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1103, file: !14, line: 3301, baseType: !1161, size: 64, align: 64, offset: 8256)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1103, file: !14, line: 3310, baseType: !941, size: 32, align: 32, offset: 8320)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1103, file: !14, line: 3337, baseType: !941, size: 32, align: 32, offset: 8352)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1103, file: !14, line: 3351, baseType: !941, size: 32, align: 32, offset: 8384)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1103, file: !14, line: 3359, baseType: !941, size: 32, align: 32, offset: 8416)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !977, file: !14, line: 3535, baseType: !1644, size: 64, align: 64, offset: 1024)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DISubroutineType(types: !1646)
!1646 = !{!941, !1101, !1647}
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1102)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !977, file: !14, line: 3541, baseType: !1650, size: 64, align: 64, offset: 1088)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1652)
!1652 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1653)
!1653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1117, line: 223, size: 128, align: 64, elements: !1654)
!1654 = !{!1655, !1656}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1653, file: !1117, line: 224, baseType: !944, size: 64, align: 64)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1653, file: !1117, line: 225, baseType: !944, size: 64, align: 64, offset: 64)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !977, file: !14, line: 3549, baseType: !1658, size: 64, align: 64, offset: 1152)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DISubroutineType(types: !1660)
!1660 = !{null, !1096}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !977, file: !14, line: 3551, baseType: !1098, size: 64, align: 64, offset: 1216)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !977, file: !14, line: 3552, baseType: !1663, size: 64, align: 64, offset: 1280)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DISubroutineType(types: !1665)
!1665 = !{!941, !1101, !1129, !941, !1666}
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1668)
!1668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1669)
!1669 = !{!1670, !1671, !1672, !1673, !1674, !1698}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1668, file: !14, line: 3921, baseType: !965, size: 16, align: 16)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1668, file: !14, line: 3922, baseType: !963, size: 32, align: 32, offset: 32)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1668, file: !14, line: 3923, baseType: !963, size: 32, align: 32, offset: 64)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1668, file: !14, line: 3924, baseType: !942, size: 32, align: 32, offset: 96)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1668, file: !14, line: 3925, baseType: !1675, size: 64, align: 64, offset: 128)
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64, align: 64)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1678)
!1678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1679)
!1679 = !{!1680, !1681, !1682, !1683, !1684, !1685, !1691, !1693, !1694, !1695, !1696, !1697}
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1678, file: !14, line: 3886, baseType: !941, size: 32, align: 32)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1678, file: !14, line: 3887, baseType: !941, size: 32, align: 32, offset: 32)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1678, file: !14, line: 3888, baseType: !941, size: 32, align: 32, offset: 64)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1678, file: !14, line: 3889, baseType: !941, size: 32, align: 32, offset: 96)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1678, file: !14, line: 3890, baseType: !941, size: 32, align: 32, offset: 128)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1678, file: !14, line: 3897, baseType: !1686, size: 768, align: 64, offset: 192)
!1686 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1687)
!1687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1688)
!1688 = !{!1689, !1690}
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1687, file: !14, line: 3855, baseType: !1128, size: 512, align: 64)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1687, file: !14, line: 3857, baseType: !1133, size: 256, align: 32, offset: 512)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1678, file: !14, line: 3903, baseType: !1692, size: 256, align: 64, offset: 960)
!1692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1129, size: 256, align: 64, elements: !1230)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1678, file: !14, line: 3904, baseType: !1237, size: 128, align: 32, offset: 1216)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1678, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1678, file: !14, line: 3908, baseType: !1515, size: 64, align: 64, offset: 1408)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1678, file: !14, line: 3915, baseType: !1515, size: 64, align: 64, offset: 1472)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1678, file: !14, line: 3917, baseType: !941, size: 32, align: 32, offset: 1536)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1668, file: !14, line: 3926, baseType: !1033, size: 64, align: 64, offset: 192)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !977, file: !14, line: 3564, baseType: !1700, size: 64, align: 64, offset: 1344)
!1700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1701, size: 64, align: 64)
!1701 = !DISubroutineType(types: !1702)
!1702 = !{!941, !1101, !1247, !1391, !1393}
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !977, file: !14, line: 3566, baseType: !1704, size: 64, align: 64, offset: 1408)
!1704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1705, size: 64, align: 64)
!1705 = !DISubroutineType(types: !1706)
!1706 = !{!941, !1101, !943, !1393, !1247}
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !977, file: !14, line: 3567, baseType: !1098, size: 64, align: 64, offset: 1472)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !977, file: !14, line: 3576, baseType: !1709, size: 64, align: 64, offset: 1536)
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1710 = !DISubroutineType(types: !1711)
!1711 = !{!941, !1101, !1391}
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !977, file: !14, line: 3577, baseType: !1713, size: 64, align: 64, offset: 1600)
