; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--sdp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--sdp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVStream = type { i32, i32, %struct.AVCodecContext*, i8*, %struct.AVRational, i64, i64, i64, i32, i32, %struct.AVRational, %struct.AVDictionary*, %struct.AVRational, %struct.AVPacket, %struct.AVPacketSideData*, i32, i32, %struct.AVRational, i8*, %struct.AVCodecParameters*, %struct.anon*, i32, i64, i64, i64, i32, i32, i32, i32, %struct.AVCodecParserContext*, %struct.AVPacketList*, %struct.AVProbeData, [17 x i64], %struct.AVIndexEntry*, i32, i32, i32, i32, i32, i32, i64, i64, i32, i32, i32, i64, i64, i64, i32, i64, i64, i32, i32, [17 x i64], [17 x i8], i64, i8, i8, i32, %struct.AVRational, %struct.AVStreamInternal* }

!902 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!903 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!904 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!905 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!906 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!907 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!908 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !910, line: 782, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!911 = !{!912, !913, !914, !915, !916, !917}
!912 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!913 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!914 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!915 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!916 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!917 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !57, line: 5085, size: 32, align: 32, elements: !919)
!919 = !{!920, !921, !922, !923}
!920 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!921 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!922 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!923 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!924 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVIODataMarkerType", file: !925, line: 111, size: 32, align: 32, elements: !926)
!925 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!926 = !{!927, !928, !929, !930, !931, !932}
!927 = !DIEnumerator(name: "AVIO_DATA_MARKER_HEADER", value: 0)
!928 = !DIEnumerator(name: "AVIO_DATA_MARKER_SYNC_POINT", value: 1)
!929 = !DIEnumerator(name: "AVIO_DATA_MARKER_BOUNDARY_POINT", value: 2)
!930 = !DIEnumerator(name: "AVIO_DATA_MARKER_UNKNOWN", value: 3)
!931 = !DIEnumerator(name: "AVIO_DATA_MARKER_TRAILER", value: 4)
!932 = !DIEnumerator(name: "AVIO_DATA_MARKER_FLUSH_POINT", value: 5)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !910, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !{!939}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !942, line: 222, size: 16, align: 8, elements: !943)
!942 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!943 = !{!944}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !941, file: !942, line: 222, baseType: !945, size: 16, align: 16)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !946, line: 49, baseType: !947)
!946 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!947 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!948 = !{!949, !2263, !2267}
!949 = distinct !DIGlobalVariable(name: "pset_string", scope: !950, file: !951, line: 158, type: !2260, isLocal: true, isDefinition: true, variable: [24 x i8]* @extradata2psets.pset_string)
!950 = distinct !DISubprogram(name: "extradata2psets", scope: !951, file: !951, line: 154, type: !952, isLocal: true, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2259)
!951 = !DIFile(filename: "libavformat/sdp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!952 = !DISubroutineType(types: !953)
!953 = !{!954, !956, !1599}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !910, line: 1947, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !910, line: 1337, size: 11968, align: 64, elements: !959)
!959 = !{!960, !1045, !1157, !1299, !1300, !1365, !1366, !1367, !2116, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2170, !2171, !2172, !2173, !2174, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2225, !2226, !2229, !2230, !2231, !2232, !2233, !2234, !2236, !2237, !2238, !2239, !2247, !2248, !2252, !2256, !2257, !2258}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !958, file: !910, line: 1342, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !965)
!965 = !{!966, !969, !974, !1004, !1005, !1006, !1007, !1011, !1017, !1019, !1023}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !964, file: !26, line: 72, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !964, file: !26, line: 78, baseType: !970, size: 64, align: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!967, !973}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !964, file: !26, line: 85, baseType: !975, size: 64, align: 64, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !978)
!978 = !{!979, !980, !981, !983, !984, !1000, !1001, !1002, !1003}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !977, file: !4, line: 247, baseType: !967, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !977, file: !4, line: 253, baseType: !967, size: 64, align: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !977, file: !4, line: 259, baseType: !982, size: 32, align: 32, offset: 128)
!982 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !977, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !977, file: !4, line: 271, baseType: !985, size: 64, align: 64, offset: 192)
!985 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !977, file: !4, line: 265, size: 64, align: 64, elements: !986)
!986 = !{!987, !990, !992, !993}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !985, file: !4, line: 266, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !946, line: 40, baseType: !989)
!989 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !985, file: !4, line: 267, baseType: !991, size: 64, align: 64)
!991 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !985, file: !4, line: 268, baseType: !967, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !985, file: !4, line: 270, baseType: !994, size: 64, align: 32)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !995, line: 61, baseType: !996)
!995 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !995, line: 58, size: 64, align: 32, elements: !997)
!997 = !{!998, !999}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !996, file: !995, line: 59, baseType: !982, size: 32, align: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !996, file: !995, line: 60, baseType: !982, size: 32, align: 32, offset: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !977, file: !4, line: 272, baseType: !991, size: 64, align: 64, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !977, file: !4, line: 273, baseType: !991, size: 64, align: 64, offset: 320)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !977, file: !4, line: 275, baseType: !982, size: 32, align: 32, offset: 384)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !977, file: !4, line: 300, baseType: !967, size: 64, align: 64, offset: 448)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !964, file: !26, line: 93, baseType: !982, size: 32, align: 32, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !964, file: !26, line: 99, baseType: !982, size: 32, align: 32, offset: 224)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !964, file: !26, line: 108, baseType: !982, size: 32, align: 32, offset: 256)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !964, file: !26, line: 113, baseType: !1008, size: 64, align: 64, offset: 320)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!973, !973, !973}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !964, file: !26, line: 123, baseType: !1012, size: 64, align: 64, offset: 384)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!1015, !1015}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !964, file: !26, line: 130, baseType: !1018, size: 32, align: 32, offset: 448)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !964, file: !26, line: 136, baseType: !1020, size: 64, align: 64, offset: 512)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!1018, !973}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !964, file: !26, line: 142, baseType: !1024, size: 64, align: 64, offset: 576)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!982, !1027, !973, !967, !982}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1030)
!1030 = !{!1031, !1043, !1044}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1029, file: !4, line: 360, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1036)
!1036 = !{!1037, !1038, !1039, !1040, !1041, !1042}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1035, file: !4, line: 307, baseType: !967, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1035, file: !4, line: 313, baseType: !991, size: 64, align: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1035, file: !4, line: 313, baseType: !991, size: 64, align: 64, offset: 128)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1035, file: !4, line: 318, baseType: !991, size: 64, align: 64, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1035, file: !4, line: 318, baseType: !991, size: 64, align: 64, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1035, file: !4, line: 323, baseType: !982, size: 32, align: 32, offset: 320)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1029, file: !4, line: 364, baseType: !982, size: 32, align: 32, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1029, file: !4, line: 368, baseType: !982, size: 32, align: 32, offset: 96)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !958, file: !910, line: 1349, baseType: !1046, size: 64, align: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !910, line: 633, size: 1344, align: 64, elements: !1048)
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1064, !1065, !1066, !1067, !1068, !1069, !1083, !1088, !1128, !1129, !1133, !1138, !1139, !1140, !1144, !1150, !1156}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1047, file: !910, line: 638, baseType: !967, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1047, file: !910, line: 645, baseType: !967, size: 64, align: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1047, file: !910, line: 652, baseType: !982, size: 32, align: 32, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1047, file: !910, line: 659, baseType: !967, size: 64, align: 64, offset: 192)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1047, file: !910, line: 661, baseType: !1054, size: 64, align: 64, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1056)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1059, line: 44, size: 64, align: 32, elements: !1060)
!1059 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1060 = !{!1061, !1062}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1058, file: !1059, line: 45, baseType: !56, size: 32, align: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1058, file: !1059, line: 46, baseType: !1063, size: 32, align: 32, offset: 32)
!1063 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1047, file: !910, line: 663, baseType: !961, size: 64, align: 64, offset: 320)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1047, file: !910, line: 670, baseType: !967, size: 64, align: 64, offset: 384)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1047, file: !910, line: 679, baseType: !1046, size: 64, align: 64, offset: 448)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1047, file: !910, line: 684, baseType: !982, size: 32, align: 32, offset: 512)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1047, file: !910, line: 689, baseType: !982, size: 32, align: 32, offset: 544)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1047, file: !910, line: 696, baseType: !1070, size: 64, align: 64, offset: 576)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!982, !1073}
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !910, line: 453, baseType: !1075)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !910, line: 448, size: 256, align: 64, elements: !1076)
!1076 = !{!1077, !1078, !1081, !1082}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1075, file: !910, line: 449, baseType: !967, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1075, file: !910, line: 450, baseType: !1079, size: 64, align: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1075, file: !910, line: 451, baseType: !982, size: 32, align: 32, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1075, file: !910, line: 452, baseType: !967, size: 64, align: 64, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1047, file: !910, line: 703, baseType: !1084, size: 64, align: 64, offset: 640)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!982, !1087}
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1047, file: !910, line: 714, baseType: !1089, size: 64, align: 64, offset: 704)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!982, !1087, !1092}
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1094)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1095)
!1095 = !{!1096, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1124, !1125, !1126, !1127}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1094, file: !57, line: 1451, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1099, line: 94, baseType: !1100)
!1099 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1099, line: 81, size: 192, align: 64, elements: !1101)
!1101 = !{!1102, !1106, !1109}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1100, file: !1099, line: 82, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1099, line: 73, baseType: !1105)
!1105 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1099, line: 73, flags: DIFlagFwdDecl)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1100, file: !1099, line: 89, baseType: !1107, size: 64, align: 64, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !946, line: 48, baseType: !1080)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1100, file: !1099, line: 93, baseType: !982, size: 32, align: 32, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1094, file: !57, line: 1461, baseType: !988, size: 64, align: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1094, file: !57, line: 1467, baseType: !988, size: 64, align: 64, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1094, file: !57, line: 1468, baseType: !1107, size: 64, align: 64, offset: 192)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1094, file: !57, line: 1469, baseType: !982, size: 32, align: 32, offset: 256)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1094, file: !57, line: 1470, baseType: !982, size: 32, align: 32, offset: 288)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1094, file: !57, line: 1474, baseType: !982, size: 32, align: 32, offset: 320)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1094, file: !57, line: 1479, baseType: !1117, size: 64, align: 64, offset: 384)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1119)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1120)
!1120 = !{!1121, !1122, !1123}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1119, file: !57, line: 1412, baseType: !1107, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1119, file: !57, line: 1413, baseType: !982, size: 32, align: 32, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1119, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1094, file: !57, line: 1480, baseType: !982, size: 32, align: 32, offset: 448)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1094, file: !57, line: 1486, baseType: !988, size: 64, align: 64, offset: 512)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1094, file: !57, line: 1488, baseType: !988, size: 64, align: 64, offset: 576)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1094, file: !57, line: 1497, baseType: !988, size: 64, align: 64, offset: 640)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1047, file: !910, line: 720, baseType: !1084, size: 64, align: 64, offset: 768)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1047, file: !910, line: 730, baseType: !1130, size: 64, align: 64, offset: 832)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!982, !1087, !982, !988, !982}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1047, file: !910, line: 737, baseType: !1134, size: 64, align: 64, offset: 896)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!988, !1087, !982, !1137, !988}
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1047, file: !910, line: 744, baseType: !1084, size: 64, align: 64, offset: 960)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1047, file: !910, line: 750, baseType: !1084, size: 64, align: 64, offset: 1024)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1047, file: !910, line: 758, baseType: !1141, size: 64, align: 64, offset: 1088)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!982, !1087, !982, !988, !988, !988, !982}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1047, file: !910, line: 764, baseType: !1145, size: 64, align: 64, offset: 1152)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!982, !1087, !1148}
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !910, line: 328, flags: DIFlagFwdDecl)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1047, file: !910, line: 770, baseType: !1151, size: 64, align: 64, offset: 1216)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!982, !1087, !1154}
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !910, line: 329, flags: DIFlagFwdDecl)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1047, file: !910, line: 776, baseType: !1151, size: 64, align: 64, offset: 1280)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !958, file: !910, line: 1356, baseType: !1158, size: 64, align: 64, offset: 128)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !910, line: 497, size: 1600, align: 64, elements: !1160)
!1160 = !{!1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1180, !1184, !1188, !1195, !1284, !1285, !1286, !1287, !1288, !1289, !1293}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1159, file: !910, line: 498, baseType: !967, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1159, file: !910, line: 504, baseType: !967, size: 64, align: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1159, file: !910, line: 505, baseType: !967, size: 64, align: 64, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1159, file: !910, line: 506, baseType: !967, size: 64, align: 64, offset: 192)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1159, file: !910, line: 508, baseType: !56, size: 32, align: 32, offset: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1159, file: !910, line: 509, baseType: !56, size: 32, align: 32, offset: 288)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1159, file: !910, line: 510, baseType: !56, size: 32, align: 32, offset: 320)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1159, file: !910, line: 517, baseType: !982, size: 32, align: 32, offset: 352)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1159, file: !910, line: 523, baseType: !1054, size: 64, align: 64, offset: 384)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1159, file: !910, line: 526, baseType: !961, size: 64, align: 64, offset: 448)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1159, file: !910, line: 535, baseType: !1158, size: 64, align: 64, offset: 512)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1159, file: !910, line: 539, baseType: !982, size: 32, align: 32, offset: 576)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1159, file: !910, line: 541, baseType: !1084, size: 64, align: 64, offset: 640)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1159, file: !910, line: 549, baseType: !1089, size: 64, align: 64, offset: 704)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1159, file: !910, line: 550, baseType: !1084, size: 64, align: 64, offset: 768)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1159, file: !910, line: 554, baseType: !1177, size: 64, align: 64, offset: 832)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!982, !1087, !1092, !1092, !982}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1159, file: !910, line: 563, baseType: !1181, size: 64, align: 64, offset: 896)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!982, !56, !982}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1159, file: !910, line: 565, baseType: !1185, size: 64, align: 64, offset: 960)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{null, !1087, !982, !1137, !1137}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1159, file: !910, line: 570, baseType: !1189, size: 64, align: 64, offset: 1024)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!982, !1087, !982, !973, !1192}
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1193, line: 216, baseType: !1194)
!1193 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1194 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1159, file: !910, line: 581, baseType: !1196, size: 64, align: 64, offset: 1088)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!982, !1087, !982, !1199, !1063}
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1202)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1203)
!1203 = !{!1204, !1208, !1210, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1238, !1240, !1241, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1202, file: !780, line: 282, baseType: !1205, size: 512, align: 64)
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1107, size: 512, align: 64, elements: !1206)
!1206 = !{!1207}
!1207 = !DISubrange(count: 8)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1202, file: !780, line: 299, baseType: !1209, size: 256, align: 32, offset: 512)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 256, align: 32, elements: !1206)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1202, file: !780, line: 315, baseType: !1211, size: 64, align: 64, offset: 768)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1202, file: !780, line: 326, baseType: !982, size: 32, align: 32, offset: 832)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1202, file: !780, line: 326, baseType: !982, size: 32, align: 32, offset: 864)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1202, file: !780, line: 334, baseType: !982, size: 32, align: 32, offset: 896)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1202, file: !780, line: 341, baseType: !982, size: 32, align: 32, offset: 928)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1202, file: !780, line: 346, baseType: !982, size: 32, align: 32, offset: 960)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1202, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1202, file: !780, line: 356, baseType: !994, size: 64, align: 32, offset: 1024)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1202, file: !780, line: 361, baseType: !988, size: 64, align: 64, offset: 1088)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1202, file: !780, line: 369, baseType: !988, size: 64, align: 64, offset: 1152)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1202, file: !780, line: 377, baseType: !988, size: 64, align: 64, offset: 1216)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1202, file: !780, line: 382, baseType: !982, size: 32, align: 32, offset: 1280)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1202, file: !780, line: 386, baseType: !982, size: 32, align: 32, offset: 1312)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1202, file: !780, line: 391, baseType: !982, size: 32, align: 32, offset: 1344)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1202, file: !780, line: 396, baseType: !973, size: 64, align: 64, offset: 1408)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1202, file: !780, line: 403, baseType: !1227, size: 512, align: 64, offset: 1472)
!1227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1228, size: 512, align: 64, elements: !1206)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !946, line: 55, baseType: !1194)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1202, file: !780, line: 410, baseType: !982, size: 32, align: 32, offset: 1984)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1202, file: !780, line: 415, baseType: !982, size: 32, align: 32, offset: 2016)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1202, file: !780, line: 420, baseType: !982, size: 32, align: 32, offset: 2048)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1202, file: !780, line: 425, baseType: !982, size: 32, align: 32, offset: 2080)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1202, file: !780, line: 435, baseType: !988, size: 64, align: 64, offset: 2112)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1202, file: !780, line: 440, baseType: !982, size: 32, align: 32, offset: 2176)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1202, file: !780, line: 445, baseType: !1228, size: 64, align: 64, offset: 2240)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1202, file: !780, line: 459, baseType: !1237, size: 512, align: 64, offset: 2304)
!1237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1097, size: 512, align: 64, elements: !1206)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1202, file: !780, line: 473, baseType: !1239, size: 64, align: 64, offset: 2816)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1202, file: !780, line: 477, baseType: !982, size: 32, align: 32, offset: 2880)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1202, file: !780, line: 479, baseType: !1242, size: 64, align: 64, offset: 2944)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1245)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1246)
!1246 = !{!1247, !1248, !1249, !1250, !1255}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1245, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1245, file: !780, line: 203, baseType: !1107, size: 64, align: 64, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1245, file: !780, line: 204, baseType: !982, size: 32, align: 32, offset: 128)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1245, file: !780, line: 205, baseType: !1251, size: 64, align: 64, offset: 192)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1253, line: 86, baseType: !1254)
!1253 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1254 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1253, line: 86, flags: DIFlagFwdDecl)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1245, file: !780, line: 206, baseType: !1097, size: 64, align: 64, offset: 256)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1202, file: !780, line: 480, baseType: !982, size: 32, align: 32, offset: 3008)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1202, file: !780, line: 505, baseType: !982, size: 32, align: 32, offset: 3040)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1202, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1202, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1202, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1202, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1202, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1202, file: !780, line: 532, baseType: !988, size: 64, align: 64, offset: 3264)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1202, file: !780, line: 539, baseType: !988, size: 64, align: 64, offset: 3328)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1202, file: !780, line: 547, baseType: !988, size: 64, align: 64, offset: 3392)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1202, file: !780, line: 554, baseType: !1251, size: 64, align: 64, offset: 3456)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1202, file: !780, line: 563, baseType: !982, size: 32, align: 32, offset: 3520)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1202, file: !780, line: 572, baseType: !982, size: 32, align: 32, offset: 3552)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1202, file: !780, line: 581, baseType: !982, size: 32, align: 32, offset: 3584)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1202, file: !780, line: 588, baseType: !1271, size: 64, align: 64, offset: 3648)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !946, line: 36, baseType: !1273)
!1273 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1202, file: !780, line: 593, baseType: !982, size: 32, align: 32, offset: 3712)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1202, file: !780, line: 596, baseType: !982, size: 32, align: 32, offset: 3744)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1202, file: !780, line: 599, baseType: !1097, size: 64, align: 64, offset: 3776)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1202, file: !780, line: 605, baseType: !1097, size: 64, align: 64, offset: 3840)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1202, file: !780, line: 616, baseType: !1097, size: 64, align: 64, offset: 3904)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1202, file: !780, line: 626, baseType: !1192, size: 64, align: 64, offset: 3968)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1202, file: !780, line: 627, baseType: !1192, size: 64, align: 64, offset: 4032)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1202, file: !780, line: 628, baseType: !1192, size: 64, align: 64, offset: 4096)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1202, file: !780, line: 629, baseType: !1192, size: 64, align: 64, offset: 4160)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1202, file: !780, line: 645, baseType: !1097, size: 64, align: 64, offset: 4224)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1159, file: !910, line: 587, baseType: !1145, size: 64, align: 64, offset: 1152)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1159, file: !910, line: 592, baseType: !1151, size: 64, align: 64, offset: 1216)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1159, file: !910, line: 597, baseType: !1151, size: 64, align: 64, offset: 1280)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1159, file: !910, line: 598, baseType: !56, size: 32, align: 32, offset: 1344)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1159, file: !910, line: 608, baseType: !1084, size: 64, align: 64, offset: 1408)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1159, file: !910, line: 617, baseType: !1290, size: 64, align: 64, offset: 1472)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{null, !1087}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1159, file: !910, line: 623, baseType: !1294, size: 64, align: 64, offset: 1536)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!982, !1087, !1297}
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1093)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !958, file: !910, line: 1365, baseType: !973, size: 64, align: 64, offset: 192)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !958, file: !910, line: 1379, baseType: !1301, size: 64, align: 64, offset: 256)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !925, line: 352, baseType: !1303)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !925, line: 161, size: 2112, align: 64, elements: !1304)
!1304 = !{!1305, !1306, !1307, !1308, !1309, !1310, !1311, !1315, !1316, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1332, !1333, !1337, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1355, !1356, !1357, !1358, !1362, !1363, !1364}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1303, file: !925, line: 174, baseType: !961, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1303, file: !925, line: 226, baseType: !1079, size: 64, align: 64, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1303, file: !925, line: 227, baseType: !982, size: 32, align: 32, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1303, file: !925, line: 228, baseType: !1079, size: 64, align: 64, offset: 192)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1303, file: !925, line: 229, baseType: !1079, size: 64, align: 64, offset: 256)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1303, file: !925, line: 233, baseType: !973, size: 64, align: 64, offset: 320)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1303, file: !925, line: 235, baseType: !1312, size: 64, align: 64, offset: 384)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{!982, !973, !1107, !982}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1303, file: !925, line: 236, baseType: !1312, size: 64, align: 64, offset: 448)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1303, file: !925, line: 237, baseType: !1317, size: 64, align: 64, offset: 512)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!988, !973, !988, !982}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1303, file: !925, line: 238, baseType: !988, size: 64, align: 64, offset: 576)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1303, file: !925, line: 239, baseType: !982, size: 32, align: 32, offset: 640)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1303, file: !925, line: 240, baseType: !982, size: 32, align: 32, offset: 672)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1303, file: !925, line: 241, baseType: !982, size: 32, align: 32, offset: 704)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1303, file: !925, line: 242, baseType: !1194, size: 64, align: 64, offset: 768)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1303, file: !925, line: 243, baseType: !1079, size: 64, align: 64, offset: 832)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1303, file: !925, line: 244, baseType: !1327, size: 64, align: 64, offset: 896)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!1194, !1194, !1330, !1063}
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1108)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1303, file: !925, line: 245, baseType: !982, size: 32, align: 32, offset: 960)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1303, file: !925, line: 249, baseType: !1334, size: 64, align: 64, offset: 1024)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DISubroutineType(types: !1336)
!1336 = !{!982, !973, !982}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1303, file: !925, line: 255, baseType: !1338, size: 64, align: 64, offset: 1088)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!988, !973, !982, !988, !982}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1303, file: !925, line: 260, baseType: !982, size: 32, align: 32, offset: 1152)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1303, file: !925, line: 266, baseType: !988, size: 64, align: 64, offset: 1216)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1303, file: !925, line: 273, baseType: !982, size: 32, align: 32, offset: 1280)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1303, file: !925, line: 279, baseType: !988, size: 64, align: 64, offset: 1344)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1303, file: !925, line: 285, baseType: !982, size: 32, align: 32, offset: 1408)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1303, file: !925, line: 291, baseType: !982, size: 32, align: 32, offset: 1440)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1303, file: !925, line: 298, baseType: !982, size: 32, align: 32, offset: 1472)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1303, file: !925, line: 304, baseType: !982, size: 32, align: 32, offset: 1504)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1303, file: !925, line: 309, baseType: !967, size: 64, align: 64, offset: 1536)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1303, file: !925, line: 314, baseType: !967, size: 64, align: 64, offset: 1600)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1303, file: !925, line: 319, baseType: !1352, size: 64, align: 64, offset: 1664)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DISubroutineType(types: !1354)
!1354 = !{!982, !973, !1107, !982, !924, !988}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1303, file: !925, line: 326, baseType: !982, size: 32, align: 32, offset: 1728)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1303, file: !925, line: 331, baseType: !924, size: 32, align: 32, offset: 1760)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1303, file: !925, line: 332, baseType: !988, size: 64, align: 64, offset: 1792)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1303, file: !925, line: 338, baseType: !1359, size: 64, align: 64, offset: 1856)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DISubroutineType(types: !1361)
!1361 = !{!982, !973}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1303, file: !925, line: 340, baseType: !988, size: 64, align: 64, offset: 1920)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1303, file: !925, line: 346, baseType: !1079, size: 64, align: 64, offset: 1984)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1303, file: !925, line: 351, baseType: !982, size: 32, align: 32, offset: 2048)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !958, file: !910, line: 1386, baseType: !982, size: 32, align: 32, offset: 320)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !958, file: !910, line: 1393, baseType: !1063, size: 32, align: 32, offset: 352)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !958, file: !910, line: 1405, baseType: !1368, size: 64, align: 64, offset: 384)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !910, line: 1223, baseType: !1371)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !910, line: 865, size: 6144, align: 64, elements: !1372)
!1372 = !{!1373, !1374, !1375, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !2041, !2047, !2048, !2052, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2084, !2085, !2086, !2087, !2088, !2089}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1371, file: !910, line: 866, baseType: !982, size: 32, align: 32)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1371, file: !910, line: 872, baseType: !982, size: 32, align: 32, offset: 32)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1371, file: !910, line: 878, baseType: !1376, size: 64, align: 64, offset: 64)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1378)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1379)
!1379 = !{!1380, !1381, !1382, !1383, !1522, !1523, !1524, !1525, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1678, !1682, !1683, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1862, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1378, file: !57, line: 1561, baseType: !961, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1378, file: !57, line: 1562, baseType: !982, size: 32, align: 32, offset: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1378, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1378, file: !57, line: 1565, baseType: !1384, size: 64, align: 64, offset: 128)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1386)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1387)
!1387 = !{!1388, !1389, !1390, !1391, !1392, !1393, !1396, !1399, !1402, !1405, !1408, !1409, !1410, !1418, !1419, !1420, !1422, !1426, !1432, !1441, !1445, !1446, !1487, !1494, !1498, !1499, !1503, !1507, !1511, !1515, !1516, !1517}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1386, file: !57, line: 3475, baseType: !967, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1386, file: !57, line: 3480, baseType: !967, size: 64, align: 64, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1386, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1386, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1386, file: !57, line: 3487, baseType: !982, size: 32, align: 32, offset: 192)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1386, file: !57, line: 3488, baseType: !1394, size: 64, align: 64, offset: 256)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1386, file: !57, line: 3489, baseType: !1397, size: 64, align: 64, offset: 320)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1386, file: !57, line: 3490, baseType: !1400, size: 64, align: 64, offset: 384)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1386, file: !57, line: 3491, baseType: !1403, size: 64, align: 64, offset: 448)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1386, file: !57, line: 3492, baseType: !1406, size: 64, align: 64, offset: 512)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1228)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1386, file: !57, line: 3493, baseType: !1108, size: 8, align: 8, offset: 576)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1386, file: !57, line: 3494, baseType: !961, size: 64, align: 64, offset: 640)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1386, file: !57, line: 3495, baseType: !1411, size: 64, align: 64, offset: 704)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1413)
!1413 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1414)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1415)
!1415 = !{!1416, !1417}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1414, file: !57, line: 3402, baseType: !982, size: 32, align: 32)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1414, file: !57, line: 3403, baseType: !967, size: 64, align: 64, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1386, file: !57, line: 3507, baseType: !967, size: 64, align: 64, offset: 768)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1386, file: !57, line: 3516, baseType: !982, size: 32, align: 32, offset: 832)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1386, file: !57, line: 3517, baseType: !1421, size: 64, align: 64, offset: 896)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1386, file: !57, line: 3527, baseType: !1423, size: 64, align: 64, offset: 960)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DISubroutineType(types: !1425)
!1425 = !{!982, !1376}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1386, file: !57, line: 3535, baseType: !1427, size: 64, align: 64, offset: 1024)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{!982, !1376, !1430}
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1377)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1386, file: !57, line: 3541, baseType: !1433, size: 64, align: 64, offset: 1088)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1435)
!1435 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1436)
!1436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1437, line: 223, size: 128, align: 64, elements: !1438)
!1437 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1438 = !{!1439, !1440}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1436, file: !1437, line: 224, baseType: !1330, size: 64, align: 64)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1436, file: !1437, line: 225, baseType: !1330, size: 64, align: 64, offset: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1386, file: !57, line: 3549, baseType: !1442, size: 64, align: 64, offset: 1152)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{null, !1421}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1386, file: !57, line: 3551, baseType: !1423, size: 64, align: 64, offset: 1216)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1386, file: !57, line: 3552, baseType: !1447, size: 64, align: 64, offset: 1280)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DISubroutineType(types: !1449)
!1449 = !{!982, !1376, !1107, !982, !1450}
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64, align: 64)
!1451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1452)
!1452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1453)
!1453 = !{!1454, !1455, !1457, !1458, !1459, !1486}
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1452, file: !57, line: 3921, baseType: !945, size: 16, align: 16)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1452, file: !57, line: 3922, baseType: !1456, size: 32, align: 32, offset: 32)
!1456 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !946, line: 51, baseType: !1063)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1452, file: !57, line: 3923, baseType: !1456, size: 32, align: 32, offset: 64)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1452, file: !57, line: 3924, baseType: !1063, size: 32, align: 32, offset: 96)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1452, file: !57, line: 3925, baseType: !1460, size: 64, align: 64, offset: 128)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1463)
!1463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1464)
!1464 = !{!1465, !1466, !1467, !1468, !1469, !1470, !1476, !1480, !1482, !1483, !1484, !1485}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1463, file: !57, line: 3886, baseType: !982, size: 32, align: 32)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1463, file: !57, line: 3887, baseType: !982, size: 32, align: 32, offset: 32)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1463, file: !57, line: 3888, baseType: !982, size: 32, align: 32, offset: 64)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1463, file: !57, line: 3889, baseType: !982, size: 32, align: 32, offset: 96)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1463, file: !57, line: 3890, baseType: !982, size: 32, align: 32, offset: 128)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1463, file: !57, line: 3897, baseType: !1471, size: 768, align: 64, offset: 192)
!1471 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1472)
!1472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1473)
!1473 = !{!1474, !1475}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1472, file: !57, line: 3855, baseType: !1205, size: 512, align: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1472, file: !57, line: 3857, baseType: !1209, size: 256, align: 32, offset: 512)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1463, file: !57, line: 3903, baseType: !1477, size: 256, align: 64, offset: 960)
!1477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1107, size: 256, align: 64, elements: !1478)
!1478 = !{!1479}
!1479 = !DISubrange(count: 4)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1463, file: !57, line: 3904, baseType: !1481, size: 128, align: 32, offset: 1216)
!1481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 128, align: 32, elements: !1478)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1463, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1463, file: !57, line: 3908, baseType: !954, size: 64, align: 64, offset: 1408)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1463, file: !57, line: 3915, baseType: !954, size: 64, align: 64, offset: 1472)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1463, file: !57, line: 3917, baseType: !982, size: 32, align: 32, offset: 1536)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1452, file: !57, line: 3926, baseType: !988, size: 64, align: 64, offset: 192)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1386, file: !57, line: 3564, baseType: !1488, size: 64, align: 64, offset: 1344)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{!982, !1376, !1092, !1491, !1493}
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1201)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1386, file: !57, line: 3566, baseType: !1495, size: 64, align: 64, offset: 1408)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{!982, !1376, !973, !1493, !1092}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1386, file: !57, line: 3567, baseType: !1423, size: 64, align: 64, offset: 1472)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1386, file: !57, line: 3576, baseType: !1500, size: 64, align: 64, offset: 1536)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{!982, !1376, !1491}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1386, file: !57, line: 3577, baseType: !1504, size: 64, align: 64, offset: 1600)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{!982, !1376, !1092}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1386, file: !57, line: 3584, baseType: !1508, size: 64, align: 64, offset: 1664)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DISubroutineType(types: !1510)
!1510 = !{!982, !1376, !1200}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1386, file: !57, line: 3589, baseType: !1512, size: 64, align: 64, offset: 1728)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64, align: 64)
!1513 = !DISubroutineType(types: !1514)
!1514 = !{null, !1376}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1386, file: !57, line: 3594, baseType: !982, size: 32, align: 32, offset: 1792)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1386, file: !57, line: 3600, baseType: !967, size: 64, align: 64, offset: 1856)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1386, file: !57, line: 3609, baseType: !1518, size: 64, align: 64, offset: 1920)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1521)
!1521 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1378, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1378, file: !57, line: 1581, baseType: !1063, size: 32, align: 32, offset: 224)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1378, file: !57, line: 1583, baseType: !973, size: 64, align: 64, offset: 256)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1378, file: !57, line: 1591, baseType: !1526, size: 64, align: 64, offset: 320)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64, align: 64)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1437, line: 129, size: 1664, align: 64, elements: !1528)
!1528 = !{!1529, !1530, !1531, !1532, !1533, !1551, !1552, !1558, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1527, file: !1437, line: 136, baseType: !982, size: 32, align: 32)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1527, file: !1437, line: 151, baseType: !982, size: 32, align: 32, offset: 32)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1527, file: !1437, line: 157, baseType: !982, size: 32, align: 32, offset: 64)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1527, file: !1437, line: 159, baseType: !1200, size: 64, align: 64, offset: 128)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1527, file: !1437, line: 161, baseType: !1534, size: 64, align: 64, offset: 192)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1437, line: 117, baseType: !1536)
!1536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1437, line: 100, size: 832, align: 64, elements: !1537)
!1537 = !{!1538, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1536, file: !1437, line: 105, baseType: !1539, size: 256, align: 64)
!1539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1540, size: 256, align: 64, elements: !1478)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1099, line: 238, baseType: !1542)
!1542 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1099, line: 238, flags: DIFlagFwdDecl)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1536, file: !1437, line: 110, baseType: !982, size: 32, align: 32, offset: 256)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1536, file: !1437, line: 111, baseType: !982, size: 32, align: 32, offset: 288)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1536, file: !1437, line: 111, baseType: !982, size: 32, align: 32, offset: 320)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1536, file: !1437, line: 112, baseType: !1209, size: 256, align: 32, offset: 352)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1536, file: !1437, line: 113, baseType: !1481, size: 128, align: 32, offset: 608)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1536, file: !1437, line: 114, baseType: !982, size: 32, align: 32, offset: 736)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1536, file: !1437, line: 115, baseType: !982, size: 32, align: 32, offset: 768)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1536, file: !1437, line: 116, baseType: !982, size: 32, align: 32, offset: 800)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1527, file: !1437, line: 163, baseType: !973, size: 64, align: 64, offset: 256)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1527, file: !1437, line: 165, baseType: !1553, size: 128, align: 64, offset: 320)
!1553 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1437, line: 122, baseType: !1554)
!1554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1437, line: 119, size: 128, align: 64, elements: !1555)
!1555 = !{!1556, !1557}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1554, file: !1437, line: 120, baseType: !1092, size: 64, align: 64)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1554, file: !1437, line: 121, baseType: !1200, size: 64, align: 64, offset: 64)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1527, file: !1437, line: 166, baseType: !1559, size: 128, align: 64, offset: 448)
!1559 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1437, line: 127, baseType: !1560)
!1560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1437, line: 124, size: 128, align: 64, elements: !1561)
!1561 = !{!1562, !1635}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1560, file: !1437, line: 125, baseType: !1563, size: 64, align: 64)
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1566)
!1566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1567)
!1567 = !{!1568, !1569, !1593, !1597, !1598, !1632, !1633, !1634}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1566, file: !57, line: 5751, baseType: !961, size: 64, align: 64)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1566, file: !57, line: 5756, baseType: !1570, size: 64, align: 64, offset: 64)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1572)
!1572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1573)
!1573 = !{!1574, !1575, !1578, !1579, !1580, !1584, !1588, !1592}
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1572, file: !57, line: 5797, baseType: !967, size: 64, align: 64)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1572, file: !57, line: 5804, baseType: !1576, size: 64, align: 64, offset: 64)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1572, file: !57, line: 5815, baseType: !961, size: 64, align: 64, offset: 128)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1572, file: !57, line: 5825, baseType: !982, size: 32, align: 32, offset: 192)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1572, file: !57, line: 5826, baseType: !1581, size: 64, align: 64, offset: 256)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64, align: 64)
!1582 = !DISubroutineType(types: !1583)
!1583 = !{!982, !1564}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1572, file: !57, line: 5827, baseType: !1585, size: 64, align: 64, offset: 320)
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1586 = !DISubroutineType(types: !1587)
!1587 = !{!982, !1564, !1092}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1572, file: !57, line: 5828, baseType: !1589, size: 64, align: 64, offset: 384)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DISubroutineType(types: !1591)
!1591 = !{null, !1564}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1572, file: !57, line: 5829, baseType: !1589, size: 64, align: 64, offset: 448)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1566, file: !57, line: 5762, baseType: !1594, size: 64, align: 64, offset: 128)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1596)
!1596 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1566, file: !57, line: 5768, baseType: !973, size: 64, align: 64, offset: 192)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1566, file: !57, line: 5775, baseType: !1599, size: 64, align: 64, offset: 256)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1601)
!1601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1602)
!1602 = !{!1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631}
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1601, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1601, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1601, file: !57, line: 3948, baseType: !1456, size: 32, align: 32, offset: 64)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1601, file: !57, line: 3958, baseType: !1107, size: 64, align: 64, offset: 128)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1601, file: !57, line: 3962, baseType: !982, size: 32, align: 32, offset: 192)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1601, file: !57, line: 3968, baseType: !982, size: 32, align: 32, offset: 224)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1601, file: !57, line: 3973, baseType: !988, size: 64, align: 64, offset: 256)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1601, file: !57, line: 3986, baseType: !982, size: 32, align: 32, offset: 320)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1601, file: !57, line: 3999, baseType: !982, size: 32, align: 32, offset: 352)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1601, file: !57, line: 4004, baseType: !982, size: 32, align: 32, offset: 384)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1601, file: !57, line: 4005, baseType: !982, size: 32, align: 32, offset: 416)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1601, file: !57, line: 4010, baseType: !982, size: 32, align: 32, offset: 448)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1601, file: !57, line: 4011, baseType: !982, size: 32, align: 32, offset: 480)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1601, file: !57, line: 4020, baseType: !994, size: 64, align: 32, offset: 512)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1601, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1601, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1601, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1601, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1601, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1601, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1601, file: !57, line: 4039, baseType: !982, size: 32, align: 32, offset: 768)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1601, file: !57, line: 4046, baseType: !1228, size: 64, align: 64, offset: 832)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1601, file: !57, line: 4050, baseType: !982, size: 32, align: 32, offset: 896)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1601, file: !57, line: 4054, baseType: !982, size: 32, align: 32, offset: 928)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1601, file: !57, line: 4061, baseType: !982, size: 32, align: 32, offset: 960)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1601, file: !57, line: 4065, baseType: !982, size: 32, align: 32, offset: 992)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1601, file: !57, line: 4073, baseType: !982, size: 32, align: 32, offset: 1024)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1601, file: !57, line: 4080, baseType: !982, size: 32, align: 32, offset: 1056)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1601, file: !57, line: 4084, baseType: !982, size: 32, align: 32, offset: 1088)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1566, file: !57, line: 5781, baseType: !1599, size: 64, align: 64, offset: 320)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1566, file: !57, line: 5787, baseType: !994, size: 64, align: 32, offset: 384)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1566, file: !57, line: 5793, baseType: !994, size: 64, align: 32, offset: 448)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1560, file: !1437, line: 126, baseType: !982, size: 32, align: 32, offset: 64)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1527, file: !1437, line: 172, baseType: !1092, size: 64, align: 64, offset: 576)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1527, file: !1437, line: 177, baseType: !1107, size: 64, align: 64, offset: 640)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1527, file: !1437, line: 178, baseType: !1063, size: 32, align: 32, offset: 704)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1527, file: !1437, line: 180, baseType: !973, size: 64, align: 64, offset: 768)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1527, file: !1437, line: 185, baseType: !982, size: 32, align: 32, offset: 832)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1527, file: !1437, line: 190, baseType: !973, size: 64, align: 64, offset: 896)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1527, file: !1437, line: 195, baseType: !982, size: 32, align: 32, offset: 960)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1527, file: !1437, line: 200, baseType: !1092, size: 64, align: 64, offset: 1024)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1527, file: !1437, line: 201, baseType: !982, size: 32, align: 32, offset: 1088)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1527, file: !1437, line: 202, baseType: !1200, size: 64, align: 64, offset: 1152)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1527, file: !1437, line: 203, baseType: !982, size: 32, align: 32, offset: 1216)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1527, file: !1437, line: 205, baseType: !982, size: 32, align: 32, offset: 1248)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1527, file: !1437, line: 206, baseType: !982, size: 32, align: 32, offset: 1280)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1527, file: !1437, line: 209, baseType: !1192, size: 64, align: 64, offset: 1344)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1527, file: !1437, line: 212, baseType: !1192, size: 64, align: 64, offset: 1408)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1527, file: !1437, line: 213, baseType: !1200, size: 64, align: 64, offset: 1472)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1527, file: !1437, line: 215, baseType: !982, size: 32, align: 32, offset: 1536)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1527, file: !1437, line: 217, baseType: !982, size: 32, align: 32, offset: 1568)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1527, file: !1437, line: 220, baseType: !982, size: 32, align: 32, offset: 1600)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1378, file: !57, line: 1598, baseType: !973, size: 64, align: 64, offset: 384)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1378, file: !57, line: 1606, baseType: !988, size: 64, align: 64, offset: 448)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1378, file: !57, line: 1614, baseType: !982, size: 32, align: 32, offset: 512)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1378, file: !57, line: 1622, baseType: !982, size: 32, align: 32, offset: 544)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1378, file: !57, line: 1628, baseType: !982, size: 32, align: 32, offset: 576)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1378, file: !57, line: 1636, baseType: !982, size: 32, align: 32, offset: 608)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1378, file: !57, line: 1643, baseType: !982, size: 32, align: 32, offset: 640)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1378, file: !57, line: 1657, baseType: !1107, size: 64, align: 64, offset: 704)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1378, file: !57, line: 1658, baseType: !982, size: 32, align: 32, offset: 768)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1378, file: !57, line: 1679, baseType: !994, size: 64, align: 32, offset: 800)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1378, file: !57, line: 1688, baseType: !982, size: 32, align: 32, offset: 864)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1378, file: !57, line: 1712, baseType: !982, size: 32, align: 32, offset: 896)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1378, file: !57, line: 1729, baseType: !982, size: 32, align: 32, offset: 928)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1378, file: !57, line: 1729, baseType: !982, size: 32, align: 32, offset: 960)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1378, file: !57, line: 1744, baseType: !982, size: 32, align: 32, offset: 992)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1378, file: !57, line: 1744, baseType: !982, size: 32, align: 32, offset: 1024)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1378, file: !57, line: 1751, baseType: !982, size: 32, align: 32, offset: 1056)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1378, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1378, file: !57, line: 1791, baseType: !1674, size: 64, align: 64, offset: 1152)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DISubroutineType(types: !1676)
!1676 = !{null, !1677, !1491, !1493, !982, !982, !982}
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1378, file: !57, line: 1808, baseType: !1679, size: 64, align: 64, offset: 1216)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DISubroutineType(types: !1681)
!1681 = !{!516, !1677, !1397}
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1378, file: !57, line: 1816, baseType: !982, size: 32, align: 32, offset: 1280)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1378, file: !57, line: 1825, baseType: !1684, size: 32, align: 32, offset: 1312)
!1684 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1378, file: !57, line: 1830, baseType: !982, size: 32, align: 32, offset: 1344)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1378, file: !57, line: 1838, baseType: !1684, size: 32, align: 32, offset: 1376)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1378, file: !57, line: 1846, baseType: !982, size: 32, align: 32, offset: 1408)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1378, file: !57, line: 1851, baseType: !982, size: 32, align: 32, offset: 1440)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1378, file: !57, line: 1861, baseType: !1684, size: 32, align: 32, offset: 1472)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1378, file: !57, line: 1868, baseType: !1684, size: 32, align: 32, offset: 1504)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1378, file: !57, line: 1875, baseType: !1684, size: 32, align: 32, offset: 1536)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1378, file: !57, line: 1882, baseType: !1684, size: 32, align: 32, offset: 1568)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1378, file: !57, line: 1889, baseType: !1684, size: 32, align: 32, offset: 1600)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1378, file: !57, line: 1896, baseType: !1684, size: 32, align: 32, offset: 1632)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1378, file: !57, line: 1903, baseType: !1684, size: 32, align: 32, offset: 1664)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1378, file: !57, line: 1910, baseType: !982, size: 32, align: 32, offset: 1696)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1378, file: !57, line: 1915, baseType: !982, size: 32, align: 32, offset: 1728)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1378, file: !57, line: 1926, baseType: !1493, size: 64, align: 64, offset: 1792)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1378, file: !57, line: 1935, baseType: !994, size: 64, align: 32, offset: 1856)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1378, file: !57, line: 1942, baseType: !982, size: 32, align: 32, offset: 1920)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1378, file: !57, line: 1948, baseType: !982, size: 32, align: 32, offset: 1952)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1378, file: !57, line: 1954, baseType: !982, size: 32, align: 32, offset: 1984)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1378, file: !57, line: 1960, baseType: !982, size: 32, align: 32, offset: 2016)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1378, file: !57, line: 1984, baseType: !982, size: 32, align: 32, offset: 2048)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1378, file: !57, line: 1991, baseType: !982, size: 32, align: 32, offset: 2080)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1378, file: !57, line: 1996, baseType: !982, size: 32, align: 32, offset: 2112)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1378, file: !57, line: 2004, baseType: !982, size: 32, align: 32, offset: 2144)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1378, file: !57, line: 2011, baseType: !982, size: 32, align: 32, offset: 2176)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1378, file: !57, line: 2018, baseType: !982, size: 32, align: 32, offset: 2208)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1378, file: !57, line: 2027, baseType: !982, size: 32, align: 32, offset: 2240)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1378, file: !57, line: 2034, baseType: !982, size: 32, align: 32, offset: 2272)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1378, file: !57, line: 2044, baseType: !982, size: 32, align: 32, offset: 2304)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1378, file: !57, line: 2054, baseType: !1714, size: 64, align: 64, offset: 2368)
!1714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1378, file: !57, line: 2061, baseType: !1714, size: 64, align: 64, offset: 2432)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1378, file: !57, line: 2066, baseType: !982, size: 32, align: 32, offset: 2496)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1378, file: !57, line: 2070, baseType: !982, size: 32, align: 32, offset: 2528)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1378, file: !57, line: 2078, baseType: !982, size: 32, align: 32, offset: 2560)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1378, file: !57, line: 2085, baseType: !982, size: 32, align: 32, offset: 2592)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1378, file: !57, line: 2092, baseType: !982, size: 32, align: 32, offset: 2624)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1378, file: !57, line: 2099, baseType: !982, size: 32, align: 32, offset: 2656)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1378, file: !57, line: 2106, baseType: !982, size: 32, align: 32, offset: 2688)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1378, file: !57, line: 2113, baseType: !982, size: 32, align: 32, offset: 2720)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1378, file: !57, line: 2120, baseType: !982, size: 32, align: 32, offset: 2752)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1378, file: !57, line: 2125, baseType: !982, size: 32, align: 32, offset: 2784)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1378, file: !57, line: 2133, baseType: !982, size: 32, align: 32, offset: 2816)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1378, file: !57, line: 2140, baseType: !982, size: 32, align: 32, offset: 2848)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1378, file: !57, line: 2145, baseType: !982, size: 32, align: 32, offset: 2880)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1378, file: !57, line: 2153, baseType: !982, size: 32, align: 32, offset: 2912)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1378, file: !57, line: 2158, baseType: !982, size: 32, align: 32, offset: 2944)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1378, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
