; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]fftools--ffprobe.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]fftools--ffprobe.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.OptionDef = type { i8*, i32, %union.anon, i8*, i8* }
%union.anon = type { i8* }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.AVHashContext = type opaque
%struct.section = type { i32, i8*, i32, [11 x i32], i8*, i8*, %struct.AVDictionary*, i32 }
%struct.AVDictionary = type opaque
%struct.Writer = type { %struct.AVClass*, i32, i8*, i32 (%struct.WriterContext*)*, void (%struct.WriterContext*)*, void (%struct.WriterContext*)*, void (%struct.WriterContext*)*, void (%struct.WriterContext*, i8*, i64)*, void (%struct.WriterContext*, %struct.AVRational*, i8*)*, void (%struct.WriterContext*, i8*, i8*)*, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon.0, double, double, i32, i8* }
%union.anon.0 = type { i64 }

!953 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!954 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!955 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !93, line: 798, size: 32, align: 32, elements: !956)
!956 = !{!957, !958, !959, !960, !961, !962, !963}
!957 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!958 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!959 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!960 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!961 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!962 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!963 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!964 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !965, line: 782, size: 32, align: 32, elements: !966)
!965 = !DIFile(filename: "./libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!966 = !{!967, !968, !969, !970, !971, !972}
!967 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!968 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!969 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!970 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!971 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!972 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!973 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !93, line: 5085, size: 32, align: 32, elements: !974)
!974 = !{!975, !976, !977, !978}
!975 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!976 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!977 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!978 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!979 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !965, line: 1315, size: 32, align: 32, elements: !980)
!980 = !{!981, !982, !983}
!981 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!982 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!983 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!984 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 421, size: 32, align: 32, elements: !985)
!985 = !{!986, !987, !988, !989}
!986 = !DIEnumerator(name: "WRITER_STRING_VALIDATION_FAIL", value: 0)
!987 = !DIEnumerator(name: "WRITER_STRING_VALIDATION_REPLACE", value: 1)
!988 = !DIEnumerator(name: "WRITER_STRING_VALIDATION_IGNORE", value: 2)
!989 = !DIEnumerator(name: "WRITER_STRING_VALIDATION_NB", value: 3)
!990 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStereo3DType", file: !991, line: 51, size: 32, align: 32, elements: !992)
!991 = !DIFile(filename: "./libavutil/stereo3d.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!992 = !{!993, !994, !995, !996, !997, !998, !999, !1000}
!993 = !DIEnumerator(name: "AV_STEREO3D_2D", value: 0)
!994 = !DIEnumerator(name: "AV_STEREO3D_SIDEBYSIDE", value: 1)
!995 = !DIEnumerator(name: "AV_STEREO3D_TOPBOTTOM", value: 2)
!996 = !DIEnumerator(name: "AV_STEREO3D_FRAMESEQUENCE", value: 3)
!997 = !DIEnumerator(name: "AV_STEREO3D_CHECKERBOARD", value: 4)
!998 = !DIEnumerator(name: "AV_STEREO3D_SIDEBYSIDE_QUINCUNX", value: 5)
!999 = !DIEnumerator(name: "AV_STEREO3D_LINES", value: 6)
!1000 = !DIEnumerator(name: "AV_STEREO3D_COLUMNS", value: 7)
!1001 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStereo3DView", file: !991, line: 147, size: 32, align: 32, elements: !1002)
!1002 = !{!1003, !1004, !1005}
!1003 = !DIEnumerator(name: "AV_STEREO3D_VIEW_PACKED", value: 0)
!1004 = !DIEnumerator(name: "AV_STEREO3D_VIEW_LEFT", value: 1)
!1005 = !DIEnumerator(name: "AV_STEREO3D_VIEW_RIGHT", value: 2)
!1006 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSphericalProjection", file: !1007, line: 51, size: 32, align: 32, elements: !1008)
!1007 = !DIFile(filename: "./libavutil/spherical.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1008 = !{!1009, !1010, !1011}
!1009 = !DIEnumerator(name: "AV_SPHERICAL_EQUIRECTANGULAR", value: 0)
!1010 = !DIEnumerator(name: "AV_SPHERICAL_CUBEMAP", value: 1)
!1011 = !DIEnumerator(name: "AV_SPHERICAL_EQUIRECTANGULAR_TILE", value: 2)
!1012 = !{!1013, !1014, !1016, !1019, !1020, !1021, !1101, !1102, !1105, !1104, !1106, !1041, !1109, !1110, !1112, !1119, !1133, !1139, !1141, !1158, !1164, !1171}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !1017, line: 119, baseType: !1018)
!1017 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1018 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1017, line: 40, baseType: !1018)
!1020 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !1025)
!1025 = !{!1026, !1029, !1033, !1060, !1061, !1062, !1063, !1067, !1073, !1075, !1079}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1024, file: !26, line: 72, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1024, file: !26, line: 78, baseType: !1030, size: 64, align: 64, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!1027, !1013}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1024, file: !26, line: 85, baseType: !1034, size: 64, align: 64, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !1037)
!1037 = !{!1038, !1039, !1040, !1042, !1043, !1056, !1057, !1058, !1059}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1036, file: !4, line: 247, baseType: !1027, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1036, file: !4, line: 253, baseType: !1027, size: 64, align: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1036, file: !4, line: 259, baseType: !1041, size: 32, align: 32, offset: 128)
!1041 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1036, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1036, file: !4, line: 271, baseType: !1044, size: 64, align: 64, offset: 192)
!1044 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1036, file: !4, line: 265, size: 64, align: 64, elements: !1045)
!1045 = !{!1046, !1047, !1048, !1049}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1044, file: !4, line: 266, baseType: !1019, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1044, file: !4, line: 267, baseType: !1020, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1044, file: !4, line: 268, baseType: !1027, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1044, file: !4, line: 270, baseType: !1050, size: 64, align: 32)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1051, line: 61, baseType: !1052)
!1051 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1051, line: 58, size: 64, align: 32, elements: !1053)
!1053 = !{!1054, !1055}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1052, file: !1051, line: 59, baseType: !1041, size: 32, align: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1052, file: !1051, line: 60, baseType: !1041, size: 32, align: 32, offset: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1036, file: !4, line: 272, baseType: !1020, size: 64, align: 64, offset: 256)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1036, file: !4, line: 273, baseType: !1020, size: 64, align: 64, offset: 320)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1036, file: !4, line: 275, baseType: !1041, size: 32, align: 32, offset: 384)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1036, file: !4, line: 300, baseType: !1027, size: 64, align: 64, offset: 448)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1024, file: !26, line: 93, baseType: !1041, size: 32, align: 32, offset: 192)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1024, file: !26, line: 99, baseType: !1041, size: 32, align: 32, offset: 224)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1024, file: !26, line: 108, baseType: !1041, size: 32, align: 32, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1024, file: !26, line: 113, baseType: !1064, size: 64, align: 64, offset: 320)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!1013, !1013, !1013}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1024, file: !26, line: 123, baseType: !1068, size: 64, align: 64, offset: 384)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!1071, !1071}
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1024)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1024, file: !26, line: 130, baseType: !1074, size: 32, align: 32, offset: 448)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1024, file: !26, line: 136, baseType: !1076, size: 64, align: 64, offset: 512)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!1074, !1013}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1024, file: !26, line: 142, baseType: !1080, size: 64, align: 64, offset: 576)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!1041, !1083, !1013, !1027, !1041}
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1086)
!1086 = !{!1087, !1099, !1100}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1085, file: !4, line: 360, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1091)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1092)
!1092 = !{!1093, !1094, !1095, !1096, !1097, !1098}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1091, file: !4, line: 307, baseType: !1027, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1091, file: !4, line: 313, baseType: !1020, size: 64, align: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1091, file: !4, line: 313, baseType: !1020, size: 64, align: 64, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1091, file: !4, line: 318, baseType: !1020, size: 64, align: 64, offset: 192)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1091, file: !4, line: 318, baseType: !1020, size: 64, align: 64, offset: 256)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1091, file: !4, line: 323, baseType: !1041, size: 32, align: 32, offset: 320)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1085, file: !4, line: 364, baseType: !1041, size: 32, align: 32, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1085, file: !4, line: 368, baseType: !1041, size: 32, align: 32, offset: 96)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1017, line: 48, baseType: !1104)
!1104 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1105 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1109 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !1017, line: 38, baseType: !1041)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStereo3D", file: !991, line: 191, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStereo3D", file: !991, line: 176, size: 96, align: 32, elements: !1115)
!1115 = !{!1116, !1117, !1118}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1114, file: !991, line: 180, baseType: !990, size: 32, align: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1114, file: !991, line: 185, baseType: !1041, size: 32, align: 32, offset: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1114, file: !991, line: 190, baseType: !1001, size: 32, align: 32, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSphericalMapping", file: !1007, line: 183, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSphericalMapping", file: !1007, line: 82, size: 288, align: 32, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1126, !1127, !1129, !1130, !1131, !1132}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !1121, file: !1007, line: 86, baseType: !1006, size: 32, align: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "yaw", scope: !1121, file: !1007, line: 126, baseType: !1111, size: 32, align: 32, offset: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !1121, file: !1007, line: 127, baseType: !1111, size: 32, align: 32, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !1121, file: !1007, line: 128, baseType: !1111, size: 32, align: 32, offset: 96)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "bound_left", scope: !1121, file: !1007, line: 167, baseType: !1128, size: 32, align: 32, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1017, line: 51, baseType: !1105)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "bound_top", scope: !1121, file: !1007, line: 168, baseType: !1128, size: 32, align: 32, offset: 160)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "bound_right", scope: !1121, file: !1007, line: 169, baseType: !1128, size: 32, align: 32, offset: 192)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "bound_bottom", scope: !1121, file: !1007, line: 170, baseType: !1128, size: 32, align: 32, offset: 224)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !1121, file: !1007, line: 182, baseType: !1128, size: 32, align: 32, offset: 256)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1136, line: 221, size: 32, align: 8, elements: !1137)
!1136 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1137 = !{!1138}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1135, file: !1136, line: 221, baseType: !1128, size: 32, align: 32)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1103)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVMasteringDisplayMetadata", file: !1143, line: 69, baseType: !1144)
!1143 = !DIFile(filename: "./libavutil/mastering_display_metadata.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVMasteringDisplayMetadata", file: !1143, line: 38, size: 704, align: 32, elements: !1145)
!1145 = !{!1146, !1151, !1154, !1155, !1156, !1157}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "display_primaries", scope: !1144, file: !1143, line: 42, baseType: !1147, size: 384, align: 32)
!1147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1050, size: 384, align: 32, elements: !1148)
!1148 = !{!1149, !1150}
!1149 = !DISubrange(count: 3)
!1150 = !DISubrange(count: 2)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !1144, file: !1143, line: 47, baseType: !1152, size: 128, align: 32, offset: 384)
!1152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1050, size: 128, align: 32, elements: !1153)
!1153 = !{!1150}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "min_luminance", scope: !1144, file: !1143, line: 52, baseType: !1050, size: 64, align: 32, offset: 512)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "max_luminance", scope: !1144, file: !1143, line: 57, baseType: !1050, size: 64, align: 32, offset: 576)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "has_primaries", scope: !1144, file: !1143, line: 62, baseType: !1041, size: 32, align: 32, offset: 640)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "has_luminance", scope: !1144, file: !1143, line: 67, baseType: !1041, size: 32, align: 32, offset: 672)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVContentLightMetadata", file: !1143, line: 108, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVContentLightMetadata", file: !1143, line: 98, size: 64, align: 32, elements: !1161)
!1161 = !{!1162, !1163}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "MaxCLL", scope: !1160, file: !1143, line: 102, baseType: !1105, size: 32, align: 32)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "MaxFALL", scope: !1160, file: !1143, line: 107, baseType: !1105, size: 32, align: 32, offset: 32)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1166)
!1166 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !1136, line: 222, size: 16, align: 8, elements: !1167)
!1167 = !{!1168}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1166, file: !1136, line: 222, baseType: !1169, size: 16, align: 16)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1017, line: 49, baseType: !1170)
!1170 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1172 = !{!1173, !1177, !1179, !1180, !1181, !1194, !1217, !1218, !1222, !1250, !1254, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2366, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2402, !2494, !2496, !2497, !2498, !2502, !2503, !2504, !2508, !2509, !2510, !2511, !2512, !2513, !2514, !2515, !2516, !2519, !2520, !2521, !2522, !2527, !2528, !2529, !2531, !2535, !2536, !2537, !2538, !2539, !2540, !2541, !2543, !2544, !2545, !2547, !2549, !2560, !2562}
!1173 = distinct !DIGlobalVariable(name: "program_name", scope: !0, file: !47, line: 81, type: !1174, isLocal: false, isDefinition: true, variable: [8 x i8]* @program_name)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 64, align: 8, elements: !1175)
!1175 = !{!1176}
!1176 = !DISubrange(count: 8)
!1177 = distinct !DIGlobalVariable(name: "program_birth_year", scope: !0, file: !47, line: 82, type: !1178, isLocal: false, isDefinition: true, variable: i32* @program_birth_year)
!1178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1041)
!1179 = distinct !DIGlobalVariable(name: "print_format", scope: !0, file: !47, line: 118, type: !1014, isLocal: true, isDefinition: true, variable: i8** @print_format)
!1180 = distinct !DIGlobalVariable(name: "show_data_hash", scope: !0, file: !47, line: 120, type: !1014, isLocal: true, isDefinition: true, variable: i8** @show_data_hash)
!1181 = distinct !DIGlobalVariable(name: "read_intervals", scope: !0, file: !47, line: 130, type: !1182, isLocal: true, isDefinition: true, variable: %struct.ReadInterval** @read_intervals)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReadInterval", file: !47, line: 128, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReadInterval", file: !47, line: 122, size: 384, align: 64, elements: !1185)
!1185 = !{!1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1184, file: !47, line: 123, baseType: !1041, size: 32, align: 32)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1184, file: !47, line: 124, baseType: !1019, size: 64, align: 64, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1184, file: !47, line: 124, baseType: !1019, size: 64, align: 64, offset: 128)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "has_start", scope: !1184, file: !47, line: 125, baseType: !1041, size: 32, align: 32, offset: 192)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "has_end", scope: !1184, file: !47, line: 125, baseType: !1041, size: 32, align: 32, offset: 224)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "start_is_offset", scope: !1184, file: !47, line: 126, baseType: !1041, size: 32, align: 32, offset: 256)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "end_is_offset", scope: !1184, file: !47, line: 126, baseType: !1041, size: 32, align: 32, offset: 288)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "duration_frames", scope: !1184, file: !47, line: 127, baseType: !1041, size: 32, align: 32, offset: 320)
!1194 = distinct !DIGlobalVariable(name: "options", scope: !0, file: !47, line: 249, type: !1195, isLocal: true, isDefinition: true, variable: %struct.OptionDef** @options)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1197)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "OptionDef", file: !1198, line: 190, baseType: !1199)
!1198 = !DIFile(filename: "fftools/cmdutils.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OptionDef", file: !1198, line: 158, size: 320, align: 64, elements: !1200)
!1200 = !{!1201, !1202, !1203, !1215, !1216}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1199, file: !1198, line: 159, baseType: !1027, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1199, file: !1198, line: 160, baseType: !1041, size: 32, align: 32, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1199, file: !1198, line: 187, baseType: !1204, size: 64, align: 64, offset: 128)
!1204 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1199, file: !1198, line: 183, size: 64, align: 64, elements: !1205)
!1205 = !{!1206, !1207, !1211}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ptr", scope: !1204, file: !1198, line: 184, baseType: !1013, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "func_arg", scope: !1204, file: !1198, line: 185, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!1041, !1013, !1027, !1027}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !1204, file: !1198, line: 186, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1213, line: 216, baseType: !1214)
!1213 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1214 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1199, file: !1198, line: 188, baseType: !1027, size: 64, align: 64, offset: 192)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "argname", scope: !1199, file: !1198, line: 189, baseType: !1027, size: 64, align: 64, offset: 256)
!1217 = distinct !DIGlobalVariable(name: "input_filename", scope: !0, file: !47, line: 252, type: !1027, isLocal: true, isDefinition: true, variable: i8** @input_filename)
!1218 = distinct !DIGlobalVariable(name: "hash", scope: !0, file: !47, line: 255, type: !1219, isLocal: true, isDefinition: true, variable: %struct.AVHashContext** @hash)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVHashContext", file: !1221, line: 116, flags: DIFlagFwdDecl)
!1221 = !DIFile(filename: "./libavutil/hash.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1222 = distinct !DIGlobalVariable(name: "log_mutex", scope: !0, file: !47, line: 282, type: !1223, isLocal: false, isDefinition: true, variable: %union.pthread_mutex_t* @log_mutex)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !1224, line: 128, baseType: !1225)
!1224 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1225 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !1224, line: 90, size: 320, align: 64, elements: !1226)
!1226 = !{!1227, !1245, !1249}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !1225, file: !1224, line: 125, baseType: !1228, size: 320, align: 64)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !1224, line: 92, size: 320, align: 64, elements: !1229)
!1229 = !{!1230, !1231, !1232, !1233, !1234, !1235, !1237, !1238}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !1228, file: !1224, line: 94, baseType: !1041, size: 32, align: 32)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1228, file: !1224, line: 95, baseType: !1105, size: 32, align: 32, offset: 32)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !1228, file: !1224, line: 96, baseType: !1041, size: 32, align: 32, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !1228, file: !1224, line: 98, baseType: !1105, size: 32, align: 32, offset: 96)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !1228, file: !1224, line: 102, baseType: !1041, size: 32, align: 32, offset: 128)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !1228, file: !1224, line: 104, baseType: !1236, size: 16, align: 16, offset: 160)
!1236 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !1228, file: !1224, line: 105, baseType: !1236, size: 16, align: 16, offset: 176)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !1228, file: !1224, line: 106, baseType: !1239, size: 128, align: 64, offset: 192)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !1224, line: 79, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !1224, line: 75, size: 128, align: 64, elements: !1241)
!1241 = !{!1242, !1244}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !1240, file: !1224, line: 77, baseType: !1243, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !1240, file: !1224, line: 78, baseType: !1243, size: 64, align: 64, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !1225, file: !1224, line: 126, baseType: !1246, size: 320, align: 8)
!1246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1015, size: 320, align: 8, elements: !1247)
!1247 = !{!1248}
!1248 = !DISubrange(count: 40)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !1225, file: !1224, line: 127, baseType: !1018, size: 64, align: 64)
!1250 = distinct !DIGlobalVariable(name: "real_options", scope: !0, file: !47, line: 3485, type: !1251, isLocal: true, isDefinition: true, variable: <{ { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, %struct.OptionDef, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, %struct.OptionDef, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, %struct.OptionDef, %struct.OptionDef, %struct.OptionDef, %struct.OptionDef, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, %struct.OptionDef, %struct.OptionDef, %struct.OptionDef, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, %struct.OptionDef, %struct.OptionDef, %struct.OptionDef, %struct.OptionDef, %struct.OptionDef, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, %struct.OptionDef, %struct.OptionDef, %struct.OptionDef, %struct.OptionDef, %struct.OptionDef, %struct.OptionDef, %struct.OptionDef, %struct.OptionDef, %struct.OptionDef, %struct.OptionDef, %struct.OptionDef, %struct.OptionDef, %struct.OptionDef, %struct.OptionDef, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, { i8*, i32, { i32 (i8*, i8*, i8*)* }, i8*, i8* }, %struct.OptionDef, %struct.OptionDef }>* @real_options)
!1251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1196, size: 20800, align: 64, elements: !1252)
!1252 = !{!1253}
!1253 = !DISubrange(count: 65)
!1254 = distinct !DIGlobalVariable(name: "iformat", scope: !0, file: !47, line: 253, type: !1255, isLocal: true, isDefinition: true, variable: %struct.AVInputFormat** @iformat)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !965, line: 777, baseType: !1257)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !965, line: 633, size: 1344, align: 64, elements: !1258)
!1258 = !{!1259, !1260, !1261, !1262, !1263, !1269, !1270, !1271, !1273, !1274, !1275, !1288, !2323, !2324, !2325, !2329, !2333, !2334, !2335, !2339, !2340, !2341}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1257, file: !965, line: 638, baseType: !1027, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1257, file: !965, line: 645, baseType: !1027, size: 64, align: 64, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1257, file: !965, line: 652, baseType: !1041, size: 32, align: 32, offset: 128)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1257, file: !965, line: 659, baseType: !1027, size: 64, align: 64, offset: 192)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1257, file: !965, line: 661, baseType: !1264, size: 64, align: 64, offset: 256)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1266)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1268)
!1268 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !965, line: 443, flags: DIFlagFwdDecl)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1257, file: !965, line: 663, baseType: !1107, size: 64, align: 64, offset: 320)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1257, file: !965, line: 670, baseType: !1027, size: 64, align: 64, offset: 384)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1257, file: !965, line: 679, baseType: !1272, size: 64, align: 64, offset: 448)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1257, file: !965, line: 684, baseType: !1041, size: 32, align: 32, offset: 512)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1257, file: !965, line: 689, baseType: !1041, size: 32, align: 32, offset: 544)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1257, file: !965, line: 696, baseType: !1276, size: 64, align: 64, offset: 576)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{!1041, !1279}
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !965, line: 453, baseType: !1281)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !965, line: 448, size: 256, align: 64, elements: !1282)
!1282 = !{!1283, !1284, !1286, !1287}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1281, file: !965, line: 449, baseType: !1027, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1281, file: !965, line: 450, baseType: !1285, size: 64, align: 64, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1281, file: !965, line: 451, baseType: !1041, size: 32, align: 32, offset: 128)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1281, file: !965, line: 452, baseType: !1027, size: 64, align: 64, offset: 192)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1257, file: !965, line: 703, baseType: !1289, size: 64, align: 64, offset: 640)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!1041, !1292}
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !965, line: 1337, size: 11968, align: 64, elements: !1294)
!1294 = !{!1295, !1296, !1297, !1509, !1510, !1573, !1574, !1575, !2200, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2254, !2255, !2256, !2257, !2258, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2289, !2290, !2293, !2294, !2295, !2296, !2297, !2298, !2300, !2301, !2302, !2303, !2311, !2312, !2316, !2320, !2321, !2322}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1293, file: !965, line: 1342, baseType: !1107, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1293, file: !965, line: 1349, baseType: !1272, size: 64, align: 64, offset: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1293, file: !965, line: 1356, baseType: !1298, size: 64, align: 64, offset: 128)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !965, line: 497, size: 1600, align: 64, elements: !1300)
!1300 = !{!1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1352, !1353, !1357, !1361, !1365, !1369, !1456, !1474, !1496, !1497, !1498, !1499, !1503}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1299, file: !965, line: 498, baseType: !1027, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1299, file: !965, line: 504, baseType: !1027, size: 64, align: 64, offset: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1299, file: !965, line: 505, baseType: !1027, size: 64, align: 64, offset: 128)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1299, file: !965, line: 506, baseType: !1027, size: 64, align: 64, offset: 192)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1299, file: !965, line: 508, baseType: !92, size: 32, align: 32, offset: 256)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1299, file: !965, line: 509, baseType: !92, size: 32, align: 32, offset: 288)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1299, file: !965, line: 510, baseType: !92, size: 32, align: 32, offset: 320)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1299, file: !965, line: 517, baseType: !1041, size: 32, align: 32, offset: 352)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1299, file: !965, line: 523, baseType: !1264, size: 64, align: 64, offset: 384)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1299, file: !965, line: 526, baseType: !1107, size: 64, align: 64, offset: 448)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1299, file: !965, line: 535, baseType: !1298, size: 64, align: 64, offset: 512)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1299, file: !965, line: 539, baseType: !1041, size: 32, align: 32, offset: 576)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1299, file: !965, line: 541, baseType: !1289, size: 64, align: 64, offset: 640)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1299, file: !965, line: 549, baseType: !1315, size: 64, align: 64, offset: 704)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{!1041, !1292, !1318}
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !93, line: 1499, baseType: !1320)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !93, line: 1445, size: 704, align: 64, elements: !1321)
!1321 = !{!1322, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1348, !1349, !1350, !1351}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1320, file: !93, line: 1451, baseType: !1323, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1325, line: 94, baseType: !1326)
!1325 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1325, line: 81, size: 192, align: 64, elements: !1327)
!1327 = !{!1328, !1332, !1333}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1326, file: !1325, line: 82, baseType: !1329, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1325, line: 73, baseType: !1331)
!1331 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1325, line: 73, flags: DIFlagFwdDecl)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1326, file: !1325, line: 89, baseType: !1102, size: 64, align: 64, offset: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1326, file: !1325, line: 93, baseType: !1041, size: 32, align: 32, offset: 128)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1320, file: !93, line: 1461, baseType: !1019, size: 64, align: 64, offset: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1320, file: !93, line: 1467, baseType: !1019, size: 64, align: 64, offset: 128)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1320, file: !93, line: 1468, baseType: !1102, size: 64, align: 64, offset: 192)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1320, file: !93, line: 1469, baseType: !1041, size: 32, align: 32, offset: 256)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1320, file: !93, line: 1470, baseType: !1041, size: 32, align: 32, offset: 288)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1320, file: !93, line: 1474, baseType: !1041, size: 32, align: 32, offset: 320)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1320, file: !93, line: 1479, baseType: !1341, size: 64, align: 64, offset: 384)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !93, line: 1415, baseType: !1343)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !93, line: 1411, size: 128, align: 64, elements: !1344)
!1344 = !{!1345, !1346, !1347}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1343, file: !93, line: 1412, baseType: !1102, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1343, file: !93, line: 1413, baseType: !1041, size: 32, align: 32, offset: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1343, file: !93, line: 1414, baseType: !552, size: 32, align: 32, offset: 96)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1320, file: !93, line: 1480, baseType: !1041, size: 32, align: 32, offset: 448)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1320, file: !93, line: 1486, baseType: !1019, size: 64, align: 64, offset: 512)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1320, file: !93, line: 1488, baseType: !1019, size: 64, align: 64, offset: 576)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1320, file: !93, line: 1497, baseType: !1019, size: 64, align: 64, offset: 640)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1299, file: !965, line: 550, baseType: !1289, size: 64, align: 64, offset: 768)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1299, file: !965, line: 554, baseType: !1354, size: 64, align: 64, offset: 832)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = !DISubroutineType(types: !1356)
!1356 = !{!1041, !1292, !1318, !1318, !1041}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1299, file: !965, line: 563, baseType: !1358, size: 64, align: 64, offset: 896)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DISubroutineType(types: !1360)
!1360 = !{!1041, !92, !1041}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1299, file: !965, line: 565, baseType: !1362, size: 64, align: 64, offset: 960)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DISubroutineType(types: !1364)
!1364 = !{null, !1292, !1041, !1171, !1171}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1299, file: !965, line: 570, baseType: !1366, size: 64, align: 64, offset: 1024)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DISubroutineType(types: !1368)
!1368 = !{!1041, !1292, !1041, !1013, !1212}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1299, file: !965, line: 581, baseType: !1370, size: 64, align: 64, offset: 1088)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DISubroutineType(types: !1372)
!1372 = !{!1041, !1292, !1041, !1373, !1105}
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !594, line: 646, baseType: !1376)
!1376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !594, line: 268, size: 4288, align: 64, elements: !1377)
!1377 = !{!1378, !1380, !1382, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1410, !1412, !1413, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1376, file: !594, line: 282, baseType: !1379, size: 512, align: 64)
!1379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1102, size: 512, align: 64, elements: !1175)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1376, file: !594, line: 299, baseType: !1381, size: 256, align: 32, offset: 512)
!1381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1041, size: 256, align: 32, elements: !1175)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1376, file: !594, line: 315, baseType: !1383, size: 64, align: 64, offset: 768)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1376, file: !594, line: 326, baseType: !1041, size: 32, align: 32, offset: 832)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1376, file: !594, line: 326, baseType: !1041, size: 32, align: 32, offset: 864)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1376, file: !594, line: 334, baseType: !1041, size: 32, align: 32, offset: 896)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1376, file: !594, line: 341, baseType: !1041, size: 32, align: 32, offset: 928)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1376, file: !594, line: 346, baseType: !1041, size: 32, align: 32, offset: 960)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1376, file: !594, line: 351, baseType: !582, size: 32, align: 32, offset: 992)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1376, file: !594, line: 356, baseType: !1050, size: 64, align: 32, offset: 1024)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1376, file: !594, line: 361, baseType: !1019, size: 64, align: 64, offset: 1088)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1376, file: !594, line: 369, baseType: !1019, size: 64, align: 64, offset: 1152)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1376, file: !594, line: 377, baseType: !1019, size: 64, align: 64, offset: 1216)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1376, file: !594, line: 382, baseType: !1041, size: 32, align: 32, offset: 1280)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1376, file: !594, line: 386, baseType: !1041, size: 32, align: 32, offset: 1312)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1376, file: !594, line: 391, baseType: !1041, size: 32, align: 32, offset: 1344)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1376, file: !594, line: 396, baseType: !1013, size: 64, align: 64, offset: 1408)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1376, file: !594, line: 403, baseType: !1399, size: 512, align: 64, offset: 1472)
!1399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1400, size: 512, align: 64, elements: !1175)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1017, line: 55, baseType: !1214)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1376, file: !594, line: 410, baseType: !1041, size: 32, align: 32, offset: 1984)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1376, file: !594, line: 415, baseType: !1041, size: 32, align: 32, offset: 2016)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1376, file: !594, line: 420, baseType: !1041, size: 32, align: 32, offset: 2048)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1376, file: !594, line: 425, baseType: !1041, size: 32, align: 32, offset: 2080)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1376, file: !594, line: 435, baseType: !1019, size: 64, align: 64, offset: 2112)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1376, file: !594, line: 440, baseType: !1041, size: 32, align: 32, offset: 2176)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1376, file: !594, line: 445, baseType: !1400, size: 64, align: 64, offset: 2240)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1376, file: !594, line: 459, baseType: !1409, size: 512, align: 64, offset: 2304)
!1409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1323, size: 512, align: 64, elements: !1175)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1376, file: !594, line: 473, baseType: !1411, size: 64, align: 64, offset: 2816)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1376, file: !594, line: 477, baseType: !1041, size: 32, align: 32, offset: 2880)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1376, file: !594, line: 479, baseType: !1414, size: 64, align: 64, offset: 2944)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !594, line: 207, baseType: !1417)
!1417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !594, line: 201, size: 320, align: 64, elements: !1418)
!1418 = !{!1419, !1420, !1421, !1422, !1427}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1417, file: !594, line: 202, baseType: !593, size: 32, align: 32)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1417, file: !594, line: 203, baseType: !1102, size: 64, align: 64, offset: 64)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1417, file: !594, line: 204, baseType: !1041, size: 32, align: 32, offset: 128)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1417, file: !594, line: 205, baseType: !1423, size: 64, align: 64, offset: 192)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1425, line: 86, baseType: !1426)
!1425 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1426 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1425, line: 86, flags: DIFlagFwdDecl)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1417, file: !594, line: 206, baseType: !1323, size: 64, align: 64, offset: 256)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1376, file: !594, line: 480, baseType: !1041, size: 32, align: 32, offset: 3008)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1376, file: !594, line: 505, baseType: !1041, size: 32, align: 32, offset: 3040)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1376, file: !594, line: 512, baseType: !617, size: 32, align: 32, offset: 3072)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1376, file: !594, line: 514, baseType: !624, size: 32, align: 32, offset: 3104)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1376, file: !594, line: 516, baseType: !642, size: 32, align: 32, offset: 3136)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1376, file: !594, line: 523, baseType: !666, size: 32, align: 32, offset: 3168)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1376, file: !594, line: 525, baseType: !685, size: 32, align: 32, offset: 3200)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1376, file: !594, line: 532, baseType: !1019, size: 64, align: 64, offset: 3264)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1376, file: !594, line: 539, baseType: !1019, size: 64, align: 64, offset: 3328)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1376, file: !594, line: 547, baseType: !1019, size: 64, align: 64, offset: 3392)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1376, file: !594, line: 554, baseType: !1423, size: 64, align: 64, offset: 3456)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1376, file: !594, line: 563, baseType: !1041, size: 32, align: 32, offset: 3520)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1376, file: !594, line: 572, baseType: !1041, size: 32, align: 32, offset: 3552)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1376, file: !594, line: 581, baseType: !1041, size: 32, align: 32, offset: 3584)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1376, file: !594, line: 588, baseType: !1443, size: 64, align: 64, offset: 3648)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1017, line: 36, baseType: !1445)
!1445 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1376, file: !594, line: 593, baseType: !1041, size: 32, align: 32, offset: 3712)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1376, file: !594, line: 596, baseType: !1041, size: 32, align: 32, offset: 3744)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1376, file: !594, line: 599, baseType: !1323, size: 64, align: 64, offset: 3776)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1376, file: !594, line: 605, baseType: !1323, size: 64, align: 64, offset: 3840)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1376, file: !594, line: 616, baseType: !1323, size: 64, align: 64, offset: 3904)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1376, file: !594, line: 626, baseType: !1212, size: 64, align: 64, offset: 3968)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1376, file: !594, line: 627, baseType: !1212, size: 64, align: 64, offset: 4032)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1376, file: !594, line: 628, baseType: !1212, size: 64, align: 64, offset: 4096)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1376, file: !594, line: 629, baseType: !1212, size: 64, align: 64, offset: 4160)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1376, file: !594, line: 645, baseType: !1323, size: 64, align: 64, offset: 4224)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1299, file: !965, line: 587, baseType: !1457, size: 64, align: 64, offset: 1152)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!1041, !1292, !1460}
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !1462, line: 460, size: 128, align: 64, elements: !1463)
!1462 = !DIFile(filename: "./libavdevice/avdevice.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1463 = !{!1464, !1472, !1473}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "devices", scope: !1461, file: !1462, line: 461, baseType: !1465, size: 64, align: 64)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDeviceInfo", file: !1462, line: 455, baseType: !1468)
!1468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfo", file: !1462, line: 452, size: 128, align: 64, elements: !1469)
!1469 = !{!1470, !1471}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "device_name", scope: !1468, file: !1462, line: 453, baseType: !1014, size: 64, align: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "device_description", scope: !1468, file: !1462, line: 454, baseType: !1014, size: 64, align: 64, offset: 64)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "nb_devices", scope: !1461, file: !1462, line: 462, baseType: !1041, size: 32, align: 32, offset: 64)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "default_device", scope: !1461, file: !1462, line: 463, baseType: !1041, size: 32, align: 32, offset: 96)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1299, file: !965, line: 592, baseType: !1475, size: 64, align: 64, offset: 1216)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{!1041, !1292, !1478}
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !1462, line: 400, size: 576, align: 64, elements: !1480)
!1480 = !{!1481, !1482, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1479, file: !1462, line: 401, baseType: !1107, size: 64, align: 64)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "device_context", scope: !1479, file: !1462, line: 402, baseType: !1483, size: 64, align: 64, offset: 64)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !965, line: 1947, baseType: !1293)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1479, file: !1462, line: 403, baseType: !92, size: 32, align: 32, offset: 128)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "sample_format", scope: !1479, file: !1462, line: 404, baseType: !695, size: 32, align: 32, offset: 160)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_format", scope: !1479, file: !1462, line: 405, baseType: !712, size: 32, align: 32, offset: 192)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1479, file: !1462, line: 406, baseType: !1041, size: 32, align: 32, offset: 224)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1479, file: !1462, line: 407, baseType: !1041, size: 32, align: 32, offset: 256)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1479, file: !1462, line: 408, baseType: !1019, size: 64, align: 64, offset: 320)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "window_width", scope: !1479, file: !1462, line: 409, baseType: !1041, size: 32, align: 32, offset: 384)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "window_height", scope: !1479, file: !1462, line: 410, baseType: !1041, size: 32, align: 32, offset: 416)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width", scope: !1479, file: !1462, line: 411, baseType: !1041, size: 32, align: 32, offset: 448)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height", scope: !1479, file: !1462, line: 412, baseType: !1041, size: 32, align: 32, offset: 480)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "fps", scope: !1479, file: !1462, line: 413, baseType: !1050, size: 64, align: 32, offset: 512)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1299, file: !965, line: 597, baseType: !1475, size: 64, align: 64, offset: 1280)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1299, file: !965, line: 598, baseType: !92, size: 32, align: 32, offset: 1344)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1299, file: !965, line: 608, baseType: !1289, size: 64, align: 64, offset: 1408)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1299, file: !965, line: 617, baseType: !1500, size: 64, align: 64, offset: 1472)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{null, !1292}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1299, file: !965, line: 623, baseType: !1504, size: 64, align: 64, offset: 1536)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{!1041, !1292, !1507}
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1319)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1293, file: !965, line: 1365, baseType: !1013, size: 64, align: 64, offset: 192)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1293, file: !965, line: 1379, baseType: !1511, size: 64, align: 64, offset: 256)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !912, line: 352, baseType: !1513)
!1513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !912, line: 161, size: 2112, align: 64, elements: !1514)
!1514 = !{!1515, !1516, !1517, !1518, !1519, !1520, !1521, !1525, !1526, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1540, !1541, !1545, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1563, !1564, !1565, !1566, !1570, !1571, !1572}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1513, file: !912, line: 174, baseType: !1107, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1513, file: !912, line: 226, baseType: !1285, size: 64, align: 64, offset: 64)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1513, file: !912, line: 227, baseType: !1041, size: 32, align: 32, offset: 128)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1513, file: !912, line: 228, baseType: !1285, size: 64, align: 64, offset: 192)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1513, file: !912, line: 229, baseType: !1285, size: 64, align: 64, offset: 256)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1513, file: !912, line: 233, baseType: !1013, size: 64, align: 64, offset: 320)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1513, file: !912, line: 235, baseType: !1522, size: 64, align: 64, offset: 384)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!1523 = !DISubroutineType(types: !1524)
!1524 = !{!1041, !1013, !1102, !1041}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1513, file: !912, line: 236, baseType: !1522, size: 64, align: 64, offset: 448)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1513, file: !912, line: 237, baseType: !1527, size: 64, align: 64, offset: 512)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64, align: 64)
!1528 = !DISubroutineType(types: !1529)
!1529 = !{!1019, !1013, !1019, !1041}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1513, file: !912, line: 238, baseType: !1019, size: 64, align: 64, offset: 576)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1513, file: !912, line: 239, baseType: !1041, size: 32, align: 32, offset: 640)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1513, file: !912, line: 240, baseType: !1041, size: 32, align: 32, offset: 672)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1513, file: !912, line: 241, baseType: !1041, size: 32, align: 32, offset: 704)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1513, file: !912, line: 242, baseType: !1214, size: 64, align: 64, offset: 768)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1513, file: !912, line: 243, baseType: !1285, size: 64, align: 64, offset: 832)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1513, file: !912, line: 244, baseType: !1537, size: 64, align: 64, offset: 896)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64, align: 64)
!1538 = !DISubroutineType(types: !1539)
!1539 = !{!1214, !1214, !1139, !1105}
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1513, file: !912, line: 245, baseType: !1041, size: 32, align: 32, offset: 960)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1513, file: !912, line: 249, baseType: !1542, size: 64, align: 64, offset: 1024)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DISubroutineType(types: !1544)
!1544 = !{!1041, !1013, !1041}
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1513, file: !912, line: 255, baseType: !1546, size: 64, align: 64, offset: 1088)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DISubroutineType(types: !1548)
!1548 = !{!1019, !1013, !1041, !1019, !1041}
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1513, file: !912, line: 260, baseType: !1041, size: 32, align: 32, offset: 1152)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1513, file: !912, line: 266, baseType: !1019, size: 64, align: 64, offset: 1216)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1513, file: !912, line: 273, baseType: !1041, size: 32, align: 32, offset: 1280)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1513, file: !912, line: 279, baseType: !1019, size: 64, align: 64, offset: 1344)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1513, file: !912, line: 285, baseType: !1041, size: 32, align: 32, offset: 1408)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1513, file: !912, line: 291, baseType: !1041, size: 32, align: 32, offset: 1440)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1513, file: !912, line: 298, baseType: !1041, size: 32, align: 32, offset: 1472)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1513, file: !912, line: 304, baseType: !1041, size: 32, align: 32, offset: 1504)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1513, file: !912, line: 309, baseType: !1027, size: 64, align: 64, offset: 1536)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1513, file: !912, line: 314, baseType: !1027, size: 64, align: 64, offset: 1600)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1513, file: !912, line: 319, baseType: !1560, size: 64, align: 64, offset: 1664)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DISubroutineType(types: !1562)
!1562 = !{!1041, !1013, !1102, !1041, !911, !1019}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1513, file: !912, line: 326, baseType: !1041, size: 32, align: 32, offset: 1728)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1513, file: !912, line: 331, baseType: !911, size: 32, align: 32, offset: 1760)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1513, file: !912, line: 332, baseType: !1019, size: 64, align: 64, offset: 1792)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1513, file: !912, line: 338, baseType: !1567, size: 64, align: 64, offset: 1856)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DISubroutineType(types: !1569)
!1569 = !{!1041, !1013}
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1513, file: !912, line: 340, baseType: !1019, size: 64, align: 64, offset: 1920)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1513, file: !912, line: 346, baseType: !1285, size: 64, align: 64, offset: 1984)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1513, file: !912, line: 351, baseType: !1041, size: 32, align: 32, offset: 2048)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1293, file: !965, line: 1386, baseType: !1041, size: 32, align: 32, offset: 320)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1293, file: !965, line: 1393, baseType: !1105, size: 32, align: 32, offset: 352)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1293, file: !965, line: 1405, baseType: !1576, size: 64, align: 64, offset: 384)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64, align: 64)
!1578 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !965, line: 1223, baseType: !1579)
!1579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !965, line: 865, size: 6144, align: 64, elements: !1580)
!1580 = !{!1581, !1582, !1583, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2049, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2148, !2154, !2155, !2159, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2191, !2192, !2193, !2194, !2195, !2196}
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1579, file: !965, line: 866, baseType: !1041, size: 32, align: 32)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1579, file: !965, line: 872, baseType: !1041, size: 32, align: 32, offset: 32)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1579, file: !965, line: 878, baseType: !1584, size: 64, align: 64, offset: 64)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !93, line: 3360, baseType: !1586)
!1586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !93, line: 1556, size: 8448, align: 64, elements: !1587)
!1587 = !{!1588, !1589, !1590, !1591, !1724, !1725, !1726, !1727, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1753, !1757, !1758, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1937, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1586, file: !93, line: 1561, baseType: !1107, size: 64, align: 64)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1586, file: !93, line: 1562, baseType: !1041, size: 32, align: 32, offset: 64)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1586, file: !93, line: 1564, baseType: !920, size: 32, align: 32, offset: 96)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1586, file: !93, line: 1565, baseType: !1592, size: 64, align: 64, offset: 128)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1594)
!1594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !93, line: 3468, size: 1984, align: 64, elements: !1595)
!1595 = !{!1596, !1597, !1598, !1599, !1600, !1601, !1604, !1607, !1609, !1612, !1615, !1616, !1617, !1625, !1626, !1627, !1629, !1633, !1639, !1644, !1648, !1649, !1689, !1696, !1700, !1701, !1705, !1709, !1713, !1717, !1718, !1719}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1594, file: !93, line: 3475, baseType: !1027, size: 64, align: 64)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1594, file: !93, line: 3480, baseType: !1027, size: 64, align: 64, offset: 64)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1594, file: !93, line: 3481, baseType: !920, size: 32, align: 32, offset: 128)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1594, file: !93, line: 3482, baseType: !92, size: 32, align: 32, offset: 160)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1594, file: !93, line: 3487, baseType: !1041, size: 32, align: 32, offset: 192)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1594, file: !93, line: 3488, baseType: !1602, size: 64, align: 64, offset: 256)
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64, align: 64)
!1603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1594, file: !93, line: 3489, baseType: !1605, size: 64, align: 64, offset: 320)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !712)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1594, file: !93, line: 3490, baseType: !1608, size: 64, align: 64, offset: 384)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1594, file: !93, line: 3491, baseType: !1610, size: 64, align: 64, offset: 448)
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64, align: 64)
!1611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !695)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1594, file: !93, line: 3492, baseType: !1613, size: 64, align: 64, offset: 512)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1400)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1594, file: !93, line: 3493, baseType: !1103, size: 8, align: 8, offset: 576)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1594, file: !93, line: 3494, baseType: !1107, size: 64, align: 64, offset: 640)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1594, file: !93, line: 3495, baseType: !1618, size: 64, align: 64, offset: 704)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1620)
!1620 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !93, line: 3404, baseType: !1621)
!1621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !93, line: 3401, size: 128, align: 64, elements: !1622)
!1622 = !{!1623, !1624}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1621, file: !93, line: 3402, baseType: !1041, size: 32, align: 32)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1621, file: !93, line: 3403, baseType: !1027, size: 64, align: 64, offset: 64)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1594, file: !93, line: 3507, baseType: !1027, size: 64, align: 64, offset: 768)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1594, file: !93, line: 3516, baseType: !1041, size: 32, align: 32, offset: 832)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1594, file: !93, line: 3517, baseType: !1628, size: 64, align: 64, offset: 896)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1594, file: !93, line: 3527, baseType: !1630, size: 64, align: 64, offset: 960)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DISubroutineType(types: !1632)
!1632 = !{!1041, !1584}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1594, file: !93, line: 3535, baseType: !1634, size: 64, align: 64, offset: 1024)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DISubroutineType(types: !1636)
!1636 = !{!1041, !1584, !1637}
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1585)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1594, file: !93, line: 3541, baseType: !1640, size: 64, align: 64, offset: 1088)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1642)
!1642 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !93, line: 3461, baseType: !1643)
!1643 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !93, line: 3461, flags: DIFlagFwdDecl)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1594, file: !93, line: 3549, baseType: !1645, size: 64, align: 64, offset: 1152)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{null, !1628}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1594, file: !93, line: 3551, baseType: !1630, size: 64, align: 64, offset: 1216)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1594, file: !93, line: 3552, baseType: !1650, size: 64, align: 64, offset: 1280)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DISubroutineType(types: !1652)
!1652 = !{!1041, !1584, !1102, !1041, !1653}
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64, align: 64)
!1654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1655)
!1655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !93, line: 3920, size: 256, align: 64, elements: !1656)
!1656 = !{!1657, !1658, !1659, !1660, !1661, !1688}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1655, file: !93, line: 3921, baseType: !1169, size: 16, align: 16)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1655, file: !93, line: 3922, baseType: !1128, size: 32, align: 32, offset: 32)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1655, file: !93, line: 3923, baseType: !1128, size: 32, align: 32, offset: 64)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1655, file: !93, line: 3924, baseType: !1105, size: 32, align: 32, offset: 96)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1655, file: !93, line: 3925, baseType: !1662, size: 64, align: 64, offset: 128)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !93, line: 3918, baseType: !1665)
!1665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !93, line: 3885, size: 1600, align: 64, elements: !1666)
!1666 = !{!1667, !1668, !1669, !1670, !1671, !1672, !1678, !1682, !1684, !1685, !1686, !1687}
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1665, file: !93, line: 3886, baseType: !1041, size: 32, align: 32)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1665, file: !93, line: 3887, baseType: !1041, size: 32, align: 32, offset: 32)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1665, file: !93, line: 3888, baseType: !1041, size: 32, align: 32, offset: 64)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1665, file: !93, line: 3889, baseType: !1041, size: 32, align: 32, offset: 96)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1665, file: !93, line: 3890, baseType: !1041, size: 32, align: 32, offset: 128)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1665, file: !93, line: 3897, baseType: !1673, size: 768, align: 64, offset: 192)
!1673 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !93, line: 3858, baseType: !1674)
!1674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !93, line: 3853, size: 768, align: 64, elements: !1675)
!1675 = !{!1676, !1677}
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1674, file: !93, line: 3855, baseType: !1379, size: 512, align: 64)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1674, file: !93, line: 3857, baseType: !1381, size: 256, align: 32, offset: 512)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1665, file: !93, line: 3903, baseType: !1679, size: 256, align: 64, offset: 960)
!1679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1102, size: 256, align: 64, elements: !1680)
!1680 = !{!1681}
!1681 = !DISubrange(count: 4)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1665, file: !93, line: 3904, baseType: !1683, size: 128, align: 32, offset: 1216)
!1683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1041, size: 128, align: 32, elements: !1680)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1665, file: !93, line: 3906, baseType: !929, size: 32, align: 32, offset: 1344)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1665, file: !93, line: 3908, baseType: !1014, size: 64, align: 64, offset: 1408)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1665, file: !93, line: 3915, baseType: !1014, size: 64, align: 64, offset: 1472)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1665, file: !93, line: 3917, baseType: !1041, size: 32, align: 32, offset: 1536)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1655, file: !93, line: 3926, baseType: !1019, size: 64, align: 64, offset: 192)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1594, file: !93, line: 3564, baseType: !1690, size: 64, align: 64, offset: 1344)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DISubroutineType(types: !1692)
!1692 = !{!1041, !1584, !1318, !1693, !1695}
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64, align: 64)
!1694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1375)
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1594, file: !93, line: 3566, baseType: !1697, size: 64, align: 64, offset: 1408)
!1697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1698, size: 64, align: 64)
!1698 = !DISubroutineType(types: !1699)
!1699 = !{!1041, !1584, !1013, !1695, !1318}
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1594, file: !93, line: 3567, baseType: !1630, size: 64, align: 64, offset: 1472)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1594, file: !93, line: 3576, baseType: !1702, size: 64, align: 64, offset: 1536)
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64, align: 64)
!1703 = !DISubroutineType(types: !1704)
!1704 = !{!1041, !1584, !1693}
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1594, file: !93, line: 3577, baseType: !1706, size: 64, align: 64, offset: 1600)
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64, align: 64)
!1707 = !DISubroutineType(types: !1708)
!1708 = !{!1041, !1584, !1318}
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1594, file: !93, line: 3584, baseType: !1710, size: 64, align: 64, offset: 1664)
!1710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1711, size: 64, align: 64)
!1711 = !DISubroutineType(types: !1712)
!1712 = !{!1041, !1584, !1374}
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1594, file: !93, line: 3589, baseType: !1714, size: 64, align: 64, offset: 1728)
!1714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1715, size: 64, align: 64)
!1715 = !DISubroutineType(types: !1716)
!1716 = !{null, !1584}
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1594, file: !93, line: 3594, baseType: !1041, size: 32, align: 32, offset: 1792)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1594, file: !93, line: 3600, baseType: !1027, size: 64, align: 64, offset: 1856)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1594, file: !93, line: 3609, baseType: !1720, size: 64, align: 64, offset: 1920)
!1720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1721, size: 64, align: 64)
!1721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1722, size: 64, align: 64)
!1722 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1723)
!1723 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !93, line: 3609, flags: DIFlagFwdDecl)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1586, file: !93, line: 1566, baseType: !92, size: 32, align: 32, offset: 192)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1586, file: !93, line: 1581, baseType: !1105, size: 32, align: 32, offset: 224)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1586, file: !93, line: 1583, baseType: !1013, size: 64, align: 64, offset: 256)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1586, file: !93, line: 1591, baseType: !1728, size: 64, align: 64, offset: 320)
!1728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1729, size: 64, align: 64)
!1729 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !93, line: 1532, flags: DIFlagFwdDecl)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1586, file: !93, line: 1598, baseType: !1013, size: 64, align: 64, offset: 384)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1586, file: !93, line: 1606, baseType: !1019, size: 64, align: 64, offset: 448)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1586, file: !93, line: 1614, baseType: !1041, size: 32, align: 32, offset: 512)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1586, file: !93, line: 1622, baseType: !1041, size: 32, align: 32, offset: 544)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1586, file: !93, line: 1628, baseType: !1041, size: 32, align: 32, offset: 576)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1586, file: !93, line: 1636, baseType: !1041, size: 32, align: 32, offset: 608)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1586, file: !93, line: 1643, baseType: !1041, size: 32, align: 32, offset: 640)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1586, file: !93, line: 1657, baseType: !1102, size: 64, align: 64, offset: 704)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1586, file: !93, line: 1658, baseType: !1041, size: 32, align: 32, offset: 768)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1586, file: !93, line: 1679, baseType: !1050, size: 64, align: 32, offset: 800)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1586, file: !93, line: 1688, baseType: !1041, size: 32, align: 32, offset: 864)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1586, file: !93, line: 1712, baseType: !1041, size: 32, align: 32, offset: 896)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1586, file: !93, line: 1729, baseType: !1041, size: 32, align: 32, offset: 928)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1586, file: !93, line: 1729, baseType: !1041, size: 32, align: 32, offset: 960)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1586, file: !93, line: 1744, baseType: !1041, size: 32, align: 32, offset: 992)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1586, file: !93, line: 1744, baseType: !1041, size: 32, align: 32, offset: 1024)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1586, file: !93, line: 1751, baseType: !1041, size: 32, align: 32, offset: 1056)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1586, file: !93, line: 1766, baseType: !712, size: 32, align: 32, offset: 1088)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1586, file: !93, line: 1791, baseType: !1749, size: 64, align: 64, offset: 1152)
!1749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1750, size: 64, align: 64)
!1750 = !DISubroutineType(types: !1751)
!1751 = !{null, !1752, !1693, !1695, !1041, !1041, !1041}
!1752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1586, file: !93, line: 1808, baseType: !1754, size: 64, align: 64, offset: 1216)
!1754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1755, size: 64, align: 64)
!1755 = !DISubroutineType(types: !1756)
!1756 = !{!712, !1752, !1605}
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1586, file: !93, line: 1816, baseType: !1041, size: 32, align: 32, offset: 1280)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1586, file: !93, line: 1825, baseType: !1759, size: 32, align: 32, offset: 1312)
!1759 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1586, file: !93, line: 1830, baseType: !1041, size: 32, align: 32, offset: 1344)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1586, file: !93, line: 1838, baseType: !1759, size: 32, align: 32, offset: 1376)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1586, file: !93, line: 1846, baseType: !1041, size: 32, align: 32, offset: 1408)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1586, file: !93, line: 1851, baseType: !1041, size: 32, align: 32, offset: 1440)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1586, file: !93, line: 1861, baseType: !1759, size: 32, align: 32, offset: 1472)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1586, file: !93, line: 1868, baseType: !1759, size: 32, align: 32, offset: 1504)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1586, file: !93, line: 1875, baseType: !1759, size: 32, align: 32, offset: 1536)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1586, file: !93, line: 1882, baseType: !1759, size: 32, align: 32, offset: 1568)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1586, file: !93, line: 1889, baseType: !1759, size: 32, align: 32, offset: 1600)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1586, file: !93, line: 1896, baseType: !1759, size: 32, align: 32, offset: 1632)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1586, file: !93, line: 1903, baseType: !1759, size: 32, align: 32, offset: 1664)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1586, file: !93, line: 1910, baseType: !1041, size: 32, align: 32, offset: 1696)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1586, file: !93, line: 1915, baseType: !1041, size: 32, align: 32, offset: 1728)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1586, file: !93, line: 1926, baseType: !1695, size: 64, align: 64, offset: 1792)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1586, file: !93, line: 1935, baseType: !1050, size: 64, align: 32, offset: 1856)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1586, file: !93, line: 1942, baseType: !1041, size: 32, align: 32, offset: 1920)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1586, file: !93, line: 1948, baseType: !1041, size: 32, align: 32, offset: 1952)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1586, file: !93, line: 1954, baseType: !1041, size: 32, align: 32, offset: 1984)
