; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--oggparsevp8.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--oggparsevp8.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ogg_codec = type { i8*, i8, i8*, i32 (%struct.AVFormatContext*, i32)*, i32 (%struct.AVFormatContext*, i32)*, i64 (%struct.AVFormatContext*, i32, i64, i64*)*, i32, i32, void (%struct.AVFormatContext*, i32)* }
%struct.AVFormatContext = type { %struct.AVClass*, %struct.AVInputFormat*, %struct.AVOutputFormat*, i8*, %struct.AVIOContext*, i32, i32, %struct.AVStream**, [1024 x i8], i8*, i64, i64, i64, i32, i32, i32, i64, i64, i8*, i32, i32, %struct.AVProgram**, i32, i32, i32, i32, i32, i32, %struct.AVChapter**, %struct.AVDictionary*, i64, i32, i32, %struct.AVIOInterruptCB, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i8*, i8*, %struct.AVFormatInternal*, i32, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, i32, i8*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i64, i8*, i32, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVIOInterruptCB*, %struct.AVDictionary**)*, i8*, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVDictionary**)*, void (%struct.AVFormatContext*, %struct.AVIOContext*)*, i8*, i32, i32 }

!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !25, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !25, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !918, !919, !928, !932, !938}
!917 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!918 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !922, line: 222, size: 16, align: 8, elements: !923)
!922 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!923 = !{!924}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !921, file: !922, line: 222, baseType: !925, size: 16, align: 16)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !926, line: 49, baseType: !927)
!926 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!927 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !926, line: 48, baseType: !931)
!931 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !922, line: 221, size: 32, align: 8, elements: !935)
!935 = !{!936}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !934, file: !922, line: 221, baseType: !937, size: 32, align: 32)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !926, line: 51, baseType: !918)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !926, line: 40, baseType: !939)
!939 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!940 = !{!941}
!941 = distinct !DIGlobalVariable(name: "ff_vp8_codec", scope: !0, file: !942, line: 139, type: !943, isLocal: false, isDefinition: true, variable: %struct.ogg_codec* @ff_vp8_codec)
!942 = !DIFile(filename: "libavformat/oggparsevp8.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ogg_codec", file: !945, line: 31, size: 512, align: 64, elements: !946)
!945 = !DIFile(filename: "libavformat/oggdec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!946 = !{!947, !952, !953, !954, !2162, !2163, !2167, !2168, !2169}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !944, file: !945, line: 32, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !926, line: 36, baseType: !951)
!951 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "magicsize", scope: !944, file: !945, line: 33, baseType: !930, size: 8, align: 8, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !944, file: !945, line: 34, baseType: !948, size: 64, align: 64, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !944, file: !945, line: 41, baseType: !955, size: 64, align: 64, offset: 192)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!917, !958, !917}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !897, line: 1947, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !961)
!961 = !{!962, !1007, !1116, !1262, !1263, !1326, !1327, !1328, !2019, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2073, !2074, !2075, !2076, !2077, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2128, !2129, !2132, !2133, !2134, !2135, !2136, !2137, !2139, !2140, !2141, !2142, !2150, !2151, !2155, !2159, !2160, !2161}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !960, file: !897, line: 1342, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !967)
!967 = !{!968, !972, !977, !981, !982, !983, !984, !988, !994, !996, !1000}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !966, file: !4, line: 72, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!971 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !966, file: !4, line: 78, baseType: !973, size: 64, align: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!969, !976}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !966, file: !4, line: 85, baseType: !978, size: 64, align: 64, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!980 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !966, file: !4, line: 93, baseType: !917, size: 32, align: 32, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !966, file: !4, line: 99, baseType: !917, size: 32, align: 32, offset: 224)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !966, file: !4, line: 108, baseType: !917, size: 32, align: 32, offset: 256)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !966, file: !4, line: 113, baseType: !985, size: 64, align: 64, offset: 320)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!976, !976, !976}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !966, file: !4, line: 123, baseType: !989, size: 64, align: 64, offset: 384)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!992, !992}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !966, file: !4, line: 130, baseType: !995, size: 32, align: 32, offset: 448)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !966, file: !4, line: 136, baseType: !997, size: 64, align: 64, offset: 512)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!995, !976}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !966, file: !4, line: 142, baseType: !1001, size: 64, align: 64, offset: 576)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!917, !1004, !976, !969, !917}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !960, file: !897, line: 1349, baseType: !1008, size: 64, align: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1010)
!1010 = !{!1011, !1012, !1013, !1014, !1015, !1025, !1026, !1027, !1028, !1029, !1030, !1043, !1048, !1087, !1088, !1092, !1097, !1098, !1099, !1103, !1109, !1115}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1009, file: !897, line: 638, baseType: !969, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1009, file: !897, line: 645, baseType: !969, size: 64, align: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1009, file: !897, line: 652, baseType: !917, size: 32, align: 32, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1009, file: !897, line: 659, baseType: !969, size: 64, align: 64, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1009, file: !897, line: 661, baseType: !1016, size: 64, align: 64, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1021, line: 44, size: 64, align: 32, elements: !1022)
!1021 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1022 = !{!1023, !1024}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1020, file: !1021, line: 45, baseType: !24, size: 32, align: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1020, file: !1021, line: 46, baseType: !918, size: 32, align: 32, offset: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1009, file: !897, line: 663, baseType: !963, size: 64, align: 64, offset: 320)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1009, file: !897, line: 670, baseType: !969, size: 64, align: 64, offset: 384)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1009, file: !897, line: 679, baseType: !1008, size: 64, align: 64, offset: 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1009, file: !897, line: 684, baseType: !917, size: 32, align: 32, offset: 512)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1009, file: !897, line: 689, baseType: !917, size: 32, align: 32, offset: 544)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1009, file: !897, line: 696, baseType: !1031, size: 64, align: 64, offset: 576)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!917, !1034}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1037)
!1037 = !{!1038, !1039, !1041, !1042}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1036, file: !897, line: 449, baseType: !969, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1036, file: !897, line: 450, baseType: !1040, size: 64, align: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1036, file: !897, line: 451, baseType: !917, size: 32, align: 32, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1036, file: !897, line: 452, baseType: !969, size: 64, align: 64, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1009, file: !897, line: 703, baseType: !1044, size: 64, align: 64, offset: 640)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!917, !1047}
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1009, file: !897, line: 714, baseType: !1049, size: 64, align: 64, offset: 704)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!917, !1047, !1052}
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !25, line: 1499, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !25, line: 1445, size: 704, align: 64, elements: !1055)
!1055 = !{!1056, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1083, !1084, !1085, !1086}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1054, file: !25, line: 1451, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1059, line: 94, baseType: !1060)
!1059 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1059, line: 81, size: 192, align: 64, elements: !1061)
!1061 = !{!1062, !1066, !1068}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1060, file: !1059, line: 82, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1059, line: 73, baseType: !1065)
!1065 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1059, line: 73, flags: DIFlagFwdDecl)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1060, file: !1059, line: 89, baseType: !1067, size: 64, align: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1060, file: !1059, line: 93, baseType: !917, size: 32, align: 32, offset: 128)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1054, file: !25, line: 1461, baseType: !938, size: 64, align: 64, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1054, file: !25, line: 1467, baseType: !938, size: 64, align: 64, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1054, file: !25, line: 1468, baseType: !1067, size: 64, align: 64, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1054, file: !25, line: 1469, baseType: !917, size: 32, align: 32, offset: 256)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1054, file: !25, line: 1470, baseType: !917, size: 32, align: 32, offset: 288)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1054, file: !25, line: 1474, baseType: !917, size: 32, align: 32, offset: 320)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1054, file: !25, line: 1479, baseType: !1076, size: 64, align: 64, offset: 384)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !25, line: 1415, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !25, line: 1411, size: 128, align: 64, elements: !1079)
!1079 = !{!1080, !1081, !1082}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1078, file: !25, line: 1412, baseType: !1067, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1078, file: !25, line: 1413, baseType: !917, size: 32, align: 32, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1078, file: !25, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1054, file: !25, line: 1480, baseType: !917, size: 32, align: 32, offset: 448)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1054, file: !25, line: 1486, baseType: !938, size: 64, align: 64, offset: 512)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1054, file: !25, line: 1488, baseType: !938, size: 64, align: 64, offset: 576)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1054, file: !25, line: 1497, baseType: !938, size: 64, align: 64, offset: 640)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1009, file: !897, line: 720, baseType: !1044, size: 64, align: 64, offset: 768)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1009, file: !897, line: 730, baseType: !1089, size: 64, align: 64, offset: 832)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!917, !1047, !917, !938, !917}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1009, file: !897, line: 737, baseType: !1093, size: 64, align: 64, offset: 896)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!938, !1047, !917, !1096, !938}
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1009, file: !897, line: 744, baseType: !1044, size: 64, align: 64, offset: 960)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1009, file: !897, line: 750, baseType: !1044, size: 64, align: 64, offset: 1024)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1009, file: !897, line: 758, baseType: !1100, size: 64, align: 64, offset: 1088)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!917, !1047, !917, !938, !938, !938, !917}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1009, file: !897, line: 764, baseType: !1104, size: 64, align: 64, offset: 1152)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!917, !1047, !1107}
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1009, file: !897, line: 770, baseType: !1110, size: 64, align: 64, offset: 1216)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!917, !1047, !1113}
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1009, file: !897, line: 776, baseType: !1110, size: 64, align: 64, offset: 1280)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !960, file: !897, line: 1356, baseType: !1117, size: 64, align: 64, offset: 128)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1119)
!1119 = !{!1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1139, !1143, !1147, !1154, !1247, !1248, !1249, !1250, !1251, !1252, !1256}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1118, file: !897, line: 498, baseType: !969, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1118, file: !897, line: 504, baseType: !969, size: 64, align: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1118, file: !897, line: 505, baseType: !969, size: 64, align: 64, offset: 128)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1118, file: !897, line: 506, baseType: !969, size: 64, align: 64, offset: 192)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1118, file: !897, line: 508, baseType: !24, size: 32, align: 32, offset: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1118, file: !897, line: 509, baseType: !24, size: 32, align: 32, offset: 288)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1118, file: !897, line: 510, baseType: !24, size: 32, align: 32, offset: 320)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1118, file: !897, line: 517, baseType: !917, size: 32, align: 32, offset: 352)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1118, file: !897, line: 523, baseType: !1016, size: 64, align: 64, offset: 384)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1118, file: !897, line: 526, baseType: !963, size: 64, align: 64, offset: 448)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1118, file: !897, line: 535, baseType: !1117, size: 64, align: 64, offset: 512)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1118, file: !897, line: 539, baseType: !917, size: 32, align: 32, offset: 576)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1118, file: !897, line: 541, baseType: !1044, size: 64, align: 64, offset: 640)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1118, file: !897, line: 549, baseType: !1049, size: 64, align: 64, offset: 704)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1118, file: !897, line: 550, baseType: !1044, size: 64, align: 64, offset: 768)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1118, file: !897, line: 554, baseType: !1136, size: 64, align: 64, offset: 832)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!917, !1047, !1052, !1052, !917}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1118, file: !897, line: 563, baseType: !1140, size: 64, align: 64, offset: 896)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!917, !24, !917}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1118, file: !897, line: 565, baseType: !1144, size: 64, align: 64, offset: 960)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{null, !1047, !917, !1096, !1096}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1118, file: !897, line: 570, baseType: !1148, size: 64, align: 64, offset: 1024)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!917, !1047, !917, !976, !1151}
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1152, line: 216, baseType: !1153)
!1152 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1153 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1118, file: !897, line: 581, baseType: !1155, size: 64, align: 64, offset: 1088)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!917, !1047, !917, !1158, !918}
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1162)
!1162 = !{!1163, !1167, !1169, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1203, !1205, !1206, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1161, file: !526, line: 282, baseType: !1164, size: 512, align: 64)
!1164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1067, size: 512, align: 64, elements: !1165)
!1165 = !{!1166}
!1166 = !DISubrange(count: 8)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1161, file: !526, line: 299, baseType: !1168, size: 256, align: 32, offset: 512)
!1168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 256, align: 32, elements: !1165)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1161, file: !526, line: 315, baseType: !1170, size: 64, align: 64, offset: 768)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1161, file: !526, line: 326, baseType: !917, size: 32, align: 32, offset: 832)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1161, file: !526, line: 326, baseType: !917, size: 32, align: 32, offset: 864)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1161, file: !526, line: 334, baseType: !917, size: 32, align: 32, offset: 896)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1161, file: !526, line: 341, baseType: !917, size: 32, align: 32, offset: 928)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1161, file: !526, line: 346, baseType: !917, size: 32, align: 32, offset: 960)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1161, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1161, file: !526, line: 356, baseType: !1178, size: 64, align: 32, offset: 1024)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1179, line: 61, baseType: !1180)
!1179 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1179, line: 58, size: 64, align: 32, elements: !1181)
!1181 = !{!1182, !1183}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1180, file: !1179, line: 59, baseType: !917, size: 32, align: 32)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1180, file: !1179, line: 60, baseType: !917, size: 32, align: 32, offset: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1161, file: !526, line: 361, baseType: !938, size: 64, align: 64, offset: 1088)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1161, file: !526, line: 369, baseType: !938, size: 64, align: 64, offset: 1152)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1161, file: !526, line: 377, baseType: !938, size: 64, align: 64, offset: 1216)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1161, file: !526, line: 382, baseType: !917, size: 32, align: 32, offset: 1280)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1161, file: !526, line: 386, baseType: !917, size: 32, align: 32, offset: 1312)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1161, file: !526, line: 391, baseType: !917, size: 32, align: 32, offset: 1344)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1161, file: !526, line: 396, baseType: !976, size: 64, align: 64, offset: 1408)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1161, file: !526, line: 403, baseType: !1192, size: 512, align: 64, offset: 1472)
!1192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1193, size: 512, align: 64, elements: !1165)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !926, line: 55, baseType: !1153)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1161, file: !526, line: 410, baseType: !917, size: 32, align: 32, offset: 1984)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1161, file: !526, line: 415, baseType: !917, size: 32, align: 32, offset: 2016)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1161, file: !526, line: 420, baseType: !917, size: 32, align: 32, offset: 2048)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1161, file: !526, line: 425, baseType: !917, size: 32, align: 32, offset: 2080)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1161, file: !526, line: 435, baseType: !938, size: 64, align: 64, offset: 2112)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1161, file: !526, line: 440, baseType: !917, size: 32, align: 32, offset: 2176)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1161, file: !526, line: 445, baseType: !1193, size: 64, align: 64, offset: 2240)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1161, file: !526, line: 459, baseType: !1202, size: 512, align: 64, offset: 2304)
!1202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1057, size: 512, align: 64, elements: !1165)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1161, file: !526, line: 473, baseType: !1204, size: 64, align: 64, offset: 2816)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1161, file: !526, line: 477, baseType: !917, size: 32, align: 32, offset: 2880)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1161, file: !526, line: 479, baseType: !1207, size: 64, align: 64, offset: 2944)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1210)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1211)
!1211 = !{!1212, !1213, !1214, !1215, !1220}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1210, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1210, file: !526, line: 203, baseType: !1067, size: 64, align: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1210, file: !526, line: 204, baseType: !917, size: 32, align: 32, offset: 128)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1210, file: !526, line: 205, baseType: !1216, size: 64, align: 64, offset: 192)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1218, line: 86, baseType: !1219)
!1218 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1219 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1218, line: 86, flags: DIFlagFwdDecl)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1210, file: !526, line: 206, baseType: !1057, size: 64, align: 64, offset: 256)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1161, file: !526, line: 480, baseType: !917, size: 32, align: 32, offset: 3008)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1161, file: !526, line: 505, baseType: !917, size: 32, align: 32, offset: 3040)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1161, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1161, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1161, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1161, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1161, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1161, file: !526, line: 532, baseType: !938, size: 64, align: 64, offset: 3264)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1161, file: !526, line: 539, baseType: !938, size: 64, align: 64, offset: 3328)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1161, file: !526, line: 547, baseType: !938, size: 64, align: 64, offset: 3392)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1161, file: !526, line: 554, baseType: !1216, size: 64, align: 64, offset: 3456)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1161, file: !526, line: 563, baseType: !917, size: 32, align: 32, offset: 3520)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1161, file: !526, line: 572, baseType: !917, size: 32, align: 32, offset: 3552)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1161, file: !526, line: 581, baseType: !917, size: 32, align: 32, offset: 3584)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1161, file: !526, line: 588, baseType: !1236, size: 64, align: 64, offset: 3648)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1161, file: !526, line: 593, baseType: !917, size: 32, align: 32, offset: 3712)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1161, file: !526, line: 596, baseType: !917, size: 32, align: 32, offset: 3744)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1161, file: !526, line: 599, baseType: !1057, size: 64, align: 64, offset: 3776)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1161, file: !526, line: 605, baseType: !1057, size: 64, align: 64, offset: 3840)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1161, file: !526, line: 616, baseType: !1057, size: 64, align: 64, offset: 3904)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1161, file: !526, line: 626, baseType: !1151, size: 64, align: 64, offset: 3968)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1161, file: !526, line: 627, baseType: !1151, size: 64, align: 64, offset: 4032)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1161, file: !526, line: 628, baseType: !1151, size: 64, align: 64, offset: 4096)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1161, file: !526, line: 629, baseType: !1151, size: 64, align: 64, offset: 4160)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1161, file: !526, line: 645, baseType: !1057, size: 64, align: 64, offset: 4224)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1118, file: !897, line: 587, baseType: !1104, size: 64, align: 64, offset: 1152)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1118, file: !897, line: 592, baseType: !1110, size: 64, align: 64, offset: 1216)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1118, file: !897, line: 597, baseType: !1110, size: 64, align: 64, offset: 1280)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1118, file: !897, line: 598, baseType: !24, size: 32, align: 32, offset: 1344)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1118, file: !897, line: 608, baseType: !1044, size: 64, align: 64, offset: 1408)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1118, file: !897, line: 617, baseType: !1253, size: 64, align: 64, offset: 1472)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{null, !1047}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1118, file: !897, line: 623, baseType: !1257, size: 64, align: 64, offset: 1536)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{!917, !1047, !1260}
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1053)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !960, file: !897, line: 1365, baseType: !976, size: 64, align: 64, offset: 192)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !960, file: !897, line: 1379, baseType: !1264, size: 64, align: 64, offset: 256)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1266)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1267)
!1267 = !{!1268, !1269, !1270, !1271, !1272, !1273, !1274, !1278, !1279, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1293, !1294, !1298, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1316, !1317, !1318, !1319, !1323, !1324, !1325}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1266, file: !628, line: 174, baseType: !963, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1266, file: !628, line: 226, baseType: !1040, size: 64, align: 64, offset: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1266, file: !628, line: 227, baseType: !917, size: 32, align: 32, offset: 128)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1266, file: !628, line: 228, baseType: !1040, size: 64, align: 64, offset: 192)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1266, file: !628, line: 229, baseType: !1040, size: 64, align: 64, offset: 256)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1266, file: !628, line: 233, baseType: !976, size: 64, align: 64, offset: 320)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1266, file: !628, line: 235, baseType: !1275, size: 64, align: 64, offset: 384)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!917, !976, !1067, !917}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1266, file: !628, line: 236, baseType: !1275, size: 64, align: 64, offset: 448)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1266, file: !628, line: 237, baseType: !1280, size: 64, align: 64, offset: 512)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!938, !976, !938, !917}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1266, file: !628, line: 238, baseType: !938, size: 64, align: 64, offset: 576)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1266, file: !628, line: 239, baseType: !917, size: 32, align: 32, offset: 640)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1266, file: !628, line: 240, baseType: !917, size: 32, align: 32, offset: 672)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1266, file: !628, line: 241, baseType: !917, size: 32, align: 32, offset: 704)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1266, file: !628, line: 242, baseType: !1153, size: 64, align: 64, offset: 768)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1266, file: !628, line: 243, baseType: !1040, size: 64, align: 64, offset: 832)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1266, file: !628, line: 244, baseType: !1290, size: 64, align: 64, offset: 896)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!1153, !1153, !928, !918}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1266, file: !628, line: 245, baseType: !917, size: 32, align: 32, offset: 960)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1266, file: !628, line: 249, baseType: !1295, size: 64, align: 64, offset: 1024)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{!917, !976, !917}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1266, file: !628, line: 255, baseType: !1299, size: 64, align: 64, offset: 1088)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DISubroutineType(types: !1301)
!1301 = !{!938, !976, !917, !938, !917}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1266, file: !628, line: 260, baseType: !917, size: 32, align: 32, offset: 1152)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1266, file: !628, line: 266, baseType: !938, size: 64, align: 64, offset: 1216)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1266, file: !628, line: 273, baseType: !917, size: 32, align: 32, offset: 1280)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1266, file: !628, line: 279, baseType: !938, size: 64, align: 64, offset: 1344)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1266, file: !628, line: 285, baseType: !917, size: 32, align: 32, offset: 1408)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1266, file: !628, line: 291, baseType: !917, size: 32, align: 32, offset: 1440)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1266, file: !628, line: 298, baseType: !917, size: 32, align: 32, offset: 1472)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1266, file: !628, line: 304, baseType: !917, size: 32, align: 32, offset: 1504)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1266, file: !628, line: 309, baseType: !969, size: 64, align: 64, offset: 1536)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1266, file: !628, line: 314, baseType: !969, size: 64, align: 64, offset: 1600)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1266, file: !628, line: 319, baseType: !1313, size: 64, align: 64, offset: 1664)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!917, !976, !1067, !917, !627, !938}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1266, file: !628, line: 326, baseType: !917, size: 32, align: 32, offset: 1728)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1266, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1266, file: !628, line: 332, baseType: !938, size: 64, align: 64, offset: 1792)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1266, file: !628, line: 338, baseType: !1320, size: 64, align: 64, offset: 1856)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{!917, !976}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1266, file: !628, line: 340, baseType: !938, size: 64, align: 64, offset: 1920)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1266, file: !628, line: 346, baseType: !1040, size: 64, align: 64, offset: 1984)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1266, file: !628, line: 351, baseType: !917, size: 32, align: 32, offset: 2048)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !960, file: !897, line: 1386, baseType: !917, size: 32, align: 32, offset: 320)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !960, file: !897, line: 1393, baseType: !918, size: 32, align: 32, offset: 352)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !960, file: !897, line: 1405, baseType: !1329, size: 64, align: 64, offset: 384)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1332)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1333)
!1333 = !{!1334, !1335, !1336, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1804, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1905, !1911, !1912, !1916, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1948, !1949, !1950, !1951, !1952, !1953}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1332, file: !897, line: 866, baseType: !917, size: 32, align: 32)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1332, file: !897, line: 872, baseType: !917, size: 32, align: 32, offset: 32)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1332, file: !897, line: 878, baseType: !1337, size: 64, align: 64, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !25, line: 3360, baseType: !1339)
!1339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !25, line: 1556, size: 8448, align: 64, elements: !1340)
!1340 = !{!1341, !1342, !1343, !1344, !1479, !1480, !1481, !1482, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1508, !1512, !1513, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1692, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1339, file: !25, line: 1561, baseType: !963, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1339, file: !25, line: 1562, baseType: !917, size: 32, align: 32, offset: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1339, file: !25, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1339, file: !25, line: 1565, baseType: !1345, size: 64, align: 64, offset: 128)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1347)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !25, line: 3468, size: 1984, align: 64, elements: !1348)
!1348 = !{!1349, !1350, !1351, !1352, !1353, !1354, !1357, !1360, !1363, !1366, !1369, !1370, !1371, !1379, !1380, !1381, !1383, !1387, !1393, !1398, !1402, !1403, !1444, !1451, !1455, !1456, !1460, !1464, !1468, !1472, !1473, !1474}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1347, file: !25, line: 3475, baseType: !969, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1347, file: !25, line: 3480, baseType: !969, size: 64, align: 64, offset: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1347, file: !25, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1347, file: !25, line: 3482, baseType: !24, size: 32, align: 32, offset: 160)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1347, file: !25, line: 3487, baseType: !917, size: 32, align: 32, offset: 192)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1347, file: !25, line: 3488, baseType: !1355, size: 64, align: 64, offset: 256)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1178)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1347, file: !25, line: 3489, baseType: !1358, size: 64, align: 64, offset: 320)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1347, file: !25, line: 3490, baseType: !1361, size: 64, align: 64, offset: 384)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1347, file: !25, line: 3491, baseType: !1364, size: 64, align: 64, offset: 448)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1347, file: !25, line: 3492, baseType: !1367, size: 64, align: 64, offset: 512)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1193)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1347, file: !25, line: 3493, baseType: !930, size: 8, align: 8, offset: 576)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1347, file: !25, line: 3494, baseType: !963, size: 64, align: 64, offset: 640)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1347, file: !25, line: 3495, baseType: !1372, size: 64, align: 64, offset: 704)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1374)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !25, line: 3404, baseType: !1375)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !25, line: 3401, size: 128, align: 64, elements: !1376)
!1376 = !{!1377, !1378}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1375, file: !25, line: 3402, baseType: !917, size: 32, align: 32)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1375, file: !25, line: 3403, baseType: !969, size: 64, align: 64, offset: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1347, file: !25, line: 3507, baseType: !969, size: 64, align: 64, offset: 768)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1347, file: !25, line: 3516, baseType: !917, size: 32, align: 32, offset: 832)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1347, file: !25, line: 3517, baseType: !1382, size: 64, align: 64, offset: 896)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1347, file: !25, line: 3527, baseType: !1384, size: 64, align: 64, offset: 960)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DISubroutineType(types: !1386)
!1386 = !{!917, !1337}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1347, file: !25, line: 3535, baseType: !1388, size: 64, align: 64, offset: 1024)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DISubroutineType(types: !1390)
!1390 = !{!917, !1337, !1391}
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1338)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1347, file: !25, line: 3541, baseType: !1394, size: 64, align: 64, offset: 1088)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1396)
!1396 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !25, line: 3461, baseType: !1397)
!1397 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !25, line: 3461, flags: DIFlagFwdDecl)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1347, file: !25, line: 3549, baseType: !1399, size: 64, align: 64, offset: 1152)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DISubroutineType(types: !1401)
!1401 = !{null, !1382}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1347, file: !25, line: 3551, baseType: !1384, size: 64, align: 64, offset: 1216)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1347, file: !25, line: 3552, baseType: !1404, size: 64, align: 64, offset: 1280)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DISubroutineType(types: !1406)
!1406 = !{!917, !1337, !1067, !917, !1407}
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1409)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !25, line: 3920, size: 256, align: 64, elements: !1410)
!1410 = !{!1411, !1412, !1413, !1414, !1415, !1443}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1409, file: !25, line: 3921, baseType: !925, size: 16, align: 16)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1409, file: !25, line: 3922, baseType: !937, size: 32, align: 32, offset: 32)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1409, file: !25, line: 3923, baseType: !937, size: 32, align: 32, offset: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1409, file: !25, line: 3924, baseType: !918, size: 32, align: 32, offset: 96)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1409, file: !25, line: 3925, baseType: !1416, size: 64, align: 64, offset: 128)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !25, line: 3918, baseType: !1419)
!1419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !25, line: 3885, size: 1600, align: 64, elements: !1420)
!1420 = !{!1421, !1422, !1423, !1424, !1425, !1426, !1432, !1436, !1438, !1439, !1441, !1442}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1419, file: !25, line: 3886, baseType: !917, size: 32, align: 32)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1419, file: !25, line: 3887, baseType: !917, size: 32, align: 32, offset: 32)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1419, file: !25, line: 3888, baseType: !917, size: 32, align: 32, offset: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1419, file: !25, line: 3889, baseType: !917, size: 32, align: 32, offset: 96)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1419, file: !25, line: 3890, baseType: !917, size: 32, align: 32, offset: 128)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1419, file: !25, line: 3897, baseType: !1427, size: 768, align: 64, offset: 192)
!1427 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !25, line: 3858, baseType: !1428)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !25, line: 3853, size: 768, align: 64, elements: !1429)
!1429 = !{!1430, !1431}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1428, file: !25, line: 3855, baseType: !1164, size: 512, align: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1428, file: !25, line: 3857, baseType: !1168, size: 256, align: 32, offset: 512)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1419, file: !25, line: 3903, baseType: !1433, size: 256, align: 64, offset: 960)
!1433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1067, size: 256, align: 64, elements: !1434)
!1434 = !{!1435}
!1435 = !DISubrange(count: 4)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1419, file: !25, line: 3904, baseType: !1437, size: 128, align: 32, offset: 1216)
!1437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 128, align: 32, elements: !1434)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1419, file: !25, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1419, file: !25, line: 3908, baseType: !1440, size: 64, align: 64, offset: 1408)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1419, file: !25, line: 3915, baseType: !1440, size: 64, align: 64, offset: 1472)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1419, file: !25, line: 3917, baseType: !917, size: 32, align: 32, offset: 1536)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1409, file: !25, line: 3926, baseType: !938, size: 64, align: 64, offset: 192)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1347, file: !25, line: 3564, baseType: !1445, size: 64, align: 64, offset: 1344)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DISubroutineType(types: !1447)
!1447 = !{!917, !1337, !1052, !1448, !1450}
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1160)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1347, file: !25, line: 3566, baseType: !1452, size: 64, align: 64, offset: 1408)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DISubroutineType(types: !1454)
!1454 = !{!917, !1337, !976, !1450, !1052}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1347, file: !25, line: 3567, baseType: !1384, size: 64, align: 64, offset: 1472)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1347, file: !25, line: 3576, baseType: !1457, size: 64, align: 64, offset: 1536)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!917, !1337, !1448}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1347, file: !25, line: 3577, baseType: !1461, size: 64, align: 64, offset: 1600)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!917, !1337, !1052}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1347, file: !25, line: 3584, baseType: !1465, size: 64, align: 64, offset: 1664)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!917, !1337, !1159}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1347, file: !25, line: 3589, baseType: !1469, size: 64, align: 64, offset: 1728)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DISubroutineType(types: !1471)
!1471 = !{null, !1337}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1347, file: !25, line: 3594, baseType: !917, size: 32, align: 32, offset: 1792)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1347, file: !25, line: 3600, baseType: !969, size: 64, align: 64, offset: 1856)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1347, file: !25, line: 3609, baseType: !1475, size: 64, align: 64, offset: 1920)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1478)
!1478 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !25, line: 3609, flags: DIFlagFwdDecl)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1339, file: !25, line: 1566, baseType: !24, size: 32, align: 32, offset: 192)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1339, file: !25, line: 1581, baseType: !918, size: 32, align: 32, offset: 224)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1339, file: !25, line: 1583, baseType: !976, size: 64, align: 64, offset: 256)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1339, file: !25, line: 1591, baseType: !1483, size: 64, align: 64, offset: 320)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !25, line: 1532, flags: DIFlagFwdDecl)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1339, file: !25, line: 1598, baseType: !976, size: 64, align: 64, offset: 384)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1339, file: !25, line: 1606, baseType: !938, size: 64, align: 64, offset: 448)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1339, file: !25, line: 1614, baseType: !917, size: 32, align: 32, offset: 512)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1339, file: !25, line: 1622, baseType: !917, size: 32, align: 32, offset: 544)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1339, file: !25, line: 1628, baseType: !917, size: 32, align: 32, offset: 576)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1339, file: !25, line: 1636, baseType: !917, size: 32, align: 32, offset: 608)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1339, file: !25, line: 1643, baseType: !917, size: 32, align: 32, offset: 640)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1339, file: !25, line: 1657, baseType: !1067, size: 64, align: 64, offset: 704)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1339, file: !25, line: 1658, baseType: !917, size: 32, align: 32, offset: 768)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1339, file: !25, line: 1679, baseType: !1178, size: 64, align: 32, offset: 800)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1339, file: !25, line: 1688, baseType: !917, size: 32, align: 32, offset: 864)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1339, file: !25, line: 1712, baseType: !917, size: 32, align: 32, offset: 896)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1339, file: !25, line: 1729, baseType: !917, size: 32, align: 32, offset: 928)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1339, file: !25, line: 1729, baseType: !917, size: 32, align: 32, offset: 960)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1339, file: !25, line: 1744, baseType: !917, size: 32, align: 32, offset: 992)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1339, file: !25, line: 1744, baseType: !917, size: 32, align: 32, offset: 1024)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1339, file: !25, line: 1751, baseType: !917, size: 32, align: 32, offset: 1056)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1339, file: !25, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1339, file: !25, line: 1791, baseType: !1504, size: 64, align: 64, offset: 1152)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{null, !1507, !1448, !1450, !917, !917, !917}
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1339, file: !25, line: 1808, baseType: !1509, size: 64, align: 64, offset: 1216)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DISubroutineType(types: !1511)
!1511 = !{!645, !1507, !1358}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1339, file: !25, line: 1816, baseType: !917, size: 32, align: 32, offset: 1280)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1339, file: !25, line: 1825, baseType: !1514, size: 32, align: 32, offset: 1312)
!1514 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1339, file: !25, line: 1830, baseType: !917, size: 32, align: 32, offset: 1344)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1339, file: !25, line: 1838, baseType: !1514, size: 32, align: 32, offset: 1376)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1339, file: !25, line: 1846, baseType: !917, size: 32, align: 32, offset: 1408)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1339, file: !25, line: 1851, baseType: !917, size: 32, align: 32, offset: 1440)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1339, file: !25, line: 1861, baseType: !1514, size: 32, align: 32, offset: 1472)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1339, file: !25, line: 1868, baseType: !1514, size: 32, align: 32, offset: 1504)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1339, file: !25, line: 1875, baseType: !1514, size: 32, align: 32, offset: 1536)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1339, file: !25, line: 1882, baseType: !1514, size: 32, align: 32, offset: 1568)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1339, file: !25, line: 1889, baseType: !1514, size: 32, align: 32, offset: 1600)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1339, file: !25, line: 1896, baseType: !1514, size: 32, align: 32, offset: 1632)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1339, file: !25, line: 1903, baseType: !1514, size: 32, align: 32, offset: 1664)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1339, file: !25, line: 1910, baseType: !917, size: 32, align: 32, offset: 1696)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1339, file: !25, line: 1915, baseType: !917, size: 32, align: 32, offset: 1728)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1339, file: !25, line: 1926, baseType: !1450, size: 64, align: 64, offset: 1792)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1339, file: !25, line: 1935, baseType: !1178, size: 64, align: 32, offset: 1856)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1339, file: !25, line: 1942, baseType: !917, size: 32, align: 32, offset: 1920)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1339, file: !25, line: 1948, baseType: !917, size: 32, align: 32, offset: 1952)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1339, file: !25, line: 1954, baseType: !917, size: 32, align: 32, offset: 1984)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1339, file: !25, line: 1960, baseType: !917, size: 32, align: 32, offset: 2016)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1339, file: !25, line: 1984, baseType: !917, size: 32, align: 32, offset: 2048)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1339, file: !25, line: 1991, baseType: !917, size: 32, align: 32, offset: 2080)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1339, file: !25, line: 1996, baseType: !917, size: 32, align: 32, offset: 2112)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1339, file: !25, line: 2004, baseType: !917, size: 32, align: 32, offset: 2144)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1339, file: !25, line: 2011, baseType: !917, size: 32, align: 32, offset: 2176)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1339, file: !25, line: 2018, baseType: !917, size: 32, align: 32, offset: 2208)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1339, file: !25, line: 2027, baseType: !917, size: 32, align: 32, offset: 2240)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1339, file: !25, line: 2034, baseType: !917, size: 32, align: 32, offset: 2272)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1339, file: !25, line: 2044, baseType: !917, size: 32, align: 32, offset: 2304)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1339, file: !25, line: 2054, baseType: !1544, size: 64, align: 64, offset: 2368)
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1339, file: !25, line: 2061, baseType: !1544, size: 64, align: 64, offset: 2432)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1339, file: !25, line: 2066, baseType: !917, size: 32, align: 32, offset: 2496)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1339, file: !25, line: 2070, baseType: !917, size: 32, align: 32, offset: 2528)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1339, file: !25, line: 2078, baseType: !917, size: 32, align: 32, offset: 2560)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1339, file: !25, line: 2085, baseType: !917, size: 32, align: 32, offset: 2592)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1339, file: !25, line: 2092, baseType: !917, size: 32, align: 32, offset: 2624)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1339, file: !25, line: 2099, baseType: !917, size: 32, align: 32, offset: 2656)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1339, file: !25, line: 2106, baseType: !917, size: 32, align: 32, offset: 2688)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1339, file: !25, line: 2113, baseType: !917, size: 32, align: 32, offset: 2720)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1339, file: !25, line: 2120, baseType: !917, size: 32, align: 32, offset: 2752)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1339, file: !25, line: 2125, baseType: !917, size: 32, align: 32, offset: 2784)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1339, file: !25, line: 2133, baseType: !917, size: 32, align: 32, offset: 2816)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1339, file: !25, line: 2140, baseType: !917, size: 32, align: 32, offset: 2848)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1339, file: !25, line: 2145, baseType: !917, size: 32, align: 32, offset: 2880)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1339, file: !25, line: 2153, baseType: !917, size: 32, align: 32, offset: 2912)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1339, file: !25, line: 2158, baseType: !917, size: 32, align: 32, offset: 2944)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1339, file: !25, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1339, file: !25, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1339, file: !25, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1339, file: !25, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1339, file: !25, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1339, file: !25, line: 2203, baseType: !917, size: 32, align: 32, offset: 3136)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1339, file: !25, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1339, file: !25, line: 2212, baseType: !917, size: 32, align: 32, offset: 3200)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1339, file: !25, line: 2213, baseType: !917, size: 32, align: 32, offset: 3232)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1339, file: !25, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1339, file: !25, line: 2232, baseType: !917, size: 32, align: 32, offset: 3296)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1339, file: !25, line: 2243, baseType: !917, size: 32, align: 32, offset: 3328)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1339, file: !25, line: 2249, baseType: !917, size: 32, align: 32, offset: 3360)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1339, file: !25, line: 2256, baseType: !917, size: 32, align: 32, offset: 3392)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1339, file: !25, line: 2263, baseType: !1193, size: 64, align: 64, offset: 3456)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1339, file: !25, line: 2270, baseType: !1193, size: 64, align: 64, offset: 3520)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1339, file: !25, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1339, file: !25, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1339, file: !25, line: 2367, baseType: !1580, size: 64, align: 64, offset: 3648)
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1581, size: 64, align: 64)
!1581 = !DISubroutineType(types: !1582)
!1582 = !{!917, !1507, !1159, !917}
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1339, file: !25, line: 2383, baseType: !917, size: 32, align: 32, offset: 3712)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1339, file: !25, line: 2386, baseType: !1514, size: 32, align: 32, offset: 3744)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1339, file: !25, line: 2387, baseType: !1514, size: 32, align: 32, offset: 3776)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1339, file: !25, line: 2394, baseType: !917, size: 32, align: 32, offset: 3808)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1339, file: !25, line: 2401, baseType: !917, size: 32, align: 32, offset: 3840)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1339, file: !25, line: 2408, baseType: !917, size: 32, align: 32, offset: 3872)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1339, file: !25, line: 2415, baseType: !917, size: 32, align: 32, offset: 3904)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1339, file: !25, line: 2422, baseType: !917, size: 32, align: 32, offset: 3936)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1339, file: !25, line: 2423, baseType: !1592, size: 64, align: 64, offset: 3968)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !25, line: 831, baseType: !1594)
!1594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !25, line: 826, size: 128, align: 32, elements: !1595)
!1595 = !{!1596, !1597, !1598, !1599}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1594, file: !25, line: 827, baseType: !917, size: 32, align: 32)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1594, file: !25, line: 828, baseType: !917, size: 32, align: 32, offset: 32)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1594, file: !25, line: 829, baseType: !917, size: 32, align: 32, offset: 64)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1594, file: !25, line: 830, baseType: !1514, size: 32, align: 32, offset: 96)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1339, file: !25, line: 2430, baseType: !938, size: 64, align: 64, offset: 4032)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1339, file: !25, line: 2437, baseType: !938, size: 64, align: 64, offset: 4096)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1339, file: !25, line: 2444, baseType: !1514, size: 32, align: 32, offset: 4160)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1339, file: !25, line: 2451, baseType: !1514, size: 32, align: 32, offset: 4192)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1339, file: !25, line: 2458, baseType: !917, size: 32, align: 32, offset: 4224)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1339, file: !25, line: 2469, baseType: !917, size: 32, align: 32, offset: 4256)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1339, file: !25, line: 2475, baseType: !917, size: 32, align: 32, offset: 4288)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1339, file: !25, line: 2481, baseType: !917, size: 32, align: 32, offset: 4320)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1339, file: !25, line: 2485, baseType: !917, size: 32, align: 32, offset: 4352)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1339, file: !25, line: 2489, baseType: !917, size: 32, align: 32, offset: 4384)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1339, file: !25, line: 2493, baseType: !917, size: 32, align: 32, offset: 4416)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1339, file: !25, line: 2501, baseType: !917, size: 32, align: 32, offset: 4448)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1339, file: !25, line: 2506, baseType: !917, size: 32, align: 32, offset: 4480)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1339, file: !25, line: 2510, baseType: !917, size: 32, align: 32, offset: 4512)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1339, file: !25, line: 2514, baseType: !938, size: 64, align: 64, offset: 4544)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1339, file: !25, line: 2528, baseType: !1616, size: 64, align: 64, offset: 4608)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DISubroutineType(types: !1618)
!1618 = !{null, !1507, !976, !917, !917}
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1339, file: !25, line: 2534, baseType: !917, size: 32, align: 32, offset: 4672)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1339, file: !25, line: 2545, baseType: !917, size: 32, align: 32, offset: 4704)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1339, file: !25, line: 2547, baseType: !917, size: 32, align: 32, offset: 4736)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1339, file: !25, line: 2549, baseType: !917, size: 32, align: 32, offset: 4768)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1339, file: !25, line: 2551, baseType: !917, size: 32, align: 32, offset: 4800)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1339, file: !25, line: 2553, baseType: !917, size: 32, align: 32, offset: 4832)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1339, file: !25, line: 2555, baseType: !917, size: 32, align: 32, offset: 4864)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1339, file: !25, line: 2557, baseType: !917, size: 32, align: 32, offset: 4896)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1339, file: !25, line: 2559, baseType: !917, size: 32, align: 32, offset: 4928)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1339, file: !25, line: 2563, baseType: !917, size: 32, align: 32, offset: 4960)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1339, file: !25, line: 2571, baseType: !1440, size: 64, align: 64, offset: 4992)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1339, file: !25, line: 2579, baseType: !1440, size: 64, align: 64, offset: 5056)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1339, file: !25, line: 2586, baseType: !917, size: 32, align: 32, offset: 5120)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1339, file: !25, line: 2615, baseType: !917, size: 32, align: 32, offset: 5152)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1339, file: !25, line: 2627, baseType: !917, size: 32, align: 32, offset: 5184)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1339, file: !25, line: 2637, baseType: !917, size: 32, align: 32, offset: 5216)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1339, file: !25, line: 2681, baseType: !917, size: 32, align: 32, offset: 5248)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1339, file: !25, line: 2709, baseType: !938, size: 64, align: 64, offset: 5312)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1339, file: !25, line: 2716, baseType: !1638, size: 64, align: 64, offset: 5376)
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64, align: 64)
!1639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1640)
!1640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !25, line: 3636, size: 896, align: 64, elements: !1641)
!1641 = !{!1642, !1643, !1644, !1645, !1646, !1647, !1648, !1652, !1656, !1657, !1658, !1659, !1665, !1666, !1667, !1668, !1669}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1640, file: !25, line: 3642, baseType: !969, size: 64, align: 64)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1640, file: !25, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1640, file: !25, line: 3656, baseType: !24, size: 32, align: 32, offset: 96)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1640, file: !25, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1640, file: !25, line: 3669, baseType: !917, size: 32, align: 32, offset: 160)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1640, file: !25, line: 3682, baseType: !1465, size: 64, align: 64, offset: 192)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1640, file: !25, line: 3698, baseType: !1649, size: 64, align: 64, offset: 256)
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64, align: 64)
!1650 = !DISubroutineType(types: !1651)
!1651 = !{!917, !1337, !928, !937}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1640, file: !25, line: 3712, baseType: !1653, size: 64, align: 64, offset: 320)
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64, align: 64)
!1654 = !DISubroutineType(types: !1655)
!1655 = !{!917, !1337, !917, !928, !937}
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1640, file: !25, line: 3726, baseType: !1649, size: 64, align: 64, offset: 384)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1640, file: !25, line: 3737, baseType: !1384, size: 64, align: 64, offset: 448)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1640, file: !25, line: 3746, baseType: !917, size: 32, align: 32, offset: 512)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1640, file: !25, line: 3757, baseType: !1660, size: 64, align: 64, offset: 576)
!1660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1661, size: 64, align: 64)
!1661 = !DISubroutineType(types: !1662)
!1662 = !{null, !1663}
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !25, line: 3617, flags: DIFlagFwdDecl)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1640, file: !25, line: 3766, baseType: !1384, size: 64, align: 64, offset: 640)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1640, file: !25, line: 3774, baseType: !1384, size: 64, align: 64, offset: 704)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1640, file: !25, line: 3780, baseType: !917, size: 32, align: 32, offset: 768)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1640, file: !25, line: 3785, baseType: !917, size: 32, align: 32, offset: 800)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1640, file: !25, line: 3795, baseType: !1670, size: 64, align: 64, offset: 832)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{!917, !1337, !1057}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1339, file: !25, line: 2728, baseType: !976, size: 64, align: 64, offset: 5440)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1339, file: !25, line: 2735, baseType: !1192, size: 512, align: 64, offset: 5504)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1339, file: !25, line: 2742, baseType: !917, size: 32, align: 32, offset: 6016)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1339, file: !25, line: 2755, baseType: !917, size: 32, align: 32, offset: 6048)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1339, file: !25, line: 2776, baseType: !917, size: 32, align: 32, offset: 6080)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1339, file: !25, line: 2783, baseType: !917, size: 32, align: 32, offset: 6112)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1339, file: !25, line: 2791, baseType: !917, size: 32, align: 32, offset: 6144)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1339, file: !25, line: 2802, baseType: !1159, size: 64, align: 64, offset: 6208)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1339, file: !25, line: 2811, baseType: !917, size: 32, align: 32, offset: 6272)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1339, file: !25, line: 2821, baseType: !917, size: 32, align: 32, offset: 6304)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1339, file: !25, line: 2830, baseType: !917, size: 32, align: 32, offset: 6336)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1339, file: !25, line: 2840, baseType: !917, size: 32, align: 32, offset: 6368)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1339, file: !25, line: 2851, baseType: !1686, size: 64, align: 64, offset: 6400)
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64, align: 64)
!1687 = !DISubroutineType(types: !1688)
!1688 = !{!917, !1507, !1689, !976, !1450, !917, !917}
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64, align: 64)
!1690 = !DISubroutineType(types: !1691)
!1691 = !{!917, !1507, !976}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1339, file: !25, line: 2871, baseType: !1693, size: 64, align: 64, offset: 6464)
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64, align: 64)
!1694 = !DISubroutineType(types: !1695)
!1695 = !{!917, !1507, !1696, !976, !1450, !917}
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{!917, !1507, !976, !917, !917}
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1339, file: !25, line: 2878, baseType: !917, size: 32, align: 32, offset: 6528)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1339, file: !25, line: 2885, baseType: !917, size: 32, align: 32, offset: 6560)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1339, file: !25, line: 3005, baseType: !917, size: 32, align: 32, offset: 6592)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1339, file: !25, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1339, file: !25, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1339, file: !25, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1339, file: !25, line: 3037, baseType: !1067, size: 64, align: 64, offset: 6720)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1339, file: !25, line: 3038, baseType: !917, size: 32, align: 32, offset: 6784)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1339, file: !25, line: 3050, baseType: !1193, size: 64, align: 64, offset: 6848)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1339, file: !25, line: 3065, baseType: !917, size: 32, align: 32, offset: 6912)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1339, file: !25, line: 3083, baseType: !917, size: 32, align: 32, offset: 6944)
