; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--decode.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--decode.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVRational = type { i32, i32 }
%struct.anon = type { i32, i32 }

!881 = !DIFile(filename: "./libavutil/hwcontext.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!882 = !{!883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893}
!883 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_NONE", value: 0)
!884 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_VDPAU", value: 1)
!885 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_CUDA", value: 2)
!886 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_VAAPI", value: 3)
!887 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_DXVA2", value: 4)
!888 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_QSV", value: 5)
!889 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_VIDEOTOOLBOX", value: 6)
!890 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_D3D11VA", value: 7)
!891 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_DRM", value: 8)
!892 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_OPENCL", value: 9)
!893 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_MEDIACODEC", value: 10)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !57, line: 1534, size: 32, align: 32, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901}
!896 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!897 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!898 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!899 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!900 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!901 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!902 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !57, line: 810, size: 32, align: 32, elements: !903)
!903 = !{!904, !905, !906, !907, !908, !909, !910, !911, !912, !913}
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!909 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!910 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!911 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!912 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!913 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!914 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !57, line: 798, size: 32, align: 32, elements: !915)
!915 = !{!916, !917, !918, !919, !920, !921, !922}
!916 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!917 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!918 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!919 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!920 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!921 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!922 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!923 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 3406, size: 32, align: 32, elements: !924)
!924 = !{!925, !926, !927, !928}
!925 = !DIEnumerator(name: "AV_CODEC_HW_CONFIG_METHOD_HW_DEVICE_CTX", value: 1)
!926 = !DIEnumerator(name: "AV_CODEC_HW_CONFIG_METHOD_HW_FRAMES_CTX", value: 2)
!927 = !DIEnumerator(name: "AV_CODEC_HW_CONFIG_METHOD_INTERNAL", value: 4)
!928 = !DIEnumerator(name: "AV_CODEC_HW_CONFIG_METHOD_AD_HOC", value: 8)
!929 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSideDataParamChangeFlags", file: !57, line: 1522, size: 32, align: 32, elements: !930)
!930 = !{!931, !932, !933, !934}
!931 = !DIEnumerator(name: "AV_SIDE_DATA_PARAM_CHANGE_CHANNEL_COUNT", value: 1)
!932 = !DIEnumerator(name: "AV_SIDE_DATA_PARAM_CHANGE_CHANNEL_LAYOUT", value: 2)
!933 = !DIEnumerator(name: "AV_SIDE_DATA_PARAM_CHANGE_SAMPLE_RATE", value: 4)
!934 = !DIEnumerator(name: "AV_SIDE_DATA_PARAM_CHANGE_DIMENSIONS", value: 8)
!935 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !780, line: 903, size: 32, align: 32, elements: !936)
!936 = !{!937}
!937 = !DIEnumerator(name: "AV_FRAME_CROP_UNALIGNED", value: 1)
!938 = !{!939, !940, !941, !944, !1043, !962, !1063, !1084, !1091, !1098, !1199, !1201, !1202, !1186, !1204, !1206}
!939 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!940 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !942, line: 40, baseType: !943)
!942 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!943 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVHWDeviceContext", file: !881, line: 109, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWDeviceContext", file: !881, line: 60, size: 384, align: 64, elements: !947)
!947 = !{!948, !1031, !1035, !1036, !1037, !1042}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !946, file: !881, line: 64, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !953)
!953 = !{!954, !958, !963, !990, !991, !992, !993, !997, !1003, !1005, !1009}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !952, file: !26, line: 72, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !952, file: !26, line: 78, baseType: !959, size: 64, align: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!955, !962}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !952, file: !26, line: 85, baseType: !964, size: 64, align: 64, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !967)
!967 = !{!968, !969, !970, !971, !972, !986, !987, !988, !989}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !966, file: !4, line: 247, baseType: !955, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !966, file: !4, line: 253, baseType: !955, size: 64, align: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !966, file: !4, line: 259, baseType: !939, size: 32, align: 32, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !966, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !966, file: !4, line: 271, baseType: !973, size: 64, align: 64, offset: 192)
!973 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !966, file: !4, line: 265, size: 64, align: 64, elements: !974)
!974 = !{!975, !976, !978, !979}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !973, file: !4, line: 266, baseType: !941, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !973, file: !4, line: 267, baseType: !977, size: 64, align: 64)
!977 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !973, file: !4, line: 268, baseType: !955, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !973, file: !4, line: 270, baseType: !980, size: 64, align: 32)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !981, line: 61, baseType: !982)
!981 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !981, line: 58, size: 64, align: 32, elements: !983)
!983 = !{!984, !985}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !982, file: !981, line: 59, baseType: !939, size: 32, align: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !982, file: !981, line: 60, baseType: !939, size: 32, align: 32, offset: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !966, file: !4, line: 272, baseType: !977, size: 64, align: 64, offset: 256)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !966, file: !4, line: 273, baseType: !977, size: 64, align: 64, offset: 320)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !966, file: !4, line: 275, baseType: !939, size: 32, align: 32, offset: 384)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !966, file: !4, line: 300, baseType: !955, size: 64, align: 64, offset: 448)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !952, file: !26, line: 93, baseType: !939, size: 32, align: 32, offset: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !952, file: !26, line: 99, baseType: !939, size: 32, align: 32, offset: 224)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !952, file: !26, line: 108, baseType: !939, size: 32, align: 32, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !952, file: !26, line: 113, baseType: !994, size: 64, align: 64, offset: 320)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!962, !962, !962}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !952, file: !26, line: 123, baseType: !998, size: 64, align: 64, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!1001, !1001}
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !952, file: !26, line: 130, baseType: !1004, size: 32, align: 32, offset: 448)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !952, file: !26, line: 136, baseType: !1006, size: 64, align: 64, offset: 512)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!1004, !962}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !952, file: !26, line: 142, baseType: !1010, size: 64, align: 64, offset: 576)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!939, !1013, !962, !955, !939}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1016)
!1016 = !{!1017, !1029, !1030}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1015, file: !4, line: 360, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1028}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1021, file: !4, line: 307, baseType: !955, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1021, file: !4, line: 313, baseType: !977, size: 64, align: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1021, file: !4, line: 313, baseType: !977, size: 64, align: 64, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1021, file: !4, line: 318, baseType: !977, size: 64, align: 64, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1021, file: !4, line: 318, baseType: !977, size: 64, align: 64, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1021, file: !4, line: 323, baseType: !939, size: 32, align: 32, offset: 320)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1015, file: !4, line: 364, baseType: !939, size: 32, align: 32, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1015, file: !4, line: 368, baseType: !939, size: 32, align: 32, offset: 96)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !946, file: !881, line: 70, baseType: !1032, size: 64, align: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVHWDeviceInternal", file: !881, line: 41, baseType: !1034)
!1034 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWDeviceInternal", file: !881, line: 41, flags: DIFlagFwdDecl)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !946, file: !881, line: 78, baseType: !880, size: 32, align: 32, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "hwctx", scope: !946, file: !881, line: 91, baseType: !962, size: 64, align: 64, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !946, file: !881, line: 103, baseType: !1038, size: 64, align: 64, offset: 256)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{null, !1041}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "user_opaque", scope: !946, file: !881, line: 108, baseType: !962, size: 64, align: 64, offset: 320)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVHWFramesContext", file: !881, line: 229, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWFramesContext", file: !881, line: 123, size: 704, align: 64, elements: !1046)
!1046 = !{!1047, !1048, !1052, !1067, !1068, !1069, !1074, !1075, !1079, !1080, !1081, !1082, !1083}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1045, file: !881, line: 127, baseType: !949, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1045, file: !881, line: 133, baseType: !1049, size: 64, align: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVHWFramesInternal", file: !881, line: 111, baseType: !1051)
!1051 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWFramesInternal", file: !881, line: 111, flags: DIFlagFwdDecl)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "device_ref", scope: !1045, file: !881, line: 140, baseType: !1053, size: 64, align: 64, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1055, line: 94, baseType: !1056)
!1055 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1055, line: 81, size: 192, align: 64, elements: !1057)
!1057 = !{!1058, !1062, !1066}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1056, file: !1055, line: 82, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1055, line: 73, baseType: !1061)
!1061 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1055, line: 73, flags: DIFlagFwdDecl)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1056, file: !1055, line: 89, baseType: !1063, size: 64, align: 64, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !942, line: 48, baseType: !1065)
!1065 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1056, file: !1055, line: 93, baseType: !939, size: 32, align: 32, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "device_ctx", scope: !1045, file: !881, line: 148, baseType: !944, size: 64, align: 64, offset: 192)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "hwctx", scope: !1045, file: !881, line: 161, baseType: !962, size: 64, align: 64, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1045, file: !881, line: 169, baseType: !1070, size: 64, align: 64, offset: 320)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{null, !1073}
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "user_opaque", scope: !1045, file: !881, line: 174, baseType: !962, size: 64, align: 64, offset: 384)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1045, file: !881, line: 189, baseType: !1076, size: 64, align: 64, offset: 448)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1055, line: 238, baseType: !1078)
!1078 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1055, line: 238, flags: DIFlagFwdDecl)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "initial_pool_size", scope: !1045, file: !881, line: 198, baseType: !939, size: 32, align: 32, offset: 512)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1045, file: !881, line: 208, baseType: !516, size: 32, align: 32, offset: 544)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "sw_format", scope: !1045, file: !881, line: 221, baseType: !516, size: 32, align: 32, offset: 576)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1045, file: !881, line: 228, baseType: !939, size: 32, align: 32, offset: 608)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1045, file: !881, line: 228, baseType: !939, size: 32, align: 32, offset: 640)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1086)
!1086 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1087, line: 221, size: 32, align: 8, elements: !1088)
!1087 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1088 = !{!1089}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1086, file: !1087, line: 221, baseType: !1090, size: 32, align: 32)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !942, line: 51, baseType: !940)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1093)
!1093 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !1087, line: 220, size: 64, align: 8, elements: !1094)
!1094 = !{!1095}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1093, file: !1087, line: 220, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !942, line: 55, baseType: !1097)
!1097 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameDecodeData", file: !1100, line: 54, baseType: !1101)
!1100 = !DIFile(filename: "libavcodec/decode.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FrameDecodeData", file: !1100, line: 34, size: 320, align: 64, elements: !1102)
!1102 = !{!1103, !1192, !1193, !1197, !1198}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "post_process", scope: !1101, file: !1100, line: 45, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!939, !962, !1107}
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1109)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1110)
!1110 = !{!1111, !1115, !1117, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1144, !1146, !1147, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1180, !1181, !1182, !1183, !1184, !1185, !1188, !1189, !1190, !1191}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1109, file: !780, line: 282, baseType: !1112, size: 512, align: 64)
!1112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1063, size: 512, align: 64, elements: !1113)
!1113 = !{!1114}
!1114 = !DISubrange(count: 8)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1109, file: !780, line: 299, baseType: !1116, size: 256, align: 32, offset: 512)
!1116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 256, align: 32, elements: !1113)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1109, file: !780, line: 315, baseType: !1118, size: 64, align: 64, offset: 768)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1109, file: !780, line: 326, baseType: !939, size: 32, align: 32, offset: 832)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1109, file: !780, line: 326, baseType: !939, size: 32, align: 32, offset: 864)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1109, file: !780, line: 334, baseType: !939, size: 32, align: 32, offset: 896)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1109, file: !780, line: 341, baseType: !939, size: 32, align: 32, offset: 928)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1109, file: !780, line: 346, baseType: !939, size: 32, align: 32, offset: 960)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1109, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1109, file: !780, line: 356, baseType: !980, size: 64, align: 32, offset: 1024)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1109, file: !780, line: 361, baseType: !941, size: 64, align: 64, offset: 1088)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1109, file: !780, line: 369, baseType: !941, size: 64, align: 64, offset: 1152)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1109, file: !780, line: 377, baseType: !941, size: 64, align: 64, offset: 1216)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1109, file: !780, line: 382, baseType: !939, size: 32, align: 32, offset: 1280)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1109, file: !780, line: 386, baseType: !939, size: 32, align: 32, offset: 1312)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1109, file: !780, line: 391, baseType: !939, size: 32, align: 32, offset: 1344)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1109, file: !780, line: 396, baseType: !962, size: 64, align: 64, offset: 1408)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1109, file: !780, line: 403, baseType: !1134, size: 512, align: 64, offset: 1472)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1096, size: 512, align: 64, elements: !1113)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1109, file: !780, line: 410, baseType: !939, size: 32, align: 32, offset: 1984)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1109, file: !780, line: 415, baseType: !939, size: 32, align: 32, offset: 2016)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1109, file: !780, line: 420, baseType: !939, size: 32, align: 32, offset: 2048)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1109, file: !780, line: 425, baseType: !939, size: 32, align: 32, offset: 2080)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1109, file: !780, line: 435, baseType: !941, size: 64, align: 64, offset: 2112)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1109, file: !780, line: 440, baseType: !939, size: 32, align: 32, offset: 2176)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1109, file: !780, line: 445, baseType: !1096, size: 64, align: 64, offset: 2240)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1109, file: !780, line: 459, baseType: !1143, size: 512, align: 64, offset: 2304)
!1143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1053, size: 512, align: 64, elements: !1113)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1109, file: !780, line: 473, baseType: !1145, size: 64, align: 64, offset: 2816)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1109, file: !780, line: 477, baseType: !939, size: 32, align: 32, offset: 2880)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1109, file: !780, line: 479, baseType: !1148, size: 64, align: 64, offset: 2944)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1151)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1152)
!1152 = !{!1153, !1154, !1155, !1156, !1161}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1151, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1151, file: !780, line: 203, baseType: !1063, size: 64, align: 64, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1151, file: !780, line: 204, baseType: !939, size: 32, align: 32, offset: 128)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1151, file: !780, line: 205, baseType: !1157, size: 64, align: 64, offset: 192)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1159, line: 86, baseType: !1160)
!1159 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1160 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1159, line: 86, flags: DIFlagFwdDecl)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1151, file: !780, line: 206, baseType: !1053, size: 64, align: 64, offset: 256)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1109, file: !780, line: 480, baseType: !939, size: 32, align: 32, offset: 3008)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1109, file: !780, line: 505, baseType: !939, size: 32, align: 32, offset: 3040)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1109, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1109, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1109, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1109, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1109, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1109, file: !780, line: 532, baseType: !941, size: 64, align: 64, offset: 3264)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1109, file: !780, line: 539, baseType: !941, size: 64, align: 64, offset: 3328)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1109, file: !780, line: 547, baseType: !941, size: 64, align: 64, offset: 3392)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1109, file: !780, line: 554, baseType: !1157, size: 64, align: 64, offset: 3456)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1109, file: !780, line: 563, baseType: !939, size: 32, align: 32, offset: 3520)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1109, file: !780, line: 572, baseType: !939, size: 32, align: 32, offset: 3552)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1109, file: !780, line: 581, baseType: !939, size: 32, align: 32, offset: 3584)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1109, file: !780, line: 588, baseType: !1177, size: 64, align: 64, offset: 3648)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !942, line: 36, baseType: !1179)
!1179 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1109, file: !780, line: 593, baseType: !939, size: 32, align: 32, offset: 3712)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1109, file: !780, line: 596, baseType: !939, size: 32, align: 32, offset: 3744)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1109, file: !780, line: 599, baseType: !1053, size: 64, align: 64, offset: 3776)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1109, file: !780, line: 605, baseType: !1053, size: 64, align: 64, offset: 3840)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1109, file: !780, line: 616, baseType: !1053, size: 64, align: 64, offset: 3904)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1109, file: !780, line: 626, baseType: !1186, size: 64, align: 64, offset: 3968)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1187, line: 216, baseType: !1097)
!1187 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1109, file: !780, line: 627, baseType: !1186, size: 64, align: 64, offset: 4032)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1109, file: !780, line: 628, baseType: !1186, size: 64, align: 64, offset: 4096)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1109, file: !780, line: 629, baseType: !1186, size: 64, align: 64, offset: 4160)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1109, file: !780, line: 645, baseType: !1053, size: 64, align: 64, offset: 4224)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "post_process_opaque", scope: !1101, file: !1100, line: 46, baseType: !962, size: 64, align: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "post_process_opaque_free", scope: !1101, file: !1100, line: 47, baseType: !1194, size: 64, align: 64, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{null, !962}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv", scope: !1101, file: !1100, line: 52, baseType: !962, size: 64, align: 64, offset: 192)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_free", scope: !1101, file: !1100, line: 53, baseType: !1194, size: 64, align: 64, offset: 256)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1064)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !1203, line: 29, baseType: !962)
!1203 = !DIFile(filename: "/usr/include/iconv.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1207 = !{!1208}
!1208 = distinct !DIGlobalVariable(name: "sd", scope: !1209, file: !1210, line: 1700, type: !1794, isLocal: true, isDefinition: true, variable: [8 x %struct.anon]* @ff_decode_frame_props.sd)
!1209 = distinct !DISubprogram(name: "ff_decode_frame_props", scope: !1210, file: !1210, line: 1693, type: !1211, isLocal: false, isDefinition: true, scopeLine: 1694, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1793)
!1210 = !DIFile(filename: "libavcodec/decode.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!939, !1213, !1107}
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1216)
!1216 = !{!1217, !1218, !1219, !1220, !1427, !1428, !1429, !1430, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1580, !1584, !1585, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1731, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1215, file: !57, line: 1561, baseType: !949, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1215, file: !57, line: 1562, baseType: !939, size: 32, align: 32, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1215, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1215, file: !57, line: 1565, baseType: !1221, size: 64, align: 64, offset: 128)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1224)
!1224 = !{!1225, !1226, !1227, !1228, !1229, !1230, !1233, !1236, !1239, !1242, !1245, !1246, !1247, !1255, !1256, !1257, !1259, !1263, !1269, !1278, !1282, !1283, !1325, !1355, !1359, !1360, !1364, !1368, !1370, !1374, !1375, !1376}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1223, file: !57, line: 3475, baseType: !955, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1223, file: !57, line: 3480, baseType: !955, size: 64, align: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1223, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1223, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1223, file: !57, line: 3487, baseType: !939, size: 32, align: 32, offset: 192)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1223, file: !57, line: 3488, baseType: !1231, size: 64, align: 64, offset: 256)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1223, file: !57, line: 3489, baseType: !1234, size: 64, align: 64, offset: 320)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1223, file: !57, line: 3490, baseType: !1237, size: 64, align: 64, offset: 384)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1223, file: !57, line: 3491, baseType: !1240, size: 64, align: 64, offset: 448)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1223, file: !57, line: 3492, baseType: !1243, size: 64, align: 64, offset: 512)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1096)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1223, file: !57, line: 3493, baseType: !1064, size: 8, align: 8, offset: 576)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1223, file: !57, line: 3494, baseType: !949, size: 64, align: 64, offset: 640)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1223, file: !57, line: 3495, baseType: !1248, size: 64, align: 64, offset: 704)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1250)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1252)
!1252 = !{!1253, !1254}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1251, file: !57, line: 3402, baseType: !939, size: 32, align: 32)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1251, file: !57, line: 3403, baseType: !955, size: 64, align: 64, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1223, file: !57, line: 3507, baseType: !955, size: 64, align: 64, offset: 768)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1223, file: !57, line: 3516, baseType: !939, size: 32, align: 32, offset: 832)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1223, file: !57, line: 3517, baseType: !1258, size: 64, align: 64, offset: 896)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1223, file: !57, line: 3527, baseType: !1260, size: 64, align: 64, offset: 960)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!939, !1213}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1223, file: !57, line: 3535, baseType: !1264, size: 64, align: 64, offset: 1024)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!939, !1213, !1267}
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1214)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1223, file: !57, line: 3541, baseType: !1270, size: 64, align: 64, offset: 1088)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1272)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1273)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1274, line: 223, size: 128, align: 64, elements: !1275)
!1274 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1275 = !{!1276, !1277}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1273, file: !1274, line: 224, baseType: !1199, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1273, file: !1274, line: 225, baseType: !1199, size: 64, align: 64, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1223, file: !57, line: 3549, baseType: !1279, size: 64, align: 64, offset: 1152)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{null, !1258}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1223, file: !57, line: 3551, baseType: !1260, size: 64, align: 64, offset: 1216)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1223, file: !57, line: 3552, baseType: !1284, size: 64, align: 64, offset: 1280)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!939, !1213, !1063, !939, !1287}
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1289)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1290)
!1290 = !{!1291, !1294, !1295, !1296, !1297, !1324}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1289, file: !57, line: 3921, baseType: !1292, size: 16, align: 16)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !942, line: 49, baseType: !1293)
!1293 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1289, file: !57, line: 3922, baseType: !1090, size: 32, align: 32, offset: 32)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1289, file: !57, line: 3923, baseType: !1090, size: 32, align: 32, offset: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1289, file: !57, line: 3924, baseType: !940, size: 32, align: 32, offset: 96)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1289, file: !57, line: 3925, baseType: !1298, size: 64, align: 64, offset: 128)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1301)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1302)
!1302 = !{!1303, !1304, !1305, !1306, !1307, !1308, !1314, !1318, !1320, !1321, !1322, !1323}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1301, file: !57, line: 3886, baseType: !939, size: 32, align: 32)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1301, file: !57, line: 3887, baseType: !939, size: 32, align: 32, offset: 32)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1301, file: !57, line: 3888, baseType: !939, size: 32, align: 32, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1301, file: !57, line: 3889, baseType: !939, size: 32, align: 32, offset: 96)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1301, file: !57, line: 3890, baseType: !939, size: 32, align: 32, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1301, file: !57, line: 3897, baseType: !1309, size: 768, align: 64, offset: 192)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1311)
!1311 = !{!1312, !1313}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1310, file: !57, line: 3855, baseType: !1112, size: 512, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1310, file: !57, line: 3857, baseType: !1116, size: 256, align: 32, offset: 512)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1301, file: !57, line: 3903, baseType: !1315, size: 256, align: 64, offset: 960)
!1315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1063, size: 256, align: 64, elements: !1316)
!1316 = !{!1317}
!1317 = !DISubrange(count: 4)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1301, file: !57, line: 3904, baseType: !1319, size: 128, align: 32, offset: 1216)
!1319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 128, align: 32, elements: !1316)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1301, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1301, file: !57, line: 3908, baseType: !1205, size: 64, align: 64, offset: 1408)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1301, file: !57, line: 3915, baseType: !1205, size: 64, align: 64, offset: 1472)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1301, file: !57, line: 3917, baseType: !939, size: 32, align: 32, offset: 1536)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1289, file: !57, line: 3926, baseType: !941, size: 64, align: 64, offset: 192)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1223, file: !57, line: 3564, baseType: !1326, size: 64, align: 64, offset: 1344)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{!939, !1213, !1329, !1352, !1354}
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1331)
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1332)
!1332 = !{!1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1348, !1349, !1350, !1351}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1331, file: !57, line: 1451, baseType: !1053, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1331, file: !57, line: 1461, baseType: !941, size: 64, align: 64, offset: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1331, file: !57, line: 1467, baseType: !941, size: 64, align: 64, offset: 128)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1331, file: !57, line: 1468, baseType: !1063, size: 64, align: 64, offset: 192)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1331, file: !57, line: 1469, baseType: !939, size: 32, align: 32, offset: 256)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1331, file: !57, line: 1470, baseType: !939, size: 32, align: 32, offset: 288)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1331, file: !57, line: 1474, baseType: !939, size: 32, align: 32, offset: 320)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1331, file: !57, line: 1479, baseType: !1341, size: 64, align: 64, offset: 384)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1343)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1344)
!1344 = !{!1345, !1346, !1347}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1343, file: !57, line: 1412, baseType: !1063, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1343, file: !57, line: 1413, baseType: !939, size: 32, align: 32, offset: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1343, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1331, file: !57, line: 1480, baseType: !939, size: 32, align: 32, offset: 448)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1331, file: !57, line: 1486, baseType: !941, size: 64, align: 64, offset: 512)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1331, file: !57, line: 1488, baseType: !941, size: 64, align: 64, offset: 576)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1331, file: !57, line: 1497, baseType: !941, size: 64, align: 64, offset: 640)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1108)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1223, file: !57, line: 3566, baseType: !1356, size: 64, align: 64, offset: 1408)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!939, !1213, !962, !1354, !1329}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1223, file: !57, line: 3567, baseType: !1260, size: 64, align: 64, offset: 1472)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1223, file: !57, line: 3576, baseType: !1361, size: 64, align: 64, offset: 1536)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DISubroutineType(types: !1363)
!1363 = !{!939, !1213, !1352}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1223, file: !57, line: 3577, baseType: !1365, size: 64, align: 64, offset: 1600)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DISubroutineType(types: !1367)
!1367 = !{!939, !1213, !1329}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1223, file: !57, line: 3584, baseType: !1369, size: 64, align: 64, offset: 1664)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1223, file: !57, line: 3589, baseType: !1371, size: 64, align: 64, offset: 1728)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DISubroutineType(types: !1373)
!1373 = !{null, !1213}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1223, file: !57, line: 3594, baseType: !939, size: 32, align: 32, offset: 1792)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1223, file: !57, line: 3600, baseType: !955, size: 64, align: 64, offset: 1856)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1223, file: !57, line: 3609, baseType: !1377, size: 64, align: 64, offset: 1920)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1380)
!1380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !1381, line: 29, size: 192, align: 64, elements: !1382)
!1381 = !DIFile(filename: "libavcodec/hwaccel.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1382 = !{!1383, !1390}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "public", scope: !1380, file: !1381, line: 34, baseType: !1384, size: 96, align: 32)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecHWConfig", file: !57, line: 3459, baseType: !1385)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfig", file: !57, line: 3442, size: 96, align: 32, elements: !1386)
!1386 = !{!1387, !1388, !1389}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1385, file: !57, line: 3446, baseType: !516, size: 32, align: 32)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !1385, file: !57, line: 3451, baseType: !939, size: 32, align: 32, offset: 32)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "device_type", scope: !1385, file: !57, line: 3458, baseType: !880, size: 32, align: 32, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1380, file: !1381, line: 39, baseType: !1391, size: 64, align: 64, offset: 128)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1393)
!1393 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVHWAccel", file: !57, line: 3796, baseType: !1394)
!1394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1395)
!1395 = !{!1396, !1397, !1398, !1399, !1400, !1401, !1402, !1406, !1410, !1411, !1412, !1413, !1419, !1420, !1421, !1422, !1423}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1394, file: !57, line: 3642, baseType: !955, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1394, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1394, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1394, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1394, file: !57, line: 3669, baseType: !939, size: 32, align: 32, offset: 160)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1394, file: !57, line: 3682, baseType: !1369, size: 64, align: 64, offset: 192)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1394, file: !57, line: 3698, baseType: !1403, size: 64, align: 64, offset: 256)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DISubroutineType(types: !1405)
!1405 = !{!939, !1213, !1199, !1090}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1394, file: !57, line: 3712, baseType: !1407, size: 64, align: 64, offset: 320)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DISubroutineType(types: !1409)
!1409 = !{!939, !1213, !939, !1199, !1090}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1394, file: !57, line: 3726, baseType: !1403, size: 64, align: 64, offset: 384)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1394, file: !57, line: 3737, baseType: !1260, size: 64, align: 64, offset: 448)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1394, file: !57, line: 3746, baseType: !939, size: 32, align: 32, offset: 512)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1394, file: !57, line: 3757, baseType: !1414, size: 64, align: 64, offset: 576)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{null, !1417}
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !57, line: 3617, flags: DIFlagFwdDecl)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1394, file: !57, line: 3766, baseType: !1260, size: 64, align: 64, offset: 640)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1394, file: !57, line: 3774, baseType: !1260, size: 64, align: 64, offset: 704)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1394, file: !57, line: 3780, baseType: !939, size: 32, align: 32, offset: 768)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1394, file: !57, line: 3785, baseType: !939, size: 32, align: 32, offset: 800)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1394, file: !57, line: 3795, baseType: !1424, size: 64, align: 64, offset: 832)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DISubroutineType(types: !1426)
!1426 = !{!939, !1213, !1053}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1215, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1215, file: !57, line: 1581, baseType: !940, size: 32, align: 32, offset: 224)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1215, file: !57, line: 1583, baseType: !962, size: 64, align: 64, offset: 256)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1215, file: !57, line: 1591, baseType: !1431, size: 64, align: 64, offset: 320)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1274, line: 129, size: 1664, align: 64, elements: !1433)
!1433 = !{!1434, !1435, !1436, !1437, !1438, !1453, !1454, !1460, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1432, file: !1274, line: 136, baseType: !939, size: 32, align: 32)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1432, file: !1274, line: 151, baseType: !939, size: 32, align: 32, offset: 32)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1432, file: !1274, line: 157, baseType: !939, size: 32, align: 32, offset: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1432, file: !1274, line: 159, baseType: !1107, size: 64, align: 64, offset: 128)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1432, file: !1274, line: 161, baseType: !1439, size: 64, align: 64, offset: 192)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1440 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1274, line: 117, baseType: !1441)
!1441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1274, line: 100, size: 832, align: 64, elements: !1442)
!1442 = !{!1443, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1441, file: !1274, line: 105, baseType: !1444, size: 256, align: 64)
!1444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1076, size: 256, align: 64, elements: !1316)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1441, file: !1274, line: 110, baseType: !939, size: 32, align: 32, offset: 256)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1441, file: !1274, line: 111, baseType: !939, size: 32, align: 32, offset: 288)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1441, file: !1274, line: 111, baseType: !939, size: 32, align: 32, offset: 320)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1441, file: !1274, line: 112, baseType: !1116, size: 256, align: 32, offset: 352)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1441, file: !1274, line: 113, baseType: !1319, size: 128, align: 32, offset: 608)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1441, file: !1274, line: 114, baseType: !939, size: 32, align: 32, offset: 736)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1441, file: !1274, line: 115, baseType: !939, size: 32, align: 32, offset: 768)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1441, file: !1274, line: 116, baseType: !939, size: 32, align: 32, offset: 800)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1432, file: !1274, line: 163, baseType: !962, size: 64, align: 64, offset: 256)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1432, file: !1274, line: 165, baseType: !1455, size: 128, align: 64, offset: 320)
!1455 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1274, line: 122, baseType: !1456)
!1456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1274, line: 119, size: 128, align: 64, elements: !1457)
!1457 = !{!1458, !1459}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1456, file: !1274, line: 120, baseType: !1329, size: 64, align: 64)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1456, file: !1274, line: 121, baseType: !1107, size: 64, align: 64, offset: 64)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1432, file: !1274, line: 166, baseType: !1461, size: 128, align: 64, offset: 448)
!1461 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1274, line: 127, baseType: !1462)
!1462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1274, line: 124, size: 128, align: 64, elements: !1463)
!1463 = !{!1464, !1537}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1462, file: !1274, line: 125, baseType: !1465, size: 64, align: 64)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1468)
!1468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1469)
!1469 = !{!1470, !1471, !1495, !1499, !1500, !1534, !1535, !1536}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1468, file: !57, line: 5751, baseType: !949, size: 64, align: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1468, file: !57, line: 5756, baseType: !1472, size: 64, align: 64, offset: 64)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1474)
!1474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1475)
!1475 = !{!1476, !1477, !1480, !1481, !1482, !1486, !1490, !1494}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1474, file: !57, line: 5797, baseType: !955, size: 64, align: 64)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1474, file: !57, line: 5804, baseType: !1478, size: 64, align: 64, offset: 64)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1474, file: !57, line: 5815, baseType: !949, size: 64, align: 64, offset: 128)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1474, file: !57, line: 5825, baseType: !939, size: 32, align: 32, offset: 192)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1474, file: !57, line: 5826, baseType: !1483, size: 64, align: 64, offset: 256)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DISubroutineType(types: !1485)
!1485 = !{!939, !1466}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1474, file: !57, line: 5827, baseType: !1487, size: 64, align: 64, offset: 320)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DISubroutineType(types: !1489)
!1489 = !{!939, !1466, !1329}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1474, file: !57, line: 5828, baseType: !1491, size: 64, align: 64, offset: 384)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{null, !1466}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1474, file: !57, line: 5829, baseType: !1491, size: 64, align: 64, offset: 448)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1468, file: !57, line: 5762, baseType: !1496, size: 64, align: 64, offset: 128)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1498)
!1498 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1468, file: !57, line: 5768, baseType: !962, size: 64, align: 64, offset: 192)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1468, file: !57, line: 5775, baseType: !1501, size: 64, align: 64, offset: 256)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1503)
!1503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1504)
!1504 = !{!1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1503, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1503, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1503, file: !57, line: 3948, baseType: !1090, size: 32, align: 32, offset: 64)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1503, file: !57, line: 3958, baseType: !1063, size: 64, align: 64, offset: 128)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1503, file: !57, line: 3962, baseType: !939, size: 32, align: 32, offset: 192)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1503, file: !57, line: 3968, baseType: !939, size: 32, align: 32, offset: 224)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1503, file: !57, line: 3973, baseType: !941, size: 64, align: 64, offset: 256)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1503, file: !57, line: 3986, baseType: !939, size: 32, align: 32, offset: 320)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1503, file: !57, line: 3999, baseType: !939, size: 32, align: 32, offset: 352)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1503, file: !57, line: 4004, baseType: !939, size: 32, align: 32, offset: 384)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1503, file: !57, line: 4005, baseType: !939, size: 32, align: 32, offset: 416)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1503, file: !57, line: 4010, baseType: !939, size: 32, align: 32, offset: 448)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1503, file: !57, line: 4011, baseType: !939, size: 32, align: 32, offset: 480)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1503, file: !57, line: 4020, baseType: !980, size: 64, align: 32, offset: 512)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1503, file: !57, line: 4025, baseType: !894, size: 32, align: 32, offset: 576)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1503, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1503, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1503, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1503, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1503, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1503, file: !57, line: 4039, baseType: !939, size: 32, align: 32, offset: 768)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1503, file: !57, line: 4046, baseType: !1096, size: 64, align: 64, offset: 832)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1503, file: !57, line: 4050, baseType: !939, size: 32, align: 32, offset: 896)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1503, file: !57, line: 4054, baseType: !939, size: 32, align: 32, offset: 928)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1503, file: !57, line: 4061, baseType: !939, size: 32, align: 32, offset: 960)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1503, file: !57, line: 4065, baseType: !939, size: 32, align: 32, offset: 992)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1503, file: !57, line: 4073, baseType: !939, size: 32, align: 32, offset: 1024)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1503, file: !57, line: 4080, baseType: !939, size: 32, align: 32, offset: 1056)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1503, file: !57, line: 4084, baseType: !939, size: 32, align: 32, offset: 1088)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1468, file: !57, line: 5781, baseType: !1501, size: 64, align: 64, offset: 320)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1468, file: !57, line: 5787, baseType: !980, size: 64, align: 32, offset: 384)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1468, file: !57, line: 5793, baseType: !980, size: 64, align: 32, offset: 448)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1462, file: !1274, line: 126, baseType: !939, size: 32, align: 32, offset: 64)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1432, file: !1274, line: 172, baseType: !1329, size: 64, align: 64, offset: 576)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1432, file: !1274, line: 177, baseType: !1063, size: 64, align: 64, offset: 640)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1432, file: !1274, line: 178, baseType: !940, size: 32, align: 32, offset: 704)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1432, file: !1274, line: 180, baseType: !962, size: 64, align: 64, offset: 768)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1432, file: !1274, line: 185, baseType: !939, size: 32, align: 32, offset: 832)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1432, file: !1274, line: 190, baseType: !962, size: 64, align: 64, offset: 896)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1432, file: !1274, line: 195, baseType: !939, size: 32, align: 32, offset: 960)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1432, file: !1274, line: 200, baseType: !1329, size: 64, align: 64, offset: 1024)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1432, file: !1274, line: 201, baseType: !939, size: 32, align: 32, offset: 1088)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1432, file: !1274, line: 202, baseType: !1107, size: 64, align: 64, offset: 1152)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1432, file: !1274, line: 203, baseType: !939, size: 32, align: 32, offset: 1216)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1432, file: !1274, line: 205, baseType: !939, size: 32, align: 32, offset: 1248)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1432, file: !1274, line: 206, baseType: !939, size: 32, align: 32, offset: 1280)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1432, file: !1274, line: 209, baseType: !1186, size: 64, align: 64, offset: 1344)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1432, file: !1274, line: 212, baseType: !1186, size: 64, align: 64, offset: 1408)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1432, file: !1274, line: 213, baseType: !1107, size: 64, align: 64, offset: 1472)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1432, file: !1274, line: 215, baseType: !939, size: 32, align: 32, offset: 1536)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1432, file: !1274, line: 217, baseType: !939, size: 32, align: 32, offset: 1568)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1432, file: !1274, line: 220, baseType: !939, size: 32, align: 32, offset: 1600)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1215, file: !57, line: 1598, baseType: !962, size: 64, align: 64, offset: 384)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1215, file: !57, line: 1606, baseType: !941, size: 64, align: 64, offset: 448)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1215, file: !57, line: 1614, baseType: !939, size: 32, align: 32, offset: 512)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1215, file: !57, line: 1622, baseType: !939, size: 32, align: 32, offset: 544)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1215, file: !57, line: 1628, baseType: !939, size: 32, align: 32, offset: 576)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1215, file: !57, line: 1636, baseType: !939, size: 32, align: 32, offset: 608)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1215, file: !57, line: 1643, baseType: !939, size: 32, align: 32, offset: 640)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1215, file: !57, line: 1657, baseType: !1063, size: 64, align: 64, offset: 704)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1215, file: !57, line: 1658, baseType: !939, size: 32, align: 32, offset: 768)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1215, file: !57, line: 1679, baseType: !980, size: 64, align: 32, offset: 800)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1215, file: !57, line: 1688, baseType: !939, size: 32, align: 32, offset: 864)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1215, file: !57, line: 1712, baseType: !939, size: 32, align: 32, offset: 896)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1215, file: !57, line: 1729, baseType: !939, size: 32, align: 32, offset: 928)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1215, file: !57, line: 1729, baseType: !939, size: 32, align: 32, offset: 960)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1215, file: !57, line: 1744, baseType: !939, size: 32, align: 32, offset: 992)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1215, file: !57, line: 1744, baseType: !939, size: 32, align: 32, offset: 1024)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1215, file: !57, line: 1751, baseType: !939, size: 32, align: 32, offset: 1056)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1215, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1215, file: !57, line: 1791, baseType: !1576, size: 64, align: 64, offset: 1152)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DISubroutineType(types: !1578)
!1578 = !{null, !1579, !1352, !1354, !939, !939, !939}
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1215, file: !57, line: 1808, baseType: !1581, size: 64, align: 64, offset: 1216)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64, align: 64)
!1582 = !DISubroutineType(types: !1583)
!1583 = !{!516, !1579, !1234}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1215, file: !57, line: 1816, baseType: !939, size: 32, align: 32, offset: 1280)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1215, file: !57, line: 1825, baseType: !1586, size: 32, align: 32, offset: 1312)
!1586 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1215, file: !57, line: 1830, baseType: !939, size: 32, align: 32, offset: 1344)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1215, file: !57, line: 1838, baseType: !1586, size: 32, align: 32, offset: 1376)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1215, file: !57, line: 1846, baseType: !939, size: 32, align: 32, offset: 1408)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1215, file: !57, line: 1851, baseType: !939, size: 32, align: 32, offset: 1440)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1215, file: !57, line: 1861, baseType: !1586, size: 32, align: 32, offset: 1472)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1215, file: !57, line: 1868, baseType: !1586, size: 32, align: 32, offset: 1504)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1215, file: !57, line: 1875, baseType: !1586, size: 32, align: 32, offset: 1536)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1215, file: !57, line: 1882, baseType: !1586, size: 32, align: 32, offset: 1568)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1215, file: !57, line: 1889, baseType: !1586, size: 32, align: 32, offset: 1600)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1215, file: !57, line: 1896, baseType: !1586, size: 32, align: 32, offset: 1632)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1215, file: !57, line: 1903, baseType: !1586, size: 32, align: 32, offset: 1664)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1215, file: !57, line: 1910, baseType: !939, size: 32, align: 32, offset: 1696)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1215, file: !57, line: 1915, baseType: !939, size: 32, align: 32, offset: 1728)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1215, file: !57, line: 1926, baseType: !1354, size: 64, align: 64, offset: 1792)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1215, file: !57, line: 1935, baseType: !980, size: 64, align: 32, offset: 1856)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1215, file: !57, line: 1942, baseType: !939, size: 32, align: 32, offset: 1920)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1215, file: !57, line: 1948, baseType: !939, size: 32, align: 32, offset: 1952)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1215, file: !57, line: 1954, baseType: !939, size: 32, align: 32, offset: 1984)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1215, file: !57, line: 1960, baseType: !939, size: 32, align: 32, offset: 2016)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1215, file: !57, line: 1984, baseType: !939, size: 32, align: 32, offset: 2048)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1215, file: !57, line: 1991, baseType: !939, size: 32, align: 32, offset: 2080)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1215, file: !57, line: 1996, baseType: !939, size: 32, align: 32, offset: 2112)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1215, file: !57, line: 2004, baseType: !939, size: 32, align: 32, offset: 2144)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1215, file: !57, line: 2011, baseType: !939, size: 32, align: 32, offset: 2176)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1215, file: !57, line: 2018, baseType: !939, size: 32, align: 32, offset: 2208)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1215, file: !57, line: 2027, baseType: !939, size: 32, align: 32, offset: 2240)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1215, file: !57, line: 2034, baseType: !939, size: 32, align: 32, offset: 2272)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1215, file: !57, line: 2044, baseType: !939, size: 32, align: 32, offset: 2304)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1215, file: !57, line: 2054, baseType: !1616, size: 64, align: 64, offset: 2368)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1215, file: !57, line: 2061, baseType: !1616, size: 64, align: 64, offset: 2432)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1215, file: !57, line: 2066, baseType: !939, size: 32, align: 32, offset: 2496)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1215, file: !57, line: 2070, baseType: !939, size: 32, align: 32, offset: 2528)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1215, file: !57, line: 2078, baseType: !939, size: 32, align: 32, offset: 2560)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1215, file: !57, line: 2085, baseType: !939, size: 32, align: 32, offset: 2592)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1215, file: !57, line: 2092, baseType: !939, size: 32, align: 32, offset: 2624)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1215, file: !57, line: 2099, baseType: !939, size: 32, align: 32, offset: 2656)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1215, file: !57, line: 2106, baseType: !939, size: 32, align: 32, offset: 2688)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1215, file: !57, line: 2113, baseType: !939, size: 32, align: 32, offset: 2720)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1215, file: !57, line: 2120, baseType: !939, size: 32, align: 32, offset: 2752)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1215, file: !57, line: 2125, baseType: !939, size: 32, align: 32, offset: 2784)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1215, file: !57, line: 2133, baseType: !939, size: 32, align: 32, offset: 2816)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1215, file: !57, line: 2140, baseType: !939, size: 32, align: 32, offset: 2848)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1215, file: !57, line: 2145, baseType: !939, size: 32, align: 32, offset: 2880)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1215, file: !57, line: 2153, baseType: !939, size: 32, align: 32, offset: 2912)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1215, file: !57, line: 2158, baseType: !939, size: 32, align: 32, offset: 2944)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1215, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1215, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1215, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1215, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1215, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1215, file: !57, line: 2203, baseType: !939, size: 32, align: 32, offset: 3136)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1215, file: !57, line: 2209, baseType: !894, size: 32, align: 32, offset: 3168)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1215, file: !57, line: 2212, baseType: !939, size: 32, align: 32, offset: 3200)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1215, file: !57, line: 2213, baseType: !939, size: 32, align: 32, offset: 3232)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1215, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1215, file: !57, line: 2232, baseType: !939, size: 32, align: 32, offset: 3296)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1215, file: !57, line: 2243, baseType: !939, size: 32, align: 32, offset: 3328)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1215, file: !57, line: 2249, baseType: !939, size: 32, align: 32, offset: 3360)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1215, file: !57, line: 2256, baseType: !939, size: 32, align: 32, offset: 3392)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1215, file: !57, line: 2263, baseType: !1096, size: 64, align: 64, offset: 3456)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1215, file: !57, line: 2270, baseType: !1096, size: 64, align: 64, offset: 3520)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1215, file: !57, line: 2277, baseType: !902, size: 32, align: 32, offset: 3584)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1215, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1215, file: !57, line: 2367, baseType: !1652, size: 64, align: 64, offset: 3648)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{!939, !1579, !1107, !939}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1215, file: !57, line: 2383, baseType: !939, size: 32, align: 32, offset: 3712)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1215, file: !57, line: 2386, baseType: !1586, size: 32, align: 32, offset: 3744)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1215, file: !57, line: 2387, baseType: !1586, size: 32, align: 32, offset: 3776)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1215, file: !57, line: 2394, baseType: !939, size: 32, align: 32, offset: 3808)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1215, file: !57, line: 2401, baseType: !939, size: 32, align: 32, offset: 3840)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1215, file: !57, line: 2408, baseType: !939, size: 32, align: 32, offset: 3872)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1215, file: !57, line: 2415, baseType: !939, size: 32, align: 32, offset: 3904)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1215, file: !57, line: 2422, baseType: !939, size: 32, align: 32, offset: 3936)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1215, file: !57, line: 2423, baseType: !1664, size: 64, align: 64, offset: 3968)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64, align: 64)
!1665 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1666)
!1666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1667)
!1667 = !{!1668, !1669, !1670, !1671}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1666, file: !57, line: 827, baseType: !939, size: 32, align: 32)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1666, file: !57, line: 828, baseType: !939, size: 32, align: 32, offset: 32)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1666, file: !57, line: 829, baseType: !939, size: 32, align: 32, offset: 64)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1666, file: !57, line: 830, baseType: !1586, size: 32, align: 32, offset: 96)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1215, file: !57, line: 2430, baseType: !941, size: 64, align: 64, offset: 4032)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1215, file: !57, line: 2437, baseType: !941, size: 64, align: 64, offset: 4096)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1215, file: !57, line: 2444, baseType: !1586, size: 32, align: 32, offset: 4160)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1215, file: !57, line: 2451, baseType: !1586, size: 32, align: 32, offset: 4192)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1215, file: !57, line: 2458, baseType: !939, size: 32, align: 32, offset: 4224)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1215, file: !57, line: 2469, baseType: !939, size: 32, align: 32, offset: 4256)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1215, file: !57, line: 2475, baseType: !939, size: 32, align: 32, offset: 4288)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1215, file: !57, line: 2481, baseType: !939, size: 32, align: 32, offset: 4320)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1215, file: !57, line: 2485, baseType: !939, size: 32, align: 32, offset: 4352)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1215, file: !57, line: 2489, baseType: !939, size: 32, align: 32, offset: 4384)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1215, file: !57, line: 2493, baseType: !939, size: 32, align: 32, offset: 4416)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1215, file: !57, line: 2501, baseType: !939, size: 32, align: 32, offset: 4448)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1215, file: !57, line: 2506, baseType: !939, size: 32, align: 32, offset: 4480)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1215, file: !57, line: 2510, baseType: !939, size: 32, align: 32, offset: 4512)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1215, file: !57, line: 2514, baseType: !941, size: 64, align: 64, offset: 4544)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1215, file: !57, line: 2528, baseType: !1688, size: 64, align: 64, offset: 4608)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{null, !1579, !962, !939, !939}
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1215, file: !57, line: 2534, baseType: !939, size: 32, align: 32, offset: 4672)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1215, file: !57, line: 2545, baseType: !939, size: 32, align: 32, offset: 4704)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1215, file: !57, line: 2547, baseType: !939, size: 32, align: 32, offset: 4736)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1215, file: !57, line: 2549, baseType: !939, size: 32, align: 32, offset: 4768)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1215, file: !57, line: 2551, baseType: !939, size: 32, align: 32, offset: 4800)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1215, file: !57, line: 2553, baseType: !939, size: 32, align: 32, offset: 4832)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1215, file: !57, line: 2555, baseType: !939, size: 32, align: 32, offset: 4864)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1215, file: !57, line: 2557, baseType: !939, size: 32, align: 32, offset: 4896)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1215, file: !57, line: 2559, baseType: !939, size: 32, align: 32, offset: 4928)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1215, file: !57, line: 2563, baseType: !939, size: 32, align: 32, offset: 4960)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1215, file: !57, line: 2571, baseType: !1205, size: 64, align: 64, offset: 4992)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1215, file: !57, line: 2579, baseType: !1205, size: 64, align: 64, offset: 5056)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1215, file: !57, line: 2586, baseType: !939, size: 32, align: 32, offset: 5120)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1215, file: !57, line: 2615, baseType: !939, size: 32, align: 32, offset: 5152)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1215, file: !57, line: 2627, baseType: !939, size: 32, align: 32, offset: 5184)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1215, file: !57, line: 2637, baseType: !939, size: 32, align: 32, offset: 5216)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1215, file: !57, line: 2681, baseType: !939, size: 32, align: 32, offset: 5248)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1215, file: !57, line: 2709, baseType: !941, size: 64, align: 64, offset: 5312)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1215, file: !57, line: 2716, baseType: !1710, size: 64, align: 64, offset: 5376)
!1710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1711, size: 64, align: 64)
!1711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1394)
