; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--hq_hqadata.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--hq_hqadata.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.HQProfile = type { i8*, i32, i32, i32, i32, i32 }
%struct.HQContext = type { %struct.AVCodecContext*, %struct.HQDSPContext, %struct.GetByteContext, %struct.VLC, %struct.VLC, [8 x i8], [12 x [64 x i16]] }

!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !35, line: 810, size: 32, align: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !{!888, !901, !908, !913, !914, !919, !935, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1020, !1024, !1028, !1032, !1036, !1040, !1044, !1048, !1052, !1056, !1060, !1064, !1068, !1072, !1076, !1080, !1084, !1088, !1092, !1096, !1100, !1103}
!888 = distinct !DIGlobalVariable(name: "ff_hq_quants", scope: !0, file: !889, line: 1126, type: !890, isLocal: false, isDefinition: true, variable: [16 x [2 x [4 x i32*]]]* @ff_hq_quants)
!889 = !DIFile(filename: "libavcodec/hq_hqadata.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !891, size: 8192, align: 64, elements: !897)
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64, align: 64)
!893 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !894)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !895, line: 38, baseType: !896)
!895 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!896 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!897 = !{!898, !899, !900}
!898 = !DISubrange(count: 16)
!899 = !DISubrange(count: 2)
!900 = !DISubrange(count: 4)
!901 = distinct !DIGlobalVariable(name: "ff_hq_ac_bits", scope: !0, file: !889, line: 1145, type: !902, isLocal: false, isDefinition: true, variable: [746 x i8]* @ff_hq_ac_bits)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 5968, align: 8, elements: !906)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !895, line: 48, baseType: !905)
!905 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!906 = !{!907}
!907 = !DISubrange(count: 746)
!908 = distinct !DIGlobalVariable(name: "ff_hq_ac_codes", scope: !0, file: !889, line: 1195, type: !909, isLocal: false, isDefinition: true, variable: [746 x i16]* @ff_hq_ac_codes)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 11936, align: 16, elements: !906)
!910 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !895, line: 49, baseType: !912)
!912 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!913 = distinct !DIGlobalVariable(name: "ff_hq_ac_skips", scope: !0, file: !889, line: 1292, type: !902, isLocal: false, isDefinition: true, variable: [746 x i8]* @ff_hq_ac_skips)
!914 = distinct !DIGlobalVariable(name: "ff_hq_ac_syms", scope: !0, file: !889, line: 1342, type: !915, isLocal: false, isDefinition: true, variable: [746 x i16]* @ff_hq_ac_syms)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !916, size: 11936, align: 16, elements: !906)
!916 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !895, line: 37, baseType: !918)
!918 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!919 = distinct !DIGlobalVariable(name: "ff_hq_profile", scope: !0, file: !889, line: 8343, type: !920, isLocal: false, isDefinition: true, variable: [22 x %struct.HQProfile]* @ff_hq_profile)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !921, size: 5632, align: 64, elements: !933)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !922)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "HQProfile", file: !923, line: 50, baseType: !924)
!923 = !DIFile(filename: "libavcodec/hq_hqa.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HQProfile", file: !923, line: 45, size: 256, align: 64, elements: !925)
!925 = !{!926, !928, !929, !930, !931, !932}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "perm_tab", scope: !924, file: !923, line: 46, baseType: !927, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64, align: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !924, file: !923, line: 47, baseType: !896, size: 32, align: 32, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !924, file: !923, line: 47, baseType: !896, size: 32, align: 32, offset: 96)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "num_slices", scope: !924, file: !923, line: 48, baseType: !896, size: 32, align: 32, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "tab_w", scope: !924, file: !923, line: 49, baseType: !896, size: 32, align: 32, offset: 160)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "tab_h", scope: !924, file: !923, line: 49, baseType: !896, size: 32, align: 32, offset: 192)
!933 = !{!934}
!934 = !DISubrange(count: 22)
!935 = distinct !DIGlobalVariable(name: "qmat00", scope: !0, file: !889, line: 34, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat00)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !893, size: 2048, align: 32, elements: !937)
!937 = !{!938}
!938 = !DISubrange(count: 64)
!939 = distinct !DIGlobalVariable(name: "qmat02", scope: !0, file: !889, line: 62, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat02)
!940 = distinct !DIGlobalVariable(name: "qmat06", scope: !0, file: !889, line: 118, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat06)
!941 = distinct !DIGlobalVariable(name: "qmat0E", scope: !0, file: !889, line: 230, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat0E)
!942 = distinct !DIGlobalVariable(name: "qmat01", scope: !0, file: !889, line: 48, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat01)
!943 = distinct !DIGlobalVariable(name: "qmat03", scope: !0, file: !889, line: 76, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat03)
!944 = distinct !DIGlobalVariable(name: "qmat07", scope: !0, file: !889, line: 132, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat07)
!945 = distinct !DIGlobalVariable(name: "qmat0F", scope: !0, file: !889, line: 244, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat0F)
!946 = distinct !DIGlobalVariable(name: "qmat16", scope: !0, file: !889, line: 342, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat16)
!947 = distinct !DIGlobalVariable(name: "qmat17", scope: !0, file: !889, line: 356, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat17)
!948 = distinct !DIGlobalVariable(name: "qmat04", scope: !0, file: !889, line: 90, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat04)
!949 = distinct !DIGlobalVariable(name: "qmat0A", scope: !0, file: !889, line: 174, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat0A)
!950 = distinct !DIGlobalVariable(name: "qmat12", scope: !0, file: !889, line: 286, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat12)
!951 = distinct !DIGlobalVariable(name: "qmat1E", scope: !0, file: !889, line: 454, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat1E)
!952 = distinct !DIGlobalVariable(name: "qmat05", scope: !0, file: !889, line: 104, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat05)
!953 = distinct !DIGlobalVariable(name: "qmat0B", scope: !0, file: !889, line: 188, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat0B)
!954 = distinct !DIGlobalVariable(name: "qmat13", scope: !0, file: !889, line: 300, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat13)
!955 = distinct !DIGlobalVariable(name: "qmat1F", scope: !0, file: !889, line: 468, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat1F)
!956 = distinct !DIGlobalVariable(name: "qmat22", scope: !0, file: !889, line: 510, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat22)
!957 = distinct !DIGlobalVariable(name: "qmat23", scope: !0, file: !889, line: 524, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat23)
!958 = distinct !DIGlobalVariable(name: "qmat08", scope: !0, file: !889, line: 146, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat08)
!959 = distinct !DIGlobalVariable(name: "qmat10", scope: !0, file: !889, line: 258, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat10)
!960 = distinct !DIGlobalVariable(name: "qmat1A", scope: !0, file: !889, line: 398, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat1A)
!961 = distinct !DIGlobalVariable(name: "qmat26", scope: !0, file: !889, line: 566, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat26)
!962 = distinct !DIGlobalVariable(name: "qmat09", scope: !0, file: !889, line: 160, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat09)
!963 = distinct !DIGlobalVariable(name: "qmat11", scope: !0, file: !889, line: 272, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat11)
!964 = distinct !DIGlobalVariable(name: "qmat1B", scope: !0, file: !889, line: 412, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat1B)
!965 = distinct !DIGlobalVariable(name: "qmat27", scope: !0, file: !889, line: 580, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat27)
!966 = distinct !DIGlobalVariable(name: "qmat2A", scope: !0, file: !889, line: 622, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat2A)
!967 = distinct !DIGlobalVariable(name: "qmat2B", scope: !0, file: !889, line: 636, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat2B)
!968 = distinct !DIGlobalVariable(name: "qmat0C", scope: !0, file: !889, line: 202, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat0C)
!969 = distinct !DIGlobalVariable(name: "qmat14", scope: !0, file: !889, line: 314, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat14)
!970 = distinct !DIGlobalVariable(name: "qmat20", scope: !0, file: !889, line: 482, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat20)
!971 = distinct !DIGlobalVariable(name: "qmat2E", scope: !0, file: !889, line: 678, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat2E)
!972 = distinct !DIGlobalVariable(name: "qmat0D", scope: !0, file: !889, line: 216, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat0D)
!973 = distinct !DIGlobalVariable(name: "qmat15", scope: !0, file: !889, line: 328, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat15)
!974 = distinct !DIGlobalVariable(name: "qmat21", scope: !0, file: !889, line: 496, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat21)
!975 = distinct !DIGlobalVariable(name: "qmat2F", scope: !0, file: !889, line: 692, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat2F)
!976 = distinct !DIGlobalVariable(name: "qmat30", scope: !0, file: !889, line: 706, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat30)
!977 = distinct !DIGlobalVariable(name: "qmat31", scope: !0, file: !889, line: 720, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat31)
!978 = distinct !DIGlobalVariable(name: "qmat3E", scope: !0, file: !889, line: 902, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat3E)
!979 = distinct !DIGlobalVariable(name: "qmat3F", scope: !0, file: !889, line: 916, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat3F)
!980 = distinct !DIGlobalVariable(name: "qmat18", scope: !0, file: !889, line: 370, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat18)
!981 = distinct !DIGlobalVariable(name: "qmat24", scope: !0, file: !889, line: 538, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat24)
!982 = distinct !DIGlobalVariable(name: "qmat32", scope: !0, file: !889, line: 734, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat32)
!983 = distinct !DIGlobalVariable(name: "qmat40", scope: !0, file: !889, line: 930, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat40)
!984 = distinct !DIGlobalVariable(name: "qmat19", scope: !0, file: !889, line: 384, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat19)
!985 = distinct !DIGlobalVariable(name: "qmat25", scope: !0, file: !889, line: 552, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat25)
!986 = distinct !DIGlobalVariable(name: "qmat33", scope: !0, file: !889, line: 748, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat33)
!987 = distinct !DIGlobalVariable(name: "qmat41", scope: !0, file: !889, line: 944, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat41)
!988 = distinct !DIGlobalVariable(name: "qmat34", scope: !0, file: !889, line: 762, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat34)
!989 = distinct !DIGlobalVariable(name: "qmat42", scope: !0, file: !889, line: 958, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat42)
!990 = distinct !DIGlobalVariable(name: "qmat35", scope: !0, file: !889, line: 776, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat35)
!991 = distinct !DIGlobalVariable(name: "qmat43", scope: !0, file: !889, line: 972, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat43)
!992 = distinct !DIGlobalVariable(name: "qmat1C", scope: !0, file: !889, line: 426, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat1C)
!993 = distinct !DIGlobalVariable(name: "qmat28", scope: !0, file: !889, line: 594, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat28)
!994 = distinct !DIGlobalVariable(name: "qmat36", scope: !0, file: !889, line: 790, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat36)
!995 = distinct !DIGlobalVariable(name: "qmat44", scope: !0, file: !889, line: 986, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat44)
!996 = distinct !DIGlobalVariable(name: "qmat1D", scope: !0, file: !889, line: 440, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat1D)
!997 = distinct !DIGlobalVariable(name: "qmat29", scope: !0, file: !889, line: 608, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat29)
!998 = distinct !DIGlobalVariable(name: "qmat37", scope: !0, file: !889, line: 804, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat37)
!999 = distinct !DIGlobalVariable(name: "qmat45", scope: !0, file: !889, line: 1000, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat45)
!1000 = distinct !DIGlobalVariable(name: "qmat38", scope: !0, file: !889, line: 818, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat38)
!1001 = distinct !DIGlobalVariable(name: "qmat46", scope: !0, file: !889, line: 1014, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat46)
!1002 = distinct !DIGlobalVariable(name: "qmat39", scope: !0, file: !889, line: 832, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat39)
!1003 = distinct !DIGlobalVariable(name: "qmat47", scope: !0, file: !889, line: 1028, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat47)
!1004 = distinct !DIGlobalVariable(name: "qmat3C", scope: !0, file: !889, line: 874, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat3C)
!1005 = distinct !DIGlobalVariable(name: "qmat4A", scope: !0, file: !889, line: 1070, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat4A)
!1006 = distinct !DIGlobalVariable(name: "qmat3D", scope: !0, file: !889, line: 888, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat3D)
!1007 = distinct !DIGlobalVariable(name: "qmat4B", scope: !0, file: !889, line: 1084, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat4B)
!1008 = distinct !DIGlobalVariable(name: "qmat2C", scope: !0, file: !889, line: 650, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat2C)
!1009 = distinct !DIGlobalVariable(name: "qmat3A", scope: !0, file: !889, line: 846, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat3A)
!1010 = distinct !DIGlobalVariable(name: "qmat48", scope: !0, file: !889, line: 1042, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat48)
!1011 = distinct !DIGlobalVariable(name: "qmat4C", scope: !0, file: !889, line: 1098, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat4C)
!1012 = distinct !DIGlobalVariable(name: "qmat2D", scope: !0, file: !889, line: 664, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat2D)
!1013 = distinct !DIGlobalVariable(name: "qmat3B", scope: !0, file: !889, line: 860, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat3B)
!1014 = distinct !DIGlobalVariable(name: "qmat49", scope: !0, file: !889, line: 1056, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat49)
!1015 = distinct !DIGlobalVariable(name: "qmat4D", scope: !0, file: !889, line: 1112, type: !936, isLocal: true, isDefinition: true, variable: [64 x i32]* @qmat4D)
!1016 = distinct !DIGlobalVariable(name: "hq_tab_11", scope: !0, file: !889, line: 5724, type: !1017, isLocal: true, isDefinition: true, variable: [160 x i8]* @hq_tab_11)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 1280, align: 8, elements: !1018)
!1018 = !{!1019}
!1019 = !DISubrange(count: 160)
!1020 = distinct !DIGlobalVariable(name: "hq_tab_01", scope: !0, file: !889, line: 1440, type: !1021, isLocal: true, isDefinition: true, variable: [2700 x i8]* @hq_tab_01)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 21600, align: 8, elements: !1022)
!1022 = !{!1023}
!1023 = !DISubrange(count: 2700)
!1024 = distinct !DIGlobalVariable(name: "hq_tab_02", scope: !0, file: !889, line: 1623, type: !1025, isLocal: true, isDefinition: true, variable: [2792 x i8]* @hq_tab_02)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 22336, align: 8, elements: !1026)
!1026 = !{!1027}
!1027 = !DISubrange(count: 2792)
!1028 = distinct !DIGlobalVariable(name: "hq_tab_03", scope: !0, file: !889, line: 1813, type: !1029, isLocal: true, isDefinition: true, variable: [3240 x i8]* @hq_tab_03)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 25920, align: 8, elements: !1030)
!1030 = !{!1031}
!1031 = !DISubrange(count: 3240)
!1032 = distinct !DIGlobalVariable(name: "hq_tab_04", scope: !0, file: !889, line: 2032, type: !1033, isLocal: true, isDefinition: true, variable: [5400 x i8]* @hq_tab_04)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 43200, align: 8, elements: !1034)
!1034 = !{!1035}
!1035 = !DISubrange(count: 5400)
!1036 = distinct !DIGlobalVariable(name: "hq_tab_05", scope: !0, file: !889, line: 2395, type: !1037, isLocal: true, isDefinition: true, variable: [7200 x i8]* @hq_tab_05)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 57600, align: 8, elements: !1038)
!1038 = !{!1039}
!1039 = !DISubrange(count: 7200)
!1040 = distinct !DIGlobalVariable(name: "hq_tab_06", scope: !0, file: !889, line: 2878, type: !1041, isLocal: true, isDefinition: true, variable: [10880 x i8]* @hq_tab_06)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 87040, align: 8, elements: !1042)
!1042 = !{!1043}
!1043 = !DISubrange(count: 10880)
!1044 = distinct !DIGlobalVariable(name: "hq_tab_07", scope: !0, file: !889, line: 3607, type: !1045, isLocal: true, isDefinition: true, variable: [12240 x i8]* @hq_tab_07)
!1045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 97920, align: 8, elements: !1046)
!1046 = !{!1047}
!1047 = !DISubrange(count: 12240)
!1048 = distinct !DIGlobalVariable(name: "hq_tab_08", scope: !0, file: !889, line: 4426, type: !1049, isLocal: true, isDefinition: true, variable: [16328 x i8]* @hq_tab_08)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 130624, align: 8, elements: !1050)
!1050 = !{!1051}
!1051 = !DISubrange(count: 16328)
!1052 = distinct !DIGlobalVariable(name: "hq_tab_09", scope: !0, file: !889, line: 5518, type: !1053, isLocal: true, isDefinition: true, variable: [2400 x i8]* @hq_tab_09)
!1053 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 19200, align: 8, elements: !1054)
!1054 = !{!1055}
!1055 = !DISubrange(count: 2400)
!1056 = distinct !DIGlobalVariable(name: "hq_tab_10", scope: !0, file: !889, line: 5681, type: !1057, isLocal: true, isDefinition: true, variable: [600 x i8]* @hq_tab_10)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 4800, align: 8, elements: !1058)
!1058 = !{!1059}
!1059 = !DISubrange(count: 600)
!1060 = distinct !DIGlobalVariable(name: "hq_tab_12", scope: !0, file: !889, line: 5738, type: !1061, isLocal: true, isDefinition: true, variable: [3800 x i8]* @hq_tab_12)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 30400, align: 8, elements: !1062)
!1062 = !{!1063}
!1063 = !DISubrange(count: 3800)
!1064 = distinct !DIGlobalVariable(name: "hq_tab_13", scope: !0, file: !889, line: 5995, type: !1065, isLocal: true, isDefinition: true, variable: [1320 x i8]* @hq_tab_13)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 10560, align: 8, elements: !1066)
!1066 = !{!1067}
!1067 = !DISubrange(count: 1320)
!1068 = distinct !DIGlobalVariable(name: "hq_tab_14", scope: !0, file: !889, line: 6086, type: !1069, isLocal: true, isDefinition: true, variable: [660 x i8]* @hq_tab_14)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 5280, align: 8, elements: !1070)
!1070 = !{!1071}
!1071 = !DISubrange(count: 660)
!1072 = distinct !DIGlobalVariable(name: "hq_tab_15", scope: !0, file: !889, line: 6133, type: !1073, isLocal: true, isDefinition: true, variable: [792 x i8]* @hq_tab_15)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 6336, align: 8, elements: !1074)
!1074 = !{!1075}
!1075 = !DISubrange(count: 792)
!1076 = distinct !DIGlobalVariable(name: "hq_tab_16", scope: !0, file: !889, line: 6189, type: !1077, isLocal: true, isDefinition: true, variable: [200 x i8]* @hq_tab_16)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 1600, align: 8, elements: !1078)
!1078 = !{!1079}
!1079 = !DISubrange(count: 200)
!1080 = distinct !DIGlobalVariable(name: "hq_tab_17", scope: !0, file: !889, line: 6206, type: !1081, isLocal: true, isDefinition: true, variable: [10240 x i8]* @hq_tab_17)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 81920, align: 8, elements: !1082)
!1082 = !{!1083}
!1083 = !DISubrange(count: 10240)
!1084 = distinct !DIGlobalVariable(name: "hq_tab_18", scope: !0, file: !889, line: 6892, type: !1085, isLocal: true, isDefinition: true, variable: [9600 x i8]* @hq_tab_18)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 76800, align: 8, elements: !1086)
!1086 = !{!1087}
!1087 = !DISubrange(count: 9600)
!1088 = distinct !DIGlobalVariable(name: "hq_tab_19", scope: !0, file: !889, line: 7535, type: !1089, isLocal: true, isDefinition: true, variable: [6144 x i8]* @hq_tab_19)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 49152, align: 8, elements: !1090)
!1090 = !{!1091}
!1091 = !DISubrange(count: 6144)
!1092 = distinct !DIGlobalVariable(name: "hq_tab_20", scope: !0, file: !889, line: 7948, type: !1093, isLocal: true, isDefinition: true, variable: [2640 x i8]* @hq_tab_20)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 21120, align: 8, elements: !1094)
!1094 = !{!1095}
!1095 = !DISubrange(count: 2640)
!1096 = distinct !DIGlobalVariable(name: "hq_tab_21", scope: !0, file: !889, line: 8127, type: !1097, isLocal: true, isDefinition: true, variable: [3168 x i8]* @hq_tab_21)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 25344, align: 8, elements: !1098)
!1098 = !{!1099}
!1099 = !DISubrange(count: 3168)
!1100 = distinct !DIGlobalVariable(name: "cbp_vlc_lens", scope: !0, file: !889, line: 30, type: !1101, isLocal: true, isDefinition: true, variable: [16 x i8]* @cbp_vlc_lens)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 128, align: 8, elements: !1102)
!1102 = !{!898}
!1103 = distinct !DIGlobalVariable(name: "cbp_vlc_bits", scope: !0, file: !889, line: 25, type: !1101, isLocal: true, isDefinition: true, variable: [16 x i8]* @cbp_vlc_bits)
!1104 = !{i32 2, !"Dwarf Version", i32 4}
!1105 = !{i32 2, !"Debug Info Version", i32 3}
!1106 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1107 = distinct !DISubprogram(name: "ff_hq_init_vlcs", scope: !889, file: !889, line: 8368, type: !1108, isLocal: false, isDefinition: true, scopeLine: 8369, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1742)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!896, !1110}
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "HQContext", file: !923, line: 43, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HQContext", file: !923, line: 35, size: 13056, align: 128, elements: !1113)
!1113 = !{!1114, !1707, !1717, !1725, !1737, !1738}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1112, file: !923, line: 36, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1118)
!1118 = !{!1119, !1164, !1165, !1166, !1432, !1433, !1434, !1435, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1461, !1465, !1466, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1645, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1117, file: !35, line: 1561, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1122)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1123)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1124)
!1124 = !{!1125, !1129, !1134, !1138, !1139, !1140, !1141, !1145, !1151, !1153, !1157}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1123, file: !4, line: 72, baseType: !1126, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1128)
!1128 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1123, file: !4, line: 78, baseType: !1130, size: 64, align: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!1126, !1133}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1123, file: !4, line: 85, baseType: !1135, size: 64, align: 64, offset: 128)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1137)
!1137 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1123, file: !4, line: 93, baseType: !896, size: 32, align: 32, offset: 192)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1123, file: !4, line: 99, baseType: !896, size: 32, align: 32, offset: 224)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1123, file: !4, line: 108, baseType: !896, size: 32, align: 32, offset: 256)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1123, file: !4, line: 113, baseType: !1142, size: 64, align: 64, offset: 320)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!1133, !1133, !1133}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1123, file: !4, line: 123, baseType: !1146, size: 64, align: 64, offset: 384)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!1149, !1149}
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1123)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1123, file: !4, line: 130, baseType: !1152, size: 32, align: 32, offset: 448)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1123, file: !4, line: 136, baseType: !1154, size: 64, align: 64, offset: 512)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!1152, !1133}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1123, file: !4, line: 142, baseType: !1158, size: 64, align: 64, offset: 576)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!896, !1161, !1133, !1126, !896}
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1117, file: !35, line: 1562, baseType: !896, size: 32, align: 32, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1117, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1117, file: !35, line: 1565, baseType: !1167, size: 64, align: 64, offset: 128)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1169)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1170)
!1170 = !{!1171, !1172, !1173, !1174, !1175, !1176, !1185, !1188, !1191, !1194, !1199, !1200, !1201, !1209, !1210, !1211, !1213, !1217, !1223, !1228, !1232, !1233, !1282, !1403, !1407, !1408, !1412, !1416, !1421, !1425, !1426, !1427}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1169, file: !35, line: 3475, baseType: !1126, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1169, file: !35, line: 3480, baseType: !1126, size: 64, align: 64, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1169, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1169, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1169, file: !35, line: 3487, baseType: !896, size: 32, align: 32, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1169, file: !35, line: 3488, baseType: !1177, size: 64, align: 64, offset: 256)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1179)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1180, line: 61, baseType: !1181)
!1180 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1180, line: 58, size: 64, align: 32, elements: !1182)
!1182 = !{!1183, !1184}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1181, file: !1180, line: 59, baseType: !896, size: 32, align: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1181, file: !1180, line: 60, baseType: !896, size: 32, align: 32, offset: 32)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1169, file: !35, line: 3489, baseType: !1186, size: 64, align: 64, offset: 320)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1169, file: !35, line: 3490, baseType: !1189, size: 64, align: 64, offset: 384)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !896)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1169, file: !35, line: 3491, baseType: !1192, size: 64, align: 64, offset: 448)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64, align: 64)
!1193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1169, file: !35, line: 3492, baseType: !1195, size: 64, align: 64, offset: 512)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1197)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !895, line: 55, baseType: !1198)
!1198 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1169, file: !35, line: 3493, baseType: !904, size: 8, align: 8, offset: 576)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1169, file: !35, line: 3494, baseType: !1120, size: 64, align: 64, offset: 640)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1169, file: !35, line: 3495, baseType: !1202, size: 64, align: 64, offset: 704)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1204)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1205)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1206)
!1206 = !{!1207, !1208}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1205, file: !35, line: 3402, baseType: !896, size: 32, align: 32)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1205, file: !35, line: 3403, baseType: !1126, size: 64, align: 64, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1169, file: !35, line: 3507, baseType: !1126, size: 64, align: 64, offset: 768)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1169, file: !35, line: 3516, baseType: !896, size: 32, align: 32, offset: 832)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1169, file: !35, line: 3517, baseType: !1212, size: 64, align: 64, offset: 896)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1169, file: !35, line: 3527, baseType: !1214, size: 64, align: 64, offset: 960)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!896, !1115}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1169, file: !35, line: 3535, baseType: !1218, size: 64, align: 64, offset: 1024)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!896, !1115, !1221}
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1116)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1169, file: !35, line: 3541, baseType: !1224, size: 64, align: 64, offset: 1088)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1226)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1227)
!1227 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1169, file: !35, line: 3549, baseType: !1229, size: 64, align: 64, offset: 1152)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{null, !1212}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1169, file: !35, line: 3551, baseType: !1214, size: 64, align: 64, offset: 1216)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1169, file: !35, line: 3552, baseType: !1234, size: 64, align: 64, offset: 1280)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!896, !1115, !1237, !896, !1238}
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1241)
!1241 = !{!1242, !1243, !1246, !1247, !1248, !1279}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1240, file: !35, line: 3921, baseType: !911, size: 16, align: 16)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1240, file: !35, line: 3922, baseType: !1244, size: 32, align: 32, offset: 32)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !895, line: 51, baseType: !1245)
!1245 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1240, file: !35, line: 3923, baseType: !1244, size: 32, align: 32, offset: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1240, file: !35, line: 3924, baseType: !1245, size: 32, align: 32, offset: 96)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1240, file: !35, line: 3925, baseType: !1249, size: 64, align: 64, offset: 128)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1252)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1253)
!1253 = !{!1254, !1255, !1256, !1257, !1258, !1259, !1269, !1272, !1274, !1275, !1277, !1278}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1252, file: !35, line: 3886, baseType: !896, size: 32, align: 32)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1252, file: !35, line: 3887, baseType: !896, size: 32, align: 32, offset: 32)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1252, file: !35, line: 3888, baseType: !896, size: 32, align: 32, offset: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1252, file: !35, line: 3889, baseType: !896, size: 32, align: 32, offset: 96)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1252, file: !35, line: 3890, baseType: !896, size: 32, align: 32, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1252, file: !35, line: 3897, baseType: !1260, size: 768, align: 64, offset: 192)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1261)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1262)
!1262 = !{!1263, !1267}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1261, file: !35, line: 3855, baseType: !1264, size: 512, align: 64)
!1264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1237, size: 512, align: 64, elements: !1265)
!1265 = !{!1266}
!1266 = !DISubrange(count: 8)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1261, file: !35, line: 3857, baseType: !1268, size: 256, align: 32, offset: 512)
!1268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 256, align: 32, elements: !1265)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1252, file: !35, line: 3903, baseType: !1270, size: 256, align: 64, offset: 960)
!1270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1237, size: 256, align: 64, elements: !1271)
!1271 = !{!900}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1252, file: !35, line: 3904, baseType: !1273, size: 128, align: 32, offset: 1216)
!1273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 128, align: 32, elements: !1271)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1252, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1252, file: !35, line: 3908, baseType: !1276, size: 64, align: 64, offset: 1408)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1252, file: !35, line: 3915, baseType: !1276, size: 64, align: 64, offset: 1472)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1252, file: !35, line: 3917, baseType: !896, size: 32, align: 32, offset: 1536)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1240, file: !35, line: 3926, baseType: !1280, size: 64, align: 64, offset: 192)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !895, line: 40, baseType: !1281)
!1281 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1169, file: !35, line: 3564, baseType: !1283, size: 64, align: 64, offset: 1344)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!896, !1115, !1286, !1320, !1402}
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1288)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1289)
!1289 = !{!1290, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1316, !1317, !1318, !1319}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1288, file: !35, line: 1451, baseType: !1291, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1293, line: 94, baseType: !1294)
!1293 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1293, line: 81, size: 192, align: 64, elements: !1295)
!1295 = !{!1296, !1300, !1301}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1294, file: !1293, line: 82, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1293, line: 73, baseType: !1299)
!1299 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1293, line: 73, flags: DIFlagFwdDecl)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1294, file: !1293, line: 89, baseType: !1237, size: 64, align: 64, offset: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1294, file: !1293, line: 93, baseType: !896, size: 32, align: 32, offset: 128)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1288, file: !35, line: 1461, baseType: !1280, size: 64, align: 64, offset: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1288, file: !35, line: 1467, baseType: !1280, size: 64, align: 64, offset: 128)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1288, file: !35, line: 1468, baseType: !1237, size: 64, align: 64, offset: 192)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1288, file: !35, line: 1469, baseType: !896, size: 32, align: 32, offset: 256)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1288, file: !35, line: 1470, baseType: !896, size: 32, align: 32, offset: 288)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1288, file: !35, line: 1474, baseType: !896, size: 32, align: 32, offset: 320)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1288, file: !35, line: 1479, baseType: !1309, size: 64, align: 64, offset: 384)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1311)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1312)
!1312 = !{!1313, !1314, !1315}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1311, file: !35, line: 1412, baseType: !1237, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1311, file: !35, line: 1413, baseType: !896, size: 32, align: 32, offset: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1311, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1288, file: !35, line: 1480, baseType: !896, size: 32, align: 32, offset: 448)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1288, file: !35, line: 1486, baseType: !1280, size: 64, align: 64, offset: 512)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1288, file: !35, line: 1488, baseType: !1280, size: 64, align: 64, offset: 576)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1288, file: !35, line: 1497, baseType: !1280, size: 64, align: 64, offset: 640)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1322)
!1322 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1323)
!1323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1324)
!1324 = !{!1325, !1326, !1327, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1354, !1356, !1357, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1390, !1391, !1392, !1393, !1394, !1395, !1398, !1399, !1400, !1401}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1323, file: !758, line: 282, baseType: !1264, size: 512, align: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1323, file: !758, line: 299, baseType: !1268, size: 256, align: 32, offset: 512)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1323, file: !758, line: 315, baseType: !1328, size: 64, align: 64, offset: 768)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1323, file: !758, line: 326, baseType: !896, size: 32, align: 32, offset: 832)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1323, file: !758, line: 326, baseType: !896, size: 32, align: 32, offset: 864)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1323, file: !758, line: 334, baseType: !896, size: 32, align: 32, offset: 896)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1323, file: !758, line: 341, baseType: !896, size: 32, align: 32, offset: 928)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1323, file: !758, line: 346, baseType: !896, size: 32, align: 32, offset: 960)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1323, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1323, file: !758, line: 356, baseType: !1179, size: 64, align: 32, offset: 1024)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1323, file: !758, line: 361, baseType: !1280, size: 64, align: 64, offset: 1088)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1323, file: !758, line: 369, baseType: !1280, size: 64, align: 64, offset: 1152)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1323, file: !758, line: 377, baseType: !1280, size: 64, align: 64, offset: 1216)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1323, file: !758, line: 382, baseType: !896, size: 32, align: 32, offset: 1280)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1323, file: !758, line: 386, baseType: !896, size: 32, align: 32, offset: 1312)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1323, file: !758, line: 391, baseType: !896, size: 32, align: 32, offset: 1344)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1323, file: !758, line: 396, baseType: !1133, size: 64, align: 64, offset: 1408)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1323, file: !758, line: 403, baseType: !1344, size: 512, align: 64, offset: 1472)
!1344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1197, size: 512, align: 64, elements: !1265)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1323, file: !758, line: 410, baseType: !896, size: 32, align: 32, offset: 1984)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1323, file: !758, line: 415, baseType: !896, size: 32, align: 32, offset: 2016)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1323, file: !758, line: 420, baseType: !896, size: 32, align: 32, offset: 2048)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1323, file: !758, line: 425, baseType: !896, size: 32, align: 32, offset: 2080)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1323, file: !758, line: 435, baseType: !1280, size: 64, align: 64, offset: 2112)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1323, file: !758, line: 440, baseType: !896, size: 32, align: 32, offset: 2176)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1323, file: !758, line: 445, baseType: !1197, size: 64, align: 64, offset: 2240)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1323, file: !758, line: 459, baseType: !1353, size: 512, align: 64, offset: 2304)
!1353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1291, size: 512, align: 64, elements: !1265)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1323, file: !758, line: 473, baseType: !1355, size: 64, align: 64, offset: 2816)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1323, file: !758, line: 477, baseType: !896, size: 32, align: 32, offset: 2880)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1323, file: !758, line: 479, baseType: !1358, size: 64, align: 64, offset: 2944)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1361)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1362)
!1362 = !{!1363, !1364, !1365, !1366, !1371}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1361, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1361, file: !758, line: 203, baseType: !1237, size: 64, align: 64, offset: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1361, file: !758, line: 204, baseType: !896, size: 32, align: 32, offset: 128)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1361, file: !758, line: 205, baseType: !1367, size: 64, align: 64, offset: 192)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1369, line: 86, baseType: !1370)
!1369 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1370 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1369, line: 86, flags: DIFlagFwdDecl)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1361, file: !758, line: 206, baseType: !1291, size: 64, align: 64, offset: 256)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1323, file: !758, line: 480, baseType: !896, size: 32, align: 32, offset: 3008)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1323, file: !758, line: 505, baseType: !896, size: 32, align: 32, offset: 3040)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1323, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1323, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1323, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1323, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1323, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1323, file: !758, line: 532, baseType: !1280, size: 64, align: 64, offset: 3264)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1323, file: !758, line: 539, baseType: !1280, size: 64, align: 64, offset: 3328)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1323, file: !758, line: 547, baseType: !1280, size: 64, align: 64, offset: 3392)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1323, file: !758, line: 554, baseType: !1367, size: 64, align: 64, offset: 3456)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1323, file: !758, line: 563, baseType: !896, size: 32, align: 32, offset: 3520)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1323, file: !758, line: 572, baseType: !896, size: 32, align: 32, offset: 3552)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1323, file: !758, line: 581, baseType: !896, size: 32, align: 32, offset: 3584)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1323, file: !758, line: 588, baseType: !1387, size: 64, align: 64, offset: 3648)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !895, line: 36, baseType: !1389)
!1389 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1323, file: !758, line: 593, baseType: !896, size: 32, align: 32, offset: 3712)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1323, file: !758, line: 596, baseType: !896, size: 32, align: 32, offset: 3744)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1323, file: !758, line: 599, baseType: !1291, size: 64, align: 64, offset: 3776)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1323, file: !758, line: 605, baseType: !1291, size: 64, align: 64, offset: 3840)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1323, file: !758, line: 616, baseType: !1291, size: 64, align: 64, offset: 3904)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1323, file: !758, line: 626, baseType: !1396, size: 64, align: 64, offset: 3968)
!1396 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1397, line: 216, baseType: !1198)
!1397 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1323, file: !758, line: 627, baseType: !1396, size: 64, align: 64, offset: 4032)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1323, file: !758, line: 628, baseType: !1396, size: 64, align: 64, offset: 4096)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1323, file: !758, line: 629, baseType: !1396, size: 64, align: 64, offset: 4160)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1323, file: !758, line: 645, baseType: !1291, size: 64, align: 64, offset: 4224)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1169, file: !35, line: 3566, baseType: !1404, size: 64, align: 64, offset: 1408)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DISubroutineType(types: !1406)
!1406 = !{!896, !1115, !1133, !1402, !1286}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1169, file: !35, line: 3567, baseType: !1214, size: 64, align: 64, offset: 1472)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1169, file: !35, line: 3576, baseType: !1409, size: 64, align: 64, offset: 1536)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DISubroutineType(types: !1411)
!1411 = !{!896, !1115, !1320}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1169, file: !35, line: 3577, baseType: !1413, size: 64, align: 64, offset: 1600)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DISubroutineType(types: !1415)
!1415 = !{!896, !1115, !1286}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1169, file: !35, line: 3584, baseType: !1417, size: 64, align: 64, offset: 1664)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DISubroutineType(types: !1419)
!1419 = !{!896, !1115, !1420}
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1169, file: !35, line: 3589, baseType: !1422, size: 64, align: 64, offset: 1728)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{null, !1115}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1169, file: !35, line: 3594, baseType: !896, size: 32, align: 32, offset: 1792)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1169, file: !35, line: 3600, baseType: !1126, size: 64, align: 64, offset: 1856)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1169, file: !35, line: 3609, baseType: !1428, size: 64, align: 64, offset: 1920)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1431)
!1431 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1117, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1117, file: !35, line: 1581, baseType: !1245, size: 32, align: 32, offset: 224)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1117, file: !35, line: 1583, baseType: !1133, size: 64, align: 64, offset: 256)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1117, file: !35, line: 1591, baseType: !1436, size: 64, align: 64, offset: 320)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1117, file: !35, line: 1598, baseType: !1133, size: 64, align: 64, offset: 384)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1117, file: !35, line: 1606, baseType: !1280, size: 64, align: 64, offset: 448)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1117, file: !35, line: 1614, baseType: !896, size: 32, align: 32, offset: 512)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1117, file: !35, line: 1622, baseType: !896, size: 32, align: 32, offset: 544)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1117, file: !35, line: 1628, baseType: !896, size: 32, align: 32, offset: 576)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1117, file: !35, line: 1636, baseType: !896, size: 32, align: 32, offset: 608)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1117, file: !35, line: 1643, baseType: !896, size: 32, align: 32, offset: 640)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1117, file: !35, line: 1657, baseType: !1237, size: 64, align: 64, offset: 704)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1117, file: !35, line: 1658, baseType: !896, size: 32, align: 32, offset: 768)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1117, file: !35, line: 1679, baseType: !1179, size: 64, align: 32, offset: 800)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1117, file: !35, line: 1688, baseType: !896, size: 32, align: 32, offset: 864)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1117, file: !35, line: 1712, baseType: !896, size: 32, align: 32, offset: 896)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1117, file: !35, line: 1729, baseType: !896, size: 32, align: 32, offset: 928)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1117, file: !35, line: 1729, baseType: !896, size: 32, align: 32, offset: 960)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1117, file: !35, line: 1744, baseType: !896, size: 32, align: 32, offset: 992)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1117, file: !35, line: 1744, baseType: !896, size: 32, align: 32, offset: 1024)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1117, file: !35, line: 1751, baseType: !896, size: 32, align: 32, offset: 1056)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1117, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1117, file: !35, line: 1791, baseType: !1457, size: 64, align: 64, offset: 1152)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{null, !1460, !1320, !1402, !896, !896, !896}
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1117, file: !35, line: 1808, baseType: !1462, size: 64, align: 64, offset: 1216)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{!494, !1460, !1186}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1117, file: !35, line: 1816, baseType: !896, size: 32, align: 32, offset: 1280)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1117, file: !35, line: 1825, baseType: !1467, size: 32, align: 32, offset: 1312)
!1467 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1117, file: !35, line: 1830, baseType: !896, size: 32, align: 32, offset: 1344)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1117, file: !35, line: 1838, baseType: !1467, size: 32, align: 32, offset: 1376)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1117, file: !35, line: 1846, baseType: !896, size: 32, align: 32, offset: 1408)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1117, file: !35, line: 1851, baseType: !896, size: 32, align: 32, offset: 1440)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1117, file: !35, line: 1861, baseType: !1467, size: 32, align: 32, offset: 1472)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1117, file: !35, line: 1868, baseType: !1467, size: 32, align: 32, offset: 1504)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1117, file: !35, line: 1875, baseType: !1467, size: 32, align: 32, offset: 1536)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1117, file: !35, line: 1882, baseType: !1467, size: 32, align: 32, offset: 1568)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1117, file: !35, line: 1889, baseType: !1467, size: 32, align: 32, offset: 1600)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1117, file: !35, line: 1896, baseType: !1467, size: 32, align: 32, offset: 1632)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1117, file: !35, line: 1903, baseType: !1467, size: 32, align: 32, offset: 1664)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1117, file: !35, line: 1910, baseType: !896, size: 32, align: 32, offset: 1696)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1117, file: !35, line: 1915, baseType: !896, size: 32, align: 32, offset: 1728)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1117, file: !35, line: 1926, baseType: !1402, size: 64, align: 64, offset: 1792)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1117, file: !35, line: 1935, baseType: !1179, size: 64, align: 32, offset: 1856)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1117, file: !35, line: 1942, baseType: !896, size: 32, align: 32, offset: 1920)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1117, file: !35, line: 1948, baseType: !896, size: 32, align: 32, offset: 1952)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1117, file: !35, line: 1954, baseType: !896, size: 32, align: 32, offset: 1984)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1117, file: !35, line: 1960, baseType: !896, size: 32, align: 32, offset: 2016)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1117, file: !35, line: 1984, baseType: !896, size: 32, align: 32, offset: 2048)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1117, file: !35, line: 1991, baseType: !896, size: 32, align: 32, offset: 2080)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1117, file: !35, line: 1996, baseType: !896, size: 32, align: 32, offset: 2112)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1117, file: !35, line: 2004, baseType: !896, size: 32, align: 32, offset: 2144)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1117, file: !35, line: 2011, baseType: !896, size: 32, align: 32, offset: 2176)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1117, file: !35, line: 2018, baseType: !896, size: 32, align: 32, offset: 2208)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1117, file: !35, line: 2027, baseType: !896, size: 32, align: 32, offset: 2240)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1117, file: !35, line: 2034, baseType: !896, size: 32, align: 32, offset: 2272)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1117, file: !35, line: 2044, baseType: !896, size: 32, align: 32, offset: 2304)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1117, file: !35, line: 2054, baseType: !1497, size: 64, align: 64, offset: 2368)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1117, file: !35, line: 2061, baseType: !1497, size: 64, align: 64, offset: 2432)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1117, file: !35, line: 2066, baseType: !896, size: 32, align: 32, offset: 2496)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1117, file: !35, line: 2070, baseType: !896, size: 32, align: 32, offset: 2528)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1117, file: !35, line: 2078, baseType: !896, size: 32, align: 32, offset: 2560)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1117, file: !35, line: 2085, baseType: !896, size: 32, align: 32, offset: 2592)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1117, file: !35, line: 2092, baseType: !896, size: 32, align: 32, offset: 2624)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1117, file: !35, line: 2099, baseType: !896, size: 32, align: 32, offset: 2656)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1117, file: !35, line: 2106, baseType: !896, size: 32, align: 32, offset: 2688)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1117, file: !35, line: 2113, baseType: !896, size: 32, align: 32, offset: 2720)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1117, file: !35, line: 2120, baseType: !896, size: 32, align: 32, offset: 2752)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1117, file: !35, line: 2125, baseType: !896, size: 32, align: 32, offset: 2784)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1117, file: !35, line: 2133, baseType: !896, size: 32, align: 32, offset: 2816)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1117, file: !35, line: 2140, baseType: !896, size: 32, align: 32, offset: 2848)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1117, file: !35, line: 2145, baseType: !896, size: 32, align: 32, offset: 2880)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1117, file: !35, line: 2153, baseType: !896, size: 32, align: 32, offset: 2912)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1117, file: !35, line: 2158, baseType: !896, size: 32, align: 32, offset: 2944)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1117, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1117, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1117, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1117, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1117, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1117, file: !35, line: 2203, baseType: !896, size: 32, align: 32, offset: 3136)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1117, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1117, file: !35, line: 2212, baseType: !896, size: 32, align: 32, offset: 3200)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1117, file: !35, line: 2213, baseType: !896, size: 32, align: 32, offset: 3232)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1117, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1117, file: !35, line: 2232, baseType: !896, size: 32, align: 32, offset: 3296)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1117, file: !35, line: 2243, baseType: !896, size: 32, align: 32, offset: 3328)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1117, file: !35, line: 2249, baseType: !896, size: 32, align: 32, offset: 3360)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1117, file: !35, line: 2256, baseType: !896, size: 32, align: 32, offset: 3392)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1117, file: !35, line: 2263, baseType: !1197, size: 64, align: 64, offset: 3456)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1117, file: !35, line: 2270, baseType: !1197, size: 64, align: 64, offset: 3520)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1117, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1117, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1117, file: !35, line: 2367, baseType: !1533, size: 64, align: 64, offset: 3648)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64, align: 64)
!1534 = !DISubroutineType(types: !1535)
!1535 = !{!896, !1460, !1420, !896}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1117, file: !35, line: 2383, baseType: !896, size: 32, align: 32, offset: 3712)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1117, file: !35, line: 2386, baseType: !1467, size: 32, align: 32, offset: 3744)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1117, file: !35, line: 2387, baseType: !1467, size: 32, align: 32, offset: 3776)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1117, file: !35, line: 2394, baseType: !896, size: 32, align: 32, offset: 3808)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1117, file: !35, line: 2401, baseType: !896, size: 32, align: 32, offset: 3840)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1117, file: !35, line: 2408, baseType: !896, size: 32, align: 32, offset: 3872)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1117, file: !35, line: 2415, baseType: !896, size: 32, align: 32, offset: 3904)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1117, file: !35, line: 2422, baseType: !896, size: 32, align: 32, offset: 3936)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1117, file: !35, line: 2423, baseType: !1545, size: 64, align: 64, offset: 3968)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64, align: 64)
!1546 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1547)
!1547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1548)
!1548 = !{!1549, !1550, !1551, !1552}
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1547, file: !35, line: 827, baseType: !896, size: 32, align: 32)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1547, file: !35, line: 828, baseType: !896, size: 32, align: 32, offset: 32)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1547, file: !35, line: 829, baseType: !896, size: 32, align: 32, offset: 64)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1547, file: !35, line: 830, baseType: !1467, size: 32, align: 32, offset: 96)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1117, file: !35, line: 2430, baseType: !1280, size: 64, align: 64, offset: 4032)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1117, file: !35, line: 2437, baseType: !1280, size: 64, align: 64, offset: 4096)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1117, file: !35, line: 2444, baseType: !1467, size: 32, align: 32, offset: 4160)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1117, file: !35, line: 2451, baseType: !1467, size: 32, align: 32, offset: 4192)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1117, file: !35, line: 2458, baseType: !896, size: 32, align: 32, offset: 4224)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1117, file: !35, line: 2469, baseType: !896, size: 32, align: 32, offset: 4256)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1117, file: !35, line: 2475, baseType: !896, size: 32, align: 32, offset: 4288)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1117, file: !35, line: 2481, baseType: !896, size: 32, align: 32, offset: 4320)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1117, file: !35, line: 2485, baseType: !896, size: 32, align: 32, offset: 4352)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1117, file: !35, line: 2489, baseType: !896, size: 32, align: 32, offset: 4384)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1117, file: !35, line: 2493, baseType: !896, size: 32, align: 32, offset: 4416)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1117, file: !35, line: 2501, baseType: !896, size: 32, align: 32, offset: 4448)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1117, file: !35, line: 2506, baseType: !896, size: 32, align: 32, offset: 4480)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1117, file: !35, line: 2510, baseType: !896, size: 32, align: 32, offset: 4512)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1117, file: !35, line: 2514, baseType: !1280, size: 64, align: 64, offset: 4544)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1117, file: !35, line: 2528, baseType: !1569, size: 64, align: 64, offset: 4608)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64, align: 64)
!1570 = !DISubroutineType(types: !1571)
!1571 = !{null, !1460, !1133, !896, !896}
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1117, file: !35, line: 2534, baseType: !896, size: 32, align: 32, offset: 4672)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1117, file: !35, line: 2545, baseType: !896, size: 32, align: 32, offset: 4704)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1117, file: !35, line: 2547, baseType: !896, size: 32, align: 32, offset: 4736)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1117, file: !35, line: 2549, baseType: !896, size: 32, align: 32, offset: 4768)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1117, file: !35, line: 2551, baseType: !896, size: 32, align: 32, offset: 4800)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1117, file: !35, line: 2553, baseType: !896, size: 32, align: 32, offset: 4832)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1117, file: !35, line: 2555, baseType: !896, size: 32, align: 32, offset: 4864)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1117, file: !35, line: 2557, baseType: !896, size: 32, align: 32, offset: 4896)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1117, file: !35, line: 2559, baseType: !896, size: 32, align: 32, offset: 4928)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1117, file: !35, line: 2563, baseType: !896, size: 32, align: 32, offset: 4960)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1117, file: !35, line: 2571, baseType: !1276, size: 64, align: 64, offset: 4992)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1117, file: !35, line: 2579, baseType: !1276, size: 64, align: 64, offset: 5056)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1117, file: !35, line: 2586, baseType: !896, size: 32, align: 32, offset: 5120)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1117, file: !35, line: 2615, baseType: !896, size: 32, align: 32, offset: 5152)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1117, file: !35, line: 2627, baseType: !896, size: 32, align: 32, offset: 5184)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1117, file: !35, line: 2637, baseType: !896, size: 32, align: 32, offset: 5216)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1117, file: !35, line: 2681, baseType: !896, size: 32, align: 32, offset: 5248)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1117, file: !35, line: 2709, baseType: !1280, size: 64, align: 64, offset: 5312)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1117, file: !35, line: 2716, baseType: !1591, size: 64, align: 64, offset: 5376)
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64, align: 64)
!1592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1593)
!1593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1594)
!1594 = !{!1595, !1596, !1597, !1598, !1599, !1600, !1601, !1605, !1609, !1610, !1611, !1612, !1618, !1619, !1620, !1621, !1622}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1593, file: !35, line: 3642, baseType: !1126, size: 64, align: 64)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1593, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1593, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1593, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1593, file: !35, line: 3669, baseType: !896, size: 32, align: 32, offset: 160)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1593, file: !35, line: 3682, baseType: !1417, size: 64, align: 64, offset: 192)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1593, file: !35, line: 3698, baseType: !1602, size: 64, align: 64, offset: 256)
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64, align: 64)
!1603 = !DISubroutineType(types: !1604)
!1604 = !{!896, !1115, !927, !1244}
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1593, file: !35, line: 3712, baseType: !1606, size: 64, align: 64, offset: 320)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DISubroutineType(types: !1608)
!1608 = !{!896, !1115, !896, !927, !1244}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1593, file: !35, line: 3726, baseType: !1602, size: 64, align: 64, offset: 384)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1593, file: !35, line: 3737, baseType: !1214, size: 64, align: 64, offset: 448)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1593, file: !35, line: 3746, baseType: !896, size: 32, align: 32, offset: 512)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1593, file: !35, line: 3757, baseType: !1613, size: 64, align: 64, offset: 576)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DISubroutineType(types: !1615)
!1615 = !{null, !1616}
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1593, file: !35, line: 3766, baseType: !1214, size: 64, align: 64, offset: 640)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1593, file: !35, line: 3774, baseType: !1214, size: 64, align: 64, offset: 704)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1593, file: !35, line: 3780, baseType: !896, size: 32, align: 32, offset: 768)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1593, file: !35, line: 3785, baseType: !896, size: 32, align: 32, offset: 800)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1593, file: !35, line: 3795, baseType: !1623, size: 64, align: 64, offset: 832)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DISubroutineType(types: !1625)
!1625 = !{!896, !1115, !1291}
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1117, file: !35, line: 2728, baseType: !1133, size: 64, align: 64, offset: 5440)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1117, file: !35, line: 2735, baseType: !1344, size: 512, align: 64, offset: 5504)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1117, file: !35, line: 2742, baseType: !896, size: 32, align: 32, offset: 6016)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1117, file: !35, line: 2755, baseType: !896, size: 32, align: 32, offset: 6048)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1117, file: !35, line: 2776, baseType: !896, size: 32, align: 32, offset: 6080)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1117, file: !35, line: 2783, baseType: !896, size: 32, align: 32, offset: 6112)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1117, file: !35, line: 2791, baseType: !896, size: 32, align: 32, offset: 6144)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1117, file: !35, line: 2802, baseType: !1420, size: 64, align: 64, offset: 6208)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1117, file: !35, line: 2811, baseType: !896, size: 32, align: 32, offset: 6272)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1117, file: !35, line: 2821, baseType: !896, size: 32, align: 32, offset: 6304)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1117, file: !35, line: 2830, baseType: !896, size: 32, align: 32, offset: 6336)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1117, file: !35, line: 2840, baseType: !896, size: 32, align: 32, offset: 6368)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1117, file: !35, line: 2851, baseType: !1639, size: 64, align: 64, offset: 6400)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DISubroutineType(types: !1641)
!1641 = !{!896, !1460, !1642, !1133, !1402, !896, !896}
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{!896, !1460, !1133}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1117, file: !35, line: 2871, baseType: !1646, size: 64, align: 64, offset: 6464)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DISubroutineType(types: !1648)
!1648 = !{!896, !1460, !1649, !1133, !1402, !896}
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64, align: 64)
!1650 = !DISubroutineType(types: !1651)
!1651 = !{!896, !1460, !1133, !896, !896}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1117, file: !35, line: 2878, baseType: !896, size: 32, align: 32, offset: 6528)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1117, file: !35, line: 2885, baseType: !896, size: 32, align: 32, offset: 6560)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1117, file: !35, line: 3005, baseType: !896, size: 32, align: 32, offset: 6592)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1117, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1117, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1117, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1117, file: !35, line: 3037, baseType: !1237, size: 64, align: 64, offset: 6720)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1117, file: !35, line: 3038, baseType: !896, size: 32, align: 32, offset: 6784)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1117, file: !35, line: 3050, baseType: !1197, size: 64, align: 64, offset: 6848)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1117, file: !35, line: 3065, baseType: !896, size: 32, align: 32, offset: 6912)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1117, file: !35, line: 3083, baseType: !896, size: 32, align: 32, offset: 6944)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1117, file: !35, line: 3092, baseType: !1179, size: 64, align: 32, offset: 6976)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1117, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1117, file: !35, line: 3106, baseType: !1179, size: 64, align: 32, offset: 7072)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1117, file: !35, line: 3113, baseType: !1667, size: 64, align: 64, offset: 7168)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1669)
!1669 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1670)
!1670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1671)
!1671 = !{!1672, !1673, !1674, !1675, !1676, !1677, !1680}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1670, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1670, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1670, file: !35, line: 720, baseType: !1126, size: 64, align: 64, offset: 64)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1670, file: !35, line: 724, baseType: !1126, size: 64, align: 64, offset: 128)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1670, file: !35, line: 728, baseType: !896, size: 32, align: 32, offset: 192)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1670, file: !35, line: 734, baseType: !1678, size: 64, align: 64, offset: 256)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1126)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1670, file: !35, line: 739, baseType: !1681, size: 64, align: 64, offset: 320)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1205)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1117, file: !35, line: 3129, baseType: !1280, size: 64, align: 64, offset: 7232)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1117, file: !35, line: 3130, baseType: !1280, size: 64, align: 64, offset: 7296)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1117, file: !35, line: 3131, baseType: !1280, size: 64, align: 64, offset: 7360)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1117, file: !35, line: 3132, baseType: !1280, size: 64, align: 64, offset: 7424)
