; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--spdifenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--spdifenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IEC61937DataType", file: !939, line: 32, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "libavformat/spdif.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960}
!941 = !DIEnumerator(name: "IEC61937_AC3", value: 1)
!942 = !DIEnumerator(name: "IEC61937_MPEG1_LAYER1", value: 4)
!943 = !DIEnumerator(name: "IEC61937_MPEG1_LAYER23", value: 5)
!944 = !DIEnumerator(name: "IEC61937_MPEG2_EXT", value: 6)
!945 = !DIEnumerator(name: "IEC61937_MPEG2_AAC", value: 7)
!946 = !DIEnumerator(name: "IEC61937_MPEG2_LAYER1_LSF", value: 8)
!947 = !DIEnumerator(name: "IEC61937_MPEG2_LAYER2_LSF", value: 9)
!948 = !DIEnumerator(name: "IEC61937_MPEG2_LAYER3_LSF", value: 10)
!949 = !DIEnumerator(name: "IEC61937_DTS1", value: 11)
!950 = !DIEnumerator(name: "IEC61937_DTS2", value: 12)
!951 = !DIEnumerator(name: "IEC61937_DTS3", value: 13)
!952 = !DIEnumerator(name: "IEC61937_ATRAC", value: 14)
!953 = !DIEnumerator(name: "IEC61937_ATRAC3", value: 15)
!954 = !DIEnumerator(name: "IEC61937_ATRACX", value: 16)
!955 = !DIEnumerator(name: "IEC61937_DTSHD", value: 17)
!956 = !DIEnumerator(name: "IEC61937_WMAPRO", value: 18)
!957 = !DIEnumerator(name: "IEC61937_MPEG2_AAC_LSF_2048", value: 19)
!958 = !DIEnumerator(name: "IEC61937_MPEG2_AAC_LSF_4096", value: 51)
!959 = !DIEnumerator(name: "IEC61937_EAC3", value: 21)
!960 = !DIEnumerator(name: "IEC61937_TRUEHD", value: 22)
!961 = !{!962, !963, !964, !972, !979, !983, !984}
!962 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!963 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !967, line: 221, size: 32, align: 8, elements: !968)
!967 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!968 = !{!969}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !966, file: !967, line: 221, baseType: !970, size: 32, align: 32)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !971, line: 51, baseType: !963)
!971 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !967, line: 222, size: 16, align: 8, elements: !975)
!975 = !{!976}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !974, file: !967, line: 222, baseType: !977, size: 16, align: 16)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !971, line: 49, baseType: !978)
!978 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !971, line: 48, baseType: !982)
!982 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!985 = !{!986, !2237, !2238, !2242, !2250, !2255, !2258, !2265, !2270, !2274}
!986 = distinct !DIGlobalVariable(name: "ff_spdif_muxer", scope: !0, file: !987, line: 549, type: !988, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_spdif_muxer)
!987 = !DIFile(filename: "libavformat/spdifenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !990)
!990 = !{!991, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1008, !1090, !1092, !1093, !2202, !2203, !2204, !2208, !2212, !2216, !2217, !2222, !2223, !2224, !2225, !2226, !2227, !2231}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !989, file: !919, line: 498, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !989, file: !919, line: 504, baseType: !992, size: 64, align: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !989, file: !919, line: 505, baseType: !992, size: 64, align: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !989, file: !919, line: 506, baseType: !992, size: 64, align: 64, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !989, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !989, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !989, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !989, file: !919, line: 517, baseType: !962, size: 32, align: 32, offset: 352)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !989, file: !919, line: 523, baseType: !1003, size: 64, align: 64, offset: 384)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !919, line: 443, flags: DIFlagFwdDecl)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !989, file: !919, line: 526, baseType: !1009, size: 64, align: 64, offset: 448)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1011)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !1012)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1013)
!1013 = !{!1014, !1015, !1020, !1049, !1050, !1051, !1052, !1056, !1062, !1064, !1068}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1012, file: !486, line: 72, baseType: !992, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1012, file: !486, line: 78, baseType: !1016, size: 64, align: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!992, !1019}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1012, file: !486, line: 85, baseType: !1021, size: 64, align: 64, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1045, !1046, !1047, !1048}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1023, file: !464, line: 247, baseType: !992, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1023, file: !464, line: 253, baseType: !992, size: 64, align: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1023, file: !464, line: 259, baseType: !962, size: 32, align: 32, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1023, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1023, file: !464, line: 271, baseType: !1030, size: 64, align: 64, offset: 192)
!1030 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1023, file: !464, line: 265, size: 64, align: 64, elements: !1031)
!1031 = !{!1032, !1035, !1037, !1038}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1030, file: !464, line: 266, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !971, line: 40, baseType: !1034)
!1034 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1030, file: !464, line: 267, baseType: !1036, size: 64, align: 64)
!1036 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1030, file: !464, line: 268, baseType: !992, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1030, file: !464, line: 270, baseType: !1039, size: 64, align: 32)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1040, line: 61, baseType: !1041)
!1040 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1040, line: 58, size: 64, align: 32, elements: !1042)
!1042 = !{!1043, !1044}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1041, file: !1040, line: 59, baseType: !962, size: 32, align: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1041, file: !1040, line: 60, baseType: !962, size: 32, align: 32, offset: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1023, file: !464, line: 272, baseType: !1036, size: 64, align: 64, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1023, file: !464, line: 273, baseType: !1036, size: 64, align: 64, offset: 320)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1023, file: !464, line: 275, baseType: !962, size: 32, align: 32, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1023, file: !464, line: 300, baseType: !992, size: 64, align: 64, offset: 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1012, file: !486, line: 93, baseType: !962, size: 32, align: 32, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1012, file: !486, line: 99, baseType: !962, size: 32, align: 32, offset: 224)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1012, file: !486, line: 108, baseType: !962, size: 32, align: 32, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1012, file: !486, line: 113, baseType: !1053, size: 64, align: 64, offset: 320)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!1019, !1019, !1019}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1012, file: !486, line: 123, baseType: !1057, size: 64, align: 64, offset: 384)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!1060, !1060}
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1012)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1012, file: !486, line: 130, baseType: !1063, size: 32, align: 32, offset: 448)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1012, file: !486, line: 136, baseType: !1065, size: 64, align: 64, offset: 512)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!1063, !1019}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1012, file: !486, line: 142, baseType: !1069, size: 64, align: 64, offset: 576)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!962, !1072, !1019, !992, !962}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1075)
!1075 = !{!1076, !1088, !1089}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1074, file: !464, line: 360, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1080)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1081)
!1081 = !{!1082, !1083, !1084, !1085, !1086, !1087}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1080, file: !464, line: 307, baseType: !992, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1080, file: !464, line: 313, baseType: !1036, size: 64, align: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1080, file: !464, line: 313, baseType: !1036, size: 64, align: 64, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1080, file: !464, line: 318, baseType: !1036, size: 64, align: 64, offset: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1080, file: !464, line: 318, baseType: !1036, size: 64, align: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1080, file: !464, line: 323, baseType: !962, size: 32, align: 32, offset: 320)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1074, file: !464, line: 364, baseType: !962, size: 32, align: 32, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1074, file: !464, line: 368, baseType: !962, size: 32, align: 32, offset: 96)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !989, file: !919, line: 535, baseType: !1091, size: 64, align: 64, offset: 512)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !989, file: !919, line: 539, baseType: !962, size: 32, align: 32, offset: 576)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !989, file: !919, line: 541, baseType: !1094, size: 64, align: 64, offset: 640)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!962, !1097}
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1099)
!1099 = !{!1100, !1101, !1197, !1198, !1199, !1263, !1264, !1265, !2076, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2130, !2131, !2132, !2133, !2134, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2165, !2166, !2169, !2170, !2171, !2172, !2173, !2174, !2179, !2180, !2181, !2182, !2190, !2191, !2195, !2199, !2200, !2201}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1098, file: !919, line: 1342, baseType: !1009, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1098, file: !919, line: 1349, baseType: !1102, size: 64, align: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1104)
!1104 = !{!1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1128, !1129, !1168, !1169, !1173, !1178, !1179, !1180, !1184, !1190, !1196}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1103, file: !919, line: 638, baseType: !992, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1103, file: !919, line: 645, baseType: !992, size: 64, align: 64, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1103, file: !919, line: 652, baseType: !962, size: 32, align: 32, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1103, file: !919, line: 659, baseType: !992, size: 64, align: 64, offset: 192)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1103, file: !919, line: 661, baseType: !1003, size: 64, align: 64, offset: 256)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1103, file: !919, line: 663, baseType: !1009, size: 64, align: 64, offset: 320)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1103, file: !919, line: 670, baseType: !992, size: 64, align: 64, offset: 384)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1103, file: !919, line: 679, baseType: !1102, size: 64, align: 64, offset: 448)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1103, file: !919, line: 684, baseType: !962, size: 32, align: 32, offset: 512)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1103, file: !919, line: 689, baseType: !962, size: 32, align: 32, offset: 544)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1103, file: !919, line: 696, baseType: !1116, size: 64, align: 64, offset: 576)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!962, !1119}
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1122)
!1122 = !{!1123, !1124, !1126, !1127}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1121, file: !919, line: 449, baseType: !992, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1121, file: !919, line: 450, baseType: !1125, size: 64, align: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1121, file: !919, line: 451, baseType: !962, size: 32, align: 32, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1121, file: !919, line: 452, baseType: !992, size: 64, align: 64, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1103, file: !919, line: 703, baseType: !1094, size: 64, align: 64, offset: 640)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1103, file: !919, line: 714, baseType: !1130, size: 64, align: 64, offset: 704)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!962, !1097, !1133}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1136)
!1136 = !{!1137, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1164, !1165, !1166, !1167}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1135, file: !4, line: 1451, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1140, line: 94, baseType: !1141)
!1140 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1140, line: 81, size: 192, align: 64, elements: !1142)
!1142 = !{!1143, !1147, !1149}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1141, file: !1140, line: 82, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1140, line: 73, baseType: !1146)
!1146 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1140, line: 73, flags: DIFlagFwdDecl)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1141, file: !1140, line: 89, baseType: !1148, size: 64, align: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1141, file: !1140, line: 93, baseType: !962, size: 32, align: 32, offset: 128)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1135, file: !4, line: 1461, baseType: !1033, size: 64, align: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1135, file: !4, line: 1467, baseType: !1033, size: 64, align: 64, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1135, file: !4, line: 1468, baseType: !1148, size: 64, align: 64, offset: 192)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1135, file: !4, line: 1469, baseType: !962, size: 32, align: 32, offset: 256)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1135, file: !4, line: 1470, baseType: !962, size: 32, align: 32, offset: 288)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1135, file: !4, line: 1474, baseType: !962, size: 32, align: 32, offset: 320)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1135, file: !4, line: 1479, baseType: !1157, size: 64, align: 64, offset: 384)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1159)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1160)
!1160 = !{!1161, !1162, !1163}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1159, file: !4, line: 1412, baseType: !1148, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1159, file: !4, line: 1413, baseType: !962, size: 32, align: 32, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1159, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1135, file: !4, line: 1480, baseType: !962, size: 32, align: 32, offset: 448)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1135, file: !4, line: 1486, baseType: !1033, size: 64, align: 64, offset: 512)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1135, file: !4, line: 1488, baseType: !1033, size: 64, align: 64, offset: 576)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1135, file: !4, line: 1497, baseType: !1033, size: 64, align: 64, offset: 640)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1103, file: !919, line: 720, baseType: !1094, size: 64, align: 64, offset: 768)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1103, file: !919, line: 730, baseType: !1170, size: 64, align: 64, offset: 832)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!962, !1097, !962, !1033, !962}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1103, file: !919, line: 737, baseType: !1174, size: 64, align: 64, offset: 896)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!1033, !1097, !962, !1177, !1033}
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1103, file: !919, line: 744, baseType: !1094, size: 64, align: 64, offset: 960)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1103, file: !919, line: 750, baseType: !1094, size: 64, align: 64, offset: 1024)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1103, file: !919, line: 758, baseType: !1181, size: 64, align: 64, offset: 1088)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!962, !1097, !962, !1033, !1033, !1033, !962}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1103, file: !919, line: 764, baseType: !1185, size: 64, align: 64, offset: 1152)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!962, !1097, !1188}
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1103, file: !919, line: 770, baseType: !1191, size: 64, align: 64, offset: 1216)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!962, !1097, !1194}
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1103, file: !919, line: 776, baseType: !1191, size: 64, align: 64, offset: 1280)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1098, file: !919, line: 1356, baseType: !1091, size: 64, align: 64, offset: 128)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1098, file: !919, line: 1365, baseType: !1019, size: 64, align: 64, offset: 192)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1098, file: !919, line: 1379, baseType: !1200, size: 64, align: 64, offset: 256)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !537, line: 352, baseType: !1202)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !537, line: 161, size: 2112, align: 64, elements: !1203)
!1203 = !{!1204, !1205, !1206, !1207, !1208, !1209, !1210, !1214, !1215, !1219, !1220, !1221, !1222, !1223, !1225, !1226, !1230, !1231, !1235, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1253, !1254, !1255, !1256, !1260, !1261, !1262}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1202, file: !537, line: 174, baseType: !1009, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1202, file: !537, line: 226, baseType: !1125, size: 64, align: 64, offset: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1202, file: !537, line: 227, baseType: !962, size: 32, align: 32, offset: 128)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1202, file: !537, line: 228, baseType: !1125, size: 64, align: 64, offset: 192)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1202, file: !537, line: 229, baseType: !1125, size: 64, align: 64, offset: 256)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1202, file: !537, line: 233, baseType: !1019, size: 64, align: 64, offset: 320)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1202, file: !537, line: 235, baseType: !1211, size: 64, align: 64, offset: 384)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!962, !1019, !1148, !962}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1202, file: !537, line: 236, baseType: !1211, size: 64, align: 64, offset: 448)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1202, file: !537, line: 237, baseType: !1216, size: 64, align: 64, offset: 512)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!1033, !1019, !1033, !962}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1202, file: !537, line: 238, baseType: !1033, size: 64, align: 64, offset: 576)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1202, file: !537, line: 239, baseType: !962, size: 32, align: 32, offset: 640)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1202, file: !537, line: 240, baseType: !962, size: 32, align: 32, offset: 672)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1202, file: !537, line: 241, baseType: !962, size: 32, align: 32, offset: 704)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1202, file: !537, line: 242, baseType: !1224, size: 64, align: 64, offset: 768)
!1224 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1202, file: !537, line: 243, baseType: !1125, size: 64, align: 64, offset: 832)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1202, file: !537, line: 244, baseType: !1227, size: 64, align: 64, offset: 896)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!1224, !1224, !979, !963}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1202, file: !537, line: 245, baseType: !962, size: 32, align: 32, offset: 960)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1202, file: !537, line: 249, baseType: !1232, size: 64, align: 64, offset: 1024)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{!962, !1019, !962}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1202, file: !537, line: 255, baseType: !1236, size: 64, align: 64, offset: 1088)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!1033, !1019, !962, !1033, !962}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1202, file: !537, line: 260, baseType: !962, size: 32, align: 32, offset: 1152)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1202, file: !537, line: 266, baseType: !1033, size: 64, align: 64, offset: 1216)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1202, file: !537, line: 273, baseType: !962, size: 32, align: 32, offset: 1280)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1202, file: !537, line: 279, baseType: !1033, size: 64, align: 64, offset: 1344)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1202, file: !537, line: 285, baseType: !962, size: 32, align: 32, offset: 1408)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1202, file: !537, line: 291, baseType: !962, size: 32, align: 32, offset: 1440)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1202, file: !537, line: 298, baseType: !962, size: 32, align: 32, offset: 1472)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1202, file: !537, line: 304, baseType: !962, size: 32, align: 32, offset: 1504)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1202, file: !537, line: 309, baseType: !992, size: 64, align: 64, offset: 1536)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1202, file: !537, line: 314, baseType: !992, size: 64, align: 64, offset: 1600)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1202, file: !537, line: 319, baseType: !1250, size: 64, align: 64, offset: 1664)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!962, !1019, !1148, !962, !536, !1033}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1202, file: !537, line: 326, baseType: !962, size: 32, align: 32, offset: 1728)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1202, file: !537, line: 331, baseType: !536, size: 32, align: 32, offset: 1760)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1202, file: !537, line: 332, baseType: !1033, size: 64, align: 64, offset: 1792)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1202, file: !537, line: 338, baseType: !1257, size: 64, align: 64, offset: 1856)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{!962, !1019}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1202, file: !537, line: 340, baseType: !1033, size: 64, align: 64, offset: 1920)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1202, file: !537, line: 346, baseType: !1125, size: 64, align: 64, offset: 1984)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1202, file: !537, line: 351, baseType: !962, size: 32, align: 32, offset: 2048)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1098, file: !919, line: 1386, baseType: !962, size: 32, align: 32, offset: 320)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1098, file: !919, line: 1393, baseType: !963, size: 32, align: 32, offset: 352)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1098, file: !919, line: 1405, baseType: !1266, size: 64, align: 64, offset: 384)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1269)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1270)
!1270 = !{!1271, !1272, !1273, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !2024, !2030, !2031, !2035, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2067, !2068, !2069, !2070, !2071, !2072}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1269, file: !919, line: 866, baseType: !962, size: 32, align: 32)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1269, file: !919, line: 872, baseType: !962, size: 32, align: 32, offset: 32)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1269, file: !919, line: 878, baseType: !1274, size: 64, align: 64, offset: 64)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1276)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1277)
!1277 = !{!1278, !1279, !1280, !1281, !1506, !1507, !1508, !1509, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1662, !1666, !1667, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1845, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1276, file: !4, line: 1561, baseType: !1009, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1276, file: !4, line: 1562, baseType: !962, size: 32, align: 32, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1276, file: !4, line: 1564, baseType: !545, size: 32, align: 32, offset: 96)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1276, file: !4, line: 1565, baseType: !1282, size: 64, align: 64, offset: 128)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1284)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1285)
!1285 = !{!1286, !1287, !1288, !1289, !1290, !1291, !1294, !1297, !1300, !1303, !1307, !1308, !1309, !1317, !1318, !1319, !1321, !1325, !1331, !1340, !1344, !1345, !1390, !1477, !1481, !1482, !1486, !1490, !1495, !1499, !1500, !1501}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1284, file: !4, line: 3475, baseType: !992, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1284, file: !4, line: 3480, baseType: !992, size: 64, align: 64, offset: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1284, file: !4, line: 3481, baseType: !545, size: 32, align: 32, offset: 128)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1284, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1284, file: !4, line: 3487, baseType: !962, size: 32, align: 32, offset: 192)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1284, file: !4, line: 3488, baseType: !1292, size: 64, align: 64, offset: 256)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1284, file: !4, line: 3489, baseType: !1295, size: 64, align: 64, offset: 320)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1284, file: !4, line: 3490, baseType: !1298, size: 64, align: 64, offset: 384)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1284, file: !4, line: 3491, baseType: !1301, size: 64, align: 64, offset: 448)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1284, file: !4, line: 3492, baseType: !1304, size: 64, align: 64, offset: 512)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1306)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !971, line: 55, baseType: !1224)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1284, file: !4, line: 3493, baseType: !981, size: 8, align: 8, offset: 576)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1284, file: !4, line: 3494, baseType: !1009, size: 64, align: 64, offset: 640)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1284, file: !4, line: 3495, baseType: !1310, size: 64, align: 64, offset: 704)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1312)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1313)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1314)
!1314 = !{!1315, !1316}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1313, file: !4, line: 3402, baseType: !962, size: 32, align: 32)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1313, file: !4, line: 3403, baseType: !992, size: 64, align: 64, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1284, file: !4, line: 3507, baseType: !992, size: 64, align: 64, offset: 768)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1284, file: !4, line: 3516, baseType: !962, size: 32, align: 32, offset: 832)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1284, file: !4, line: 3517, baseType: !1320, size: 64, align: 64, offset: 896)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1284, file: !4, line: 3527, baseType: !1322, size: 64, align: 64, offset: 960)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DISubroutineType(types: !1324)
!1324 = !{!962, !1274}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1284, file: !4, line: 3535, baseType: !1326, size: 64, align: 64, offset: 1024)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{!962, !1274, !1329}
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1275)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1284, file: !4, line: 3541, baseType: !1332, size: 64, align: 64, offset: 1088)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1334)
!1334 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1335)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1336, line: 223, size: 128, align: 64, elements: !1337)
!1336 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1337 = !{!1338, !1339}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1335, file: !1336, line: 224, baseType: !979, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1335, file: !1336, line: 225, baseType: !979, size: 64, align: 64, offset: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1284, file: !4, line: 3549, baseType: !1341, size: 64, align: 64, offset: 1152)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DISubroutineType(types: !1343)
!1343 = !{null, !1320}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1284, file: !4, line: 3551, baseType: !1322, size: 64, align: 64, offset: 1216)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1284, file: !4, line: 3552, baseType: !1346, size: 64, align: 64, offset: 1280)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DISubroutineType(types: !1348)
!1348 = !{!962, !1274, !1148, !962, !1349}
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1351)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1352)
!1352 = !{!1353, !1354, !1355, !1356, !1357, !1389}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1351, file: !4, line: 3921, baseType: !977, size: 16, align: 16)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1351, file: !4, line: 3922, baseType: !970, size: 32, align: 32, offset: 32)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1351, file: !4, line: 3923, baseType: !970, size: 32, align: 32, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1351, file: !4, line: 3924, baseType: !963, size: 32, align: 32, offset: 96)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1351, file: !4, line: 3925, baseType: !1358, size: 64, align: 64, offset: 128)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1361)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1362)
!1362 = !{!1363, !1364, !1365, !1366, !1367, !1368, !1378, !1382, !1384, !1385, !1387, !1388}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1361, file: !4, line: 3886, baseType: !962, size: 32, align: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1361, file: !4, line: 3887, baseType: !962, size: 32, align: 32, offset: 32)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1361, file: !4, line: 3888, baseType: !962, size: 32, align: 32, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1361, file: !4, line: 3889, baseType: !962, size: 32, align: 32, offset: 96)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1361, file: !4, line: 3890, baseType: !962, size: 32, align: 32, offset: 128)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1361, file: !4, line: 3897, baseType: !1369, size: 768, align: 64, offset: 192)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1370)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1371)
!1371 = !{!1372, !1376}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1370, file: !4, line: 3855, baseType: !1373, size: 512, align: 64)
!1373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1148, size: 512, align: 64, elements: !1374)
!1374 = !{!1375}
!1375 = !DISubrange(count: 8)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1370, file: !4, line: 3857, baseType: !1377, size: 256, align: 32, offset: 512)
!1377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 256, align: 32, elements: !1374)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1361, file: !4, line: 3903, baseType: !1379, size: 256, align: 64, offset: 960)
!1379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1148, size: 256, align: 64, elements: !1380)
!1380 = !{!1381}
!1381 = !DISubrange(count: 4)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1361, file: !4, line: 3904, baseType: !1383, size: 128, align: 32, offset: 1216)
!1383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 128, align: 32, elements: !1380)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1361, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1361, file: !4, line: 3908, baseType: !1386, size: 64, align: 64, offset: 1408)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1361, file: !4, line: 3915, baseType: !1386, size: 64, align: 64, offset: 1472)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1361, file: !4, line: 3917, baseType: !962, size: 32, align: 32, offset: 1536)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1351, file: !4, line: 3926, baseType: !1033, size: 64, align: 64, offset: 192)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1284, file: !4, line: 3564, baseType: !1391, size: 64, align: 64, offset: 1344)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DISubroutineType(types: !1393)
!1393 = !{!962, !1274, !1133, !1394, !1476}
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1396)
!1396 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1397)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1398)
!1398 = !{!1399, !1400, !1401, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1428, !1430, !1431, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1464, !1465, !1466, !1467, !1468, !1469, !1472, !1473, !1474, !1475}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1397, file: !789, line: 282, baseType: !1373, size: 512, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1397, file: !789, line: 299, baseType: !1377, size: 256, align: 32, offset: 512)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1397, file: !789, line: 315, baseType: !1402, size: 64, align: 64, offset: 768)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1397, file: !789, line: 326, baseType: !962, size: 32, align: 32, offset: 832)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1397, file: !789, line: 326, baseType: !962, size: 32, align: 32, offset: 864)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1397, file: !789, line: 334, baseType: !962, size: 32, align: 32, offset: 896)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1397, file: !789, line: 341, baseType: !962, size: 32, align: 32, offset: 928)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1397, file: !789, line: 346, baseType: !962, size: 32, align: 32, offset: 960)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1397, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1397, file: !789, line: 356, baseType: !1039, size: 64, align: 32, offset: 1024)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1397, file: !789, line: 361, baseType: !1033, size: 64, align: 64, offset: 1088)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1397, file: !789, line: 369, baseType: !1033, size: 64, align: 64, offset: 1152)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1397, file: !789, line: 377, baseType: !1033, size: 64, align: 64, offset: 1216)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1397, file: !789, line: 382, baseType: !962, size: 32, align: 32, offset: 1280)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1397, file: !789, line: 386, baseType: !962, size: 32, align: 32, offset: 1312)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1397, file: !789, line: 391, baseType: !962, size: 32, align: 32, offset: 1344)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1397, file: !789, line: 396, baseType: !1019, size: 64, align: 64, offset: 1408)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1397, file: !789, line: 403, baseType: !1418, size: 512, align: 64, offset: 1472)
!1418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1306, size: 512, align: 64, elements: !1374)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1397, file: !789, line: 410, baseType: !962, size: 32, align: 32, offset: 1984)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1397, file: !789, line: 415, baseType: !962, size: 32, align: 32, offset: 2016)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1397, file: !789, line: 420, baseType: !962, size: 32, align: 32, offset: 2048)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1397, file: !789, line: 425, baseType: !962, size: 32, align: 32, offset: 2080)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1397, file: !789, line: 435, baseType: !1033, size: 64, align: 64, offset: 2112)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1397, file: !789, line: 440, baseType: !962, size: 32, align: 32, offset: 2176)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1397, file: !789, line: 445, baseType: !1306, size: 64, align: 64, offset: 2240)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1397, file: !789, line: 459, baseType: !1427, size: 512, align: 64, offset: 2304)
!1427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1138, size: 512, align: 64, elements: !1374)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1397, file: !789, line: 473, baseType: !1429, size: 64, align: 64, offset: 2816)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1397, file: !789, line: 477, baseType: !962, size: 32, align: 32, offset: 2880)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1397, file: !789, line: 479, baseType: !1432, size: 64, align: 64, offset: 2944)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1435)
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1436)
!1436 = !{!1437, !1438, !1439, !1440, !1445}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1435, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1435, file: !789, line: 203, baseType: !1148, size: 64, align: 64, offset: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1435, file: !789, line: 204, baseType: !962, size: 32, align: 32, offset: 128)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1435, file: !789, line: 205, baseType: !1441, size: 64, align: 64, offset: 192)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1443, line: 86, baseType: !1444)
!1443 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1444 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1443, line: 86, flags: DIFlagFwdDecl)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1435, file: !789, line: 206, baseType: !1138, size: 64, align: 64, offset: 256)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1397, file: !789, line: 480, baseType: !962, size: 32, align: 32, offset: 3008)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1397, file: !789, line: 505, baseType: !962, size: 32, align: 32, offset: 3040)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1397, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1397, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1397, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1397, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1397, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1397, file: !789, line: 532, baseType: !1033, size: 64, align: 64, offset: 3264)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1397, file: !789, line: 539, baseType: !1033, size: 64, align: 64, offset: 3328)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1397, file: !789, line: 547, baseType: !1033, size: 64, align: 64, offset: 3392)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1397, file: !789, line: 554, baseType: !1441, size: 64, align: 64, offset: 3456)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1397, file: !789, line: 563, baseType: !962, size: 32, align: 32, offset: 3520)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1397, file: !789, line: 572, baseType: !962, size: 32, align: 32, offset: 3552)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1397, file: !789, line: 581, baseType: !962, size: 32, align: 32, offset: 3584)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1397, file: !789, line: 588, baseType: !1461, size: 64, align: 64, offset: 3648)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !971, line: 36, baseType: !1463)
!1463 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1397, file: !789, line: 593, baseType: !962, size: 32, align: 32, offset: 3712)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1397, file: !789, line: 596, baseType: !962, size: 32, align: 32, offset: 3744)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1397, file: !789, line: 599, baseType: !1138, size: 64, align: 64, offset: 3776)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1397, file: !789, line: 605, baseType: !1138, size: 64, align: 64, offset: 3840)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1397, file: !789, line: 616, baseType: !1138, size: 64, align: 64, offset: 3904)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1397, file: !789, line: 626, baseType: !1470, size: 64, align: 64, offset: 3968)
!1470 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1471, line: 216, baseType: !1224)
!1471 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1397, file: !789, line: 627, baseType: !1470, size: 64, align: 64, offset: 4032)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1397, file: !789, line: 628, baseType: !1470, size: 64, align: 64, offset: 4096)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1397, file: !789, line: 629, baseType: !1470, size: 64, align: 64, offset: 4160)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1397, file: !789, line: 645, baseType: !1138, size: 64, align: 64, offset: 4224)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1284, file: !4, line: 3566, baseType: !1478, size: 64, align: 64, offset: 1408)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DISubroutineType(types: !1480)
!1480 = !{!962, !1274, !1019, !1476, !1133}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1284, file: !4, line: 3567, baseType: !1322, size: 64, align: 64, offset: 1472)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1284, file: !4, line: 3576, baseType: !1483, size: 64, align: 64, offset: 1536)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DISubroutineType(types: !1485)
!1485 = !{!962, !1274, !1394}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1284, file: !4, line: 3577, baseType: !1487, size: 64, align: 64, offset: 1600)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DISubroutineType(types: !1489)
!1489 = !{!962, !1274, !1133}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1284, file: !4, line: 3584, baseType: !1491, size: 64, align: 64, offset: 1664)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!962, !1274, !1494}
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1284, file: !4, line: 3589, baseType: !1496, size: 64, align: 64, offset: 1728)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{null, !1274}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1284, file: !4, line: 3594, baseType: !962, size: 32, align: 32, offset: 1792)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1284, file: !4, line: 3600, baseType: !992, size: 64, align: 64, offset: 1856)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1284, file: !4, line: 3609, baseType: !1502, size: 64, align: 64, offset: 1920)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1505)
!1505 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1276, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1276, file: !4, line: 1581, baseType: !963, size: 32, align: 32, offset: 224)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1276, file: !4, line: 1583, baseType: !1019, size: 64, align: 64, offset: 256)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1276, file: !4, line: 1591, baseType: !1510, size: 64, align: 64, offset: 320)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1336, line: 129, size: 1664, align: 64, elements: !1512)
!1512 = !{!1513, !1514, !1515, !1516, !1517, !1535, !1536, !1542, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1511, file: !1336, line: 136, baseType: !962, size: 32, align: 32)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1511, file: !1336, line: 151, baseType: !962, size: 32, align: 32, offset: 32)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1511, file: !1336, line: 157, baseType: !962, size: 32, align: 32, offset: 64)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1511, file: !1336, line: 159, baseType: !1494, size: 64, align: 64, offset: 128)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1511, file: !1336, line: 161, baseType: !1518, size: 64, align: 64, offset: 192)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1336, line: 117, baseType: !1520)
!1520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1336, line: 100, size: 832, align: 64, elements: !1521)
!1521 = !{!1522, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1520, file: !1336, line: 105, baseType: !1523, size: 256, align: 64)
!1523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1524, size: 256, align: 64, elements: !1380)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1140, line: 238, baseType: !1526)
!1526 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1140, line: 238, flags: DIFlagFwdDecl)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1520, file: !1336, line: 110, baseType: !962, size: 32, align: 32, offset: 256)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1520, file: !1336, line: 111, baseType: !962, size: 32, align: 32, offset: 288)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1520, file: !1336, line: 111, baseType: !962, size: 32, align: 32, offset: 320)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1520, file: !1336, line: 112, baseType: !1377, size: 256, align: 32, offset: 352)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1520, file: !1336, line: 113, baseType: !1383, size: 128, align: 32, offset: 608)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1520, file: !1336, line: 114, baseType: !962, size: 32, align: 32, offset: 736)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1520, file: !1336, line: 115, baseType: !962, size: 32, align: 32, offset: 768)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1520, file: !1336, line: 116, baseType: !962, size: 32, align: 32, offset: 800)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1511, file: !1336, line: 163, baseType: !1019, size: 64, align: 64, offset: 256)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1511, file: !1336, line: 165, baseType: !1537, size: 128, align: 64, offset: 320)
!1537 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1336, line: 122, baseType: !1538)
!1538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1336, line: 119, size: 128, align: 64, elements: !1539)
!1539 = !{!1540, !1541}
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1538, file: !1336, line: 120, baseType: !1133, size: 64, align: 64)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1538, file: !1336, line: 121, baseType: !1494, size: 64, align: 64, offset: 64)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1511, file: !1336, line: 166, baseType: !1543, size: 128, align: 64, offset: 448)
!1543 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1336, line: 127, baseType: !1544)
!1544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1336, line: 124, size: 128, align: 64, elements: !1545)
!1545 = !{!1546, !1619}
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1544, file: !1336, line: 125, baseType: !1547, size: 64, align: 64)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !1550)
!1550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !1551)
!1551 = !{!1552, !1553, !1577, !1581, !1582, !1616, !1617, !1618}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1550, file: !4, line: 5751, baseType: !1009, size: 64, align: 64)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1550, file: !4, line: 5756, baseType: !1554, size: 64, align: 64, offset: 64)
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1555, size: 64, align: 64)
!1555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1556)
!1556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !1557)
!1557 = !{!1558, !1559, !1562, !1563, !1564, !1568, !1572, !1576}
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1556, file: !4, line: 5797, baseType: !992, size: 64, align: 64)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1556, file: !4, line: 5804, baseType: !1560, size: 64, align: 64, offset: 64)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1556, file: !4, line: 5815, baseType: !1009, size: 64, align: 64, offset: 128)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1556, file: !4, line: 5825, baseType: !962, size: 32, align: 32, offset: 192)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1556, file: !4, line: 5826, baseType: !1565, size: 64, align: 64, offset: 256)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1566, size: 64, align: 64)
!1566 = !DISubroutineType(types: !1567)
!1567 = !{!962, !1548}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1556, file: !4, line: 5827, baseType: !1569, size: 64, align: 64, offset: 320)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64, align: 64)
!1570 = !DISubroutineType(types: !1571)
!1571 = !{!962, !1548, !1133}
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1556, file: !4, line: 5828, baseType: !1573, size: 64, align: 64, offset: 384)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DISubroutineType(types: !1575)
!1575 = !{null, !1548}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1556, file: !4, line: 5829, baseType: !1573, size: 64, align: 64, offset: 448)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1550, file: !4, line: 5762, baseType: !1578, size: 64, align: 64, offset: 128)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64, align: 64)
!1579 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !1580)
!1580 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1550, file: !4, line: 5768, baseType: !1019, size: 64, align: 64, offset: 192)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1550, file: !4, line: 5775, baseType: !1583, size: 64, align: 64, offset: 256)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !1585)
!1585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !1586)
!1586 = !{!1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615}
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1585, file: !4, line: 3940, baseType: !545, size: 32, align: 32)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1585, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1585, file: !4, line: 3948, baseType: !970, size: 32, align: 32, offset: 64)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1585, file: !4, line: 3958, baseType: !1148, size: 64, align: 64, offset: 128)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1585, file: !4, line: 3962, baseType: !962, size: 32, align: 32, offset: 192)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1585, file: !4, line: 3968, baseType: !962, size: 32, align: 32, offset: 224)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1585, file: !4, line: 3973, baseType: !1033, size: 64, align: 64, offset: 256)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1585, file: !4, line: 3986, baseType: !962, size: 32, align: 32, offset: 320)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1585, file: !4, line: 3999, baseType: !962, size: 32, align: 32, offset: 352)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1585, file: !4, line: 4004, baseType: !962, size: 32, align: 32, offset: 384)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1585, file: !4, line: 4005, baseType: !962, size: 32, align: 32, offset: 416)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1585, file: !4, line: 4010, baseType: !962, size: 32, align: 32, offset: 448)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1585, file: !4, line: 4011, baseType: !962, size: 32, align: 32, offset: 480)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1585, file: !4, line: 4020, baseType: !1039, size: 64, align: 32, offset: 512)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1585, file: !4, line: 4025, baseType: !889, size: 32, align: 32, offset: 576)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1585, file: !4, line: 4030, baseType: !812, size: 32, align: 32, offset: 608)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1585, file: !4, line: 4031, baseType: !818, size: 32, align: 32, offset: 640)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1585, file: !4, line: 4032, baseType: !836, size: 32, align: 32, offset: 672)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1585, file: !4, line: 4033, baseType: !860, size: 32, align: 32, offset: 704)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1585, file: !4, line: 4034, baseType: !879, size: 32, align: 32, offset: 736)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1585, file: !4, line: 4039, baseType: !962, size: 32, align: 32, offset: 768)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1585, file: !4, line: 4046, baseType: !1306, size: 64, align: 64, offset: 832)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1585, file: !4, line: 4050, baseType: !962, size: 32, align: 32, offset: 896)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1585, file: !4, line: 4054, baseType: !962, size: 32, align: 32, offset: 928)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1585, file: !4, line: 4061, baseType: !962, size: 32, align: 32, offset: 960)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1585, file: !4, line: 4065, baseType: !962, size: 32, align: 32, offset: 992)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1585, file: !4, line: 4073, baseType: !962, size: 32, align: 32, offset: 1024)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1585, file: !4, line: 4080, baseType: !962, size: 32, align: 32, offset: 1056)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1585, file: !4, line: 4084, baseType: !962, size: 32, align: 32, offset: 1088)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1550, file: !4, line: 5781, baseType: !1583, size: 64, align: 64, offset: 320)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1550, file: !4, line: 5787, baseType: !1039, size: 64, align: 32, offset: 384)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1550, file: !4, line: 5793, baseType: !1039, size: 64, align: 32, offset: 448)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1544, file: !1336, line: 126, baseType: !962, size: 32, align: 32, offset: 64)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1511, file: !1336, line: 172, baseType: !1133, size: 64, align: 64, offset: 576)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1511, file: !1336, line: 177, baseType: !1148, size: 64, align: 64, offset: 640)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1511, file: !1336, line: 178, baseType: !963, size: 32, align: 32, offset: 704)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1511, file: !1336, line: 180, baseType: !1019, size: 64, align: 64, offset: 768)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1511, file: !1336, line: 185, baseType: !962, size: 32, align: 32, offset: 832)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1511, file: !1336, line: 190, baseType: !1019, size: 64, align: 64, offset: 896)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1511, file: !1336, line: 195, baseType: !962, size: 32, align: 32, offset: 960)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1511, file: !1336, line: 200, baseType: !1133, size: 64, align: 64, offset: 1024)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1511, file: !1336, line: 201, baseType: !962, size: 32, align: 32, offset: 1088)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1511, file: !1336, line: 202, baseType: !1494, size: 64, align: 64, offset: 1152)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1511, file: !1336, line: 203, baseType: !962, size: 32, align: 32, offset: 1216)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1511, file: !1336, line: 205, baseType: !962, size: 32, align: 32, offset: 1248)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1511, file: !1336, line: 206, baseType: !962, size: 32, align: 32, offset: 1280)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1511, file: !1336, line: 209, baseType: !1470, size: 64, align: 64, offset: 1344)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1511, file: !1336, line: 212, baseType: !1470, size: 64, align: 64, offset: 1408)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1511, file: !1336, line: 213, baseType: !1494, size: 64, align: 64, offset: 1472)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1511, file: !1336, line: 215, baseType: !962, size: 32, align: 32, offset: 1536)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1511, file: !1336, line: 217, baseType: !962, size: 32, align: 32, offset: 1568)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1511, file: !1336, line: 220, baseType: !962, size: 32, align: 32, offset: 1600)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1276, file: !4, line: 1598, baseType: !1019, size: 64, align: 64, offset: 384)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1276, file: !4, line: 1606, baseType: !1033, size: 64, align: 64, offset: 448)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1276, file: !4, line: 1614, baseType: !962, size: 32, align: 32, offset: 512)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1276, file: !4, line: 1622, baseType: !962, size: 32, align: 32, offset: 544)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1276, file: !4, line: 1628, baseType: !962, size: 32, align: 32, offset: 576)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1276, file: !4, line: 1636, baseType: !962, size: 32, align: 32, offset: 608)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1276, file: !4, line: 1643, baseType: !962, size: 32, align: 32, offset: 640)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1276, file: !4, line: 1657, baseType: !1148, size: 64, align: 64, offset: 704)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1276, file: !4, line: 1658, baseType: !962, size: 32, align: 32, offset: 768)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1276, file: !4, line: 1679, baseType: !1039, size: 64, align: 32, offset: 800)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1276, file: !4, line: 1688, baseType: !962, size: 32, align: 32, offset: 864)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1276, file: !4, line: 1712, baseType: !962, size: 32, align: 32, offset: 896)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1276, file: !4, line: 1729, baseType: !962, size: 32, align: 32, offset: 928)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1276, file: !4, line: 1729, baseType: !962, size: 32, align: 32, offset: 960)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1276, file: !4, line: 1744, baseType: !962, size: 32, align: 32, offset: 992)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1276, file: !4, line: 1744, baseType: !962, size: 32, align: 32, offset: 1024)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1276, file: !4, line: 1751, baseType: !962, size: 32, align: 32, offset: 1056)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1276, file: !4, line: 1766, baseType: !555, size: 32, align: 32, offset: 1088)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1276, file: !4, line: 1791, baseType: !1658, size: 64, align: 64, offset: 1152)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DISubroutineType(types: !1660)
!1660 = !{null, !1661, !1394, !1476, !962, !962, !962}
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1276, file: !4, line: 1808, baseType: !1663, size: 64, align: 64, offset: 1216)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DISubroutineType(types: !1665)
!1665 = !{!555, !1661, !1295}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1276, file: !4, line: 1816, baseType: !962, size: 32, align: 32, offset: 1280)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1276, file: !4, line: 1825, baseType: !1668, size: 32, align: 32, offset: 1312)
!1668 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1276, file: !4, line: 1830, baseType: !962, size: 32, align: 32, offset: 1344)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1276, file: !4, line: 1838, baseType: !1668, size: 32, align: 32, offset: 1376)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1276, file: !4, line: 1846, baseType: !962, size: 32, align: 32, offset: 1408)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1276, file: !4, line: 1851, baseType: !962, size: 32, align: 32, offset: 1440)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1276, file: !4, line: 1861, baseType: !1668, size: 32, align: 32, offset: 1472)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1276, file: !4, line: 1868, baseType: !1668, size: 32, align: 32, offset: 1504)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1276, file: !4, line: 1875, baseType: !1668, size: 32, align: 32, offset: 1536)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1276, file: !4, line: 1882, baseType: !1668, size: 32, align: 32, offset: 1568)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1276, file: !4, line: 1889, baseType: !1668, size: 32, align: 32, offset: 1600)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1276, file: !4, line: 1896, baseType: !1668, size: 32, align: 32, offset: 1632)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1276, file: !4, line: 1903, baseType: !1668, size: 32, align: 32, offset: 1664)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1276, file: !4, line: 1910, baseType: !962, size: 32, align: 32, offset: 1696)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1276, file: !4, line: 1915, baseType: !962, size: 32, align: 32, offset: 1728)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1276, file: !4, line: 1926, baseType: !1476, size: 64, align: 64, offset: 1792)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1276, file: !4, line: 1935, baseType: !1039, size: 64, align: 32, offset: 1856)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1276, file: !4, line: 1942, baseType: !962, size: 32, align: 32, offset: 1920)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1276, file: !4, line: 1948, baseType: !962, size: 32, align: 32, offset: 1952)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1276, file: !4, line: 1954, baseType: !962, size: 32, align: 32, offset: 1984)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1276, file: !4, line: 1960, baseType: !962, size: 32, align: 32, offset: 2016)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1276, file: !4, line: 1984, baseType: !962, size: 32, align: 32, offset: 2048)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1276, file: !4, line: 1991, baseType: !962, size: 32, align: 32, offset: 2080)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1276, file: !4, line: 1996, baseType: !962, size: 32, align: 32, offset: 2112)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1276, file: !4, line: 2004, baseType: !962, size: 32, align: 32, offset: 2144)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1276, file: !4, line: 2011, baseType: !962, size: 32, align: 32, offset: 2176)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1276, file: !4, line: 2018, baseType: !962, size: 32, align: 32, offset: 2208)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1276, file: !4, line: 2027, baseType: !962, size: 32, align: 32, offset: 2240)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1276, file: !4, line: 2034, baseType: !962, size: 32, align: 32, offset: 2272)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1276, file: !4, line: 2044, baseType: !962, size: 32, align: 32, offset: 2304)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1276, file: !4, line: 2054, baseType: !984, size: 64, align: 64, offset: 2368)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1276, file: !4, line: 2061, baseType: !984, size: 64, align: 64, offset: 2432)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1276, file: !4, line: 2066, baseType: !962, size: 32, align: 32, offset: 2496)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1276, file: !4, line: 2070, baseType: !962, size: 32, align: 32, offset: 2528)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1276, file: !4, line: 2078, baseType: !962, size: 32, align: 32, offset: 2560)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1276, file: !4, line: 2085, baseType: !962, size: 32, align: 32, offset: 2592)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1276, file: !4, line: 2092, baseType: !962, size: 32, align: 32, offset: 2624)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1276, file: !4, line: 2099, baseType: !962, size: 32, align: 32, offset: 2656)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1276, file: !4, line: 2106, baseType: !962, size: 32, align: 32, offset: 2688)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1276, file: !4, line: 2113, baseType: !962, size: 32, align: 32, offset: 2720)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1276, file: !4, line: 2120, baseType: !962, size: 32, align: 32, offset: 2752)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1276, file: !4, line: 2125, baseType: !962, size: 32, align: 32, offset: 2784)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1276, file: !4, line: 2133, baseType: !962, size: 32, align: 32, offset: 2816)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1276, file: !4, line: 2140, baseType: !962, size: 32, align: 32, offset: 2848)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1276, file: !4, line: 2145, baseType: !962, size: 32, align: 32, offset: 2880)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1276, file: !4, line: 2153, baseType: !962, size: 32, align: 32, offset: 2912)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1276, file: !4, line: 2158, baseType: !962, size: 32, align: 32, offset: 2944)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1276, file: !4, line: 2166, baseType: !818, size: 32, align: 32, offset: 2976)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1276, file: !4, line: 2173, baseType: !836, size: 32, align: 32, offset: 3008)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1276, file: !4, line: 2180, baseType: !860, size: 32, align: 32, offset: 3040)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1276, file: !4, line: 2187, baseType: !812, size: 32, align: 32, offset: 3072)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1276, file: !4, line: 2194, baseType: !879, size: 32, align: 32, offset: 3104)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1276, file: !4, line: 2203, baseType: !962, size: 32, align: 32, offset: 3136)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1276, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1276, file: !4, line: 2212, baseType: !962, size: 32, align: 32, offset: 3200)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1276, file: !4, line: 2213, baseType: !962, size: 32, align: 32, offset: 3232)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1276, file: !4, line: 2220, baseType: !755, size: 32, align: 32, offset: 3264)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1276, file: !4, line: 2232, baseType: !962, size: 32, align: 32, offset: 3296)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1276, file: !4, line: 2243, baseType: !962, size: 32, align: 32, offset: 3328)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1276, file: !4, line: 2249, baseType: !962, size: 32, align: 32, offset: 3360)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1276, file: !4, line: 2256, baseType: !962, size: 32, align: 32, offset: 3392)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1276, file: !4, line: 2263, baseType: !1306, size: 64, align: 64, offset: 3456)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1276, file: !4, line: 2270, baseType: !1306, size: 64, align: 64, offset: 3520)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1276, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1276, file: !4, line: 2285, baseType: !755, size: 32, align: 32, offset: 3616)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1276, file: !4, line: 2367, baseType: !1733, size: 64, align: 64, offset: 3648)
!1733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1734, size: 64, align: 64)
!1734 = !DISubroutineType(types: !1735)
!1735 = !{!962, !1661, !1494, !962}
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1276, file: !4, line: 2383, baseType: !962, size: 32, align: 32, offset: 3712)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1276, file: !4, line: 2386, baseType: !1668, size: 32, align: 32, offset: 3744)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1276, file: !4, line: 2387, baseType: !1668, size: 32, align: 32, offset: 3776)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1276, file: !4, line: 2394, baseType: !962, size: 32, align: 32, offset: 3808)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1276, file: !4, line: 2401, baseType: !962, size: 32, align: 32, offset: 3840)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1276, file: !4, line: 2408, baseType: !962, size: 32, align: 32, offset: 3872)
