; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--vp8_parser.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--vp8_parser.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecParserContext = type { i8*, %struct.AVCodecParser*, i64, i64, i64, i32, i32, i64, i64, i64, i64, i32, i32, [4 x i64], [4 x i64], [4 x i64], i32, i64, [4 x i64], i32, i64, i32, i32, i32, [4 x i64], i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!840 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!841 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!842 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!843 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !509, line: 493, size: 32, align: 32, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861}
!845 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!846 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!847 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!848 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!849 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!850 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!851 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!852 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!853 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!854 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!855 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!856 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!857 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!858 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!859 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!860 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!861 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!862 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !509, line: 538, size: 32, align: 32, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871}
!864 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!865 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!866 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!867 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!868 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!869 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!870 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!871 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892}
!886 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!887 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!888 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!889 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!890 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!891 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!892 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!893 = !{!894, !899}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64, align: 64)
!895 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !897, line: 48, baseType: !898)
!897 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64, align: 64)
!900 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !902, line: 222, size: 16, align: 8, elements: !903)
!902 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!903 = !{!904}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !901, file: !902, line: 222, baseType: !905, size: 16, align: 16)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !897, line: 49, baseType: !906)
!906 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!907 = !{!908}
!908 = distinct !DIGlobalVariable(name: "ff_vp8_parser", scope: !0, file: !909, line: 76, type: !910, isLocal: false, isDefinition: true, variable: { [5 x i32], i32, i32 (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecParserContext*, %struct.AVCodecContext*, i8**, i32*, i8*, i32)*, void (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecContext*, i8*, i32)*, %struct.AVCodecParser* }* @ff_vp8_parser)
!909 = !DIFile(filename: "libavcodec/vp8_parser.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParser", file: !4, line: 5272, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParser", file: !4, line: 5259, size: 512, align: 64, elements: !912)
!912 = !{!913, !918, !919, !970, !1563, !1567, !1571}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !911, file: !4, line: 5260, baseType: !914, size: 160, align: 32)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 160, align: 32, elements: !916)
!915 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!916 = !{!917}
!917 = !DISubrange(count: 5)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !911, file: !4, line: 5261, baseType: !915, size: 32, align: 32, offset: 160)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "parser_init", scope: !911, file: !4, line: 5262, baseType: !920, size: 64, align: 64, offset: 192)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!915, !923}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParserContext", file: !4, line: 5257, baseType: !925)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParserContext", file: !4, line: 5092, size: 2816, align: 64, elements: !926)
!926 = !{!927, !929, !931, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !925, file: !4, line: 5093, baseType: !928, size: 64, align: 64)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !925, file: !4, line: 5094, baseType: !930, size: 64, align: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !925, file: !4, line: 5095, baseType: !932, size: 64, align: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !897, line: 40, baseType: !933)
!933 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "cur_offset", scope: !925, file: !4, line: 5096, baseType: !932, size: 64, align: 64, offset: 192)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame_offset", scope: !925, file: !4, line: 5098, baseType: !932, size: 64, align: 64, offset: 256)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !925, file: !4, line: 5100, baseType: !915, size: 32, align: 32, offset: 320)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !925, file: !4, line: 5110, baseType: !915, size: 32, align: 32, offset: 352)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !925, file: !4, line: 5111, baseType: !932, size: 64, align: 64, offset: 384)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !925, file: !4, line: 5112, baseType: !932, size: 64, align: 64, offset: 448)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "last_pts", scope: !925, file: !4, line: 5115, baseType: !932, size: 64, align: 64, offset: 512)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "last_dts", scope: !925, file: !4, line: 5116, baseType: !932, size: 64, align: 64, offset: 576)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "fetch_timestamp", scope: !925, file: !4, line: 5117, baseType: !915, size: 32, align: 32, offset: 640)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_start_index", scope: !925, file: !4, line: 5120, baseType: !915, size: 32, align: 32, offset: 672)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_offset", scope: !925, file: !4, line: 5121, baseType: !945, size: 256, align: 64, offset: 704)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 256, align: 64, elements: !946)
!946 = !{!947}
!947 = !DISubrange(count: 4)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pts", scope: !925, file: !4, line: 5122, baseType: !945, size: 256, align: 64, offset: 960)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_dts", scope: !925, file: !4, line: 5123, baseType: !945, size: 256, align: 64, offset: 1216)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !925, file: !4, line: 5125, baseType: !915, size: 32, align: 32, offset: 1472)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !925, file: !4, line: 5132, baseType: !932, size: 64, align: 64, offset: 1536)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_end", scope: !925, file: !4, line: 5133, baseType: !945, size: 256, align: 64, offset: 1600)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !925, file: !4, line: 5141, baseType: !915, size: 32, align: 32, offset: 1856)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !925, file: !4, line: 5148, baseType: !932, size: 64, align: 64, offset: 1920)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "dts_sync_point", scope: !925, file: !4, line: 5161, baseType: !915, size: 32, align: 32, offset: 1984)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "dts_ref_dts_delta", scope: !925, file: !4, line: 5176, baseType: !915, size: 32, align: 32, offset: 2016)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "pts_dts_delta", scope: !925, file: !4, line: 5190, baseType: !915, size: 32, align: 32, offset: 2048)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pos", scope: !925, file: !4, line: 5197, baseType: !945, size: 256, align: 64, offset: 2112)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !925, file: !4, line: 5202, baseType: !932, size: 64, align: 64, offset: 2368)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !925, file: !4, line: 5207, baseType: !932, size: 64, align: 64, offset: 2432)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !925, file: !4, line: 5214, baseType: !915, size: 32, align: 32, offset: 2496)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !925, file: !4, line: 5216, baseType: !3, size: 32, align: 32, offset: 2528)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "picture_structure", scope: !925, file: !4, line: 5226, baseType: !12, size: 32, align: 32, offset: 2560)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "output_picture_number", scope: !925, file: !4, line: 5234, baseType: !915, size: 32, align: 32, offset: 2592)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !925, file: !4, line: 5239, baseType: !915, size: 32, align: 32, offset: 2624)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !925, file: !4, line: 5240, baseType: !915, size: 32, align: 32, offset: 2656)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !925, file: !4, line: 5245, baseType: !915, size: 32, align: 32, offset: 2688)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !925, file: !4, line: 5246, baseType: !915, size: 32, align: 32, offset: 2720)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !925, file: !4, line: 5256, baseType: !915, size: 32, align: 32, offset: 2752)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "parser_parse", scope: !911, file: !4, line: 5265, baseType: !971, size: 64, align: 64, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!915, !923, !974, !1562, !1257, !894, !915}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !977)
!977 = !{!978, !1022, !1023, !1024, !1287, !1288, !1289, !1290, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1316, !1320, !1321, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1500, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !976, file: !4, line: 1561, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !19, line: 143, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !19, line: 67, size: 640, align: 64, elements: !983)
!983 = !{!984, !988, !992, !996, !997, !998, !999, !1003, !1009, !1011, !1015}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !982, file: !19, line: 72, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !982, file: !19, line: 78, baseType: !989, size: 64, align: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!985, !928}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !982, file: !19, line: 85, baseType: !993, size: 64, align: 64, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !19, line: 85, flags: DIFlagFwdDecl)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !982, file: !19, line: 93, baseType: !915, size: 32, align: 32, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !982, file: !19, line: 99, baseType: !915, size: 32, align: 32, offset: 224)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !982, file: !19, line: 108, baseType: !915, size: 32, align: 32, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !982, file: !19, line: 113, baseType: !1000, size: 64, align: 64, offset: 320)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!928, !928, !928}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !982, file: !19, line: 123, baseType: !1004, size: 64, align: 64, offset: 384)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!1007, !1007}
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !982, file: !19, line: 130, baseType: !1010, size: 32, align: 32, offset: 448)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !19, line: 48, baseType: !18)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !982, file: !19, line: 136, baseType: !1012, size: 64, align: 64, offset: 512)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!1010, !928}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !982, file: !19, line: 142, baseType: !1016, size: 64, align: 64, offset: 576)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!915, !1019, !928, !985, !915}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !19, line: 60, flags: DIFlagFwdDecl)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !976, file: !4, line: 1562, baseType: !915, size: 32, align: 32, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !976, file: !4, line: 1564, baseType: !39, size: 32, align: 32, offset: 96)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !976, file: !4, line: 1565, baseType: !1025, size: 64, align: 64, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1028)
!1028 = !{!1029, !1030, !1031, !1032, !1033, !1034, !1043, !1046, !1049, !1052, !1057, !1058, !1059, !1067, !1068, !1069, !1071, !1075, !1081, !1086, !1090, !1091, !1137, !1258, !1262, !1263, !1267, !1271, !1276, !1280, !1281, !1282}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1027, file: !4, line: 3475, baseType: !985, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1027, file: !4, line: 3480, baseType: !985, size: 64, align: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1027, file: !4, line: 3481, baseType: !39, size: 32, align: 32, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1027, file: !4, line: 3482, baseType: !49, size: 32, align: 32, offset: 160)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1027, file: !4, line: 3487, baseType: !915, size: 32, align: 32, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1027, file: !4, line: 3488, baseType: !1035, size: 64, align: 64, offset: 256)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1038, line: 61, baseType: !1039)
!1038 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1038, line: 58, size: 64, align: 32, elements: !1040)
!1040 = !{!1041, !1042}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1039, file: !1038, line: 59, baseType: !915, size: 32, align: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1039, file: !1038, line: 60, baseType: !915, size: 32, align: 32, offset: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1027, file: !4, line: 3489, baseType: !1044, size: 64, align: 64, offset: 320)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1027, file: !4, line: 3490, baseType: !1047, size: 64, align: 64, offset: 384)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !915)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1027, file: !4, line: 3491, baseType: !1050, size: 64, align: 64, offset: 448)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1027, file: !4, line: 3492, baseType: !1053, size: 64, align: 64, offset: 512)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1055)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !897, line: 55, baseType: !1056)
!1056 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1027, file: !4, line: 3493, baseType: !896, size: 8, align: 8, offset: 576)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1027, file: !4, line: 3494, baseType: !979, size: 64, align: 64, offset: 640)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1027, file: !4, line: 3495, baseType: !1060, size: 64, align: 64, offset: 704)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1062)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1064)
!1064 = !{!1065, !1066}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1063, file: !4, line: 3402, baseType: !915, size: 32, align: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1063, file: !4, line: 3403, baseType: !985, size: 64, align: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1027, file: !4, line: 3507, baseType: !985, size: 64, align: 64, offset: 768)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1027, file: !4, line: 3516, baseType: !915, size: 32, align: 32, offset: 832)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1027, file: !4, line: 3517, baseType: !1070, size: 64, align: 64, offset: 896)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1027, file: !4, line: 3527, baseType: !1072, size: 64, align: 64, offset: 960)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!915, !974}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1027, file: !4, line: 3535, baseType: !1076, size: 64, align: 64, offset: 1024)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!915, !974, !1079}
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1027, file: !4, line: 3541, baseType: !1082, size: 64, align: 64, offset: 1088)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1084)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1085)
!1085 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1027, file: !4, line: 3549, baseType: !1087, size: 64, align: 64, offset: 1152)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{null, !1070}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1027, file: !4, line: 3551, baseType: !1072, size: 64, align: 64, offset: 1216)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1027, file: !4, line: 3552, baseType: !1092, size: 64, align: 64, offset: 1280)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!915, !974, !1095, !915, !1096}
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1099)
!1099 = !{!1100, !1101, !1104, !1105, !1106, !1136}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1098, file: !4, line: 3921, baseType: !905, size: 16, align: 16)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1098, file: !4, line: 3922, baseType: !1102, size: 32, align: 32, offset: 32)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !897, line: 51, baseType: !1103)
!1103 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1098, file: !4, line: 3923, baseType: !1102, size: 32, align: 32, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1098, file: !4, line: 3924, baseType: !1103, size: 32, align: 32, offset: 96)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1098, file: !4, line: 3925, baseType: !1107, size: 64, align: 64, offset: 128)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1110)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1111)
!1111 = !{!1112, !1113, !1114, !1115, !1116, !1117, !1127, !1129, !1131, !1132, !1134, !1135}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1110, file: !4, line: 3886, baseType: !915, size: 32, align: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1110, file: !4, line: 3887, baseType: !915, size: 32, align: 32, offset: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1110, file: !4, line: 3888, baseType: !915, size: 32, align: 32, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1110, file: !4, line: 3889, baseType: !915, size: 32, align: 32, offset: 96)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1110, file: !4, line: 3890, baseType: !915, size: 32, align: 32, offset: 128)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1110, file: !4, line: 3897, baseType: !1118, size: 768, align: 64, offset: 192)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1119)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1120)
!1120 = !{!1121, !1125}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1119, file: !4, line: 3855, baseType: !1122, size: 512, align: 64)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1095, size: 512, align: 64, elements: !1123)
!1123 = !{!1124}
!1124 = !DISubrange(count: 8)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1119, file: !4, line: 3857, baseType: !1126, size: 256, align: 32, offset: 512)
!1126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 256, align: 32, elements: !1123)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1110, file: !4, line: 3903, baseType: !1128, size: 256, align: 64, offset: 960)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1095, size: 256, align: 64, elements: !946)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1110, file: !4, line: 3904, baseType: !1130, size: 128, align: 32, offset: 1216)
!1130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 128, align: 32, elements: !946)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1110, file: !4, line: 3906, baseType: !725, size: 32, align: 32, offset: 1344)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1110, file: !4, line: 3908, baseType: !1133, size: 64, align: 64, offset: 1408)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1110, file: !4, line: 3915, baseType: !1133, size: 64, align: 64, offset: 1472)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1110, file: !4, line: 3917, baseType: !915, size: 32, align: 32, offset: 1536)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1098, file: !4, line: 3926, baseType: !932, size: 64, align: 64, offset: 192)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1027, file: !4, line: 3564, baseType: !1138, size: 64, align: 64, offset: 1344)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!915, !974, !1141, !1175, !1257}
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1143)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1144)
!1144 = !{!1145, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1171, !1172, !1173, !1174}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1143, file: !4, line: 1451, baseType: !1146, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1148, line: 94, baseType: !1149)
!1148 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1148, line: 81, size: 192, align: 64, elements: !1150)
!1150 = !{!1151, !1155, !1156}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1149, file: !1148, line: 82, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1148, line: 73, baseType: !1154)
!1154 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1148, line: 73, flags: DIFlagFwdDecl)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1149, file: !1148, line: 89, baseType: !1095, size: 64, align: 64, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1149, file: !1148, line: 93, baseType: !915, size: 32, align: 32, offset: 128)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1143, file: !4, line: 1461, baseType: !932, size: 64, align: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1143, file: !4, line: 1467, baseType: !932, size: 64, align: 64, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1143, file: !4, line: 1468, baseType: !1095, size: 64, align: 64, offset: 192)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1143, file: !4, line: 1469, baseType: !915, size: 32, align: 32, offset: 256)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1143, file: !4, line: 1470, baseType: !915, size: 32, align: 32, offset: 288)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1143, file: !4, line: 1474, baseType: !915, size: 32, align: 32, offset: 320)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1143, file: !4, line: 1479, baseType: !1164, size: 64, align: 64, offset: 384)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1166)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1167)
!1167 = !{!1168, !1169, !1170}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1166, file: !4, line: 1412, baseType: !1095, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1166, file: !4, line: 1413, baseType: !915, size: 32, align: 32, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1166, file: !4, line: 1414, baseType: !731, size: 32, align: 32, offset: 96)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1143, file: !4, line: 1480, baseType: !915, size: 32, align: 32, offset: 448)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1143, file: !4, line: 1486, baseType: !932, size: 64, align: 64, offset: 512)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1143, file: !4, line: 1488, baseType: !932, size: 64, align: 64, offset: 576)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1143, file: !4, line: 1497, baseType: !932, size: 64, align: 64, offset: 640)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1177)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !772, line: 646, baseType: !1178)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !772, line: 268, size: 4288, align: 64, elements: !1179)
!1179 = !{!1180, !1181, !1182, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1209, !1211, !1212, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1245, !1246, !1247, !1248, !1249, !1250, !1253, !1254, !1255, !1256}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1178, file: !772, line: 282, baseType: !1122, size: 512, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1178, file: !772, line: 299, baseType: !1126, size: 256, align: 32, offset: 512)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1178, file: !772, line: 315, baseType: !1183, size: 64, align: 64, offset: 768)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1178, file: !772, line: 326, baseType: !915, size: 32, align: 32, offset: 832)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1178, file: !772, line: 326, baseType: !915, size: 32, align: 32, offset: 864)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1178, file: !772, line: 334, baseType: !915, size: 32, align: 32, offset: 896)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1178, file: !772, line: 341, baseType: !915, size: 32, align: 32, offset: 928)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1178, file: !772, line: 346, baseType: !915, size: 32, align: 32, offset: 960)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1178, file: !772, line: 351, baseType: !761, size: 32, align: 32, offset: 992)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1178, file: !772, line: 356, baseType: !1037, size: 64, align: 32, offset: 1024)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1178, file: !772, line: 361, baseType: !932, size: 64, align: 64, offset: 1088)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1178, file: !772, line: 369, baseType: !932, size: 64, align: 64, offset: 1152)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1178, file: !772, line: 377, baseType: !932, size: 64, align: 64, offset: 1216)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1178, file: !772, line: 382, baseType: !915, size: 32, align: 32, offset: 1280)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1178, file: !772, line: 386, baseType: !915, size: 32, align: 32, offset: 1312)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1178, file: !772, line: 391, baseType: !915, size: 32, align: 32, offset: 1344)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1178, file: !772, line: 396, baseType: !928, size: 64, align: 64, offset: 1408)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1178, file: !772, line: 403, baseType: !1199, size: 512, align: 64, offset: 1472)
!1199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 512, align: 64, elements: !1123)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1178, file: !772, line: 410, baseType: !915, size: 32, align: 32, offset: 1984)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1178, file: !772, line: 415, baseType: !915, size: 32, align: 32, offset: 2016)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1178, file: !772, line: 420, baseType: !915, size: 32, align: 32, offset: 2048)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1178, file: !772, line: 425, baseType: !915, size: 32, align: 32, offset: 2080)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1178, file: !772, line: 435, baseType: !932, size: 64, align: 64, offset: 2112)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1178, file: !772, line: 440, baseType: !915, size: 32, align: 32, offset: 2176)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1178, file: !772, line: 445, baseType: !1055, size: 64, align: 64, offset: 2240)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1178, file: !772, line: 459, baseType: !1208, size: 512, align: 64, offset: 2304)
!1208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1146, size: 512, align: 64, elements: !1123)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1178, file: !772, line: 473, baseType: !1210, size: 64, align: 64, offset: 2816)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1178, file: !772, line: 477, baseType: !915, size: 32, align: 32, offset: 2880)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1178, file: !772, line: 479, baseType: !1213, size: 64, align: 64, offset: 2944)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !772, line: 207, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !772, line: 201, size: 320, align: 64, elements: !1217)
!1217 = !{!1218, !1219, !1220, !1221, !1226}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1216, file: !772, line: 202, baseType: !771, size: 32, align: 32)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1216, file: !772, line: 203, baseType: !1095, size: 64, align: 64, offset: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1216, file: !772, line: 204, baseType: !915, size: 32, align: 32, offset: 128)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1216, file: !772, line: 205, baseType: !1222, size: 64, align: 64, offset: 192)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1224, line: 86, baseType: !1225)
!1224 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1225 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1224, line: 86, flags: DIFlagFwdDecl)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1216, file: !772, line: 206, baseType: !1146, size: 64, align: 64, offset: 256)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1178, file: !772, line: 480, baseType: !915, size: 32, align: 32, offset: 3008)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1178, file: !772, line: 505, baseType: !915, size: 32, align: 32, offset: 3040)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1178, file: !772, line: 512, baseType: !795, size: 32, align: 32, offset: 3072)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1178, file: !772, line: 514, baseType: !801, size: 32, align: 32, offset: 3104)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1178, file: !772, line: 516, baseType: !819, size: 32, align: 32, offset: 3136)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1178, file: !772, line: 523, baseType: !843, size: 32, align: 32, offset: 3168)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1178, file: !772, line: 525, baseType: !862, size: 32, align: 32, offset: 3200)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1178, file: !772, line: 532, baseType: !932, size: 64, align: 64, offset: 3264)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1178, file: !772, line: 539, baseType: !932, size: 64, align: 64, offset: 3328)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1178, file: !772, line: 547, baseType: !932, size: 64, align: 64, offset: 3392)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1178, file: !772, line: 554, baseType: !1222, size: 64, align: 64, offset: 3456)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1178, file: !772, line: 563, baseType: !915, size: 32, align: 32, offset: 3520)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1178, file: !772, line: 572, baseType: !915, size: 32, align: 32, offset: 3552)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1178, file: !772, line: 581, baseType: !915, size: 32, align: 32, offset: 3584)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1178, file: !772, line: 588, baseType: !1242, size: 64, align: 64, offset: 3648)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !897, line: 36, baseType: !1244)
!1244 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1178, file: !772, line: 593, baseType: !915, size: 32, align: 32, offset: 3712)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1178, file: !772, line: 596, baseType: !915, size: 32, align: 32, offset: 3744)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1178, file: !772, line: 599, baseType: !1146, size: 64, align: 64, offset: 3776)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1178, file: !772, line: 605, baseType: !1146, size: 64, align: 64, offset: 3840)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1178, file: !772, line: 616, baseType: !1146, size: 64, align: 64, offset: 3904)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1178, file: !772, line: 626, baseType: !1251, size: 64, align: 64, offset: 3968)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1252, line: 216, baseType: !1056)
!1252 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1178, file: !772, line: 627, baseType: !1251, size: 64, align: 64, offset: 4032)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1178, file: !772, line: 628, baseType: !1251, size: 64, align: 64, offset: 4096)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1178, file: !772, line: 629, baseType: !1251, size: 64, align: 64, offset: 4160)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1178, file: !772, line: 645, baseType: !1146, size: 64, align: 64, offset: 4224)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1027, file: !4, line: 3566, baseType: !1259, size: 64, align: 64, offset: 1408)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!915, !974, !928, !1257, !1141}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1027, file: !4, line: 3567, baseType: !1072, size: 64, align: 64, offset: 1472)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1027, file: !4, line: 3576, baseType: !1264, size: 64, align: 64, offset: 1536)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!915, !974, !1175}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1027, file: !4, line: 3577, baseType: !1268, size: 64, align: 64, offset: 1600)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!915, !974, !1141}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1027, file: !4, line: 3584, baseType: !1272, size: 64, align: 64, offset: 1664)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{!915, !974, !1275}
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1027, file: !4, line: 3589, baseType: !1277, size: 64, align: 64, offset: 1728)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{null, !974}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1027, file: !4, line: 3594, baseType: !915, size: 32, align: 32, offset: 1792)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1027, file: !4, line: 3600, baseType: !985, size: 64, align: 64, offset: 1856)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1027, file: !4, line: 3609, baseType: !1283, size: 64, align: 64, offset: 1920)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1286)
!1286 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !976, file: !4, line: 1566, baseType: !49, size: 32, align: 32, offset: 192)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !976, file: !4, line: 1581, baseType: !1103, size: 32, align: 32, offset: 224)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !976, file: !4, line: 1583, baseType: !928, size: 64, align: 64, offset: 256)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !976, file: !4, line: 1591, baseType: !1291, size: 64, align: 64, offset: 320)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !976, file: !4, line: 1598, baseType: !928, size: 64, align: 64, offset: 384)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !976, file: !4, line: 1606, baseType: !932, size: 64, align: 64, offset: 448)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !976, file: !4, line: 1614, baseType: !915, size: 32, align: 32, offset: 512)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !976, file: !4, line: 1622, baseType: !915, size: 32, align: 32, offset: 544)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !976, file: !4, line: 1628, baseType: !915, size: 32, align: 32, offset: 576)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !976, file: !4, line: 1636, baseType: !915, size: 32, align: 32, offset: 608)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !976, file: !4, line: 1643, baseType: !915, size: 32, align: 32, offset: 640)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !976, file: !4, line: 1657, baseType: !1095, size: 64, align: 64, offset: 704)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !976, file: !4, line: 1658, baseType: !915, size: 32, align: 32, offset: 768)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !976, file: !4, line: 1679, baseType: !1037, size: 64, align: 32, offset: 800)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !976, file: !4, line: 1688, baseType: !915, size: 32, align: 32, offset: 864)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !976, file: !4, line: 1712, baseType: !915, size: 32, align: 32, offset: 896)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !976, file: !4, line: 1729, baseType: !915, size: 32, align: 32, offset: 928)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !976, file: !4, line: 1729, baseType: !915, size: 32, align: 32, offset: 960)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !976, file: !4, line: 1744, baseType: !915, size: 32, align: 32, offset: 992)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !976, file: !4, line: 1744, baseType: !915, size: 32, align: 32, offset: 1024)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !976, file: !4, line: 1751, baseType: !915, size: 32, align: 32, offset: 1056)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !976, file: !4, line: 1766, baseType: !508, size: 32, align: 32, offset: 1088)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !976, file: !4, line: 1791, baseType: !1312, size: 64, align: 64, offset: 1152)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{null, !1315, !1175, !1257, !915, !915, !915}
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !976, file: !4, line: 1808, baseType: !1317, size: 64, align: 64, offset: 1216)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!508, !1315, !1044}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !976, file: !4, line: 1816, baseType: !915, size: 32, align: 32, offset: 1280)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !976, file: !4, line: 1825, baseType: !1322, size: 32, align: 32, offset: 1312)
!1322 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !976, file: !4, line: 1830, baseType: !915, size: 32, align: 32, offset: 1344)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !976, file: !4, line: 1838, baseType: !1322, size: 32, align: 32, offset: 1376)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !976, file: !4, line: 1846, baseType: !915, size: 32, align: 32, offset: 1408)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !976, file: !4, line: 1851, baseType: !915, size: 32, align: 32, offset: 1440)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !976, file: !4, line: 1861, baseType: !1322, size: 32, align: 32, offset: 1472)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !976, file: !4, line: 1868, baseType: !1322, size: 32, align: 32, offset: 1504)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !976, file: !4, line: 1875, baseType: !1322, size: 32, align: 32, offset: 1536)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !976, file: !4, line: 1882, baseType: !1322, size: 32, align: 32, offset: 1568)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !976, file: !4, line: 1889, baseType: !1322, size: 32, align: 32, offset: 1600)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !976, file: !4, line: 1896, baseType: !1322, size: 32, align: 32, offset: 1632)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !976, file: !4, line: 1903, baseType: !1322, size: 32, align: 32, offset: 1664)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !976, file: !4, line: 1910, baseType: !915, size: 32, align: 32, offset: 1696)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !976, file: !4, line: 1915, baseType: !915, size: 32, align: 32, offset: 1728)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !976, file: !4, line: 1926, baseType: !1257, size: 64, align: 64, offset: 1792)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !976, file: !4, line: 1935, baseType: !1037, size: 64, align: 32, offset: 1856)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !976, file: !4, line: 1942, baseType: !915, size: 32, align: 32, offset: 1920)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !976, file: !4, line: 1948, baseType: !915, size: 32, align: 32, offset: 1952)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !976, file: !4, line: 1954, baseType: !915, size: 32, align: 32, offset: 1984)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !976, file: !4, line: 1960, baseType: !915, size: 32, align: 32, offset: 2016)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !976, file: !4, line: 1984, baseType: !915, size: 32, align: 32, offset: 2048)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !976, file: !4, line: 1991, baseType: !915, size: 32, align: 32, offset: 2080)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !976, file: !4, line: 1996, baseType: !915, size: 32, align: 32, offset: 2112)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !976, file: !4, line: 2004, baseType: !915, size: 32, align: 32, offset: 2144)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !976, file: !4, line: 2011, baseType: !915, size: 32, align: 32, offset: 2176)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !976, file: !4, line: 2018, baseType: !915, size: 32, align: 32, offset: 2208)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !976, file: !4, line: 2027, baseType: !915, size: 32, align: 32, offset: 2240)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !976, file: !4, line: 2034, baseType: !915, size: 32, align: 32, offset: 2272)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !976, file: !4, line: 2044, baseType: !915, size: 32, align: 32, offset: 2304)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !976, file: !4, line: 2054, baseType: !1352, size: 64, align: 64, offset: 2368)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !976, file: !4, line: 2061, baseType: !1352, size: 64, align: 64, offset: 2432)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !976, file: !4, line: 2066, baseType: !915, size: 32, align: 32, offset: 2496)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !976, file: !4, line: 2070, baseType: !915, size: 32, align: 32, offset: 2528)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !976, file: !4, line: 2078, baseType: !915, size: 32, align: 32, offset: 2560)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !976, file: !4, line: 2085, baseType: !915, size: 32, align: 32, offset: 2592)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !976, file: !4, line: 2092, baseType: !915, size: 32, align: 32, offset: 2624)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !976, file: !4, line: 2099, baseType: !915, size: 32, align: 32, offset: 2656)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !976, file: !4, line: 2106, baseType: !915, size: 32, align: 32, offset: 2688)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !976, file: !4, line: 2113, baseType: !915, size: 32, align: 32, offset: 2720)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !976, file: !4, line: 2120, baseType: !915, size: 32, align: 32, offset: 2752)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !976, file: !4, line: 2125, baseType: !915, size: 32, align: 32, offset: 2784)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !976, file: !4, line: 2133, baseType: !915, size: 32, align: 32, offset: 2816)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !976, file: !4, line: 2140, baseType: !915, size: 32, align: 32, offset: 2848)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !976, file: !4, line: 2145, baseType: !915, size: 32, align: 32, offset: 2880)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !976, file: !4, line: 2153, baseType: !915, size: 32, align: 32, offset: 2912)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !976, file: !4, line: 2158, baseType: !915, size: 32, align: 32, offset: 2944)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !976, file: !4, line: 2166, baseType: !801, size: 32, align: 32, offset: 2976)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !976, file: !4, line: 2173, baseType: !819, size: 32, align: 32, offset: 3008)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !976, file: !4, line: 2180, baseType: !843, size: 32, align: 32, offset: 3040)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !976, file: !4, line: 2187, baseType: !795, size: 32, align: 32, offset: 3072)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !976, file: !4, line: 2194, baseType: !862, size: 32, align: 32, offset: 3104)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !976, file: !4, line: 2203, baseType: !915, size: 32, align: 32, offset: 3136)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !976, file: !4, line: 2209, baseType: !3, size: 32, align: 32, offset: 3168)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !976, file: !4, line: 2212, baseType: !915, size: 32, align: 32, offset: 3200)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !976, file: !4, line: 2213, baseType: !915, size: 32, align: 32, offset: 3232)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !976, file: !4, line: 2220, baseType: !708, size: 32, align: 32, offset: 3264)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !976, file: !4, line: 2232, baseType: !915, size: 32, align: 32, offset: 3296)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !976, file: !4, line: 2243, baseType: !915, size: 32, align: 32, offset: 3328)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !976, file: !4, line: 2249, baseType: !915, size: 32, align: 32, offset: 3360)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !976, file: !4, line: 2256, baseType: !915, size: 32, align: 32, offset: 3392)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !976, file: !4, line: 2263, baseType: !1055, size: 64, align: 64, offset: 3456)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !976, file: !4, line: 2270, baseType: !1055, size: 64, align: 64, offset: 3520)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !976, file: !4, line: 2277, baseType: !872, size: 32, align: 32, offset: 3584)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !976, file: !4, line: 2285, baseType: !708, size: 32, align: 32, offset: 3616)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !976, file: !4, line: 2367, baseType: !1388, size: 64, align: 64, offset: 3648)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DISubroutineType(types: !1390)
!1390 = !{!915, !1315, !1275, !915}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !976, file: !4, line: 2383, baseType: !915, size: 32, align: 32, offset: 3712)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !976, file: !4, line: 2386, baseType: !1322, size: 32, align: 32, offset: 3744)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !976, file: !4, line: 2387, baseType: !1322, size: 32, align: 32, offset: 3776)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !976, file: !4, line: 2394, baseType: !915, size: 32, align: 32, offset: 3808)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !976, file: !4, line: 2401, baseType: !915, size: 32, align: 32, offset: 3840)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !976, file: !4, line: 2408, baseType: !915, size: 32, align: 32, offset: 3872)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !976, file: !4, line: 2415, baseType: !915, size: 32, align: 32, offset: 3904)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !976, file: !4, line: 2422, baseType: !915, size: 32, align: 32, offset: 3936)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !976, file: !4, line: 2423, baseType: !1400, size: 64, align: 64, offset: 3968)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1402)
!1402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1403)
!1403 = !{!1404, !1405, !1406, !1407}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1402, file: !4, line: 827, baseType: !915, size: 32, align: 32)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1402, file: !4, line: 828, baseType: !915, size: 32, align: 32, offset: 32)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1402, file: !4, line: 829, baseType: !915, size: 32, align: 32, offset: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1402, file: !4, line: 830, baseType: !1322, size: 32, align: 32, offset: 96)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !976, file: !4, line: 2430, baseType: !932, size: 64, align: 64, offset: 4032)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !976, file: !4, line: 2437, baseType: !932, size: 64, align: 64, offset: 4096)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !976, file: !4, line: 2444, baseType: !1322, size: 32, align: 32, offset: 4160)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !976, file: !4, line: 2451, baseType: !1322, size: 32, align: 32, offset: 4192)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !976, file: !4, line: 2458, baseType: !915, size: 32, align: 32, offset: 4224)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !976, file: !4, line: 2469, baseType: !915, size: 32, align: 32, offset: 4256)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !976, file: !4, line: 2475, baseType: !915, size: 32, align: 32, offset: 4288)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !976, file: !4, line: 2481, baseType: !915, size: 32, align: 32, offset: 4320)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !976, file: !4, line: 2485, baseType: !915, size: 32, align: 32, offset: 4352)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !976, file: !4, line: 2489, baseType: !915, size: 32, align: 32, offset: 4384)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !976, file: !4, line: 2493, baseType: !915, size: 32, align: 32, offset: 4416)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !976, file: !4, line: 2501, baseType: !915, size: 32, align: 32, offset: 4448)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !976, file: !4, line: 2506, baseType: !915, size: 32, align: 32, offset: 4480)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !976, file: !4, line: 2510, baseType: !915, size: 32, align: 32, offset: 4512)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !976, file: !4, line: 2514, baseType: !932, size: 64, align: 64, offset: 4544)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !976, file: !4, line: 2528, baseType: !1424, size: 64, align: 64, offset: 4608)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DISubroutineType(types: !1426)
!1426 = !{null, !1315, !928, !915, !915}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !976, file: !4, line: 2534, baseType: !915, size: 32, align: 32, offset: 4672)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !976, file: !4, line: 2545, baseType: !915, size: 32, align: 32, offset: 4704)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !976, file: !4, line: 2547, baseType: !915, size: 32, align: 32, offset: 4736)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !976, file: !4, line: 2549, baseType: !915, size: 32, align: 32, offset: 4768)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !976, file: !4, line: 2551, baseType: !915, size: 32, align: 32, offset: 4800)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !976, file: !4, line: 2553, baseType: !915, size: 32, align: 32, offset: 4832)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !976, file: !4, line: 2555, baseType: !915, size: 32, align: 32, offset: 4864)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !976, file: !4, line: 2557, baseType: !915, size: 32, align: 32, offset: 4896)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !976, file: !4, line: 2559, baseType: !915, size: 32, align: 32, offset: 4928)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !976, file: !4, line: 2563, baseType: !915, size: 32, align: 32, offset: 4960)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !976, file: !4, line: 2571, baseType: !1133, size: 64, align: 64, offset: 4992)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !976, file: !4, line: 2579, baseType: !1133, size: 64, align: 64, offset: 5056)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !976, file: !4, line: 2586, baseType: !915, size: 32, align: 32, offset: 5120)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !976, file: !4, line: 2615, baseType: !915, size: 32, align: 32, offset: 5152)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !976, file: !4, line: 2627, baseType: !915, size: 32, align: 32, offset: 5184)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !976, file: !4, line: 2637, baseType: !915, size: 32, align: 32, offset: 5216)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !976, file: !4, line: 2681, baseType: !915, size: 32, align: 32, offset: 5248)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !976, file: !4, line: 2709, baseType: !932, size: 64, align: 64, offset: 5312)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !976, file: !4, line: 2716, baseType: !1446, size: 64, align: 64, offset: 5376)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1448)
!1448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1449)
!1449 = !{!1450, !1451, !1452, !1453, !1454, !1455, !1456, !1460, !1464, !1465, !1466, !1467, !1473, !1474, !1475, !1476, !1477}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1448, file: !4, line: 3642, baseType: !985, size: 64, align: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1448, file: !4, line: 3649, baseType: !39, size: 32, align: 32, offset: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1448, file: !4, line: 3656, baseType: !49, size: 32, align: 32, offset: 96)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1448, file: !4, line: 3663, baseType: !508, size: 32, align: 32, offset: 128)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1448, file: !4, line: 3669, baseType: !915, size: 32, align: 32, offset: 160)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1448, file: !4, line: 3682, baseType: !1272, size: 64, align: 64, offset: 192)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1448, file: !4, line: 3698, baseType: !1457, size: 64, align: 64, offset: 256)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!915, !974, !894, !1102}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1448, file: !4, line: 3712, baseType: !1461, size: 64, align: 64, offset: 320)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!915, !974, !915, !894, !1102}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1448, file: !4, line: 3726, baseType: !1457, size: 64, align: 64, offset: 384)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1448, file: !4, line: 3737, baseType: !1072, size: 64, align: 64, offset: 448)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1448, file: !4, line: 3746, baseType: !915, size: 32, align: 32, offset: 512)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1448, file: !4, line: 3757, baseType: !1468, size: 64, align: 64, offset: 576)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{null, !1471}
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1448, file: !4, line: 3766, baseType: !1072, size: 64, align: 64, offset: 640)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1448, file: !4, line: 3774, baseType: !1072, size: 64, align: 64, offset: 704)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1448, file: !4, line: 3780, baseType: !915, size: 32, align: 32, offset: 768)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1448, file: !4, line: 3785, baseType: !915, size: 32, align: 32, offset: 800)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1448, file: !4, line: 3795, baseType: !1478, size: 64, align: 64, offset: 832)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DISubroutineType(types: !1480)
!1480 = !{!915, !974, !1146}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !976, file: !4, line: 2728, baseType: !928, size: 64, align: 64, offset: 5440)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !976, file: !4, line: 2735, baseType: !1199, size: 512, align: 64, offset: 5504)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !976, file: !4, line: 2742, baseType: !915, size: 32, align: 32, offset: 6016)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !976, file: !4, line: 2755, baseType: !915, size: 32, align: 32, offset: 6048)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !976, file: !4, line: 2776, baseType: !915, size: 32, align: 32, offset: 6080)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !976, file: !4, line: 2783, baseType: !915, size: 32, align: 32, offset: 6112)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !976, file: !4, line: 2791, baseType: !915, size: 32, align: 32, offset: 6144)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !976, file: !4, line: 2802, baseType: !1275, size: 64, align: 64, offset: 6208)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !976, file: !4, line: 2811, baseType: !915, size: 32, align: 32, offset: 6272)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !976, file: !4, line: 2821, baseType: !915, size: 32, align: 32, offset: 6304)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !976, file: !4, line: 2830, baseType: !915, size: 32, align: 32, offset: 6336)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !976, file: !4, line: 2840, baseType: !915, size: 32, align: 32, offset: 6368)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !976, file: !4, line: 2851, baseType: !1494, size: 64, align: 64, offset: 6400)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DISubroutineType(types: !1496)
!1496 = !{!915, !1315, !1497, !928, !1257, !915, !915}
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{!915, !1315, !928}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !976, file: !4, line: 2871, baseType: !1501, size: 64, align: 64, offset: 6464)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{!915, !1315, !1504, !928, !1257, !915}
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{!915, !1315, !928, !915, !915}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !976, file: !4, line: 2878, baseType: !915, size: 32, align: 32, offset: 6528)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !976, file: !4, line: 2885, baseType: !915, size: 32, align: 32, offset: 6560)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !976, file: !4, line: 3005, baseType: !915, size: 32, align: 32, offset: 6592)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !976, file: !4, line: 3013, baseType: !884, size: 32, align: 32, offset: 6624)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !976, file: !4, line: 3020, baseType: !884, size: 32, align: 32, offset: 6656)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !976, file: !4, line: 3027, baseType: !884, size: 32, align: 32, offset: 6688)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !976, file: !4, line: 3037, baseType: !1095, size: 64, align: 64, offset: 6720)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !976, file: !4, line: 3038, baseType: !915, size: 32, align: 32, offset: 6784)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !976, file: !4, line: 3050, baseType: !1055, size: 64, align: 64, offset: 6848)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !976, file: !4, line: 3065, baseType: !915, size: 32, align: 32, offset: 6912)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !976, file: !4, line: 3083, baseType: !915, size: 32, align: 32, offset: 6944)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !976, file: !4, line: 3092, baseType: !1037, size: 64, align: 32, offset: 6976)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !976, file: !4, line: 3099, baseType: !508, size: 32, align: 32, offset: 7040)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !976, file: !4, line: 3106, baseType: !1037, size: 64, align: 32, offset: 7072)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !976, file: !4, line: 3113, baseType: !1522, size: 64, align: 64, offset: 7168)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!1523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1524)
!1524 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1525)
!1525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1526)
!1526 = !{!1527, !1528, !1529, !1530, !1531, !1532, !1535}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1525, file: !4, line: 713, baseType: !49, size: 32, align: 32)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1525, file: !4, line: 714, baseType: !39, size: 32, align: 32, offset: 32)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1525, file: !4, line: 720, baseType: !985, size: 64, align: 64, offset: 64)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1525, file: !4, line: 724, baseType: !985, size: 64, align: 64, offset: 128)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1525, file: !4, line: 728, baseType: !915, size: 32, align: 32, offset: 192)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1525, file: !4, line: 734, baseType: !1533, size: 64, align: 64, offset: 256)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64, align: 64)
!1534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1525, file: !4, line: 739, baseType: !1536, size: 64, align: 64, offset: 320)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1063)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !976, file: !4, line: 3129, baseType: !932, size: 64, align: 64, offset: 7232)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !976, file: !4, line: 3130, baseType: !932, size: 64, align: 64, offset: 7296)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !976, file: !4, line: 3131, baseType: !932, size: 64, align: 64, offset: 7360)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !976, file: !4, line: 3132, baseType: !932, size: 64, align: 64, offset: 7424)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !976, file: !4, line: 3139, baseType: !1133, size: 64, align: 64, offset: 7488)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !976, file: !4, line: 3147, baseType: !915, size: 32, align: 32, offset: 7552)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !976, file: !4, line: 3165, baseType: !915, size: 32, align: 32, offset: 7584)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !976, file: !4, line: 3172, baseType: !915, size: 32, align: 32, offset: 7616)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !976, file: !4, line: 3180, baseType: !915, size: 32, align: 32, offset: 7648)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !976, file: !4, line: 3191, baseType: !1352, size: 64, align: 64, offset: 7680)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !976, file: !4, line: 3199, baseType: !1095, size: 64, align: 64, offset: 7744)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !976, file: !4, line: 3207, baseType: !1133, size: 64, align: 64, offset: 7808)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !976, file: !4, line: 3214, baseType: !1103, size: 32, align: 32, offset: 7872)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !976, file: !4, line: 3224, baseType: !1164, size: 64, align: 64, offset: 7936)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !976, file: !4, line: 3225, baseType: !915, size: 32, align: 32, offset: 8000)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !976, file: !4, line: 3249, baseType: !1146, size: 64, align: 64, offset: 8064)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !976, file: !4, line: 3256, baseType: !915, size: 32, align: 32, offset: 8128)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !976, file: !4, line: 3271, baseType: !915, size: 32, align: 32, offset: 8160)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !976, file: !4, line: 3279, baseType: !932, size: 64, align: 64, offset: 8192)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !976, file: !4, line: 3301, baseType: !1146, size: 64, align: 64, offset: 8256)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !976, file: !4, line: 3310, baseType: !915, size: 32, align: 32, offset: 8320)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !976, file: !4, line: 3337, baseType: !915, size: 32, align: 32, offset: 8352)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !976, file: !4, line: 3351, baseType: !915, size: 32, align: 32, offset: 8384)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !976, file: !4, line: 3359, baseType: !915, size: 32, align: 32, offset: 8416)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64, align: 64)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "parser_close", scope: !911, file: !4, line: 5269, baseType: !1564, size: 64, align: 64, offset: 320)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DISubroutineType(types: !1566)
!1566 = !{null, !923}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !911, file: !4, line: 5270, baseType: !1568, size: 64, align: 64, offset: 384)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DISubroutineType(types: !1570)
!1570 = !{!915, !974, !894, !915}
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !911, file: !4, line: 5271, baseType: !930, size: 64, align: 64, offset: 448)
!1572 = !{i32 2, !"Dwarf Version", i32 4}
!1573 = !{i32 2, !"Debug Info Version", i32 3}
!1574 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1575 = distinct !DISubprogram(name: "parse", scope: !909, file: !909, line: 23, type: !972, isLocal: true, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1576)
!1576 = !{}
!1577 = !DILocalVariable(name: "s", arg: 1, scope: !1575, file: !909, line: 23, type: !923)
!1578 = !DIExpression()
!1579 = !DILocation(line: 23, column: 40, scope: !1575)
!1580 = !DILocalVariable(name: "avctx", arg: 2, scope: !1575, file: !909, line: 24, type: !974)
!1581 = !DILocation(line: 24, column: 34, scope: !1575)
!1582 = !DILocalVariable(name: "poutbuf", arg: 3, scope: !1575, file: !909, line: 25, type: !1562)
!1583 = !DILocation(line: 25, column: 34, scope: !1575)
!1584 = !DILocalVariable(name: "poutbuf_size", arg: 4, scope: !1575, file: !909, line: 25, type: !1257)
!1585 = !DILocation(line: 25, column: 48, scope: !1575)
!1586 = !DILocalVariable(name: "buf", arg: 5, scope: !1575, file: !909, line: 26, type: !894)
!1587 = !DILocation(line: 26, column: 33, scope: !1575)
!1588 = !DILocalVariable(name: "buf_size", arg: 6, scope: !1575, file: !909, line: 26, type: !915)
!1589 = !DILocation(line: 26, column: 42, scope: !1575)
!1590 = !DILocalVariable(name: "frame_type", scope: !1575, file: !909, line: 28, type: !1103)
!1591 = !DILocation(line: 28, column: 18, scope: !1575)
!1592 = !DILocalVariable(name: "profile", scope: !1575, file: !909, line: 29, type: !1103)
!1593 = !DILocation(line: 29, column: 18, scope: !1575)
!1594 = !DILocation(line: 31, column: 16, scope: !1575)
!1595 = !DILocation(line: 31, column: 6, scope: !1575)
!1596 = !DILocation(line: 31, column: 14, scope: !1575)
!1597 = !DILocation(line: 32, column: 21, scope: !1575)
!1598 = !DILocation(line: 32, column: 6, scope: !1575)
!1599 = !DILocation(line: 32, column: 19, scope: !1575)
!1600 = !DILocation(line: 34, column: 9, scope: !1601)
!1601 = distinct !DILexicalBlock(scope: !1575, file: !909, line: 34, column: 9)
!1602 = !DILocation(line: 34, column: 18, scope: !1601)
!1603 = !DILocation(line: 34, column: 9, scope: !1575)
!1604 = !DILocation(line: 35, column: 16, scope: !1601)
!1605 = !DILocation(line: 35, column: 9, scope: !1601)
!1606 = !DILocation(line: 37, column: 18, scope: !1575)
!1607 = !DILocation(line: 37, column: 25, scope: !1575)
!1608 = !DILocation(line: 37, column: 16, scope: !1575)
!1609 = !DILocation(line: 38, column: 16, scope: !1575)
!1610 = !DILocation(line: 38, column: 23, scope: !1575)
!1611 = !DILocation(line: 38, column: 29, scope: !1575)
!1612 = !DILocation(line: 38, column: 13, scope: !1575)
!1613 = !DILocation(line: 39, column: 9, scope: !1614)
!1614 = distinct !DILexicalBlock(scope: !1575, file: !909, line: 39, column: 9)
!1615 = !DILocation(line: 39, column: 17, scope: !1614)
!1616 = !DILocation(line: 39, column: 9, scope: !1575)
!1617 = !DILocation(line: 40, column: 16, scope: !1618)
!1618 = distinct !DILexicalBlock(scope: !1614, file: !909, line: 39, column: 22)
!1619 = !DILocation(line: 40, column: 52, scope: !1618)
!1620 = !DILocation(line: 40, column: 9, scope: !1618)
!1621 = !DILocation(line: 41, column: 16, scope: !1618)
!1622 = !DILocation(line: 41, column: 9, scope: !1618)
!1623 = !DILocation(line: 44, column: 22, scope: !1575)
!1624 = !DILocation(line: 44, column: 5, scope: !1575)
!1625 = !DILocation(line: 44, column: 12, scope: !1575)
!1626 = !DILocation(line: 44, column: 20, scope: !1575)
!1627 = !DILocation(line: 45, column: 20, scope: !1575)
!1628 = !DILocation(line: 45, column: 31, scope: !1575)
!1629 = !DILocation(line: 45, column: 5, scope: !1575)
!1630 = !DILocation(line: 45, column: 8, scope: !1575)
!1631 = !DILocation(line: 45, column: 18, scope: !1575)
!1632 = !DILocation(line: 46, column: 20, scope: !1575)
