; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dds.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dds.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!888 = !DIFile(filename: "libavcodec/dds.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902}
!890 = !DIEnumerator(name: "DDS_NONE", value: 0)
!891 = !DIEnumerator(name: "DDS_ALPHA_EXP", value: 1)
!892 = !DIEnumerator(name: "DDS_NORMAL_MAP", value: 2)
!893 = !DIEnumerator(name: "DDS_RAW_YCOCG", value: 3)
!894 = !DIEnumerator(name: "DDS_SWAP_ALPHA", value: 4)
!895 = !DIEnumerator(name: "DDS_SWIZZLE_A2XY", value: 5)
!896 = !DIEnumerator(name: "DDS_SWIZZLE_RBXG", value: 6)
!897 = !DIEnumerator(name: "DDS_SWIZZLE_RGXB", value: 7)
!898 = !DIEnumerator(name: "DDS_SWIZZLE_RXBG", value: 8)
!899 = !DIEnumerator(name: "DDS_SWIZZLE_RXGB", value: 9)
!900 = !DIEnumerator(name: "DDS_SWIZZLE_XGBR", value: 10)
!901 = !DIEnumerator(name: "DDS_SWIZZLE_XRBG", value: 11)
!902 = !DIEnumerator(name: "DDS_SWIZZLE_XGXR", value: 12)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DDSDXGIFormat", file: !888, line: 60, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938}
!905 = !DIEnumerator(name: "DXGI_FORMAT_R16G16B16A16_TYPELESS", value: 9)
!906 = !DIEnumerator(name: "DXGI_FORMAT_R16G16B16A16_FLOAT", value: 10)
!907 = !DIEnumerator(name: "DXGI_FORMAT_R16G16B16A16_UNORM", value: 11)
!908 = !DIEnumerator(name: "DXGI_FORMAT_R16G16B16A16_UINT", value: 12)
!909 = !DIEnumerator(name: "DXGI_FORMAT_R16G16B16A16_SNORM", value: 13)
!910 = !DIEnumerator(name: "DXGI_FORMAT_R16G16B16A16_SINT", value: 14)
!911 = !DIEnumerator(name: "DXGI_FORMAT_R8G8B8A8_TYPELESS", value: 27)
!912 = !DIEnumerator(name: "DXGI_FORMAT_R8G8B8A8_UNORM", value: 28)
!913 = !DIEnumerator(name: "DXGI_FORMAT_R8G8B8A8_UNORM_SRGB", value: 29)
!914 = !DIEnumerator(name: "DXGI_FORMAT_R8G8B8A8_UINT", value: 30)
!915 = !DIEnumerator(name: "DXGI_FORMAT_R8G8B8A8_SNORM", value: 31)
!916 = !DIEnumerator(name: "DXGI_FORMAT_R8G8B8A8_SINT", value: 32)
!917 = !DIEnumerator(name: "DXGI_FORMAT_BC1_TYPELESS", value: 70)
!918 = !DIEnumerator(name: "DXGI_FORMAT_BC1_UNORM", value: 71)
!919 = !DIEnumerator(name: "DXGI_FORMAT_BC1_UNORM_SRGB", value: 72)
!920 = !DIEnumerator(name: "DXGI_FORMAT_BC2_TYPELESS", value: 73)
!921 = !DIEnumerator(name: "DXGI_FORMAT_BC2_UNORM", value: 74)
!922 = !DIEnumerator(name: "DXGI_FORMAT_BC2_UNORM_SRGB", value: 75)
!923 = !DIEnumerator(name: "DXGI_FORMAT_BC3_TYPELESS", value: 76)
!924 = !DIEnumerator(name: "DXGI_FORMAT_BC3_UNORM", value: 77)
!925 = !DIEnumerator(name: "DXGI_FORMAT_BC3_UNORM_SRGB", value: 78)
!926 = !DIEnumerator(name: "DXGI_FORMAT_BC4_TYPELESS", value: 79)
!927 = !DIEnumerator(name: "DXGI_FORMAT_BC4_UNORM", value: 80)
!928 = !DIEnumerator(name: "DXGI_FORMAT_BC4_SNORM", value: 81)
!929 = !DIEnumerator(name: "DXGI_FORMAT_BC5_TYPELESS", value: 82)
!930 = !DIEnumerator(name: "DXGI_FORMAT_BC5_UNORM", value: 83)
!931 = !DIEnumerator(name: "DXGI_FORMAT_BC5_SNORM", value: 84)
!932 = !DIEnumerator(name: "DXGI_FORMAT_B5G6R5_UNORM", value: 85)
!933 = !DIEnumerator(name: "DXGI_FORMAT_B8G8R8A8_UNORM", value: 87)
!934 = !DIEnumerator(name: "DXGI_FORMAT_B8G8R8X8_UNORM", value: 88)
!935 = !DIEnumerator(name: "DXGI_FORMAT_B8G8R8A8_TYPELESS", value: 90)
!936 = !DIEnumerator(name: "DXGI_FORMAT_B8G8R8A8_UNORM_SRGB", value: 91)
!937 = !DIEnumerator(name: "DXGI_FORMAT_B8G8R8X8_TYPELESS", value: 92)
!938 = !DIEnumerator(name: "DXGI_FORMAT_B8G8R8X8_UNORM_SRGB", value: 93)
!939 = !{!940, !941, !942, !949, !950, !952}
!940 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!941 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !944, line: 221, size: 32, align: 8, elements: !945)
!944 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!945 = !{!946}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !943, file: !944, line: 221, baseType: !947, size: 32, align: 32)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !948, line: 51, baseType: !941)
!948 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !948, line: 48, baseType: !955)
!955 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!956 = !{!957}
!957 = distinct !DIGlobalVariable(name: "ff_dds_decoder", scope: !0, file: !888, line: 750, type: !958, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_dds_decoder)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !960)
!960 = !{!961, !965, !966, !967, !968, !969, !978, !981, !984, !987, !992, !993, !1034, !1042, !1043, !1044, !1046, !1597, !1603, !1611, !1615, !1616, !1653, !1657, !1661, !1662, !1666, !1670, !1671, !1675, !1676, !1677}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !959, file: !14, line: 3475, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!964 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !959, file: !14, line: 3480, baseType: !962, size: 64, align: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !959, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !959, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !959, file: !14, line: 3487, baseType: !940, size: 32, align: 32, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !959, file: !14, line: 3488, baseType: !970, size: 64, align: 64, offset: 256)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !973, line: 61, baseType: !974)
!973 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !973, line: 58, size: 64, align: 32, elements: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !974, file: !973, line: 59, baseType: !940, size: 32, align: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !974, file: !973, line: 60, baseType: !940, size: 32, align: 32, offset: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !959, file: !14, line: 3489, baseType: !979, size: 64, align: 64, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !959, file: !14, line: 3490, baseType: !982, size: 64, align: 64, offset: 384)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !959, file: !14, line: 3491, baseType: !985, size: 64, align: 64, offset: 448)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !959, file: !14, line: 3492, baseType: !988, size: 64, align: 64, offset: 512)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !948, line: 55, baseType: !991)
!991 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !959, file: !14, line: 3493, baseType: !954, size: 8, align: 8, offset: 576)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !959, file: !14, line: 3494, baseType: !994, size: 64, align: 64, offset: 640)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !998)
!998 = !{!999, !1000, !1004, !1008, !1009, !1010, !1011, !1015, !1021, !1023, !1027}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !997, file: !691, line: 72, baseType: !962, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !997, file: !691, line: 78, baseType: !1001, size: 64, align: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!962, !949}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !997, file: !691, line: 85, baseType: !1005, size: 64, align: 64, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !997, file: !691, line: 93, baseType: !940, size: 32, align: 32, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !997, file: !691, line: 99, baseType: !940, size: 32, align: 32, offset: 224)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !997, file: !691, line: 108, baseType: !940, size: 32, align: 32, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !997, file: !691, line: 113, baseType: !1012, size: 64, align: 64, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!949, !949, !949}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !997, file: !691, line: 123, baseType: !1016, size: 64, align: 64, offset: 384)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!1019, !1019}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !997, file: !691, line: 130, baseType: !1022, size: 32, align: 32, offset: 448)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !997, file: !691, line: 136, baseType: !1024, size: 64, align: 64, offset: 512)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!1022, !949}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !997, file: !691, line: 142, baseType: !1028, size: 64, align: 64, offset: 576)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!940, !1031, !949, !962, !940}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !959, file: !14, line: 3495, baseType: !1035, size: 64, align: 64, offset: 704)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1039)
!1039 = !{!1040, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1038, file: !14, line: 3402, baseType: !940, size: 32, align: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1038, file: !14, line: 3403, baseType: !962, size: 64, align: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !959, file: !14, line: 3507, baseType: !962, size: 64, align: 64, offset: 768)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !959, file: !14, line: 3516, baseType: !940, size: 32, align: 32, offset: 832)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !959, file: !14, line: 3517, baseType: !1045, size: 64, align: 64, offset: 896)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !959, file: !14, line: 3527, baseType: !1047, size: 64, align: 64, offset: 960)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!940, !1050}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057, !1060, !1061, !1062, !1063, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1345, !1349, !1350, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1535, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1052, file: !14, line: 1561, baseType: !994, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1052, file: !14, line: 1562, baseType: !940, size: 32, align: 32, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1052, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1052, file: !14, line: 1565, baseType: !1058, size: 64, align: 64, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1052, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1052, file: !14, line: 1581, baseType: !941, size: 32, align: 32, offset: 224)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1052, file: !14, line: 1583, baseType: !949, size: 64, align: 64, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1052, file: !14, line: 1591, baseType: !1064, size: 64, align: 64, offset: 320)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1066, line: 129, size: 1664, align: 64, elements: !1067)
!1066 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1067 = !{!1068, !1069, !1070, !1071, !1171, !1192, !1193, !1222, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1065, file: !1066, line: 136, baseType: !940, size: 32, align: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1065, file: !1066, line: 151, baseType: !940, size: 32, align: 32, offset: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1065, file: !1066, line: 157, baseType: !940, size: 32, align: 32, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1065, file: !1066, line: 159, baseType: !1072, size: 64, align: 64, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1074)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1075)
!1075 = !{!1076, !1081, !1083, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1123, !1125, !1126, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1159, !1160, !1161, !1162, !1163, !1164, !1167, !1168, !1169, !1170}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1074, file: !722, line: 282, baseType: !1077, size: 512, align: 64)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1078, size: 512, align: 64, elements: !1079)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!1079 = !{!1080}
!1080 = !DISubrange(count: 8)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1074, file: !722, line: 299, baseType: !1082, size: 256, align: 32, offset: 512)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !940, size: 256, align: 32, elements: !1079)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1074, file: !722, line: 315, baseType: !1084, size: 64, align: 64, offset: 768)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1074, file: !722, line: 326, baseType: !940, size: 32, align: 32, offset: 832)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1074, file: !722, line: 326, baseType: !940, size: 32, align: 32, offset: 864)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1074, file: !722, line: 334, baseType: !940, size: 32, align: 32, offset: 896)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1074, file: !722, line: 341, baseType: !940, size: 32, align: 32, offset: 928)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1074, file: !722, line: 346, baseType: !940, size: 32, align: 32, offset: 960)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1074, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1074, file: !722, line: 356, baseType: !972, size: 64, align: 32, offset: 1024)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1074, file: !722, line: 361, baseType: !1093, size: 64, align: 64, offset: 1088)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !948, line: 40, baseType: !1094)
!1094 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1074, file: !722, line: 369, baseType: !1093, size: 64, align: 64, offset: 1152)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1074, file: !722, line: 377, baseType: !1093, size: 64, align: 64, offset: 1216)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1074, file: !722, line: 382, baseType: !940, size: 32, align: 32, offset: 1280)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1074, file: !722, line: 386, baseType: !940, size: 32, align: 32, offset: 1312)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1074, file: !722, line: 391, baseType: !940, size: 32, align: 32, offset: 1344)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1074, file: !722, line: 396, baseType: !949, size: 64, align: 64, offset: 1408)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1074, file: !722, line: 403, baseType: !1102, size: 512, align: 64, offset: 1472)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 512, align: 64, elements: !1079)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1074, file: !722, line: 410, baseType: !940, size: 32, align: 32, offset: 1984)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1074, file: !722, line: 415, baseType: !940, size: 32, align: 32, offset: 2016)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1074, file: !722, line: 420, baseType: !940, size: 32, align: 32, offset: 2048)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1074, file: !722, line: 425, baseType: !940, size: 32, align: 32, offset: 2080)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1074, file: !722, line: 435, baseType: !1093, size: 64, align: 64, offset: 2112)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1074, file: !722, line: 440, baseType: !940, size: 32, align: 32, offset: 2176)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1074, file: !722, line: 445, baseType: !990, size: 64, align: 64, offset: 2240)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1074, file: !722, line: 459, baseType: !1111, size: 512, align: 64, offset: 2304)
!1111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1112, size: 512, align: 64, elements: !1079)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1114, line: 94, baseType: !1115)
!1114 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1114, line: 81, size: 192, align: 64, elements: !1116)
!1116 = !{!1117, !1121, !1122}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1115, file: !1114, line: 82, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1114, line: 73, baseType: !1120)
!1120 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1114, line: 73, flags: DIFlagFwdDecl)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1115, file: !1114, line: 89, baseType: !1078, size: 64, align: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1115, file: !1114, line: 93, baseType: !940, size: 32, align: 32, offset: 128)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1074, file: !722, line: 473, baseType: !1124, size: 64, align: 64, offset: 2816)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1074, file: !722, line: 477, baseType: !940, size: 32, align: 32, offset: 2880)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1074, file: !722, line: 479, baseType: !1127, size: 64, align: 64, offset: 2944)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1130)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1131)
!1131 = !{!1132, !1133, !1134, !1135, !1140}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1130, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1130, file: !722, line: 203, baseType: !1078, size: 64, align: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1130, file: !722, line: 204, baseType: !940, size: 32, align: 32, offset: 128)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1130, file: !722, line: 205, baseType: !1136, size: 64, align: 64, offset: 192)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1138, line: 86, baseType: !1139)
!1138 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1139 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1138, line: 86, flags: DIFlagFwdDecl)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1130, file: !722, line: 206, baseType: !1112, size: 64, align: 64, offset: 256)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1074, file: !722, line: 480, baseType: !940, size: 32, align: 32, offset: 3008)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1074, file: !722, line: 505, baseType: !940, size: 32, align: 32, offset: 3040)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1074, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1074, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1074, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1074, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1074, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1074, file: !722, line: 532, baseType: !1093, size: 64, align: 64, offset: 3264)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1074, file: !722, line: 539, baseType: !1093, size: 64, align: 64, offset: 3328)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1074, file: !722, line: 547, baseType: !1093, size: 64, align: 64, offset: 3392)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1074, file: !722, line: 554, baseType: !1136, size: 64, align: 64, offset: 3456)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1074, file: !722, line: 563, baseType: !940, size: 32, align: 32, offset: 3520)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1074, file: !722, line: 572, baseType: !940, size: 32, align: 32, offset: 3552)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1074, file: !722, line: 581, baseType: !940, size: 32, align: 32, offset: 3584)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1074, file: !722, line: 588, baseType: !1156, size: 64, align: 64, offset: 3648)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !948, line: 36, baseType: !1158)
!1158 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1074, file: !722, line: 593, baseType: !940, size: 32, align: 32, offset: 3712)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1074, file: !722, line: 596, baseType: !940, size: 32, align: 32, offset: 3744)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1074, file: !722, line: 599, baseType: !1112, size: 64, align: 64, offset: 3776)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1074, file: !722, line: 605, baseType: !1112, size: 64, align: 64, offset: 3840)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1074, file: !722, line: 616, baseType: !1112, size: 64, align: 64, offset: 3904)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1074, file: !722, line: 626, baseType: !1165, size: 64, align: 64, offset: 3968)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1166, line: 216, baseType: !991)
!1166 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1074, file: !722, line: 627, baseType: !1165, size: 64, align: 64, offset: 4032)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1074, file: !722, line: 628, baseType: !1165, size: 64, align: 64, offset: 4096)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1074, file: !722, line: 629, baseType: !1165, size: 64, align: 64, offset: 4160)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1074, file: !722, line: 645, baseType: !1112, size: 64, align: 64, offset: 4224)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1065, file: !1066, line: 161, baseType: !1172, size: 64, align: 64, offset: 192)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1066, line: 117, baseType: !1174)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1066, line: 100, size: 832, align: 64, elements: !1175)
!1175 = !{!1176, !1183, !1184, !1185, !1186, !1187, !1189, !1190, !1191}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1174, file: !1066, line: 105, baseType: !1177, size: 256, align: 64)
!1177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1178, size: 256, align: 64, elements: !1181)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1114, line: 238, baseType: !1180)
!1180 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1114, line: 238, flags: DIFlagFwdDecl)
!1181 = !{!1182}
!1182 = !DISubrange(count: 4)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1174, file: !1066, line: 110, baseType: !940, size: 32, align: 32, offset: 256)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1174, file: !1066, line: 111, baseType: !940, size: 32, align: 32, offset: 288)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1174, file: !1066, line: 111, baseType: !940, size: 32, align: 32, offset: 320)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1174, file: !1066, line: 112, baseType: !1082, size: 256, align: 32, offset: 352)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1174, file: !1066, line: 113, baseType: !1188, size: 128, align: 32, offset: 608)
!1188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !940, size: 128, align: 32, elements: !1181)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1174, file: !1066, line: 114, baseType: !940, size: 32, align: 32, offset: 736)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1174, file: !1066, line: 115, baseType: !940, size: 32, align: 32, offset: 768)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1174, file: !1066, line: 116, baseType: !940, size: 32, align: 32, offset: 800)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1065, file: !1066, line: 163, baseType: !949, size: 64, align: 64, offset: 256)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1065, file: !1066, line: 165, baseType: !1194, size: 128, align: 64, offset: 320)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1066, line: 122, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1066, line: 119, size: 128, align: 64, elements: !1196)
!1196 = !{!1197, !1221}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1195, file: !1066, line: 120, baseType: !1198, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1200)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1201)
!1201 = !{!1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1217, !1218, !1219, !1220}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1200, file: !14, line: 1451, baseType: !1112, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1200, file: !14, line: 1461, baseType: !1093, size: 64, align: 64, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1200, file: !14, line: 1467, baseType: !1093, size: 64, align: 64, offset: 128)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1200, file: !14, line: 1468, baseType: !1078, size: 64, align: 64, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1200, file: !14, line: 1469, baseType: !940, size: 32, align: 32, offset: 256)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1200, file: !14, line: 1470, baseType: !940, size: 32, align: 32, offset: 288)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1200, file: !14, line: 1474, baseType: !940, size: 32, align: 32, offset: 320)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1200, file: !14, line: 1479, baseType: !1210, size: 64, align: 64, offset: 384)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1213)
!1213 = !{!1214, !1215, !1216}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1212, file: !14, line: 1412, baseType: !1078, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1212, file: !14, line: 1413, baseType: !940, size: 32, align: 32, offset: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1212, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1200, file: !14, line: 1480, baseType: !940, size: 32, align: 32, offset: 448)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1200, file: !14, line: 1486, baseType: !1093, size: 64, align: 64, offset: 512)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1200, file: !14, line: 1488, baseType: !1093, size: 64, align: 64, offset: 576)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1200, file: !14, line: 1497, baseType: !1093, size: 64, align: 64, offset: 640)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1195, file: !1066, line: 121, baseType: !1072, size: 64, align: 64, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1065, file: !1066, line: 166, baseType: !1223, size: 128, align: 64, offset: 448)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1066, line: 127, baseType: !1224)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1066, line: 124, size: 128, align: 64, elements: !1225)
!1225 = !{!1226, !1299}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1224, file: !1066, line: 125, baseType: !1227, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1230)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1231)
!1231 = !{!1232, !1233, !1257, !1261, !1262, !1296, !1297, !1298}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1230, file: !14, line: 5751, baseType: !994, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1230, file: !14, line: 5756, baseType: !1234, size: 64, align: 64, offset: 64)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1236)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1237)
!1237 = !{!1238, !1239, !1242, !1243, !1244, !1248, !1252, !1256}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1236, file: !14, line: 5797, baseType: !962, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1236, file: !14, line: 5804, baseType: !1240, size: 64, align: 64, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1236, file: !14, line: 5815, baseType: !994, size: 64, align: 64, offset: 128)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1236, file: !14, line: 5825, baseType: !940, size: 32, align: 32, offset: 192)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1236, file: !14, line: 5826, baseType: !1245, size: 64, align: 64, offset: 256)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!940, !1228}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1236, file: !14, line: 5827, baseType: !1249, size: 64, align: 64, offset: 320)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{!940, !1228, !1198}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1236, file: !14, line: 5828, baseType: !1253, size: 64, align: 64, offset: 384)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{null, !1228}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1236, file: !14, line: 5829, baseType: !1253, size: 64, align: 64, offset: 448)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1230, file: !14, line: 5762, baseType: !1258, size: 64, align: 64, offset: 128)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1260)
!1260 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1230, file: !14, line: 5768, baseType: !949, size: 64, align: 64, offset: 192)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1230, file: !14, line: 5775, baseType: !1263, size: 64, align: 64, offset: 256)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1265)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1266)
!1266 = !{!1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1265, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1265, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1265, file: !14, line: 3948, baseType: !947, size: 32, align: 32, offset: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1265, file: !14, line: 3958, baseType: !1078, size: 64, align: 64, offset: 128)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1265, file: !14, line: 3962, baseType: !940, size: 32, align: 32, offset: 192)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1265, file: !14, line: 3968, baseType: !940, size: 32, align: 32, offset: 224)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1265, file: !14, line: 3973, baseType: !1093, size: 64, align: 64, offset: 256)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1265, file: !14, line: 3986, baseType: !940, size: 32, align: 32, offset: 320)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1265, file: !14, line: 3999, baseType: !940, size: 32, align: 32, offset: 352)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1265, file: !14, line: 4004, baseType: !940, size: 32, align: 32, offset: 384)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1265, file: !14, line: 4005, baseType: !940, size: 32, align: 32, offset: 416)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1265, file: !14, line: 4010, baseType: !940, size: 32, align: 32, offset: 448)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1265, file: !14, line: 4011, baseType: !940, size: 32, align: 32, offset: 480)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1265, file: !14, line: 4020, baseType: !972, size: 64, align: 32, offset: 512)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1265, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1265, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1265, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1265, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1265, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1265, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1265, file: !14, line: 4039, baseType: !940, size: 32, align: 32, offset: 768)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1265, file: !14, line: 4046, baseType: !990, size: 64, align: 64, offset: 832)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1265, file: !14, line: 4050, baseType: !940, size: 32, align: 32, offset: 896)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1265, file: !14, line: 4054, baseType: !940, size: 32, align: 32, offset: 928)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1265, file: !14, line: 4061, baseType: !940, size: 32, align: 32, offset: 960)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1265, file: !14, line: 4065, baseType: !940, size: 32, align: 32, offset: 992)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1265, file: !14, line: 4073, baseType: !940, size: 32, align: 32, offset: 1024)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1265, file: !14, line: 4080, baseType: !940, size: 32, align: 32, offset: 1056)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1265, file: !14, line: 4084, baseType: !940, size: 32, align: 32, offset: 1088)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1230, file: !14, line: 5781, baseType: !1263, size: 64, align: 64, offset: 320)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1230, file: !14, line: 5787, baseType: !972, size: 64, align: 32, offset: 384)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1230, file: !14, line: 5793, baseType: !972, size: 64, align: 32, offset: 448)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1224, file: !1066, line: 126, baseType: !940, size: 32, align: 32, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1065, file: !1066, line: 172, baseType: !1198, size: 64, align: 64, offset: 576)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1065, file: !1066, line: 177, baseType: !1078, size: 64, align: 64, offset: 640)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1065, file: !1066, line: 178, baseType: !941, size: 32, align: 32, offset: 704)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1065, file: !1066, line: 180, baseType: !949, size: 64, align: 64, offset: 768)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1065, file: !1066, line: 185, baseType: !940, size: 32, align: 32, offset: 832)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1065, file: !1066, line: 190, baseType: !949, size: 64, align: 64, offset: 896)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1065, file: !1066, line: 195, baseType: !940, size: 32, align: 32, offset: 960)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1065, file: !1066, line: 200, baseType: !1198, size: 64, align: 64, offset: 1024)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1065, file: !1066, line: 201, baseType: !940, size: 32, align: 32, offset: 1088)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1065, file: !1066, line: 202, baseType: !1072, size: 64, align: 64, offset: 1152)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1065, file: !1066, line: 203, baseType: !940, size: 32, align: 32, offset: 1216)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1065, file: !1066, line: 205, baseType: !940, size: 32, align: 32, offset: 1248)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1065, file: !1066, line: 206, baseType: !940, size: 32, align: 32, offset: 1280)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1065, file: !1066, line: 209, baseType: !1165, size: 64, align: 64, offset: 1344)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1065, file: !1066, line: 212, baseType: !1165, size: 64, align: 64, offset: 1408)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1065, file: !1066, line: 213, baseType: !1072, size: 64, align: 64, offset: 1472)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1065, file: !1066, line: 215, baseType: !940, size: 32, align: 32, offset: 1536)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1065, file: !1066, line: 217, baseType: !940, size: 32, align: 32, offset: 1568)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1065, file: !1066, line: 220, baseType: !940, size: 32, align: 32, offset: 1600)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1052, file: !14, line: 1598, baseType: !949, size: 64, align: 64, offset: 384)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1052, file: !14, line: 1606, baseType: !1093, size: 64, align: 64, offset: 448)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1052, file: !14, line: 1614, baseType: !940, size: 32, align: 32, offset: 512)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1052, file: !14, line: 1622, baseType: !940, size: 32, align: 32, offset: 544)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1052, file: !14, line: 1628, baseType: !940, size: 32, align: 32, offset: 576)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1052, file: !14, line: 1636, baseType: !940, size: 32, align: 32, offset: 608)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1052, file: !14, line: 1643, baseType: !940, size: 32, align: 32, offset: 640)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1052, file: !14, line: 1657, baseType: !1078, size: 64, align: 64, offset: 704)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1052, file: !14, line: 1658, baseType: !940, size: 32, align: 32, offset: 768)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1052, file: !14, line: 1679, baseType: !972, size: 64, align: 32, offset: 800)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1052, file: !14, line: 1688, baseType: !940, size: 32, align: 32, offset: 864)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1052, file: !14, line: 1712, baseType: !940, size: 32, align: 32, offset: 896)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1052, file: !14, line: 1729, baseType: !940, size: 32, align: 32, offset: 928)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1052, file: !14, line: 1729, baseType: !940, size: 32, align: 32, offset: 960)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1052, file: !14, line: 1744, baseType: !940, size: 32, align: 32, offset: 992)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1052, file: !14, line: 1744, baseType: !940, size: 32, align: 32, offset: 1024)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1052, file: !14, line: 1751, baseType: !940, size: 32, align: 32, offset: 1056)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1052, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1052, file: !14, line: 1791, baseType: !1338, size: 64, align: 64, offset: 1152)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{null, !1341, !1342, !1344, !940, !940, !940}
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1073)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1052, file: !14, line: 1808, baseType: !1346, size: 64, align: 64, offset: 1216)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DISubroutineType(types: !1348)
!1348 = !{!473, !1341, !979}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1052, file: !14, line: 1816, baseType: !940, size: 32, align: 32, offset: 1280)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1052, file: !14, line: 1825, baseType: !1351, size: 32, align: 32, offset: 1312)
!1351 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1052, file: !14, line: 1830, baseType: !940, size: 32, align: 32, offset: 1344)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1052, file: !14, line: 1838, baseType: !1351, size: 32, align: 32, offset: 1376)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1052, file: !14, line: 1846, baseType: !940, size: 32, align: 32, offset: 1408)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1052, file: !14, line: 1851, baseType: !940, size: 32, align: 32, offset: 1440)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1052, file: !14, line: 1861, baseType: !1351, size: 32, align: 32, offset: 1472)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1052, file: !14, line: 1868, baseType: !1351, size: 32, align: 32, offset: 1504)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1052, file: !14, line: 1875, baseType: !1351, size: 32, align: 32, offset: 1536)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1052, file: !14, line: 1882, baseType: !1351, size: 32, align: 32, offset: 1568)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1052, file: !14, line: 1889, baseType: !1351, size: 32, align: 32, offset: 1600)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1052, file: !14, line: 1896, baseType: !1351, size: 32, align: 32, offset: 1632)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1052, file: !14, line: 1903, baseType: !1351, size: 32, align: 32, offset: 1664)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1052, file: !14, line: 1910, baseType: !940, size: 32, align: 32, offset: 1696)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1052, file: !14, line: 1915, baseType: !940, size: 32, align: 32, offset: 1728)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1052, file: !14, line: 1926, baseType: !1344, size: 64, align: 64, offset: 1792)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1052, file: !14, line: 1935, baseType: !972, size: 64, align: 32, offset: 1856)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1052, file: !14, line: 1942, baseType: !940, size: 32, align: 32, offset: 1920)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1052, file: !14, line: 1948, baseType: !940, size: 32, align: 32, offset: 1952)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1052, file: !14, line: 1954, baseType: !940, size: 32, align: 32, offset: 1984)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1052, file: !14, line: 1960, baseType: !940, size: 32, align: 32, offset: 2016)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1052, file: !14, line: 1984, baseType: !940, size: 32, align: 32, offset: 2048)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1052, file: !14, line: 1991, baseType: !940, size: 32, align: 32, offset: 2080)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1052, file: !14, line: 1996, baseType: !940, size: 32, align: 32, offset: 2112)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1052, file: !14, line: 2004, baseType: !940, size: 32, align: 32, offset: 2144)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1052, file: !14, line: 2011, baseType: !940, size: 32, align: 32, offset: 2176)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1052, file: !14, line: 2018, baseType: !940, size: 32, align: 32, offset: 2208)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1052, file: !14, line: 2027, baseType: !940, size: 32, align: 32, offset: 2240)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1052, file: !14, line: 2034, baseType: !940, size: 32, align: 32, offset: 2272)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1052, file: !14, line: 2044, baseType: !940, size: 32, align: 32, offset: 2304)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1052, file: !14, line: 2054, baseType: !1381, size: 64, align: 64, offset: 2368)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !948, line: 49, baseType: !1383)
!1383 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1052, file: !14, line: 2061, baseType: !1381, size: 64, align: 64, offset: 2432)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1052, file: !14, line: 2066, baseType: !940, size: 32, align: 32, offset: 2496)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1052, file: !14, line: 2070, baseType: !940, size: 32, align: 32, offset: 2528)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1052, file: !14, line: 2078, baseType: !940, size: 32, align: 32, offset: 2560)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1052, file: !14, line: 2085, baseType: !940, size: 32, align: 32, offset: 2592)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1052, file: !14, line: 2092, baseType: !940, size: 32, align: 32, offset: 2624)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1052, file: !14, line: 2099, baseType: !940, size: 32, align: 32, offset: 2656)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1052, file: !14, line: 2106, baseType: !940, size: 32, align: 32, offset: 2688)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1052, file: !14, line: 2113, baseType: !940, size: 32, align: 32, offset: 2720)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1052, file: !14, line: 2120, baseType: !940, size: 32, align: 32, offset: 2752)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1052, file: !14, line: 2125, baseType: !940, size: 32, align: 32, offset: 2784)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1052, file: !14, line: 2133, baseType: !940, size: 32, align: 32, offset: 2816)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1052, file: !14, line: 2140, baseType: !940, size: 32, align: 32, offset: 2848)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1052, file: !14, line: 2145, baseType: !940, size: 32, align: 32, offset: 2880)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1052, file: !14, line: 2153, baseType: !940, size: 32, align: 32, offset: 2912)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1052, file: !14, line: 2158, baseType: !940, size: 32, align: 32, offset: 2944)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1052, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1052, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1052, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1052, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1052, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1052, file: !14, line: 2203, baseType: !940, size: 32, align: 32, offset: 3136)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1052, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1052, file: !14, line: 2212, baseType: !940, size: 32, align: 32, offset: 3200)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1052, file: !14, line: 2213, baseType: !940, size: 32, align: 32, offset: 3232)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1052, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1052, file: !14, line: 2232, baseType: !940, size: 32, align: 32, offset: 3296)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1052, file: !14, line: 2243, baseType: !940, size: 32, align: 32, offset: 3328)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1052, file: !14, line: 2249, baseType: !940, size: 32, align: 32, offset: 3360)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1052, file: !14, line: 2256, baseType: !940, size: 32, align: 32, offset: 3392)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1052, file: !14, line: 2263, baseType: !990, size: 64, align: 64, offset: 3456)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1052, file: !14, line: 2270, baseType: !990, size: 64, align: 64, offset: 3520)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1052, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1052, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1052, file: !14, line: 2367, baseType: !1419, size: 64, align: 64, offset: 3648)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DISubroutineType(types: !1421)
!1421 = !{!940, !1341, !1072, !940}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1052, file: !14, line: 2383, baseType: !940, size: 32, align: 32, offset: 3712)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1052, file: !14, line: 2386, baseType: !1351, size: 32, align: 32, offset: 3744)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1052, file: !14, line: 2387, baseType: !1351, size: 32, align: 32, offset: 3776)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1052, file: !14, line: 2394, baseType: !940, size: 32, align: 32, offset: 3808)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1052, file: !14, line: 2401, baseType: !940, size: 32, align: 32, offset: 3840)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1052, file: !14, line: 2408, baseType: !940, size: 32, align: 32, offset: 3872)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1052, file: !14, line: 2415, baseType: !940, size: 32, align: 32, offset: 3904)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1052, file: !14, line: 2422, baseType: !940, size: 32, align: 32, offset: 3936)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1052, file: !14, line: 2423, baseType: !1431, size: 64, align: 64, offset: 3968)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1433)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1434)
!1434 = !{!1435, !1436, !1437, !1438}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1433, file: !14, line: 827, baseType: !940, size: 32, align: 32)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1433, file: !14, line: 828, baseType: !940, size: 32, align: 32, offset: 32)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1433, file: !14, line: 829, baseType: !940, size: 32, align: 32, offset: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1433, file: !14, line: 830, baseType: !1351, size: 32, align: 32, offset: 96)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1052, file: !14, line: 2430, baseType: !1093, size: 64, align: 64, offset: 4032)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1052, file: !14, line: 2437, baseType: !1093, size: 64, align: 64, offset: 4096)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1052, file: !14, line: 2444, baseType: !1351, size: 32, align: 32, offset: 4160)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1052, file: !14, line: 2451, baseType: !1351, size: 32, align: 32, offset: 4192)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1052, file: !14, line: 2458, baseType: !940, size: 32, align: 32, offset: 4224)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1052, file: !14, line: 2469, baseType: !940, size: 32, align: 32, offset: 4256)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1052, file: !14, line: 2475, baseType: !940, size: 32, align: 32, offset: 4288)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1052, file: !14, line: 2481, baseType: !940, size: 32, align: 32, offset: 4320)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1052, file: !14, line: 2485, baseType: !940, size: 32, align: 32, offset: 4352)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1052, file: !14, line: 2489, baseType: !940, size: 32, align: 32, offset: 4384)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1052, file: !14, line: 2493, baseType: !940, size: 32, align: 32, offset: 4416)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1052, file: !14, line: 2501, baseType: !940, size: 32, align: 32, offset: 4448)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1052, file: !14, line: 2506, baseType: !940, size: 32, align: 32, offset: 4480)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1052, file: !14, line: 2510, baseType: !940, size: 32, align: 32, offset: 4512)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1052, file: !14, line: 2514, baseType: !1093, size: 64, align: 64, offset: 4544)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1052, file: !14, line: 2528, baseType: !1455, size: 64, align: 64, offset: 4608)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{null, !1341, !949, !940, !940}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1052, file: !14, line: 2534, baseType: !940, size: 32, align: 32, offset: 4672)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1052, file: !14, line: 2545, baseType: !940, size: 32, align: 32, offset: 4704)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1052, file: !14, line: 2547, baseType: !940, size: 32, align: 32, offset: 4736)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1052, file: !14, line: 2549, baseType: !940, size: 32, align: 32, offset: 4768)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1052, file: !14, line: 2551, baseType: !940, size: 32, align: 32, offset: 4800)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1052, file: !14, line: 2553, baseType: !940, size: 32, align: 32, offset: 4832)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1052, file: !14, line: 2555, baseType: !940, size: 32, align: 32, offset: 4864)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1052, file: !14, line: 2557, baseType: !940, size: 32, align: 32, offset: 4896)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1052, file: !14, line: 2559, baseType: !940, size: 32, align: 32, offset: 4928)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1052, file: !14, line: 2563, baseType: !940, size: 32, align: 32, offset: 4960)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1052, file: !14, line: 2571, baseType: !1469, size: 64, align: 64, offset: 4992)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1052, file: !14, line: 2579, baseType: !1469, size: 64, align: 64, offset: 5056)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1052, file: !14, line: 2586, baseType: !940, size: 32, align: 32, offset: 5120)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1052, file: !14, line: 2615, baseType: !940, size: 32, align: 32, offset: 5152)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1052, file: !14, line: 2627, baseType: !940, size: 32, align: 32, offset: 5184)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1052, file: !14, line: 2637, baseType: !940, size: 32, align: 32, offset: 5216)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1052, file: !14, line: 2681, baseType: !940, size: 32, align: 32, offset: 5248)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1052, file: !14, line: 2709, baseType: !1093, size: 64, align: 64, offset: 5312)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1052, file: !14, line: 2716, baseType: !1478, size: 64, align: 64, offset: 5376)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1480)
!1480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1481)
!1481 = !{!1482, !1483, !1484, !1485, !1486, !1487, !1491, !1495, !1499, !1500, !1501, !1502, !1508, !1509, !1510, !1511, !1512}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1480, file: !14, line: 3642, baseType: !962, size: 64, align: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1480, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1480, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1480, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1480, file: !14, line: 3669, baseType: !940, size: 32, align: 32, offset: 160)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1480, file: !14, line: 3682, baseType: !1488, size: 64, align: 64, offset: 192)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{!940, !1050, !1072}
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1480, file: !14, line: 3698, baseType: !1492, size: 64, align: 64, offset: 256)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DISubroutineType(types: !1494)
!1494 = !{!940, !1050, !952, !947}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1480, file: !14, line: 3712, baseType: !1496, size: 64, align: 64, offset: 320)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{!940, !1050, !940, !952, !947}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1480, file: !14, line: 3726, baseType: !1492, size: 64, align: 64, offset: 384)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1480, file: !14, line: 3737, baseType: !1047, size: 64, align: 64, offset: 448)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1480, file: !14, line: 3746, baseType: !940, size: 32, align: 32, offset: 512)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1480, file: !14, line: 3757, baseType: !1503, size: 64, align: 64, offset: 576)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DISubroutineType(types: !1505)
!1505 = !{null, !1506}
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1480, file: !14, line: 3766, baseType: !1047, size: 64, align: 64, offset: 640)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1480, file: !14, line: 3774, baseType: !1047, size: 64, align: 64, offset: 704)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1480, file: !14, line: 3780, baseType: !940, size: 32, align: 32, offset: 768)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1480, file: !14, line: 3785, baseType: !940, size: 32, align: 32, offset: 800)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1480, file: !14, line: 3795, baseType: !1513, size: 64, align: 64, offset: 832)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DISubroutineType(types: !1515)
!1515 = !{!940, !1050, !1112}
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1052, file: !14, line: 2728, baseType: !949, size: 64, align: 64, offset: 5440)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1052, file: !14, line: 2735, baseType: !1102, size: 512, align: 64, offset: 5504)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1052, file: !14, line: 2742, baseType: !940, size: 32, align: 32, offset: 6016)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1052, file: !14, line: 2755, baseType: !940, size: 32, align: 32, offset: 6048)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1052, file: !14, line: 2776, baseType: !940, size: 32, align: 32, offset: 6080)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1052, file: !14, line: 2783, baseType: !940, size: 32, align: 32, offset: 6112)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1052, file: !14, line: 2791, baseType: !940, size: 32, align: 32, offset: 6144)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1052, file: !14, line: 2802, baseType: !1072, size: 64, align: 64, offset: 6208)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1052, file: !14, line: 2811, baseType: !940, size: 32, align: 32, offset: 6272)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1052, file: !14, line: 2821, baseType: !940, size: 32, align: 32, offset: 6304)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1052, file: !14, line: 2830, baseType: !940, size: 32, align: 32, offset: 6336)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1052, file: !14, line: 2840, baseType: !940, size: 32, align: 32, offset: 6368)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1052, file: !14, line: 2851, baseType: !1529, size: 64, align: 64, offset: 6400)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DISubroutineType(types: !1531)
!1531 = !{!940, !1341, !1532, !949, !1344, !940, !940}
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64, align: 64)
!1533 = !DISubroutineType(types: !1534)
!1534 = !{!940, !1341, !949}
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1052, file: !14, line: 2871, baseType: !1536, size: 64, align: 64, offset: 6464)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DISubroutineType(types: !1538)
!1538 = !{!940, !1341, !1539, !949, !1344, !940}
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64, align: 64)
!1540 = !DISubroutineType(types: !1541)
!1541 = !{!940, !1341, !949, !940, !940}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1052, file: !14, line: 2878, baseType: !940, size: 32, align: 32, offset: 6528)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1052, file: !14, line: 2885, baseType: !940, size: 32, align: 32, offset: 6560)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1052, file: !14, line: 3005, baseType: !940, size: 32, align: 32, offset: 6592)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1052, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1052, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1052, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1052, file: !14, line: 3037, baseType: !1078, size: 64, align: 64, offset: 6720)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1052, file: !14, line: 3038, baseType: !940, size: 32, align: 32, offset: 6784)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1052, file: !14, line: 3050, baseType: !990, size: 64, align: 64, offset: 6848)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1052, file: !14, line: 3065, baseType: !940, size: 32, align: 32, offset: 6912)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1052, file: !14, line: 3083, baseType: !940, size: 32, align: 32, offset: 6944)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1052, file: !14, line: 3092, baseType: !972, size: 64, align: 32, offset: 6976)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1052, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1052, file: !14, line: 3106, baseType: !972, size: 64, align: 32, offset: 7072)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1052, file: !14, line: 3113, baseType: !1557, size: 64, align: 64, offset: 7168)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1559)
!1559 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1560)
!1560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1561)
!1561 = !{!1562, !1563, !1564, !1565, !1566, !1567, !1570}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1560, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1560, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1560, file: !14, line: 720, baseType: !962, size: 64, align: 64, offset: 64)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1560, file: !14, line: 724, baseType: !962, size: 64, align: 64, offset: 128)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1560, file: !14, line: 728, baseType: !940, size: 32, align: 32, offset: 192)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1560, file: !14, line: 734, baseType: !1568, size: 64, align: 64, offset: 256)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1560, file: !14, line: 739, baseType: !1571, size: 64, align: 64, offset: 320)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1038)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1052, file: !14, line: 3129, baseType: !1093, size: 64, align: 64, offset: 7232)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1052, file: !14, line: 3130, baseType: !1093, size: 64, align: 64, offset: 7296)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1052, file: !14, line: 3131, baseType: !1093, size: 64, align: 64, offset: 7360)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1052, file: !14, line: 3132, baseType: !1093, size: 64, align: 64, offset: 7424)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1052, file: !14, line: 3139, baseType: !1469, size: 64, align: 64, offset: 7488)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1052, file: !14, line: 3147, baseType: !940, size: 32, align: 32, offset: 7552)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1052, file: !14, line: 3165, baseType: !940, size: 32, align: 32, offset: 7584)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1052, file: !14, line: 3172, baseType: !940, size: 32, align: 32, offset: 7616)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1052, file: !14, line: 3180, baseType: !940, size: 32, align: 32, offset: 7648)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1052, file: !14, line: 3191, baseType: !1381, size: 64, align: 64, offset: 7680)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1052, file: !14, line: 3199, baseType: !1078, size: 64, align: 64, offset: 7744)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1052, file: !14, line: 3207, baseType: !1469, size: 64, align: 64, offset: 7808)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1052, file: !14, line: 3214, baseType: !941, size: 32, align: 32, offset: 7872)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1052, file: !14, line: 3224, baseType: !1210, size: 64, align: 64, offset: 7936)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1052, file: !14, line: 3225, baseType: !940, size: 32, align: 32, offset: 8000)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1052, file: !14, line: 3249, baseType: !1112, size: 64, align: 64, offset: 8064)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1052, file: !14, line: 3256, baseType: !940, size: 32, align: 32, offset: 8128)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1052, file: !14, line: 3271, baseType: !940, size: 32, align: 32, offset: 8160)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1052, file: !14, line: 3279, baseType: !1093, size: 64, align: 64, offset: 8192)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1052, file: !14, line: 3301, baseType: !1112, size: 64, align: 64, offset: 8256)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1052, file: !14, line: 3310, baseType: !940, size: 32, align: 32, offset: 8320)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1052, file: !14, line: 3337, baseType: !940, size: 32, align: 32, offset: 8352)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1052, file: !14, line: 3351, baseType: !940, size: 32, align: 32, offset: 8384)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1052, file: !14, line: 3359, baseType: !940, size: 32, align: 32, offset: 8416)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !959, file: !14, line: 3535, baseType: !1598, size: 64, align: 64, offset: 1024)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DISubroutineType(types: !1600)
!1600 = !{!940, !1050, !1601}
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1051)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !959, file: !14, line: 3541, baseType: !1604, size: 64, align: 64, offset: 1088)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1606)
!1606 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1607)
!1607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1066, line: 223, size: 128, align: 64, elements: !1608)
!1608 = !{!1609, !1610}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1607, file: !1066, line: 224, baseType: !952, size: 64, align: 64)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1607, file: !1066, line: 225, baseType: !952, size: 64, align: 64, offset: 64)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !959, file: !14, line: 3549, baseType: !1612, size: 64, align: 64, offset: 1152)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64, align: 64)
!1613 = !DISubroutineType(types: !1614)
!1614 = !{null, !1045}
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !959, file: !14, line: 3551, baseType: !1047, size: 64, align: 64, offset: 1216)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !959, file: !14, line: 3552, baseType: !1617, size: 64, align: 64, offset: 1280)
!1617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1618, size: 64, align: 64)
!1618 = !DISubroutineType(types: !1619)
!1619 = !{!940, !1050, !1078, !940, !1620}
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64, align: 64)
!1621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1622)
!1622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1623)
!1623 = !{!1624, !1625, !1626, !1627, !1628, !1652}
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1622, file: !14, line: 3921, baseType: !1382, size: 16, align: 16)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1622, file: !14, line: 3922, baseType: !947, size: 32, align: 32, offset: 32)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1622, file: !14, line: 3923, baseType: !947, size: 32, align: 32, offset: 64)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1622, file: !14, line: 3924, baseType: !941, size: 32, align: 32, offset: 96)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1622, file: !14, line: 3925, baseType: !1629, size: 64, align: 64, offset: 128)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1632)
!1632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1633)
!1633 = !{!1634, !1635, !1636, !1637, !1638, !1639, !1645, !1647, !1648, !1649, !1650, !1651}
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1632, file: !14, line: 3886, baseType: !940, size: 32, align: 32)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1632, file: !14, line: 3887, baseType: !940, size: 32, align: 32, offset: 32)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1632, file: !14, line: 3888, baseType: !940, size: 32, align: 32, offset: 64)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1632, file: !14, line: 3889, baseType: !940, size: 32, align: 32, offset: 96)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1632, file: !14, line: 3890, baseType: !940, size: 32, align: 32, offset: 128)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1632, file: !14, line: 3897, baseType: !1640, size: 768, align: 64, offset: 192)
!1640 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1641)
!1641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1642)
!1642 = !{!1643, !1644}
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1641, file: !14, line: 3855, baseType: !1077, size: 512, align: 64)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1641, file: !14, line: 3857, baseType: !1082, size: 256, align: 32, offset: 512)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1632, file: !14, line: 3903, baseType: !1646, size: 256, align: 64, offset: 960)
!1646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1078, size: 256, align: 64, elements: !1181)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1632, file: !14, line: 3904, baseType: !1188, size: 128, align: 32, offset: 1216)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1632, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1632, file: !14, line: 3908, baseType: !1469, size: 64, align: 64, offset: 1408)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1632, file: !14, line: 3915, baseType: !1469, size: 64, align: 64, offset: 1472)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1632, file: !14, line: 3917, baseType: !940, size: 32, align: 32, offset: 1536)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1622, file: !14, line: 3926, baseType: !1093, size: 64, align: 64, offset: 192)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !959, file: !14, line: 3564, baseType: !1654, size: 64, align: 64, offset: 1344)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DISubroutineType(types: !1656)
!1656 = !{!940, !1050, !1198, !1342, !1344}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !959, file: !14, line: 3566, baseType: !1658, size: 64, align: 64, offset: 1408)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DISubroutineType(types: !1660)
!1660 = !{!940, !1050, !949, !1344, !1198}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !959, file: !14, line: 3567, baseType: !1047, size: 64, align: 64, offset: 1472)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !959, file: !14, line: 3576, baseType: !1663, size: 64, align: 64, offset: 1536)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DISubroutineType(types: !1665)
!1665 = !{!940, !1050, !1342}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !959, file: !14, line: 3577, baseType: !1667, size: 64, align: 64, offset: 1600)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DISubroutineType(types: !1669)
!1669 = !{!940, !1050, !1198}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !959, file: !14, line: 3584, baseType: !1488, size: 64, align: 64, offset: 1664)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !959, file: !14, line: 3589, baseType: !1672, size: 64, align: 64, offset: 1728)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DISubroutineType(types: !1674)
!1674 = !{null, !1050}
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !959, file: !14, line: 3594, baseType: !940, size: 32, align: 32, offset: 1792)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !959, file: !14, line: 3600, baseType: !962, size: 64, align: 64, offset: 1856)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !959, file: !14, line: 3609, baseType: !1678, size: 64, align: 64, offset: 1920)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1681)
!1681 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1682 = !{i32 2, !"Dwarf Version", i32 4}
!1683 = !{i32 2, !"Debug Info Version", i32 3}
!1684 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1685 = distinct !DISubprogram(name: "dds_decode", scope: !888, file: !888, line: 608, type: !1659, isLocal: true, isDefinition: true, scopeLine: 610, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1686)
!1686 = !{}
!1687 = !DILocalVariable(name: "b", arg: 1, scope: !1688, file: !1689, line: 88, type: !1692)
!1688 = distinct !DISubprogram(name: "bytestream_get_le32", scope: !1689, file: !1689, line: 88, type: !1690, isLocal: true, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1686)
!1689 = !DIFile(filename: "libavcodec/bytestream.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1690 = !DISubroutineType(types: !1691)
!1691 = !{!941, !1692}
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!1693 = !DIExpression()
!1694 = !DILocation(line: 88, column: 95, scope: !1688, inlinedAt: !1695)
!1695 = distinct !DILocation(line: 88, column: 868, scope: !1696, inlinedAt: !1706)
!1696 = distinct !DISubprogram(name: "bytestream2_get_le32u", scope: !1689, file: !1689, line: 88, type: !1697, isLocal: true, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1686)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{!941, !1699}
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
