; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--av1_metadata_bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--av1_metadata_bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, {}*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }

!579 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!580 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!581 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!582 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!583 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!584 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!585 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!586 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!587 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!588 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!589 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!590 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!591 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!592 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !525, line: 538, size: 32, align: 32, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601}
!594 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!595 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!596 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!597 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!598 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!599 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!600 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!601 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!602 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !4, line: 1175, size: 32, align: 32, elements: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!604 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!605 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!606 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!607 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!608 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!609 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!610 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!611 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!612 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!613 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!614 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!615 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!616 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!617 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!618 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!619 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!620 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!621 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!622 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!623 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!624 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!625 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!626 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!627 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!628 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!629 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!630 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!631 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!632 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !633, line: 28, size: 32, align: 32, elements: !634)
!633 = !DIFile(filename: "libavcodec/av1.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643}
!635 = !DIEnumerator(name: "AV1_OBU_SEQUENCE_HEADER", value: 1)
!636 = !DIEnumerator(name: "AV1_OBU_TEMPORAL_DELIMITER", value: 2)
!637 = !DIEnumerator(name: "AV1_OBU_FRAME_HEADER", value: 3)
!638 = !DIEnumerator(name: "AV1_OBU_TILE_GROUP", value: 4)
!639 = !DIEnumerator(name: "AV1_OBU_METADATA", value: 5)
!640 = !DIEnumerator(name: "AV1_OBU_FRAME", value: 6)
!641 = !DIEnumerator(name: "AV1_OBU_REDUNDANT_FRAME_HEADER", value: 7)
!642 = !DIEnumerator(name: "AV1_OBU_TILE_LIST", value: 8)
!643 = !DIEnumerator(name: "AV1_OBU_PADDING", value: 15)
!644 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !645, line: 26, size: 32, align: 32, elements: !646)
!645 = !DIFile(filename: "libavcodec/av1_metadata_bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!646 = !{!647, !648, !649}
!647 = !DIEnumerator(name: "PASS", value: 0)
!648 = !DIEnumerator(name: "INSERT", value: 1)
!649 = !DIEnumerator(name: "REMOVE", value: 2)
!650 = !{!651, !852, !856, !857}
!651 = distinct !DIGlobalVariable(name: "ff_av1_metadata_bsf", scope: !0, file: !645, line: 290, type: !652, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_av1_metadata_bsf)
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !655)
!655 = !{!656, !660, !663, !747, !748, !809, !847, !851}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !654, file: !4, line: 5797, baseType: !657, size: 64, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!659 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !654, file: !4, line: 5804, baseType: !661, size: 64, align: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !654, file: !4, line: 5815, baseType: !664, size: 64, align: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !666)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !668)
!668 = !{!669, !670, !675, !706, !707, !708, !709, !713, !719, !721, !725}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !667, file: !486, line: 72, baseType: !657, size: 64, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !667, file: !486, line: 78, baseType: !671, size: 64, align: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64, align: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!657, !674}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !667, file: !486, line: 85, baseType: !676, size: 64, align: 64, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64, align: 64)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !679)
!679 = !{!680, !681, !682, !684, !685, !702, !703, !704, !705}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !678, file: !464, line: 247, baseType: !657, size: 64, align: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !678, file: !464, line: 253, baseType: !657, size: 64, align: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !678, file: !464, line: 259, baseType: !683, size: 32, align: 32, offset: 128)
!683 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !678, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !678, file: !464, line: 271, baseType: !686, size: 64, align: 64, offset: 192)
!686 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !678, file: !464, line: 265, size: 64, align: 64, elements: !687)
!687 = !{!688, !692, !694, !695}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !686, file: !464, line: 266, baseType: !689, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !690, line: 40, baseType: !691)
!690 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!691 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !686, file: !464, line: 267, baseType: !693, size: 64, align: 64)
!693 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !686, file: !464, line: 268, baseType: !657, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !686, file: !464, line: 270, baseType: !696, size: 64, align: 32)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !697, line: 61, baseType: !698)
!697 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !697, line: 58, size: 64, align: 32, elements: !699)
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !698, file: !697, line: 59, baseType: !683, size: 32, align: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !698, file: !697, line: 60, baseType: !683, size: 32, align: 32, offset: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !678, file: !464, line: 272, baseType: !693, size: 64, align: 64, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !678, file: !464, line: 273, baseType: !693, size: 64, align: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !678, file: !464, line: 275, baseType: !683, size: 32, align: 32, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !678, file: !464, line: 300, baseType: !657, size: 64, align: 64, offset: 448)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !667, file: !486, line: 93, baseType: !683, size: 32, align: 32, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !667, file: !486, line: 99, baseType: !683, size: 32, align: 32, offset: 224)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !667, file: !486, line: 108, baseType: !683, size: 32, align: 32, offset: 256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !667, file: !486, line: 113, baseType: !710, size: 64, align: 64, offset: 320)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64, align: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!674, !674, !674}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !667, file: !486, line: 123, baseType: !714, size: 64, align: 64, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64, align: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!717, !717}
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64, align: 64)
!718 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !667, file: !486, line: 130, baseType: !720, size: 32, align: 32, offset: 448)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !667, file: !486, line: 136, baseType: !722, size: 64, align: 64, offset: 512)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64, align: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!720, !674}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !667, file: !486, line: 142, baseType: !726, size: 64, align: 64, offset: 576)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64, align: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!683, !729, !674, !657, !683}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64, align: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64, align: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !732)
!732 = !{!733, !745, !746}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !731, file: !464, line: 360, baseType: !734, size: 64, align: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64, align: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64, align: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !744}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !737, file: !464, line: 307, baseType: !657, size: 64, align: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !737, file: !464, line: 313, baseType: !693, size: 64, align: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !737, file: !464, line: 313, baseType: !693, size: 64, align: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !737, file: !464, line: 318, baseType: !693, size: 64, align: 64, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !737, file: !464, line: 318, baseType: !693, size: 64, align: 64, offset: 256)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !737, file: !464, line: 323, baseType: !683, size: 32, align: 32, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !731, file: !464, line: 364, baseType: !683, size: 32, align: 32, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !731, file: !464, line: 368, baseType: !683, size: 32, align: 32, offset: 96)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !654, file: !4, line: 5825, baseType: !683, size: 32, align: 32, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !654, file: !4, line: 5826, baseType: !749, size: 64, align: 64, offset: 256)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64, align: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!683, !752}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64, align: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !755)
!755 = !{!756, !757, !760, !764, !765, !806, !807, !808}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !754, file: !4, line: 5751, baseType: !664, size: 64, align: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !754, file: !4, line: 5756, baseType: !758, size: 64, align: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !754, file: !4, line: 5762, baseType: !761, size: 64, align: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !763)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !754, file: !4, line: 5768, baseType: !674, size: 64, align: 64, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !754, file: !4, line: 5775, baseType: !766, size: 64, align: 64, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64, align: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !769)
!769 = !{!770, !771, !772, !775, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !799, !800, !801, !802, !803, !804, !805}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !768, file: !4, line: 3940, baseType: !506, size: 32, align: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !768, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !768, file: !4, line: 3948, baseType: !773, size: 32, align: 32, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !690, line: 51, baseType: !774)
!774 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !768, file: !4, line: 3958, baseType: !776, size: 64, align: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64, align: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !690, line: 48, baseType: !778)
!778 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !768, file: !4, line: 3962, baseType: !683, size: 32, align: 32, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !768, file: !4, line: 3968, baseType: !683, size: 32, align: 32, offset: 224)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !768, file: !4, line: 3973, baseType: !689, size: 64, align: 64, offset: 256)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !768, file: !4, line: 3986, baseType: !683, size: 32, align: 32, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !768, file: !4, line: 3999, baseType: !683, size: 32, align: 32, offset: 352)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !768, file: !4, line: 4004, baseType: !683, size: 32, align: 32, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !768, file: !4, line: 4005, baseType: !683, size: 32, align: 32, offset: 416)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !768, file: !4, line: 4010, baseType: !683, size: 32, align: 32, offset: 448)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !768, file: !4, line: 4011, baseType: !683, size: 32, align: 32, offset: 480)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !768, file: !4, line: 4020, baseType: !696, size: 64, align: 32, offset: 512)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !768, file: !4, line: 4025, baseType: !516, size: 32, align: 32, offset: 576)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !768, file: !4, line: 4030, baseType: !524, size: 32, align: 32, offset: 608)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !768, file: !4, line: 4031, baseType: !531, size: 32, align: 32, offset: 640)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !768, file: !4, line: 4032, baseType: !549, size: 32, align: 32, offset: 672)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !768, file: !4, line: 4033, baseType: !573, size: 32, align: 32, offset: 704)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !768, file: !4, line: 4034, baseType: !592, size: 32, align: 32, offset: 736)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !768, file: !4, line: 4039, baseType: !683, size: 32, align: 32, offset: 768)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !768, file: !4, line: 4046, baseType: !797, size: 64, align: 64, offset: 832)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !690, line: 55, baseType: !798)
!798 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !768, file: !4, line: 4050, baseType: !683, size: 32, align: 32, offset: 896)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !768, file: !4, line: 4054, baseType: !683, size: 32, align: 32, offset: 928)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !768, file: !4, line: 4061, baseType: !683, size: 32, align: 32, offset: 960)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !768, file: !4, line: 4065, baseType: !683, size: 32, align: 32, offset: 992)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !768, file: !4, line: 4073, baseType: !683, size: 32, align: 32, offset: 1024)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !768, file: !4, line: 4080, baseType: !683, size: 32, align: 32, offset: 1056)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !768, file: !4, line: 4084, baseType: !683, size: 32, align: 32, offset: 1088)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !754, file: !4, line: 5781, baseType: !766, size: 64, align: 64, offset: 320)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !754, file: !4, line: 5787, baseType: !696, size: 64, align: 32, offset: 384)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !754, file: !4, line: 5793, baseType: !696, size: 64, align: 32, offset: 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !654, file: !4, line: 5827, baseType: !810, size: 64, align: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64, align: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!683, !752, !813}
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64, align: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !816)
!816 = !{!817, !829, !830, !831, !832, !833, !834, !835, !843, !844, !845, !846}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !815, file: !4, line: 1451, baseType: !818, size: 64, align: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64, align: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !820, line: 94, baseType: !821)
!820 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !820, line: 81, size: 192, align: 64, elements: !822)
!822 = !{!823, !827, !828}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !821, file: !820, line: 82, baseType: !824, size: 64, align: 64)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64, align: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !820, line: 73, baseType: !826)
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !820, line: 73, flags: DIFlagFwdDecl)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !821, file: !820, line: 89, baseType: !776, size: 64, align: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !821, file: !820, line: 93, baseType: !683, size: 32, align: 32, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !815, file: !4, line: 1461, baseType: !689, size: 64, align: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !815, file: !4, line: 1467, baseType: !689, size: 64, align: 64, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !815, file: !4, line: 1468, baseType: !776, size: 64, align: 64, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !815, file: !4, line: 1469, baseType: !683, size: 32, align: 32, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !815, file: !4, line: 1470, baseType: !683, size: 32, align: 32, offset: 288)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !815, file: !4, line: 1474, baseType: !683, size: 32, align: 32, offset: 320)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !815, file: !4, line: 1479, baseType: !836, size: 64, align: 64, offset: 384)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64, align: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !839)
!839 = !{!840, !841, !842}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !838, file: !4, line: 1412, baseType: !776, size: 64, align: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !838, file: !4, line: 1413, baseType: !683, size: 32, align: 32, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !838, file: !4, line: 1414, baseType: !602, size: 32, align: 32, offset: 96)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !815, file: !4, line: 1480, baseType: !683, size: 32, align: 32, offset: 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !815, file: !4, line: 1486, baseType: !689, size: 64, align: 64, offset: 512)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !815, file: !4, line: 1488, baseType: !689, size: 64, align: 64, offset: 576)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !815, file: !4, line: 1497, baseType: !689, size: 64, align: 64, offset: 640)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !654, file: !4, line: 5828, baseType: !848, size: 64, align: 64, offset: 384)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64, align: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{null, !752}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !654, file: !4, line: 5829, baseType: !848, size: 64, align: 64, offset: 448)
!852 = distinct !DIGlobalVariable(name: "av1_metadata_codec_ids", scope: !0, file: !645, line: 286, type: !853, isLocal: true, isDefinition: true, variable: [2 x i32]* @av1_metadata_codec_ids)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !662, size: 64, align: 32, elements: !854)
!854 = !{!855}
!855 = !DISubrange(count: 2)
!856 = distinct !DIGlobalVariable(name: "av1_metadata_class", scope: !0, file: !645, line: 279, type: !665, isLocal: true, isDefinition: true, variable: %struct.AVClass* @av1_metadata_class)
!857 = distinct !DIGlobalVariable(name: "av1_metadata_options", scope: !0, file: !645, line: 230, type: !858, isLocal: true, isDefinition: true, variable: <{ %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption }>* @av1_metadata_options)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !859, size: 8704, align: 64, elements: !861)
!859 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !860)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !464, line: 301, baseType: !678)
!861 = !{!862}
!862 = !DISubrange(count: 17)
!863 = !{i32 2, !"Dwarf Version", i32 4}
!864 = !{i32 2, !"Debug Info Version", i32 3}
!865 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!866 = distinct !DISubprogram(name: "av1_metadata_init", scope: !645, file: !645, line: 182, type: !750, isLocal: true, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !867)
!867 = !{}
!868 = !DILocalVariable(name: "bsf", arg: 1, scope: !866, file: !645, line: 182, type: !752)
!869 = !DIExpression()
!870 = !DILocation(line: 182, column: 44, scope: !866)
!871 = !DILocalVariable(name: "ctx", scope: !866, file: !645, line: 184, type: !872)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64, align: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1MetadataContext", file: !645, line: 49, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1MetadataContext", file: !645, line: 32, size: 832, align: 64, elements: !875)
!875 = !{!876, !877, !895, !918, !919, !920, !921, !922, !923, !924, !925}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !874, file: !645, line: 33, baseType: !664, size: 64, align: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "cbc", scope: !874, file: !645, line: 35, baseType: !878, size: 64, align: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64, align: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamContext", file: !880, line: 204, baseType: !881)
!880 = !DIFile(filename: "libavcodec/cbs.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamContext", file: !880, line: 159, size: 384, align: 64, elements: !882)
!882 = !{!883, !884, !888, !889, !892, !893, !894}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !881, file: !880, line: 164, baseType: !674, size: 64, align: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !881, file: !880, line: 169, baseType: !885, size: 64, align: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64, align: 64)
!886 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !887)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamType", file: !880, line: 43, flags: DIFlagFwdDecl)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !881, file: !880, line: 180, baseType: !674, size: 64, align: 64, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "decompose_unit_types", scope: !881, file: !880, line: 188, baseType: !890, size: 64, align: 64, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64, align: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamUnitType", file: !880, line: 53, baseType: !773)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "nb_decompose_unit_types", scope: !881, file: !880, line: 192, baseType: !683, size: 32, align: 32, offset: 256)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "trace_enable", scope: !881, file: !880, line: 197, baseType: !683, size: 32, align: 32, offset: 288)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !881, file: !880, line: 203, baseType: !683, size: 32, align: 32, offset: 320)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "access_unit", scope: !874, file: !645, line: 36, baseType: !896, size: 384, align: 64, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamFragment", file: !880, line: 154, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamFragment", file: !880, line: 116, size: 384, align: 64, elements: !898)
!898 = !{!899, !900, !903, !904, !905, !906}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !897, file: !880, line: 122, baseType: !776, size: 64, align: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !897, file: !880, line: 129, baseType: !901, size: 64, align: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !902, line: 216, baseType: !798)
!902 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!903 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_padding", scope: !897, file: !880, line: 133, baseType: !901, size: 64, align: 64, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "data_ref", scope: !897, file: !880, line: 139, baseType: !818, size: 64, align: 64, offset: 192)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "nb_units", scope: !897, file: !880, line: 147, baseType: !683, size: 32, align: 32, offset: 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !897, file: !880, line: 153, baseType: !907, size: 64, align: 64, offset: 320)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64, align: 64)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamUnit", file: !880, line: 107, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamUnit", file: !880, line: 64, size: 448, align: 64, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !909, file: !880, line: 68, baseType: !891, size: 32, align: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !909, file: !880, line: 75, baseType: !776, size: 64, align: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !909, file: !880, line: 80, baseType: !901, size: 64, align: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_padding", scope: !909, file: !880, line: 86, baseType: !901, size: 64, align: 64, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "data_ref", scope: !909, file: !880, line: 92, baseType: !818, size: 64, align: 64, offset: 256)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "content", scope: !909, file: !880, line: 101, baseType: !674, size: 64, align: 64, offset: 320)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "content_ref", scope: !909, file: !880, line: 106, baseType: !818, size: 64, align: 64, offset: 384)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "td", scope: !874, file: !645, line: 38, baseType: !683, size: 32, align: 32, offset: 512)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !874, file: !645, line: 40, baseType: !683, size: 32, align: 32, offset: 544)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !874, file: !645, line: 41, baseType: !683, size: 32, align: 32, offset: 576)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !874, file: !645, line: 42, baseType: !683, size: 32, align: 32, offset: 608)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !874, file: !645, line: 44, baseType: !683, size: 32, align: 32, offset: 640)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_position", scope: !874, file: !645, line: 45, baseType: !683, size: 32, align: 32, offset: 672)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "tick_rate", scope: !874, file: !645, line: 47, baseType: !696, size: 64, align: 32, offset: 704)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "num_ticks_per_picture", scope: !874, file: !645, line: 48, baseType: !683, size: 32, align: 32, offset: 768)
!926 = !DILocation(line: 184, column: 25, scope: !866)
!927 = !DILocation(line: 184, column: 31, scope: !866)
!928 = !DILocation(line: 184, column: 36, scope: !866)
!929 = !DILocalVariable(name: "frag", scope: !866, file: !645, line: 185, type: !930)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64, align: 64)
!931 = !DILocation(line: 185, column: 29, scope: !866)
!932 = !DILocation(line: 185, column: 37, scope: !866)
!933 = !DILocation(line: 185, column: 42, scope: !866)
!934 = !DILocalVariable(name: "obu", scope: !866, file: !645, line: 186, type: !935)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1RawOBU", file: !937, line: 381, baseType: !938)
!937 = !DIFile(filename: "libavcodec/cbs_av1.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1RawOBU", file: !937, line: 368, size: 8896, align: 64, elements: !939)
!939 = !{!940, !952, !953}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !938, file: !937, line: 369, baseType: !941, size: 64, align: 8)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1RawOBUHeader", file: !937, line: 39, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1RawOBUHeader", file: !937, line: 29, size: 64, align: 8, elements: !943)
!943 = !{!944, !945, !946, !947, !948, !949, !950, !951}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "obu_forbidden_bit", scope: !942, file: !937, line: 30, baseType: !777, size: 8, align: 8)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "obu_type", scope: !942, file: !937, line: 31, baseType: !777, size: 8, align: 8, offset: 8)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "obu_extension_flag", scope: !942, file: !937, line: 32, baseType: !777, size: 8, align: 8, offset: 16)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "obu_has_size_field", scope: !942, file: !937, line: 33, baseType: !777, size: 8, align: 8, offset: 24)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "obu_reserved_1bit", scope: !942, file: !937, line: 34, baseType: !777, size: 8, align: 8, offset: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !942, file: !937, line: 36, baseType: !777, size: 8, align: 8, offset: 40)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_id", scope: !942, file: !937, line: 37, baseType: !777, size: 8, align: 8, offset: 48)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "extension_header_reserved_3bits", scope: !942, file: !937, line: 38, baseType: !777, size: 8, align: 8, offset: 56)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "obu_size", scope: !938, file: !937, line: 371, baseType: !901, size: 64, align: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "obu", scope: !938, file: !937, line: 380, baseType: !954, size: 8768, align: 64, offset: 128)
!954 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !938, file: !937, line: 373, size: 8768, align: 64, elements: !955)
!955 = !{!956, !1041, !1206, !1225, !1226, !1234}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "sequence_header", scope: !954, file: !937, line: 374, baseType: !957, size: 4704, align: 32)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1RawSequenceHeader", file: !937, line: 131, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1RawSequenceHeader", file: !937, line: 73, size: 4704, align: 32, elements: !959)
!959 = !{!960, !961, !962, !963, !964, !965, !966, !967, !975, !983, !989, !991, !992, !993, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1040}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "seq_profile", scope: !958, file: !937, line: 74, baseType: !777, size: 8, align: 8)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "still_picture", scope: !958, file: !937, line: 75, baseType: !777, size: 8, align: 8, offset: 8)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "reduced_still_picture_header", scope: !958, file: !937, line: 76, baseType: !777, size: 8, align: 8, offset: 16)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !958, file: !937, line: 78, baseType: !777, size: 8, align: 8, offset: 24)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "decoder_model_info_present_flag", scope: !958, file: !937, line: 79, baseType: !777, size: 8, align: 8, offset: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "initial_display_delay_present_flag", scope: !958, file: !937, line: 80, baseType: !777, size: 8, align: 8, offset: 40)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "operating_points_cnt_minus_1", scope: !958, file: !937, line: 81, baseType: !777, size: 8, align: 8, offset: 48)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info", scope: !958, file: !937, line: 83, baseType: !968, size: 128, align: 32, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1RawTimingInfo", file: !937, line: 64, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1RawTimingInfo", file: !937, line: 58, size: 128, align: 32, elements: !970)
!970 = !{!971, !972, !973, !974}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_display_tick", scope: !969, file: !937, line: 59, baseType: !773, size: 32, align: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !969, file: !937, line: 60, baseType: !773, size: 32, align: 32, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "equal_picture_interval", scope: !969, file: !937, line: 62, baseType: !777, size: 8, align: 8, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "num_ticks_per_picture_minus_1", scope: !969, file: !937, line: 63, baseType: !773, size: 32, align: 32, offset: 96)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "decoder_model_info", scope: !958, file: !937, line: 84, baseType: !976, size: 96, align: 32, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1RawDecoderModelInfo", file: !937, line: 71, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1RawDecoderModelInfo", file: !937, line: 66, size: 96, align: 32, elements: !978)
!978 = !{!979, !980, !981, !982}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_delay_length_minus_1", scope: !977, file: !937, line: 67, baseType: !777, size: 8, align: 8)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_decoding_tick", scope: !977, file: !937, line: 68, baseType: !773, size: 32, align: 32, offset: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_removal_time_length_minus_1", scope: !977, file: !937, line: 69, baseType: !777, size: 8, align: 8, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "frame_presentation_time_length_minus_1", scope: !977, file: !937, line: 70, baseType: !777, size: 8, align: 8, offset: 72)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "operating_point_idc", scope: !958, file: !937, line: 86, baseType: !984, size: 512, align: 16, offset: 288)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 512, align: 16, elements: !987)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !690, line: 49, baseType: !986)
!986 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!987 = !{!988}
!988 = !DISubrange(count: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "seq_level_idx", scope: !958, file: !937, line: 87, baseType: !990, size: 256, align: 8, offset: 800)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 256, align: 8, elements: !987)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "seq_tier", scope: !958, file: !937, line: 88, baseType: !990, size: 256, align: 8, offset: 1056)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "decoder_model_present_for_this_op", scope: !958, file: !937, line: 89, baseType: !990, size: 256, align: 8, offset: 1312)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "decoder_buffer_delay", scope: !958, file: !937, line: 90, baseType: !994, size: 1024, align: 32, offset: 1568)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !773, size: 1024, align: 32, elements: !987)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "encoder_buffer_delay", scope: !958, file: !937, line: 91, baseType: !994, size: 1024, align: 32, offset: 2592)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_mode_flag", scope: !958, file: !937, line: 92, baseType: !990, size: 256, align: 8, offset: 3616)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "initial_display_delay_present_for_this_op", scope: !958, file: !937, line: 93, baseType: !990, size: 256, align: 8, offset: 3872)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "initial_display_delay_minus_1", scope: !958, file: !937, line: 94, baseType: !990, size: 256, align: 8, offset: 4128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width_bits_minus_1", scope: !958, file: !937, line: 96, baseType: !777, size: 8, align: 8, offset: 4384)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height_bits_minus_1", scope: !958, file: !937, line: 97, baseType: !777, size: 8, align: 8, offset: 4392)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "max_frame_width_minus_1", scope: !958, file: !937, line: 98, baseType: !985, size: 16, align: 16, offset: 4400)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "max_frame_height_minus_1", scope: !958, file: !937, line: 99, baseType: !985, size: 16, align: 16, offset: 4416)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "frame_id_numbers_present_flag", scope: !958, file: !937, line: 101, baseType: !777, size: 8, align: 8, offset: 4432)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "delta_frame_id_length_minus_2", scope: !958, file: !937, line: 102, baseType: !777, size: 8, align: 8, offset: 4440)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "additional_frame_id_length_minus_1", scope: !958, file: !937, line: 103, baseType: !777, size: 8, align: 8, offset: 4448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "use_128x128_superblock", scope: !958, file: !937, line: 105, baseType: !777, size: 8, align: 8, offset: 4456)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "enable_filter_intra", scope: !958, file: !937, line: 106, baseType: !777, size: 8, align: 8, offset: 4464)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "enable_intra_edge_filter", scope: !958, file: !937, line: 107, baseType: !777, size: 8, align: 8, offset: 4472)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "enable_intraintra_compound", scope: !958, file: !937, line: 108, baseType: !777, size: 8, align: 8, offset: 4480)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "enable_masked_compound", scope: !958, file: !937, line: 109, baseType: !777, size: 8, align: 8, offset: 4488)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "enable_warped_motion", scope: !958, file: !937, line: 110, baseType: !777, size: 8, align: 8, offset: 4496)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "enable_dual_filter", scope: !958, file: !937, line: 111, baseType: !777, size: 8, align: 8, offset: 4504)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "enable_order_hint", scope: !958, file: !937, line: 113, baseType: !777, size: 8, align: 8, offset: 4512)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "enable_jnt_comp", scope: !958, file: !937, line: 114, baseType: !777, size: 8, align: 8, offset: 4520)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "enable_ref_frame_mvs", scope: !958, file: !937, line: 115, baseType: !777, size: 8, align: 8, offset: 4528)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "seq_choose_screen_content_tools", scope: !958, file: !937, line: 117, baseType: !777, size: 8, align: 8, offset: 4536)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "seq_force_screen_content_tools", scope: !958, file: !937, line: 118, baseType: !777, size: 8, align: 8, offset: 4544)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "seq_choose_integer_mv", scope: !958, file: !937, line: 119, baseType: !777, size: 8, align: 8, offset: 4552)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "seq_force_integer_mv", scope: !958, file: !937, line: 120, baseType: !777, size: 8, align: 8, offset: 4560)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "order_hint_bits_minus_1", scope: !958, file: !937, line: 122, baseType: !777, size: 8, align: 8, offset: 4568)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "enable_superres", scope: !958, file: !937, line: 124, baseType: !777, size: 8, align: 8, offset: 4576)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "enable_cdef", scope: !958, file: !937, line: 125, baseType: !777, size: 8, align: 8, offset: 4584)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "enable_restoration", scope: !958, file: !937, line: 126, baseType: !777, size: 8, align: 8, offset: 4592)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "color_config", scope: !958, file: !937, line: 128, baseType: !1025, size: 96, align: 8, offset: 4600)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1RawColorConfig", file: !937, line: 56, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1RawColorConfig", file: !937, line: 41, size: 96, align: 8, elements: !1027)
!1027 = !{!1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "high_bitdepth", scope: !1026, file: !937, line: 42, baseType: !777, size: 8, align: 8)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "twelve_bit", scope: !1026, file: !937, line: 43, baseType: !777, size: 8, align: 8, offset: 8)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "mono_chrome", scope: !1026, file: !937, line: 44, baseType: !777, size: 8, align: 8, offset: 16)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "color_description_present_flag", scope: !1026, file: !937, line: 46, baseType: !777, size: 8, align: 8, offset: 24)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1026, file: !937, line: 47, baseType: !777, size: 8, align: 8, offset: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !1026, file: !937, line: 48, baseType: !777, size: 8, align: 8, offset: 40)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !1026, file: !937, line: 49, baseType: !777, size: 8, align: 8, offset: 48)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1026, file: !937, line: 51, baseType: !777, size: 8, align: 8, offset: 56)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "subsampling_x", scope: !1026, file: !937, line: 52, baseType: !777, size: 8, align: 8, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "subsampling_y", scope: !1026, file: !937, line: 53, baseType: !777, size: 8, align: 8, offset: 72)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_position", scope: !1026, file: !937, line: 54, baseType: !777, size: 8, align: 8, offset: 80)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "separate_uv_delta_q", scope: !1026, file: !937, line: 55, baseType: !777, size: 8, align: 8, offset: 88)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "film_grain_params_present", scope: !958, file: !937, line: 130, baseType: !777, size: 8, align: 8, offset: 4696)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "frame_header", scope: !954, file: !937, line: 375, baseType: !1042, size: 8512, align: 32)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1RawFrameHeader", file: !937, line: 283, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1RawFrameHeader", file: !937, line: 133, size: 8512, align: 32, elements: !1044)
!1044 = !{!1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1073, !1074, !1075, !1079, !1080, !1081, !1082, !1086, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1124, !1128, !1129, !1130, !1131, !1132, !1133, !1137, !1138, !1139, !1140, !1141, !1143, !1145, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1171, !1172, !1173, !1174, !1175, !1176, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "show_existing_frame", scope: !1043, file: !937, line: 134, baseType: !777, size: 8, align: 8)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "frame_to_show_map_idx", scope: !1043, file: !937, line: 135, baseType: !777, size: 8, align: 8, offset: 8)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "frame_presentation_time", scope: !1043, file: !937, line: 136, baseType: !773, size: 32, align: 32, offset: 32)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "display_frame_id", scope: !1043, file: !937, line: 137, baseType: !773, size: 32, align: 32, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "frame_type", scope: !1043, file: !937, line: 139, baseType: !777, size: 8, align: 8, offset: 96)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "show_frame", scope: !1043, file: !937, line: 140, baseType: !777, size: 8, align: 8, offset: 104)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "showable_frame", scope: !1043, file: !937, line: 141, baseType: !777, size: 8, align: 8, offset: 112)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "error_resilient_mode", scope: !1043, file: !937, line: 143, baseType: !777, size: 8, align: 8, offset: 120)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "disable_cdf_update", scope: !1043, file: !937, line: 144, baseType: !777, size: 8, align: 8, offset: 128)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "allow_screen_content_tools", scope: !1043, file: !937, line: 145, baseType: !777, size: 8, align: 8, offset: 136)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "force_integer_mv", scope: !1043, file: !937, line: 146, baseType: !777, size: 8, align: 8, offset: 144)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "current_frame_id", scope: !1043, file: !937, line: 148, baseType: !773, size: 32, align: 32, offset: 160)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size_override_flag", scope: !1043, file: !937, line: 149, baseType: !777, size: 8, align: 8, offset: 192)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "order_hint", scope: !1043, file: !937, line: 150, baseType: !777, size: 8, align: 8, offset: 200)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_removal_time_present_flag", scope: !1043, file: !937, line: 152, baseType: !777, size: 8, align: 8, offset: 208)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_removal_time", scope: !1043, file: !937, line: 153, baseType: !994, size: 1024, align: 32, offset: 224)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "primary_ref_frame", scope: !1043, file: !937, line: 155, baseType: !777, size: 8, align: 8, offset: 1248)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width_minus_1", scope: !1043, file: !937, line: 156, baseType: !985, size: 16, align: 16, offset: 1264)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height_minus_1", scope: !1043, file: !937, line: 157, baseType: !985, size: 16, align: 16, offset: 1280)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "use_superres", scope: !1043, file: !937, line: 158, baseType: !777, size: 8, align: 8, offset: 1296)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "coded_denom", scope: !1043, file: !937, line: 159, baseType: !777, size: 8, align: 8, offset: 1304)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "render_and_frame_size_different", scope: !1043, file: !937, line: 160, baseType: !777, size: 8, align: 8, offset: 1312)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "render_width_minus_1", scope: !1043, file: !937, line: 161, baseType: !777, size: 8, align: 8, offset: 1320)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "render_height_minus_1", scope: !1043, file: !937, line: 162, baseType: !777, size: 8, align: 8, offset: 1328)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "found_ref", scope: !1043, file: !937, line: 164, baseType: !1070, size: 56, align: 8, offset: 1336)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 56, align: 8, elements: !1071)
!1071 = !{!1072}
!1072 = !DISubrange(count: 7)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "refresh_frame_flags", scope: !1043, file: !937, line: 166, baseType: !777, size: 8, align: 8, offset: 1392)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "allow_intrabc", scope: !1043, file: !937, line: 167, baseType: !777, size: 8, align: 8, offset: 1400)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "ref_order_hint", scope: !1043, file: !937, line: 168, baseType: !1076, size: 64, align: 8, offset: 1408)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 64, align: 8, elements: !1077)
!1077 = !{!1078}
!1078 = !DISubrange(count: 8)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "frame_refs_short_signaling", scope: !1043, file: !937, line: 169, baseType: !777, size: 8, align: 8, offset: 1472)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "last_frame_idx", scope: !1043, file: !937, line: 170, baseType: !777, size: 8, align: 8, offset: 1480)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "golden_frame_idx", scope: !1043, file: !937, line: 171, baseType: !777, size: 8, align: 8, offset: 1488)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frame_idx", scope: !1043, file: !937, line: 172, baseType: !1083, size: 56, align: 8, offset: 1496)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 56, align: 8, elements: !1071)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !690, line: 36, baseType: !1085)
!1085 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "delta_frame_id_minus1", scope: !1043, file: !937, line: 173, baseType: !1087, size: 224, align: 32, offset: 1568)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !773, size: 224, align: 32, elements: !1071)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "allow_high_precision_mv", scope: !1043, file: !937, line: 175, baseType: !777, size: 8, align: 8, offset: 1792)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "is_filter_switchable", scope: !1043, file: !937, line: 176, baseType: !777, size: 8, align: 8, offset: 1800)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "interpolation_filter", scope: !1043, file: !937, line: 177, baseType: !777, size: 8, align: 8, offset: 1808)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "is_motion_mode_switchable", scope: !1043, file: !937, line: 178, baseType: !777, size: 8, align: 8, offset: 1816)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "use_ref_frame_mvs", scope: !1043, file: !937, line: 179, baseType: !777, size: 8, align: 8, offset: 1824)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "disable_frame_end_update_cdf", scope: !1043, file: !937, line: 181, baseType: !777, size: 8, align: 8, offset: 1832)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "uniform_tile_spacing_flag", scope: !1043, file: !937, line: 183, baseType: !777, size: 8, align: 8, offset: 1840)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "tile_cols_log2", scope: !1043, file: !937, line: 184, baseType: !777, size: 8, align: 8, offset: 1848)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "tile_rows_log2", scope: !1043, file: !937, line: 185, baseType: !777, size: 8, align: 8, offset: 1856)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_sbs_minus_1", scope: !1043, file: !937, line: 186, baseType: !1098, size: 512, align: 8, offset: 1864)
!1098 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 512, align: 8, elements: !1099)
!1099 = !{!1100}
!1100 = !DISubrange(count: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_sbs_minus_1", scope: !1043, file: !937, line: 187, baseType: !1098, size: 512, align: 8, offset: 2376)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "context_update_tile_id", scope: !1043, file: !937, line: 188, baseType: !985, size: 16, align: 16, offset: 2896)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "tile_size_bytes_minus1", scope: !1043, file: !937, line: 189, baseType: !777, size: 8, align: 8, offset: 2912)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "tile_cols", scope: !1043, file: !937, line: 193, baseType: !985, size: 16, align: 16, offset: 2928)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "tile_rows", scope: !1043, file: !937, line: 194, baseType: !985, size: 16, align: 16, offset: 2944)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "base_q_idx", scope: !1043, file: !937, line: 196, baseType: !777, size: 8, align: 8, offset: 2960)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "delta_q_y_dc", scope: !1043, file: !937, line: 197, baseType: !1084, size: 8, align: 8, offset: 2968)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "diff_uv_delta", scope: !1043, file: !937, line: 198, baseType: !777, size: 8, align: 8, offset: 2976)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "delta_q_u_dc", scope: !1043, file: !937, line: 199, baseType: !1084, size: 8, align: 8, offset: 2984)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "delta_q_u_ac", scope: !1043, file: !937, line: 200, baseType: !1084, size: 8, align: 8, offset: 2992)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "delta_q_v_dc", scope: !1043, file: !937, line: 201, baseType: !1084, size: 8, align: 8, offset: 3000)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "delta_q_v_ac", scope: !1043, file: !937, line: 202, baseType: !1084, size: 8, align: 8, offset: 3008)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "using_qmatrix", scope: !1043, file: !937, line: 203, baseType: !777, size: 8, align: 8, offset: 3016)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "qm_y", scope: !1043, file: !937, line: 204, baseType: !777, size: 8, align: 8, offset: 3024)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "qm_u", scope: !1043, file: !937, line: 205, baseType: !777, size: 8, align: 8, offset: 3032)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "qm_v", scope: !1043, file: !937, line: 206, baseType: !777, size: 8, align: 8, offset: 3040)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "segmentation_enabled", scope: !1043, file: !937, line: 208, baseType: !777, size: 8, align: 8, offset: 3048)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "segmentation_update_map", scope: !1043, file: !937, line: 209, baseType: !777, size: 8, align: 8, offset: 3056)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "segmentation_temporal_update", scope: !1043, file: !937, line: 210, baseType: !777, size: 8, align: 8, offset: 3064)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "segmentation_update_data", scope: !1043, file: !937, line: 211, baseType: !777, size: 8, align: 8, offset: 3072)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "feature_enabled", scope: !1043, file: !937, line: 212, baseType: !1122, size: 512, align: 8, offset: 3080)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 512, align: 8, elements: !1123)
!1123 = !{!1078, !1078}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "feature_value", scope: !1043, file: !937, line: 213, baseType: !1125, size: 1024, align: 16, offset: 3600)
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1126, size: 1024, align: 16, elements: !1123)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !690, line: 37, baseType: !1127)
!1127 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "delta_q_present", scope: !1043, file: !937, line: 215, baseType: !777, size: 8, align: 8, offset: 4624)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "delta_q_res", scope: !1043, file: !937, line: 216, baseType: !777, size: 8, align: 8, offset: 4632)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "delta_lf_present", scope: !1043, file: !937, line: 217, baseType: !777, size: 8, align: 8, offset: 4640)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "delta_lf_res", scope: !1043, file: !937, line: 218, baseType: !777, size: 8, align: 8, offset: 4648)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "delta_lf_multi", scope: !1043, file: !937, line: 219, baseType: !777, size: 8, align: 8, offset: 4656)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "loop_filter_level", scope: !1043, file: !937, line: 221, baseType: !1134, size: 32, align: 8, offset: 4664)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 32, align: 8, elements: !1135)
!1135 = !{!1136}
!1136 = !DISubrange(count: 4)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "loop_filter_sharpness", scope: !1043, file: !937, line: 222, baseType: !777, size: 8, align: 8, offset: 4696)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "loop_filter_delta_enabled", scope: !1043, file: !937, line: 223, baseType: !777, size: 8, align: 8, offset: 4704)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "loop_filter_delta_update", scope: !1043, file: !937, line: 224, baseType: !777, size: 8, align: 8, offset: 4712)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "update_ref_delta", scope: !1043, file: !937, line: 225, baseType: !1076, size: 64, align: 8, offset: 4720)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "loop_filter_ref_deltas", scope: !1043, file: !937, line: 226, baseType: !1142, size: 64, align: 8, offset: 4784)
!1142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 64, align: 8, elements: !1077)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "update_mode_delta", scope: !1043, file: !937, line: 227, baseType: !1144, size: 16, align: 8, offset: 4848)
!1144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 16, align: 8, elements: !854)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "loop_filter_mode_deltas", scope: !1043, file: !937, line: 228, baseType: !1146, size: 16, align: 8, offset: 4864)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 16, align: 8, elements: !854)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "cdef_damping_minus_3", scope: !1043, file: !937, line: 230, baseType: !777, size: 8, align: 8, offset: 4880)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "cdef_bits", scope: !1043, file: !937, line: 231, baseType: !777, size: 8, align: 8, offset: 4888)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "cdef_y_pri_strength", scope: !1043, file: !937, line: 232, baseType: !1076, size: 64, align: 8, offset: 4896)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "cdef_y_sec_strength", scope: !1043, file: !937, line: 233, baseType: !1076, size: 64, align: 8, offset: 4960)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "cdef_uv_pri_strength", scope: !1043, file: !937, line: 234, baseType: !1076, size: 64, align: 8, offset: 5024)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "cdef_uv_sec_strength", scope: !1043, file: !937, line: 235, baseType: !1076, size: 64, align: 8, offset: 5088)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "lr_type", scope: !1043, file: !937, line: 237, baseType: !1154, size: 24, align: 8, offset: 5152)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 24, align: 8, elements: !1155)
!1155 = !{!1156}
!1156 = !DISubrange(count: 3)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "lr_unit_shift", scope: !1043, file: !937, line: 238, baseType: !777, size: 8, align: 8, offset: 5176)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "lr_uv_shift", scope: !1043, file: !937, line: 239, baseType: !777, size: 8, align: 8, offset: 5184)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "tx_mode", scope: !1043, file: !937, line: 241, baseType: !777, size: 8, align: 8, offset: 5192)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "reference_select", scope: !1043, file: !937, line: 242, baseType: !777, size: 8, align: 8, offset: 5200)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "skip_mode_present", scope: !1043, file: !937, line: 243, baseType: !777, size: 8, align: 8, offset: 5208)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "allow_warped_motion", scope: !1043, file: !937, line: 245, baseType: !777, size: 8, align: 8, offset: 5216)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "reduced_tx_set", scope: !1043, file: !937, line: 246, baseType: !777, size: 8, align: 8, offset: 5224)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "is_global", scope: !1043, file: !937, line: 248, baseType: !1076, size: 64, align: 8, offset: 5232)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "is_rot_zoom", scope: !1043, file: !937, line: 249, baseType: !1076, size: 64, align: 8, offset: 5296)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "is_translation", scope: !1043, file: !937, line: 250, baseType: !1076, size: 64, align: 8, offset: 5360)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "gm_params", scope: !1043, file: !937, line: 252, baseType: !1168, size: 1536, align: 32, offset: 5440)
!1168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !773, size: 1536, align: 32, elements: !1169)
!1169 = !{!1078, !1170}
!1170 = !DISubrange(count: 6)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "apply_grain", scope: !1043, file: !937, line: 254, baseType: !777, size: 8, align: 8, offset: 6976)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "grain_seed", scope: !1043, file: !937, line: 255, baseType: !985, size: 16, align: 16, offset: 6992)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "update_grain", scope: !1043, file: !937, line: 256, baseType: !777, size: 8, align: 8, offset: 7008)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "film_grain_params_ref_idx", scope: !1043, file: !937, line: 257, baseType: !777, size: 8, align: 8, offset: 7016)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "num_y_points", scope: !1043, file: !937, line: 258, baseType: !777, size: 8, align: 8, offset: 7024)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "point_y_value", scope: !1043, file: !937, line: 259, baseType: !1177, size: 128, align: 8, offset: 7032)
!1177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 128, align: 8, elements: !1178)
!1178 = !{!1179}
!1179 = !DISubrange(count: 16)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "point_y_scaling", scope: !1043, file: !937, line: 260, baseType: !1177, size: 128, align: 8, offset: 7160)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_scaling_from_luma", scope: !1043, file: !937, line: 261, baseType: !777, size: 8, align: 8, offset: 7288)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "num_cb_points", scope: !1043, file: !937, line: 262, baseType: !777, size: 8, align: 8, offset: 7296)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "point_cb_value", scope: !1043, file: !937, line: 263, baseType: !1177, size: 128, align: 8, offset: 7304)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "point_cb_scaling", scope: !1043, file: !937, line: 264, baseType: !1177, size: 128, align: 8, offset: 7432)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "num_cr_points", scope: !1043, file: !937, line: 265, baseType: !777, size: 8, align: 8, offset: 7560)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "point_cr_value", scope: !1043, file: !937, line: 266, baseType: !1177, size: 128, align: 8, offset: 7568)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "point_cr_scaling", scope: !1043, file: !937, line: 267, baseType: !1177, size: 128, align: 8, offset: 7696)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "grain_scaling_minus_8", scope: !1043, file: !937, line: 268, baseType: !777, size: 8, align: 8, offset: 7824)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "ar_coeff_lag", scope: !1043, file: !937, line: 269, baseType: !777, size: 8, align: 8, offset: 7832)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "ar_coeffs_y_plus_128", scope: !1043, file: !937, line: 270, baseType: !1191, size: 192, align: 8, offset: 7840)
!1191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 192, align: 8, elements: !1192)
!1192 = !{!1193}
!1193 = !DISubrange(count: 24)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "ar_coeffs_cb_plus_128", scope: !1043, file: !937, line: 271, baseType: !1191, size: 192, align: 8, offset: 8032)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "ar_coeffs_cr_plus_128", scope: !1043, file: !937, line: 272, baseType: !1191, size: 192, align: 8, offset: 8224)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "ar_coeff_shift_minus_6", scope: !1043, file: !937, line: 273, baseType: !777, size: 8, align: 8, offset: 8416)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "grain_scale_shift", scope: !1043, file: !937, line: 274, baseType: !777, size: 8, align: 8, offset: 8424)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mult", scope: !1043, file: !937, line: 275, baseType: !777, size: 8, align: 8, offset: 8432)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "cb_luma_mult", scope: !1043, file: !937, line: 276, baseType: !777, size: 8, align: 8, offset: 8440)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "cb_offset", scope: !1043, file: !937, line: 277, baseType: !985, size: 16, align: 16, offset: 8448)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "cr_mult", scope: !1043, file: !937, line: 278, baseType: !777, size: 8, align: 8, offset: 8464)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "cr_luma_mult", scope: !1043, file: !937, line: 279, baseType: !777, size: 8, align: 8, offset: 8472)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "cr_offset", scope: !1043, file: !937, line: 280, baseType: !985, size: 16, align: 16, offset: 8480)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_flag", scope: !1043, file: !937, line: 281, baseType: !777, size: 8, align: 8, offset: 8496)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "clip_to_restricted_range", scope: !1043, file: !937, line: 282, baseType: !777, size: 8, align: 8, offset: 8504)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !954, file: !937, line: 376, baseType: !1207, size: 8768, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1RawFrame", file: !937, line: 302, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1RawFrame", file: !937, line: 299, size: 8768, align: 64, elements: !1209)
!1209 = !{!1210, !1211}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1208, file: !937, line: 300, baseType: !1042, size: 8512, align: 32)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "tile_group", scope: !1208, file: !937, line: 301, baseType: !1212, size: 256, align: 64, offset: 8512)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1RawTileGroup", file: !937, line: 297, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1RawTileGroup", file: !937, line: 291, size: 256, align: 64, elements: !1214)
!1214 = !{!1215, !1216, !1217, !1218}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "tile_start_and_end_present_flag", scope: !1213, file: !937, line: 292, baseType: !777, size: 8, align: 8)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "tg_start", scope: !1213, file: !937, line: 293, baseType: !985, size: 16, align: 16, offset: 16)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "tg_end", scope: !1213, file: !937, line: 294, baseType: !985, size: 16, align: 16, offset: 32)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "tile_data", scope: !1213, file: !937, line: 296, baseType: !1219, size: 192, align: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1RawTileData", file: !937, line: 289, baseType: !1220)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1RawTileData", file: !937, line: 285, size: 192, align: 64, elements: !1221)
!1221 = !{!1222, !1223, !1224}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1220, file: !937, line: 286, baseType: !776, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !1220, file: !937, line: 287, baseType: !901, size: 64, align: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "data_ref", scope: !1220, file: !937, line: 288, baseType: !818, size: 64, align: 64, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "tile_group", scope: !954, file: !937, line: 377, baseType: !1212, size: 256, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "tile_list", scope: !954, file: !937, line: 378, baseType: !1227, size: 256, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1RawTileList", file: !937, line: 310, baseType: !1228)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1RawTileList", file: !937, line: 304, size: 256, align: 64, elements: !1229)
!1229 = !{!1230, !1231, !1232, !1233}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "output_frame_width_in_tiles_minus_1", scope: !1228, file: !937, line: 305, baseType: !777, size: 8, align: 8)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "output_frame_height_in_tiles_minus_1", scope: !1228, file: !937, line: 306, baseType: !777, size: 8, align: 8, offset: 8)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "tile_count_minus_1", scope: !1228, file: !937, line: 307, baseType: !985, size: 16, align: 16, offset: 16)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "tile_data", scope: !1228, file: !937, line: 309, baseType: !1219, size: 192, align: 64, offset: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !954, file: !937, line: 379, baseType: !1235, size: 320, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1RawMetadata", file: !937, line: 365, baseType: !1236)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1RawMetadata", file: !937, line: 356, size: 320, align: 64, elements: !1237)
!1237 = !{!1238, !1239}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_type", scope: !1236, file: !937, line: 357, baseType: !797, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1236, file: !937, line: 364, baseType: !1240, size: 256, align: 64, offset: 64)
!1240 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1236, file: !937, line: 358, size: 256, align: 64, elements: !1241)
!1241 = !{!1242, !1248, !1259, !1264, !1273}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_cll", scope: !1240, file: !937, line: 359, baseType: !1243, size: 32, align: 16)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1RawMetadataHDRCLL", file: !937, line: 315, baseType: !1244)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1RawMetadataHDRCLL", file: !937, line: 312, size: 32, align: 16, elements: !1245)
!1245 = !{!1246, !1247}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "max_cll", scope: !1244, file: !937, line: 313, baseType: !985, size: 16, align: 16)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "max_fall", scope: !1244, file: !937, line: 314, baseType: !985, size: 16, align: 16, offset: 16)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_mdcv", scope: !1240, file: !937, line: 360, baseType: !1249, size: 192, align: 32)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1RawMetadataHDRMDCV", file: !937, line: 324, baseType: !1250)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1RawMetadataHDRMDCV", file: !937, line: 317, size: 192, align: 32, elements: !1251)
!1251 = !{!1252, !1254, !1255, !1256, !1257, !1258}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "primary_chromaticity_x", scope: !1250, file: !937, line: 318, baseType: !1253, size: 48, align: 16)
!1253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 48, align: 16, elements: !1155)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "primary_chromaticity_y", scope: !1250, file: !937, line: 319, baseType: !1253, size: 48, align: 16, offset: 48)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "white_point_chromaticity_x", scope: !1250, file: !937, line: 320, baseType: !985, size: 16, align: 16, offset: 96)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "white_point_chromaticity_y", scope: !1250, file: !937, line: 321, baseType: !985, size: 16, align: 16, offset: 112)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "luminance_max", scope: !1250, file: !937, line: 322, baseType: !773, size: 32, align: 32, offset: 128)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "luminance_min", scope: !1250, file: !937, line: 323, baseType: !773, size: 32, align: 32, offset: 160)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "scalability", scope: !1240, file: !937, line: 361, baseType: !1260, size: 8, align: 8)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1RawMetadataScalability", file: !937, line: 329, baseType: !1261)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1RawMetadataScalability", file: !937, line: 326, size: 8, align: 8, elements: !1262)
!1262 = !{!1263}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "scalability_mode_idc", scope: !1261, file: !937, line: 327, baseType: !777, size: 8, align: 8)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "itut_t35", scope: !1240, file: !937, line: 362, baseType: !1265, size: 256, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1RawMetadataITUTT35", file: !937, line: 338, baseType: !1266)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1RawMetadataITUTT35", file: !937, line: 331, size: 256, align: 64, elements: !1267)
!1267 = !{!1268, !1269, !1270, !1271, !1272}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "itu_t_t35_country_code", scope: !1266, file: !937, line: 332, baseType: !777, size: 8, align: 8)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "itu_t_t35_country_code_extension_byte", scope: !1266, file: !937, line: 333, baseType: !777, size: 8, align: 8, offset: 8)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !1266, file: !937, line: 335, baseType: !776, size: 64, align: 64, offset: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "payload_size", scope: !1266, file: !937, line: 336, baseType: !901, size: 64, align: 64, offset: 128)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "payload_ref", scope: !1266, file: !937, line: 337, baseType: !818, size: 64, align: 64, offset: 192)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "timecode", scope: !1240, file: !937, line: 363, baseType: !1274, size: 160, align: 32)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1RawMetadataTimecode", file: !937, line: 354, baseType: !1275)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1RawMetadataTimecode", file: !937, line: 340, size: 160, align: 32, elements: !1276)
!1276 = !{!1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "counting_type", scope: !1275, file: !937, line: 341, baseType: !777, size: 8, align: 8)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "full_timestamp_flag", scope: !1275, file: !937, line: 342, baseType: !777, size: 8, align: 8, offset: 8)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "discontinuity_flag", scope: !1275, file: !937, line: 343, baseType: !777, size: 8, align: 8, offset: 16)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "cnt_dropped_flag", scope: !1275, file: !937, line: 344, baseType: !777, size: 8, align: 8, offset: 24)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "n_frames", scope: !1275, file: !937, line: 345, baseType: !985, size: 16, align: 16, offset: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "seconds_value", scope: !1275, file: !937, line: 346, baseType: !777, size: 8, align: 8, offset: 48)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "minutes_value", scope: !1275, file: !937, line: 347, baseType: !777, size: 8, align: 8, offset: 56)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "hours_value", scope: !1275, file: !937, line: 348, baseType: !777, size: 8, align: 8, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "seconds_flag", scope: !1275, file: !937, line: 349, baseType: !777, size: 8, align: 8, offset: 72)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "minutes_flag", scope: !1275, file: !937, line: 350, baseType: !777, size: 8, align: 8, offset: 80)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "hours_flag", scope: !1275, file: !937, line: 351, baseType: !777, size: 8, align: 8, offset: 88)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !1275, file: !937, line: 352, baseType: !777, size: 8, align: 8, offset: 96)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_value", scope: !1275, file: !937, line: 353, baseType: !773, size: 32, align: 32, offset: 128)
!1290 = !DILocation(line: 186, column: 16, scope: !866)
!1291 = !DILocalVariable(name: "err", scope: !866, file: !645, line: 187, type: !683)
!1292 = !DILocation(line: 187, column: 9, scope: !866)
!1293 = !DILocalVariable(name: "i", scope: !866, file: !645, line: 187, type: !683)
!1294 = !DILocation(line: 187, column: 14, scope: !866)
!1295 = !DILocation(line: 189, column: 24, scope: !866)
!1296 = !DILocation(line: 189, column: 29, scope: !866)
!1297 = !DILocation(line: 189, column: 51, scope: !866)
!1298 = !DILocation(line: 189, column: 11, scope: !866)
!1299 = !DILocation(line: 189, column: 9, scope: !866)
!1300 = !DILocation(line: 190, column: 9, scope: !1301)
!1301 = distinct !DILexicalBlock(scope: !866, file: !645, line: 190, column: 9)
!1302 = !DILocation(line: 190, column: 13, scope: !1301)
!1303 = !DILocation(line: 190, column: 9, scope: !866)
!1304 = !DILocation(line: 191, column: 16, scope: !1301)
!1305 = !DILocation(line: 191, column: 9, scope: !1301)
!1306 = !DILocation(line: 193, column: 9, scope: !1307)
!1307 = distinct !DILexicalBlock(scope: !866, file: !645, line: 193, column: 9)
!1308 = !DILocation(line: 193, column: 14, scope: !1307)
!1309 = !DILocation(line: 193, column: 22, scope: !1307)
!1310 = !DILocation(line: 193, column: 9, scope: !866)
!1311 = !DILocation(line: 194, column: 37, scope: !1312)
!1312 = distinct !DILexicalBlock(scope: !1307, file: !645, line: 193, column: 33)
!1313 = !DILocation(line: 194, column: 42, scope: !1312)
!1314 = !DILocation(line: 194, column: 47, scope: !1312)
!1315 = !DILocation(line: 194, column: 53, scope: !1312)
!1316 = !DILocation(line: 194, column: 58, scope: !1312)
!1317 = !DILocation(line: 194, column: 15, scope: !1312)
!1318 = !DILocation(line: 194, column: 13, scope: !1312)
!1319 = !DILocation(line: 195, column: 13, scope: !1320)
!1320 = distinct !DILexicalBlock(scope: !1312, file: !645, line: 195, column: 13)
!1321 = !DILocation(line: 195, column: 17, scope: !1320)
!1322 = !DILocation(line: 195, column: 13, scope: !1312)
!1323 = !DILocation(line: 196, column: 20, scope: !1324)
!1324 = distinct !DILexicalBlock(scope: !1320, file: !645, line: 195, column: 22)
!1325 = !DILocation(line: 196, column: 13, scope: !1324)
!1326 = !DILocation(line: 197, column: 13, scope: !1324)
!1327 = !DILocation(line: 200, column: 16, scope: !1328)
!1328 = distinct !DILexicalBlock(scope: !1312, file: !645, line: 200, column: 9)
!1329 = !DILocation(line: 200, column: 14, scope: !1328)
!1330 = !DILocation(line: 200, column: 21, scope: !1331)
!1331 = !DILexicalBlockFile(scope: !1332, file: !645, discriminator: 1)
!1332 = distinct !DILexicalBlock(scope: !1328, file: !645, line: 200, column: 9)
!1333 = !DILocation(line: 200, column: 25, scope: !1331)
!1334 = !DILocation(line: 200, column: 31, scope: !1331)
!1335 = !DILocation(line: 200, column: 23, scope: !1331)
!1336 = !DILocation(line: 200, column: 9, scope: !1331)
!1337 = !DILocation(line: 201, column: 29, scope: !1338)
!1338 = distinct !DILexicalBlock(scope: !1339, file: !645, line: 201, column: 17)
!1339 = distinct !DILexicalBlock(scope: !1332, file: !645, line: 200, column: 46)
!1340 = !DILocation(line: 201, column: 17, scope: !1338)
!1341 = !DILocation(line: 201, column: 23, scope: !1338)
!1342 = !DILocation(line: 201, column: 32, scope: !1338)
!1343 = !DILocation(line: 201, column: 37, scope: !1338)
!1344 = !DILocation(line: 201, column: 17, scope: !1339)
!1345 = !DILocation(line: 202, column: 35, scope: !1346)
!1346 = distinct !DILexicalBlock(scope: !1338, file: !645, line: 201, column: 65)
!1347 = !DILocation(line: 202, column: 23, scope: !1346)
!1348 = !DILocation(line: 202, column: 29, scope: !1346)
!1349 = !DILocation(line: 202, column: 38, scope: !1346)
!1350 = !DILocation(line: 202, column: 21, scope: !1346)
!1351 = !DILocation(line: 203, column: 59, scope: !1346)
