; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--h264_levels.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--h264_levels.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.H264LevelDescriptor = type { i8*, i8, i8, i32, i32, i32, i32, i32, i16, i8, i8 }
%struct.anon = type { i32, i32, i32 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !7)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--h264_levels.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !5, line: 40, baseType: !6)
!5 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!6 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!7 = !{!8, !38}
!8 = distinct !DIGlobalVariable(name: "h264_levels", scope: !0, file: !9, line: 23, type: !10, isLocal: true, isDefinition: true, variable: [21 x %struct.H264LevelDescriptor]* @h264_levels)
!9 = !DIFile(filename: "libavcodec/h264_levels.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 6720, align: 64, elements: !36)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264LevelDescriptor", file: !13, line: 37, baseType: !14)
!13 = !DIFile(filename: "libavcodec/h264_levels.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264LevelDescriptor", file: !13, line: 25, size: 320, align: 64, elements: !15)
!15 = !{!16, !20, !23, !24, !27, !28, !29, !30, !31, !34, !35}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !14, file: !13, line: 26, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !14, file: !13, line: 27, baseType: !21, size: 8, align: 8, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !5, line: 48, baseType: !22)
!22 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "constraint_set3_flag", scope: !14, file: !13, line: 28, baseType: !21, size: 8, align: 8, offset: 72)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "max_mbps", scope: !14, file: !13, line: 29, baseType: !25, size: 32, align: 32, offset: 96)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !5, line: 51, baseType: !26)
!26 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "max_fs", scope: !14, file: !13, line: 30, baseType: !25, size: 32, align: 32, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "max_dpb_mbs", scope: !14, file: !13, line: 31, baseType: !25, size: 32, align: 32, offset: 160)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "max_br", scope: !14, file: !13, line: 32, baseType: !25, size: 32, align: 32, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "max_cpb", scope: !14, file: !13, line: 33, baseType: !25, size: 32, align: 32, offset: 224)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_mv_r", scope: !14, file: !13, line: 34, baseType: !32, size: 16, align: 16, offset: 256)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !5, line: 49, baseType: !33)
!33 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "min_cr", scope: !14, file: !13, line: 35, baseType: !21, size: 8, align: 8, offset: 272)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "max_mvs_per_2mb", scope: !14, file: !13, line: 36, baseType: !21, size: 8, align: 8, offset: 280)
!36 = !{!37}
!37 = !DISubrange(count: 21)
!38 = distinct !DIGlobalVariable(name: "h264_br_factors", scope: !0, file: !9, line: 55, type: !39, isLocal: true, isDefinition: true, variable: [8 x %struct.anon]* @h264_br_factors)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 768, align: 32, elements: !47)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 51, size: 96, align: 32, elements: !42)
!42 = !{!43, !45, !46}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !41, file: !9, line: 52, baseType: !44, size: 32, align: 32)
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_br_vcl_factor", scope: !41, file: !9, line: 53, baseType: !44, size: 32, align: 32, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_br_nal_factor", scope: !41, file: !9, line: 54, baseType: !44, size: 32, align: 32, offset: 64)
!47 = !{!48}
!48 = !DISubrange(count: 8)
!49 = !{i32 2, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!52 = distinct !DISubprogram(name: "ff_h264_get_level", scope: !9, file: !9, line: 78, type: !53, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !44, !44}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!56 = !DILocalVariable(name: "level_idc", arg: 1, scope: !52, file: !9, line: 78, type: !44)
!57 = !DIExpression()
!58 = !DILocation(line: 78, column: 50, scope: !52)
!59 = !DILocalVariable(name: "constraint_set3_flag", arg: 2, scope: !52, file: !9, line: 79, type: !44)
!60 = !DILocation(line: 79, column: 50, scope: !52)
!61 = !DILocalVariable(name: "i", scope: !52, file: !9, line: 81, type: !44)
!62 = !DILocation(line: 81, column: 9, scope: !52)
!63 = !DILocation(line: 82, column: 12, scope: !64)
!64 = distinct !DILexicalBlock(scope: !52, file: !9, line: 82, column: 5)
!65 = !DILocation(line: 82, column: 10, scope: !64)
!66 = !DILocation(line: 82, column: 17, scope: !67)
!67 = !DILexicalBlockFile(scope: !68, file: !9, discriminator: 1)
!68 = distinct !DILexicalBlock(scope: !64, file: !9, line: 82, column: 5)
!69 = !DILocation(line: 82, column: 19, scope: !67)
!70 = !DILocation(line: 82, column: 5, scope: !67)
!71 = !DILocation(line: 83, column: 25, scope: !72)
!72 = distinct !DILexicalBlock(scope: !73, file: !9, line: 83, column: 13)
!73 = distinct !DILexicalBlock(scope: !68, file: !9, line: 82, column: 76)
!74 = !DILocation(line: 83, column: 13, scope: !72)
!75 = !DILocation(line: 83, column: 28, scope: !72)
!76 = !DILocation(line: 83, column: 41, scope: !72)
!77 = !DILocation(line: 83, column: 38, scope: !72)
!78 = !DILocation(line: 83, column: 51, scope: !72)
!79 = !DILocation(line: 84, column: 25, scope: !72)
!80 = !DILocation(line: 84, column: 13, scope: !72)
!81 = !DILocation(line: 84, column: 28, scope: !72)
!82 = !DILocation(line: 84, column: 52, scope: !72)
!83 = !DILocation(line: 84, column: 49, scope: !72)
!84 = !DILocation(line: 83, column: 13, scope: !85)
!85 = !DILexicalBlockFile(scope: !73, file: !9, discriminator: 1)
!86 = !DILocation(line: 85, column: 33, scope: !72)
!87 = !DILocation(line: 85, column: 21, scope: !72)
!88 = !DILocation(line: 85, column: 13, scope: !72)
!89 = !DILocation(line: 86, column: 5, scope: !73)
!90 = !DILocation(line: 82, column: 72, scope: !91)
!91 = !DILexicalBlockFile(scope: !68, file: !9, discriminator: 2)
!92 = !DILocation(line: 82, column: 5, scope: !91)
!93 = distinct !{!93, !94}
!94 = !DILocation(line: 82, column: 5, scope: !52)
!95 = !DILocation(line: 87, column: 5, scope: !52)
!96 = !DILocation(line: 88, column: 1, scope: !52)
!97 = distinct !DISubprogram(name: "ff_h264_guess_level", scope: !9, file: !9, line: 90, type: !98, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!98 = !DISubroutineType(types: !99)
!99 = !{!55, !44, !4, !44, !44, !44}
!100 = !DILocalVariable(name: "profile_idc", arg: 1, scope: !97, file: !9, line: 90, type: !44)
!101 = !DILocation(line: 90, column: 52, scope: !97)
!102 = !DILocalVariable(name: "bitrate", arg: 2, scope: !97, file: !9, line: 91, type: !4)
!103 = !DILocation(line: 91, column: 56, scope: !97)
!104 = !DILocalVariable(name: "width", arg: 3, scope: !97, file: !9, line: 92, type: !44)
!105 = !DILocation(line: 92, column: 52, scope: !97)
!106 = !DILocalVariable(name: "height", arg: 4, scope: !97, file: !9, line: 92, type: !44)
!107 = !DILocation(line: 92, column: 63, scope: !97)
!108 = !DILocalVariable(name: "max_dec_frame_buffering", arg: 5, scope: !97, file: !9, line: 93, type: !44)
