; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--cinedec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--cinedec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProbeData = type { i8*, i8*, i32, i8* }

!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !917, line: 39, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "libavformat/cinedec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!918 = !{!919, !920, !921}
!919 = !DIEnumerator(name: "CC_RGB", value: 0)
!920 = !DIEnumerator(name: "CC_LEAD", value: 1)
!921 = !DIEnumerator(name: "CC_UNINT", value: 2)
!922 = !{!923, !932, !939, !938}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!925 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !926, line: 222, size: 16, align: 8, elements: !927)
!926 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!927 = !{!928}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !925, file: !926, line: 222, baseType: !929, size: 16, align: 16)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !930, line: 49, baseType: !931)
!930 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!931 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !926, line: 221, size: 32, align: 8, elements: !935)
!935 = !{!936}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !934, file: !926, line: 221, baseType: !937, size: 32, align: 32)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !930, line: 51, baseType: !938)
!938 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!939 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!940 = !{!941}
!941 = distinct !DIGlobalVariable(name: "ff_cine_demuxer", scope: !0, file: !917, line: 321, type: !942, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_cine_demuxer)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !897, line: 777, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !944)
!944 = !{!945, !949, !950, !951, !952, !962, !1004, !1005, !1007, !1008, !1009, !1023, !2134, !2135, !2136, !2140, !2144, !2145, !2146, !2150, !2151, !2152}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !943, file: !897, line: 638, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!948 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !943, file: !897, line: 645, baseType: !946, size: 64, align: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !943, file: !897, line: 652, baseType: !939, size: 32, align: 32, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !943, file: !897, line: 659, baseType: !946, size: 64, align: 64, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !943, file: !897, line: 661, baseType: !953, size: 64, align: 64, offset: 256)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !958, line: 44, size: 64, align: 32, elements: !959)
!958 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!959 = !{!960, !961}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !957, file: !958, line: 45, baseType: !3, size: 32, align: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !957, file: !958, line: 46, baseType: !938, size: 32, align: 32, offset: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !943, file: !897, line: 663, baseType: !963, size: 64, align: 64, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !967)
!967 = !{!968, !969, !974, !978, !979, !980, !981, !985, !991, !993, !997}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !966, file: !464, line: 72, baseType: !946, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !966, file: !464, line: 78, baseType: !970, size: 64, align: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!946, !973}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !966, file: !464, line: 85, baseType: !975, size: 64, align: 64, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !966, file: !464, line: 93, baseType: !939, size: 32, align: 32, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !966, file: !464, line: 99, baseType: !939, size: 32, align: 32, offset: 224)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !966, file: !464, line: 108, baseType: !939, size: 32, align: 32, offset: 256)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !966, file: !464, line: 113, baseType: !982, size: 64, align: 64, offset: 320)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!973, !973, !973}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !966, file: !464, line: 123, baseType: !986, size: 64, align: 64, offset: 384)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!989, !989}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !966, file: !464, line: 130, baseType: !992, size: 32, align: 32, offset: 448)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !966, file: !464, line: 136, baseType: !994, size: 64, align: 64, offset: 512)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!992, !973}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !966, file: !464, line: 142, baseType: !998, size: 64, align: 64, offset: 576)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!939, !1001, !973, !946, !939}
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !943, file: !897, line: 670, baseType: !946, size: 64, align: 64, offset: 384)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !943, file: !897, line: 679, baseType: !1006, size: 64, align: 64, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !943, file: !897, line: 684, baseType: !939, size: 32, align: 32, offset: 512)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !943, file: !897, line: 689, baseType: !939, size: 32, align: 32, offset: 544)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !943, file: !897, line: 696, baseType: !1010, size: 64, align: 64, offset: 576)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!939, !1013}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1016)
!1016 = !{!1017, !1018, !1021, !1022}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1015, file: !897, line: 449, baseType: !946, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1015, file: !897, line: 450, baseType: !1019, size: 64, align: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1015, file: !897, line: 451, baseType: !939, size: 32, align: 32, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1015, file: !897, line: 452, baseType: !946, size: 64, align: 64, offset: 192)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !943, file: !897, line: 703, baseType: !1024, size: 64, align: 64, offset: 640)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!939, !1027}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1029)
!1029 = !{!1030, !1031, !1032, !1232, !1233, !1298, !1299, !1300, !1991, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2045, !2046, !2047, !2048, !2049, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2100, !2101, !2104, !2105, !2106, !2107, !2108, !2109, !2111, !2112, !2113, !2114, !2122, !2123, !2127, !2131, !2132, !2133}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1028, file: !897, line: 1342, baseType: !963, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1028, file: !897, line: 1349, baseType: !1006, size: 64, align: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1028, file: !897, line: 1356, baseType: !1033, size: 64, align: 64, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1035)
!1035 = !{!1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1091, !1092, !1096, !1100, !1105, !1112, !1207, !1213, !1219, !1220, !1221, !1222, !1226}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1034, file: !897, line: 498, baseType: !946, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1034, file: !897, line: 504, baseType: !946, size: 64, align: 64, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1034, file: !897, line: 505, baseType: !946, size: 64, align: 64, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1034, file: !897, line: 506, baseType: !946, size: 64, align: 64, offset: 192)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1034, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1034, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1034, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1034, file: !897, line: 517, baseType: !939, size: 32, align: 32, offset: 352)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1034, file: !897, line: 523, baseType: !953, size: 64, align: 64, offset: 384)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1034, file: !897, line: 526, baseType: !963, size: 64, align: 64, offset: 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1034, file: !897, line: 535, baseType: !1033, size: 64, align: 64, offset: 512)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1034, file: !897, line: 539, baseType: !939, size: 32, align: 32, offset: 576)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1034, file: !897, line: 541, baseType: !1024, size: 64, align: 64, offset: 640)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1034, file: !897, line: 549, baseType: !1050, size: 64, align: 64, offset: 704)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!939, !1027, !1053}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1055)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1056)
!1056 = !{!1057, !1071, !1074, !1075, !1076, !1077, !1078, !1079, !1087, !1088, !1089, !1090}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1055, file: !4, line: 1451, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1060, line: 94, baseType: !1061)
!1060 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1060, line: 81, size: 192, align: 64, elements: !1062)
!1062 = !{!1063, !1067, !1070}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1061, file: !1060, line: 82, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1060, line: 73, baseType: !1066)
!1066 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1060, line: 73, flags: DIFlagFwdDecl)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1061, file: !1060, line: 89, baseType: !1068, size: 64, align: 64, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !930, line: 48, baseType: !1020)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1061, file: !1060, line: 93, baseType: !939, size: 32, align: 32, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1055, file: !4, line: 1461, baseType: !1072, size: 64, align: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !930, line: 40, baseType: !1073)
!1073 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1055, file: !4, line: 1467, baseType: !1072, size: 64, align: 64, offset: 128)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1055, file: !4, line: 1468, baseType: !1068, size: 64, align: 64, offset: 192)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1055, file: !4, line: 1469, baseType: !939, size: 32, align: 32, offset: 256)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1055, file: !4, line: 1470, baseType: !939, size: 32, align: 32, offset: 288)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1055, file: !4, line: 1474, baseType: !939, size: 32, align: 32, offset: 320)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1055, file: !4, line: 1479, baseType: !1080, size: 64, align: 64, offset: 384)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1083)
!1083 = !{!1084, !1085, !1086}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1082, file: !4, line: 1412, baseType: !1068, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1082, file: !4, line: 1413, baseType: !939, size: 32, align: 32, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1082, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1055, file: !4, line: 1480, baseType: !939, size: 32, align: 32, offset: 448)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1055, file: !4, line: 1486, baseType: !1072, size: 64, align: 64, offset: 512)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1055, file: !4, line: 1488, baseType: !1072, size: 64, align: 64, offset: 576)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1055, file: !4, line: 1497, baseType: !1072, size: 64, align: 64, offset: 640)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1034, file: !897, line: 550, baseType: !1024, size: 64, align: 64, offset: 768)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1034, file: !897, line: 554, baseType: !1093, size: 64, align: 64, offset: 832)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!939, !1027, !1053, !1053, !939}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1034, file: !897, line: 563, baseType: !1097, size: 64, align: 64, offset: 896)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!939, !3, !939}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1034, file: !897, line: 565, baseType: !1101, size: 64, align: 64, offset: 960)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{null, !1027, !939, !1104, !1104}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1034, file: !897, line: 570, baseType: !1106, size: 64, align: 64, offset: 1024)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!939, !1027, !939, !973, !1109}
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1110, line: 216, baseType: !1111)
!1110 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1111 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1034, file: !897, line: 581, baseType: !1113, size: 64, align: 64, offset: 1088)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!939, !1027, !939, !1116, !938}
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1119)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1120)
!1120 = !{!1121, !1125, !1127, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1161, !1163, !1164, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1119, file: !526, line: 282, baseType: !1122, size: 512, align: 64)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1068, size: 512, align: 64, elements: !1123)
!1123 = !{!1124}
!1124 = !DISubrange(count: 8)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1119, file: !526, line: 299, baseType: !1126, size: 256, align: 32, offset: 512)
!1126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 256, align: 32, elements: !1123)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1119, file: !526, line: 315, baseType: !1128, size: 64, align: 64, offset: 768)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1119, file: !526, line: 326, baseType: !939, size: 32, align: 32, offset: 832)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1119, file: !526, line: 326, baseType: !939, size: 32, align: 32, offset: 864)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1119, file: !526, line: 334, baseType: !939, size: 32, align: 32, offset: 896)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1119, file: !526, line: 341, baseType: !939, size: 32, align: 32, offset: 928)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1119, file: !526, line: 346, baseType: !939, size: 32, align: 32, offset: 960)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1119, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1119, file: !526, line: 356, baseType: !1136, size: 64, align: 32, offset: 1024)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1137, line: 61, baseType: !1138)
!1137 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1137, line: 58, size: 64, align: 32, elements: !1139)
!1139 = !{!1140, !1141}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1138, file: !1137, line: 59, baseType: !939, size: 32, align: 32)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1138, file: !1137, line: 60, baseType: !939, size: 32, align: 32, offset: 32)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1119, file: !526, line: 361, baseType: !1072, size: 64, align: 64, offset: 1088)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1119, file: !526, line: 369, baseType: !1072, size: 64, align: 64, offset: 1152)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1119, file: !526, line: 377, baseType: !1072, size: 64, align: 64, offset: 1216)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1119, file: !526, line: 382, baseType: !939, size: 32, align: 32, offset: 1280)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1119, file: !526, line: 386, baseType: !939, size: 32, align: 32, offset: 1312)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1119, file: !526, line: 391, baseType: !939, size: 32, align: 32, offset: 1344)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1119, file: !526, line: 396, baseType: !973, size: 64, align: 64, offset: 1408)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1119, file: !526, line: 403, baseType: !1150, size: 512, align: 64, offset: 1472)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1151, size: 512, align: 64, elements: !1123)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !930, line: 55, baseType: !1111)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1119, file: !526, line: 410, baseType: !939, size: 32, align: 32, offset: 1984)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1119, file: !526, line: 415, baseType: !939, size: 32, align: 32, offset: 2016)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1119, file: !526, line: 420, baseType: !939, size: 32, align: 32, offset: 2048)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1119, file: !526, line: 425, baseType: !939, size: 32, align: 32, offset: 2080)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1119, file: !526, line: 435, baseType: !1072, size: 64, align: 64, offset: 2112)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1119, file: !526, line: 440, baseType: !939, size: 32, align: 32, offset: 2176)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1119, file: !526, line: 445, baseType: !1151, size: 64, align: 64, offset: 2240)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1119, file: !526, line: 459, baseType: !1160, size: 512, align: 64, offset: 2304)
!1160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1058, size: 512, align: 64, elements: !1123)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1119, file: !526, line: 473, baseType: !1162, size: 64, align: 64, offset: 2816)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1119, file: !526, line: 477, baseType: !939, size: 32, align: 32, offset: 2880)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1119, file: !526, line: 479, baseType: !1165, size: 64, align: 64, offset: 2944)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1169)
!1169 = !{!1170, !1171, !1172, !1173, !1178}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1168, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1168, file: !526, line: 203, baseType: !1068, size: 64, align: 64, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1168, file: !526, line: 204, baseType: !939, size: 32, align: 32, offset: 128)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1168, file: !526, line: 205, baseType: !1174, size: 64, align: 64, offset: 192)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1176, line: 86, baseType: !1177)
!1176 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1177 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1176, line: 86, flags: DIFlagFwdDecl)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1168, file: !526, line: 206, baseType: !1058, size: 64, align: 64, offset: 256)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1119, file: !526, line: 480, baseType: !939, size: 32, align: 32, offset: 3008)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1119, file: !526, line: 505, baseType: !939, size: 32, align: 32, offset: 3040)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1119, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1119, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1119, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1119, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1119, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1119, file: !526, line: 532, baseType: !1072, size: 64, align: 64, offset: 3264)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1119, file: !526, line: 539, baseType: !1072, size: 64, align: 64, offset: 3328)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1119, file: !526, line: 547, baseType: !1072, size: 64, align: 64, offset: 3392)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1119, file: !526, line: 554, baseType: !1174, size: 64, align: 64, offset: 3456)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1119, file: !526, line: 563, baseType: !939, size: 32, align: 32, offset: 3520)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1119, file: !526, line: 572, baseType: !939, size: 32, align: 32, offset: 3552)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1119, file: !526, line: 581, baseType: !939, size: 32, align: 32, offset: 3584)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1119, file: !526, line: 588, baseType: !1194, size: 64, align: 64, offset: 3648)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !930, line: 36, baseType: !1196)
!1196 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1119, file: !526, line: 593, baseType: !939, size: 32, align: 32, offset: 3712)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1119, file: !526, line: 596, baseType: !939, size: 32, align: 32, offset: 3744)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1119, file: !526, line: 599, baseType: !1058, size: 64, align: 64, offset: 3776)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1119, file: !526, line: 605, baseType: !1058, size: 64, align: 64, offset: 3840)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1119, file: !526, line: 616, baseType: !1058, size: 64, align: 64, offset: 3904)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1119, file: !526, line: 626, baseType: !1109, size: 64, align: 64, offset: 3968)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1119, file: !526, line: 627, baseType: !1109, size: 64, align: 64, offset: 4032)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1119, file: !526, line: 628, baseType: !1109, size: 64, align: 64, offset: 4096)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1119, file: !526, line: 629, baseType: !1109, size: 64, align: 64, offset: 4160)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1119, file: !526, line: 645, baseType: !1058, size: 64, align: 64, offset: 4224)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1034, file: !897, line: 587, baseType: !1208, size: 64, align: 64, offset: 1152)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!939, !1027, !1211}
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1034, file: !897, line: 592, baseType: !1214, size: 64, align: 64, offset: 1216)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!939, !1027, !1217}
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1034, file: !897, line: 597, baseType: !1214, size: 64, align: 64, offset: 1280)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1034, file: !897, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1034, file: !897, line: 608, baseType: !1024, size: 64, align: 64, offset: 1408)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1034, file: !897, line: 617, baseType: !1223, size: 64, align: 64, offset: 1472)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{null, !1027}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1034, file: !897, line: 623, baseType: !1227, size: 64, align: 64, offset: 1536)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!939, !1027, !1230}
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1054)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1028, file: !897, line: 1365, baseType: !973, size: 64, align: 64, offset: 192)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1028, file: !897, line: 1379, baseType: !1234, size: 64, align: 64, offset: 256)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1236)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1237)
!1237 = !{!1238, !1239, !1240, !1241, !1242, !1243, !1244, !1248, !1249, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1265, !1266, !1270, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1288, !1289, !1290, !1291, !1295, !1296, !1297}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1236, file: !628, line: 174, baseType: !963, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1236, file: !628, line: 226, baseType: !1019, size: 64, align: 64, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1236, file: !628, line: 227, baseType: !939, size: 32, align: 32, offset: 128)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1236, file: !628, line: 228, baseType: !1019, size: 64, align: 64, offset: 192)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1236, file: !628, line: 229, baseType: !1019, size: 64, align: 64, offset: 256)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1236, file: !628, line: 233, baseType: !973, size: 64, align: 64, offset: 320)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1236, file: !628, line: 235, baseType: !1245, size: 64, align: 64, offset: 384)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!939, !973, !1068, !939}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1236, file: !628, line: 236, baseType: !1245, size: 64, align: 64, offset: 448)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1236, file: !628, line: 237, baseType: !1250, size: 64, align: 64, offset: 512)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!1072, !973, !1072, !939}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1236, file: !628, line: 238, baseType: !1072, size: 64, align: 64, offset: 576)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1236, file: !628, line: 239, baseType: !939, size: 32, align: 32, offset: 640)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1236, file: !628, line: 240, baseType: !939, size: 32, align: 32, offset: 672)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1236, file: !628, line: 241, baseType: !939, size: 32, align: 32, offset: 704)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1236, file: !628, line: 242, baseType: !1111, size: 64, align: 64, offset: 768)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1236, file: !628, line: 243, baseType: !1019, size: 64, align: 64, offset: 832)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1236, file: !628, line: 244, baseType: !1260, size: 64, align: 64, offset: 896)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!1111, !1111, !1263, !938}
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1069)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1236, file: !628, line: 245, baseType: !939, size: 32, align: 32, offset: 960)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1236, file: !628, line: 249, baseType: !1267, size: 64, align: 64, offset: 1024)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{!939, !973, !939}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1236, file: !628, line: 255, baseType: !1271, size: 64, align: 64, offset: 1088)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!1072, !973, !939, !1072, !939}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1236, file: !628, line: 260, baseType: !939, size: 32, align: 32, offset: 1152)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1236, file: !628, line: 266, baseType: !1072, size: 64, align: 64, offset: 1216)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1236, file: !628, line: 273, baseType: !939, size: 32, align: 32, offset: 1280)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1236, file: !628, line: 279, baseType: !1072, size: 64, align: 64, offset: 1344)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1236, file: !628, line: 285, baseType: !939, size: 32, align: 32, offset: 1408)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1236, file: !628, line: 291, baseType: !939, size: 32, align: 32, offset: 1440)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1236, file: !628, line: 298, baseType: !939, size: 32, align: 32, offset: 1472)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1236, file: !628, line: 304, baseType: !939, size: 32, align: 32, offset: 1504)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1236, file: !628, line: 309, baseType: !946, size: 64, align: 64, offset: 1536)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1236, file: !628, line: 314, baseType: !946, size: 64, align: 64, offset: 1600)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1236, file: !628, line: 319, baseType: !1285, size: 64, align: 64, offset: 1664)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!939, !973, !1068, !939, !627, !1072}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1236, file: !628, line: 326, baseType: !939, size: 32, align: 32, offset: 1728)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1236, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1236, file: !628, line: 332, baseType: !1072, size: 64, align: 64, offset: 1792)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1236, file: !628, line: 338, baseType: !1292, size: 64, align: 64, offset: 1856)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{!939, !973}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1236, file: !628, line: 340, baseType: !1072, size: 64, align: 64, offset: 1920)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1236, file: !628, line: 346, baseType: !1019, size: 64, align: 64, offset: 1984)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1236, file: !628, line: 351, baseType: !939, size: 32, align: 32, offset: 2048)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1028, file: !897, line: 1386, baseType: !939, size: 32, align: 32, offset: 320)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1028, file: !897, line: 1393, baseType: !938, size: 32, align: 32, offset: 352)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1028, file: !897, line: 1405, baseType: !1301, size: 64, align: 64, offset: 384)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1304)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1305)
!1305 = !{!1306, !1307, !1308, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1776, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1877, !1883, !1884, !1888, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1920, !1921, !1922, !1923, !1924, !1925}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1304, file: !897, line: 866, baseType: !939, size: 32, align: 32)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1304, file: !897, line: 872, baseType: !939, size: 32, align: 32, offset: 32)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1304, file: !897, line: 878, baseType: !1309, size: 64, align: 64, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1311)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1312)
!1312 = !{!1313, !1314, !1315, !1316, !1451, !1452, !1453, !1454, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1480, !1484, !1485, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1664, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1311, file: !4, line: 1561, baseType: !963, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1311, file: !4, line: 1562, baseType: !939, size: 32, align: 32, offset: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1311, file: !4, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1311, file: !4, line: 1565, baseType: !1317, size: 64, align: 64, offset: 128)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1319)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1320)
!1320 = !{!1321, !1322, !1323, !1324, !1325, !1326, !1329, !1332, !1335, !1338, !1341, !1342, !1343, !1351, !1352, !1353, !1355, !1359, !1365, !1370, !1374, !1375, !1416, !1423, !1427, !1428, !1432, !1436, !1440, !1444, !1445, !1446}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1319, file: !4, line: 3475, baseType: !946, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1319, file: !4, line: 3480, baseType: !946, size: 64, align: 64, offset: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1319, file: !4, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1319, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1319, file: !4, line: 3487, baseType: !939, size: 32, align: 32, offset: 192)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1319, file: !4, line: 3488, baseType: !1327, size: 64, align: 64, offset: 256)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1136)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1319, file: !4, line: 3489, baseType: !1330, size: 64, align: 64, offset: 320)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1319, file: !4, line: 3490, baseType: !1333, size: 64, align: 64, offset: 384)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1319, file: !4, line: 3491, baseType: !1336, size: 64, align: 64, offset: 448)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1319, file: !4, line: 3492, baseType: !1339, size: 64, align: 64, offset: 512)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1151)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1319, file: !4, line: 3493, baseType: !1069, size: 8, align: 8, offset: 576)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1319, file: !4, line: 3494, baseType: !963, size: 64, align: 64, offset: 640)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1319, file: !4, line: 3495, baseType: !1344, size: 64, align: 64, offset: 704)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1346)
!1346 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1347)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1348)
!1348 = !{!1349, !1350}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1347, file: !4, line: 3402, baseType: !939, size: 32, align: 32)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1347, file: !4, line: 3403, baseType: !946, size: 64, align: 64, offset: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1319, file: !4, line: 3507, baseType: !946, size: 64, align: 64, offset: 768)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1319, file: !4, line: 3516, baseType: !939, size: 32, align: 32, offset: 832)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1319, file: !4, line: 3517, baseType: !1354, size: 64, align: 64, offset: 896)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1319, file: !4, line: 3527, baseType: !1356, size: 64, align: 64, offset: 960)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!939, !1309}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1319, file: !4, line: 3535, baseType: !1360, size: 64, align: 64, offset: 1024)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DISubroutineType(types: !1362)
!1362 = !{!939, !1309, !1363}
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1310)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1319, file: !4, line: 3541, baseType: !1366, size: 64, align: 64, offset: 1088)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1368)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1369)
!1369 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1319, file: !4, line: 3549, baseType: !1371, size: 64, align: 64, offset: 1152)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DISubroutineType(types: !1373)
!1373 = !{null, !1354}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1319, file: !4, line: 3551, baseType: !1356, size: 64, align: 64, offset: 1216)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1319, file: !4, line: 3552, baseType: !1376, size: 64, align: 64, offset: 1280)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DISubroutineType(types: !1378)
!1378 = !{!939, !1309, !1068, !939, !1379}
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1381)
!1381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1382)
!1382 = !{!1383, !1384, !1385, !1386, !1387, !1415}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1381, file: !4, line: 3921, baseType: !929, size: 16, align: 16)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1381, file: !4, line: 3922, baseType: !937, size: 32, align: 32, offset: 32)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1381, file: !4, line: 3923, baseType: !937, size: 32, align: 32, offset: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1381, file: !4, line: 3924, baseType: !938, size: 32, align: 32, offset: 96)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1381, file: !4, line: 3925, baseType: !1388, size: 64, align: 64, offset: 128)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1391)
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1392)
!1392 = !{!1393, !1394, !1395, !1396, !1397, !1398, !1404, !1408, !1410, !1411, !1413, !1414}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1391, file: !4, line: 3886, baseType: !939, size: 32, align: 32)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1391, file: !4, line: 3887, baseType: !939, size: 32, align: 32, offset: 32)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1391, file: !4, line: 3888, baseType: !939, size: 32, align: 32, offset: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1391, file: !4, line: 3889, baseType: !939, size: 32, align: 32, offset: 96)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1391, file: !4, line: 3890, baseType: !939, size: 32, align: 32, offset: 128)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1391, file: !4, line: 3897, baseType: !1399, size: 768, align: 64, offset: 192)
!1399 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1400)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1401)
!1401 = !{!1402, !1403}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1400, file: !4, line: 3855, baseType: !1122, size: 512, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1400, file: !4, line: 3857, baseType: !1126, size: 256, align: 32, offset: 512)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1391, file: !4, line: 3903, baseType: !1405, size: 256, align: 64, offset: 960)
!1405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1068, size: 256, align: 64, elements: !1406)
!1406 = !{!1407}
!1407 = !DISubrange(count: 4)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1391, file: !4, line: 3904, baseType: !1409, size: 128, align: 32, offset: 1216)
!1409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 128, align: 32, elements: !1406)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1391, file: !4, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1391, file: !4, line: 3908, baseType: !1412, size: 64, align: 64, offset: 1408)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1391, file: !4, line: 3915, baseType: !1412, size: 64, align: 64, offset: 1472)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1391, file: !4, line: 3917, baseType: !939, size: 32, align: 32, offset: 1536)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1381, file: !4, line: 3926, baseType: !1072, size: 64, align: 64, offset: 192)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1319, file: !4, line: 3564, baseType: !1417, size: 64, align: 64, offset: 1344)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DISubroutineType(types: !1419)
!1419 = !{!939, !1309, !1053, !1420, !1422}
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1118)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1319, file: !4, line: 3566, baseType: !1424, size: 64, align: 64, offset: 1408)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DISubroutineType(types: !1426)
!1426 = !{!939, !1309, !973, !1422, !1053}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1319, file: !4, line: 3567, baseType: !1356, size: 64, align: 64, offset: 1472)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1319, file: !4, line: 3576, baseType: !1429, size: 64, align: 64, offset: 1536)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DISubroutineType(types: !1431)
!1431 = !{!939, !1309, !1420}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1319, file: !4, line: 3577, baseType: !1433, size: 64, align: 64, offset: 1600)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DISubroutineType(types: !1435)
!1435 = !{!939, !1309, !1053}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1319, file: !4, line: 3584, baseType: !1437, size: 64, align: 64, offset: 1664)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DISubroutineType(types: !1439)
!1439 = !{!939, !1309, !1117}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1319, file: !4, line: 3589, baseType: !1441, size: 64, align: 64, offset: 1728)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DISubroutineType(types: !1443)
!1443 = !{null, !1309}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1319, file: !4, line: 3594, baseType: !939, size: 32, align: 32, offset: 1792)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1319, file: !4, line: 3600, baseType: !946, size: 64, align: 64, offset: 1856)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1319, file: !4, line: 3609, baseType: !1447, size: 64, align: 64, offset: 1920)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1450)
!1450 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1311, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1311, file: !4, line: 1581, baseType: !938, size: 32, align: 32, offset: 224)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1311, file: !4, line: 1583, baseType: !973, size: 64, align: 64, offset: 256)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1311, file: !4, line: 1591, baseType: !1455, size: 64, align: 64, offset: 320)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1311, file: !4, line: 1598, baseType: !973, size: 64, align: 64, offset: 384)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1311, file: !4, line: 1606, baseType: !1072, size: 64, align: 64, offset: 448)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1311, file: !4, line: 1614, baseType: !939, size: 32, align: 32, offset: 512)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1311, file: !4, line: 1622, baseType: !939, size: 32, align: 32, offset: 544)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1311, file: !4, line: 1628, baseType: !939, size: 32, align: 32, offset: 576)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1311, file: !4, line: 1636, baseType: !939, size: 32, align: 32, offset: 608)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1311, file: !4, line: 1643, baseType: !939, size: 32, align: 32, offset: 640)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1311, file: !4, line: 1657, baseType: !1068, size: 64, align: 64, offset: 704)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1311, file: !4, line: 1658, baseType: !939, size: 32, align: 32, offset: 768)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1311, file: !4, line: 1679, baseType: !1136, size: 64, align: 32, offset: 800)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1311, file: !4, line: 1688, baseType: !939, size: 32, align: 32, offset: 864)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1311, file: !4, line: 1712, baseType: !939, size: 32, align: 32, offset: 896)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1311, file: !4, line: 1729, baseType: !939, size: 32, align: 32, offset: 928)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1311, file: !4, line: 1729, baseType: !939, size: 32, align: 32, offset: 960)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1311, file: !4, line: 1744, baseType: !939, size: 32, align: 32, offset: 992)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1311, file: !4, line: 1744, baseType: !939, size: 32, align: 32, offset: 1024)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1311, file: !4, line: 1751, baseType: !939, size: 32, align: 32, offset: 1056)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1311, file: !4, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1311, file: !4, line: 1791, baseType: !1476, size: 64, align: 64, offset: 1152)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DISubroutineType(types: !1478)
!1478 = !{null, !1479, !1420, !1422, !939, !939, !939}
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1311, file: !4, line: 1808, baseType: !1481, size: 64, align: 64, offset: 1216)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{!645, !1479, !1330}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1311, file: !4, line: 1816, baseType: !939, size: 32, align: 32, offset: 1280)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1311, file: !4, line: 1825, baseType: !1486, size: 32, align: 32, offset: 1312)
!1486 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1311, file: !4, line: 1830, baseType: !939, size: 32, align: 32, offset: 1344)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1311, file: !4, line: 1838, baseType: !1486, size: 32, align: 32, offset: 1376)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1311, file: !4, line: 1846, baseType: !939, size: 32, align: 32, offset: 1408)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1311, file: !4, line: 1851, baseType: !939, size: 32, align: 32, offset: 1440)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1311, file: !4, line: 1861, baseType: !1486, size: 32, align: 32, offset: 1472)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1311, file: !4, line: 1868, baseType: !1486, size: 32, align: 32, offset: 1504)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1311, file: !4, line: 1875, baseType: !1486, size: 32, align: 32, offset: 1536)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1311, file: !4, line: 1882, baseType: !1486, size: 32, align: 32, offset: 1568)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1311, file: !4, line: 1889, baseType: !1486, size: 32, align: 32, offset: 1600)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1311, file: !4, line: 1896, baseType: !1486, size: 32, align: 32, offset: 1632)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1311, file: !4, line: 1903, baseType: !1486, size: 32, align: 32, offset: 1664)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1311, file: !4, line: 1910, baseType: !939, size: 32, align: 32, offset: 1696)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1311, file: !4, line: 1915, baseType: !939, size: 32, align: 32, offset: 1728)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1311, file: !4, line: 1926, baseType: !1422, size: 64, align: 64, offset: 1792)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1311, file: !4, line: 1935, baseType: !1136, size: 64, align: 32, offset: 1856)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1311, file: !4, line: 1942, baseType: !939, size: 32, align: 32, offset: 1920)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1311, file: !4, line: 1948, baseType: !939, size: 32, align: 32, offset: 1952)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1311, file: !4, line: 1954, baseType: !939, size: 32, align: 32, offset: 1984)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1311, file: !4, line: 1960, baseType: !939, size: 32, align: 32, offset: 2016)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1311, file: !4, line: 1984, baseType: !939, size: 32, align: 32, offset: 2048)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1311, file: !4, line: 1991, baseType: !939, size: 32, align: 32, offset: 2080)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1311, file: !4, line: 1996, baseType: !939, size: 32, align: 32, offset: 2112)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1311, file: !4, line: 2004, baseType: !939, size: 32, align: 32, offset: 2144)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1311, file: !4, line: 2011, baseType: !939, size: 32, align: 32, offset: 2176)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1311, file: !4, line: 2018, baseType: !939, size: 32, align: 32, offset: 2208)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1311, file: !4, line: 2027, baseType: !939, size: 32, align: 32, offset: 2240)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1311, file: !4, line: 2034, baseType: !939, size: 32, align: 32, offset: 2272)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1311, file: !4, line: 2044, baseType: !939, size: 32, align: 32, offset: 2304)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1311, file: !4, line: 2054, baseType: !1516, size: 64, align: 64, offset: 2368)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1311, file: !4, line: 2061, baseType: !1516, size: 64, align: 64, offset: 2432)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1311, file: !4, line: 2066, baseType: !939, size: 32, align: 32, offset: 2496)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1311, file: !4, line: 2070, baseType: !939, size: 32, align: 32, offset: 2528)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1311, file: !4, line: 2078, baseType: !939, size: 32, align: 32, offset: 2560)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1311, file: !4, line: 2085, baseType: !939, size: 32, align: 32, offset: 2592)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1311, file: !4, line: 2092, baseType: !939, size: 32, align: 32, offset: 2624)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1311, file: !4, line: 2099, baseType: !939, size: 32, align: 32, offset: 2656)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1311, file: !4, line: 2106, baseType: !939, size: 32, align: 32, offset: 2688)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1311, file: !4, line: 2113, baseType: !939, size: 32, align: 32, offset: 2720)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1311, file: !4, line: 2120, baseType: !939, size: 32, align: 32, offset: 2752)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1311, file: !4, line: 2125, baseType: !939, size: 32, align: 32, offset: 2784)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1311, file: !4, line: 2133, baseType: !939, size: 32, align: 32, offset: 2816)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1311, file: !4, line: 2140, baseType: !939, size: 32, align: 32, offset: 2848)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1311, file: !4, line: 2145, baseType: !939, size: 32, align: 32, offset: 2880)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1311, file: !4, line: 2153, baseType: !939, size: 32, align: 32, offset: 2912)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1311, file: !4, line: 2158, baseType: !939, size: 32, align: 32, offset: 2944)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1311, file: !4, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1311, file: !4, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1311, file: !4, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1311, file: !4, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1311, file: !4, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1311, file: !4, line: 2203, baseType: !939, size: 32, align: 32, offset: 3136)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1311, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1311, file: !4, line: 2212, baseType: !939, size: 32, align: 32, offset: 3200)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1311, file: !4, line: 2213, baseType: !939, size: 32, align: 32, offset: 3232)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1311, file: !4, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1311, file: !4, line: 2232, baseType: !939, size: 32, align: 32, offset: 3296)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1311, file: !4, line: 2243, baseType: !939, size: 32, align: 32, offset: 3328)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1311, file: !4, line: 2249, baseType: !939, size: 32, align: 32, offset: 3360)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1311, file: !4, line: 2256, baseType: !939, size: 32, align: 32, offset: 3392)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1311, file: !4, line: 2263, baseType: !1151, size: 64, align: 64, offset: 3456)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1311, file: !4, line: 2270, baseType: !1151, size: 64, align: 64, offset: 3520)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1311, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1311, file: !4, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1311, file: !4, line: 2367, baseType: !1552, size: 64, align: 64, offset: 3648)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1553 = !DISubroutineType(types: !1554)
!1554 = !{!939, !1479, !1117, !939}
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1311, file: !4, line: 2383, baseType: !939, size: 32, align: 32, offset: 3712)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1311, file: !4, line: 2386, baseType: !1486, size: 32, align: 32, offset: 3744)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1311, file: !4, line: 2387, baseType: !1486, size: 32, align: 32, offset: 3776)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1311, file: !4, line: 2394, baseType: !939, size: 32, align: 32, offset: 3808)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1311, file: !4, line: 2401, baseType: !939, size: 32, align: 32, offset: 3840)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1311, file: !4, line: 2408, baseType: !939, size: 32, align: 32, offset: 3872)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1311, file: !4, line: 2415, baseType: !939, size: 32, align: 32, offset: 3904)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1311, file: !4, line: 2422, baseType: !939, size: 32, align: 32, offset: 3936)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1311, file: !4, line: 2423, baseType: !1564, size: 64, align: 64, offset: 3968)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1566)
!1566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1567)
!1567 = !{!1568, !1569, !1570, !1571}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1566, file: !4, line: 827, baseType: !939, size: 32, align: 32)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1566, file: !4, line: 828, baseType: !939, size: 32, align: 32, offset: 32)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1566, file: !4, line: 829, baseType: !939, size: 32, align: 32, offset: 64)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1566, file: !4, line: 830, baseType: !1486, size: 32, align: 32, offset: 96)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1311, file: !4, line: 2430, baseType: !1072, size: 64, align: 64, offset: 4032)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1311, file: !4, line: 2437, baseType: !1072, size: 64, align: 64, offset: 4096)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1311, file: !4, line: 2444, baseType: !1486, size: 32, align: 32, offset: 4160)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1311, file: !4, line: 2451, baseType: !1486, size: 32, align: 32, offset: 4192)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1311, file: !4, line: 2458, baseType: !939, size: 32, align: 32, offset: 4224)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1311, file: !4, line: 2469, baseType: !939, size: 32, align: 32, offset: 4256)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1311, file: !4, line: 2475, baseType: !939, size: 32, align: 32, offset: 4288)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1311, file: !4, line: 2481, baseType: !939, size: 32, align: 32, offset: 4320)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1311, file: !4, line: 2485, baseType: !939, size: 32, align: 32, offset: 4352)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1311, file: !4, line: 2489, baseType: !939, size: 32, align: 32, offset: 4384)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1311, file: !4, line: 2493, baseType: !939, size: 32, align: 32, offset: 4416)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1311, file: !4, line: 2501, baseType: !939, size: 32, align: 32, offset: 4448)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1311, file: !4, line: 2506, baseType: !939, size: 32, align: 32, offset: 4480)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1311, file: !4, line: 2510, baseType: !939, size: 32, align: 32, offset: 4512)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1311, file: !4, line: 2514, baseType: !1072, size: 64, align: 64, offset: 4544)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1311, file: !4, line: 2528, baseType: !1588, size: 64, align: 64, offset: 4608)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DISubroutineType(types: !1590)
!1590 = !{null, !1479, !973, !939, !939}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1311, file: !4, line: 2534, baseType: !939, size: 32, align: 32, offset: 4672)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1311, file: !4, line: 2545, baseType: !939, size: 32, align: 32, offset: 4704)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1311, file: !4, line: 2547, baseType: !939, size: 32, align: 32, offset: 4736)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1311, file: !4, line: 2549, baseType: !939, size: 32, align: 32, offset: 4768)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1311, file: !4, line: 2551, baseType: !939, size: 32, align: 32, offset: 4800)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1311, file: !4, line: 2553, baseType: !939, size: 32, align: 32, offset: 4832)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1311, file: !4, line: 2555, baseType: !939, size: 32, align: 32, offset: 4864)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1311, file: !4, line: 2557, baseType: !939, size: 32, align: 32, offset: 4896)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1311, file: !4, line: 2559, baseType: !939, size: 32, align: 32, offset: 4928)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1311, file: !4, line: 2563, baseType: !939, size: 32, align: 32, offset: 4960)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1311, file: !4, line: 2571, baseType: !1412, size: 64, align: 64, offset: 4992)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1311, file: !4, line: 2579, baseType: !1412, size: 64, align: 64, offset: 5056)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1311, file: !4, line: 2586, baseType: !939, size: 32, align: 32, offset: 5120)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1311, file: !4, line: 2615, baseType: !939, size: 32, align: 32, offset: 5152)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1311, file: !4, line: 2627, baseType: !939, size: 32, align: 32, offset: 5184)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1311, file: !4, line: 2637, baseType: !939, size: 32, align: 32, offset: 5216)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1311, file: !4, line: 2681, baseType: !939, size: 32, align: 32, offset: 5248)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1311, file: !4, line: 2709, baseType: !1072, size: 64, align: 64, offset: 5312)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1311, file: !4, line: 2716, baseType: !1610, size: 64, align: 64, offset: 5376)
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64, align: 64)
!1611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1612)
!1612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1613)
!1613 = !{!1614, !1615, !1616, !1617, !1618, !1619, !1620, !1624, !1628, !1629, !1630, !1631, !1637, !1638, !1639, !1640, !1641}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1612, file: !4, line: 3642, baseType: !946, size: 64, align: 64)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1612, file: !4, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1612, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1612, file: !4, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1612, file: !4, line: 3669, baseType: !939, size: 32, align: 32, offset: 160)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1612, file: !4, line: 3682, baseType: !1437, size: 64, align: 64, offset: 192)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1612, file: !4, line: 3698, baseType: !1621, size: 64, align: 64, offset: 256)
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1622, size: 64, align: 64)
!1622 = !DISubroutineType(types: !1623)
!1623 = !{!939, !1309, !1263, !937}
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1612, file: !4, line: 3712, baseType: !1625, size: 64, align: 64, offset: 320)
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64, align: 64)
!1626 = !DISubroutineType(types: !1627)
!1627 = !{!939, !1309, !939, !1263, !937}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1612, file: !4, line: 3726, baseType: !1621, size: 64, align: 64, offset: 384)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1612, file: !4, line: 3737, baseType: !1356, size: 64, align: 64, offset: 448)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1612, file: !4, line: 3746, baseType: !939, size: 32, align: 32, offset: 512)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1612, file: !4, line: 3757, baseType: !1632, size: 64, align: 64, offset: 576)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64, align: 64)
!1633 = !DISubroutineType(types: !1634)
!1634 = !{null, !1635}
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1612, file: !4, line: 3766, baseType: !1356, size: 64, align: 64, offset: 640)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1612, file: !4, line: 3774, baseType: !1356, size: 64, align: 64, offset: 704)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1612, file: !4, line: 3780, baseType: !939, size: 32, align: 32, offset: 768)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1612, file: !4, line: 3785, baseType: !939, size: 32, align: 32, offset: 800)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1612, file: !4, line: 3795, baseType: !1642, size: 64, align: 64, offset: 832)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{!939, !1309, !1058}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1311, file: !4, line: 2728, baseType: !973, size: 64, align: 64, offset: 5440)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1311, file: !4, line: 2735, baseType: !1150, size: 512, align: 64, offset: 5504)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1311, file: !4, line: 2742, baseType: !939, size: 32, align: 32, offset: 6016)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1311, file: !4, line: 2755, baseType: !939, size: 32, align: 32, offset: 6048)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1311, file: !4, line: 2776, baseType: !939, size: 32, align: 32, offset: 6080)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1311, file: !4, line: 2783, baseType: !939, size: 32, align: 32, offset: 6112)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1311, file: !4, line: 2791, baseType: !939, size: 32, align: 32, offset: 6144)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1311, file: !4, line: 2802, baseType: !1117, size: 64, align: 64, offset: 6208)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1311, file: !4, line: 2811, baseType: !939, size: 32, align: 32, offset: 6272)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1311, file: !4, line: 2821, baseType: !939, size: 32, align: 32, offset: 6304)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1311, file: !4, line: 2830, baseType: !939, size: 32, align: 32, offset: 6336)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1311, file: !4, line: 2840, baseType: !939, size: 32, align: 32, offset: 6368)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1311, file: !4, line: 2851, baseType: !1658, size: 64, align: 64, offset: 6400)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DISubroutineType(types: !1660)
!1660 = !{!939, !1479, !1661, !973, !1422, !939, !939}
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64, align: 64)
!1662 = !DISubroutineType(types: !1663)
!1663 = !{!939, !1479, !973}
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1311, file: !4, line: 2871, baseType: !1665, size: 64, align: 64, offset: 6464)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DISubroutineType(types: !1667)
!1667 = !{!939, !1479, !1668, !973, !1422, !939}
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DISubroutineType(types: !1670)
!1670 = !{!939, !1479, !973, !939, !939}
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1311, file: !4, line: 2878, baseType: !939, size: 32, align: 32, offset: 6528)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1311, file: !4, line: 2885, baseType: !939, size: 32, align: 32, offset: 6560)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1311, file: !4, line: 3005, baseType: !939, size: 32, align: 32, offset: 6592)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1311, file: !4, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1311, file: !4, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1311, file: !4, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1311, file: !4, line: 3037, baseType: !1068, size: 64, align: 64, offset: 6720)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1311, file: !4, line: 3038, baseType: !939, size: 32, align: 32, offset: 6784)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1311, file: !4, line: 3050, baseType: !1151, size: 64, align: 64, offset: 6848)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1311, file: !4, line: 3065, baseType: !939, size: 32, align: 32, offset: 6912)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1311, file: !4, line: 3083, baseType: !939, size: 32, align: 32, offset: 6944)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1311, file: !4, line: 3092, baseType: !1136, size: 64, align: 32, offset: 6976)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1311, file: !4, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1311, file: !4, line: 3106, baseType: !1136, size: 64, align: 32, offset: 7072)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1311, file: !4, line: 3113, baseType: !1686, size: 64, align: 64, offset: 7168)
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64, align: 64)
!1687 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1688)
!1688 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1689)
!1689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1690)
!1690 = !{!1691, !1692, !1693, !1694, !1695, !1696, !1699}
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1689, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1689, file: !4, line: 714, baseType: !636, size: 32, align: 32, offset: 32)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1689, file: !4, line: 720, baseType: !946, size: 64, align: 64, offset: 64)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1689, file: !4, line: 724, baseType: !946, size: 64, align: 64, offset: 128)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1689, file: !4, line: 728, baseType: !939, size: 32, align: 32, offset: 192)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1689, file: !4, line: 734, baseType: !1697, size: 64, align: 64, offset: 256)
!1697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1698, size: 64, align: 64)
!1698 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1689, file: !4, line: 739, baseType: !1700, size: 64, align: 64, offset: 320)
!1700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1701, size: 64, align: 64)
!1701 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1347)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1311, file: !4, line: 3129, baseType: !1072, size: 64, align: 64, offset: 7232)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1311, file: !4, line: 3130, baseType: !1072, size: 64, align: 64, offset: 7296)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1311, file: !4, line: 3131, baseType: !1072, size: 64, align: 64, offset: 7360)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1311, file: !4, line: 3132, baseType: !1072, size: 64, align: 64, offset: 7424)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1311, file: !4, line: 3139, baseType: !1412, size: 64, align: 64, offset: 7488)
