; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--cavsdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--cavsdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!903 = !DIEnumerator(name: "P_8X16", value: 4)
!904 = !DIEnumerator(name: "P_8X8", value: 5)
!905 = !DIEnumerator(name: "B_SKIP", value: 6)
!906 = !DIEnumerator(name: "B_DIRECT", value: 7)
!907 = !DIEnumerator(name: "B_FWD_16X16", value: 8)
!908 = !DIEnumerator(name: "B_BWD_16X16", value: 9)
!909 = !DIEnumerator(name: "B_SYM_16X16", value: 10)
!910 = !DIEnumerator(name: "B_8X8", value: 29)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cavs_intra_luma", file: !897, line: 83, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915, !916, !917, !918, !919, !920}
!913 = !DIEnumerator(name: "INTRA_L_VERT", value: 0)
!914 = !DIEnumerator(name: "INTRA_L_HORIZ", value: 1)
!915 = !DIEnumerator(name: "INTRA_L_LP", value: 2)
!916 = !DIEnumerator(name: "INTRA_L_DOWN_LEFT", value: 3)
!917 = !DIEnumerator(name: "INTRA_L_DOWN_RIGHT", value: 4)
!918 = !DIEnumerator(name: "INTRA_L_LP_LEFT", value: 5)
!919 = !DIEnumerator(name: "INTRA_L_LP_TOP", value: 6)
!920 = !DIEnumerator(name: "INTRA_L_DC_128", value: 7)
!921 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cavs_mv_loc", file: !897, line: 120, size: 32, align: 32, elements: !922)
!922 = !{!923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942}
!923 = !DIEnumerator(name: "MV_FWD_D3", value: 0)
!924 = !DIEnumerator(name: "MV_FWD_B2", value: 1)
!925 = !DIEnumerator(name: "MV_FWD_B3", value: 2)
!926 = !DIEnumerator(name: "MV_FWD_C2", value: 3)
!927 = !DIEnumerator(name: "MV_FWD_A1", value: 4)
!928 = !DIEnumerator(name: "MV_FWD_X0", value: 5)
!929 = !DIEnumerator(name: "MV_FWD_X1", value: 6)
!930 = !DIEnumerator(name: "MV_FWD_A3", value: 8)
!931 = !DIEnumerator(name: "MV_FWD_X2", value: 9)
!932 = !DIEnumerator(name: "MV_FWD_X3", value: 10)
!933 = !DIEnumerator(name: "MV_BWD_D3", value: 12)
!934 = !DIEnumerator(name: "MV_BWD_B2", value: 13)
!935 = !DIEnumerator(name: "MV_BWD_B3", value: 14)
!936 = !DIEnumerator(name: "MV_BWD_C2", value: 15)
!937 = !DIEnumerator(name: "MV_BWD_A1", value: 16)
!938 = !DIEnumerator(name: "MV_BWD_X0", value: 17)
!939 = !DIEnumerator(name: "MV_BWD_X1", value: 18)
!940 = !DIEnumerator(name: "MV_BWD_A3", value: 20)
!941 = !DIEnumerator(name: "MV_BWD_X2", value: 21)
!942 = !DIEnumerator(name: "MV_BWD_X3", value: 22)
!943 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cavs_block", file: !897, line: 113, size: 32, align: 32, elements: !944)
!944 = !{!945, !946, !947, !948}
!945 = !DIEnumerator(name: "BLK_16X16", value: 0)
!946 = !DIEnumerator(name: "BLK_16X8", value: 1)
!947 = !DIEnumerator(name: "BLK_8X16", value: 2)
!948 = !DIEnumerator(name: "BLK_8X8", value: 3)
!949 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cavs_mv_pred", file: !897, line: 104, size: 32, align: 32, elements: !950)
!950 = !{!951, !952, !953, !954, !955, !956}
!951 = !DIEnumerator(name: "MV_PRED_MEDIAN", value: 0)
!952 = !DIEnumerator(name: "MV_PRED_LEFT", value: 1)
!953 = !DIEnumerator(name: "MV_PRED_TOP", value: 2)
!954 = !DIEnumerator(name: "MV_PRED_TOPRIGHT", value: 3)
!955 = !DIEnumerator(name: "MV_PRED_PSKIP", value: 4)
!956 = !DIEnumerator(name: "MV_PRED_BSKIP", value: 5)
!957 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cavs_sub_mb", file: !897, line: 76, size: 32, align: 32, elements: !958)
!958 = !{!959, !960, !961, !962}
!959 = !DIEnumerator(name: "B_SUB_DIRECT", value: 0)
!960 = !DIEnumerator(name: "B_SUB_FWD", value: 1)
!961 = !DIEnumerator(name: "B_SUB_BWD", value: 2)
!962 = !DIEnumerator(name: "B_SUB_SYM", value: 3)
!963 = !{!964, !965, !966, !974, !972, !976}
!964 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!965 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !969, line: 221, size: 32, align: 8, elements: !970)
!969 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!970 = !{!971}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !968, file: !969, line: 221, baseType: !972, size: 32, align: 32)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !973, line: 51, baseType: !965)
!973 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !973, line: 48, baseType: !975)
!975 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!977 = !{!978, !1707, !1709, !1714, !1718, !1720, !1739, !1743, !1744}
!978 = distinct !DIGlobalVariable(name: "ff_cavs_decoder", scope: !0, file: !979, line: 1288, type: !980, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_cavs_decoder)
!979 = !DIFile(filename: "libavcodec/cavsdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !982)
!982 = !{!983, !987, !988, !989, !990, !991, !1000, !1003, !1006, !1009, !1014, !1015, !1056, !1064, !1065, !1066, !1068, !1622, !1628, !1636, !1640, !1641, !1678, !1682, !1686, !1687, !1691, !1695, !1696, !1700, !1701, !1702}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !981, file: !14, line: 3475, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !981, file: !14, line: 3480, baseType: !984, size: 64, align: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !981, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !981, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !981, file: !14, line: 3487, baseType: !964, size: 32, align: 32, offset: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !981, file: !14, line: 3488, baseType: !992, size: 64, align: 64, offset: 256)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !995, line: 61, baseType: !996)
!995 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !995, line: 58, size: 64, align: 32, elements: !997)
!997 = !{!998, !999}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !996, file: !995, line: 59, baseType: !964, size: 32, align: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !996, file: !995, line: 60, baseType: !964, size: 32, align: 32, offset: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !981, file: !14, line: 3489, baseType: !1001, size: 64, align: 64, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !981, file: !14, line: 3490, baseType: !1004, size: 64, align: 64, offset: 384)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !981, file: !14, line: 3491, baseType: !1007, size: 64, align: 64, offset: 448)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !981, file: !14, line: 3492, baseType: !1010, size: 64, align: 64, offset: 512)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !973, line: 55, baseType: !1013)
!1013 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !981, file: !14, line: 3493, baseType: !974, size: 8, align: 8, offset: 576)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !981, file: !14, line: 3494, baseType: !1016, size: 64, align: 64, offset: 640)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !1020)
!1020 = !{!1021, !1022, !1026, !1030, !1031, !1032, !1033, !1037, !1043, !1045, !1049}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1019, file: !691, line: 72, baseType: !984, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1019, file: !691, line: 78, baseType: !1023, size: 64, align: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!984, !976}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1019, file: !691, line: 85, baseType: !1027, size: 64, align: 64, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1029 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1019, file: !691, line: 93, baseType: !964, size: 32, align: 32, offset: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1019, file: !691, line: 99, baseType: !964, size: 32, align: 32, offset: 224)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1019, file: !691, line: 108, baseType: !964, size: 32, align: 32, offset: 256)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1019, file: !691, line: 113, baseType: !1034, size: 64, align: 64, offset: 320)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!976, !976, !976}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1019, file: !691, line: 123, baseType: !1038, size: 64, align: 64, offset: 384)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!1041, !1041}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1019, file: !691, line: 130, baseType: !1044, size: 32, align: 32, offset: 448)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1019, file: !691, line: 136, baseType: !1046, size: 64, align: 64, offset: 512)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!1044, !976}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1019, file: !691, line: 142, baseType: !1050, size: 64, align: 64, offset: 576)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!964, !1053, !976, !984, !964}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !981, file: !14, line: 3495, baseType: !1057, size: 64, align: 64, offset: 704)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1059)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1061)
!1061 = !{!1062, !1063}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1060, file: !14, line: 3402, baseType: !964, size: 32, align: 32)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1060, file: !14, line: 3403, baseType: !984, size: 64, align: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !981, file: !14, line: 3507, baseType: !984, size: 64, align: 64, offset: 768)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !981, file: !14, line: 3516, baseType: !964, size: 32, align: 32, offset: 832)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !981, file: !14, line: 3517, baseType: !1067, size: 64, align: 64, offset: 896)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !981, file: !14, line: 3527, baseType: !1069, size: 64, align: 64, offset: 960)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!964, !1072}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1074)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1075)
!1075 = !{!1076, !1077, !1078, !1079, !1082, !1083, !1084, !1085, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1368, !1372, !1373, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1560, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1074, file: !14, line: 1561, baseType: !1016, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1074, file: !14, line: 1562, baseType: !964, size: 32, align: 32, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1074, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1074, file: !14, line: 1565, baseType: !1080, size: 64, align: 64, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1074, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1074, file: !14, line: 1581, baseType: !965, size: 32, align: 32, offset: 224)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1074, file: !14, line: 1583, baseType: !976, size: 64, align: 64, offset: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1074, file: !14, line: 1591, baseType: !1086, size: 64, align: 64, offset: 320)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1088, line: 129, size: 1664, align: 64, elements: !1089)
!1088 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1089 = !{!1090, !1091, !1092, !1093, !1194, !1215, !1216, !1245, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1087, file: !1088, line: 136, baseType: !964, size: 32, align: 32)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1087, file: !1088, line: 151, baseType: !964, size: 32, align: 32, offset: 32)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1087, file: !1088, line: 157, baseType: !964, size: 32, align: 32, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1087, file: !1088, line: 159, baseType: !1094, size: 64, align: 64, offset: 128)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1096)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1097)
!1097 = !{!1098, !1103, !1105, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1146, !1148, !1149, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1182, !1183, !1184, !1185, !1186, !1187, !1190, !1191, !1192, !1193}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1096, file: !722, line: 282, baseType: !1099, size: 512, align: 64)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1100, size: 512, align: 64, elements: !1101)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!1101 = !{!1102}
!1102 = !DISubrange(count: 8)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1096, file: !722, line: 299, baseType: !1104, size: 256, align: 32, offset: 512)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 256, align: 32, elements: !1101)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1096, file: !722, line: 315, baseType: !1106, size: 64, align: 64, offset: 768)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1096, file: !722, line: 326, baseType: !964, size: 32, align: 32, offset: 832)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1096, file: !722, line: 326, baseType: !964, size: 32, align: 32, offset: 864)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1096, file: !722, line: 334, baseType: !964, size: 32, align: 32, offset: 896)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1096, file: !722, line: 341, baseType: !964, size: 32, align: 32, offset: 928)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1096, file: !722, line: 346, baseType: !964, size: 32, align: 32, offset: 960)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1096, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1096, file: !722, line: 356, baseType: !994, size: 64, align: 32, offset: 1024)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1096, file: !722, line: 361, baseType: !1115, size: 64, align: 64, offset: 1088)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1116, line: 197, baseType: !1117)
!1116 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1117 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1096, file: !722, line: 369, baseType: !1115, size: 64, align: 64, offset: 1152)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1096, file: !722, line: 377, baseType: !1115, size: 64, align: 64, offset: 1216)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1096, file: !722, line: 382, baseType: !964, size: 32, align: 32, offset: 1280)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1096, file: !722, line: 386, baseType: !964, size: 32, align: 32, offset: 1312)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1096, file: !722, line: 391, baseType: !964, size: 32, align: 32, offset: 1344)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1096, file: !722, line: 396, baseType: !976, size: 64, align: 64, offset: 1408)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1096, file: !722, line: 403, baseType: !1125, size: 512, align: 64, offset: 1472)
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 512, align: 64, elements: !1101)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1096, file: !722, line: 410, baseType: !964, size: 32, align: 32, offset: 1984)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1096, file: !722, line: 415, baseType: !964, size: 32, align: 32, offset: 2016)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1096, file: !722, line: 420, baseType: !964, size: 32, align: 32, offset: 2048)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1096, file: !722, line: 425, baseType: !964, size: 32, align: 32, offset: 2080)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1096, file: !722, line: 435, baseType: !1115, size: 64, align: 64, offset: 2112)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1096, file: !722, line: 440, baseType: !964, size: 32, align: 32, offset: 2176)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1096, file: !722, line: 445, baseType: !1012, size: 64, align: 64, offset: 2240)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1096, file: !722, line: 459, baseType: !1134, size: 512, align: 64, offset: 2304)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1135, size: 512, align: 64, elements: !1101)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1137, line: 94, baseType: !1138)
!1137 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1137, line: 81, size: 192, align: 64, elements: !1139)
!1139 = !{!1140, !1144, !1145}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1138, file: !1137, line: 82, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1137, line: 73, baseType: !1143)
!1143 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1137, line: 73, flags: DIFlagFwdDecl)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1138, file: !1137, line: 89, baseType: !1100, size: 64, align: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1138, file: !1137, line: 93, baseType: !964, size: 32, align: 32, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1096, file: !722, line: 473, baseType: !1147, size: 64, align: 64, offset: 2816)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1096, file: !722, line: 477, baseType: !964, size: 32, align: 32, offset: 2880)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1096, file: !722, line: 479, baseType: !1150, size: 64, align: 64, offset: 2944)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1154)
!1154 = !{!1155, !1156, !1157, !1158, !1163}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1153, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1153, file: !722, line: 203, baseType: !1100, size: 64, align: 64, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1153, file: !722, line: 204, baseType: !964, size: 32, align: 32, offset: 128)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1153, file: !722, line: 205, baseType: !1159, size: 64, align: 64, offset: 192)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1161, line: 86, baseType: !1162)
!1161 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1162 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1161, line: 86, flags: DIFlagFwdDecl)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1153, file: !722, line: 206, baseType: !1135, size: 64, align: 64, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1096, file: !722, line: 480, baseType: !964, size: 32, align: 32, offset: 3008)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1096, file: !722, line: 505, baseType: !964, size: 32, align: 32, offset: 3040)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1096, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1096, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1096, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1096, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1096, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1096, file: !722, line: 532, baseType: !1115, size: 64, align: 64, offset: 3264)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1096, file: !722, line: 539, baseType: !1115, size: 64, align: 64, offset: 3328)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1096, file: !722, line: 547, baseType: !1115, size: 64, align: 64, offset: 3392)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1096, file: !722, line: 554, baseType: !1159, size: 64, align: 64, offset: 3456)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1096, file: !722, line: 563, baseType: !964, size: 32, align: 32, offset: 3520)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1096, file: !722, line: 572, baseType: !964, size: 32, align: 32, offset: 3552)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1096, file: !722, line: 581, baseType: !964, size: 32, align: 32, offset: 3584)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1096, file: !722, line: 588, baseType: !1179, size: 64, align: 64, offset: 3648)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1116, line: 194, baseType: !1181)
!1181 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1096, file: !722, line: 593, baseType: !964, size: 32, align: 32, offset: 3712)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1096, file: !722, line: 596, baseType: !964, size: 32, align: 32, offset: 3744)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1096, file: !722, line: 599, baseType: !1135, size: 64, align: 64, offset: 3776)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1096, file: !722, line: 605, baseType: !1135, size: 64, align: 64, offset: 3840)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1096, file: !722, line: 616, baseType: !1135, size: 64, align: 64, offset: 3904)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1096, file: !722, line: 626, baseType: !1188, size: 64, align: 64, offset: 3968)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1189, line: 216, baseType: !1013)
!1189 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1096, file: !722, line: 627, baseType: !1188, size: 64, align: 64, offset: 4032)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1096, file: !722, line: 628, baseType: !1188, size: 64, align: 64, offset: 4096)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1096, file: !722, line: 629, baseType: !1188, size: 64, align: 64, offset: 4160)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1096, file: !722, line: 645, baseType: !1135, size: 64, align: 64, offset: 4224)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1087, file: !1088, line: 161, baseType: !1195, size: 64, align: 64, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1088, line: 117, baseType: !1197)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1088, line: 100, size: 832, align: 64, elements: !1198)
!1198 = !{!1199, !1206, !1207, !1208, !1209, !1210, !1212, !1213, !1214}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1197, file: !1088, line: 105, baseType: !1200, size: 256, align: 64)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1201, size: 256, align: 64, elements: !1204)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1137, line: 238, baseType: !1203)
!1203 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1137, line: 238, flags: DIFlagFwdDecl)
!1204 = !{!1205}
!1205 = !DISubrange(count: 4)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1197, file: !1088, line: 110, baseType: !964, size: 32, align: 32, offset: 256)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1197, file: !1088, line: 111, baseType: !964, size: 32, align: 32, offset: 288)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1197, file: !1088, line: 111, baseType: !964, size: 32, align: 32, offset: 320)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1197, file: !1088, line: 112, baseType: !1104, size: 256, align: 32, offset: 352)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1197, file: !1088, line: 113, baseType: !1211, size: 128, align: 32, offset: 608)
!1211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 128, align: 32, elements: !1204)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1197, file: !1088, line: 114, baseType: !964, size: 32, align: 32, offset: 736)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1197, file: !1088, line: 115, baseType: !964, size: 32, align: 32, offset: 768)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1197, file: !1088, line: 116, baseType: !964, size: 32, align: 32, offset: 800)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1087, file: !1088, line: 163, baseType: !976, size: 64, align: 64, offset: 256)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1087, file: !1088, line: 165, baseType: !1217, size: 128, align: 64, offset: 320)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1088, line: 122, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1088, line: 119, size: 128, align: 64, elements: !1219)
!1219 = !{!1220, !1244}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1218, file: !1088, line: 120, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1224)
!1224 = !{!1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1240, !1241, !1242, !1243}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1223, file: !14, line: 1451, baseType: !1135, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1223, file: !14, line: 1461, baseType: !1115, size: 64, align: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1223, file: !14, line: 1467, baseType: !1115, size: 64, align: 64, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1223, file: !14, line: 1468, baseType: !1100, size: 64, align: 64, offset: 192)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1223, file: !14, line: 1469, baseType: !964, size: 32, align: 32, offset: 256)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1223, file: !14, line: 1470, baseType: !964, size: 32, align: 32, offset: 288)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1223, file: !14, line: 1474, baseType: !964, size: 32, align: 32, offset: 320)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1223, file: !14, line: 1479, baseType: !1233, size: 64, align: 64, offset: 384)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1236)
!1236 = !{!1237, !1238, !1239}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1235, file: !14, line: 1412, baseType: !1100, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1235, file: !14, line: 1413, baseType: !964, size: 32, align: 32, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1235, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1223, file: !14, line: 1480, baseType: !964, size: 32, align: 32, offset: 448)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1223, file: !14, line: 1486, baseType: !1115, size: 64, align: 64, offset: 512)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1223, file: !14, line: 1488, baseType: !1115, size: 64, align: 64, offset: 576)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1223, file: !14, line: 1497, baseType: !1115, size: 64, align: 64, offset: 640)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1218, file: !1088, line: 121, baseType: !1094, size: 64, align: 64, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1087, file: !1088, line: 166, baseType: !1246, size: 128, align: 64, offset: 448)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1088, line: 127, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1088, line: 124, size: 128, align: 64, elements: !1248)
!1248 = !{!1249, !1322}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1247, file: !1088, line: 125, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1253)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1254)
!1254 = !{!1255, !1256, !1280, !1284, !1285, !1319, !1320, !1321}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1253, file: !14, line: 5751, baseType: !1016, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1253, file: !14, line: 5756, baseType: !1257, size: 64, align: 64, offset: 64)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1259)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1260)
!1260 = !{!1261, !1262, !1265, !1266, !1267, !1271, !1275, !1279}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1259, file: !14, line: 5797, baseType: !984, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1259, file: !14, line: 5804, baseType: !1263, size: 64, align: 64, offset: 64)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1259, file: !14, line: 5815, baseType: !1016, size: 64, align: 64, offset: 128)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1259, file: !14, line: 5825, baseType: !964, size: 32, align: 32, offset: 192)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1259, file: !14, line: 5826, baseType: !1268, size: 64, align: 64, offset: 256)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!964, !1251}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1259, file: !14, line: 5827, baseType: !1272, size: 64, align: 64, offset: 320)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{!964, !1251, !1221}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1259, file: !14, line: 5828, baseType: !1276, size: 64, align: 64, offset: 384)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{null, !1251}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1259, file: !14, line: 5829, baseType: !1276, size: 64, align: 64, offset: 448)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1253, file: !14, line: 5762, baseType: !1281, size: 64, align: 64, offset: 128)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1283)
!1283 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1253, file: !14, line: 5768, baseType: !976, size: 64, align: 64, offset: 192)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1253, file: !14, line: 5775, baseType: !1286, size: 64, align: 64, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1288)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1289)
!1289 = !{!1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1288, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1288, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1288, file: !14, line: 3948, baseType: !972, size: 32, align: 32, offset: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1288, file: !14, line: 3958, baseType: !1100, size: 64, align: 64, offset: 128)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1288, file: !14, line: 3962, baseType: !964, size: 32, align: 32, offset: 192)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1288, file: !14, line: 3968, baseType: !964, size: 32, align: 32, offset: 224)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1288, file: !14, line: 3973, baseType: !1115, size: 64, align: 64, offset: 256)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1288, file: !14, line: 3986, baseType: !964, size: 32, align: 32, offset: 320)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1288, file: !14, line: 3999, baseType: !964, size: 32, align: 32, offset: 352)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1288, file: !14, line: 4004, baseType: !964, size: 32, align: 32, offset: 384)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1288, file: !14, line: 4005, baseType: !964, size: 32, align: 32, offset: 416)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1288, file: !14, line: 4010, baseType: !964, size: 32, align: 32, offset: 448)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1288, file: !14, line: 4011, baseType: !964, size: 32, align: 32, offset: 480)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1288, file: !14, line: 4020, baseType: !994, size: 64, align: 32, offset: 512)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1288, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1288, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1288, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1288, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1288, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1288, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1288, file: !14, line: 4039, baseType: !964, size: 32, align: 32, offset: 768)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1288, file: !14, line: 4046, baseType: !1012, size: 64, align: 64, offset: 832)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1288, file: !14, line: 4050, baseType: !964, size: 32, align: 32, offset: 896)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1288, file: !14, line: 4054, baseType: !964, size: 32, align: 32, offset: 928)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1288, file: !14, line: 4061, baseType: !964, size: 32, align: 32, offset: 960)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1288, file: !14, line: 4065, baseType: !964, size: 32, align: 32, offset: 992)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1288, file: !14, line: 4073, baseType: !964, size: 32, align: 32, offset: 1024)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1288, file: !14, line: 4080, baseType: !964, size: 32, align: 32, offset: 1056)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1288, file: !14, line: 4084, baseType: !964, size: 32, align: 32, offset: 1088)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1253, file: !14, line: 5781, baseType: !1286, size: 64, align: 64, offset: 320)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1253, file: !14, line: 5787, baseType: !994, size: 64, align: 32, offset: 384)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1253, file: !14, line: 5793, baseType: !994, size: 64, align: 32, offset: 448)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1247, file: !1088, line: 126, baseType: !964, size: 32, align: 32, offset: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1087, file: !1088, line: 172, baseType: !1221, size: 64, align: 64, offset: 576)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1087, file: !1088, line: 177, baseType: !1100, size: 64, align: 64, offset: 640)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1087, file: !1088, line: 178, baseType: !965, size: 32, align: 32, offset: 704)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1087, file: !1088, line: 180, baseType: !976, size: 64, align: 64, offset: 768)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1087, file: !1088, line: 185, baseType: !964, size: 32, align: 32, offset: 832)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1087, file: !1088, line: 190, baseType: !976, size: 64, align: 64, offset: 896)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1087, file: !1088, line: 195, baseType: !964, size: 32, align: 32, offset: 960)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1087, file: !1088, line: 200, baseType: !1221, size: 64, align: 64, offset: 1024)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1087, file: !1088, line: 201, baseType: !964, size: 32, align: 32, offset: 1088)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1087, file: !1088, line: 202, baseType: !1094, size: 64, align: 64, offset: 1152)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1087, file: !1088, line: 203, baseType: !964, size: 32, align: 32, offset: 1216)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1087, file: !1088, line: 205, baseType: !964, size: 32, align: 32, offset: 1248)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1087, file: !1088, line: 206, baseType: !964, size: 32, align: 32, offset: 1280)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1087, file: !1088, line: 209, baseType: !1188, size: 64, align: 64, offset: 1344)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1087, file: !1088, line: 212, baseType: !1188, size: 64, align: 64, offset: 1408)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1087, file: !1088, line: 213, baseType: !1094, size: 64, align: 64, offset: 1472)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1087, file: !1088, line: 215, baseType: !964, size: 32, align: 32, offset: 1536)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1087, file: !1088, line: 217, baseType: !964, size: 32, align: 32, offset: 1568)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1087, file: !1088, line: 220, baseType: !964, size: 32, align: 32, offset: 1600)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1074, file: !14, line: 1598, baseType: !976, size: 64, align: 64, offset: 384)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1074, file: !14, line: 1606, baseType: !1115, size: 64, align: 64, offset: 448)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1074, file: !14, line: 1614, baseType: !964, size: 32, align: 32, offset: 512)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1074, file: !14, line: 1622, baseType: !964, size: 32, align: 32, offset: 544)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1074, file: !14, line: 1628, baseType: !964, size: 32, align: 32, offset: 576)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1074, file: !14, line: 1636, baseType: !964, size: 32, align: 32, offset: 608)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1074, file: !14, line: 1643, baseType: !964, size: 32, align: 32, offset: 640)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1074, file: !14, line: 1657, baseType: !1100, size: 64, align: 64, offset: 704)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1074, file: !14, line: 1658, baseType: !964, size: 32, align: 32, offset: 768)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1074, file: !14, line: 1679, baseType: !994, size: 64, align: 32, offset: 800)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1074, file: !14, line: 1688, baseType: !964, size: 32, align: 32, offset: 864)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1074, file: !14, line: 1712, baseType: !964, size: 32, align: 32, offset: 896)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1074, file: !14, line: 1729, baseType: !964, size: 32, align: 32, offset: 928)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1074, file: !14, line: 1729, baseType: !964, size: 32, align: 32, offset: 960)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1074, file: !14, line: 1744, baseType: !964, size: 32, align: 32, offset: 992)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1074, file: !14, line: 1744, baseType: !964, size: 32, align: 32, offset: 1024)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1074, file: !14, line: 1751, baseType: !964, size: 32, align: 32, offset: 1056)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1074, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1074, file: !14, line: 1791, baseType: !1361, size: 64, align: 64, offset: 1152)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DISubroutineType(types: !1363)
!1363 = !{null, !1364, !1365, !1367, !964, !964, !964}
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1095)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1074, file: !14, line: 1808, baseType: !1369, size: 64, align: 64, offset: 1216)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DISubroutineType(types: !1371)
!1371 = !{!473, !1364, !1001}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1074, file: !14, line: 1816, baseType: !964, size: 32, align: 32, offset: 1280)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1074, file: !14, line: 1825, baseType: !1374, size: 32, align: 32, offset: 1312)
!1374 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1074, file: !14, line: 1830, baseType: !964, size: 32, align: 32, offset: 1344)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1074, file: !14, line: 1838, baseType: !1374, size: 32, align: 32, offset: 1376)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1074, file: !14, line: 1846, baseType: !964, size: 32, align: 32, offset: 1408)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1074, file: !14, line: 1851, baseType: !964, size: 32, align: 32, offset: 1440)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1074, file: !14, line: 1861, baseType: !1374, size: 32, align: 32, offset: 1472)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1074, file: !14, line: 1868, baseType: !1374, size: 32, align: 32, offset: 1504)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1074, file: !14, line: 1875, baseType: !1374, size: 32, align: 32, offset: 1536)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1074, file: !14, line: 1882, baseType: !1374, size: 32, align: 32, offset: 1568)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1074, file: !14, line: 1889, baseType: !1374, size: 32, align: 32, offset: 1600)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1074, file: !14, line: 1896, baseType: !1374, size: 32, align: 32, offset: 1632)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1074, file: !14, line: 1903, baseType: !1374, size: 32, align: 32, offset: 1664)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1074, file: !14, line: 1910, baseType: !964, size: 32, align: 32, offset: 1696)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1074, file: !14, line: 1915, baseType: !964, size: 32, align: 32, offset: 1728)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1074, file: !14, line: 1926, baseType: !1367, size: 64, align: 64, offset: 1792)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1074, file: !14, line: 1935, baseType: !994, size: 64, align: 32, offset: 1856)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1074, file: !14, line: 1942, baseType: !964, size: 32, align: 32, offset: 1920)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1074, file: !14, line: 1948, baseType: !964, size: 32, align: 32, offset: 1952)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1074, file: !14, line: 1954, baseType: !964, size: 32, align: 32, offset: 1984)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1074, file: !14, line: 1960, baseType: !964, size: 32, align: 32, offset: 2016)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1074, file: !14, line: 1984, baseType: !964, size: 32, align: 32, offset: 2048)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1074, file: !14, line: 1991, baseType: !964, size: 32, align: 32, offset: 2080)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1074, file: !14, line: 1996, baseType: !964, size: 32, align: 32, offset: 2112)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1074, file: !14, line: 2004, baseType: !964, size: 32, align: 32, offset: 2144)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1074, file: !14, line: 2011, baseType: !964, size: 32, align: 32, offset: 2176)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1074, file: !14, line: 2018, baseType: !964, size: 32, align: 32, offset: 2208)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1074, file: !14, line: 2027, baseType: !964, size: 32, align: 32, offset: 2240)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1074, file: !14, line: 2034, baseType: !964, size: 32, align: 32, offset: 2272)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1074, file: !14, line: 2044, baseType: !964, size: 32, align: 32, offset: 2304)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1074, file: !14, line: 2054, baseType: !1404, size: 64, align: 64, offset: 2368)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !973, line: 49, baseType: !1406)
!1406 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1074, file: !14, line: 2061, baseType: !1404, size: 64, align: 64, offset: 2432)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1074, file: !14, line: 2066, baseType: !964, size: 32, align: 32, offset: 2496)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1074, file: !14, line: 2070, baseType: !964, size: 32, align: 32, offset: 2528)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1074, file: !14, line: 2078, baseType: !964, size: 32, align: 32, offset: 2560)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1074, file: !14, line: 2085, baseType: !964, size: 32, align: 32, offset: 2592)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1074, file: !14, line: 2092, baseType: !964, size: 32, align: 32, offset: 2624)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1074, file: !14, line: 2099, baseType: !964, size: 32, align: 32, offset: 2656)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1074, file: !14, line: 2106, baseType: !964, size: 32, align: 32, offset: 2688)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1074, file: !14, line: 2113, baseType: !964, size: 32, align: 32, offset: 2720)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1074, file: !14, line: 2120, baseType: !964, size: 32, align: 32, offset: 2752)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1074, file: !14, line: 2125, baseType: !964, size: 32, align: 32, offset: 2784)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1074, file: !14, line: 2133, baseType: !964, size: 32, align: 32, offset: 2816)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1074, file: !14, line: 2140, baseType: !964, size: 32, align: 32, offset: 2848)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1074, file: !14, line: 2145, baseType: !964, size: 32, align: 32, offset: 2880)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1074, file: !14, line: 2153, baseType: !964, size: 32, align: 32, offset: 2912)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1074, file: !14, line: 2158, baseType: !964, size: 32, align: 32, offset: 2944)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1074, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1074, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1074, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1074, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1074, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1074, file: !14, line: 2203, baseType: !964, size: 32, align: 32, offset: 3136)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1074, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1074, file: !14, line: 2212, baseType: !964, size: 32, align: 32, offset: 3200)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1074, file: !14, line: 2213, baseType: !964, size: 32, align: 32, offset: 3232)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1074, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1074, file: !14, line: 2232, baseType: !964, size: 32, align: 32, offset: 3296)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1074, file: !14, line: 2243, baseType: !964, size: 32, align: 32, offset: 3328)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1074, file: !14, line: 2249, baseType: !964, size: 32, align: 32, offset: 3360)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1074, file: !14, line: 2256, baseType: !964, size: 32, align: 32, offset: 3392)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1074, file: !14, line: 2263, baseType: !1012, size: 64, align: 64, offset: 3456)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1074, file: !14, line: 2270, baseType: !1012, size: 64, align: 64, offset: 3520)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1074, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1074, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1074, file: !14, line: 2367, baseType: !1442, size: 64, align: 64, offset: 3648)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{!964, !1364, !1094, !964}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1074, file: !14, line: 2383, baseType: !964, size: 32, align: 32, offset: 3712)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1074, file: !14, line: 2386, baseType: !1374, size: 32, align: 32, offset: 3744)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1074, file: !14, line: 2387, baseType: !1374, size: 32, align: 32, offset: 3776)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1074, file: !14, line: 2394, baseType: !964, size: 32, align: 32, offset: 3808)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1074, file: !14, line: 2401, baseType: !964, size: 32, align: 32, offset: 3840)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1074, file: !14, line: 2408, baseType: !964, size: 32, align: 32, offset: 3872)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1074, file: !14, line: 2415, baseType: !964, size: 32, align: 32, offset: 3904)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1074, file: !14, line: 2422, baseType: !964, size: 32, align: 32, offset: 3936)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1074, file: !14, line: 2423, baseType: !1454, size: 64, align: 64, offset: 3968)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1456)
!1456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1457)
!1457 = !{!1458, !1459, !1460, !1461}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1456, file: !14, line: 827, baseType: !964, size: 32, align: 32)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1456, file: !14, line: 828, baseType: !964, size: 32, align: 32, offset: 32)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1456, file: !14, line: 829, baseType: !964, size: 32, align: 32, offset: 64)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1456, file: !14, line: 830, baseType: !1374, size: 32, align: 32, offset: 96)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1074, file: !14, line: 2430, baseType: !1115, size: 64, align: 64, offset: 4032)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1074, file: !14, line: 2437, baseType: !1115, size: 64, align: 64, offset: 4096)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1074, file: !14, line: 2444, baseType: !1374, size: 32, align: 32, offset: 4160)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1074, file: !14, line: 2451, baseType: !1374, size: 32, align: 32, offset: 4192)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1074, file: !14, line: 2458, baseType: !964, size: 32, align: 32, offset: 4224)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1074, file: !14, line: 2469, baseType: !964, size: 32, align: 32, offset: 4256)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1074, file: !14, line: 2475, baseType: !964, size: 32, align: 32, offset: 4288)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1074, file: !14, line: 2481, baseType: !964, size: 32, align: 32, offset: 4320)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1074, file: !14, line: 2485, baseType: !964, size: 32, align: 32, offset: 4352)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1074, file: !14, line: 2489, baseType: !964, size: 32, align: 32, offset: 4384)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1074, file: !14, line: 2493, baseType: !964, size: 32, align: 32, offset: 4416)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1074, file: !14, line: 2501, baseType: !964, size: 32, align: 32, offset: 4448)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1074, file: !14, line: 2506, baseType: !964, size: 32, align: 32, offset: 4480)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1074, file: !14, line: 2510, baseType: !964, size: 32, align: 32, offset: 4512)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1074, file: !14, line: 2514, baseType: !1115, size: 64, align: 64, offset: 4544)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1074, file: !14, line: 2528, baseType: !1478, size: 64, align: 64, offset: 4608)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DISubroutineType(types: !1480)
!1480 = !{null, !1364, !976, !964, !964}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1074, file: !14, line: 2534, baseType: !964, size: 32, align: 32, offset: 4672)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1074, file: !14, line: 2545, baseType: !964, size: 32, align: 32, offset: 4704)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1074, file: !14, line: 2547, baseType: !964, size: 32, align: 32, offset: 4736)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1074, file: !14, line: 2549, baseType: !964, size: 32, align: 32, offset: 4768)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1074, file: !14, line: 2551, baseType: !964, size: 32, align: 32, offset: 4800)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1074, file: !14, line: 2553, baseType: !964, size: 32, align: 32, offset: 4832)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1074, file: !14, line: 2555, baseType: !964, size: 32, align: 32, offset: 4864)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1074, file: !14, line: 2557, baseType: !964, size: 32, align: 32, offset: 4896)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1074, file: !14, line: 2559, baseType: !964, size: 32, align: 32, offset: 4928)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1074, file: !14, line: 2563, baseType: !964, size: 32, align: 32, offset: 4960)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1074, file: !14, line: 2571, baseType: !1492, size: 64, align: 64, offset: 4992)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1074, file: !14, line: 2579, baseType: !1492, size: 64, align: 64, offset: 5056)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1074, file: !14, line: 2586, baseType: !964, size: 32, align: 32, offset: 5120)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1074, file: !14, line: 2615, baseType: !964, size: 32, align: 32, offset: 5152)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1074, file: !14, line: 2627, baseType: !964, size: 32, align: 32, offset: 5184)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1074, file: !14, line: 2637, baseType: !964, size: 32, align: 32, offset: 5216)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1074, file: !14, line: 2681, baseType: !964, size: 32, align: 32, offset: 5248)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1074, file: !14, line: 2709, baseType: !1115, size: 64, align: 64, offset: 5312)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1074, file: !14, line: 2716, baseType: !1501, size: 64, align: 64, offset: 5376)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1503)
!1503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1504)
!1504 = !{!1505, !1506, !1507, !1508, !1509, !1510, !1514, !1520, !1524, !1525, !1526, !1527, !1533, !1534, !1535, !1536, !1537}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1503, file: !14, line: 3642, baseType: !984, size: 64, align: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1503, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1503, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1503, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1503, file: !14, line: 3669, baseType: !964, size: 32, align: 32, offset: 160)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1503, file: !14, line: 3682, baseType: !1511, size: 64, align: 64, offset: 192)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DISubroutineType(types: !1513)
!1513 = !{!964, !1072, !1094}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1503, file: !14, line: 3698, baseType: !1515, size: 64, align: 64, offset: 256)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DISubroutineType(types: !1517)
!1517 = !{!964, !1072, !1518, !972}
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1503, file: !14, line: 3712, baseType: !1521, size: 64, align: 64, offset: 320)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DISubroutineType(types: !1523)
!1523 = !{!964, !1072, !964, !1518, !972}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1503, file: !14, line: 3726, baseType: !1515, size: 64, align: 64, offset: 384)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1503, file: !14, line: 3737, baseType: !1069, size: 64, align: 64, offset: 448)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1503, file: !14, line: 3746, baseType: !964, size: 32, align: 32, offset: 512)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1503, file: !14, line: 3757, baseType: !1528, size: 64, align: 64, offset: 576)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DISubroutineType(types: !1530)
!1530 = !{null, !1531}
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1503, file: !14, line: 3766, baseType: !1069, size: 64, align: 64, offset: 640)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1503, file: !14, line: 3774, baseType: !1069, size: 64, align: 64, offset: 704)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1503, file: !14, line: 3780, baseType: !964, size: 32, align: 32, offset: 768)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1503, file: !14, line: 3785, baseType: !964, size: 32, align: 32, offset: 800)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1503, file: !14, line: 3795, baseType: !1538, size: 64, align: 64, offset: 832)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DISubroutineType(types: !1540)
!1540 = !{!964, !1072, !1135}
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1074, file: !14, line: 2728, baseType: !976, size: 64, align: 64, offset: 5440)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1074, file: !14, line: 2735, baseType: !1125, size: 512, align: 64, offset: 5504)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1074, file: !14, line: 2742, baseType: !964, size: 32, align: 32, offset: 6016)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1074, file: !14, line: 2755, baseType: !964, size: 32, align: 32, offset: 6048)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1074, file: !14, line: 2776, baseType: !964, size: 32, align: 32, offset: 6080)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1074, file: !14, line: 2783, baseType: !964, size: 32, align: 32, offset: 6112)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1074, file: !14, line: 2791, baseType: !964, size: 32, align: 32, offset: 6144)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1074, file: !14, line: 2802, baseType: !1094, size: 64, align: 64, offset: 6208)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1074, file: !14, line: 2811, baseType: !964, size: 32, align: 32, offset: 6272)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1074, file: !14, line: 2821, baseType: !964, size: 32, align: 32, offset: 6304)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1074, file: !14, line: 2830, baseType: !964, size: 32, align: 32, offset: 6336)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1074, file: !14, line: 2840, baseType: !964, size: 32, align: 32, offset: 6368)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1074, file: !14, line: 2851, baseType: !1554, size: 64, align: 64, offset: 6400)
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1555, size: 64, align: 64)
!1555 = !DISubroutineType(types: !1556)
!1556 = !{!964, !1364, !1557, !976, !1367, !964, !964}
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DISubroutineType(types: !1559)
!1559 = !{!964, !1364, !976}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1074, file: !14, line: 2871, baseType: !1561, size: 64, align: 64, offset: 6464)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{!964, !1364, !1564, !976, !1367, !964}
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DISubroutineType(types: !1566)
!1566 = !{!964, !1364, !976, !964, !964}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1074, file: !14, line: 2878, baseType: !964, size: 32, align: 32, offset: 6528)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1074, file: !14, line: 2885, baseType: !964, size: 32, align: 32, offset: 6560)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1074, file: !14, line: 3005, baseType: !964, size: 32, align: 32, offset: 6592)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1074, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1074, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1074, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1074, file: !14, line: 3037, baseType: !1100, size: 64, align: 64, offset: 6720)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1074, file: !14, line: 3038, baseType: !964, size: 32, align: 32, offset: 6784)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1074, file: !14, line: 3050, baseType: !1012, size: 64, align: 64, offset: 6848)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1074, file: !14, line: 3065, baseType: !964, size: 32, align: 32, offset: 6912)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1074, file: !14, line: 3083, baseType: !964, size: 32, align: 32, offset: 6944)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1074, file: !14, line: 3092, baseType: !994, size: 64, align: 32, offset: 6976)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1074, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1074, file: !14, line: 3106, baseType: !994, size: 64, align: 32, offset: 7072)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1074, file: !14, line: 3113, baseType: !1582, size: 64, align: 64, offset: 7168)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1584)
!1584 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1585)
!1585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1586)
!1586 = !{!1587, !1588, !1589, !1590, !1591, !1592, !1595}
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1585, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1585, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1585, file: !14, line: 720, baseType: !984, size: 64, align: 64, offset: 64)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1585, file: !14, line: 724, baseType: !984, size: 64, align: 64, offset: 128)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1585, file: !14, line: 728, baseType: !964, size: 32, align: 32, offset: 192)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1585, file: !14, line: 734, baseType: !1593, size: 64, align: 64, offset: 256)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1585, file: !14, line: 739, baseType: !1596, size: 64, align: 64, offset: 320)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1060)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1074, file: !14, line: 3129, baseType: !1115, size: 64, align: 64, offset: 7232)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1074, file: !14, line: 3130, baseType: !1115, size: 64, align: 64, offset: 7296)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1074, file: !14, line: 3131, baseType: !1115, size: 64, align: 64, offset: 7360)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1074, file: !14, line: 3132, baseType: !1115, size: 64, align: 64, offset: 7424)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1074, file: !14, line: 3139, baseType: !1492, size: 64, align: 64, offset: 7488)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1074, file: !14, line: 3147, baseType: !964, size: 32, align: 32, offset: 7552)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1074, file: !14, line: 3165, baseType: !964, size: 32, align: 32, offset: 7584)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1074, file: !14, line: 3172, baseType: !964, size: 32, align: 32, offset: 7616)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1074, file: !14, line: 3180, baseType: !964, size: 32, align: 32, offset: 7648)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1074, file: !14, line: 3191, baseType: !1404, size: 64, align: 64, offset: 7680)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1074, file: !14, line: 3199, baseType: !1100, size: 64, align: 64, offset: 7744)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1074, file: !14, line: 3207, baseType: !1492, size: 64, align: 64, offset: 7808)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1074, file: !14, line: 3214, baseType: !965, size: 32, align: 32, offset: 7872)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1074, file: !14, line: 3224, baseType: !1233, size: 64, align: 64, offset: 7936)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1074, file: !14, line: 3225, baseType: !964, size: 32, align: 32, offset: 8000)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1074, file: !14, line: 3249, baseType: !1135, size: 64, align: 64, offset: 8064)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1074, file: !14, line: 3256, baseType: !964, size: 32, align: 32, offset: 8128)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1074, file: !14, line: 3271, baseType: !964, size: 32, align: 32, offset: 8160)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1074, file: !14, line: 3279, baseType: !1115, size: 64, align: 64, offset: 8192)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1074, file: !14, line: 3301, baseType: !1135, size: 64, align: 64, offset: 8256)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1074, file: !14, line: 3310, baseType: !964, size: 32, align: 32, offset: 8320)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1074, file: !14, line: 3337, baseType: !964, size: 32, align: 32, offset: 8352)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1074, file: !14, line: 3351, baseType: !964, size: 32, align: 32, offset: 8384)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1074, file: !14, line: 3359, baseType: !964, size: 32, align: 32, offset: 8416)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !981, file: !14, line: 3535, baseType: !1623, size: 64, align: 64, offset: 1024)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DISubroutineType(types: !1625)
!1625 = !{!964, !1072, !1626}
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1073)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !981, file: !14, line: 3541, baseType: !1629, size: 64, align: 64, offset: 1088)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1631)
!1631 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1632)
!1632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1088, line: 223, size: 128, align: 64, elements: !1633)
!1633 = !{!1634, !1635}
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1632, file: !1088, line: 224, baseType: !1518, size: 64, align: 64)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1632, file: !1088, line: 225, baseType: !1518, size: 64, align: 64, offset: 64)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !981, file: !14, line: 3549, baseType: !1637, size: 64, align: 64, offset: 1152)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DISubroutineType(types: !1639)
!1639 = !{null, !1067}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !981, file: !14, line: 3551, baseType: !1069, size: 64, align: 64, offset: 1216)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !981, file: !14, line: 3552, baseType: !1642, size: 64, align: 64, offset: 1280)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{!964, !1072, !1100, !964, !1645}
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1647)
!1647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1648)
!1648 = !{!1649, !1650, !1651, !1652, !1653, !1677}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1647, file: !14, line: 3921, baseType: !1405, size: 16, align: 16)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1647, file: !14, line: 3922, baseType: !972, size: 32, align: 32, offset: 32)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1647, file: !14, line: 3923, baseType: !972, size: 32, align: 32, offset: 64)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1647, file: !14, line: 3924, baseType: !965, size: 32, align: 32, offset: 96)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1647, file: !14, line: 3925, baseType: !1654, size: 64, align: 64, offset: 128)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1657)
!1657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1658)
!1658 = !{!1659, !1660, !1661, !1662, !1663, !1664, !1670, !1672, !1673, !1674, !1675, !1676}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1657, file: !14, line: 3886, baseType: !964, size: 32, align: 32)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1657, file: !14, line: 3887, baseType: !964, size: 32, align: 32, offset: 32)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1657, file: !14, line: 3888, baseType: !964, size: 32, align: 32, offset: 64)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1657, file: !14, line: 3889, baseType: !964, size: 32, align: 32, offset: 96)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1657, file: !14, line: 3890, baseType: !964, size: 32, align: 32, offset: 128)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1657, file: !14, line: 3897, baseType: !1665, size: 768, align: 64, offset: 192)
!1665 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1666)
!1666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1667)
!1667 = !{!1668, !1669}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1666, file: !14, line: 3855, baseType: !1099, size: 512, align: 64)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1666, file: !14, line: 3857, baseType: !1104, size: 256, align: 32, offset: 512)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1657, file: !14, line: 3903, baseType: !1671, size: 256, align: 64, offset: 960)
!1671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1100, size: 256, align: 64, elements: !1204)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1657, file: !14, line: 3904, baseType: !1211, size: 128, align: 32, offset: 1216)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1657, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1657, file: !14, line: 3908, baseType: !1492, size: 64, align: 64, offset: 1408)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1657, file: !14, line: 3915, baseType: !1492, size: 64, align: 64, offset: 1472)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1657, file: !14, line: 3917, baseType: !964, size: 32, align: 32, offset: 1536)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1647, file: !14, line: 3926, baseType: !1115, size: 64, align: 64, offset: 192)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !981, file: !14, line: 3564, baseType: !1679, size: 64, align: 64, offset: 1344)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DISubroutineType(types: !1681)
!1681 = !{!964, !1072, !1221, !1365, !1367}
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !981, file: !14, line: 3566, baseType: !1683, size: 64, align: 64, offset: 1408)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64, align: 64)
!1684 = !DISubroutineType(types: !1685)
!1685 = !{!964, !1072, !976, !1367, !1221}
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !981, file: !14, line: 3567, baseType: !1069, size: 64, align: 64, offset: 1472)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !981, file: !14, line: 3576, baseType: !1688, size: 64, align: 64, offset: 1536)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{!964, !1072, !1365}
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !981, file: !14, line: 3577, baseType: !1692, size: 64, align: 64, offset: 1600)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DISubroutineType(types: !1694)
!1694 = !{!964, !1072, !1221}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !981, file: !14, line: 3584, baseType: !1511, size: 64, align: 64, offset: 1664)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !981, file: !14, line: 3589, baseType: !1697, size: 64, align: 64, offset: 1728)
!1697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1698, size: 64, align: 64)
!1698 = !DISubroutineType(types: !1699)
!1699 = !{null, !1072}
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !981, file: !14, line: 3594, baseType: !964, size: 32, align: 32, offset: 1792)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !981, file: !14, line: 3600, baseType: !984, size: 64, align: 64, offset: 1856)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !981, file: !14, line: 3609, baseType: !1703, size: 64, align: 64, offset: 1920)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64, align: 64)
!1704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1705, size: 64, align: 64)
!1705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1706)
!1706 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1707 = distinct !DIGlobalVariable(name: "scan3x3", scope: !0, file: !979, line: 52, type: !1708, isLocal: true, isDefinition: true, variable: [4 x i8]* @scan3x3)
!1708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1519, size: 32, align: 8, elements: !1204)
!1709 = distinct !DIGlobalVariable(name: "cbp_tab", scope: !0, file: !979, line: 41, type: !1710, isLocal: true, isDefinition: true, variable: [64 x [2 x i8]]* @cbp_tab)
!1710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1519, size: 1024, align: 8, elements: !1711)
!1711 = !{!1712, !1713}
!1712 = !DISubrange(count: 64)
!1713 = !DISubrange(count: 2)
!1714 = distinct !DIGlobalVariable(name: "dequant_mul", scope: !0, file: !979, line: 65, type: !1715, isLocal: true, isDefinition: true, variable: [64 x i16]* @dequant_mul)
!1715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1716, size: 1024, align: 16, elements: !1717)
!1716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1405)
!1717 = !{!1712}
!1718 = distinct !DIGlobalVariable(name: "dequant_shift", scope: !0, file: !979, line: 54, type: !1719, isLocal: true, isDefinition: true, variable: [64 x i8]* @dequant_shift)
!1719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1519, size: 512, align: 8, elements: !1717)
