; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--movsub_bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--movsub_bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, {}*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }
%struct.AVPacket = type { %struct.AVBufferRef*, i64, i64, i8*, i32, i32, i32, %struct.AVPacketSideData*, i32, i64, i64, i64 }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque
%struct.AVPacketSideData = type { i8*, i32, i32 }

!557 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!558 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!559 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!560 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!561 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!562 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!563 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!564 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!565 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!566 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!567 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!568 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!569 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!570 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !503, line: 538, size: 32, align: 32, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579}
!572 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!573 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!574 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!575 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!576 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!577 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!578 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!579 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !4, line: 1175, size: 32, align: 32, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!582 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!583 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!584 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!585 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!586 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!587 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!588 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!589 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!590 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!591 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!592 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!593 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!594 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!595 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!596 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!597 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!598 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!599 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!600 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!601 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!602 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!603 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!604 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!605 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!606 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!607 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!608 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!609 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!610 = !{!611, !612, !613, !621}
!611 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!612 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64, align: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !615, line: 222, size: 16, align: 8, elements: !616)
!615 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!616 = !{!617}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !614, file: !615, line: 222, baseType: !618, size: 16, align: 16)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !619, line: 49, baseType: !620)
!619 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!620 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!623 = !{!624, !791}
!624 = distinct !DIGlobalVariable(name: "ff_text2movsub_bsf", scope: !0, file: !625, line: 60, type: !626, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_text2movsub_bsf)
!625 = !DIFile(filename: "libavcodec/movsub_bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !629)
!629 = !{!630, !634, !637, !679, !680, !748, !786, !790}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !628, file: !4, line: 5797, baseType: !631, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !633)
!633 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !628, file: !4, line: 5804, baseType: !635, size: 64, align: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !628, file: !4, line: 5815, baseType: !638, size: 64, align: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !642)
!642 = !{!643, !644, !649, !653, !654, !655, !656, !660, !666, !668, !672}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !641, file: !464, line: 72, baseType: !631, size: 64, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !641, file: !464, line: 78, baseType: !645, size: 64, align: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64, align: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!631, !648}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !641, file: !464, line: 85, baseType: !650, size: 64, align: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !652)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !641, file: !464, line: 93, baseType: !611, size: 32, align: 32, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !641, file: !464, line: 99, baseType: !611, size: 32, align: 32, offset: 224)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !641, file: !464, line: 108, baseType: !611, size: 32, align: 32, offset: 256)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !641, file: !464, line: 113, baseType: !657, size: 64, align: 64, offset: 320)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64, align: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!648, !648, !648}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !641, file: !464, line: 123, baseType: !661, size: 64, align: 64, offset: 384)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64, align: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!664, !664}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !641)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !641, file: !464, line: 130, baseType: !667, size: 32, align: 32, offset: 448)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !641, file: !464, line: 136, baseType: !669, size: 64, align: 64, offset: 512)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64, align: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!667, !648}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !641, file: !464, line: 142, baseType: !673, size: 64, align: 64, offset: 576)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64, align: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!611, !676, !648, !631, !611}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64, align: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64, align: 64)
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !628, file: !4, line: 5825, baseType: !611, size: 32, align: 32, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !628, file: !4, line: 5826, baseType: !681, size: 64, align: 64, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64, align: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!611, !684}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !687)
!687 = !{!688, !689, !692, !696, !697, !745, !746, !747}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !686, file: !4, line: 5751, baseType: !638, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !686, file: !4, line: 5756, baseType: !690, size: 64, align: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !628)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !686, file: !4, line: 5762, baseType: !693, size: 64, align: 64, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !695)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !686, file: !4, line: 5768, baseType: !648, size: 64, align: 64, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !686, file: !4, line: 5775, baseType: !698, size: 64, align: 64, offset: 256)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !701)
!701 = !{!702, !703, !704, !706, !710, !711, !712, !715, !716, !717, !718, !719, !720, !721, !728, !729, !730, !731, !732, !733, !734, !735, !738, !739, !740, !741, !742, !743, !744}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !700, file: !4, line: 3940, baseType: !484, size: 32, align: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !700, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !700, file: !4, line: 3948, baseType: !705, size: 32, align: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !619, line: 51, baseType: !612)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !700, file: !4, line: 3958, baseType: !707, size: 64, align: 64, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !619, line: 48, baseType: !709)
!709 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !700, file: !4, line: 3962, baseType: !611, size: 32, align: 32, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !700, file: !4, line: 3968, baseType: !611, size: 32, align: 32, offset: 224)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !700, file: !4, line: 3973, baseType: !713, size: 64, align: 64, offset: 256)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !619, line: 40, baseType: !714)
!714 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !700, file: !4, line: 3986, baseType: !611, size: 32, align: 32, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !700, file: !4, line: 3999, baseType: !611, size: 32, align: 32, offset: 352)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !700, file: !4, line: 4004, baseType: !611, size: 32, align: 32, offset: 384)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !700, file: !4, line: 4005, baseType: !611, size: 32, align: 32, offset: 416)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !700, file: !4, line: 4010, baseType: !611, size: 32, align: 32, offset: 448)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !700, file: !4, line: 4011, baseType: !611, size: 32, align: 32, offset: 480)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !700, file: !4, line: 4020, baseType: !722, size: 64, align: 32, offset: 512)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !723, line: 61, baseType: !724)
!723 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !723, line: 58, size: 64, align: 32, elements: !725)
!725 = !{!726, !727}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !724, file: !723, line: 59, baseType: !611, size: 32, align: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !724, file: !723, line: 60, baseType: !611, size: 32, align: 32, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !700, file: !4, line: 4025, baseType: !494, size: 32, align: 32, offset: 576)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !700, file: !4, line: 4030, baseType: !502, size: 32, align: 32, offset: 608)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !700, file: !4, line: 4031, baseType: !509, size: 32, align: 32, offset: 640)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !700, file: !4, line: 4032, baseType: !527, size: 32, align: 32, offset: 672)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !700, file: !4, line: 4033, baseType: !551, size: 32, align: 32, offset: 704)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !700, file: !4, line: 4034, baseType: !570, size: 32, align: 32, offset: 736)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !700, file: !4, line: 4039, baseType: !611, size: 32, align: 32, offset: 768)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !700, file: !4, line: 4046, baseType: !736, size: 64, align: 64, offset: 832)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !619, line: 55, baseType: !737)
!737 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !700, file: !4, line: 4050, baseType: !611, size: 32, align: 32, offset: 896)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !700, file: !4, line: 4054, baseType: !611, size: 32, align: 32, offset: 928)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !700, file: !4, line: 4061, baseType: !611, size: 32, align: 32, offset: 960)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !700, file: !4, line: 4065, baseType: !611, size: 32, align: 32, offset: 992)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !700, file: !4, line: 4073, baseType: !611, size: 32, align: 32, offset: 1024)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !700, file: !4, line: 4080, baseType: !611, size: 32, align: 32, offset: 1056)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !700, file: !4, line: 4084, baseType: !611, size: 32, align: 32, offset: 1088)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !686, file: !4, line: 5781, baseType: !698, size: 64, align: 64, offset: 320)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !686, file: !4, line: 5787, baseType: !722, size: 64, align: 32, offset: 384)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !686, file: !4, line: 5793, baseType: !722, size: 64, align: 32, offset: 448)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !628, file: !4, line: 5827, baseType: !749, size: 64, align: 64, offset: 320)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64, align: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!611, !684, !752}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64, align: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !755)
!755 = !{!756, !768, !769, !770, !771, !772, !773, !774, !782, !783, !784, !785}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !754, file: !4, line: 1451, baseType: !757, size: 64, align: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !759, line: 94, baseType: !760)
!759 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !759, line: 81, size: 192, align: 64, elements: !761)
!761 = !{!762, !766, !767}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !760, file: !759, line: 82, baseType: !763, size: 64, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64, align: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !759, line: 73, baseType: !765)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !759, line: 73, flags: DIFlagFwdDecl)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !760, file: !759, line: 89, baseType: !707, size: 64, align: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !760, file: !759, line: 93, baseType: !611, size: 32, align: 32, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !754, file: !4, line: 1461, baseType: !713, size: 64, align: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !754, file: !4, line: 1467, baseType: !713, size: 64, align: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !754, file: !4, line: 1468, baseType: !707, size: 64, align: 64, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !754, file: !4, line: 1469, baseType: !611, size: 32, align: 32, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !754, file: !4, line: 1470, baseType: !611, size: 32, align: 32, offset: 288)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !754, file: !4, line: 1474, baseType: !611, size: 32, align: 32, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !754, file: !4, line: 1479, baseType: !775, size: 64, align: 64, offset: 384)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !778)
!778 = !{!779, !780, !781}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !777, file: !4, line: 1412, baseType: !707, size: 64, align: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !777, file: !4, line: 1413, baseType: !611, size: 32, align: 32, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !777, file: !4, line: 1414, baseType: !580, size: 32, align: 32, offset: 96)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !754, file: !4, line: 1480, baseType: !611, size: 32, align: 32, offset: 448)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !754, file: !4, line: 1486, baseType: !713, size: 64, align: 64, offset: 512)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !754, file: !4, line: 1488, baseType: !713, size: 64, align: 64, offset: 576)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !754, file: !4, line: 1497, baseType: !713, size: 64, align: 64, offset: 640)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !628, file: !4, line: 5828, baseType: !787, size: 64, align: 64, offset: 384)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64, align: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !684}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !628, file: !4, line: 5829, baseType: !787, size: 64, align: 64, offset: 448)
!791 = distinct !DIGlobalVariable(name: "ff_mov2textsub_bsf", scope: !0, file: !625, line: 84, type: !626, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_mov2textsub_bsf)
!792 = !{i32 2, !"Dwarf Version", i32 4}
!793 = !{i32 2, !"Debug Info Version", i32 3}
!794 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!795 = distinct !DISubprogram(name: "text2movsub", scope: !625, file: !625, line: 26, type: !750, isLocal: true, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !796)
!796 = !{}
!797 = !DILocalVariable(name: "x", arg: 1, scope: !798, file: !799, line: 58, type: !618)
!798 = distinct !DISubprogram(name: "av_bswap16", scope: !799, file: !799, line: 58, type: !800, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !796)
!799 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!800 = !DISubroutineType(types: !801)
!801 = !{!618, !618}
!802 = !DIExpression()
!803 = !DILocation(line: 58, column: 98, scope: !798, inlinedAt: !804)
!804 = distinct !DILocation(line: 50, column: 51, scope: !795)
!805 = !DILocalVariable(name: "ctx", arg: 1, scope: !795, file: !625, line: 26, type: !684)
!806 = !DILocation(line: 26, column: 38, scope: !795)
!807 = !DILocalVariable(name: "out", arg: 2, scope: !795, file: !625, line: 26, type: !752)
!808 = !DILocation(line: 26, column: 53, scope: !795)
!809 = !DILocalVariable(name: "in", scope: !795, file: !625, line: 28, type: !752)
!810 = !DILocation(line: 28, column: 15, scope: !795)
!811 = !DILocalVariable(name: "ret", scope: !795, file: !625, line: 29, type: !611)
!812 = !DILocation(line: 29, column: 9, scope: !795)
!813 = !DILocation(line: 31, column: 29, scope: !795)
!814 = !DILocation(line: 31, column: 11, scope: !795)
!815 = !DILocation(line: 31, column: 9, scope: !795)
!816 = !DILocation(line: 32, column: 9, scope: !817)
!817 = distinct !DILexicalBlock(scope: !795, file: !625, line: 32, column: 9)
!818 = !DILocation(line: 32, column: 13, scope: !817)
!819 = !DILocation(line: 32, column: 9, scope: !795)
!820 = !DILocation(line: 33, column: 16, scope: !817)
!821 = !DILocation(line: 33, column: 9, scope: !817)
!822 = !DILocation(line: 35, column: 9, scope: !823)
!823 = distinct !DILexicalBlock(scope: !795, file: !625, line: 35, column: 9)
!824 = !DILocation(line: 35, column: 13, scope: !823)
!825 = !DILocation(line: 35, column: 18, scope: !823)
!826 = !DILocation(line: 35, column: 9, scope: !795)
!827 = !DILocation(line: 36, column: 13, scope: !828)
!828 = distinct !DILexicalBlock(scope: !823, file: !625, line: 35, column: 28)
!829 = !DILocation(line: 37, column: 9, scope: !828)
!830 = !DILocation(line: 40, column: 25, scope: !795)
!831 = !DILocation(line: 40, column: 30, scope: !795)
!832 = !DILocation(line: 40, column: 34, scope: !795)
!833 = !DILocation(line: 40, column: 39, scope: !795)
!834 = !DILocation(line: 40, column: 11, scope: !795)
!835 = !DILocation(line: 40, column: 9, scope: !795)
!836 = !DILocation(line: 41, column: 9, scope: !837)
!837 = distinct !DILexicalBlock(scope: !795, file: !625, line: 41, column: 9)
!838 = !DILocation(line: 41, column: 13, scope: !837)
!839 = !DILocation(line: 41, column: 9, scope: !795)
!840 = !DILocation(line: 42, column: 13, scope: !841)
!841 = distinct !DILexicalBlock(scope: !837, file: !625, line: 41, column: 18)
!842 = !DILocation(line: 43, column: 9, scope: !841)
!843 = !DILocation(line: 46, column: 32, scope: !795)
!844 = !DILocation(line: 46, column: 37, scope: !795)
!845 = !DILocation(line: 46, column: 11, scope: !795)
!846 = !DILocation(line: 46, column: 9, scope: !795)
