; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--vp8dsp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--vp8dsp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.VP8DSPContext = type { void ([4 x [16 x i16]]*, i16*)*, void ([4 x [16 x i16]]*, i16*)*, void (i8*, i16*, i64)*, void (i8*, i16*, i64)*, void (i8*, [16 x i16]*, i64)*, void (i8*, [16 x i16]*, i64)*, void (i8*, i64, i32, i32, i32)*, void (i8*, i64, i32, i32, i32)*, void (i8*, i8*, i64, i32, i32, i32)*, void (i8*, i8*, i64, i32, i32, i32)*, void (i8*, i64, i32, i32, i32)*, void (i8*, i64, i32, i32, i32)*, void (i8*, i8*, i64, i32, i32, i32)*, void (i8*, i8*, i64, i32, i32, i32)*, void (i8*, i64, i32)*, void (i8*, i64, i32)*, [3 x [3 x [3 x void (i8*, i64, i8*, i64, i32, i32, i32)*]]], [3 x [3 x [3 x void (i8*, i64, i8*, i64, i32, i32, i32)*]]] }
%union.av_alias64 = type { i64 }

@subpel_filters = internal constant [7 x [6 x i8]] [[6 x i8] c"\00\06{\0C\01\00", [6 x i8] c"\02\0Bl$\08\01", [6 x i8] c"\00\09]2\06\00", [6 x i8] c"\03\10MM\10\03", [6 x i8] c"\00\062]\09\00", [6 x i8] c"\01\08$l\0B\02", [6 x i8] c"\00\01\0C{\06\00"], align 16
@ff_crop_tab = external constant [2304 x i8], align 16

; Function Attrs: cold nounwind optsize uwtable
define void @ff_vp78dsp_init(%struct.VP8DSPContext* %dsp) #0 !dbg !48 {
entry:
  %dsp.addr = alloca %struct.VP8DSPContext*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !37)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--vp8dsp.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "av_alias64", file: !7, line: 34, baseType: !8)
!7 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!8 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !7, line: 27, size: 64, align: 64, elements: !9)
!9 = !{!10, !14, !20, !26, !32, !34}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !8, file: !7, line: 28, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !12, line: 55, baseType: !13)
!12 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!13 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !8, file: !7, line: 29, baseType: !15, size: 64, align: 32)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 64, align: 32, elements: !18)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !12, line: 51, baseType: !17)
!17 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!18 = !{!19}
!19 = !DISubrange(count: 2)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "u16", scope: !8, file: !7, line: 30, baseType: !21, size: 64, align: 16)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, align: 16, elements: !24)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !12, line: 49, baseType: !23)
!23 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!24 = !{!25}
!25 = !DISubrange(count: 4)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !8, file: !7, line: 31, baseType: !27, size: 64, align: 8)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 64, align: 8, elements: !30)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !12, line: 48, baseType: !29)
!29 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!30 = !{!31}
!31 = !DISubrange(count: 8)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "f64", scope: !8, file: !7, line: 32, baseType: !33, size: 64, align: 64)
!33 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "f32", scope: !8, file: !7, line: 33, baseType: !35, size: 64, align: 32)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 64, align: 32, elements: !18)
!36 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!37 = !{!38}
!38 = distinct !DIGlobalVariable(name: "subpel_filters", scope: !0, file: !39, line: 457, type: !40, isLocal: true, isDefinition: true, variable: [7 x [6 x i8]]* @subpel_filters)
!39 = !DIFile(filename: "libavcodec/vp8dsp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 336, align: 8, elements: !42)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!42 = !{!43, !44}
!43 = !DISubrange(count: 7)
!44 = !DISubrange(count: 6)
!45 = !{i32 2, !"Dwarf Version", i32 4}
!46 = !{i32 2, !"Debug Info Version", i32 3}
!47 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!48 = distinct !DISubprogram(name: "ff_vp78dsp_init", scope: !39, file: !39, line: 666, type: !49, isLocal: false, isDefinition: true, scopeLine: 667, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !51}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP8DSPContext", file: !53, line: 82, baseType: !54)
!53 = !DIFile(filename: "libavcodec/vp8dsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP8DSPContext", file: !53, line: 37, size: 4480, align: 64, elements: !55)
!55 = !{!56, !67, !68, !76, !77, !84, !85, !89, !90, !94, !95, !96, !97, !98, !99, !103, !104, !112}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "vp8_luma_dc_wht", scope: !54, file: !53, line: 38, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !60, !66}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 1024, align: 16, elements: !64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !12, line: 37, baseType: !63)
!63 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!64 = !{!25, !65}
!65 = !DISubrange(count: 16)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "vp8_luma_dc_wht_dc", scope: !54, file: !53, line: 39, baseType: !57, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "vp8_idct_add", scope: !54, file: !53, line: 40, baseType: !69, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !72, !66, !73}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !74, line: 149, baseType: !75)
!74 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!75 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "vp8_idct_dc_add", scope: !54, file: !53, line: 41, baseType: !69, size: 64, align: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "vp8_idct_dc_add4y", scope: !54, file: !53, line: 42, baseType: !78, size: 64, align: 64, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !72, !81, !73}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 256, align: 16, elements: !83)
!83 = !{!65}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "vp8_idct_dc_add4uv", scope: !54, file: !53, line: 44, baseType: !78, size: 64, align: 64, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "vp8_v_loop_filter16y", scope: !54, file: !53, line: 48, baseType: !86, size: 64, align: 64, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !72, !73, !4, !4, !4}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "vp8_h_loop_filter16y", scope: !54, file: !53, line: 50, baseType: !86, size: 64, align: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "vp8_v_loop_filter8uv", scope: !54, file: !53, line: 52, baseType: !91, size: 64, align: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !72, !72, !73, !4, !4, !4}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "vp8_h_loop_filter8uv", scope: !54, file: !53, line: 54, baseType: !91, size: 64, align: 64, offset: 576)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "vp8_v_loop_filter16y_inner", scope: !54, file: !53, line: 58, baseType: !86, size: 64, align: 64, offset: 640)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "vp8_h_loop_filter16y_inner", scope: !54, file: !53, line: 60, baseType: !86, size: 64, align: 64, offset: 704)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "vp8_v_loop_filter8uv_inner", scope: !54, file: !53, line: 62, baseType: !91, size: 64, align: 64, offset: 768)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "vp8_h_loop_filter8uv_inner", scope: !54, file: !53, line: 65, baseType: !91, size: 64, align: 64, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "vp8_v_loop_filter_simple", scope: !54, file: !53, line: 69, baseType: !100, size: 64, align: 64, offset: 896)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !72, !73, !4}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "vp8_h_loop_filter_simple", scope: !54, file: !53, line: 70, baseType: !100, size: 64, align: 64, offset: 960)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "put_vp8_epel_pixels_tab", scope: !54, file: !53, line: 80, baseType: !105, size: 1728, align: 64, offset: 1024)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 1728, align: 64, elements: !110)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "vp8_mc_func", file: !53, line: 33, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !72, !73, !72, !73, !4, !4, !4}
!110 = !{!111, !111, !111}
!111 = !DISubrange(count: 3)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "put_vp8_bilinear_pixels_tab", scope: !54, file: !53, line: 81, baseType: !105, size: 1728, align: 64, offset: 2752)
!113 = !DILocalVariable(name: "dsp", arg: 1, scope: !48, file: !39, line: 666, type: !51)
!114 = !DIExpression()
!115 = !DILocation(line: 666, column: 59, scope: !48)
!116 = !DILocation(line: 668, column: 5, scope: !48)
!117 = !DILocation(line: 668, column: 10, scope: !48)
!118 = !DILocation(line: 668, column: 43, scope: !48)
!119 = !DILocation(line: 668, column: 65, scope: !48)
!120 = !DILocation(line: 668, column: 70, scope: !48)
!121 = !DILocation(line: 668, column: 103, scope: !48)
!122 = !DILocation(line: 668, column: 126, scope: !48)
!123 = !DILocation(line: 668, column: 131, scope: !48)
!124 = !DILocation(line: 668, column: 164, scope: !48)
!125 = !DILocation(line: 668, column: 187, scope: !48)
!126 = !DILocation(line: 668, column: 192, scope: !48)
!127 = !DILocation(line: 668, column: 225, scope: !48)
!128 = !DILocation(line: 668, column: 248, scope: !48)
!129 = !DILocation(line: 668, column: 253, scope: !48)
!130 = !DILocation(line: 668, column: 286, scope: !48)
!131 = !DILocation(line: 668, column: 311, scope: !48)
!132 = !DILocation(line: 668, column: 316, scope: !48)
!133 = !DILocation(line: 668, column: 349, scope: !48)
!134 = !DILocation(line: 668, column: 374, scope: !48)
!135 = !DILocation(line: 668, column: 379, scope: !48)
!136 = !DILocation(line: 668, column: 412, scope: !48)
!137 = !DILocation(line: 668, column: 435, scope: !48)
!138 = !DILocation(line: 668, column: 440, scope: !48)
!139 = !DILocation(line: 668, column: 473, scope: !48)
!140 = !DILocation(line: 668, column: 498, scope: !48)
!141 = !DILocation(line: 668, column: 503, scope: !48)
!142 = !DILocation(line: 668, column: 536, scope: !48)
!143 = !DILocation(line: 669, column: 5, scope: !48)
!144 = !DILocation(line: 669, column: 10, scope: !48)
!145 = !DILocation(line: 669, column: 43, scope: !48)
!146 = !DILocation(line: 669, column: 64, scope: !48)
!147 = !DILocation(line: 669, column: 69, scope: !48)
!148 = !DILocation(line: 669, column: 102, scope: !48)
!149 = !DILocation(line: 669, column: 124, scope: !48)
!150 = !DILocation(line: 669, column: 129, scope: !48)
!151 = !DILocation(line: 669, column: 162, scope: !48)
!152 = !DILocation(line: 669, column: 184, scope: !48)
!153 = !DILocation(line: 669, column: 189, scope: !48)
!154 = !DILocation(line: 669, column: 222, scope: !48)
!155 = !DILocation(line: 669, column: 244, scope: !48)
!156 = !DILocation(line: 669, column: 249, scope: !48)
!157 = !DILocation(line: 669, column: 282, scope: !48)
!158 = !DILocation(line: 669, column: 306, scope: !48)
!159 = !DILocation(line: 669, column: 311, scope: !48)
!160 = !DILocation(line: 669, column: 344, scope: !48)
!161 = !DILocation(line: 669, column: 368, scope: !48)
!162 = !DILocation(line: 669, column: 373, scope: !48)
!163 = !DILocation(line: 669, column: 406, scope: !48)
!164 = !DILocation(line: 669, column: 428, scope: !48)
!165 = !DILocation(line: 669, column: 433, scope: !48)
!166 = !DILocation(line: 669, column: 466, scope: !48)
!167 = !DILocation(line: 669, column: 490, scope: !48)
!168 = !DILocation(line: 669, column: 495, scope: !48)
!169 = !DILocation(line: 669, column: 528, scope: !48)
!170 = !DILocation(line: 670, column: 5, scope: !48)
!171 = !DILocation(line: 670, column: 10, scope: !48)
!172 = !DILocation(line: 670, column: 43, scope: !48)
!173 = !DILocation(line: 670, column: 64, scope: !48)
!174 = !DILocation(line: 670, column: 69, scope: !48)
!175 = !DILocation(line: 670, column: 102, scope: !48)
!176 = !DILocation(line: 670, column: 124, scope: !48)
!177 = !DILocation(line: 670, column: 129, scope: !48)
!178 = !DILocation(line: 670, column: 162, scope: !48)
!179 = !DILocation(line: 670, column: 184, scope: !48)
!180 = !DILocation(line: 670, column: 189, scope: !48)
!181 = !DILocation(line: 670, column: 222, scope: !48)
!182 = !DILocation(line: 670, column: 244, scope: !48)
