; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--gopher.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--gopher.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }
%struct.URLProtocol = type { i8*, {}*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }
%struct.AVIOInterruptCB = type { i32 (i8*)*, i8* }
%struct.AVDictionary = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, globals: !24)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--gopher.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 29, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!6 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!7 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!8 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!9 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!10 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!11 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!12 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!13 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!14 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!15 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!16 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!17 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!18 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!19 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!20 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!21 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!22 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!23 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!24 = !{!25}
!25 = distinct !DIGlobalVariable(name: "ff_gopher_protocol", scope: !0, file: !26, line: 117, type: !27, isLocal: false, isDefinition: true, variable: { i8*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }* @ff_gopher_protocol)
!26 = !DIFile(filename: "libavformat/gopher.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLProtocol", file: !29, line: 100, baseType: !30)
!29 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !29, line: 54, size: 1600, align: 64, elements: !31)
!31 = !{!32, !36, !114, !123, !128, !132, !138, !144, !148, !149, !153, !157, !158, !164, !165, !166, !167, !168, !169, !170, !171, !190, !191, !192, !196}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !30, file: !29, line: 55, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!35 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !30, file: !29, line: 56, baseType: !37, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !41, !33, !40}
!40 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !29, line: 52, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !29, line: 38, size: 768, align: 64, elements: !44)
!44 = !{!45, !87, !90, !91, !93, !94, !95, !96, !97, !107, !111, !112, !113}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !43, file: !29, line: 39, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !50)
!50 = !{!51, !52, !57, !61, !62, !63, !64, !68, !74, !76, !80}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !49, file: !4, line: 72, baseType: !33, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !49, file: !4, line: 78, baseType: !53, size: 64, align: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!33, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !49, file: !4, line: 85, baseType: !58, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !49, file: !4, line: 93, baseType: !40, size: 32, align: 32, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !49, file: !4, line: 99, baseType: !40, size: 32, align: 32, offset: 224)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !49, file: !4, line: 108, baseType: !40, size: 32, align: 32, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !49, file: !4, line: 113, baseType: !65, size: 64, align: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!56, !56, !56}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !49, file: !4, line: 123, baseType: !69, size: 64, align: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!72, !72}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !49, file: !4, line: 130, baseType: !75, size: 32, align: 32, offset: 448)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !49, file: !4, line: 136, baseType: !77, size: 64, align: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!75, !56}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !49, file: !4, line: 142, baseType: !81, size: 64, align: 64, offset: 576)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!40, !84, !56, !33, !40}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !43, file: !29, line: 40, baseType: !88, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !43, file: !29, line: 41, baseType: !56, size: 64, align: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !43, file: !29, line: 42, baseType: !92, size: 64, align: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !43, file: !29, line: 43, baseType: !40, size: 32, align: 32, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !43, file: !29, line: 44, baseType: !40, size: 32, align: 32, offset: 288)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !43, file: !29, line: 45, baseType: !40, size: 32, align: 32, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !43, file: !29, line: 46, baseType: !40, size: 32, align: 32, offset: 352)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !43, file: !29, line: 47, baseType: !98, size: 128, align: 64, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !99, line: 61, baseType: !100)
!99 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !99, line: 58, size: 128, align: 64, elements: !101)
!101 = !{!102, !106}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !100, file: !99, line: 59, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!40, !56}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !100, file: !99, line: 60, baseType: !56, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !43, file: !29, line: 48, baseType: !108, size: 64, align: 64, offset: 512)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !109, line: 40, baseType: !110)
!109 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!110 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !43, file: !29, line: 49, baseType: !33, size: 64, align: 64, offset: 576)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !43, file: !29, line: 50, baseType: !33, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !43, file: !29, line: 51, baseType: !40, size: 32, align: 32, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !30, file: !29, line: 62, baseType: !115, size: 64, align: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!40, !41, !33, !40, !118}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !121, line: 86, baseType: !122)
!121 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !121, line: 86, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !30, file: !29, line: 63, baseType: !124, size: 64, align: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!40, !41, !127}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !30, file: !29, line: 64, baseType: !129, size: 64, align: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!40, !41}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !30, file: !29, line: 78, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!40, !41, !136, !40}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !30, file: !29, line: 79, baseType: !139, size: 64, align: 64, offset: 384)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!40, !41, !142, !40}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !30, file: !29, line: 80, baseType: !145, size: 64, align: 64, offset: 448)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!108, !41, !108, !40}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !30, file: !29, line: 81, baseType: !129, size: 64, align: 64, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !30, file: !29, line: 82, baseType: !150, size: 64, align: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!40, !41, !40}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !30, file: !29, line: 83, baseType: !154, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!108, !41, !40, !108, !40}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !30, file: !29, line: 85, baseType: !129, size: 64, align: 64, offset: 704)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !30, file: !29, line: 86, baseType: !159, size: 64, align: 64, offset: 768)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!40, !41, !162, !163}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !30, file: !29, line: 88, baseType: !129, size: 64, align: 64, offset: 832)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !30, file: !29, line: 89, baseType: !150, size: 64, align: 64, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !30, file: !29, line: 90, baseType: !40, size: 32, align: 32, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !30, file: !29, line: 91, baseType: !46, size: 64, align: 64, offset: 1024)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !30, file: !29, line: 92, baseType: !40, size: 32, align: 32, offset: 1088)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !30, file: !29, line: 93, baseType: !150, size: 64, align: 64, offset: 1152)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !30, file: !29, line: 94, baseType: !129, size: 64, align: 64, offset: 1216)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !30, file: !29, line: 95, baseType: !172, size: 64, align: 64, offset: 1280)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!40, !41, !175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !99, line: 101, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !99, line: 86, size: 576, align: 64, elements: !179)
!179 = !{!180, !181, !182, !183, !184, !185, !186, !187, !188, !189}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !178, file: !99, line: 87, baseType: !92, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !178, file: !99, line: 88, baseType: !40, size: 32, align: 32, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !178, file: !99, line: 89, baseType: !40, size: 32, align: 32, offset: 96)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !178, file: !99, line: 91, baseType: !108, size: 64, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !178, file: !99, line: 92, baseType: !108, size: 64, align: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !178, file: !99, line: 94, baseType: !108, size: 64, align: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !178, file: !99, line: 96, baseType: !108, size: 64, align: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !178, file: !99, line: 98, baseType: !108, size: 64, align: 64, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !178, file: !99, line: 99, baseType: !108, size: 64, align: 64, offset: 448)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !178, file: !99, line: 100, baseType: !108, size: 64, align: 64, offset: 512)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !30, file: !29, line: 96, baseType: !129, size: 64, align: 64, offset: 1344)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !30, file: !29, line: 97, baseType: !129, size: 64, align: 64, offset: 1408)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !30, file: !29, line: 98, baseType: !193, size: 64, align: 64, offset: 1472)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!40, !41, !41}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !30, file: !29, line: 99, baseType: !33, size: 64, align: 64, offset: 1536)
!197 = !{i32 2, !"Dwarf Version", i32 4}
!198 = !{i32 2, !"Debug Info Version", i32 3}
!199 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!200 = distinct !DISubprogram(name: "gopher_open", scope: !26, file: !26, line: 78, type: !38, isLocal: true, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !201)
!201 = !{}
!202 = !DILocalVariable(name: "h", arg: 1, scope: !200, file: !26, line: 78, type: !41)
!203 = !DIExpression()
!204 = !DILocation(line: 78, column: 36, scope: !200)
!205 = !DILocalVariable(name: "uri", arg: 2, scope: !200, file: !26, line: 78, type: !33)
!206 = !DILocation(line: 78, column: 51, scope: !200)
!207 = !DILocalVariable(name: "flags", arg: 3, scope: !200, file: !26, line: 78, type: !40)
!208 = !DILocation(line: 78, column: 60, scope: !200)
!209 = !DILocalVariable(name: "s", scope: !200, file: !26, line: 80, type: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "GopherContext", file: !26, line: 33, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GopherContext", file: !26, line: 31, size: 64, align: 64, elements: !213)
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "hd", scope: !212, file: !26, line: 32, baseType: !41, size: 64, align: 64)
!215 = !DILocation(line: 80, column: 20, scope: !200)
!216 = !DILocation(line: 80, column: 24, scope: !200)
!217 = !DILocation(line: 80, column: 27, scope: !200)
!218 = !DILocalVariable(name: "hostname", scope: !200, file: !26, line: 81, type: !219)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8192, align: 8, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 1024)
!222 = !DILocation(line: 81, column: 10, scope: !200)
!223 = !DILocalVariable(name: "auth", scope: !200, file: !26, line: 81, type: !219)
!224 = !DILocation(line: 81, column: 26, scope: !200)
!225 = !DILocalVariable(name: "path", scope: !200, file: !26, line: 81, type: !219)
!226 = !DILocation(line: 81, column: 38, scope: !200)
!227 = !DILocalVariable(name: "buf", scope: !200, file: !26, line: 81, type: !219)
!228 = !DILocation(line: 81, column: 50, scope: !200)
!229 = !DILocalVariable(name: "port", scope: !200, file: !26, line: 82, type: !40)
!230 = !DILocation(line: 82, column: 9, scope: !200)
!231 = !DILocalVariable(name: "err", scope: !200, file: !26, line: 82, type: !40)
!232 = !DILocation(line: 82, column: 15, scope: !200)
!233 = !DILocation(line: 84, column: 5, scope: !200)
!234 = !DILocation(line: 84, column: 8, scope: !200)
!235 = !DILocation(line: 84, column: 20, scope: !200)
!236 = !DILocation(line: 87, column: 26, scope: !200)
!237 = !DILocation(line: 87, column: 46, scope: !200)
!238 = !DILocation(line: 88, column: 18, scope: !200)
!239 = !DILocation(line: 88, column: 38, scope: !200)
!240 = !DILocation(line: 87, column: 5, scope: !200)
!241 = !DILocation(line: 90, column: 9, scope: !242)
!242 = distinct !DILexicalBlock(scope: !200, file: !26, line: 90, column: 9)
!243 = !DILocation(line: 90, column: 14, scope: !242)
!244 = !DILocation(line: 90, column: 9, scope: !200)
!245 = !DILocation(line: 91, column: 14, scope: !242)
!246 = !DILocation(line: 91, column: 9, scope: !242)
!247 = !DILocation(line: 93, column: 17, scope: !200)
!248 = !DILocation(line: 93, column: 47, scope: !200)
!249 = !DILocation(line: 93, column: 57, scope: !200)
!250 = !DILocation(line: 93, column: 5, scope: !200)
!251 = !DILocation(line: 95, column: 5, scope: !200)
!252 = !DILocation(line: 95, column: 8, scope: !200)
!253 = !DILocation(line: 95, column: 11, scope: !200)
!254 = !DILocation(line: 96, column: 33, scope: !200)
!255 = !DILocation(line: 96, column: 36, scope: !200)
!256 = !DILocation(line: 96, column: 40, scope: !200)
