; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--mp3enc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--mp3enc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 49, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "./libavutil/crc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948, !949}
!941 = !DIEnumerator(name: "AV_CRC_8_ATM", value: 0)
!942 = !DIEnumerator(name: "AV_CRC_16_ANSI", value: 1)
!943 = !DIEnumerator(name: "AV_CRC_16_CCITT", value: 2)
!944 = !DIEnumerator(name: "AV_CRC_32_IEEE", value: 3)
!945 = !DIEnumerator(name: "AV_CRC_32_IEEE_LE", value: 4)
!946 = !DIEnumerator(name: "AV_CRC_16_ANSI_LE", value: 5)
!947 = !DIEnumerator(name: "AV_CRC_24_IEEE", value: 6)
!948 = !DIEnumerator(name: "AV_CRC_8_EBU", value: 7)
!949 = !DIEnumerator(name: "AV_CRC_MAX", value: 8)
!950 = !{!951, !952, !955, !956, !963, !964, !975, !981}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !953, line: 48, baseType: !954)
!953 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!954 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!955 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !959, line: 221, size: 32, align: 8, elements: !960)
!959 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!960 = !{!961}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !958, file: !959, line: 221, baseType: !962, size: 32, align: 32)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !953, line: 51, baseType: !955)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVReplayGain", file: !966, line: 48, baseType: !967)
!966 = !DIFile(filename: "./libavutil/replaygain.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVReplayGain", file: !966, line: 29, size: 128, align: 32, elements: !968)
!968 = !{!969, !972, !973, !974}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "track_gain", scope: !967, file: !966, line: 34, baseType: !970, size: 32, align: 32)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !953, line: 38, baseType: !971)
!971 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "track_peak", scope: !967, file: !966, line: 39, baseType: !962, size: 32, align: 32, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "album_gain", scope: !967, file: !966, line: 43, baseType: !970, size: 32, align: 32, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "album_peak", scope: !967, file: !966, line: 47, baseType: !962, size: 32, align: 32, offset: 96)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !959, line: 222, size: 16, align: 8, elements: !977)
!977 = !{!978}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !976, file: !959, line: 222, baseType: !979, size: 16, align: 16)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !953, line: 49, baseType: !980)
!980 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!982 = !{!983, !2282, !2283, !2287}
!983 = distinct !DIGlobalVariable(name: "ff_mp3_muxer", scope: !0, file: !984, line: 611, type: !985, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_mp3_muxer)
!984 = !DIFile(filename: "libavformat/mp3enc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !987)
!987 = !{!988, !992, !993, !994, !995, !996, !997, !998, !999, !1009, !1090, !1092, !1093, !2247, !2248, !2249, !2253, !2257, !2261, !2262, !2267, !2268, !2269, !2270, !2271, !2272, !2276}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !986, file: !919, line: 498, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!991 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !986, file: !919, line: 504, baseType: !989, size: 64, align: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !986, file: !919, line: 505, baseType: !989, size: 64, align: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !986, file: !919, line: 506, baseType: !989, size: 64, align: 64, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !986, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !986, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !986, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !986, file: !919, line: 517, baseType: !971, size: 32, align: 32, offset: 352)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !986, file: !919, line: 523, baseType: !1000, size: 64, align: 64, offset: 384)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1005, line: 44, size: 64, align: 32, elements: !1006)
!1005 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1006 = !{!1007, !1008}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1004, file: !1005, line: 45, baseType: !3, size: 32, align: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1004, file: !1005, line: 46, baseType: !955, size: 32, align: 32, offset: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !986, file: !919, line: 526, baseType: !1010, size: 64, align: 64, offset: 448)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1014)
!1014 = !{!1015, !1016, !1020, !1049, !1050, !1051, !1052, !1056, !1062, !1064, !1068}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1013, file: !486, line: 72, baseType: !989, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1013, file: !486, line: 78, baseType: !1017, size: 64, align: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!989, !951}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1013, file: !486, line: 85, baseType: !1021, size: 64, align: 64, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1045, !1046, !1047, !1048}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1023, file: !464, line: 247, baseType: !989, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1023, file: !464, line: 253, baseType: !989, size: 64, align: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1023, file: !464, line: 259, baseType: !971, size: 32, align: 32, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1023, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1023, file: !464, line: 271, baseType: !1030, size: 64, align: 64, offset: 192)
!1030 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1023, file: !464, line: 265, size: 64, align: 64, elements: !1031)
!1031 = !{!1032, !1035, !1037, !1038}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1030, file: !464, line: 266, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !953, line: 40, baseType: !1034)
!1034 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1030, file: !464, line: 267, baseType: !1036, size: 64, align: 64)
!1036 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1030, file: !464, line: 268, baseType: !989, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1030, file: !464, line: 270, baseType: !1039, size: 64, align: 32)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1040, line: 61, baseType: !1041)
!1040 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1040, line: 58, size: 64, align: 32, elements: !1042)
!1042 = !{!1043, !1044}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1041, file: !1040, line: 59, baseType: !971, size: 32, align: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1041, file: !1040, line: 60, baseType: !971, size: 32, align: 32, offset: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1023, file: !464, line: 272, baseType: !1036, size: 64, align: 64, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1023, file: !464, line: 273, baseType: !1036, size: 64, align: 64, offset: 320)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1023, file: !464, line: 275, baseType: !971, size: 32, align: 32, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1023, file: !464, line: 300, baseType: !989, size: 64, align: 64, offset: 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1013, file: !486, line: 93, baseType: !971, size: 32, align: 32, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1013, file: !486, line: 99, baseType: !971, size: 32, align: 32, offset: 224)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1013, file: !486, line: 108, baseType: !971, size: 32, align: 32, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1013, file: !486, line: 113, baseType: !1053, size: 64, align: 64, offset: 320)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!951, !951, !951}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1013, file: !486, line: 123, baseType: !1057, size: 64, align: 64, offset: 384)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!1060, !1060}
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1013, file: !486, line: 130, baseType: !1063, size: 32, align: 32, offset: 448)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1013, file: !486, line: 136, baseType: !1065, size: 64, align: 64, offset: 512)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!1063, !951}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1013, file: !486, line: 142, baseType: !1069, size: 64, align: 64, offset: 576)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!971, !1072, !951, !989, !971}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1075)
!1075 = !{!1076, !1088, !1089}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1074, file: !464, line: 360, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1080)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1081)
!1081 = !{!1082, !1083, !1084, !1085, !1086, !1087}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1080, file: !464, line: 307, baseType: !989, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1080, file: !464, line: 313, baseType: !1036, size: 64, align: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1080, file: !464, line: 313, baseType: !1036, size: 64, align: 64, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1080, file: !464, line: 318, baseType: !1036, size: 64, align: 64, offset: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1080, file: !464, line: 318, baseType: !1036, size: 64, align: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1080, file: !464, line: 323, baseType: !971, size: 32, align: 32, offset: 320)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1074, file: !464, line: 364, baseType: !971, size: 32, align: 32, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1074, file: !464, line: 368, baseType: !971, size: 32, align: 32, offset: 96)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !986, file: !919, line: 535, baseType: !1091, size: 64, align: 64, offset: 512)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !986, file: !919, line: 539, baseType: !971, size: 32, align: 32, offset: 576)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !986, file: !919, line: 541, baseType: !1094, size: 64, align: 64, offset: 640)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!971, !1097}
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1099)
!1099 = !{!1100, !1101, !1196, !1197, !1198, !1264, !1265, !1266, !2101, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2155, !2156, !2157, !2158, !2159, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2210, !2211, !2214, !2215, !2216, !2217, !2218, !2219, !2224, !2225, !2226, !2227, !2235, !2236, !2240, !2244, !2245, !2246}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1098, file: !919, line: 1342, baseType: !1010, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1098, file: !919, line: 1349, baseType: !1102, size: 64, align: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1104)
!1104 = !{!1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1128, !1129, !1167, !1168, !1172, !1177, !1178, !1179, !1183, !1189, !1195}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1103, file: !919, line: 638, baseType: !989, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1103, file: !919, line: 645, baseType: !989, size: 64, align: 64, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1103, file: !919, line: 652, baseType: !971, size: 32, align: 32, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1103, file: !919, line: 659, baseType: !989, size: 64, align: 64, offset: 192)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1103, file: !919, line: 661, baseType: !1000, size: 64, align: 64, offset: 256)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1103, file: !919, line: 663, baseType: !1010, size: 64, align: 64, offset: 320)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1103, file: !919, line: 670, baseType: !989, size: 64, align: 64, offset: 384)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1103, file: !919, line: 679, baseType: !1102, size: 64, align: 64, offset: 448)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1103, file: !919, line: 684, baseType: !971, size: 32, align: 32, offset: 512)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1103, file: !919, line: 689, baseType: !971, size: 32, align: 32, offset: 544)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1103, file: !919, line: 696, baseType: !1116, size: 64, align: 64, offset: 576)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!971, !1119}
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1122)
!1122 = !{!1123, !1124, !1126, !1127}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1121, file: !919, line: 449, baseType: !989, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1121, file: !919, line: 450, baseType: !1125, size: 64, align: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1121, file: !919, line: 451, baseType: !971, size: 32, align: 32, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1121, file: !919, line: 452, baseType: !989, size: 64, align: 64, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1103, file: !919, line: 703, baseType: !1094, size: 64, align: 64, offset: 640)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1103, file: !919, line: 714, baseType: !1130, size: 64, align: 64, offset: 704)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!971, !1097, !1133}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1136)
!1136 = !{!1137, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1163, !1164, !1165, !1166}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1135, file: !4, line: 1451, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1140, line: 94, baseType: !1141)
!1140 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1140, line: 81, size: 192, align: 64, elements: !1142)
!1142 = !{!1143, !1147, !1148}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1141, file: !1140, line: 82, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1140, line: 73, baseType: !1146)
!1146 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1140, line: 73, flags: DIFlagFwdDecl)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1141, file: !1140, line: 89, baseType: !981, size: 64, align: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1141, file: !1140, line: 93, baseType: !971, size: 32, align: 32, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1135, file: !4, line: 1461, baseType: !1033, size: 64, align: 64, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1135, file: !4, line: 1467, baseType: !1033, size: 64, align: 64, offset: 128)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1135, file: !4, line: 1468, baseType: !981, size: 64, align: 64, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1135, file: !4, line: 1469, baseType: !971, size: 32, align: 32, offset: 256)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1135, file: !4, line: 1470, baseType: !971, size: 32, align: 32, offset: 288)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1135, file: !4, line: 1474, baseType: !971, size: 32, align: 32, offset: 320)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1135, file: !4, line: 1479, baseType: !1156, size: 64, align: 64, offset: 384)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1159)
!1159 = !{!1160, !1161, !1162}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1158, file: !4, line: 1412, baseType: !981, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1158, file: !4, line: 1413, baseType: !971, size: 32, align: 32, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1158, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1135, file: !4, line: 1480, baseType: !971, size: 32, align: 32, offset: 448)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1135, file: !4, line: 1486, baseType: !1033, size: 64, align: 64, offset: 512)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1135, file: !4, line: 1488, baseType: !1033, size: 64, align: 64, offset: 576)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1135, file: !4, line: 1497, baseType: !1033, size: 64, align: 64, offset: 640)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1103, file: !919, line: 720, baseType: !1094, size: 64, align: 64, offset: 768)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1103, file: !919, line: 730, baseType: !1169, size: 64, align: 64, offset: 832)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!971, !1097, !971, !1033, !971}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1103, file: !919, line: 737, baseType: !1173, size: 64, align: 64, offset: 896)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{!1033, !1097, !971, !1176, !1033}
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1103, file: !919, line: 744, baseType: !1094, size: 64, align: 64, offset: 960)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1103, file: !919, line: 750, baseType: !1094, size: 64, align: 64, offset: 1024)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1103, file: !919, line: 758, baseType: !1180, size: 64, align: 64, offset: 1088)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!971, !1097, !971, !1033, !1033, !1033, !971}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1103, file: !919, line: 764, baseType: !1184, size: 64, align: 64, offset: 1152)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!971, !1097, !1187}
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1103, file: !919, line: 770, baseType: !1190, size: 64, align: 64, offset: 1216)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!971, !1097, !1193}
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1103, file: !919, line: 776, baseType: !1190, size: 64, align: 64, offset: 1280)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1098, file: !919, line: 1356, baseType: !1091, size: 64, align: 64, offset: 128)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1098, file: !919, line: 1365, baseType: !951, size: 64, align: 64, offset: 192)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1098, file: !919, line: 1379, baseType: !1199, size: 64, align: 64, offset: 256)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !537, line: 352, baseType: !1201)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !537, line: 161, size: 2112, align: 64, elements: !1202)
!1202 = !{!1203, !1204, !1205, !1206, !1207, !1208, !1209, !1213, !1214, !1218, !1219, !1220, !1221, !1222, !1224, !1225, !1231, !1232, !1236, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1254, !1255, !1256, !1257, !1261, !1262, !1263}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1201, file: !537, line: 174, baseType: !1010, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1201, file: !537, line: 226, baseType: !1125, size: 64, align: 64, offset: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1201, file: !537, line: 227, baseType: !971, size: 32, align: 32, offset: 128)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1201, file: !537, line: 228, baseType: !1125, size: 64, align: 64, offset: 192)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1201, file: !537, line: 229, baseType: !1125, size: 64, align: 64, offset: 256)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1201, file: !537, line: 233, baseType: !951, size: 64, align: 64, offset: 320)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1201, file: !537, line: 235, baseType: !1210, size: 64, align: 64, offset: 384)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!971, !951, !981, !971}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1201, file: !537, line: 236, baseType: !1210, size: 64, align: 64, offset: 448)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1201, file: !537, line: 237, baseType: !1215, size: 64, align: 64, offset: 512)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!1033, !951, !1033, !971}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1201, file: !537, line: 238, baseType: !1033, size: 64, align: 64, offset: 576)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1201, file: !537, line: 239, baseType: !971, size: 32, align: 32, offset: 640)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1201, file: !537, line: 240, baseType: !971, size: 32, align: 32, offset: 672)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1201, file: !537, line: 241, baseType: !971, size: 32, align: 32, offset: 704)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1201, file: !537, line: 242, baseType: !1223, size: 64, align: 64, offset: 768)
!1223 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1201, file: !537, line: 243, baseType: !1125, size: 64, align: 64, offset: 832)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1201, file: !537, line: 244, baseType: !1226, size: 64, align: 64, offset: 896)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!1223, !1223, !1229, !955}
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1201, file: !537, line: 245, baseType: !971, size: 32, align: 32, offset: 960)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1201, file: !537, line: 249, baseType: !1233, size: 64, align: 64, offset: 1024)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!971, !951, !971}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1201, file: !537, line: 255, baseType: !1237, size: 64, align: 64, offset: 1088)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{!1033, !951, !971, !1033, !971}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1201, file: !537, line: 260, baseType: !971, size: 32, align: 32, offset: 1152)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1201, file: !537, line: 266, baseType: !1033, size: 64, align: 64, offset: 1216)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1201, file: !537, line: 273, baseType: !971, size: 32, align: 32, offset: 1280)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1201, file: !537, line: 279, baseType: !1033, size: 64, align: 64, offset: 1344)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1201, file: !537, line: 285, baseType: !971, size: 32, align: 32, offset: 1408)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1201, file: !537, line: 291, baseType: !971, size: 32, align: 32, offset: 1440)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1201, file: !537, line: 298, baseType: !971, size: 32, align: 32, offset: 1472)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1201, file: !537, line: 304, baseType: !971, size: 32, align: 32, offset: 1504)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1201, file: !537, line: 309, baseType: !989, size: 64, align: 64, offset: 1536)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1201, file: !537, line: 314, baseType: !989, size: 64, align: 64, offset: 1600)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1201, file: !537, line: 319, baseType: !1251, size: 64, align: 64, offset: 1664)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!971, !951, !981, !971, !536, !1033}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1201, file: !537, line: 326, baseType: !971, size: 32, align: 32, offset: 1728)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1201, file: !537, line: 331, baseType: !536, size: 32, align: 32, offset: 1760)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1201, file: !537, line: 332, baseType: !1033, size: 64, align: 64, offset: 1792)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1201, file: !537, line: 338, baseType: !1258, size: 64, align: 64, offset: 1856)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!971, !951}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1201, file: !537, line: 340, baseType: !1033, size: 64, align: 64, offset: 1920)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1201, file: !537, line: 346, baseType: !1125, size: 64, align: 64, offset: 1984)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1201, file: !537, line: 351, baseType: !971, size: 32, align: 32, offset: 2048)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1098, file: !919, line: 1386, baseType: !971, size: 32, align: 32, offset: 320)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1098, file: !919, line: 1393, baseType: !955, size: 32, align: 32, offset: 352)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1098, file: !919, line: 1405, baseType: !1267, size: 64, align: 64, offset: 384)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1271)
!1271 = !{!1272, !1273, !1274, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !2026, !2032, !2033, !2037, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2069, !2070, !2071, !2072, !2073, !2074}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1270, file: !919, line: 866, baseType: !971, size: 32, align: 32)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1270, file: !919, line: 872, baseType: !971, size: 32, align: 32, offset: 32)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1270, file: !919, line: 878, baseType: !1275, size: 64, align: 64, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1277)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1278)
!1278 = !{!1279, !1280, !1281, !1282, !1507, !1508, !1509, !1510, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1663, !1667, !1668, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1847, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1277, file: !4, line: 1561, baseType: !1010, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1277, file: !4, line: 1562, baseType: !971, size: 32, align: 32, offset: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1277, file: !4, line: 1564, baseType: !545, size: 32, align: 32, offset: 96)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1277, file: !4, line: 1565, baseType: !1283, size: 64, align: 64, offset: 128)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1285)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1286)
!1286 = !{!1287, !1288, !1289, !1290, !1291, !1292, !1295, !1298, !1301, !1304, !1308, !1309, !1310, !1318, !1319, !1320, !1322, !1326, !1332, !1341, !1345, !1346, !1391, !1478, !1482, !1483, !1487, !1491, !1496, !1500, !1501, !1502}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1285, file: !4, line: 3475, baseType: !989, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1285, file: !4, line: 3480, baseType: !989, size: 64, align: 64, offset: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1285, file: !4, line: 3481, baseType: !545, size: 32, align: 32, offset: 128)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1285, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1285, file: !4, line: 3487, baseType: !971, size: 32, align: 32, offset: 192)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1285, file: !4, line: 3488, baseType: !1293, size: 64, align: 64, offset: 256)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1285, file: !4, line: 3489, baseType: !1296, size: 64, align: 64, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1285, file: !4, line: 3490, baseType: !1299, size: 64, align: 64, offset: 384)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1285, file: !4, line: 3491, baseType: !1302, size: 64, align: 64, offset: 448)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1285, file: !4, line: 3492, baseType: !1305, size: 64, align: 64, offset: 512)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1307)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !953, line: 55, baseType: !1223)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1285, file: !4, line: 3493, baseType: !952, size: 8, align: 8, offset: 576)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1285, file: !4, line: 3494, baseType: !1010, size: 64, align: 64, offset: 640)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1285, file: !4, line: 3495, baseType: !1311, size: 64, align: 64, offset: 704)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1313)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1314)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1315)
!1315 = !{!1316, !1317}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1314, file: !4, line: 3402, baseType: !971, size: 32, align: 32)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1314, file: !4, line: 3403, baseType: !989, size: 64, align: 64, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1285, file: !4, line: 3507, baseType: !989, size: 64, align: 64, offset: 768)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1285, file: !4, line: 3516, baseType: !971, size: 32, align: 32, offset: 832)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1285, file: !4, line: 3517, baseType: !1321, size: 64, align: 64, offset: 896)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1285, file: !4, line: 3527, baseType: !1323, size: 64, align: 64, offset: 960)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{!971, !1275}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1285, file: !4, line: 3535, baseType: !1327, size: 64, align: 64, offset: 1024)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!971, !1275, !1330}
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1276)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1285, file: !4, line: 3541, baseType: !1333, size: 64, align: 64, offset: 1088)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1335)
!1335 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1336)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1337, line: 223, size: 128, align: 64, elements: !1338)
!1337 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1338 = !{!1339, !1340}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1336, file: !1337, line: 224, baseType: !1229, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1336, file: !1337, line: 225, baseType: !1229, size: 64, align: 64, offset: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1285, file: !4, line: 3549, baseType: !1342, size: 64, align: 64, offset: 1152)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{null, !1321}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1285, file: !4, line: 3551, baseType: !1323, size: 64, align: 64, offset: 1216)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1285, file: !4, line: 3552, baseType: !1347, size: 64, align: 64, offset: 1280)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DISubroutineType(types: !1349)
!1349 = !{!971, !1275, !981, !971, !1350}
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1352)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1353)
!1353 = !{!1354, !1355, !1356, !1357, !1358, !1390}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1352, file: !4, line: 3921, baseType: !979, size: 16, align: 16)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1352, file: !4, line: 3922, baseType: !962, size: 32, align: 32, offset: 32)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1352, file: !4, line: 3923, baseType: !962, size: 32, align: 32, offset: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1352, file: !4, line: 3924, baseType: !955, size: 32, align: 32, offset: 96)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1352, file: !4, line: 3925, baseType: !1359, size: 64, align: 64, offset: 128)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1362)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1363)
!1363 = !{!1364, !1365, !1366, !1367, !1368, !1369, !1379, !1383, !1385, !1386, !1388, !1389}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1362, file: !4, line: 3886, baseType: !971, size: 32, align: 32)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1362, file: !4, line: 3887, baseType: !971, size: 32, align: 32, offset: 32)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1362, file: !4, line: 3888, baseType: !971, size: 32, align: 32, offset: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1362, file: !4, line: 3889, baseType: !971, size: 32, align: 32, offset: 96)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1362, file: !4, line: 3890, baseType: !971, size: 32, align: 32, offset: 128)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1362, file: !4, line: 3897, baseType: !1370, size: 768, align: 64, offset: 192)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1371)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1372)
!1372 = !{!1373, !1377}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1371, file: !4, line: 3855, baseType: !1374, size: 512, align: 64)
!1374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 512, align: 64, elements: !1375)
!1375 = !{!1376}
!1376 = !DISubrange(count: 8)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1371, file: !4, line: 3857, baseType: !1378, size: 256, align: 32, offset: 512)
!1378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 256, align: 32, elements: !1375)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1362, file: !4, line: 3903, baseType: !1380, size: 256, align: 64, offset: 960)
!1380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 256, align: 64, elements: !1381)
!1381 = !{!1382}
!1382 = !DISubrange(count: 4)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1362, file: !4, line: 3904, baseType: !1384, size: 128, align: 32, offset: 1216)
!1384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 128, align: 32, elements: !1381)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1362, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1362, file: !4, line: 3908, baseType: !1387, size: 64, align: 64, offset: 1408)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1362, file: !4, line: 3915, baseType: !1387, size: 64, align: 64, offset: 1472)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1362, file: !4, line: 3917, baseType: !971, size: 32, align: 32, offset: 1536)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1352, file: !4, line: 3926, baseType: !1033, size: 64, align: 64, offset: 192)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1285, file: !4, line: 3564, baseType: !1392, size: 64, align: 64, offset: 1344)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DISubroutineType(types: !1394)
!1394 = !{!971, !1275, !1133, !1395, !1477}
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1397)
!1397 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1398)
!1398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1399)
!1399 = !{!1400, !1401, !1402, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1429, !1431, !1432, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1465, !1466, !1467, !1468, !1469, !1470, !1473, !1474, !1475, !1476}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1398, file: !789, line: 282, baseType: !1374, size: 512, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1398, file: !789, line: 299, baseType: !1378, size: 256, align: 32, offset: 512)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1398, file: !789, line: 315, baseType: !1403, size: 64, align: 64, offset: 768)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1398, file: !789, line: 326, baseType: !971, size: 32, align: 32, offset: 832)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1398, file: !789, line: 326, baseType: !971, size: 32, align: 32, offset: 864)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1398, file: !789, line: 334, baseType: !971, size: 32, align: 32, offset: 896)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1398, file: !789, line: 341, baseType: !971, size: 32, align: 32, offset: 928)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1398, file: !789, line: 346, baseType: !971, size: 32, align: 32, offset: 960)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1398, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1398, file: !789, line: 356, baseType: !1039, size: 64, align: 32, offset: 1024)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1398, file: !789, line: 361, baseType: !1033, size: 64, align: 64, offset: 1088)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1398, file: !789, line: 369, baseType: !1033, size: 64, align: 64, offset: 1152)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1398, file: !789, line: 377, baseType: !1033, size: 64, align: 64, offset: 1216)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1398, file: !789, line: 382, baseType: !971, size: 32, align: 32, offset: 1280)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1398, file: !789, line: 386, baseType: !971, size: 32, align: 32, offset: 1312)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1398, file: !789, line: 391, baseType: !971, size: 32, align: 32, offset: 1344)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1398, file: !789, line: 396, baseType: !951, size: 64, align: 64, offset: 1408)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1398, file: !789, line: 403, baseType: !1419, size: 512, align: 64, offset: 1472)
!1419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1307, size: 512, align: 64, elements: !1375)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1398, file: !789, line: 410, baseType: !971, size: 32, align: 32, offset: 1984)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1398, file: !789, line: 415, baseType: !971, size: 32, align: 32, offset: 2016)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1398, file: !789, line: 420, baseType: !971, size: 32, align: 32, offset: 2048)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1398, file: !789, line: 425, baseType: !971, size: 32, align: 32, offset: 2080)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1398, file: !789, line: 435, baseType: !1033, size: 64, align: 64, offset: 2112)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1398, file: !789, line: 440, baseType: !971, size: 32, align: 32, offset: 2176)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1398, file: !789, line: 445, baseType: !1307, size: 64, align: 64, offset: 2240)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1398, file: !789, line: 459, baseType: !1428, size: 512, align: 64, offset: 2304)
!1428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1138, size: 512, align: 64, elements: !1375)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1398, file: !789, line: 473, baseType: !1430, size: 64, align: 64, offset: 2816)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1398, file: !789, line: 477, baseType: !971, size: 32, align: 32, offset: 2880)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1398, file: !789, line: 479, baseType: !1433, size: 64, align: 64, offset: 2944)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1436)
!1436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1437)
!1437 = !{!1438, !1439, !1440, !1441, !1446}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1436, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1436, file: !789, line: 203, baseType: !981, size: 64, align: 64, offset: 64)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1436, file: !789, line: 204, baseType: !971, size: 32, align: 32, offset: 128)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1436, file: !789, line: 205, baseType: !1442, size: 64, align: 64, offset: 192)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1444, line: 86, baseType: !1445)
!1444 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1445 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1444, line: 86, flags: DIFlagFwdDecl)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1436, file: !789, line: 206, baseType: !1138, size: 64, align: 64, offset: 256)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1398, file: !789, line: 480, baseType: !971, size: 32, align: 32, offset: 3008)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1398, file: !789, line: 505, baseType: !971, size: 32, align: 32, offset: 3040)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1398, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1398, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1398, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1398, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1398, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1398, file: !789, line: 532, baseType: !1033, size: 64, align: 64, offset: 3264)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1398, file: !789, line: 539, baseType: !1033, size: 64, align: 64, offset: 3328)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1398, file: !789, line: 547, baseType: !1033, size: 64, align: 64, offset: 3392)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1398, file: !789, line: 554, baseType: !1442, size: 64, align: 64, offset: 3456)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1398, file: !789, line: 563, baseType: !971, size: 32, align: 32, offset: 3520)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1398, file: !789, line: 572, baseType: !971, size: 32, align: 32, offset: 3552)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1398, file: !789, line: 581, baseType: !971, size: 32, align: 32, offset: 3584)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1398, file: !789, line: 588, baseType: !1462, size: 64, align: 64, offset: 3648)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !953, line: 36, baseType: !1464)
!1464 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1398, file: !789, line: 593, baseType: !971, size: 32, align: 32, offset: 3712)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1398, file: !789, line: 596, baseType: !971, size: 32, align: 32, offset: 3744)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1398, file: !789, line: 599, baseType: !1138, size: 64, align: 64, offset: 3776)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1398, file: !789, line: 605, baseType: !1138, size: 64, align: 64, offset: 3840)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1398, file: !789, line: 616, baseType: !1138, size: 64, align: 64, offset: 3904)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1398, file: !789, line: 626, baseType: !1471, size: 64, align: 64, offset: 3968)
!1471 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1472, line: 216, baseType: !1223)
!1472 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1398, file: !789, line: 627, baseType: !1471, size: 64, align: 64, offset: 4032)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1398, file: !789, line: 628, baseType: !1471, size: 64, align: 64, offset: 4096)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1398, file: !789, line: 629, baseType: !1471, size: 64, align: 64, offset: 4160)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1398, file: !789, line: 645, baseType: !1138, size: 64, align: 64, offset: 4224)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1285, file: !4, line: 3566, baseType: !1479, size: 64, align: 64, offset: 1408)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{!971, !1275, !951, !1477, !1133}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1285, file: !4, line: 3567, baseType: !1323, size: 64, align: 64, offset: 1472)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1285, file: !4, line: 3576, baseType: !1484, size: 64, align: 64, offset: 1536)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{!971, !1275, !1395}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1285, file: !4, line: 3577, baseType: !1488, size: 64, align: 64, offset: 1600)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{!971, !1275, !1133}
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1285, file: !4, line: 3584, baseType: !1492, size: 64, align: 64, offset: 1664)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DISubroutineType(types: !1494)
!1494 = !{!971, !1275, !1495}
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1285, file: !4, line: 3589, baseType: !1497, size: 64, align: 64, offset: 1728)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{null, !1275}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1285, file: !4, line: 3594, baseType: !971, size: 32, align: 32, offset: 1792)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1285, file: !4, line: 3600, baseType: !989, size: 64, align: 64, offset: 1856)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1285, file: !4, line: 3609, baseType: !1503, size: 64, align: 64, offset: 1920)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1506)
!1506 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1277, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1277, file: !4, line: 1581, baseType: !955, size: 32, align: 32, offset: 224)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1277, file: !4, line: 1583, baseType: !951, size: 64, align: 64, offset: 256)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1277, file: !4, line: 1591, baseType: !1511, size: 64, align: 64, offset: 320)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1337, line: 129, size: 1664, align: 64, elements: !1513)
!1513 = !{!1514, !1515, !1516, !1517, !1518, !1536, !1537, !1543, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1512, file: !1337, line: 136, baseType: !971, size: 32, align: 32)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1512, file: !1337, line: 151, baseType: !971, size: 32, align: 32, offset: 32)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1512, file: !1337, line: 157, baseType: !971, size: 32, align: 32, offset: 64)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1512, file: !1337, line: 159, baseType: !1495, size: 64, align: 64, offset: 128)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1512, file: !1337, line: 161, baseType: !1519, size: 64, align: 64, offset: 192)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1337, line: 117, baseType: !1521)
!1521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1337, line: 100, size: 832, align: 64, elements: !1522)
!1522 = !{!1523, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1521, file: !1337, line: 105, baseType: !1524, size: 256, align: 64)
!1524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1525, size: 256, align: 64, elements: !1381)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64, align: 64)
!1526 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1140, line: 238, baseType: !1527)
!1527 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1140, line: 238, flags: DIFlagFwdDecl)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1521, file: !1337, line: 110, baseType: !971, size: 32, align: 32, offset: 256)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1521, file: !1337, line: 111, baseType: !971, size: 32, align: 32, offset: 288)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1521, file: !1337, line: 111, baseType: !971, size: 32, align: 32, offset: 320)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1521, file: !1337, line: 112, baseType: !1378, size: 256, align: 32, offset: 352)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1521, file: !1337, line: 113, baseType: !1384, size: 128, align: 32, offset: 608)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1521, file: !1337, line: 114, baseType: !971, size: 32, align: 32, offset: 736)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1521, file: !1337, line: 115, baseType: !971, size: 32, align: 32, offset: 768)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1521, file: !1337, line: 116, baseType: !971, size: 32, align: 32, offset: 800)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1512, file: !1337, line: 163, baseType: !951, size: 64, align: 64, offset: 256)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1512, file: !1337, line: 165, baseType: !1538, size: 128, align: 64, offset: 320)
!1538 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1337, line: 122, baseType: !1539)
!1539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1337, line: 119, size: 128, align: 64, elements: !1540)
!1540 = !{!1541, !1542}
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1539, file: !1337, line: 120, baseType: !1133, size: 64, align: 64)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1539, file: !1337, line: 121, baseType: !1495, size: 64, align: 64, offset: 64)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1512, file: !1337, line: 166, baseType: !1544, size: 128, align: 64, offset: 448)
!1544 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1337, line: 127, baseType: !1545)
!1545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1337, line: 124, size: 128, align: 64, elements: !1546)
!1546 = !{!1547, !1620}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1545, file: !1337, line: 125, baseType: !1548, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64, align: 64)
!1550 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !1551)
!1551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !1552)
!1552 = !{!1553, !1554, !1578, !1582, !1583, !1617, !1618, !1619}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1551, file: !4, line: 5751, baseType: !1010, size: 64, align: 64)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1551, file: !4, line: 5756, baseType: !1555, size: 64, align: 64, offset: 64)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1557)
!1557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !1558)
!1558 = !{!1559, !1560, !1563, !1564, !1565, !1569, !1573, !1577}
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1557, file: !4, line: 5797, baseType: !989, size: 64, align: 64)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1557, file: !4, line: 5804, baseType: !1561, size: 64, align: 64, offset: 64)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1557, file: !4, line: 5815, baseType: !1010, size: 64, align: 64, offset: 128)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1557, file: !4, line: 5825, baseType: !971, size: 32, align: 32, offset: 192)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1557, file: !4, line: 5826, baseType: !1566, size: 64, align: 64, offset: 256)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64, align: 64)
!1567 = !DISubroutineType(types: !1568)
!1568 = !{!971, !1549}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1557, file: !4, line: 5827, baseType: !1570, size: 64, align: 64, offset: 320)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DISubroutineType(types: !1572)
!1572 = !{!971, !1549, !1133}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1557, file: !4, line: 5828, baseType: !1574, size: 64, align: 64, offset: 384)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DISubroutineType(types: !1576)
!1576 = !{null, !1549}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1557, file: !4, line: 5829, baseType: !1574, size: 64, align: 64, offset: 448)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1551, file: !4, line: 5762, baseType: !1579, size: 64, align: 64, offset: 128)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !1581)
!1581 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1551, file: !4, line: 5768, baseType: !951, size: 64, align: 64, offset: 192)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1551, file: !4, line: 5775, baseType: !1584, size: 64, align: 64, offset: 256)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !1586)
!1586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !1587)
!1587 = !{!1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1586, file: !4, line: 3940, baseType: !545, size: 32, align: 32)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1586, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1586, file: !4, line: 3948, baseType: !962, size: 32, align: 32, offset: 64)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1586, file: !4, line: 3958, baseType: !981, size: 64, align: 64, offset: 128)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1586, file: !4, line: 3962, baseType: !971, size: 32, align: 32, offset: 192)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1586, file: !4, line: 3968, baseType: !971, size: 32, align: 32, offset: 224)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1586, file: !4, line: 3973, baseType: !1033, size: 64, align: 64, offset: 256)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1586, file: !4, line: 3986, baseType: !971, size: 32, align: 32, offset: 320)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1586, file: !4, line: 3999, baseType: !971, size: 32, align: 32, offset: 352)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1586, file: !4, line: 4004, baseType: !971, size: 32, align: 32, offset: 384)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1586, file: !4, line: 4005, baseType: !971, size: 32, align: 32, offset: 416)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1586, file: !4, line: 4010, baseType: !971, size: 32, align: 32, offset: 448)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1586, file: !4, line: 4011, baseType: !971, size: 32, align: 32, offset: 480)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1586, file: !4, line: 4020, baseType: !1039, size: 64, align: 32, offset: 512)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1586, file: !4, line: 4025, baseType: !889, size: 32, align: 32, offset: 576)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1586, file: !4, line: 4030, baseType: !812, size: 32, align: 32, offset: 608)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1586, file: !4, line: 4031, baseType: !818, size: 32, align: 32, offset: 640)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1586, file: !4, line: 4032, baseType: !836, size: 32, align: 32, offset: 672)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1586, file: !4, line: 4033, baseType: !860, size: 32, align: 32, offset: 704)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1586, file: !4, line: 4034, baseType: !879, size: 32, align: 32, offset: 736)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1586, file: !4, line: 4039, baseType: !971, size: 32, align: 32, offset: 768)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1586, file: !4, line: 4046, baseType: !1307, size: 64, align: 64, offset: 832)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1586, file: !4, line: 4050, baseType: !971, size: 32, align: 32, offset: 896)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1586, file: !4, line: 4054, baseType: !971, size: 32, align: 32, offset: 928)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1586, file: !4, line: 4061, baseType: !971, size: 32, align: 32, offset: 960)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1586, file: !4, line: 4065, baseType: !971, size: 32, align: 32, offset: 992)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1586, file: !4, line: 4073, baseType: !971, size: 32, align: 32, offset: 1024)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1586, file: !4, line: 4080, baseType: !971, size: 32, align: 32, offset: 1056)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1586, file: !4, line: 4084, baseType: !971, size: 32, align: 32, offset: 1088)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1551, file: !4, line: 5781, baseType: !1584, size: 64, align: 64, offset: 320)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1551, file: !4, line: 5787, baseType: !1039, size: 64, align: 32, offset: 384)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1551, file: !4, line: 5793, baseType: !1039, size: 64, align: 32, offset: 448)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1545, file: !1337, line: 126, baseType: !971, size: 32, align: 32, offset: 64)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1512, file: !1337, line: 172, baseType: !1133, size: 64, align: 64, offset: 576)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1512, file: !1337, line: 177, baseType: !981, size: 64, align: 64, offset: 640)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1512, file: !1337, line: 178, baseType: !955, size: 32, align: 32, offset: 704)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1512, file: !1337, line: 180, baseType: !951, size: 64, align: 64, offset: 768)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1512, file: !1337, line: 185, baseType: !971, size: 32, align: 32, offset: 832)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1512, file: !1337, line: 190, baseType: !951, size: 64, align: 64, offset: 896)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1512, file: !1337, line: 195, baseType: !971, size: 32, align: 32, offset: 960)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1512, file: !1337, line: 200, baseType: !1133, size: 64, align: 64, offset: 1024)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1512, file: !1337, line: 201, baseType: !971, size: 32, align: 32, offset: 1088)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1512, file: !1337, line: 202, baseType: !1495, size: 64, align: 64, offset: 1152)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1512, file: !1337, line: 203, baseType: !971, size: 32, align: 32, offset: 1216)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1512, file: !1337, line: 205, baseType: !971, size: 32, align: 32, offset: 1248)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1512, file: !1337, line: 206, baseType: !971, size: 32, align: 32, offset: 1280)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1512, file: !1337, line: 209, baseType: !1471, size: 64, align: 64, offset: 1344)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1512, file: !1337, line: 212, baseType: !1471, size: 64, align: 64, offset: 1408)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1512, file: !1337, line: 213, baseType: !1495, size: 64, align: 64, offset: 1472)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1512, file: !1337, line: 215, baseType: !971, size: 32, align: 32, offset: 1536)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1512, file: !1337, line: 217, baseType: !971, size: 32, align: 32, offset: 1568)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1512, file: !1337, line: 220, baseType: !971, size: 32, align: 32, offset: 1600)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1277, file: !4, line: 1598, baseType: !951, size: 64, align: 64, offset: 384)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1277, file: !4, line: 1606, baseType: !1033, size: 64, align: 64, offset: 448)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1277, file: !4, line: 1614, baseType: !971, size: 32, align: 32, offset: 512)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1277, file: !4, line: 1622, baseType: !971, size: 32, align: 32, offset: 544)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1277, file: !4, line: 1628, baseType: !971, size: 32, align: 32, offset: 576)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1277, file: !4, line: 1636, baseType: !971, size: 32, align: 32, offset: 608)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1277, file: !4, line: 1643, baseType: !971, size: 32, align: 32, offset: 640)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1277, file: !4, line: 1657, baseType: !981, size: 64, align: 64, offset: 704)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1277, file: !4, line: 1658, baseType: !971, size: 32, align: 32, offset: 768)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1277, file: !4, line: 1679, baseType: !1039, size: 64, align: 32, offset: 800)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1277, file: !4, line: 1688, baseType: !971, size: 32, align: 32, offset: 864)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1277, file: !4, line: 1712, baseType: !971, size: 32, align: 32, offset: 896)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1277, file: !4, line: 1729, baseType: !971, size: 32, align: 32, offset: 928)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1277, file: !4, line: 1729, baseType: !971, size: 32, align: 32, offset: 960)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1277, file: !4, line: 1744, baseType: !971, size: 32, align: 32, offset: 992)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1277, file: !4, line: 1744, baseType: !971, size: 32, align: 32, offset: 1024)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1277, file: !4, line: 1751, baseType: !971, size: 32, align: 32, offset: 1056)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1277, file: !4, line: 1766, baseType: !555, size: 32, align: 32, offset: 1088)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1277, file: !4, line: 1791, baseType: !1659, size: 64, align: 64, offset: 1152)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DISubroutineType(types: !1661)
!1661 = !{null, !1662, !1395, !1477, !971, !971, !971}
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1277, file: !4, line: 1808, baseType: !1664, size: 64, align: 64, offset: 1216)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64, align: 64)
!1665 = !DISubroutineType(types: !1666)
!1666 = !{!555, !1662, !1296}
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1277, file: !4, line: 1816, baseType: !971, size: 32, align: 32, offset: 1280)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1277, file: !4, line: 1825, baseType: !1669, size: 32, align: 32, offset: 1312)
!1669 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1277, file: !4, line: 1830, baseType: !971, size: 32, align: 32, offset: 1344)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1277, file: !4, line: 1838, baseType: !1669, size: 32, align: 32, offset: 1376)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1277, file: !4, line: 1846, baseType: !971, size: 32, align: 32, offset: 1408)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1277, file: !4, line: 1851, baseType: !971, size: 32, align: 32, offset: 1440)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1277, file: !4, line: 1861, baseType: !1669, size: 32, align: 32, offset: 1472)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1277, file: !4, line: 1868, baseType: !1669, size: 32, align: 32, offset: 1504)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1277, file: !4, line: 1875, baseType: !1669, size: 32, align: 32, offset: 1536)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1277, file: !4, line: 1882, baseType: !1669, size: 32, align: 32, offset: 1568)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1277, file: !4, line: 1889, baseType: !1669, size: 32, align: 32, offset: 1600)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1277, file: !4, line: 1896, baseType: !1669, size: 32, align: 32, offset: 1632)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1277, file: !4, line: 1903, baseType: !1669, size: 32, align: 32, offset: 1664)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1277, file: !4, line: 1910, baseType: !971, size: 32, align: 32, offset: 1696)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1277, file: !4, line: 1915, baseType: !971, size: 32, align: 32, offset: 1728)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1277, file: !4, line: 1926, baseType: !1477, size: 64, align: 64, offset: 1792)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1277, file: !4, line: 1935, baseType: !1039, size: 64, align: 32, offset: 1856)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1277, file: !4, line: 1942, baseType: !971, size: 32, align: 32, offset: 1920)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1277, file: !4, line: 1948, baseType: !971, size: 32, align: 32, offset: 1952)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1277, file: !4, line: 1954, baseType: !971, size: 32, align: 32, offset: 1984)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1277, file: !4, line: 1960, baseType: !971, size: 32, align: 32, offset: 2016)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1277, file: !4, line: 1984, baseType: !971, size: 32, align: 32, offset: 2048)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1277, file: !4, line: 1991, baseType: !971, size: 32, align: 32, offset: 2080)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1277, file: !4, line: 1996, baseType: !971, size: 32, align: 32, offset: 2112)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1277, file: !4, line: 2004, baseType: !971, size: 32, align: 32, offset: 2144)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1277, file: !4, line: 2011, baseType: !971, size: 32, align: 32, offset: 2176)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1277, file: !4, line: 2018, baseType: !971, size: 32, align: 32, offset: 2208)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1277, file: !4, line: 2027, baseType: !971, size: 32, align: 32, offset: 2240)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1277, file: !4, line: 2034, baseType: !971, size: 32, align: 32, offset: 2272)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1277, file: !4, line: 2044, baseType: !971, size: 32, align: 32, offset: 2304)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1277, file: !4, line: 2054, baseType: !1699, size: 64, align: 64, offset: 2368)
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1277, file: !4, line: 2061, baseType: !1699, size: 64, align: 64, offset: 2432)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1277, file: !4, line: 2066, baseType: !971, size: 32, align: 32, offset: 2496)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1277, file: !4, line: 2070, baseType: !971, size: 32, align: 32, offset: 2528)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1277, file: !4, line: 2078, baseType: !971, size: 32, align: 32, offset: 2560)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1277, file: !4, line: 2085, baseType: !971, size: 32, align: 32, offset: 2592)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1277, file: !4, line: 2092, baseType: !971, size: 32, align: 32, offset: 2624)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1277, file: !4, line: 2099, baseType: !971, size: 32, align: 32, offset: 2656)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1277, file: !4, line: 2106, baseType: !971, size: 32, align: 32, offset: 2688)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1277, file: !4, line: 2113, baseType: !971, size: 32, align: 32, offset: 2720)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1277, file: !4, line: 2120, baseType: !971, size: 32, align: 32, offset: 2752)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1277, file: !4, line: 2125, baseType: !971, size: 32, align: 32, offset: 2784)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1277, file: !4, line: 2133, baseType: !971, size: 32, align: 32, offset: 2816)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1277, file: !4, line: 2140, baseType: !971, size: 32, align: 32, offset: 2848)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1277, file: !4, line: 2145, baseType: !971, size: 32, align: 32, offset: 2880)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1277, file: !4, line: 2153, baseType: !971, size: 32, align: 32, offset: 2912)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1277, file: !4, line: 2158, baseType: !971, size: 32, align: 32, offset: 2944)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1277, file: !4, line: 2166, baseType: !818, size: 32, align: 32, offset: 2976)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1277, file: !4, line: 2173, baseType: !836, size: 32, align: 32, offset: 3008)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1277, file: !4, line: 2180, baseType: !860, size: 32, align: 32, offset: 3040)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1277, file: !4, line: 2187, baseType: !812, size: 32, align: 32, offset: 3072)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1277, file: !4, line: 2194, baseType: !879, size: 32, align: 32, offset: 3104)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1277, file: !4, line: 2203, baseType: !971, size: 32, align: 32, offset: 3136)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1277, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1277, file: !4, line: 2212, baseType: !971, size: 32, align: 32, offset: 3200)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1277, file: !4, line: 2213, baseType: !971, size: 32, align: 32, offset: 3232)
