; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--bitstream_filters.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--bitstream_filters.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }
%struct.AVPacket = type { %struct.AVBufferRef*, i64, i64, i8*, i32, i32, i32, %struct.AVPacketSideData*, i32, i64, i64, i64 }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

!549 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!550 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!551 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !503, line: 493, size: 32, align: 32, elements: !552)
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569}
!553 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!554 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!555 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!556 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!557 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!558 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!559 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!560 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!561 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!562 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!563 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!564 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!565 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!566 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!567 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!568 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!569 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!570 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !503, line: 538, size: 32, align: 32, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579}
!572 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!573 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!574 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!575 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!576 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!577 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!578 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!579 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !4, line: 1175, size: 32, align: 32, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!582 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!583 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!584 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!585 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!586 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!587 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!588 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!589 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!590 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!591 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!592 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!593 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!594 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!595 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!596 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!597 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!598 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!599 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!600 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!601 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!602 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!603 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!604 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!605 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!606 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!607 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!608 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!609 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!610 = !{!611, !614}
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !612, line: 122, baseType: !613)
!612 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!613 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!615 = !{!616}
!616 = distinct !DIGlobalVariable(name: "bitstream_filters", scope: !0, file: !617, line: 1, type: !618, isLocal: true, isDefinition: true, variable: [33 x %struct.AVBitStreamFilter*]* @bitstream_filters)
!617 = !DIFile(filename: "./libavcodec/bsf_list.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 2112, align: 64, elements: !786)
!619 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64, align: 64)
!621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !624)
!624 = !{!625, !629, !632, !674, !675, !743, !781, !785}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !623, file: !4, line: 5797, baseType: !626, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64, align: 64)
!627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !628)
!628 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !623, file: !4, line: 5804, baseType: !630, size: 64, align: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !623, file: !4, line: 5815, baseType: !633, size: 64, align: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64, align: 64)
!634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !637)
!637 = !{!638, !639, !643, !647, !649, !650, !651, !655, !661, !663, !667}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !636, file: !464, line: 72, baseType: !626, size: 64, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !636, file: !464, line: 78, baseType: !640, size: 64, align: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64, align: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!626, !614}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !636, file: !464, line: 85, baseType: !644, size: 64, align: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !646)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !636, file: !464, line: 93, baseType: !648, size: 32, align: 32, offset: 192)
!648 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !636, file: !464, line: 99, baseType: !648, size: 32, align: 32, offset: 224)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !636, file: !464, line: 108, baseType: !648, size: 32, align: 32, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !636, file: !464, line: 113, baseType: !652, size: 64, align: 64, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64, align: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!614, !614, !614}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !636, file: !464, line: 123, baseType: !656, size: 64, align: 64, offset: 384)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64, align: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!659, !659}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !636)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !636, file: !464, line: 130, baseType: !662, size: 32, align: 32, offset: 448)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !636, file: !464, line: 136, baseType: !664, size: 64, align: 64, offset: 512)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64, align: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!662, !614}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !636, file: !464, line: 142, baseType: !668, size: 64, align: 64, offset: 576)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64, align: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!648, !671, !614, !626, !648}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64, align: 64)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !623, file: !4, line: 5825, baseType: !648, size: 32, align: 32, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !623, file: !4, line: 5826, baseType: !676, size: 64, align: 64, offset: 256)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64, align: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!648, !679}
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64, align: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !682)
!682 = !{!683, !684, !687, !691, !692, !740, !741, !742}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !681, file: !4, line: 5751, baseType: !633, size: 64, align: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !681, file: !4, line: 5756, baseType: !685, size: 64, align: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !681, file: !4, line: 5762, baseType: !688, size: 64, align: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !690)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !681, file: !4, line: 5768, baseType: !614, size: 64, align: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !681, file: !4, line: 5775, baseType: !693, size: 64, align: 64, offset: 256)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !696)
!696 = !{!697, !698, !699, !702, !706, !707, !708, !711, !712, !713, !714, !715, !716, !717, !724, !725, !726, !727, !728, !729, !730, !731, !733, !734, !735, !736, !737, !738, !739}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !695, file: !4, line: 3940, baseType: !484, size: 32, align: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !695, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !695, file: !4, line: 3948, baseType: !700, size: 32, align: 32, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !612, line: 51, baseType: !701)
!701 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !695, file: !4, line: 3958, baseType: !703, size: 64, align: 64, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64, align: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !612, line: 48, baseType: !705)
!705 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !695, file: !4, line: 3962, baseType: !648, size: 32, align: 32, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !695, file: !4, line: 3968, baseType: !648, size: 32, align: 32, offset: 224)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !695, file: !4, line: 3973, baseType: !709, size: 64, align: 64, offset: 256)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !612, line: 40, baseType: !710)
!710 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !695, file: !4, line: 3986, baseType: !648, size: 32, align: 32, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !695, file: !4, line: 3999, baseType: !648, size: 32, align: 32, offset: 352)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !695, file: !4, line: 4004, baseType: !648, size: 32, align: 32, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !695, file: !4, line: 4005, baseType: !648, size: 32, align: 32, offset: 416)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !695, file: !4, line: 4010, baseType: !648, size: 32, align: 32, offset: 448)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !695, file: !4, line: 4011, baseType: !648, size: 32, align: 32, offset: 480)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !695, file: !4, line: 4020, baseType: !718, size: 64, align: 32, offset: 512)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !719, line: 61, baseType: !720)
!719 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !719, line: 58, size: 64, align: 32, elements: !721)
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !720, file: !719, line: 59, baseType: !648, size: 32, align: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !720, file: !719, line: 60, baseType: !648, size: 32, align: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !695, file: !4, line: 4025, baseType: !494, size: 32, align: 32, offset: 576)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !695, file: !4, line: 4030, baseType: !502, size: 32, align: 32, offset: 608)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !695, file: !4, line: 4031, baseType: !509, size: 32, align: 32, offset: 640)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !695, file: !4, line: 4032, baseType: !527, size: 32, align: 32, offset: 672)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !695, file: !4, line: 4033, baseType: !551, size: 32, align: 32, offset: 704)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !695, file: !4, line: 4034, baseType: !570, size: 32, align: 32, offset: 736)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !695, file: !4, line: 4039, baseType: !648, size: 32, align: 32, offset: 768)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !695, file: !4, line: 4046, baseType: !732, size: 64, align: 64, offset: 832)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !612, line: 55, baseType: !613)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !695, file: !4, line: 4050, baseType: !648, size: 32, align: 32, offset: 896)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !695, file: !4, line: 4054, baseType: !648, size: 32, align: 32, offset: 928)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !695, file: !4, line: 4061, baseType: !648, size: 32, align: 32, offset: 960)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !695, file: !4, line: 4065, baseType: !648, size: 32, align: 32, offset: 992)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !695, file: !4, line: 4073, baseType: !648, size: 32, align: 32, offset: 1024)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !695, file: !4, line: 4080, baseType: !648, size: 32, align: 32, offset: 1056)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !695, file: !4, line: 4084, baseType: !648, size: 32, align: 32, offset: 1088)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !681, file: !4, line: 5781, baseType: !693, size: 64, align: 64, offset: 320)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !681, file: !4, line: 5787, baseType: !718, size: 64, align: 32, offset: 384)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !681, file: !4, line: 5793, baseType: !718, size: 64, align: 32, offset: 448)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !623, file: !4, line: 5827, baseType: !744, size: 64, align: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64, align: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!648, !679, !747}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64, align: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !750)
!750 = !{!751, !763, !764, !765, !766, !767, !768, !769, !777, !778, !779, !780}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !749, file: !4, line: 1451, baseType: !752, size: 64, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64, align: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !754, line: 94, baseType: !755)
!754 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !754, line: 81, size: 192, align: 64, elements: !756)
!756 = !{!757, !761, !762}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !755, file: !754, line: 82, baseType: !758, size: 64, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !754, line: 73, baseType: !760)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !754, line: 73, flags: DIFlagFwdDecl)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !755, file: !754, line: 89, baseType: !703, size: 64, align: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !755, file: !754, line: 93, baseType: !648, size: 32, align: 32, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !749, file: !4, line: 1461, baseType: !709, size: 64, align: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !749, file: !4, line: 1467, baseType: !709, size: 64, align: 64, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !749, file: !4, line: 1468, baseType: !703, size: 64, align: 64, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !749, file: !4, line: 1469, baseType: !648, size: 32, align: 32, offset: 256)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !749, file: !4, line: 1470, baseType: !648, size: 32, align: 32, offset: 288)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !749, file: !4, line: 1474, baseType: !648, size: 32, align: 32, offset: 320)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !749, file: !4, line: 1479, baseType: !770, size: 64, align: 64, offset: 384)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64, align: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !773)
!773 = !{!774, !775, !776}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !772, file: !4, line: 1412, baseType: !703, size: 64, align: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !772, file: !4, line: 1413, baseType: !648, size: 32, align: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !772, file: !4, line: 1414, baseType: !580, size: 32, align: 32, offset: 96)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !749, file: !4, line: 1480, baseType: !648, size: 32, align: 32, offset: 448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !749, file: !4, line: 1486, baseType: !709, size: 64, align: 64, offset: 512)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !749, file: !4, line: 1488, baseType: !709, size: 64, align: 64, offset: 576)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !749, file: !4, line: 1497, baseType: !709, size: 64, align: 64, offset: 640)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !623, file: !4, line: 5828, baseType: !782, size: 64, align: 64, offset: 384)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64, align: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{null, !679}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !623, file: !4, line: 5829, baseType: !782, size: 64, align: 64, offset: 448)
!786 = !{!787}
!787 = !DISubrange(count: 33)
!788 = !{i32 2, !"Dwarf Version", i32 4}
!789 = !{i32 2, !"Debug Info Version", i32 3}
!790 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!791 = distinct !DISubprogram(name: "av_bsf_iterate", scope: !792, file: !792, line: 62, type: !793, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !796)
!792 = !DIFile(filename: "libavcodec/bitstream_filters.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!793 = !DISubroutineType(types: !794)
!794 = !{!620, !795}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64, align: 64)
!796 = !{}
!797 = !DILocalVariable(name: "opaque", arg: 1, scope: !791, file: !792, line: 62, type: !795)
!798 = !DIExpression()
!799 = !DILocation(line: 62, column: 48, scope: !791)
!800 = !DILocalVariable(name: "i", scope: !791, file: !792, line: 64, type: !611)
!801 = !DILocation(line: 64, column: 15, scope: !791)
!802 = !DILocation(line: 64, column: 31, scope: !791)
!803 = !DILocation(line: 64, column: 30, scope: !791)
!804 = !DILocation(line: 64, column: 19, scope: !791)
!805 = !DILocalVariable(name: "f", scope: !791, file: !792, line: 65, type: !620)
!806 = !DILocation(line: 65, column: 30, scope: !791)
!807 = !DILocation(line: 65, column: 52, scope: !791)
!808 = !DILocation(line: 65, column: 34, scope: !791)
!809 = !DILocation(line: 67, column: 9, scope: !810)
!810 = distinct !DILexicalBlock(scope: !791, file: !792, line: 67, column: 9)
!811 = !DILocation(line: 67, column: 9, scope: !791)
!812 = !DILocation(line: 68, column: 27, scope: !810)
!813 = !DILocation(line: 68, column: 29, scope: !810)
!814 = !DILocation(line: 68, column: 19, scope: !810)
!815 = !DILocation(line: 68, column: 10, scope: !810)
!816 = !DILocation(line: 68, column: 17, scope: !810)
!817 = !DILocation(line: 68, column: 9, scope: !810)
!818 = !DILocation(line: 70, column: 12, scope: !791)
!819 = !DILocation(line: 70, column: 5, scope: !791)
!820 = distinct !DISubprogram(name: "av_bsf_next", scope: !792, file: !792, line: 74, type: !793, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !796)
!821 = !DILocalVariable(name: "opaque", arg: 1, scope: !820, file: !792, line: 74, type: !795)
!822 = !DILocation(line: 74, column: 45, scope: !820)
!823 = !DILocation(line: 75, column: 27, scope: !820)
!824 = !DILocation(line: 75, column: 12, scope: !820)
!825 = !DILocation(line: 75, column: 5, scope: !820)
!826 = distinct !DISubprogram(name: "av_bsf_get_by_name", scope: !792, file: !792, line: 79, type: !827, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !796)
!827 = !DISubroutineType(types: !828)
!828 = !{!620, !626}
!829 = !DILocalVariable(name: "name", arg: 1, scope: !826, file: !792, line: 79, type: !626)
!830 = !DILocation(line: 79, column: 57, scope: !826)
!831 = !DILocalVariable(name: "f", scope: !826, file: !792, line: 81, type: !620)
!832 = !DILocation(line: 81, column: 30, scope: !826)
!833 = !DILocalVariable(name: "i", scope: !826, file: !792, line: 82, type: !614)
!834 = !DILocation(line: 82, column: 11, scope: !826)
!835 = !DILocation(line: 84, column: 10, scope: !836)
!836 = distinct !DILexicalBlock(scope: !826, file: !792, line: 84, column: 9)
!837 = !DILocation(line: 84, column: 9, scope: !826)
!838 = !DILocation(line: 85, column: 9, scope: !836)
!839 = !DILocation(line: 87, column: 5, scope: !826)
!840 = !DILocation(line: 87, column: 17, scope: !841)
!841 = !DILexicalBlockFile(scope: !826, file: !792, discriminator: 1)
!842 = !DILocation(line: 87, column: 15, scope: !841)
!843 = !DILocation(line: 87, column: 5, scope: !841)
!844 = !DILocation(line: 88, column: 21, scope: !845)
