; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--vp9lpf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--vp9lpf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!893 = !DIEnumerator(name: "FILTER_BILINEAR", value: 3)
!894 = !DIEnumerator(name: "N_FILTERS", value: 4)
!895 = !DIEnumerator(name: "FILTER_SWITCHABLE", value: 4)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TxfmMode", file: !888, line: 27, size: 32, align: 32, elements: !897)
!897 = !{!898, !899, !900, !901, !902, !903, !904}
!898 = !DIEnumerator(name: "TX_4X4", value: 0)
!899 = !DIEnumerator(name: "TX_8X8", value: 1)
!900 = !DIEnumerator(name: "TX_16X16", value: 2)
!901 = !DIEnumerator(name: "TX_32X32", value: 3)
!902 = !DIEnumerator(name: "N_TXFM_SIZES", value: 4)
!903 = !DIEnumerator(name: "TX_SWITCHABLE", value: 4)
!904 = !DIEnumerator(name: "N_TXFM_MODES", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CompPredMode", file: !906, line: 48, size: 32, align: 32, elements: !907)
!906 = !DIFile(filename: "libavcodec/vp9shared.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!907 = !{!908, !909, !910}
!908 = !DIEnumerator(name: "PRED_SINGLEREF", value: 0)
!909 = !DIEnumerator(name: "PRED_COMPREF", value: 1)
!910 = !DIEnumerator(name: "PRED_SWITCHABLE", value: 2)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BlockSize", file: !906, line: 77, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926}
!913 = !DIEnumerator(name: "BS_64x64", value: 0)
!914 = !DIEnumerator(name: "BS_64x32", value: 1)
!915 = !DIEnumerator(name: "BS_32x64", value: 2)
!916 = !DIEnumerator(name: "BS_32x32", value: 3)
!917 = !DIEnumerator(name: "BS_32x16", value: 4)
!918 = !DIEnumerator(name: "BS_16x32", value: 5)
!919 = !DIEnumerator(name: "BS_16x16", value: 6)
!920 = !DIEnumerator(name: "BS_16x8", value: 7)
!921 = !DIEnumerator(name: "BS_8x16", value: 8)
!922 = !DIEnumerator(name: "BS_8x8", value: 9)
!923 = !DIEnumerator(name: "BS_8x4", value: 10)
!924 = !DIEnumerator(name: "BS_4x8", value: 11)
!925 = !DIEnumerator(name: "BS_4x4", value: 12)
!926 = !DIEnumerator(name: "N_BS_SIZES", value: 13)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BlockLevel", file: !906, line: 70, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "BL_64X64", value: 0)
!930 = !DIEnumerator(name: "BL_32X32", value: 1)
!931 = !DIEnumerator(name: "BL_16X16", value: 2)
!932 = !DIEnumerator(name: "BL_8X8", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BlockPartition", file: !906, line: 34, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937, !938}
!935 = !DIEnumerator(name: "PARTITION_NONE", value: 0)
!936 = !DIEnumerator(name: "PARTITION_H", value: 1)
!937 = !DIEnumerator(name: "PARTITION_V", value: 2)
!938 = !DIEnumerator(name: "PARTITION_SPLIT", value: 3)
!939 = !{i32 2, !"Dwarf Version", i32 4}
!940 = !{i32 2, !"Debug Info Version", i32 3}
!941 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!942 = distinct !DISubprogram(name: "ff_vp9_loopfilter_sb", scope: !943, file: !943, line: 178, type: !944, isLocal: false, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1561)
!943 = !DIFile(filename: "libavcodec/vp9lpf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!944 = !DISubroutineType(types: !945)
!945 = !{null, !946, !1547, !970, !970, !1560, !1560}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !949)
!949 = !{!950, !996, !997, !998, !1270, !1271, !1272, !1273, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1299, !1303, !1304, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1485, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !948, file: !35, line: 1561, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !955)
!955 = !{!956, !960, !965, !969, !971, !972, !973, !977, !983, !985, !989}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !954, file: !4, line: 72, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !954, file: !4, line: 78, baseType: !961, size: 64, align: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!957, !964}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !954, file: !4, line: 85, baseType: !966, size: 64, align: 64, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !954, file: !4, line: 93, baseType: !970, size: 32, align: 32, offset: 192)
!970 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !954, file: !4, line: 99, baseType: !970, size: 32, align: 32, offset: 224)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !954, file: !4, line: 108, baseType: !970, size: 32, align: 32, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !954, file: !4, line: 113, baseType: !974, size: 64, align: 64, offset: 320)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!964, !964, !964}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !954, file: !4, line: 123, baseType: !978, size: 64, align: 64, offset: 384)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!981, !981}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !954, file: !4, line: 130, baseType: !984, size: 32, align: 32, offset: 448)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !954, file: !4, line: 136, baseType: !986, size: 64, align: 64, offset: 512)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!984, !964}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !954, file: !4, line: 142, baseType: !990, size: 64, align: 64, offset: 576)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!970, !993, !964, !957, !970}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !948, file: !35, line: 1562, baseType: !970, size: 32, align: 32, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !948, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !948, file: !35, line: 1565, baseType: !999, size: 64, align: 64, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1006, !1007, !1008, !1017, !1020, !1023, !1026, !1032, !1035, !1036, !1044, !1045, !1046, !1048, !1052, !1058, !1063, !1067, !1068, !1120, !1241, !1245, !1246, !1250, !1254, !1259, !1263, !1264, !1265}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1001, file: !35, line: 3475, baseType: !957, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1001, file: !35, line: 3480, baseType: !957, size: 64, align: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1001, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1001, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1001, file: !35, line: 3487, baseType: !970, size: 32, align: 32, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1001, file: !35, line: 3488, baseType: !1009, size: 64, align: 64, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1011)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1012, line: 61, baseType: !1013)
!1012 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1012, line: 58, size: 64, align: 32, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1013, file: !1012, line: 59, baseType: !970, size: 32, align: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1013, file: !1012, line: 60, baseType: !970, size: 32, align: 32, offset: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1001, file: !35, line: 3489, baseType: !1018, size: 64, align: 64, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1001, file: !35, line: 3490, baseType: !1021, size: 64, align: 64, offset: 384)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1001, file: !35, line: 3491, baseType: !1024, size: 64, align: 64, offset: 448)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1001, file: !35, line: 3492, baseType: !1027, size: 64, align: 64, offset: 512)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1030, line: 55, baseType: !1031)
!1030 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1031 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1001, file: !35, line: 3493, baseType: !1033, size: 8, align: 8, offset: 576)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1030, line: 48, baseType: !1034)
!1034 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1001, file: !35, line: 3494, baseType: !951, size: 64, align: 64, offset: 640)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1001, file: !35, line: 3495, baseType: !1037, size: 64, align: 64, offset: 704)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1041)
!1041 = !{!1042, !1043}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1040, file: !35, line: 3402, baseType: !970, size: 32, align: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1040, file: !35, line: 3403, baseType: !957, size: 64, align: 64, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1001, file: !35, line: 3507, baseType: !957, size: 64, align: 64, offset: 768)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1001, file: !35, line: 3516, baseType: !970, size: 32, align: 32, offset: 832)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1001, file: !35, line: 3517, baseType: !1047, size: 64, align: 64, offset: 896)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1001, file: !35, line: 3527, baseType: !1049, size: 64, align: 64, offset: 960)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!970, !946}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1001, file: !35, line: 3535, baseType: !1053, size: 64, align: 64, offset: 1024)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!970, !946, !1056}
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1001, file: !35, line: 3541, baseType: !1059, size: 64, align: 64, offset: 1088)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1061)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1062)
!1062 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1001, file: !35, line: 3549, baseType: !1064, size: 64, align: 64, offset: 1152)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{null, !1047}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1001, file: !35, line: 3551, baseType: !1049, size: 64, align: 64, offset: 1216)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1001, file: !35, line: 3552, baseType: !1069, size: 64, align: 64, offset: 1280)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!970, !946, !1072, !970, !1073}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1075)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1076)
!1076 = !{!1077, !1080, !1083, !1084, !1085, !1117}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1075, file: !35, line: 3921, baseType: !1078, size: 16, align: 16)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1030, line: 49, baseType: !1079)
!1079 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1075, file: !35, line: 3922, baseType: !1081, size: 32, align: 32, offset: 32)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1030, line: 51, baseType: !1082)
!1082 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1075, file: !35, line: 3923, baseType: !1081, size: 32, align: 32, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1075, file: !35, line: 3924, baseType: !1082, size: 32, align: 32, offset: 96)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1075, file: !35, line: 3925, baseType: !1086, size: 64, align: 64, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1090)
!1090 = !{!1091, !1092, !1093, !1094, !1095, !1096, !1106, !1110, !1112, !1113, !1115, !1116}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1089, file: !35, line: 3886, baseType: !970, size: 32, align: 32)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1089, file: !35, line: 3887, baseType: !970, size: 32, align: 32, offset: 32)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1089, file: !35, line: 3888, baseType: !970, size: 32, align: 32, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1089, file: !35, line: 3889, baseType: !970, size: 32, align: 32, offset: 96)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1089, file: !35, line: 3890, baseType: !970, size: 32, align: 32, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1089, file: !35, line: 3897, baseType: !1097, size: 768, align: 64, offset: 192)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1099)
!1099 = !{!1100, !1104}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1098, file: !35, line: 3855, baseType: !1101, size: 512, align: 64)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 512, align: 64, elements: !1102)
!1102 = !{!1103}
!1103 = !DISubrange(count: 8)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1098, file: !35, line: 3857, baseType: !1105, size: 256, align: 32, offset: 512)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !970, size: 256, align: 32, elements: !1102)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1089, file: !35, line: 3903, baseType: !1107, size: 256, align: 64, offset: 960)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 256, align: 64, elements: !1108)
!1108 = !{!1109}
!1109 = !DISubrange(count: 4)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1089, file: !35, line: 3904, baseType: !1111, size: 128, align: 32, offset: 1216)
!1111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !970, size: 128, align: 32, elements: !1108)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1089, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1089, file: !35, line: 3908, baseType: !1114, size: 64, align: 64, offset: 1408)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1089, file: !35, line: 3915, baseType: !1114, size: 64, align: 64, offset: 1472)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1089, file: !35, line: 3917, baseType: !970, size: 32, align: 32, offset: 1536)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1075, file: !35, line: 3926, baseType: !1118, size: 64, align: 64, offset: 192)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1030, line: 40, baseType: !1119)
!1119 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1001, file: !35, line: 3564, baseType: !1121, size: 64, align: 64, offset: 1344)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!970, !946, !1124, !1158, !1240}
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1126)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1127)
!1127 = !{!1128, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1154, !1155, !1156, !1157}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1126, file: !35, line: 1451, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1131, line: 94, baseType: !1132)
!1131 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1131, line: 81, size: 192, align: 64, elements: !1133)
!1133 = !{!1134, !1138, !1139}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1132, file: !1131, line: 82, baseType: !1135, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1131, line: 73, baseType: !1137)
!1137 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1131, line: 73, flags: DIFlagFwdDecl)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1132, file: !1131, line: 89, baseType: !1072, size: 64, align: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1132, file: !1131, line: 93, baseType: !970, size: 32, align: 32, offset: 128)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1126, file: !35, line: 1461, baseType: !1118, size: 64, align: 64, offset: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1126, file: !35, line: 1467, baseType: !1118, size: 64, align: 64, offset: 128)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1126, file: !35, line: 1468, baseType: !1072, size: 64, align: 64, offset: 192)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1126, file: !35, line: 1469, baseType: !970, size: 32, align: 32, offset: 256)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1126, file: !35, line: 1470, baseType: !970, size: 32, align: 32, offset: 288)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1126, file: !35, line: 1474, baseType: !970, size: 32, align: 32, offset: 320)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1126, file: !35, line: 1479, baseType: !1147, size: 64, align: 64, offset: 384)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1149)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1150)
!1150 = !{!1151, !1152, !1153}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1149, file: !35, line: 1412, baseType: !1072, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1149, file: !35, line: 1413, baseType: !970, size: 32, align: 32, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1149, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1126, file: !35, line: 1480, baseType: !970, size: 32, align: 32, offset: 448)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1126, file: !35, line: 1486, baseType: !1118, size: 64, align: 64, offset: 512)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1126, file: !35, line: 1488, baseType: !1118, size: 64, align: 64, offset: 576)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1126, file: !35, line: 1497, baseType: !1118, size: 64, align: 64, offset: 640)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1160)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1162)
!1162 = !{!1163, !1164, !1165, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1192, !1194, !1195, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1228, !1229, !1230, !1231, !1232, !1233, !1236, !1237, !1238, !1239}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1161, file: !758, line: 282, baseType: !1101, size: 512, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1161, file: !758, line: 299, baseType: !1105, size: 256, align: 32, offset: 512)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1161, file: !758, line: 315, baseType: !1166, size: 64, align: 64, offset: 768)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1161, file: !758, line: 326, baseType: !970, size: 32, align: 32, offset: 832)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1161, file: !758, line: 326, baseType: !970, size: 32, align: 32, offset: 864)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1161, file: !758, line: 334, baseType: !970, size: 32, align: 32, offset: 896)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1161, file: !758, line: 341, baseType: !970, size: 32, align: 32, offset: 928)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1161, file: !758, line: 346, baseType: !970, size: 32, align: 32, offset: 960)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1161, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1161, file: !758, line: 356, baseType: !1011, size: 64, align: 32, offset: 1024)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1161, file: !758, line: 361, baseType: !1118, size: 64, align: 64, offset: 1088)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1161, file: !758, line: 369, baseType: !1118, size: 64, align: 64, offset: 1152)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1161, file: !758, line: 377, baseType: !1118, size: 64, align: 64, offset: 1216)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1161, file: !758, line: 382, baseType: !970, size: 32, align: 32, offset: 1280)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1161, file: !758, line: 386, baseType: !970, size: 32, align: 32, offset: 1312)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1161, file: !758, line: 391, baseType: !970, size: 32, align: 32, offset: 1344)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1161, file: !758, line: 396, baseType: !964, size: 64, align: 64, offset: 1408)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1161, file: !758, line: 403, baseType: !1182, size: 512, align: 64, offset: 1472)
!1182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1029, size: 512, align: 64, elements: !1102)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1161, file: !758, line: 410, baseType: !970, size: 32, align: 32, offset: 1984)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1161, file: !758, line: 415, baseType: !970, size: 32, align: 32, offset: 2016)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1161, file: !758, line: 420, baseType: !970, size: 32, align: 32, offset: 2048)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1161, file: !758, line: 425, baseType: !970, size: 32, align: 32, offset: 2080)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1161, file: !758, line: 435, baseType: !1118, size: 64, align: 64, offset: 2112)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1161, file: !758, line: 440, baseType: !970, size: 32, align: 32, offset: 2176)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1161, file: !758, line: 445, baseType: !1029, size: 64, align: 64, offset: 2240)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1161, file: !758, line: 459, baseType: !1191, size: 512, align: 64, offset: 2304)
!1191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1129, size: 512, align: 64, elements: !1102)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1161, file: !758, line: 473, baseType: !1193, size: 64, align: 64, offset: 2816)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1161, file: !758, line: 477, baseType: !970, size: 32, align: 32, offset: 2880)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1161, file: !758, line: 479, baseType: !1196, size: 64, align: 64, offset: 2944)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1200)
!1200 = !{!1201, !1202, !1203, !1204, !1209}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1199, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1199, file: !758, line: 203, baseType: !1072, size: 64, align: 64, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1199, file: !758, line: 204, baseType: !970, size: 32, align: 32, offset: 128)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1199, file: !758, line: 205, baseType: !1205, size: 64, align: 64, offset: 192)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1207, line: 86, baseType: !1208)
!1207 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1208 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1207, line: 86, flags: DIFlagFwdDecl)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1199, file: !758, line: 206, baseType: !1129, size: 64, align: 64, offset: 256)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1161, file: !758, line: 480, baseType: !970, size: 32, align: 32, offset: 3008)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1161, file: !758, line: 505, baseType: !970, size: 32, align: 32, offset: 3040)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1161, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1161, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1161, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1161, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1161, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1161, file: !758, line: 532, baseType: !1118, size: 64, align: 64, offset: 3264)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1161, file: !758, line: 539, baseType: !1118, size: 64, align: 64, offset: 3328)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1161, file: !758, line: 547, baseType: !1118, size: 64, align: 64, offset: 3392)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1161, file: !758, line: 554, baseType: !1205, size: 64, align: 64, offset: 3456)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1161, file: !758, line: 563, baseType: !970, size: 32, align: 32, offset: 3520)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1161, file: !758, line: 572, baseType: !970, size: 32, align: 32, offset: 3552)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1161, file: !758, line: 581, baseType: !970, size: 32, align: 32, offset: 3584)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1161, file: !758, line: 588, baseType: !1225, size: 64, align: 64, offset: 3648)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1030, line: 36, baseType: !1227)
!1227 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1161, file: !758, line: 593, baseType: !970, size: 32, align: 32, offset: 3712)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1161, file: !758, line: 596, baseType: !970, size: 32, align: 32, offset: 3744)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1161, file: !758, line: 599, baseType: !1129, size: 64, align: 64, offset: 3776)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1161, file: !758, line: 605, baseType: !1129, size: 64, align: 64, offset: 3840)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1161, file: !758, line: 616, baseType: !1129, size: 64, align: 64, offset: 3904)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1161, file: !758, line: 626, baseType: !1234, size: 64, align: 64, offset: 3968)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1235, line: 216, baseType: !1031)
!1235 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1161, file: !758, line: 627, baseType: !1234, size: 64, align: 64, offset: 4032)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1161, file: !758, line: 628, baseType: !1234, size: 64, align: 64, offset: 4096)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1161, file: !758, line: 629, baseType: !1234, size: 64, align: 64, offset: 4160)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1161, file: !758, line: 645, baseType: !1129, size: 64, align: 64, offset: 4224)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1001, file: !35, line: 3566, baseType: !1242, size: 64, align: 64, offset: 1408)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{!970, !946, !964, !1240, !1124}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1001, file: !35, line: 3567, baseType: !1049, size: 64, align: 64, offset: 1472)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1001, file: !35, line: 3576, baseType: !1247, size: 64, align: 64, offset: 1536)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!970, !946, !1158}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1001, file: !35, line: 3577, baseType: !1251, size: 64, align: 64, offset: 1600)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!970, !946, !1124}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1001, file: !35, line: 3584, baseType: !1255, size: 64, align: 64, offset: 1664)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!970, !946, !1258}
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1001, file: !35, line: 3589, baseType: !1260, size: 64, align: 64, offset: 1728)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{null, !946}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1001, file: !35, line: 3594, baseType: !970, size: 32, align: 32, offset: 1792)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1001, file: !35, line: 3600, baseType: !957, size: 64, align: 64, offset: 1856)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1001, file: !35, line: 3609, baseType: !1266, size: 64, align: 64, offset: 1920)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1269)
!1269 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !948, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !948, file: !35, line: 1581, baseType: !1082, size: 32, align: 32, offset: 224)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !948, file: !35, line: 1583, baseType: !964, size: 64, align: 64, offset: 256)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !948, file: !35, line: 1591, baseType: !1274, size: 64, align: 64, offset: 320)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !948, file: !35, line: 1598, baseType: !964, size: 64, align: 64, offset: 384)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !948, file: !35, line: 1606, baseType: !1118, size: 64, align: 64, offset: 448)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !948, file: !35, line: 1614, baseType: !970, size: 32, align: 32, offset: 512)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !948, file: !35, line: 1622, baseType: !970, size: 32, align: 32, offset: 544)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !948, file: !35, line: 1628, baseType: !970, size: 32, align: 32, offset: 576)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !948, file: !35, line: 1636, baseType: !970, size: 32, align: 32, offset: 608)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !948, file: !35, line: 1643, baseType: !970, size: 32, align: 32, offset: 640)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !948, file: !35, line: 1657, baseType: !1072, size: 64, align: 64, offset: 704)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !948, file: !35, line: 1658, baseType: !970, size: 32, align: 32, offset: 768)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !948, file: !35, line: 1679, baseType: !1011, size: 64, align: 32, offset: 800)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !948, file: !35, line: 1688, baseType: !970, size: 32, align: 32, offset: 864)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !948, file: !35, line: 1712, baseType: !970, size: 32, align: 32, offset: 896)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !948, file: !35, line: 1729, baseType: !970, size: 32, align: 32, offset: 928)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !948, file: !35, line: 1729, baseType: !970, size: 32, align: 32, offset: 960)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !948, file: !35, line: 1744, baseType: !970, size: 32, align: 32, offset: 992)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !948, file: !35, line: 1744, baseType: !970, size: 32, align: 32, offset: 1024)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !948, file: !35, line: 1751, baseType: !970, size: 32, align: 32, offset: 1056)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !948, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !948, file: !35, line: 1791, baseType: !1295, size: 64, align: 64, offset: 1152)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{null, !1298, !1158, !1240, !970, !970, !970}
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !948, file: !35, line: 1808, baseType: !1300, size: 64, align: 64, offset: 1216)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{!494, !1298, !1018}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !948, file: !35, line: 1816, baseType: !970, size: 32, align: 32, offset: 1280)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !948, file: !35, line: 1825, baseType: !1305, size: 32, align: 32, offset: 1312)
!1305 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !948, file: !35, line: 1830, baseType: !970, size: 32, align: 32, offset: 1344)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !948, file: !35, line: 1838, baseType: !1305, size: 32, align: 32, offset: 1376)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !948, file: !35, line: 1846, baseType: !970, size: 32, align: 32, offset: 1408)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !948, file: !35, line: 1851, baseType: !970, size: 32, align: 32, offset: 1440)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !948, file: !35, line: 1861, baseType: !1305, size: 32, align: 32, offset: 1472)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !948, file: !35, line: 1868, baseType: !1305, size: 32, align: 32, offset: 1504)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !948, file: !35, line: 1875, baseType: !1305, size: 32, align: 32, offset: 1536)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !948, file: !35, line: 1882, baseType: !1305, size: 32, align: 32, offset: 1568)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !948, file: !35, line: 1889, baseType: !1305, size: 32, align: 32, offset: 1600)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !948, file: !35, line: 1896, baseType: !1305, size: 32, align: 32, offset: 1632)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !948, file: !35, line: 1903, baseType: !1305, size: 32, align: 32, offset: 1664)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !948, file: !35, line: 1910, baseType: !970, size: 32, align: 32, offset: 1696)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !948, file: !35, line: 1915, baseType: !970, size: 32, align: 32, offset: 1728)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !948, file: !35, line: 1926, baseType: !1240, size: 64, align: 64, offset: 1792)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !948, file: !35, line: 1935, baseType: !1011, size: 64, align: 32, offset: 1856)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !948, file: !35, line: 1942, baseType: !970, size: 32, align: 32, offset: 1920)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !948, file: !35, line: 1948, baseType: !970, size: 32, align: 32, offset: 1952)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !948, file: !35, line: 1954, baseType: !970, size: 32, align: 32, offset: 1984)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !948, file: !35, line: 1960, baseType: !970, size: 32, align: 32, offset: 2016)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !948, file: !35, line: 1984, baseType: !970, size: 32, align: 32, offset: 2048)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !948, file: !35, line: 1991, baseType: !970, size: 32, align: 32, offset: 2080)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !948, file: !35, line: 1996, baseType: !970, size: 32, align: 32, offset: 2112)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !948, file: !35, line: 2004, baseType: !970, size: 32, align: 32, offset: 2144)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !948, file: !35, line: 2011, baseType: !970, size: 32, align: 32, offset: 2176)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !948, file: !35, line: 2018, baseType: !970, size: 32, align: 32, offset: 2208)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !948, file: !35, line: 2027, baseType: !970, size: 32, align: 32, offset: 2240)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !948, file: !35, line: 2034, baseType: !970, size: 32, align: 32, offset: 2272)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !948, file: !35, line: 2044, baseType: !970, size: 32, align: 32, offset: 2304)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !948, file: !35, line: 2054, baseType: !1335, size: 64, align: 64, offset: 2368)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !948, file: !35, line: 2061, baseType: !1335, size: 64, align: 64, offset: 2432)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !948, file: !35, line: 2066, baseType: !970, size: 32, align: 32, offset: 2496)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !948, file: !35, line: 2070, baseType: !970, size: 32, align: 32, offset: 2528)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !948, file: !35, line: 2078, baseType: !970, size: 32, align: 32, offset: 2560)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !948, file: !35, line: 2085, baseType: !970, size: 32, align: 32, offset: 2592)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !948, file: !35, line: 2092, baseType: !970, size: 32, align: 32, offset: 2624)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !948, file: !35, line: 2099, baseType: !970, size: 32, align: 32, offset: 2656)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !948, file: !35, line: 2106, baseType: !970, size: 32, align: 32, offset: 2688)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !948, file: !35, line: 2113, baseType: !970, size: 32, align: 32, offset: 2720)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !948, file: !35, line: 2120, baseType: !970, size: 32, align: 32, offset: 2752)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !948, file: !35, line: 2125, baseType: !970, size: 32, align: 32, offset: 2784)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !948, file: !35, line: 2133, baseType: !970, size: 32, align: 32, offset: 2816)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !948, file: !35, line: 2140, baseType: !970, size: 32, align: 32, offset: 2848)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !948, file: !35, line: 2145, baseType: !970, size: 32, align: 32, offset: 2880)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !948, file: !35, line: 2153, baseType: !970, size: 32, align: 32, offset: 2912)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !948, file: !35, line: 2158, baseType: !970, size: 32, align: 32, offset: 2944)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !948, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !948, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !948, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !948, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !948, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !948, file: !35, line: 2203, baseType: !970, size: 32, align: 32, offset: 3136)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !948, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !948, file: !35, line: 2212, baseType: !970, size: 32, align: 32, offset: 3200)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !948, file: !35, line: 2213, baseType: !970, size: 32, align: 32, offset: 3232)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !948, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !948, file: !35, line: 2232, baseType: !970, size: 32, align: 32, offset: 3296)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !948, file: !35, line: 2243, baseType: !970, size: 32, align: 32, offset: 3328)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !948, file: !35, line: 2249, baseType: !970, size: 32, align: 32, offset: 3360)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !948, file: !35, line: 2256, baseType: !970, size: 32, align: 32, offset: 3392)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !948, file: !35, line: 2263, baseType: !1029, size: 64, align: 64, offset: 3456)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !948, file: !35, line: 2270, baseType: !1029, size: 64, align: 64, offset: 3520)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !948, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !948, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !948, file: !35, line: 2367, baseType: !1371, size: 64, align: 64, offset: 3648)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DISubroutineType(types: !1373)
!1373 = !{!970, !1298, !1258, !970}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !948, file: !35, line: 2383, baseType: !970, size: 32, align: 32, offset: 3712)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !948, file: !35, line: 2386, baseType: !1305, size: 32, align: 32, offset: 3744)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !948, file: !35, line: 2387, baseType: !1305, size: 32, align: 32, offset: 3776)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !948, file: !35, line: 2394, baseType: !970, size: 32, align: 32, offset: 3808)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !948, file: !35, line: 2401, baseType: !970, size: 32, align: 32, offset: 3840)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !948, file: !35, line: 2408, baseType: !970, size: 32, align: 32, offset: 3872)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !948, file: !35, line: 2415, baseType: !970, size: 32, align: 32, offset: 3904)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !948, file: !35, line: 2422, baseType: !970, size: 32, align: 32, offset: 3936)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !948, file: !35, line: 2423, baseType: !1383, size: 64, align: 64, offset: 3968)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1385)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1386)
!1386 = !{!1387, !1388, !1389, !1390}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1385, file: !35, line: 827, baseType: !970, size: 32, align: 32)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1385, file: !35, line: 828, baseType: !970, size: 32, align: 32, offset: 32)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1385, file: !35, line: 829, baseType: !970, size: 32, align: 32, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1385, file: !35, line: 830, baseType: !1305, size: 32, align: 32, offset: 96)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !948, file: !35, line: 2430, baseType: !1118, size: 64, align: 64, offset: 4032)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !948, file: !35, line: 2437, baseType: !1118, size: 64, align: 64, offset: 4096)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !948, file: !35, line: 2444, baseType: !1305, size: 32, align: 32, offset: 4160)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !948, file: !35, line: 2451, baseType: !1305, size: 32, align: 32, offset: 4192)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !948, file: !35, line: 2458, baseType: !970, size: 32, align: 32, offset: 4224)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !948, file: !35, line: 2469, baseType: !970, size: 32, align: 32, offset: 4256)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !948, file: !35, line: 2475, baseType: !970, size: 32, align: 32, offset: 4288)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !948, file: !35, line: 2481, baseType: !970, size: 32, align: 32, offset: 4320)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !948, file: !35, line: 2485, baseType: !970, size: 32, align: 32, offset: 4352)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !948, file: !35, line: 2489, baseType: !970, size: 32, align: 32, offset: 4384)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !948, file: !35, line: 2493, baseType: !970, size: 32, align: 32, offset: 4416)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !948, file: !35, line: 2501, baseType: !970, size: 32, align: 32, offset: 4448)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !948, file: !35, line: 2506, baseType: !970, size: 32, align: 32, offset: 4480)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !948, file: !35, line: 2510, baseType: !970, size: 32, align: 32, offset: 4512)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !948, file: !35, line: 2514, baseType: !1118, size: 64, align: 64, offset: 4544)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !948, file: !35, line: 2528, baseType: !1407, size: 64, align: 64, offset: 4608)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DISubroutineType(types: !1409)
!1409 = !{null, !1298, !964, !970, !970}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !948, file: !35, line: 2534, baseType: !970, size: 32, align: 32, offset: 4672)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !948, file: !35, line: 2545, baseType: !970, size: 32, align: 32, offset: 4704)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !948, file: !35, line: 2547, baseType: !970, size: 32, align: 32, offset: 4736)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !948, file: !35, line: 2549, baseType: !970, size: 32, align: 32, offset: 4768)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !948, file: !35, line: 2551, baseType: !970, size: 32, align: 32, offset: 4800)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !948, file: !35, line: 2553, baseType: !970, size: 32, align: 32, offset: 4832)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !948, file: !35, line: 2555, baseType: !970, size: 32, align: 32, offset: 4864)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !948, file: !35, line: 2557, baseType: !970, size: 32, align: 32, offset: 4896)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !948, file: !35, line: 2559, baseType: !970, size: 32, align: 32, offset: 4928)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !948, file: !35, line: 2563, baseType: !970, size: 32, align: 32, offset: 4960)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !948, file: !35, line: 2571, baseType: !1114, size: 64, align: 64, offset: 4992)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !948, file: !35, line: 2579, baseType: !1114, size: 64, align: 64, offset: 5056)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !948, file: !35, line: 2586, baseType: !970, size: 32, align: 32, offset: 5120)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !948, file: !35, line: 2615, baseType: !970, size: 32, align: 32, offset: 5152)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !948, file: !35, line: 2627, baseType: !970, size: 32, align: 32, offset: 5184)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !948, file: !35, line: 2637, baseType: !970, size: 32, align: 32, offset: 5216)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !948, file: !35, line: 2681, baseType: !970, size: 32, align: 32, offset: 5248)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !948, file: !35, line: 2709, baseType: !1118, size: 64, align: 64, offset: 5312)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !948, file: !35, line: 2716, baseType: !1429, size: 64, align: 64, offset: 5376)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1431)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1432)
!1432 = !{!1433, !1434, !1435, !1436, !1437, !1438, !1439, !1445, !1449, !1450, !1451, !1452, !1458, !1459, !1460, !1461, !1462}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1431, file: !35, line: 3642, baseType: !957, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1431, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1431, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1431, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1431, file: !35, line: 3669, baseType: !970, size: 32, align: 32, offset: 160)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1431, file: !35, line: 3682, baseType: !1255, size: 64, align: 64, offset: 192)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1431, file: !35, line: 3698, baseType: !1440, size: 64, align: 64, offset: 256)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DISubroutineType(types: !1442)
!1442 = !{!970, !946, !1443, !1081}
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1033)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1431, file: !35, line: 3712, baseType: !1446, size: 64, align: 64, offset: 320)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DISubroutineType(types: !1448)
!1448 = !{!970, !946, !970, !1443, !1081}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1431, file: !35, line: 3726, baseType: !1440, size: 64, align: 64, offset: 384)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1431, file: !35, line: 3737, baseType: !1049, size: 64, align: 64, offset: 448)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1431, file: !35, line: 3746, baseType: !970, size: 32, align: 32, offset: 512)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1431, file: !35, line: 3757, baseType: !1453, size: 64, align: 64, offset: 576)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DISubroutineType(types: !1455)
!1455 = !{null, !1456}
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1431, file: !35, line: 3766, baseType: !1049, size: 64, align: 64, offset: 640)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1431, file: !35, line: 3774, baseType: !1049, size: 64, align: 64, offset: 704)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1431, file: !35, line: 3780, baseType: !970, size: 32, align: 32, offset: 768)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1431, file: !35, line: 3785, baseType: !970, size: 32, align: 32, offset: 800)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1431, file: !35, line: 3795, baseType: !1463, size: 64, align: 64, offset: 832)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DISubroutineType(types: !1465)
!1465 = !{!970, !946, !1129}
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !948, file: !35, line: 2728, baseType: !964, size: 64, align: 64, offset: 5440)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !948, file: !35, line: 2735, baseType: !1182, size: 512, align: 64, offset: 5504)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !948, file: !35, line: 2742, baseType: !970, size: 32, align: 32, offset: 6016)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !948, file: !35, line: 2755, baseType: !970, size: 32, align: 32, offset: 6048)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !948, file: !35, line: 2776, baseType: !970, size: 32, align: 32, offset: 6080)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !948, file: !35, line: 2783, baseType: !970, size: 32, align: 32, offset: 6112)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !948, file: !35, line: 2791, baseType: !970, size: 32, align: 32, offset: 6144)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !948, file: !35, line: 2802, baseType: !1258, size: 64, align: 64, offset: 6208)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !948, file: !35, line: 2811, baseType: !970, size: 32, align: 32, offset: 6272)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !948, file: !35, line: 2821, baseType: !970, size: 32, align: 32, offset: 6304)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !948, file: !35, line: 2830, baseType: !970, size: 32, align: 32, offset: 6336)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !948, file: !35, line: 2840, baseType: !970, size: 32, align: 32, offset: 6368)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !948, file: !35, line: 2851, baseType: !1479, size: 64, align: 64, offset: 6400)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{!970, !1298, !1482, !964, !1240, !970, !970}
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DISubroutineType(types: !1484)
!1484 = !{!970, !1298, !964}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !948, file: !35, line: 2871, baseType: !1486, size: 64, align: 64, offset: 6464)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DISubroutineType(types: !1488)
!1488 = !{!970, !1298, !1489, !964, !1240, !970}
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{!970, !1298, !964, !970, !970}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !948, file: !35, line: 2878, baseType: !970, size: 32, align: 32, offset: 6528)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !948, file: !35, line: 2885, baseType: !970, size: 32, align: 32, offset: 6560)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !948, file: !35, line: 3005, baseType: !970, size: 32, align: 32, offset: 6592)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !948, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !948, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !948, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !948, file: !35, line: 3037, baseType: !1072, size: 64, align: 64, offset: 6720)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !948, file: !35, line: 3038, baseType: !970, size: 32, align: 32, offset: 6784)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !948, file: !35, line: 3050, baseType: !1029, size: 64, align: 64, offset: 6848)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !948, file: !35, line: 3065, baseType: !970, size: 32, align: 32, offset: 6912)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !948, file: !35, line: 3083, baseType: !970, size: 32, align: 32, offset: 6944)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !948, file: !35, line: 3092, baseType: !1011, size: 64, align: 32, offset: 6976)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !948, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !948, file: !35, line: 3106, baseType: !1011, size: 64, align: 32, offset: 7072)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !948, file: !35, line: 3113, baseType: !1507, size: 64, align: 64, offset: 7168)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1509)
!1509 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1510)
!1510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1511)
!1511 = !{!1512, !1513, !1514, !1515, !1516, !1517, !1520}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1510, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1510, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1510, file: !35, line: 720, baseType: !957, size: 64, align: 64, offset: 64)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1510, file: !35, line: 724, baseType: !957, size: 64, align: 64, offset: 128)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1510, file: !35, line: 728, baseType: !970, size: 32, align: 32, offset: 192)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1510, file: !35, line: 734, baseType: !1518, size: 64, align: 64, offset: 256)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1510, file: !35, line: 739, baseType: !1521, size: 64, align: 64, offset: 320)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1040)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !948, file: !35, line: 3129, baseType: !1118, size: 64, align: 64, offset: 7232)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !948, file: !35, line: 3130, baseType: !1118, size: 64, align: 64, offset: 7296)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !948, file: !35, line: 3131, baseType: !1118, size: 64, align: 64, offset: 7360)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !948, file: !35, line: 3132, baseType: !1118, size: 64, align: 64, offset: 7424)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !948, file: !35, line: 3139, baseType: !1114, size: 64, align: 64, offset: 7488)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !948, file: !35, line: 3147, baseType: !970, size: 32, align: 32, offset: 7552)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !948, file: !35, line: 3165, baseType: !970, size: 32, align: 32, offset: 7584)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !948, file: !35, line: 3172, baseType: !970, size: 32, align: 32, offset: 7616)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !948, file: !35, line: 3180, baseType: !970, size: 32, align: 32, offset: 7648)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !948, file: !35, line: 3191, baseType: !1335, size: 64, align: 64, offset: 7680)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !948, file: !35, line: 3199, baseType: !1072, size: 64, align: 64, offset: 7744)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !948, file: !35, line: 3207, baseType: !1114, size: 64, align: 64, offset: 7808)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !948, file: !35, line: 3214, baseType: !1082, size: 32, align: 32, offset: 7872)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !948, file: !35, line: 3224, baseType: !1147, size: 64, align: 64, offset: 7936)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !948, file: !35, line: 3225, baseType: !970, size: 32, align: 32, offset: 8000)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !948, file: !35, line: 3249, baseType: !1129, size: 64, align: 64, offset: 8064)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !948, file: !35, line: 3256, baseType: !970, size: 32, align: 32, offset: 8128)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !948, file: !35, line: 3271, baseType: !970, size: 32, align: 32, offset: 8160)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !948, file: !35, line: 3279, baseType: !1118, size: 64, align: 64, offset: 8192)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !948, file: !35, line: 3301, baseType: !1129, size: 64, align: 64, offset: 8256)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !948, file: !35, line: 3310, baseType: !970, size: 32, align: 32, offset: 8320)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !948, file: !35, line: 3337, baseType: !970, size: 32, align: 32, offset: 8352)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !948, file: !35, line: 3351, baseType: !970, size: 32, align: 32, offset: 8384)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !948, file: !35, line: 3359, baseType: !970, size: 32, align: 32, offset: 8416)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP9Filter", file: !1549, line: 77, baseType: !1550)
!1549 = !DIFile(filename: "libavcodec/vp9dec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP9Filter", file: !1549, line: 73, size: 1536, align: 8, elements: !1551)
!1551 = !{!1552, !1556}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1550, file: !1549, line: 74, baseType: !1553, size: 512, align: 8)
!1553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 512, align: 8, elements: !1554)
!1554 = !{!1555}
!1555 = !DISubrange(count: 64)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1550, file: !1549, line: 75, baseType: !1557, size: 1024, align: 8, offset: 512)
!1557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 1024, align: 8, elements: !1558)
!1558 = !{!1559, !1559, !1103, !1109}
!1559 = !DISubrange(count: 2)
!1560 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1235, line: 149, baseType: !1119)
!1561 = !{}
!1562 = !DILocalVariable(name: "s", arg: 1, scope: !1563, file: !943, line: 101, type: !1566)
!1563 = distinct !DISubprogram(name: "filter_plane_rows", scope: !943, file: !943, line: 101, type: !1564, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1561)
!1564 = !DISubroutineType(types: !1565)
!1565 = !{null, !1566, !970, !970, !970, !1072, !2082, !1072, !1560}
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64, align: 64)
!1567 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP9Context", file: !1549, line: 155, baseType: !1568)
!1568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP9Context", file: !1549, line: 91, size: 150080, align: 64, elements: !1569)
!1569 = !{!1570, !1698, !1861, !1903, !1916, !1926, !1927, !1928, !1929, !1956, !1978, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !2003, !2055, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2075, !2076, !2077, !2078, !2080}
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !1568, file: !1549, line: 92, baseType: !1571, size: 6400, align: 64)
!1571 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP9SharedContext", file: !906, line: 167, baseType: !1572)
!1572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP9SharedContext", file: !906, line: 159, size: 6400, align: 64, elements: !1573)
!1573 = !{!1574, !1663, !1673}
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1572, file: !906, line: 160, baseType: !1575, size: 2400, align: 32)
!1575 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP9BitstreamHeader", file: !906, line: 157, baseType: !1576)
!1576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP9BitstreamHeader", file: !906, line: 94, size: 2400, align: 32, elements: !1577)
!1577 = !{!1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1597, !1598, !1599, !1602, !1607, !1616, !1617, !1618, !1619, !1620, !1621, !1652, !1653, !1654, !1661, !1662}
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1576, file: !906, line: 96, baseType: !1033, size: 8, align: 8)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "bpp", scope: !1576, file: !906, line: 97, baseType: !1033, size: 8, align: 8, offset: 8)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe", scope: !1576, file: !906, line: 98, baseType: !1033, size: 8, align: 8, offset: 16)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "invisible", scope: !1576, file: !906, line: 99, baseType: !1033, size: 8, align: 8, offset: 24)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "errorres", scope: !1576, file: !906, line: 100, baseType: !1033, size: 8, align: 8, offset: 32)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "intraonly", scope: !1576, file: !906, line: 101, baseType: !1033, size: 8, align: 8, offset: 40)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "resetctx", scope: !1576, file: !906, line: 102, baseType: !1033, size: 8, align: 8, offset: 48)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "refreshrefmask", scope: !1576, file: !906, line: 103, baseType: !1033, size: 8, align: 8, offset: 56)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "highprecisionmvs", scope: !1576, file: !906, line: 104, baseType: !1033, size: 8, align: 8, offset: 64)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "filtermode", scope: !1576, file: !906, line: 105, baseType: !887, size: 32, align: 32, offset: 96)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "allowcompinter", scope: !1576, file: !906, line: 106, baseType: !1033, size: 8, align: 8, offset: 128)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "refreshctx", scope: !1576, file: !906, line: 107, baseType: !1033, size: 8, align: 8, offset: 136)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "parallelmode", scope: !1576, file: !906, line: 108, baseType: !1033, size: 8, align: 8, offset: 144)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "framectxid", scope: !1576, file: !906, line: 109, baseType: !1033, size: 8, align: 8, offset: 152)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "use_last_frame_mvs", scope: !1576, file: !906, line: 110, baseType: !1033, size: 8, align: 8, offset: 160)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "refidx", scope: !1576, file: !906, line: 111, baseType: !1594, size: 24, align: 8, offset: 168)
!1594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 24, align: 8, elements: !1595)
!1595 = !{!1596}
!1596 = !DISubrange(count: 3)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "signbias", scope: !1576, file: !906, line: 112, baseType: !1594, size: 24, align: 8, offset: 192)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "fixcompref", scope: !1576, file: !906, line: 113, baseType: !1033, size: 8, align: 8, offset: 216)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "varcompref", scope: !1576, file: !906, line: 114, baseType: !1600, size: 16, align: 8, offset: 224)
!1600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 16, align: 8, elements: !1601)
!1601 = !{!1559}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1576, file: !906, line: 118, baseType: !1603, size: 16, align: 8, offset: 240)
!1603 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1576, file: !906, line: 115, size: 16, align: 8, elements: !1604)
!1604 = !{!1605, !1606}
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1603, file: !906, line: 116, baseType: !1033, size: 8, align: 8)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "sharpness", scope: !1603, file: !906, line: 117, baseType: !1226, size: 8, align: 8, offset: 8)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "lf_delta", scope: !1576, file: !906, line: 124, baseType: !1608, size: 64, align: 8, offset: 256)
!1608 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1576, file: !906, line: 119, size: 64, align: 8, elements: !1609)
!1609 = !{!1610, !1611, !1612, !1614}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !1608, file: !906, line: 120, baseType: !1033, size: 8, align: 8)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !1608, file: !906, line: 121, baseType: !1033, size: 8, align: 8, offset: 8)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1608, file: !906, line: 122, baseType: !1613, size: 16, align: 8, offset: 16)
!1613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1226, size: 16, align: 8, elements: !1601)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !1608, file: !906, line: 123, baseType: !1615, size: 32, align: 8, offset: 32)
!1615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1226, size: 32, align: 8, elements: !1108)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "yac_qi", scope: !1576, file: !906, line: 125, baseType: !1033, size: 8, align: 8, offset: 320)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "ydc_qdelta", scope: !1576, file: !906, line: 126, baseType: !1226, size: 8, align: 8, offset: 328)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "uvdc_qdelta", scope: !1576, file: !906, line: 126, baseType: !1226, size: 8, align: 8, offset: 336)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "uvac_qdelta", scope: !1576, file: !906, line: 126, baseType: !1226, size: 8, align: 8, offset: 344)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "lossless", scope: !1576, file: !906, line: 127, baseType: !1033, size: 8, align: 8, offset: 352)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "segmentation", scope: !1576, file: !906, line: 147, baseType: !1622, size: 1776, align: 16, offset: 368)
!1622 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1576, file: !906, line: 129, size: 1776, align: 16, elements: !1623)
!1623 = !{!1624, !1625, !1626, !1627, !1628, !1632, !1633}
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !1622, file: !906, line: 130, baseType: !1033, size: 8, align: 8)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "temporal", scope: !1622, file: !906, line: 131, baseType: !1033, size: 8, align: 8, offset: 8)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_vals", scope: !1622, file: !906, line: 132, baseType: !1033, size: 8, align: 8, offset: 16)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "update_map", scope: !1622, file: !906, line: 133, baseType: !1033, size: 8, align: 8, offset: 24)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "prob", scope: !1622, file: !906, line: 134, baseType: !1629, size: 56, align: 8, offset: 32)
!1629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 56, align: 8, elements: !1630)
!1630 = !{!1631}
!1631 = !DISubrange(count: 7)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "pred_prob", scope: !1622, file: !906, line: 135, baseType: !1594, size: 24, align: 8, offset: 88)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "feat", scope: !1622, file: !906, line: 146, baseType: !1634, size: 1664, align: 16, offset: 112)
!1634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1635, size: 1664, align: 16, elements: !1102)
!1635 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1622, file: !906, line: 136, size: 208, align: 16, elements: !1636)
!1636 = !{!1637, !1638, !1639, !1640, !1641, !1642, !1645, !1646, !1649}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "q_enabled", scope: !1635, file: !906, line: 137, baseType: !1033, size: 8, align: 8)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "lf_enabled", scope: !1635, file: !906, line: 138, baseType: !1033, size: 8, align: 8, offset: 8)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "ref_enabled", scope: !1635, file: !906, line: 139, baseType: !1033, size: 8, align: 8, offset: 16)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "skip_enabled", scope: !1635, file: !906, line: 140, baseType: !1033, size: 8, align: 8, offset: 24)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "ref_val", scope: !1635, file: !906, line: 141, baseType: !1033, size: 8, align: 8, offset: 32)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "q_val", scope: !1635, file: !906, line: 142, baseType: !1643, size: 16, align: 16, offset: 48)
!1643 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !1030, line: 37, baseType: !1644)
!1644 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "lf_val", scope: !1635, file: !906, line: 143, baseType: !1226, size: 8, align: 8, offset: 64)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "qmul", scope: !1635, file: !906, line: 144, baseType: !1647, size: 64, align: 16, offset: 80)
!1647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1643, size: 64, align: 16, elements: !1648)
!1648 = !{!1559, !1559}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "lflvl", scope: !1635, file: !906, line: 145, baseType: !1650, size: 64, align: 8, offset: 144)
!1650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 64, align: 8, elements: !1651)
!1651 = !{!1109, !1559}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "txfmmode", scope: !1576, file: !906, line: 148, baseType: !896, size: 32, align: 32, offset: 2144)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "comppredmode", scope: !1576, file: !906, line: 149, baseType: !905, size: 32, align: 32, offset: 2176)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "tiling", scope: !1576, file: !906, line: 153, baseType: !1655, size: 128, align: 32, offset: 2208)
!1655 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1576, file: !906, line: 150, size: 128, align: 32, elements: !1656)
!1656 = !{!1657, !1658, !1659, !1660}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "log2_tile_cols", scope: !1655, file: !906, line: 151, baseType: !1082, size: 32, align: 32)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "log2_tile_rows", scope: !1655, file: !906, line: 151, baseType: !1082, size: 32, align: 32, offset: 32)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "tile_cols", scope: !1655, file: !906, line: 152, baseType: !1082, size: 32, align: 32, offset: 64)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "tile_rows", scope: !1655, file: !906, line: 152, baseType: !1082, size: 32, align: 32, offset: 96)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_header_size", scope: !1576, file: !906, line: 155, baseType: !970, size: 32, align: 32, offset: 2336)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_header_size", scope: !1576, file: !906, line: 156, baseType: !970, size: 32, align: 32, offset: 2368)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1572, file: !906, line: 162, baseType: !1664, size: 2048, align: 64, offset: 2432)
!1664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1665, size: 2048, align: 64, elements: !1102)
!1665 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadFrame", file: !1666, line: 40, baseType: !1667)
!1666 = !DIFile(filename: "libavcodec/thread.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadFrame", file: !1666, line: 34, size: 256, align: 64, elements: !1668)
!1668 = !{!1669, !1670, !1672}
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1667, file: !1666, line: 35, baseType: !1258, size: 64, align: 64)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1667, file: !1666, line: 36, baseType: !1671, size: 128, align: 64, offset: 64)
!1671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, size: 128, align: 64, elements: !1601)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1667, file: !1666, line: 39, baseType: !1129, size: 64, align: 64, offset: 192)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1572, file: !906, line: 166, baseType: !1674, size: 1920, align: 64, offset: 4480)
!1674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1675, size: 1920, align: 64, elements: !1595)
!1675 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP9Frame", file: !906, line: 68, baseType: !1676)
!1676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP9Frame", file: !906, line: 59, size: 640, align: 64, elements: !1677)
!1677 = !{!1678, !1679, !1680, !1681, !1695, !1696, !1697}
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "tf", scope: !1676, file: !906, line: 60, baseType: !1665, size: 256, align: 64)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1676, file: !906, line: 61, baseType: !1129, size: 64, align: 64, offset: 256)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "segmentation_map", scope: !1676, file: !906, line: 62, baseType: !1072, size: 64, align: 64, offset: 320)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !1676, file: !906, line: 63, baseType: !1682, size: 64, align: 64, offset: 384)
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64, align: 64)
!1683 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP9mvrefPair", file: !906, line: 57, baseType: !1684)
!1684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP9mvrefPair", file: !906, line: 54, size: 96, align: 32, elements: !1685)
!1685 = !{!1686, !1694}
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !1684, file: !906, line: 55, baseType: !1687, size: 64, align: 32)
!1687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1688, size: 64, align: 32, elements: !1601)
!1688 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP56mv", file: !1689, line: 69, baseType: !1690)
!1689 = !DIFile(filename: "libavcodec/vp56.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP56mv", file: !1689, line: 66, size: 32, align: 32, elements: !1691)
!1691 = !{!1692, !1693}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1690, file: !1689, line: 67, baseType: !1643, size: 16, align: 16)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1690, file: !1689, line: 68, baseType: !1643, size: 16, align: 16, offset: 16)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !1684, file: !906, line: 56, baseType: !1613, size: 16, align: 8, offset: 64)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "uses_2pass", scope: !1676, file: !906, line: 64, baseType: !970, size: 32, align: 32, offset: 448)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_buf", scope: !1676, file: !906, line: 66, baseType: !1129, size: 64, align: 64, offset: 512)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_picture_private", scope: !1676, file: !906, line: 67, baseType: !964, size: 64, align: 64, offset: 576)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "td", scope: !1568, file: !1549, line: 93, baseType: !1699, size: 64, align: 64, offset: 6400)
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP9TileData", file: !1549, line: 89, baseType: !1701)
!1701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP9TileData", file: !1549, line: 157, size: 617216, align: 256, elements: !1702)
!1702 = !{!1703, !1704, !1714, !1715, !1716, !1717, !1718, !1719, !1721, !1722, !1723, !1744, !1745, !1746, !1813, !1817, !1821, !1822, !1825, !1828, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1841, !1844, !1849, !1850, !1852, !1853, !1855, !1856, !1857, !1859, !1860}
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !1701, file: !1549, line: 160, baseType: !1566, size: 64, align: 64)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "c_b", scope: !1701, file: !1549, line: 161, baseType: !1705, size: 64, align: 64, offset: 64)
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64, align: 64)
!1706 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP56RangeCoder", file: !1689, line: 92, baseType: !1707)
!1707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP56RangeCoder", file: !1689, line: 85, size: 256, align: 64, elements: !1708)
!1708 = !{!1709, !1710, !1711, !1712, !1713}
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1707, file: !1689, line: 86, baseType: !970, size: 32, align: 32)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1707, file: !1689, line: 87, baseType: !970, size: 32, align: 32, offset: 32)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1707, file: !1689, line: 89, baseType: !1443, size: 64, align: 64, offset: 64)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1707, file: !1689, line: 90, baseType: !1443, size: 64, align: 64, offset: 128)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "code_word", scope: !1707, file: !1689, line: 91, baseType: !1082, size: 32, align: 32, offset: 192)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1701, file: !1549, line: 162, baseType: !1705, size: 64, align: 64, offset: 128)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1701, file: !1549, line: 163, baseType: !970, size: 32, align: 32, offset: 192)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "row7", scope: !1701, file: !1549, line: 163, baseType: !970, size: 32, align: 32, offset: 224)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1701, file: !1549, line: 163, baseType: !970, size: 32, align: 32, offset: 256)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "col7", scope: !1701, file: !1549, line: 163, baseType: !970, size: 32, align: 32, offset: 288)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !1701, file: !1549, line: 164, baseType: !1720, size: 192, align: 64, offset: 320)
!1720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 192, align: 64, elements: !1595)
