; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--dfa.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--dfa.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProbeData = type { i8*, i8*, i32, i8* }

!868 = !{!869, !870, !871, !872, !873, !874}
!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !925, !926, !927}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !920, line: 221, size: 32, align: 8, elements: !921)
!920 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!921 = !{!922}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !919, file: !920, line: 221, baseType: !923, size: 32, align: 32)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !924, line: 51, baseType: !925)
!924 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!925 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!926 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!928 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !920, line: 222, size: 16, align: 8, elements: !929)
!929 = !{!930}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !928, file: !920, line: 222, baseType: !931, size: 16, align: 16)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !924, line: 49, baseType: !932)
!932 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!933 = !{!934}
!934 = distinct !DIGlobalVariable(name: "ff_dfa_demuxer", scope: !0, file: !935, line: 126, type: !936, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_dfa_demuxer)
!935 = !DIFile(filename: "libavformat/dfa.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !897, line: 777, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !938)
!938 = !{!939, !943, !944, !945, !946, !956, !998, !999, !1001, !1002, !1003, !1017, !2128, !2129, !2130, !2134, !2138, !2139, !2140, !2144, !2145, !2146}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !937, file: !897, line: 638, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!942 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !937, file: !897, line: 645, baseType: !940, size: 64, align: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !937, file: !897, line: 652, baseType: !926, size: 32, align: 32, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !937, file: !897, line: 659, baseType: !940, size: 64, align: 64, offset: 192)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !937, file: !897, line: 661, baseType: !947, size: 64, align: 64, offset: 256)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !952, line: 44, size: 64, align: 32, elements: !953)
!952 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!953 = !{!954, !955}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !951, file: !952, line: 45, baseType: !3, size: 32, align: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !951, file: !952, line: 46, baseType: !925, size: 32, align: 32, offset: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !937, file: !897, line: 663, baseType: !957, size: 64, align: 64, offset: 320)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !961)
!961 = !{!962, !963, !968, !972, !973, !974, !975, !979, !985, !987, !991}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !960, file: !464, line: 72, baseType: !940, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !960, file: !464, line: 78, baseType: !964, size: 64, align: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!940, !967}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !960, file: !464, line: 85, baseType: !969, size: 64, align: 64, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!971 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !960, file: !464, line: 93, baseType: !926, size: 32, align: 32, offset: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !960, file: !464, line: 99, baseType: !926, size: 32, align: 32, offset: 224)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !960, file: !464, line: 108, baseType: !926, size: 32, align: 32, offset: 256)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !960, file: !464, line: 113, baseType: !976, size: 64, align: 64, offset: 320)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!967, !967, !967}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !960, file: !464, line: 123, baseType: !980, size: 64, align: 64, offset: 384)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!983, !983}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !960, file: !464, line: 130, baseType: !986, size: 32, align: 32, offset: 448)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !960, file: !464, line: 136, baseType: !988, size: 64, align: 64, offset: 512)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!986, !967}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !960, file: !464, line: 142, baseType: !992, size: 64, align: 64, offset: 576)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!926, !995, !967, !940, !926}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !937, file: !897, line: 670, baseType: !940, size: 64, align: 64, offset: 384)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !937, file: !897, line: 679, baseType: !1000, size: 64, align: 64, offset: 448)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !937, file: !897, line: 684, baseType: !926, size: 32, align: 32, offset: 512)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !937, file: !897, line: 689, baseType: !926, size: 32, align: 32, offset: 544)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !937, file: !897, line: 696, baseType: !1004, size: 64, align: 64, offset: 576)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!926, !1007}
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1010)
!1010 = !{!1011, !1012, !1015, !1016}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1009, file: !897, line: 449, baseType: !940, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1009, file: !897, line: 450, baseType: !1013, size: 64, align: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1009, file: !897, line: 451, baseType: !926, size: 32, align: 32, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1009, file: !897, line: 452, baseType: !940, size: 64, align: 64, offset: 192)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !937, file: !897, line: 703, baseType: !1018, size: 64, align: 64, offset: 640)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!926, !1021}
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1023)
!1023 = !{!1024, !1025, !1026, !1226, !1227, !1292, !1293, !1294, !1985, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2039, !2040, !2041, !2042, !2043, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2094, !2095, !2098, !2099, !2100, !2101, !2102, !2103, !2105, !2106, !2107, !2108, !2116, !2117, !2121, !2125, !2126, !2127}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1022, file: !897, line: 1342, baseType: !957, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1022, file: !897, line: 1349, baseType: !1000, size: 64, align: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1022, file: !897, line: 1356, baseType: !1027, size: 64, align: 64, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1029)
!1029 = !{!1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1085, !1086, !1090, !1094, !1099, !1106, !1201, !1207, !1213, !1214, !1215, !1216, !1220}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1028, file: !897, line: 498, baseType: !940, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1028, file: !897, line: 504, baseType: !940, size: 64, align: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1028, file: !897, line: 505, baseType: !940, size: 64, align: 64, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1028, file: !897, line: 506, baseType: !940, size: 64, align: 64, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1028, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1028, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1028, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1028, file: !897, line: 517, baseType: !926, size: 32, align: 32, offset: 352)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1028, file: !897, line: 523, baseType: !947, size: 64, align: 64, offset: 384)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1028, file: !897, line: 526, baseType: !957, size: 64, align: 64, offset: 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1028, file: !897, line: 535, baseType: !1027, size: 64, align: 64, offset: 512)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1028, file: !897, line: 539, baseType: !926, size: 32, align: 32, offset: 576)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1028, file: !897, line: 541, baseType: !1018, size: 64, align: 64, offset: 640)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1028, file: !897, line: 549, baseType: !1044, size: 64, align: 64, offset: 704)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!926, !1021, !1047}
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1050)
!1050 = !{!1051, !1065, !1068, !1069, !1070, !1071, !1072, !1073, !1081, !1082, !1083, !1084}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1049, file: !4, line: 1451, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1054, line: 94, baseType: !1055)
!1054 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1054, line: 81, size: 192, align: 64, elements: !1056)
!1056 = !{!1057, !1061, !1064}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1055, file: !1054, line: 82, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1054, line: 73, baseType: !1060)
!1060 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1054, line: 73, flags: DIFlagFwdDecl)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1055, file: !1054, line: 89, baseType: !1062, size: 64, align: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !924, line: 48, baseType: !1014)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1055, file: !1054, line: 93, baseType: !926, size: 32, align: 32, offset: 128)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1049, file: !4, line: 1461, baseType: !1066, size: 64, align: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !924, line: 40, baseType: !1067)
!1067 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1049, file: !4, line: 1467, baseType: !1066, size: 64, align: 64, offset: 128)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1049, file: !4, line: 1468, baseType: !1062, size: 64, align: 64, offset: 192)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1049, file: !4, line: 1469, baseType: !926, size: 32, align: 32, offset: 256)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1049, file: !4, line: 1470, baseType: !926, size: 32, align: 32, offset: 288)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1049, file: !4, line: 1474, baseType: !926, size: 32, align: 32, offset: 320)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1049, file: !4, line: 1479, baseType: !1074, size: 64, align: 64, offset: 384)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1076)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1077)
!1077 = !{!1078, !1079, !1080}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1076, file: !4, line: 1412, baseType: !1062, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1076, file: !4, line: 1413, baseType: !926, size: 32, align: 32, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1076, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1049, file: !4, line: 1480, baseType: !926, size: 32, align: 32, offset: 448)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1049, file: !4, line: 1486, baseType: !1066, size: 64, align: 64, offset: 512)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1049, file: !4, line: 1488, baseType: !1066, size: 64, align: 64, offset: 576)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1049, file: !4, line: 1497, baseType: !1066, size: 64, align: 64, offset: 640)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1028, file: !897, line: 550, baseType: !1018, size: 64, align: 64, offset: 768)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1028, file: !897, line: 554, baseType: !1087, size: 64, align: 64, offset: 832)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!926, !1021, !1047, !1047, !926}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1028, file: !897, line: 563, baseType: !1091, size: 64, align: 64, offset: 896)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!926, !3, !926}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1028, file: !897, line: 565, baseType: !1095, size: 64, align: 64, offset: 960)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{null, !1021, !926, !1098, !1098}
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1028, file: !897, line: 570, baseType: !1100, size: 64, align: 64, offset: 1024)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!926, !1021, !926, !967, !1103}
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1104, line: 216, baseType: !1105)
!1104 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1105 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1028, file: !897, line: 581, baseType: !1107, size: 64, align: 64, offset: 1088)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!926, !1021, !926, !1110, !925}
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1113)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1114)
!1114 = !{!1115, !1119, !1121, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1155, !1157, !1158, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1113, file: !526, line: 282, baseType: !1116, size: 512, align: 64)
!1116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 512, align: 64, elements: !1117)
!1117 = !{!1118}
!1118 = !DISubrange(count: 8)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1113, file: !526, line: 299, baseType: !1120, size: 256, align: 32, offset: 512)
!1120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 256, align: 32, elements: !1117)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1113, file: !526, line: 315, baseType: !1122, size: 64, align: 64, offset: 768)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1113, file: !526, line: 326, baseType: !926, size: 32, align: 32, offset: 832)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1113, file: !526, line: 326, baseType: !926, size: 32, align: 32, offset: 864)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1113, file: !526, line: 334, baseType: !926, size: 32, align: 32, offset: 896)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1113, file: !526, line: 341, baseType: !926, size: 32, align: 32, offset: 928)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1113, file: !526, line: 346, baseType: !926, size: 32, align: 32, offset: 960)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1113, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1113, file: !526, line: 356, baseType: !1130, size: 64, align: 32, offset: 1024)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1131, line: 61, baseType: !1132)
!1131 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1131, line: 58, size: 64, align: 32, elements: !1133)
!1133 = !{!1134, !1135}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1132, file: !1131, line: 59, baseType: !926, size: 32, align: 32)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1132, file: !1131, line: 60, baseType: !926, size: 32, align: 32, offset: 32)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1113, file: !526, line: 361, baseType: !1066, size: 64, align: 64, offset: 1088)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1113, file: !526, line: 369, baseType: !1066, size: 64, align: 64, offset: 1152)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1113, file: !526, line: 377, baseType: !1066, size: 64, align: 64, offset: 1216)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1113, file: !526, line: 382, baseType: !926, size: 32, align: 32, offset: 1280)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1113, file: !526, line: 386, baseType: !926, size: 32, align: 32, offset: 1312)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1113, file: !526, line: 391, baseType: !926, size: 32, align: 32, offset: 1344)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1113, file: !526, line: 396, baseType: !967, size: 64, align: 64, offset: 1408)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1113, file: !526, line: 403, baseType: !1144, size: 512, align: 64, offset: 1472)
!1144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1145, size: 512, align: 64, elements: !1117)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !924, line: 55, baseType: !1105)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1113, file: !526, line: 410, baseType: !926, size: 32, align: 32, offset: 1984)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1113, file: !526, line: 415, baseType: !926, size: 32, align: 32, offset: 2016)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1113, file: !526, line: 420, baseType: !926, size: 32, align: 32, offset: 2048)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1113, file: !526, line: 425, baseType: !926, size: 32, align: 32, offset: 2080)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1113, file: !526, line: 435, baseType: !1066, size: 64, align: 64, offset: 2112)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1113, file: !526, line: 440, baseType: !926, size: 32, align: 32, offset: 2176)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1113, file: !526, line: 445, baseType: !1145, size: 64, align: 64, offset: 2240)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1113, file: !526, line: 459, baseType: !1154, size: 512, align: 64, offset: 2304)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 512, align: 64, elements: !1117)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1113, file: !526, line: 473, baseType: !1156, size: 64, align: 64, offset: 2816)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1113, file: !526, line: 477, baseType: !926, size: 32, align: 32, offset: 2880)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1113, file: !526, line: 479, baseType: !1159, size: 64, align: 64, offset: 2944)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1163)
!1163 = !{!1164, !1165, !1166, !1167, !1172}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1162, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1162, file: !526, line: 203, baseType: !1062, size: 64, align: 64, offset: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1162, file: !526, line: 204, baseType: !926, size: 32, align: 32, offset: 128)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1162, file: !526, line: 205, baseType: !1168, size: 64, align: 64, offset: 192)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1170, line: 86, baseType: !1171)
!1170 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1171 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1170, line: 86, flags: DIFlagFwdDecl)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1162, file: !526, line: 206, baseType: !1052, size: 64, align: 64, offset: 256)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1113, file: !526, line: 480, baseType: !926, size: 32, align: 32, offset: 3008)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1113, file: !526, line: 505, baseType: !926, size: 32, align: 32, offset: 3040)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1113, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1113, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1113, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1113, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1113, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1113, file: !526, line: 532, baseType: !1066, size: 64, align: 64, offset: 3264)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1113, file: !526, line: 539, baseType: !1066, size: 64, align: 64, offset: 3328)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1113, file: !526, line: 547, baseType: !1066, size: 64, align: 64, offset: 3392)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1113, file: !526, line: 554, baseType: !1168, size: 64, align: 64, offset: 3456)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1113, file: !526, line: 563, baseType: !926, size: 32, align: 32, offset: 3520)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1113, file: !526, line: 572, baseType: !926, size: 32, align: 32, offset: 3552)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1113, file: !526, line: 581, baseType: !926, size: 32, align: 32, offset: 3584)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1113, file: !526, line: 588, baseType: !1188, size: 64, align: 64, offset: 3648)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !924, line: 36, baseType: !1190)
!1190 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1113, file: !526, line: 593, baseType: !926, size: 32, align: 32, offset: 3712)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1113, file: !526, line: 596, baseType: !926, size: 32, align: 32, offset: 3744)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1113, file: !526, line: 599, baseType: !1052, size: 64, align: 64, offset: 3776)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1113, file: !526, line: 605, baseType: !1052, size: 64, align: 64, offset: 3840)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1113, file: !526, line: 616, baseType: !1052, size: 64, align: 64, offset: 3904)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1113, file: !526, line: 626, baseType: !1103, size: 64, align: 64, offset: 3968)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1113, file: !526, line: 627, baseType: !1103, size: 64, align: 64, offset: 4032)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1113, file: !526, line: 628, baseType: !1103, size: 64, align: 64, offset: 4096)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1113, file: !526, line: 629, baseType: !1103, size: 64, align: 64, offset: 4160)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1113, file: !526, line: 645, baseType: !1052, size: 64, align: 64, offset: 4224)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1028, file: !897, line: 587, baseType: !1202, size: 64, align: 64, offset: 1152)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!926, !1021, !1205}
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1028, file: !897, line: 592, baseType: !1208, size: 64, align: 64, offset: 1216)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!926, !1021, !1211}
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1028, file: !897, line: 597, baseType: !1208, size: 64, align: 64, offset: 1280)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1028, file: !897, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1028, file: !897, line: 608, baseType: !1018, size: 64, align: 64, offset: 1408)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1028, file: !897, line: 617, baseType: !1217, size: 64, align: 64, offset: 1472)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{null, !1021}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1028, file: !897, line: 623, baseType: !1221, size: 64, align: 64, offset: 1536)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!926, !1021, !1224}
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1048)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1022, file: !897, line: 1365, baseType: !967, size: 64, align: 64, offset: 192)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1022, file: !897, line: 1379, baseType: !1228, size: 64, align: 64, offset: 256)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1230)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1231)
!1231 = !{!1232, !1233, !1234, !1235, !1236, !1237, !1238, !1242, !1243, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1259, !1260, !1264, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1282, !1283, !1284, !1285, !1289, !1290, !1291}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1230, file: !628, line: 174, baseType: !957, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1230, file: !628, line: 226, baseType: !1013, size: 64, align: 64, offset: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1230, file: !628, line: 227, baseType: !926, size: 32, align: 32, offset: 128)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1230, file: !628, line: 228, baseType: !1013, size: 64, align: 64, offset: 192)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1230, file: !628, line: 229, baseType: !1013, size: 64, align: 64, offset: 256)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1230, file: !628, line: 233, baseType: !967, size: 64, align: 64, offset: 320)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1230, file: !628, line: 235, baseType: !1239, size: 64, align: 64, offset: 384)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!926, !967, !1062, !926}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1230, file: !628, line: 236, baseType: !1239, size: 64, align: 64, offset: 448)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1230, file: !628, line: 237, baseType: !1244, size: 64, align: 64, offset: 512)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!1066, !967, !1066, !926}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1230, file: !628, line: 238, baseType: !1066, size: 64, align: 64, offset: 576)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1230, file: !628, line: 239, baseType: !926, size: 32, align: 32, offset: 640)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1230, file: !628, line: 240, baseType: !926, size: 32, align: 32, offset: 672)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1230, file: !628, line: 241, baseType: !926, size: 32, align: 32, offset: 704)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1230, file: !628, line: 242, baseType: !1105, size: 64, align: 64, offset: 768)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1230, file: !628, line: 243, baseType: !1013, size: 64, align: 64, offset: 832)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1230, file: !628, line: 244, baseType: !1254, size: 64, align: 64, offset: 896)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!1105, !1105, !1257, !925}
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1063)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1230, file: !628, line: 245, baseType: !926, size: 32, align: 32, offset: 960)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1230, file: !628, line: 249, baseType: !1261, size: 64, align: 64, offset: 1024)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DISubroutineType(types: !1263)
!1263 = !{!926, !967, !926}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1230, file: !628, line: 255, baseType: !1265, size: 64, align: 64, offset: 1088)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!1066, !967, !926, !1066, !926}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1230, file: !628, line: 260, baseType: !926, size: 32, align: 32, offset: 1152)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1230, file: !628, line: 266, baseType: !1066, size: 64, align: 64, offset: 1216)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1230, file: !628, line: 273, baseType: !926, size: 32, align: 32, offset: 1280)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1230, file: !628, line: 279, baseType: !1066, size: 64, align: 64, offset: 1344)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1230, file: !628, line: 285, baseType: !926, size: 32, align: 32, offset: 1408)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1230, file: !628, line: 291, baseType: !926, size: 32, align: 32, offset: 1440)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1230, file: !628, line: 298, baseType: !926, size: 32, align: 32, offset: 1472)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1230, file: !628, line: 304, baseType: !926, size: 32, align: 32, offset: 1504)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1230, file: !628, line: 309, baseType: !940, size: 64, align: 64, offset: 1536)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1230, file: !628, line: 314, baseType: !940, size: 64, align: 64, offset: 1600)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1230, file: !628, line: 319, baseType: !1279, size: 64, align: 64, offset: 1664)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{!926, !967, !1062, !926, !627, !1066}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1230, file: !628, line: 326, baseType: !926, size: 32, align: 32, offset: 1728)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1230, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1230, file: !628, line: 332, baseType: !1066, size: 64, align: 64, offset: 1792)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1230, file: !628, line: 338, baseType: !1286, size: 64, align: 64, offset: 1856)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DISubroutineType(types: !1288)
!1288 = !{!926, !967}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1230, file: !628, line: 340, baseType: !1066, size: 64, align: 64, offset: 1920)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1230, file: !628, line: 346, baseType: !1013, size: 64, align: 64, offset: 1984)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1230, file: !628, line: 351, baseType: !926, size: 32, align: 32, offset: 2048)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1022, file: !897, line: 1386, baseType: !926, size: 32, align: 32, offset: 320)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1022, file: !897, line: 1393, baseType: !925, size: 32, align: 32, offset: 352)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1022, file: !897, line: 1405, baseType: !1295, size: 64, align: 64, offset: 384)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1298)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1299)
!1299 = !{!1300, !1301, !1302, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1770, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1871, !1877, !1878, !1882, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1914, !1915, !1916, !1917, !1918, !1919}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1298, file: !897, line: 866, baseType: !926, size: 32, align: 32)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1298, file: !897, line: 872, baseType: !926, size: 32, align: 32, offset: 32)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1298, file: !897, line: 878, baseType: !1303, size: 64, align: 64, offset: 64)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1305)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1306)
!1306 = !{!1307, !1308, !1309, !1310, !1445, !1446, !1447, !1448, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1474, !1478, !1479, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1658, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1305, file: !4, line: 1561, baseType: !957, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1305, file: !4, line: 1562, baseType: !926, size: 32, align: 32, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1305, file: !4, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1305, file: !4, line: 1565, baseType: !1311, size: 64, align: 64, offset: 128)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1313)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1314)
!1314 = !{!1315, !1316, !1317, !1318, !1319, !1320, !1323, !1326, !1329, !1332, !1335, !1336, !1337, !1345, !1346, !1347, !1349, !1353, !1359, !1364, !1368, !1369, !1410, !1417, !1421, !1422, !1426, !1430, !1434, !1438, !1439, !1440}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1313, file: !4, line: 3475, baseType: !940, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1313, file: !4, line: 3480, baseType: !940, size: 64, align: 64, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1313, file: !4, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1313, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1313, file: !4, line: 3487, baseType: !926, size: 32, align: 32, offset: 192)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1313, file: !4, line: 3488, baseType: !1321, size: 64, align: 64, offset: 256)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1130)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1313, file: !4, line: 3489, baseType: !1324, size: 64, align: 64, offset: 320)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1313, file: !4, line: 3490, baseType: !1327, size: 64, align: 64, offset: 384)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1313, file: !4, line: 3491, baseType: !1330, size: 64, align: 64, offset: 448)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1313, file: !4, line: 3492, baseType: !1333, size: 64, align: 64, offset: 512)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1145)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1313, file: !4, line: 3493, baseType: !1063, size: 8, align: 8, offset: 576)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1313, file: !4, line: 3494, baseType: !957, size: 64, align: 64, offset: 640)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1313, file: !4, line: 3495, baseType: !1338, size: 64, align: 64, offset: 704)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1340)
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1341)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1342)
!1342 = !{!1343, !1344}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1341, file: !4, line: 3402, baseType: !926, size: 32, align: 32)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1341, file: !4, line: 3403, baseType: !940, size: 64, align: 64, offset: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1313, file: !4, line: 3507, baseType: !940, size: 64, align: 64, offset: 768)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1313, file: !4, line: 3516, baseType: !926, size: 32, align: 32, offset: 832)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1313, file: !4, line: 3517, baseType: !1348, size: 64, align: 64, offset: 896)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1313, file: !4, line: 3527, baseType: !1350, size: 64, align: 64, offset: 960)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DISubroutineType(types: !1352)
!1352 = !{!926, !1303}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1313, file: !4, line: 3535, baseType: !1354, size: 64, align: 64, offset: 1024)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = !DISubroutineType(types: !1356)
!1356 = !{!926, !1303, !1357}
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1304)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1313, file: !4, line: 3541, baseType: !1360, size: 64, align: 64, offset: 1088)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1362)
!1362 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1363)
!1363 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1313, file: !4, line: 3549, baseType: !1365, size: 64, align: 64, offset: 1152)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DISubroutineType(types: !1367)
!1367 = !{null, !1348}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1313, file: !4, line: 3551, baseType: !1350, size: 64, align: 64, offset: 1216)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1313, file: !4, line: 3552, baseType: !1370, size: 64, align: 64, offset: 1280)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DISubroutineType(types: !1372)
!1372 = !{!926, !1303, !1062, !926, !1373}
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1375)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1376)
!1376 = !{!1377, !1378, !1379, !1380, !1381, !1409}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1375, file: !4, line: 3921, baseType: !931, size: 16, align: 16)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1375, file: !4, line: 3922, baseType: !923, size: 32, align: 32, offset: 32)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1375, file: !4, line: 3923, baseType: !923, size: 32, align: 32, offset: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1375, file: !4, line: 3924, baseType: !925, size: 32, align: 32, offset: 96)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1375, file: !4, line: 3925, baseType: !1382, size: 64, align: 64, offset: 128)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1385)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1386)
!1386 = !{!1387, !1388, !1389, !1390, !1391, !1392, !1398, !1402, !1404, !1405, !1407, !1408}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1385, file: !4, line: 3886, baseType: !926, size: 32, align: 32)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1385, file: !4, line: 3887, baseType: !926, size: 32, align: 32, offset: 32)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1385, file: !4, line: 3888, baseType: !926, size: 32, align: 32, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1385, file: !4, line: 3889, baseType: !926, size: 32, align: 32, offset: 96)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1385, file: !4, line: 3890, baseType: !926, size: 32, align: 32, offset: 128)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1385, file: !4, line: 3897, baseType: !1393, size: 768, align: 64, offset: 192)
!1393 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1394)
!1394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1395)
!1395 = !{!1396, !1397}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1394, file: !4, line: 3855, baseType: !1116, size: 512, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1394, file: !4, line: 3857, baseType: !1120, size: 256, align: 32, offset: 512)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1385, file: !4, line: 3903, baseType: !1399, size: 256, align: 64, offset: 960)
!1399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 256, align: 64, elements: !1400)
!1400 = !{!1401}
!1401 = !DISubrange(count: 4)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1385, file: !4, line: 3904, baseType: !1403, size: 128, align: 32, offset: 1216)
!1403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 128, align: 32, elements: !1400)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1385, file: !4, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1385, file: !4, line: 3908, baseType: !1406, size: 64, align: 64, offset: 1408)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1385, file: !4, line: 3915, baseType: !1406, size: 64, align: 64, offset: 1472)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1385, file: !4, line: 3917, baseType: !926, size: 32, align: 32, offset: 1536)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1375, file: !4, line: 3926, baseType: !1066, size: 64, align: 64, offset: 192)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1313, file: !4, line: 3564, baseType: !1411, size: 64, align: 64, offset: 1344)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DISubroutineType(types: !1413)
!1413 = !{!926, !1303, !1047, !1414, !1416}
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1112)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1313, file: !4, line: 3566, baseType: !1418, size: 64, align: 64, offset: 1408)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DISubroutineType(types: !1420)
!1420 = !{!926, !1303, !967, !1416, !1047}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1313, file: !4, line: 3567, baseType: !1350, size: 64, align: 64, offset: 1472)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1313, file: !4, line: 3576, baseType: !1423, size: 64, align: 64, offset: 1536)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DISubroutineType(types: !1425)
!1425 = !{!926, !1303, !1414}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1313, file: !4, line: 3577, baseType: !1427, size: 64, align: 64, offset: 1600)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{!926, !1303, !1047}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1313, file: !4, line: 3584, baseType: !1431, size: 64, align: 64, offset: 1664)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DISubroutineType(types: !1433)
!1433 = !{!926, !1303, !1111}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1313, file: !4, line: 3589, baseType: !1435, size: 64, align: 64, offset: 1728)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DISubroutineType(types: !1437)
!1437 = !{null, !1303}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1313, file: !4, line: 3594, baseType: !926, size: 32, align: 32, offset: 1792)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1313, file: !4, line: 3600, baseType: !940, size: 64, align: 64, offset: 1856)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1313, file: !4, line: 3609, baseType: !1441, size: 64, align: 64, offset: 1920)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1444)
!1444 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1305, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1305, file: !4, line: 1581, baseType: !925, size: 32, align: 32, offset: 224)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1305, file: !4, line: 1583, baseType: !967, size: 64, align: 64, offset: 256)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1305, file: !4, line: 1591, baseType: !1449, size: 64, align: 64, offset: 320)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1305, file: !4, line: 1598, baseType: !967, size: 64, align: 64, offset: 384)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1305, file: !4, line: 1606, baseType: !1066, size: 64, align: 64, offset: 448)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1305, file: !4, line: 1614, baseType: !926, size: 32, align: 32, offset: 512)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1305, file: !4, line: 1622, baseType: !926, size: 32, align: 32, offset: 544)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1305, file: !4, line: 1628, baseType: !926, size: 32, align: 32, offset: 576)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1305, file: !4, line: 1636, baseType: !926, size: 32, align: 32, offset: 608)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1305, file: !4, line: 1643, baseType: !926, size: 32, align: 32, offset: 640)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1305, file: !4, line: 1657, baseType: !1062, size: 64, align: 64, offset: 704)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1305, file: !4, line: 1658, baseType: !926, size: 32, align: 32, offset: 768)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1305, file: !4, line: 1679, baseType: !1130, size: 64, align: 32, offset: 800)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1305, file: !4, line: 1688, baseType: !926, size: 32, align: 32, offset: 864)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1305, file: !4, line: 1712, baseType: !926, size: 32, align: 32, offset: 896)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1305, file: !4, line: 1729, baseType: !926, size: 32, align: 32, offset: 928)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1305, file: !4, line: 1729, baseType: !926, size: 32, align: 32, offset: 960)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1305, file: !4, line: 1744, baseType: !926, size: 32, align: 32, offset: 992)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1305, file: !4, line: 1744, baseType: !926, size: 32, align: 32, offset: 1024)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1305, file: !4, line: 1751, baseType: !926, size: 32, align: 32, offset: 1056)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1305, file: !4, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1305, file: !4, line: 1791, baseType: !1470, size: 64, align: 64, offset: 1152)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{null, !1473, !1414, !1416, !926, !926, !926}
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1305, file: !4, line: 1808, baseType: !1475, size: 64, align: 64, offset: 1216)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{!645, !1473, !1324}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1305, file: !4, line: 1816, baseType: !926, size: 32, align: 32, offset: 1280)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1305, file: !4, line: 1825, baseType: !1480, size: 32, align: 32, offset: 1312)
!1480 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1305, file: !4, line: 1830, baseType: !926, size: 32, align: 32, offset: 1344)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1305, file: !4, line: 1838, baseType: !1480, size: 32, align: 32, offset: 1376)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1305, file: !4, line: 1846, baseType: !926, size: 32, align: 32, offset: 1408)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1305, file: !4, line: 1851, baseType: !926, size: 32, align: 32, offset: 1440)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1305, file: !4, line: 1861, baseType: !1480, size: 32, align: 32, offset: 1472)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1305, file: !4, line: 1868, baseType: !1480, size: 32, align: 32, offset: 1504)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1305, file: !4, line: 1875, baseType: !1480, size: 32, align: 32, offset: 1536)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1305, file: !4, line: 1882, baseType: !1480, size: 32, align: 32, offset: 1568)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1305, file: !4, line: 1889, baseType: !1480, size: 32, align: 32, offset: 1600)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1305, file: !4, line: 1896, baseType: !1480, size: 32, align: 32, offset: 1632)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1305, file: !4, line: 1903, baseType: !1480, size: 32, align: 32, offset: 1664)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1305, file: !4, line: 1910, baseType: !926, size: 32, align: 32, offset: 1696)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1305, file: !4, line: 1915, baseType: !926, size: 32, align: 32, offset: 1728)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1305, file: !4, line: 1926, baseType: !1416, size: 64, align: 64, offset: 1792)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1305, file: !4, line: 1935, baseType: !1130, size: 64, align: 32, offset: 1856)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1305, file: !4, line: 1942, baseType: !926, size: 32, align: 32, offset: 1920)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1305, file: !4, line: 1948, baseType: !926, size: 32, align: 32, offset: 1952)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1305, file: !4, line: 1954, baseType: !926, size: 32, align: 32, offset: 1984)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1305, file: !4, line: 1960, baseType: !926, size: 32, align: 32, offset: 2016)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1305, file: !4, line: 1984, baseType: !926, size: 32, align: 32, offset: 2048)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1305, file: !4, line: 1991, baseType: !926, size: 32, align: 32, offset: 2080)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1305, file: !4, line: 1996, baseType: !926, size: 32, align: 32, offset: 2112)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1305, file: !4, line: 2004, baseType: !926, size: 32, align: 32, offset: 2144)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1305, file: !4, line: 2011, baseType: !926, size: 32, align: 32, offset: 2176)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1305, file: !4, line: 2018, baseType: !926, size: 32, align: 32, offset: 2208)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1305, file: !4, line: 2027, baseType: !926, size: 32, align: 32, offset: 2240)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1305, file: !4, line: 2034, baseType: !926, size: 32, align: 32, offset: 2272)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1305, file: !4, line: 2044, baseType: !926, size: 32, align: 32, offset: 2304)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1305, file: !4, line: 2054, baseType: !1510, size: 64, align: 64, offset: 2368)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1305, file: !4, line: 2061, baseType: !1510, size: 64, align: 64, offset: 2432)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1305, file: !4, line: 2066, baseType: !926, size: 32, align: 32, offset: 2496)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1305, file: !4, line: 2070, baseType: !926, size: 32, align: 32, offset: 2528)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1305, file: !4, line: 2078, baseType: !926, size: 32, align: 32, offset: 2560)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1305, file: !4, line: 2085, baseType: !926, size: 32, align: 32, offset: 2592)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1305, file: !4, line: 2092, baseType: !926, size: 32, align: 32, offset: 2624)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1305, file: !4, line: 2099, baseType: !926, size: 32, align: 32, offset: 2656)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1305, file: !4, line: 2106, baseType: !926, size: 32, align: 32, offset: 2688)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1305, file: !4, line: 2113, baseType: !926, size: 32, align: 32, offset: 2720)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1305, file: !4, line: 2120, baseType: !926, size: 32, align: 32, offset: 2752)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1305, file: !4, line: 2125, baseType: !926, size: 32, align: 32, offset: 2784)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1305, file: !4, line: 2133, baseType: !926, size: 32, align: 32, offset: 2816)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1305, file: !4, line: 2140, baseType: !926, size: 32, align: 32, offset: 2848)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1305, file: !4, line: 2145, baseType: !926, size: 32, align: 32, offset: 2880)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1305, file: !4, line: 2153, baseType: !926, size: 32, align: 32, offset: 2912)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1305, file: !4, line: 2158, baseType: !926, size: 32, align: 32, offset: 2944)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1305, file: !4, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1305, file: !4, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1305, file: !4, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1305, file: !4, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1305, file: !4, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1305, file: !4, line: 2203, baseType: !926, size: 32, align: 32, offset: 3136)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1305, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1305, file: !4, line: 2212, baseType: !926, size: 32, align: 32, offset: 3200)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1305, file: !4, line: 2213, baseType: !926, size: 32, align: 32, offset: 3232)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1305, file: !4, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1305, file: !4, line: 2232, baseType: !926, size: 32, align: 32, offset: 3296)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1305, file: !4, line: 2243, baseType: !926, size: 32, align: 32, offset: 3328)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1305, file: !4, line: 2249, baseType: !926, size: 32, align: 32, offset: 3360)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1305, file: !4, line: 2256, baseType: !926, size: 32, align: 32, offset: 3392)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1305, file: !4, line: 2263, baseType: !1145, size: 64, align: 64, offset: 3456)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1305, file: !4, line: 2270, baseType: !1145, size: 64, align: 64, offset: 3520)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1305, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1305, file: !4, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1305, file: !4, line: 2367, baseType: !1546, size: 64, align: 64, offset: 3648)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DISubroutineType(types: !1548)
!1548 = !{!926, !1473, !1111, !926}
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1305, file: !4, line: 2383, baseType: !926, size: 32, align: 32, offset: 3712)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1305, file: !4, line: 2386, baseType: !1480, size: 32, align: 32, offset: 3744)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1305, file: !4, line: 2387, baseType: !1480, size: 32, align: 32, offset: 3776)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1305, file: !4, line: 2394, baseType: !926, size: 32, align: 32, offset: 3808)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1305, file: !4, line: 2401, baseType: !926, size: 32, align: 32, offset: 3840)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1305, file: !4, line: 2408, baseType: !926, size: 32, align: 32, offset: 3872)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1305, file: !4, line: 2415, baseType: !926, size: 32, align: 32, offset: 3904)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1305, file: !4, line: 2422, baseType: !926, size: 32, align: 32, offset: 3936)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1305, file: !4, line: 2423, baseType: !1558, size: 64, align: 64, offset: 3968)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1560)
!1560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1561)
!1561 = !{!1562, !1563, !1564, !1565}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1560, file: !4, line: 827, baseType: !926, size: 32, align: 32)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1560, file: !4, line: 828, baseType: !926, size: 32, align: 32, offset: 32)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1560, file: !4, line: 829, baseType: !926, size: 32, align: 32, offset: 64)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1560, file: !4, line: 830, baseType: !1480, size: 32, align: 32, offset: 96)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1305, file: !4, line: 2430, baseType: !1066, size: 64, align: 64, offset: 4032)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1305, file: !4, line: 2437, baseType: !1066, size: 64, align: 64, offset: 4096)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1305, file: !4, line: 2444, baseType: !1480, size: 32, align: 32, offset: 4160)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1305, file: !4, line: 2451, baseType: !1480, size: 32, align: 32, offset: 4192)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1305, file: !4, line: 2458, baseType: !926, size: 32, align: 32, offset: 4224)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1305, file: !4, line: 2469, baseType: !926, size: 32, align: 32, offset: 4256)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1305, file: !4, line: 2475, baseType: !926, size: 32, align: 32, offset: 4288)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1305, file: !4, line: 2481, baseType: !926, size: 32, align: 32, offset: 4320)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1305, file: !4, line: 2485, baseType: !926, size: 32, align: 32, offset: 4352)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1305, file: !4, line: 2489, baseType: !926, size: 32, align: 32, offset: 4384)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1305, file: !4, line: 2493, baseType: !926, size: 32, align: 32, offset: 4416)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1305, file: !4, line: 2501, baseType: !926, size: 32, align: 32, offset: 4448)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1305, file: !4, line: 2506, baseType: !926, size: 32, align: 32, offset: 4480)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1305, file: !4, line: 2510, baseType: !926, size: 32, align: 32, offset: 4512)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1305, file: !4, line: 2514, baseType: !1066, size: 64, align: 64, offset: 4544)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1305, file: !4, line: 2528, baseType: !1582, size: 64, align: 64, offset: 4608)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DISubroutineType(types: !1584)
!1584 = !{null, !1473, !967, !926, !926}
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1305, file: !4, line: 2534, baseType: !926, size: 32, align: 32, offset: 4672)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1305, file: !4, line: 2545, baseType: !926, size: 32, align: 32, offset: 4704)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1305, file: !4, line: 2547, baseType: !926, size: 32, align: 32, offset: 4736)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1305, file: !4, line: 2549, baseType: !926, size: 32, align: 32, offset: 4768)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1305, file: !4, line: 2551, baseType: !926, size: 32, align: 32, offset: 4800)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1305, file: !4, line: 2553, baseType: !926, size: 32, align: 32, offset: 4832)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1305, file: !4, line: 2555, baseType: !926, size: 32, align: 32, offset: 4864)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1305, file: !4, line: 2557, baseType: !926, size: 32, align: 32, offset: 4896)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1305, file: !4, line: 2559, baseType: !926, size: 32, align: 32, offset: 4928)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1305, file: !4, line: 2563, baseType: !926, size: 32, align: 32, offset: 4960)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1305, file: !4, line: 2571, baseType: !1406, size: 64, align: 64, offset: 4992)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1305, file: !4, line: 2579, baseType: !1406, size: 64, align: 64, offset: 5056)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1305, file: !4, line: 2586, baseType: !926, size: 32, align: 32, offset: 5120)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1305, file: !4, line: 2615, baseType: !926, size: 32, align: 32, offset: 5152)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1305, file: !4, line: 2627, baseType: !926, size: 32, align: 32, offset: 5184)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1305, file: !4, line: 2637, baseType: !926, size: 32, align: 32, offset: 5216)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1305, file: !4, line: 2681, baseType: !926, size: 32, align: 32, offset: 5248)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1305, file: !4, line: 2709, baseType: !1066, size: 64, align: 64, offset: 5312)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1305, file: !4, line: 2716, baseType: !1604, size: 64, align: 64, offset: 5376)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1606)
!1606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1607)
!1607 = !{!1608, !1609, !1610, !1611, !1612, !1613, !1614, !1618, !1622, !1623, !1624, !1625, !1631, !1632, !1633, !1634, !1635}
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1606, file: !4, line: 3642, baseType: !940, size: 64, align: 64)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1606, file: !4, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1606, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1606, file: !4, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1606, file: !4, line: 3669, baseType: !926, size: 32, align: 32, offset: 160)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1606, file: !4, line: 3682, baseType: !1431, size: 64, align: 64, offset: 192)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1606, file: !4, line: 3698, baseType: !1615, size: 64, align: 64, offset: 256)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = !DISubroutineType(types: !1617)
!1617 = !{!926, !1303, !1257, !923}
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1606, file: !4, line: 3712, baseType: !1619, size: 64, align: 64, offset: 320)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DISubroutineType(types: !1621)
!1621 = !{!926, !1303, !926, !1257, !923}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1606, file: !4, line: 3726, baseType: !1615, size: 64, align: 64, offset: 384)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1606, file: !4, line: 3737, baseType: !1350, size: 64, align: 64, offset: 448)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1606, file: !4, line: 3746, baseType: !926, size: 32, align: 32, offset: 512)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1606, file: !4, line: 3757, baseType: !1626, size: 64, align: 64, offset: 576)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DISubroutineType(types: !1628)
!1628 = !{null, !1629}
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1606, file: !4, line: 3766, baseType: !1350, size: 64, align: 64, offset: 640)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1606, file: !4, line: 3774, baseType: !1350, size: 64, align: 64, offset: 704)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1606, file: !4, line: 3780, baseType: !926, size: 32, align: 32, offset: 768)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1606, file: !4, line: 3785, baseType: !926, size: 32, align: 32, offset: 800)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1606, file: !4, line: 3795, baseType: !1636, size: 64, align: 64, offset: 832)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DISubroutineType(types: !1638)
!1638 = !{!926, !1303, !1052}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1305, file: !4, line: 2728, baseType: !967, size: 64, align: 64, offset: 5440)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1305, file: !4, line: 2735, baseType: !1144, size: 512, align: 64, offset: 5504)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1305, file: !4, line: 2742, baseType: !926, size: 32, align: 32, offset: 6016)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1305, file: !4, line: 2755, baseType: !926, size: 32, align: 32, offset: 6048)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1305, file: !4, line: 2776, baseType: !926, size: 32, align: 32, offset: 6080)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1305, file: !4, line: 2783, baseType: !926, size: 32, align: 32, offset: 6112)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1305, file: !4, line: 2791, baseType: !926, size: 32, align: 32, offset: 6144)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1305, file: !4, line: 2802, baseType: !1111, size: 64, align: 64, offset: 6208)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1305, file: !4, line: 2811, baseType: !926, size: 32, align: 32, offset: 6272)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1305, file: !4, line: 2821, baseType: !926, size: 32, align: 32, offset: 6304)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1305, file: !4, line: 2830, baseType: !926, size: 32, align: 32, offset: 6336)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1305, file: !4, line: 2840, baseType: !926, size: 32, align: 32, offset: 6368)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1305, file: !4, line: 2851, baseType: !1652, size: 64, align: 64, offset: 6400)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{!926, !1473, !1655, !967, !1416, !926, !926}
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DISubroutineType(types: !1657)
!1657 = !{!926, !1473, !967}
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1305, file: !4, line: 2871, baseType: !1659, size: 64, align: 64, offset: 6464)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DISubroutineType(types: !1661)
!1661 = !{!926, !1473, !1662, !967, !1416, !926}
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DISubroutineType(types: !1664)
!1664 = !{!926, !1473, !967, !926, !926}
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1305, file: !4, line: 2878, baseType: !926, size: 32, align: 32, offset: 6528)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1305, file: !4, line: 2885, baseType: !926, size: 32, align: 32, offset: 6560)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1305, file: !4, line: 3005, baseType: !926, size: 32, align: 32, offset: 6592)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1305, file: !4, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1305, file: !4, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1305, file: !4, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1305, file: !4, line: 3037, baseType: !1062, size: 64, align: 64, offset: 6720)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1305, file: !4, line: 3038, baseType: !926, size: 32, align: 32, offset: 6784)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1305, file: !4, line: 3050, baseType: !1145, size: 64, align: 64, offset: 6848)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1305, file: !4, line: 3065, baseType: !926, size: 32, align: 32, offset: 6912)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1305, file: !4, line: 3083, baseType: !926, size: 32, align: 32, offset: 6944)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1305, file: !4, line: 3092, baseType: !1130, size: 64, align: 32, offset: 6976)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1305, file: !4, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1305, file: !4, line: 3106, baseType: !1130, size: 64, align: 32, offset: 7072)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1305, file: !4, line: 3113, baseType: !1680, size: 64, align: 64, offset: 7168)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1682)
!1682 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1683)
!1683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1684)
!1684 = !{!1685, !1686, !1687, !1688, !1689, !1690, !1693}
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1683, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1683, file: !4, line: 714, baseType: !636, size: 32, align: 32, offset: 32)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1683, file: !4, line: 720, baseType: !940, size: 64, align: 64, offset: 64)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1683, file: !4, line: 724, baseType: !940, size: 64, align: 64, offset: 128)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1683, file: !4, line: 728, baseType: !926, size: 32, align: 32, offset: 192)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1683, file: !4, line: 734, baseType: !1691, size: 64, align: 64, offset: 256)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64, align: 64)
!1692 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1683, file: !4, line: 739, baseType: !1694, size: 64, align: 64, offset: 320)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64, align: 64)
!1695 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1341)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1305, file: !4, line: 3129, baseType: !1066, size: 64, align: 64, offset: 7232)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1305, file: !4, line: 3130, baseType: !1066, size: 64, align: 64, offset: 7296)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1305, file: !4, line: 3131, baseType: !1066, size: 64, align: 64, offset: 7360)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1305, file: !4, line: 3132, baseType: !1066, size: 64, align: 64, offset: 7424)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1305, file: !4, line: 3139, baseType: !1406, size: 64, align: 64, offset: 7488)
