; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--webp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--webp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880}
!874 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!875 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!876 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!877 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!878 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!879 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!880 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlphaCompression", file: !888, line: 98, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/webp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!889 = !{!890, !891}
!890 = !DIEnumerator(name: "ALPHA_COMPRESSION_NONE", value: 0)
!891 = !DIEnumerator(name: "ALPHA_COMPRESSION_VP8L", value: 1)
!892 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlphaFilter", file: !888, line: 103, size: 32, align: 32, elements: !893)
!893 = !{!894, !895, !896, !897}
!894 = !DIEnumerator(name: "ALPHA_FILTER_NONE", value: 0)
!895 = !DIEnumerator(name: "ALPHA_FILTER_HORIZONTAL", value: 1)
!896 = !DIEnumerator(name: "ALPHA_FILTER_VERTICAL", value: 2)
!897 = !DIEnumerator(name: "ALPHA_FILTER_GRADIENT", value: 3)
!898 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TransformType", file: !888, line: 110, size: 32, align: 32, elements: !899)
!899 = !{!900, !901, !902, !903}
!900 = !DIEnumerator(name: "PREDICTOR_TRANSFORM", value: 0)
!901 = !DIEnumerator(name: "COLOR_TRANSFORM", value: 1)
!902 = !DIEnumerator(name: "SUBTRACT_GREEN", value: 2)
!903 = !DIEnumerator(name: "COLOR_INDEXING_TRANSFORM", value: 3)
!904 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ImageRole", file: !888, line: 148, size: 32, align: 32, elements: !905)
!905 = !{!906, !907, !908, !909, !910, !911}
!906 = !DIEnumerator(name: "IMAGE_ROLE_ARGB", value: 0)
!907 = !DIEnumerator(name: "IMAGE_ROLE_ENTROPY", value: 1)
!908 = !DIEnumerator(name: "IMAGE_ROLE_PREDICTOR", value: 2)
!909 = !DIEnumerator(name: "IMAGE_ROLE_COLOR_TRANSFORM", value: 3)
!910 = !DIEnumerator(name: "IMAGE_ROLE_COLOR_INDEXING", value: 4)
!911 = !DIEnumerator(name: "IMAGE_ROLE_NB", value: 5)
!912 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HuffmanIndex", file: !888, line: 134, size: 32, align: 32, elements: !913)
!913 = !{!914, !915, !916, !917, !918}
!914 = !DIEnumerator(name: "HUFF_IDX_GREEN", value: 0)
!915 = !DIEnumerator(name: "HUFF_IDX_RED", value: 1)
!916 = !DIEnumerator(name: "HUFF_IDX_BLUE", value: 2)
!917 = !DIEnumerator(name: "HUFF_IDX_ALPHA", value: 3)
!918 = !DIEnumerator(name: "HUFF_IDX_DIST", value: 4)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PredictionMode", file: !888, line: 117, size: 32, align: 32, elements: !920)
!920 = !{!921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934}
!921 = !DIEnumerator(name: "PRED_MODE_BLACK", value: 0)
!922 = !DIEnumerator(name: "PRED_MODE_L", value: 1)
!923 = !DIEnumerator(name: "PRED_MODE_T", value: 2)
!924 = !DIEnumerator(name: "PRED_MODE_TR", value: 3)
!925 = !DIEnumerator(name: "PRED_MODE_TL", value: 4)
!926 = !DIEnumerator(name: "PRED_MODE_AVG_T_AVG_L_TR", value: 5)
!927 = !DIEnumerator(name: "PRED_MODE_AVG_L_TL", value: 6)
!928 = !DIEnumerator(name: "PRED_MODE_AVG_L_T", value: 7)
!929 = !DIEnumerator(name: "PRED_MODE_AVG_TL_T", value: 8)
!930 = !DIEnumerator(name: "PRED_MODE_AVG_T_TR", value: 9)
!931 = !DIEnumerator(name: "PRED_MODE_AVG_AVG_L_TL_AVG_T_TR", value: 10)
!932 = !DIEnumerator(name: "PRED_MODE_SELECT", value: 11)
!933 = !DIEnumerator(name: "PRED_MODE_ADD_SUBTRACT_FULL", value: 12)
!934 = !DIEnumerator(name: "PRED_MODE_ADD_SUBTRACT_HALF", value: 13)
!935 = !{!936, !937, !938, !1049, !976, !1055, !1057, !1075, !1076}
!936 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!937 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !941)
!941 = !{!942, !950, !952, !954, !955, !956, !957, !958, !959, !960, !967, !970, !971, !972, !973, !974, !975, !977, !981, !982, !983, !984, !985, !986, !987, !988, !1001, !1003, !1004, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1037, !1038, !1039, !1040, !1041, !1042, !1045, !1046, !1047, !1048}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !940, file: !722, line: 282, baseType: !943, size: 512, align: 64)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 512, align: 64, elements: !948)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !946, line: 48, baseType: !947)
!946 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!947 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!948 = !{!949}
!949 = !DISubrange(count: 8)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !940, file: !722, line: 299, baseType: !951, size: 256, align: 32, offset: 512)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 256, align: 32, elements: !948)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !940, file: !722, line: 315, baseType: !953, size: 64, align: 64, offset: 768)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !940, file: !722, line: 326, baseType: !936, size: 32, align: 32, offset: 832)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !940, file: !722, line: 326, baseType: !936, size: 32, align: 32, offset: 864)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !940, file: !722, line: 334, baseType: !936, size: 32, align: 32, offset: 896)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !940, file: !722, line: 341, baseType: !936, size: 32, align: 32, offset: 928)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !940, file: !722, line: 346, baseType: !936, size: 32, align: 32, offset: 960)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !940, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !940, file: !722, line: 356, baseType: !961, size: 64, align: 32, offset: 1024)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !962, line: 61, baseType: !963)
!962 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !962, line: 58, size: 64, align: 32, elements: !964)
!964 = !{!965, !966}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !963, file: !962, line: 59, baseType: !936, size: 32, align: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !963, file: !962, line: 60, baseType: !936, size: 32, align: 32, offset: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !940, file: !722, line: 361, baseType: !968, size: 64, align: 64, offset: 1088)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !946, line: 40, baseType: !969)
!969 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !940, file: !722, line: 369, baseType: !968, size: 64, align: 64, offset: 1152)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !940, file: !722, line: 377, baseType: !968, size: 64, align: 64, offset: 1216)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !940, file: !722, line: 382, baseType: !936, size: 32, align: 32, offset: 1280)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !940, file: !722, line: 386, baseType: !936, size: 32, align: 32, offset: 1312)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !940, file: !722, line: 391, baseType: !936, size: 32, align: 32, offset: 1344)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !940, file: !722, line: 396, baseType: !976, size: 64, align: 64, offset: 1408)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !940, file: !722, line: 403, baseType: !978, size: 512, align: 64, offset: 1472)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !979, size: 512, align: 64, elements: !948)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !946, line: 55, baseType: !980)
!980 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !940, file: !722, line: 410, baseType: !936, size: 32, align: 32, offset: 1984)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !940, file: !722, line: 415, baseType: !936, size: 32, align: 32, offset: 2016)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !940, file: !722, line: 420, baseType: !936, size: 32, align: 32, offset: 2048)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !940, file: !722, line: 425, baseType: !936, size: 32, align: 32, offset: 2080)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !940, file: !722, line: 435, baseType: !968, size: 64, align: 64, offset: 2112)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !940, file: !722, line: 440, baseType: !936, size: 32, align: 32, offset: 2176)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !940, file: !722, line: 445, baseType: !979, size: 64, align: 64, offset: 2240)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !940, file: !722, line: 459, baseType: !989, size: 512, align: 64, offset: 2304)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 512, align: 64, elements: !948)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !992, line: 94, baseType: !993)
!992 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !992, line: 81, size: 192, align: 64, elements: !994)
!994 = !{!995, !999, !1000}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !993, file: !992, line: 82, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !992, line: 73, baseType: !998)
!998 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !992, line: 73, flags: DIFlagFwdDecl)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !993, file: !992, line: 89, baseType: !944, size: 64, align: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !993, file: !992, line: 93, baseType: !936, size: 32, align: 32, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !940, file: !722, line: 473, baseType: !1002, size: 64, align: 64, offset: 2816)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !940, file: !722, line: 477, baseType: !936, size: 32, align: 32, offset: 2880)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !940, file: !722, line: 479, baseType: !1005, size: 64, align: 64, offset: 2944)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1009)
!1009 = !{!1010, !1011, !1012, !1013, !1018}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1008, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1008, file: !722, line: 203, baseType: !944, size: 64, align: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1008, file: !722, line: 204, baseType: !936, size: 32, align: 32, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1008, file: !722, line: 205, baseType: !1014, size: 64, align: 64, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1016, line: 86, baseType: !1017)
!1016 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1017 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1016, line: 86, flags: DIFlagFwdDecl)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1008, file: !722, line: 206, baseType: !990, size: 64, align: 64, offset: 256)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !940, file: !722, line: 480, baseType: !936, size: 32, align: 32, offset: 3008)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !940, file: !722, line: 505, baseType: !936, size: 32, align: 32, offset: 3040)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !940, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !940, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !940, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !940, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !940, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !940, file: !722, line: 532, baseType: !968, size: 64, align: 64, offset: 3264)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !940, file: !722, line: 539, baseType: !968, size: 64, align: 64, offset: 3328)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !940, file: !722, line: 547, baseType: !968, size: 64, align: 64, offset: 3392)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !940, file: !722, line: 554, baseType: !1014, size: 64, align: 64, offset: 3456)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !940, file: !722, line: 563, baseType: !936, size: 32, align: 32, offset: 3520)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !940, file: !722, line: 572, baseType: !936, size: 32, align: 32, offset: 3552)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !940, file: !722, line: 581, baseType: !936, size: 32, align: 32, offset: 3584)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !940, file: !722, line: 588, baseType: !1034, size: 64, align: 64, offset: 3648)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !946, line: 36, baseType: !1036)
!1036 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !940, file: !722, line: 593, baseType: !936, size: 32, align: 32, offset: 3712)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !940, file: !722, line: 596, baseType: !936, size: 32, align: 32, offset: 3744)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !940, file: !722, line: 599, baseType: !990, size: 64, align: 64, offset: 3776)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !940, file: !722, line: 605, baseType: !990, size: 64, align: 64, offset: 3840)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !940, file: !722, line: 616, baseType: !990, size: 64, align: 64, offset: 3904)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !940, file: !722, line: 626, baseType: !1043, size: 64, align: 64, offset: 3968)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1044, line: 216, baseType: !980)
!1044 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !940, file: !722, line: 627, baseType: !1043, size: 64, align: 64, offset: 4032)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !940, file: !722, line: 628, baseType: !1043, size: 64, align: 64, offset: 4096)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !940, file: !722, line: 629, baseType: !1043, size: 64, align: 64, offset: 4160)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !940, file: !722, line: 645, baseType: !990, size: 64, align: 64, offset: 4224)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1051, line: 221, size: 32, align: 8, elements: !1052)
!1051 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1052 = !{!1053}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1050, file: !1051, line: 221, baseType: !1054, size: 32, align: 32)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !946, line: 51, baseType: !937)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1059)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "av_alias32", file: !1051, line: 41, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !1051, line: 36, size: 32, align: 32, elements: !1061)
!1061 = !{!1062, !1063, !1069, !1073}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !1060, file: !1051, line: 37, baseType: !1054, size: 32, align: 32)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "u16", scope: !1060, file: !1051, line: 38, baseType: !1064, size: 32, align: 16)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 32, align: 16, elements: !1067)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !946, line: 49, baseType: !1066)
!1066 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1067 = !{!1068}
!1068 = !DISubrange(count: 2)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !1060, file: !1051, line: 39, baseType: !1070, size: 32, align: 8)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 32, align: 8, elements: !1071)
!1071 = !{!1072}
!1072 = !DISubrange(count: 4)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "f32", scope: !1060, file: !1051, line: 40, baseType: !1074, size: 32, align: 32)
!1074 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!1078 = !{!1079, !1692, !1697, !1701, !1706}
!1079 = distinct !DIGlobalVariable(name: "ff_webp_decoder", scope: !0, file: !888, line: 1576, type: !1080, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_webp_decoder)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1082)
!1082 = !{!1083, !1087, !1088, !1089, !1090, !1091, !1094, !1097, !1100, !1103, !1106, !1107, !1148, !1156, !1157, !1158, !1160, !1607, !1613, !1621, !1625, !1626, !1663, !1667, !1671, !1672, !1676, !1680, !1681, !1685, !1686, !1687}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1081, file: !14, line: 3475, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1086)
!1086 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1081, file: !14, line: 3480, baseType: !1084, size: 64, align: 64, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1081, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1081, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1081, file: !14, line: 3487, baseType: !936, size: 32, align: 32, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1081, file: !14, line: 3488, baseType: !1092, size: 64, align: 64, offset: 256)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1081, file: !14, line: 3489, baseType: !1095, size: 64, align: 64, offset: 320)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1081, file: !14, line: 3490, baseType: !1098, size: 64, align: 64, offset: 384)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1081, file: !14, line: 3491, baseType: !1101, size: 64, align: 64, offset: 448)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1081, file: !14, line: 3492, baseType: !1104, size: 64, align: 64, offset: 512)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1081, file: !14, line: 3493, baseType: !945, size: 8, align: 8, offset: 576)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1081, file: !14, line: 3494, baseType: !1108, size: 64, align: 64, offset: 640)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1110)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !1112)
!1112 = !{!1113, !1114, !1118, !1122, !1123, !1124, !1125, !1129, !1135, !1137, !1141}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1111, file: !691, line: 72, baseType: !1084, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1111, file: !691, line: 78, baseType: !1115, size: 64, align: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!1084, !976}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1111, file: !691, line: 85, baseType: !1119, size: 64, align: 64, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1121)
!1121 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1111, file: !691, line: 93, baseType: !936, size: 32, align: 32, offset: 192)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1111, file: !691, line: 99, baseType: !936, size: 32, align: 32, offset: 224)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1111, file: !691, line: 108, baseType: !936, size: 32, align: 32, offset: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1111, file: !691, line: 113, baseType: !1126, size: 64, align: 64, offset: 320)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!976, !976, !976}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1111, file: !691, line: 123, baseType: !1130, size: 64, align: 64, offset: 384)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!1133, !1133}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1111)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1111, file: !691, line: 130, baseType: !1136, size: 32, align: 32, offset: 448)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1111, file: !691, line: 136, baseType: !1138, size: 64, align: 64, offset: 512)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!1136, !976}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1111, file: !691, line: 142, baseType: !1142, size: 64, align: 64, offset: 576)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!936, !1145, !976, !1084, !936}
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1081, file: !14, line: 3495, baseType: !1149, size: 64, align: 64, offset: 704)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1151)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1152)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1153)
!1153 = !{!1154, !1155}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1152, file: !14, line: 3402, baseType: !936, size: 32, align: 32)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1152, file: !14, line: 3403, baseType: !1084, size: 64, align: 64, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1081, file: !14, line: 3507, baseType: !1084, size: 64, align: 64, offset: 768)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1081, file: !14, line: 3516, baseType: !936, size: 32, align: 32, offset: 832)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1081, file: !14, line: 3517, baseType: !1159, size: 64, align: 64, offset: 896)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1081, file: !14, line: 3527, baseType: !1161, size: 64, align: 64, offset: 960)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!936, !1164}
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1166)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1167)
!1167 = !{!1168, !1169, !1170, !1171, !1174, !1175, !1176, !1177, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1358, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1545, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1166, file: !14, line: 1561, baseType: !1108, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1166, file: !14, line: 1562, baseType: !936, size: 32, align: 32, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1166, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1166, file: !14, line: 1565, baseType: !1172, size: 64, align: 64, offset: 128)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1081)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1166, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1166, file: !14, line: 1581, baseType: !937, size: 32, align: 32, offset: 224)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1166, file: !14, line: 1583, baseType: !976, size: 64, align: 64, offset: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1166, file: !14, line: 1591, baseType: !1178, size: 64, align: 64, offset: 320)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1180, line: 129, size: 1664, align: 64, elements: !1181)
!1180 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1181 = !{!1182, !1183, !1184, !1185, !1186, !1205, !1206, !1235, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1179, file: !1180, line: 136, baseType: !936, size: 32, align: 32)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1179, file: !1180, line: 151, baseType: !936, size: 32, align: 32, offset: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1179, file: !1180, line: 157, baseType: !936, size: 32, align: 32, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1179, file: !1180, line: 159, baseType: !938, size: 64, align: 64, offset: 128)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1179, file: !1180, line: 161, baseType: !1187, size: 64, align: 64, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1180, line: 117, baseType: !1189)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1180, line: 100, size: 832, align: 64, elements: !1190)
!1190 = !{!1191, !1196, !1197, !1198, !1199, !1200, !1202, !1203, !1204}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1189, file: !1180, line: 105, baseType: !1192, size: 256, align: 64)
!1192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1193, size: 256, align: 64, elements: !1071)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !992, line: 238, baseType: !1195)
!1195 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !992, line: 238, flags: DIFlagFwdDecl)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1189, file: !1180, line: 110, baseType: !936, size: 32, align: 32, offset: 256)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1189, file: !1180, line: 111, baseType: !936, size: 32, align: 32, offset: 288)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1189, file: !1180, line: 111, baseType: !936, size: 32, align: 32, offset: 320)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1189, file: !1180, line: 112, baseType: !951, size: 256, align: 32, offset: 352)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1189, file: !1180, line: 113, baseType: !1201, size: 128, align: 32, offset: 608)
!1201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 128, align: 32, elements: !1071)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1189, file: !1180, line: 114, baseType: !936, size: 32, align: 32, offset: 736)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1189, file: !1180, line: 115, baseType: !936, size: 32, align: 32, offset: 768)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1189, file: !1180, line: 116, baseType: !936, size: 32, align: 32, offset: 800)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1179, file: !1180, line: 163, baseType: !976, size: 64, align: 64, offset: 256)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1179, file: !1180, line: 165, baseType: !1207, size: 128, align: 64, offset: 320)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1180, line: 122, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1180, line: 119, size: 128, align: 64, elements: !1209)
!1209 = !{!1210, !1234}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1208, file: !1180, line: 120, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1214)
!1214 = !{!1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1230, !1231, !1232, !1233}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1213, file: !14, line: 1451, baseType: !990, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1213, file: !14, line: 1461, baseType: !968, size: 64, align: 64, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1213, file: !14, line: 1467, baseType: !968, size: 64, align: 64, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1213, file: !14, line: 1468, baseType: !944, size: 64, align: 64, offset: 192)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1213, file: !14, line: 1469, baseType: !936, size: 32, align: 32, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1213, file: !14, line: 1470, baseType: !936, size: 32, align: 32, offset: 288)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1213, file: !14, line: 1474, baseType: !936, size: 32, align: 32, offset: 320)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1213, file: !14, line: 1479, baseType: !1223, size: 64, align: 64, offset: 384)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1225)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1226)
!1226 = !{!1227, !1228, !1229}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1225, file: !14, line: 1412, baseType: !944, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1225, file: !14, line: 1413, baseType: !936, size: 32, align: 32, offset: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1225, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1213, file: !14, line: 1480, baseType: !936, size: 32, align: 32, offset: 448)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1213, file: !14, line: 1486, baseType: !968, size: 64, align: 64, offset: 512)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1213, file: !14, line: 1488, baseType: !968, size: 64, align: 64, offset: 576)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1213, file: !14, line: 1497, baseType: !968, size: 64, align: 64, offset: 640)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1208, file: !1180, line: 121, baseType: !938, size: 64, align: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1179, file: !1180, line: 166, baseType: !1236, size: 128, align: 64, offset: 448)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1180, line: 127, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1180, line: 124, size: 128, align: 64, elements: !1238)
!1238 = !{!1239, !1312}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1237, file: !1180, line: 125, baseType: !1240, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1243)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1244)
!1244 = !{!1245, !1246, !1270, !1274, !1275, !1309, !1310, !1311}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1243, file: !14, line: 5751, baseType: !1108, size: 64, align: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1243, file: !14, line: 5756, baseType: !1247, size: 64, align: 64, offset: 64)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1249)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1250)
!1250 = !{!1251, !1252, !1255, !1256, !1257, !1261, !1265, !1269}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1249, file: !14, line: 5797, baseType: !1084, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1249, file: !14, line: 5804, baseType: !1253, size: 64, align: 64, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1249, file: !14, line: 5815, baseType: !1108, size: 64, align: 64, offset: 128)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1249, file: !14, line: 5825, baseType: !936, size: 32, align: 32, offset: 192)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1249, file: !14, line: 5826, baseType: !1258, size: 64, align: 64, offset: 256)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!936, !1241}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1249, file: !14, line: 5827, baseType: !1262, size: 64, align: 64, offset: 320)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!936, !1241, !1211}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1249, file: !14, line: 5828, baseType: !1266, size: 64, align: 64, offset: 384)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{null, !1241}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1249, file: !14, line: 5829, baseType: !1266, size: 64, align: 64, offset: 448)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1243, file: !14, line: 5762, baseType: !1271, size: 64, align: 64, offset: 128)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1273)
!1273 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1243, file: !14, line: 5768, baseType: !976, size: 64, align: 64, offset: 192)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1243, file: !14, line: 5775, baseType: !1276, size: 64, align: 64, offset: 256)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1278)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1279)
!1279 = !{!1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1278, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1278, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1278, file: !14, line: 3948, baseType: !1054, size: 32, align: 32, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1278, file: !14, line: 3958, baseType: !944, size: 64, align: 64, offset: 128)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1278, file: !14, line: 3962, baseType: !936, size: 32, align: 32, offset: 192)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1278, file: !14, line: 3968, baseType: !936, size: 32, align: 32, offset: 224)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1278, file: !14, line: 3973, baseType: !968, size: 64, align: 64, offset: 256)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1278, file: !14, line: 3986, baseType: !936, size: 32, align: 32, offset: 320)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1278, file: !14, line: 3999, baseType: !936, size: 32, align: 32, offset: 352)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1278, file: !14, line: 4004, baseType: !936, size: 32, align: 32, offset: 384)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1278, file: !14, line: 4005, baseType: !936, size: 32, align: 32, offset: 416)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1278, file: !14, line: 4010, baseType: !936, size: 32, align: 32, offset: 448)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1278, file: !14, line: 4011, baseType: !936, size: 32, align: 32, offset: 480)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1278, file: !14, line: 4020, baseType: !961, size: 64, align: 32, offset: 512)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1278, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1278, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1278, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1278, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1278, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1278, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1278, file: !14, line: 4039, baseType: !936, size: 32, align: 32, offset: 768)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1278, file: !14, line: 4046, baseType: !979, size: 64, align: 64, offset: 832)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1278, file: !14, line: 4050, baseType: !936, size: 32, align: 32, offset: 896)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1278, file: !14, line: 4054, baseType: !936, size: 32, align: 32, offset: 928)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1278, file: !14, line: 4061, baseType: !936, size: 32, align: 32, offset: 960)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1278, file: !14, line: 4065, baseType: !936, size: 32, align: 32, offset: 992)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1278, file: !14, line: 4073, baseType: !936, size: 32, align: 32, offset: 1024)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1278, file: !14, line: 4080, baseType: !936, size: 32, align: 32, offset: 1056)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1278, file: !14, line: 4084, baseType: !936, size: 32, align: 32, offset: 1088)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1243, file: !14, line: 5781, baseType: !1276, size: 64, align: 64, offset: 320)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1243, file: !14, line: 5787, baseType: !961, size: 64, align: 32, offset: 384)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1243, file: !14, line: 5793, baseType: !961, size: 64, align: 32, offset: 448)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1237, file: !1180, line: 126, baseType: !936, size: 32, align: 32, offset: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1179, file: !1180, line: 172, baseType: !1211, size: 64, align: 64, offset: 576)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1179, file: !1180, line: 177, baseType: !944, size: 64, align: 64, offset: 640)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1179, file: !1180, line: 178, baseType: !937, size: 32, align: 32, offset: 704)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1179, file: !1180, line: 180, baseType: !976, size: 64, align: 64, offset: 768)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1179, file: !1180, line: 185, baseType: !936, size: 32, align: 32, offset: 832)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1179, file: !1180, line: 190, baseType: !976, size: 64, align: 64, offset: 896)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1179, file: !1180, line: 195, baseType: !936, size: 32, align: 32, offset: 960)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1179, file: !1180, line: 200, baseType: !1211, size: 64, align: 64, offset: 1024)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1179, file: !1180, line: 201, baseType: !936, size: 32, align: 32, offset: 1088)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1179, file: !1180, line: 202, baseType: !938, size: 64, align: 64, offset: 1152)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1179, file: !1180, line: 203, baseType: !936, size: 32, align: 32, offset: 1216)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1179, file: !1180, line: 205, baseType: !936, size: 32, align: 32, offset: 1248)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1179, file: !1180, line: 206, baseType: !936, size: 32, align: 32, offset: 1280)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1179, file: !1180, line: 209, baseType: !1043, size: 64, align: 64, offset: 1344)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1179, file: !1180, line: 212, baseType: !1043, size: 64, align: 64, offset: 1408)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1179, file: !1180, line: 213, baseType: !938, size: 64, align: 64, offset: 1472)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1179, file: !1180, line: 215, baseType: !936, size: 32, align: 32, offset: 1536)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1179, file: !1180, line: 217, baseType: !936, size: 32, align: 32, offset: 1568)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1179, file: !1180, line: 220, baseType: !936, size: 32, align: 32, offset: 1600)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1166, file: !14, line: 1598, baseType: !976, size: 64, align: 64, offset: 384)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1166, file: !14, line: 1606, baseType: !968, size: 64, align: 64, offset: 448)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1166, file: !14, line: 1614, baseType: !936, size: 32, align: 32, offset: 512)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1166, file: !14, line: 1622, baseType: !936, size: 32, align: 32, offset: 544)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1166, file: !14, line: 1628, baseType: !936, size: 32, align: 32, offset: 576)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1166, file: !14, line: 1636, baseType: !936, size: 32, align: 32, offset: 608)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1166, file: !14, line: 1643, baseType: !936, size: 32, align: 32, offset: 640)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1166, file: !14, line: 1657, baseType: !944, size: 64, align: 64, offset: 704)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1166, file: !14, line: 1658, baseType: !936, size: 32, align: 32, offset: 768)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1166, file: !14, line: 1679, baseType: !961, size: 64, align: 32, offset: 800)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1166, file: !14, line: 1688, baseType: !936, size: 32, align: 32, offset: 864)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1166, file: !14, line: 1712, baseType: !936, size: 32, align: 32, offset: 896)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1166, file: !14, line: 1729, baseType: !936, size: 32, align: 32, offset: 928)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1166, file: !14, line: 1729, baseType: !936, size: 32, align: 32, offset: 960)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1166, file: !14, line: 1744, baseType: !936, size: 32, align: 32, offset: 992)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1166, file: !14, line: 1744, baseType: !936, size: 32, align: 32, offset: 1024)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1166, file: !14, line: 1751, baseType: !936, size: 32, align: 32, offset: 1056)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1166, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1166, file: !14, line: 1791, baseType: !1351, size: 64, align: 64, offset: 1152)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{null, !1354, !1355, !1357, !936, !936, !936}
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1166, file: !14, line: 1808, baseType: !1359, size: 64, align: 64, offset: 1216)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DISubroutineType(types: !1361)
!1361 = !{!473, !1354, !1095}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1166, file: !14, line: 1816, baseType: !936, size: 32, align: 32, offset: 1280)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1166, file: !14, line: 1825, baseType: !1074, size: 32, align: 32, offset: 1312)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1166, file: !14, line: 1830, baseType: !936, size: 32, align: 32, offset: 1344)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1166, file: !14, line: 1838, baseType: !1074, size: 32, align: 32, offset: 1376)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1166, file: !14, line: 1846, baseType: !936, size: 32, align: 32, offset: 1408)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1166, file: !14, line: 1851, baseType: !936, size: 32, align: 32, offset: 1440)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1166, file: !14, line: 1861, baseType: !1074, size: 32, align: 32, offset: 1472)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1166, file: !14, line: 1868, baseType: !1074, size: 32, align: 32, offset: 1504)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1166, file: !14, line: 1875, baseType: !1074, size: 32, align: 32, offset: 1536)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1166, file: !14, line: 1882, baseType: !1074, size: 32, align: 32, offset: 1568)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1166, file: !14, line: 1889, baseType: !1074, size: 32, align: 32, offset: 1600)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1166, file: !14, line: 1896, baseType: !1074, size: 32, align: 32, offset: 1632)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1166, file: !14, line: 1903, baseType: !1074, size: 32, align: 32, offset: 1664)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1166, file: !14, line: 1910, baseType: !936, size: 32, align: 32, offset: 1696)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1166, file: !14, line: 1915, baseType: !936, size: 32, align: 32, offset: 1728)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1166, file: !14, line: 1926, baseType: !1357, size: 64, align: 64, offset: 1792)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1166, file: !14, line: 1935, baseType: !961, size: 64, align: 32, offset: 1856)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1166, file: !14, line: 1942, baseType: !936, size: 32, align: 32, offset: 1920)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1166, file: !14, line: 1948, baseType: !936, size: 32, align: 32, offset: 1952)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1166, file: !14, line: 1954, baseType: !936, size: 32, align: 32, offset: 1984)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1166, file: !14, line: 1960, baseType: !936, size: 32, align: 32, offset: 2016)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1166, file: !14, line: 1984, baseType: !936, size: 32, align: 32, offset: 2048)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1166, file: !14, line: 1991, baseType: !936, size: 32, align: 32, offset: 2080)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1166, file: !14, line: 1996, baseType: !936, size: 32, align: 32, offset: 2112)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1166, file: !14, line: 2004, baseType: !936, size: 32, align: 32, offset: 2144)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1166, file: !14, line: 2011, baseType: !936, size: 32, align: 32, offset: 2176)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1166, file: !14, line: 2018, baseType: !936, size: 32, align: 32, offset: 2208)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1166, file: !14, line: 2027, baseType: !936, size: 32, align: 32, offset: 2240)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1166, file: !14, line: 2034, baseType: !936, size: 32, align: 32, offset: 2272)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1166, file: !14, line: 2044, baseType: !936, size: 32, align: 32, offset: 2304)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1166, file: !14, line: 2054, baseType: !1393, size: 64, align: 64, offset: 2368)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1166, file: !14, line: 2061, baseType: !1393, size: 64, align: 64, offset: 2432)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1166, file: !14, line: 2066, baseType: !936, size: 32, align: 32, offset: 2496)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1166, file: !14, line: 2070, baseType: !936, size: 32, align: 32, offset: 2528)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1166, file: !14, line: 2078, baseType: !936, size: 32, align: 32, offset: 2560)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1166, file: !14, line: 2085, baseType: !936, size: 32, align: 32, offset: 2592)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1166, file: !14, line: 2092, baseType: !936, size: 32, align: 32, offset: 2624)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1166, file: !14, line: 2099, baseType: !936, size: 32, align: 32, offset: 2656)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1166, file: !14, line: 2106, baseType: !936, size: 32, align: 32, offset: 2688)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1166, file: !14, line: 2113, baseType: !936, size: 32, align: 32, offset: 2720)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1166, file: !14, line: 2120, baseType: !936, size: 32, align: 32, offset: 2752)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1166, file: !14, line: 2125, baseType: !936, size: 32, align: 32, offset: 2784)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1166, file: !14, line: 2133, baseType: !936, size: 32, align: 32, offset: 2816)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1166, file: !14, line: 2140, baseType: !936, size: 32, align: 32, offset: 2848)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1166, file: !14, line: 2145, baseType: !936, size: 32, align: 32, offset: 2880)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1166, file: !14, line: 2153, baseType: !936, size: 32, align: 32, offset: 2912)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1166, file: !14, line: 2158, baseType: !936, size: 32, align: 32, offset: 2944)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1166, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1166, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1166, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1166, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1166, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1166, file: !14, line: 2203, baseType: !936, size: 32, align: 32, offset: 3136)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1166, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1166, file: !14, line: 2212, baseType: !936, size: 32, align: 32, offset: 3200)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1166, file: !14, line: 2213, baseType: !936, size: 32, align: 32, offset: 3232)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1166, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1166, file: !14, line: 2232, baseType: !936, size: 32, align: 32, offset: 3296)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1166, file: !14, line: 2243, baseType: !936, size: 32, align: 32, offset: 3328)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1166, file: !14, line: 2249, baseType: !936, size: 32, align: 32, offset: 3360)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1166, file: !14, line: 2256, baseType: !936, size: 32, align: 32, offset: 3392)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1166, file: !14, line: 2263, baseType: !979, size: 64, align: 64, offset: 3456)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1166, file: !14, line: 2270, baseType: !979, size: 64, align: 64, offset: 3520)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1166, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1166, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1166, file: !14, line: 2367, baseType: !1429, size: 64, align: 64, offset: 3648)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DISubroutineType(types: !1431)
!1431 = !{!936, !1354, !938, !936}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1166, file: !14, line: 2383, baseType: !936, size: 32, align: 32, offset: 3712)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1166, file: !14, line: 2386, baseType: !1074, size: 32, align: 32, offset: 3744)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1166, file: !14, line: 2387, baseType: !1074, size: 32, align: 32, offset: 3776)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1166, file: !14, line: 2394, baseType: !936, size: 32, align: 32, offset: 3808)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1166, file: !14, line: 2401, baseType: !936, size: 32, align: 32, offset: 3840)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1166, file: !14, line: 2408, baseType: !936, size: 32, align: 32, offset: 3872)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1166, file: !14, line: 2415, baseType: !936, size: 32, align: 32, offset: 3904)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1166, file: !14, line: 2422, baseType: !936, size: 32, align: 32, offset: 3936)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1166, file: !14, line: 2423, baseType: !1441, size: 64, align: 64, offset: 3968)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1443)
!1443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1444)
!1444 = !{!1445, !1446, !1447, !1448}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1443, file: !14, line: 827, baseType: !936, size: 32, align: 32)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1443, file: !14, line: 828, baseType: !936, size: 32, align: 32, offset: 32)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1443, file: !14, line: 829, baseType: !936, size: 32, align: 32, offset: 64)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1443, file: !14, line: 830, baseType: !1074, size: 32, align: 32, offset: 96)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1166, file: !14, line: 2430, baseType: !968, size: 64, align: 64, offset: 4032)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1166, file: !14, line: 2437, baseType: !968, size: 64, align: 64, offset: 4096)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1166, file: !14, line: 2444, baseType: !1074, size: 32, align: 32, offset: 4160)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1166, file: !14, line: 2451, baseType: !1074, size: 32, align: 32, offset: 4192)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1166, file: !14, line: 2458, baseType: !936, size: 32, align: 32, offset: 4224)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1166, file: !14, line: 2469, baseType: !936, size: 32, align: 32, offset: 4256)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1166, file: !14, line: 2475, baseType: !936, size: 32, align: 32, offset: 4288)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1166, file: !14, line: 2481, baseType: !936, size: 32, align: 32, offset: 4320)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1166, file: !14, line: 2485, baseType: !936, size: 32, align: 32, offset: 4352)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1166, file: !14, line: 2489, baseType: !936, size: 32, align: 32, offset: 4384)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1166, file: !14, line: 2493, baseType: !936, size: 32, align: 32, offset: 4416)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1166, file: !14, line: 2501, baseType: !936, size: 32, align: 32, offset: 4448)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1166, file: !14, line: 2506, baseType: !936, size: 32, align: 32, offset: 4480)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1166, file: !14, line: 2510, baseType: !936, size: 32, align: 32, offset: 4512)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1166, file: !14, line: 2514, baseType: !968, size: 64, align: 64, offset: 4544)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1166, file: !14, line: 2528, baseType: !1465, size: 64, align: 64, offset: 4608)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{null, !1354, !976, !936, !936}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1166, file: !14, line: 2534, baseType: !936, size: 32, align: 32, offset: 4672)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1166, file: !14, line: 2545, baseType: !936, size: 32, align: 32, offset: 4704)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1166, file: !14, line: 2547, baseType: !936, size: 32, align: 32, offset: 4736)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1166, file: !14, line: 2549, baseType: !936, size: 32, align: 32, offset: 4768)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1166, file: !14, line: 2551, baseType: !936, size: 32, align: 32, offset: 4800)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1166, file: !14, line: 2553, baseType: !936, size: 32, align: 32, offset: 4832)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1166, file: !14, line: 2555, baseType: !936, size: 32, align: 32, offset: 4864)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1166, file: !14, line: 2557, baseType: !936, size: 32, align: 32, offset: 4896)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1166, file: !14, line: 2559, baseType: !936, size: 32, align: 32, offset: 4928)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1166, file: !14, line: 2563, baseType: !936, size: 32, align: 32, offset: 4960)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1166, file: !14, line: 2571, baseType: !1479, size: 64, align: 64, offset: 4992)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1166, file: !14, line: 2579, baseType: !1479, size: 64, align: 64, offset: 5056)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1166, file: !14, line: 2586, baseType: !936, size: 32, align: 32, offset: 5120)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1166, file: !14, line: 2615, baseType: !936, size: 32, align: 32, offset: 5152)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1166, file: !14, line: 2627, baseType: !936, size: 32, align: 32, offset: 5184)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1166, file: !14, line: 2637, baseType: !936, size: 32, align: 32, offset: 5216)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1166, file: !14, line: 2681, baseType: !936, size: 32, align: 32, offset: 5248)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1166, file: !14, line: 2709, baseType: !968, size: 64, align: 64, offset: 5312)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1166, file: !14, line: 2716, baseType: !1488, size: 64, align: 64, offset: 5376)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1490)
!1490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1491)
!1491 = !{!1492, !1493, !1494, !1495, !1496, !1497, !1501, !1505, !1509, !1510, !1511, !1512, !1518, !1519, !1520, !1521, !1522}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1490, file: !14, line: 3642, baseType: !1084, size: 64, align: 64)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1490, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1490, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1490, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1490, file: !14, line: 3669, baseType: !936, size: 32, align: 32, offset: 160)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1490, file: !14, line: 3682, baseType: !1498, size: 64, align: 64, offset: 192)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DISubroutineType(types: !1500)
!1500 = !{!936, !1164, !938}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1490, file: !14, line: 3698, baseType: !1502, size: 64, align: 64, offset: 256)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{!936, !1164, !1076, !1054}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1490, file: !14, line: 3712, baseType: !1506, size: 64, align: 64, offset: 320)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DISubroutineType(types: !1508)
!1508 = !{!936, !1164, !936, !1076, !1054}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1490, file: !14, line: 3726, baseType: !1502, size: 64, align: 64, offset: 384)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1490, file: !14, line: 3737, baseType: !1161, size: 64, align: 64, offset: 448)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1490, file: !14, line: 3746, baseType: !936, size: 32, align: 32, offset: 512)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1490, file: !14, line: 3757, baseType: !1513, size: 64, align: 64, offset: 576)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DISubroutineType(types: !1515)
!1515 = !{null, !1516}
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1490, file: !14, line: 3766, baseType: !1161, size: 64, align: 64, offset: 640)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1490, file: !14, line: 3774, baseType: !1161, size: 64, align: 64, offset: 704)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1490, file: !14, line: 3780, baseType: !936, size: 32, align: 32, offset: 768)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1490, file: !14, line: 3785, baseType: !936, size: 32, align: 32, offset: 800)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1490, file: !14, line: 3795, baseType: !1523, size: 64, align: 64, offset: 832)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DISubroutineType(types: !1525)
!1525 = !{!936, !1164, !990}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1166, file: !14, line: 2728, baseType: !976, size: 64, align: 64, offset: 5440)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1166, file: !14, line: 2735, baseType: !978, size: 512, align: 64, offset: 5504)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1166, file: !14, line: 2742, baseType: !936, size: 32, align: 32, offset: 6016)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1166, file: !14, line: 2755, baseType: !936, size: 32, align: 32, offset: 6048)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1166, file: !14, line: 2776, baseType: !936, size: 32, align: 32, offset: 6080)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1166, file: !14, line: 2783, baseType: !936, size: 32, align: 32, offset: 6112)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1166, file: !14, line: 2791, baseType: !936, size: 32, align: 32, offset: 6144)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1166, file: !14, line: 2802, baseType: !938, size: 64, align: 64, offset: 6208)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1166, file: !14, line: 2811, baseType: !936, size: 32, align: 32, offset: 6272)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1166, file: !14, line: 2821, baseType: !936, size: 32, align: 32, offset: 6304)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1166, file: !14, line: 2830, baseType: !936, size: 32, align: 32, offset: 6336)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1166, file: !14, line: 2840, baseType: !936, size: 32, align: 32, offset: 6368)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1166, file: !14, line: 2851, baseType: !1539, size: 64, align: 64, offset: 6400)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64, align: 64)
!1540 = !DISubroutineType(types: !1541)
!1541 = !{!936, !1354, !1542, !976, !1357, !936, !936}
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DISubroutineType(types: !1544)
!1544 = !{!936, !1354, !976}
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1166, file: !14, line: 2871, baseType: !1546, size: 64, align: 64, offset: 6464)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DISubroutineType(types: !1548)
!1548 = !{!936, !1354, !1549, !976, !1357, !936}
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64, align: 64)
!1550 = !DISubroutineType(types: !1551)
!1551 = !{!936, !1354, !976, !936, !936}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1166, file: !14, line: 2878, baseType: !936, size: 32, align: 32, offset: 6528)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1166, file: !14, line: 2885, baseType: !936, size: 32, align: 32, offset: 6560)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1166, file: !14, line: 3005, baseType: !936, size: 32, align: 32, offset: 6592)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1166, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1166, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1166, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1166, file: !14, line: 3037, baseType: !944, size: 64, align: 64, offset: 6720)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1166, file: !14, line: 3038, baseType: !936, size: 32, align: 32, offset: 6784)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1166, file: !14, line: 3050, baseType: !979, size: 64, align: 64, offset: 6848)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1166, file: !14, line: 3065, baseType: !936, size: 32, align: 32, offset: 6912)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1166, file: !14, line: 3083, baseType: !936, size: 32, align: 32, offset: 6944)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1166, file: !14, line: 3092, baseType: !961, size: 64, align: 32, offset: 6976)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1166, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1166, file: !14, line: 3106, baseType: !961, size: 64, align: 32, offset: 7072)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1166, file: !14, line: 3113, baseType: !1567, size: 64, align: 64, offset: 7168)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1569)
!1569 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1570)
!1570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1571)
!1571 = !{!1572, !1573, !1574, !1575, !1576, !1577, !1580}
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1570, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1570, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1570, file: !14, line: 720, baseType: !1084, size: 64, align: 64, offset: 64)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1570, file: !14, line: 724, baseType: !1084, size: 64, align: 64, offset: 128)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1570, file: !14, line: 728, baseType: !936, size: 32, align: 32, offset: 192)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1570, file: !14, line: 734, baseType: !1578, size: 64, align: 64, offset: 256)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64, align: 64)
!1579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1084)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1570, file: !14, line: 739, baseType: !1581, size: 64, align: 64, offset: 320)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64, align: 64)
!1582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1152)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1166, file: !14, line: 3129, baseType: !968, size: 64, align: 64, offset: 7232)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1166, file: !14, line: 3130, baseType: !968, size: 64, align: 64, offset: 7296)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1166, file: !14, line: 3131, baseType: !968, size: 64, align: 64, offset: 7360)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1166, file: !14, line: 3132, baseType: !968, size: 64, align: 64, offset: 7424)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1166, file: !14, line: 3139, baseType: !1479, size: 64, align: 64, offset: 7488)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1166, file: !14, line: 3147, baseType: !936, size: 32, align: 32, offset: 7552)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1166, file: !14, line: 3165, baseType: !936, size: 32, align: 32, offset: 7584)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1166, file: !14, line: 3172, baseType: !936, size: 32, align: 32, offset: 7616)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1166, file: !14, line: 3180, baseType: !936, size: 32, align: 32, offset: 7648)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1166, file: !14, line: 3191, baseType: !1393, size: 64, align: 64, offset: 7680)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1166, file: !14, line: 3199, baseType: !944, size: 64, align: 64, offset: 7744)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1166, file: !14, line: 3207, baseType: !1479, size: 64, align: 64, offset: 7808)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1166, file: !14, line: 3214, baseType: !937, size: 32, align: 32, offset: 7872)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1166, file: !14, line: 3224, baseType: !1223, size: 64, align: 64, offset: 7936)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1166, file: !14, line: 3225, baseType: !936, size: 32, align: 32, offset: 8000)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1166, file: !14, line: 3249, baseType: !990, size: 64, align: 64, offset: 8064)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1166, file: !14, line: 3256, baseType: !936, size: 32, align: 32, offset: 8128)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1166, file: !14, line: 3271, baseType: !936, size: 32, align: 32, offset: 8160)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1166, file: !14, line: 3279, baseType: !968, size: 64, align: 64, offset: 8192)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1166, file: !14, line: 3301, baseType: !990, size: 64, align: 64, offset: 8256)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1166, file: !14, line: 3310, baseType: !936, size: 32, align: 32, offset: 8320)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1166, file: !14, line: 3337, baseType: !936, size: 32, align: 32, offset: 8352)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1166, file: !14, line: 3351, baseType: !936, size: 32, align: 32, offset: 8384)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1166, file: !14, line: 3359, baseType: !936, size: 32, align: 32, offset: 8416)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1081, file: !14, line: 3535, baseType: !1608, size: 64, align: 64, offset: 1024)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = !DISubroutineType(types: !1610)
!1610 = !{!936, !1164, !1611}
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1165)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1081, file: !14, line: 3541, baseType: !1614, size: 64, align: 64, offset: 1088)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1615, size: 64, align: 64)
!1615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1616)
!1616 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1617)
!1617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1180, line: 223, size: 128, align: 64, elements: !1618)
!1618 = !{!1619, !1620}
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1617, file: !1180, line: 224, baseType: !1076, size: 64, align: 64)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1617, file: !1180, line: 225, baseType: !1076, size: 64, align: 64, offset: 64)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1081, file: !14, line: 3549, baseType: !1622, size: 64, align: 64, offset: 1152)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DISubroutineType(types: !1624)
!1624 = !{null, !1159}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1081, file: !14, line: 3551, baseType: !1161, size: 64, align: 64, offset: 1216)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1081, file: !14, line: 3552, baseType: !1627, size: 64, align: 64, offset: 1280)
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64, align: 64)
!1628 = !DISubroutineType(types: !1629)
!1629 = !{!936, !1164, !944, !936, !1630}
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1632)
!1632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1633)
!1633 = !{!1634, !1635, !1636, !1637, !1638, !1662}
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1632, file: !14, line: 3921, baseType: !1065, size: 16, align: 16)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1632, file: !14, line: 3922, baseType: !1054, size: 32, align: 32, offset: 32)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1632, file: !14, line: 3923, baseType: !1054, size: 32, align: 32, offset: 64)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1632, file: !14, line: 3924, baseType: !937, size: 32, align: 32, offset: 96)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1632, file: !14, line: 3925, baseType: !1639, size: 64, align: 64, offset: 128)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1642)
!1642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1643)
!1643 = !{!1644, !1645, !1646, !1647, !1648, !1649, !1655, !1657, !1658, !1659, !1660, !1661}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1642, file: !14, line: 3886, baseType: !936, size: 32, align: 32)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1642, file: !14, line: 3887, baseType: !936, size: 32, align: 32, offset: 32)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1642, file: !14, line: 3888, baseType: !936, size: 32, align: 32, offset: 64)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1642, file: !14, line: 3889, baseType: !936, size: 32, align: 32, offset: 96)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1642, file: !14, line: 3890, baseType: !936, size: 32, align: 32, offset: 128)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1642, file: !14, line: 3897, baseType: !1650, size: 768, align: 64, offset: 192)
!1650 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1651)
!1651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1652)
!1652 = !{!1653, !1654}
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1651, file: !14, line: 3855, baseType: !943, size: 512, align: 64)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1651, file: !14, line: 3857, baseType: !951, size: 256, align: 32, offset: 512)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1642, file: !14, line: 3903, baseType: !1656, size: 256, align: 64, offset: 960)
!1656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 256, align: 64, elements: !1071)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1642, file: !14, line: 3904, baseType: !1201, size: 128, align: 32, offset: 1216)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1642, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1642, file: !14, line: 3908, baseType: !1479, size: 64, align: 64, offset: 1408)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1642, file: !14, line: 3915, baseType: !1479, size: 64, align: 64, offset: 1472)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1642, file: !14, line: 3917, baseType: !936, size: 32, align: 32, offset: 1536)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1632, file: !14, line: 3926, baseType: !968, size: 64, align: 64, offset: 192)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1081, file: !14, line: 3564, baseType: !1664, size: 64, align: 64, offset: 1344)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64, align: 64)
!1665 = !DISubroutineType(types: !1666)
!1666 = !{!936, !1164, !1211, !1355, !1357}
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1081, file: !14, line: 3566, baseType: !1668, size: 64, align: 64, offset: 1408)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DISubroutineType(types: !1670)
!1670 = !{!936, !1164, !976, !1357, !1211}
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1081, file: !14, line: 3567, baseType: !1161, size: 64, align: 64, offset: 1472)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1081, file: !14, line: 3576, baseType: !1673, size: 64, align: 64, offset: 1536)
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64, align: 64)
!1674 = !DISubroutineType(types: !1675)
!1675 = !{!936, !1164, !1355}
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1081, file: !14, line: 3577, baseType: !1677, size: 64, align: 64, offset: 1600)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64, align: 64)
!1678 = !DISubroutineType(types: !1679)
!1679 = !{!936, !1164, !1211}
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1081, file: !14, line: 3584, baseType: !1498, size: 64, align: 64, offset: 1664)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1081, file: !14, line: 3589, baseType: !1682, size: 64, align: 64, offset: 1728)
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64, align: 64)
!1683 = !DISubroutineType(types: !1684)
!1684 = !{null, !1164}
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1081, file: !14, line: 3594, baseType: !936, size: 32, align: 32, offset: 1792)
