; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--id3v2.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--id3v2.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVMetadataConv = type { i8*, i8* }
%struct.CodecMime = type { [32 x i8], i32 }
%struct.AVRational = type { i32, i32 }
%struct.ID3v2EMFunc = type { i8*, i8*, void (%struct.AVFormatContext*, %struct.AVIOContext*, i32, i8*, %struct.ID3v2ExtraMeta**, i32)*, void (i8*)* }

!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ID3v2Encoding", file: !917, line: 44, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "libavformat/id3v2.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!918 = !{!919, !920, !921, !922}
!919 = !DIEnumerator(name: "ID3v2_ENCODING_ISO8859", value: 0)
!920 = !DIEnumerator(name: "ID3v2_ENCODING_UTF16BOM", value: 1)
!921 = !DIEnumerator(name: "ID3v2_ENCODING_UTF16BE", value: 2)
!922 = !DIEnumerator(name: "ID3v2_ENCODING_UTF8", value: 3)
!923 = !{!924, !933, !934, !935, !936, !942, !944, !930}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!925 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !927, line: 220, size: 64, align: 8, elements: !928)
!927 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!928 = !{!929}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !926, file: !927, line: 220, baseType: !930, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !931, line: 55, baseType: !932)
!931 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!932 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!934 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!935 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !927, line: 221, size: 32, align: 8, elements: !939)
!939 = !{!940}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !938, file: !927, line: 221, baseType: !941, size: 32, align: 32)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !931, line: 51, baseType: !934)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!946 = !{!947, !959, !963, !968, !972, !976, !981, !995, !999}
!947 = distinct !DIGlobalVariable(name: "ff_id3v2_34_metadata_conv", scope: !0, file: !948, line: 45, type: !949, isLocal: false, isDefinition: true, variable: [16 x %struct.AVMetadataConv]* @ff_id3v2_34_metadata_conv)
!948 = !DIFile(filename: "libavformat/id3v2.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 2048, align: 64, elements: !957)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVMetadataConv", file: !952, line: 37, baseType: !953)
!952 = !DIFile(filename: "libavformat/metadata.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVMetadataConv", file: !952, line: 34, size: 128, align: 64, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "native", scope: !953, file: !952, line: 35, baseType: !944, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !953, file: !952, line: 36, baseType: !944, size: 64, align: 64, offset: 64)
!957 = !{!958}
!958 = !DISubrange(count: 16)
!959 = distinct !DIGlobalVariable(name: "ff_id3v2_4_metadata_conv", scope: !0, file: !948, line: 64, type: !960, isLocal: false, isDefinition: true, variable: [8 x %struct.AVMetadataConv]* @ff_id3v2_4_metadata_conv)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 1024, align: 64, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 8)
!963 = distinct !DIGlobalVariable(name: "ff_id3v2_tags", scope: !0, file: !948, line: 88, type: !964, isLocal: false, isDefinition: true, variable: [33 x [4 x i8]]* @ff_id3v2_tags)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 1056, align: 8, elements: !965)
!965 = !{!966, !967}
!966 = !DISubrange(count: 33)
!967 = !DISubrange(count: 4)
!968 = distinct !DIGlobalVariable(name: "ff_id3v2_4_tags", scope: !0, file: !948, line: 96, type: !969, isLocal: false, isDefinition: true, variable: [14 x [4 x i8]]* @ff_id3v2_4_tags)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 448, align: 8, elements: !970)
!970 = !{!971, !967}
!971 = !DISubrange(count: 14)
!972 = distinct !DIGlobalVariable(name: "ff_id3v2_3_tags", scope: !0, file: !948, line: 102, type: !973, isLocal: false, isDefinition: true, variable: [7 x [4 x i8]]* @ff_id3v2_3_tags)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 224, align: 8, elements: !974)
!974 = !{!975, !967}
!975 = !DISubrange(count: 7)
!976 = distinct !DIGlobalVariable(name: "ff_id3v2_picture_types", scope: !0, file: !948, line: 107, type: !977, isLocal: false, isDefinition: true, variable: [21 x i8*]* @ff_id3v2_picture_types)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 1344, align: 64, elements: !979)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!979 = !{!980}
!980 = !DISubrange(count: 21)
!981 = distinct !DIGlobalVariable(name: "ff_id3v2_mime_tags", scope: !0, file: !948, line: 131, type: !982, isLocal: false, isDefinition: true, variable: [9 x %struct.CodecMime]* @ff_id3v2_mime_tags)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !983, size: 2592, align: 32, elements: !993)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodecMime", file: !985, line: 52, baseType: !986)
!985 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodecMime", file: !985, line: 49, size: 288, align: 32, elements: !987)
!987 = !{!988, !992}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !986, file: !985, line: 50, baseType: !989, size: 256, align: 8)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 256, align: 8, elements: !990)
!990 = !{!991}
!991 = !DISubrange(count: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !986, file: !985, line: 51, baseType: !3, size: 32, align: 32, offset: 256)
!993 = !{!994}
!994 = !DISubrange(count: 9)
!995 = distinct !DIGlobalVariable(name: "id3v2_2_metadata_conv", scope: !0, file: !948, line: 75, type: !996, isLocal: true, isDefinition: true, variable: [10 x %struct.AVMetadataConv]* @id3v2_2_metadata_conv)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 1280, align: 64, elements: !997)
!997 = !{!998}
!998 = !DISubrange(count: 10)
!999 = distinct !DIGlobalVariable(name: "id3v2_extra_meta_funcs", scope: !0, file: !948, line: 795, type: !1000, isLocal: true, isDefinition: true, variable: [5 x %struct.ID3v2EMFunc]* @id3v2_extra_meta_funcs)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1001, size: 1280, align: 64, elements: !1899)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID3v2EMFunc", file: !948, line: 793, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID3v2EMFunc", file: !948, line: 786, size: 256, align: 64, elements: !1004)
!1004 = !{!1005, !1006, !1007, !2223}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "tag3", scope: !1003, file: !948, line: 787, baseType: !944, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "tag4", scope: !1003, file: !948, line: 788, baseType: !944, size: 64, align: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !1003, file: !948, line: 789, baseType: !1008, size: 64, align: 64, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{null, !1011, !1315, !935, !944, !2214, !935}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !897, line: 1947, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1014)
!1014 = !{!1015, !1056, !1169, !1313, !1314, !1379, !1380, !1381, !2071, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2125, !2126, !2127, !2128, !2129, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2180, !2181, !2184, !2185, !2186, !2187, !2188, !2189, !2191, !2192, !2193, !2194, !2202, !2203, !2207, !2211, !2212, !2213}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1013, file: !897, line: 1342, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !1020)
!1020 = !{!1021, !1022, !1026, !1030, !1031, !1032, !1033, !1037, !1043, !1045, !1049}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1019, file: !464, line: 72, baseType: !944, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1019, file: !464, line: 78, baseType: !1023, size: 64, align: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!944, !933}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1019, file: !464, line: 85, baseType: !1027, size: 64, align: 64, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1029 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1019, file: !464, line: 93, baseType: !935, size: 32, align: 32, offset: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1019, file: !464, line: 99, baseType: !935, size: 32, align: 32, offset: 224)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1019, file: !464, line: 108, baseType: !935, size: 32, align: 32, offset: 256)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1019, file: !464, line: 113, baseType: !1034, size: 64, align: 64, offset: 320)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!933, !933, !933}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1019, file: !464, line: 123, baseType: !1038, size: 64, align: 64, offset: 384)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!1041, !1041}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1019, file: !464, line: 130, baseType: !1044, size: 32, align: 32, offset: 448)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1019, file: !464, line: 136, baseType: !1046, size: 64, align: 64, offset: 512)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!1044, !933}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1019, file: !464, line: 142, baseType: !1050, size: 64, align: 64, offset: 576)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!935, !1053, !933, !944, !935}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1013, file: !897, line: 1349, baseType: !1057, size: 64, align: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1059)
!1059 = !{!1060, !1061, !1062, !1063, !1064, !1073, !1074, !1075, !1076, !1077, !1078, !1092, !1097, !1140, !1141, !1145, !1150, !1151, !1152, !1156, !1162, !1168}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1058, file: !897, line: 638, baseType: !944, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1058, file: !897, line: 645, baseType: !944, size: 64, align: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1058, file: !897, line: 652, baseType: !935, size: 32, align: 32, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1058, file: !897, line: 659, baseType: !944, size: 64, align: 64, offset: 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1058, file: !897, line: 661, baseType: !1065, size: 64, align: 64, offset: 256)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1067)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1069)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !985, line: 44, size: 64, align: 32, elements: !1070)
!1070 = !{!1071, !1072}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1069, file: !985, line: 45, baseType: !3, size: 32, align: 32)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1069, file: !985, line: 46, baseType: !934, size: 32, align: 32, offset: 32)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1058, file: !897, line: 663, baseType: !1016, size: 64, align: 64, offset: 320)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1058, file: !897, line: 670, baseType: !944, size: 64, align: 64, offset: 384)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1058, file: !897, line: 679, baseType: !1057, size: 64, align: 64, offset: 448)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1058, file: !897, line: 684, baseType: !935, size: 32, align: 32, offset: 512)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1058, file: !897, line: 689, baseType: !935, size: 32, align: 32, offset: 544)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1058, file: !897, line: 696, baseType: !1079, size: 64, align: 64, offset: 576)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!935, !1082}
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1084)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1085)
!1085 = !{!1086, !1087, !1090, !1091}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1084, file: !897, line: 449, baseType: !944, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1084, file: !897, line: 450, baseType: !1088, size: 64, align: 64, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1084, file: !897, line: 451, baseType: !935, size: 32, align: 32, offset: 128)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1084, file: !897, line: 452, baseType: !944, size: 64, align: 64, offset: 192)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1058, file: !897, line: 703, baseType: !1093, size: 64, align: 64, offset: 640)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!935, !1096}
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1058, file: !897, line: 714, baseType: !1098, size: 64, align: 64, offset: 704)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!935, !1096, !1101}
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1104)
!1104 = !{!1105, !1119, !1123, !1124, !1125, !1126, !1127, !1128, !1136, !1137, !1138, !1139}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1103, file: !4, line: 1451, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1108, line: 94, baseType: !1109)
!1108 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1108, line: 81, size: 192, align: 64, elements: !1110)
!1110 = !{!1111, !1115, !1118}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1109, file: !1108, line: 82, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1108, line: 73, baseType: !1114)
!1114 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1108, line: 73, flags: DIFlagFwdDecl)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1109, file: !1108, line: 89, baseType: !1116, size: 64, align: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !931, line: 48, baseType: !1089)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1109, file: !1108, line: 93, baseType: !935, size: 32, align: 32, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1103, file: !4, line: 1461, baseType: !1120, size: 64, align: 64, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1121, line: 197, baseType: !1122)
!1121 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1122 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1103, file: !4, line: 1467, baseType: !1120, size: 64, align: 64, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1103, file: !4, line: 1468, baseType: !1116, size: 64, align: 64, offset: 192)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1103, file: !4, line: 1469, baseType: !935, size: 32, align: 32, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1103, file: !4, line: 1470, baseType: !935, size: 32, align: 32, offset: 288)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1103, file: !4, line: 1474, baseType: !935, size: 32, align: 32, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1103, file: !4, line: 1479, baseType: !1129, size: 64, align: 64, offset: 384)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1131)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1132)
!1132 = !{!1133, !1134, !1135}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1131, file: !4, line: 1412, baseType: !1116, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1131, file: !4, line: 1413, baseType: !935, size: 32, align: 32, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1131, file: !4, line: 1414, baseType: !493, size: 32, align: 32, offset: 96)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1103, file: !4, line: 1480, baseType: !935, size: 32, align: 32, offset: 448)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1103, file: !4, line: 1486, baseType: !1120, size: 64, align: 64, offset: 512)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1103, file: !4, line: 1488, baseType: !1120, size: 64, align: 64, offset: 576)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1103, file: !4, line: 1497, baseType: !1120, size: 64, align: 64, offset: 640)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1058, file: !897, line: 720, baseType: !1093, size: 64, align: 64, offset: 768)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1058, file: !897, line: 730, baseType: !1142, size: 64, align: 64, offset: 832)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!935, !1096, !935, !1120, !935}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1058, file: !897, line: 737, baseType: !1146, size: 64, align: 64, offset: 896)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!1120, !1096, !935, !1149, !1120}
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1058, file: !897, line: 744, baseType: !1093, size: 64, align: 64, offset: 960)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1058, file: !897, line: 750, baseType: !1093, size: 64, align: 64, offset: 1024)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1058, file: !897, line: 758, baseType: !1153, size: 64, align: 64, offset: 1088)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!935, !1096, !935, !1120, !1120, !1120, !935}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1058, file: !897, line: 764, baseType: !1157, size: 64, align: 64, offset: 1152)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!935, !1096, !1160}
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1058, file: !897, line: 770, baseType: !1163, size: 64, align: 64, offset: 1216)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!935, !1096, !1166}
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1058, file: !897, line: 776, baseType: !1163, size: 64, align: 64, offset: 1280)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1013, file: !897, line: 1356, baseType: !1170, size: 64, align: 64, offset: 128)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1172)
!1172 = !{!1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1192, !1196, !1200, !1206, !1298, !1299, !1300, !1301, !1302, !1303, !1307}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1171, file: !897, line: 498, baseType: !944, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1171, file: !897, line: 504, baseType: !944, size: 64, align: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1171, file: !897, line: 505, baseType: !944, size: 64, align: 64, offset: 128)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1171, file: !897, line: 506, baseType: !944, size: 64, align: 64, offset: 192)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1171, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1171, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1171, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1171, file: !897, line: 517, baseType: !935, size: 32, align: 32, offset: 352)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1171, file: !897, line: 523, baseType: !1065, size: 64, align: 64, offset: 384)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1171, file: !897, line: 526, baseType: !1016, size: 64, align: 64, offset: 448)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1171, file: !897, line: 535, baseType: !1170, size: 64, align: 64, offset: 512)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1171, file: !897, line: 539, baseType: !935, size: 32, align: 32, offset: 576)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1171, file: !897, line: 541, baseType: !1093, size: 64, align: 64, offset: 640)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1171, file: !897, line: 549, baseType: !1098, size: 64, align: 64, offset: 704)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1171, file: !897, line: 550, baseType: !1093, size: 64, align: 64, offset: 768)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1171, file: !897, line: 554, baseType: !1189, size: 64, align: 64, offset: 832)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!935, !1096, !1101, !1101, !935}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1171, file: !897, line: 563, baseType: !1193, size: 64, align: 64, offset: 896)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!935, !3, !935}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1171, file: !897, line: 565, baseType: !1197, size: 64, align: 64, offset: 960)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{null, !1096, !935, !1149, !1149}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1171, file: !897, line: 570, baseType: !1201, size: 64, align: 64, offset: 1024)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!935, !1096, !935, !933, !1204}
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1205, line: 216, baseType: !932)
!1205 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1171, file: !897, line: 581, baseType: !1207, size: 64, align: 64, offset: 1088)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!935, !1096, !935, !1210, !934}
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !535, line: 646, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !535, line: 268, size: 4288, align: 64, elements: !1214)
!1214 = !{!1215, !1217, !1219, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1252, !1254, !1255, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1213, file: !535, line: 282, baseType: !1216, size: 512, align: 64)
!1216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1116, size: 512, align: 64, elements: !961)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1213, file: !535, line: 299, baseType: !1218, size: 256, align: 32, offset: 512)
!1218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 256, align: 32, elements: !961)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1213, file: !535, line: 315, baseType: !1220, size: 64, align: 64, offset: 768)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1213, file: !535, line: 326, baseType: !935, size: 32, align: 32, offset: 832)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1213, file: !535, line: 326, baseType: !935, size: 32, align: 32, offset: 864)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1213, file: !535, line: 334, baseType: !935, size: 32, align: 32, offset: 896)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1213, file: !535, line: 341, baseType: !935, size: 32, align: 32, offset: 928)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1213, file: !535, line: 346, baseType: !935, size: 32, align: 32, offset: 960)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1213, file: !535, line: 351, baseType: !523, size: 32, align: 32, offset: 992)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1213, file: !535, line: 356, baseType: !1228, size: 64, align: 32, offset: 1024)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1229, line: 61, baseType: !1230)
!1229 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1229, line: 58, size: 64, align: 32, elements: !1231)
!1231 = !{!1232, !1233}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1230, file: !1229, line: 59, baseType: !935, size: 32, align: 32)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1230, file: !1229, line: 60, baseType: !935, size: 32, align: 32, offset: 32)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1213, file: !535, line: 361, baseType: !1120, size: 64, align: 64, offset: 1088)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1213, file: !535, line: 369, baseType: !1120, size: 64, align: 64, offset: 1152)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1213, file: !535, line: 377, baseType: !1120, size: 64, align: 64, offset: 1216)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1213, file: !535, line: 382, baseType: !935, size: 32, align: 32, offset: 1280)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1213, file: !535, line: 386, baseType: !935, size: 32, align: 32, offset: 1312)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1213, file: !535, line: 391, baseType: !935, size: 32, align: 32, offset: 1344)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1213, file: !535, line: 396, baseType: !933, size: 64, align: 64, offset: 1408)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1213, file: !535, line: 403, baseType: !1242, size: 512, align: 64, offset: 1472)
!1242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 512, align: 64, elements: !961)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1213, file: !535, line: 410, baseType: !935, size: 32, align: 32, offset: 1984)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1213, file: !535, line: 415, baseType: !935, size: 32, align: 32, offset: 2016)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1213, file: !535, line: 420, baseType: !935, size: 32, align: 32, offset: 2048)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1213, file: !535, line: 425, baseType: !935, size: 32, align: 32, offset: 2080)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1213, file: !535, line: 435, baseType: !1120, size: 64, align: 64, offset: 2112)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1213, file: !535, line: 440, baseType: !935, size: 32, align: 32, offset: 2176)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1213, file: !535, line: 445, baseType: !930, size: 64, align: 64, offset: 2240)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1213, file: !535, line: 459, baseType: !1251, size: 512, align: 64, offset: 2304)
!1251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1106, size: 512, align: 64, elements: !961)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1213, file: !535, line: 473, baseType: !1253, size: 64, align: 64, offset: 2816)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1213, file: !535, line: 477, baseType: !935, size: 32, align: 32, offset: 2880)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1213, file: !535, line: 479, baseType: !1256, size: 64, align: 64, offset: 2944)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !535, line: 207, baseType: !1259)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !535, line: 201, size: 320, align: 64, elements: !1260)
!1260 = !{!1261, !1262, !1263, !1264, !1269}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1259, file: !535, line: 202, baseType: !534, size: 32, align: 32)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1259, file: !535, line: 203, baseType: !1116, size: 64, align: 64, offset: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1259, file: !535, line: 204, baseType: !935, size: 32, align: 32, offset: 128)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1259, file: !535, line: 205, baseType: !1265, size: 64, align: 64, offset: 192)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1267, line: 86, baseType: !1268)
!1267 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1268 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1267, line: 86, flags: DIFlagFwdDecl)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1259, file: !535, line: 206, baseType: !1106, size: 64, align: 64, offset: 256)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1213, file: !535, line: 480, baseType: !935, size: 32, align: 32, offset: 3008)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1213, file: !535, line: 505, baseType: !935, size: 32, align: 32, offset: 3040)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1213, file: !535, line: 512, baseType: !558, size: 32, align: 32, offset: 3072)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1213, file: !535, line: 514, baseType: !565, size: 32, align: 32, offset: 3104)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1213, file: !535, line: 516, baseType: !583, size: 32, align: 32, offset: 3136)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1213, file: !535, line: 523, baseType: !607, size: 32, align: 32, offset: 3168)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1213, file: !535, line: 525, baseType: !626, size: 32, align: 32, offset: 3200)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1213, file: !535, line: 532, baseType: !1120, size: 64, align: 64, offset: 3264)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1213, file: !535, line: 539, baseType: !1120, size: 64, align: 64, offset: 3328)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1213, file: !535, line: 547, baseType: !1120, size: 64, align: 64, offset: 3392)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1213, file: !535, line: 554, baseType: !1265, size: 64, align: 64, offset: 3456)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1213, file: !535, line: 563, baseType: !935, size: 32, align: 32, offset: 3520)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1213, file: !535, line: 572, baseType: !935, size: 32, align: 32, offset: 3552)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1213, file: !535, line: 581, baseType: !935, size: 32, align: 32, offset: 3584)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1213, file: !535, line: 588, baseType: !1285, size: 64, align: 64, offset: 3648)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1121, line: 194, baseType: !1287)
!1287 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1213, file: !535, line: 593, baseType: !935, size: 32, align: 32, offset: 3712)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1213, file: !535, line: 596, baseType: !935, size: 32, align: 32, offset: 3744)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1213, file: !535, line: 599, baseType: !1106, size: 64, align: 64, offset: 3776)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1213, file: !535, line: 605, baseType: !1106, size: 64, align: 64, offset: 3840)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1213, file: !535, line: 616, baseType: !1106, size: 64, align: 64, offset: 3904)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1213, file: !535, line: 626, baseType: !1204, size: 64, align: 64, offset: 3968)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1213, file: !535, line: 627, baseType: !1204, size: 64, align: 64, offset: 4032)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1213, file: !535, line: 628, baseType: !1204, size: 64, align: 64, offset: 4096)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1213, file: !535, line: 629, baseType: !1204, size: 64, align: 64, offset: 4160)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1213, file: !535, line: 645, baseType: !1106, size: 64, align: 64, offset: 4224)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1171, file: !897, line: 587, baseType: !1157, size: 64, align: 64, offset: 1152)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1171, file: !897, line: 592, baseType: !1163, size: 64, align: 64, offset: 1216)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1171, file: !897, line: 597, baseType: !1163, size: 64, align: 64, offset: 1280)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1171, file: !897, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1171, file: !897, line: 608, baseType: !1093, size: 64, align: 64, offset: 1408)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1171, file: !897, line: 617, baseType: !1304, size: 64, align: 64, offset: 1472)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DISubroutineType(types: !1306)
!1306 = !{null, !1096}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1171, file: !897, line: 623, baseType: !1308, size: 64, align: 64, offset: 1536)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DISubroutineType(types: !1310)
!1310 = !{!935, !1096, !1311}
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1102)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1013, file: !897, line: 1365, baseType: !933, size: 64, align: 64, offset: 192)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1013, file: !897, line: 1379, baseType: !1315, size: 64, align: 64, offset: 256)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !485, line: 352, baseType: !1317)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !485, line: 161, size: 2112, align: 64, elements: !1318)
!1318 = !{!1319, !1320, !1321, !1322, !1323, !1324, !1325, !1329, !1330, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1346, !1347, !1351, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1369, !1370, !1371, !1372, !1376, !1377, !1378}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1317, file: !485, line: 174, baseType: !1016, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1317, file: !485, line: 226, baseType: !1088, size: 64, align: 64, offset: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1317, file: !485, line: 227, baseType: !935, size: 32, align: 32, offset: 128)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1317, file: !485, line: 228, baseType: !1088, size: 64, align: 64, offset: 192)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1317, file: !485, line: 229, baseType: !1088, size: 64, align: 64, offset: 256)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1317, file: !485, line: 233, baseType: !933, size: 64, align: 64, offset: 320)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1317, file: !485, line: 235, baseType: !1326, size: 64, align: 64, offset: 384)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{!935, !933, !1116, !935}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1317, file: !485, line: 236, baseType: !1326, size: 64, align: 64, offset: 448)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1317, file: !485, line: 237, baseType: !1331, size: 64, align: 64, offset: 512)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!1120, !933, !1120, !935}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1317, file: !485, line: 238, baseType: !1120, size: 64, align: 64, offset: 576)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1317, file: !485, line: 239, baseType: !935, size: 32, align: 32, offset: 640)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1317, file: !485, line: 240, baseType: !935, size: 32, align: 32, offset: 672)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1317, file: !485, line: 241, baseType: !935, size: 32, align: 32, offset: 704)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1317, file: !485, line: 242, baseType: !932, size: 64, align: 64, offset: 768)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1317, file: !485, line: 243, baseType: !1088, size: 64, align: 64, offset: 832)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1317, file: !485, line: 244, baseType: !1341, size: 64, align: 64, offset: 896)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DISubroutineType(types: !1343)
!1343 = !{!932, !932, !1344, !934}
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1117)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1317, file: !485, line: 245, baseType: !935, size: 32, align: 32, offset: 960)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1317, file: !485, line: 249, baseType: !1348, size: 64, align: 64, offset: 1024)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DISubroutineType(types: !1350)
!1350 = !{!935, !933, !935}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1317, file: !485, line: 255, baseType: !1352, size: 64, align: 64, offset: 1088)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DISubroutineType(types: !1354)
!1354 = !{!1120, !933, !935, !1120, !935}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1317, file: !485, line: 260, baseType: !935, size: 32, align: 32, offset: 1152)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1317, file: !485, line: 266, baseType: !1120, size: 64, align: 64, offset: 1216)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1317, file: !485, line: 273, baseType: !935, size: 32, align: 32, offset: 1280)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1317, file: !485, line: 279, baseType: !1120, size: 64, align: 64, offset: 1344)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1317, file: !485, line: 285, baseType: !935, size: 32, align: 32, offset: 1408)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1317, file: !485, line: 291, baseType: !935, size: 32, align: 32, offset: 1440)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1317, file: !485, line: 298, baseType: !935, size: 32, align: 32, offset: 1472)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1317, file: !485, line: 304, baseType: !935, size: 32, align: 32, offset: 1504)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1317, file: !485, line: 309, baseType: !944, size: 64, align: 64, offset: 1536)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1317, file: !485, line: 314, baseType: !944, size: 64, align: 64, offset: 1600)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1317, file: !485, line: 319, baseType: !1366, size: 64, align: 64, offset: 1664)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DISubroutineType(types: !1368)
!1368 = !{!935, !933, !1116, !935, !484, !1120}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1317, file: !485, line: 326, baseType: !935, size: 32, align: 32, offset: 1728)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1317, file: !485, line: 331, baseType: !484, size: 32, align: 32, offset: 1760)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1317, file: !485, line: 332, baseType: !1120, size: 64, align: 64, offset: 1792)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1317, file: !485, line: 338, baseType: !1373, size: 64, align: 64, offset: 1856)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DISubroutineType(types: !1375)
!1375 = !{!935, !933}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1317, file: !485, line: 340, baseType: !1120, size: 64, align: 64, offset: 1920)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1317, file: !485, line: 346, baseType: !1088, size: 64, align: 64, offset: 1984)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1317, file: !485, line: 351, baseType: !935, size: 32, align: 32, offset: 2048)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1013, file: !897, line: 1386, baseType: !935, size: 32, align: 32, offset: 320)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1013, file: !897, line: 1393, baseType: !934, size: 32, align: 32, offset: 352)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1013, file: !897, line: 1405, baseType: !1382, size: 64, align: 64, offset: 384)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1385)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1386)
!1386 = !{!1387, !1388, !1389, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1856, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1957, !1963, !1964, !1968, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !2000, !2001, !2002, !2003, !2004, !2005}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1385, file: !897, line: 866, baseType: !935, size: 32, align: 32)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1385, file: !897, line: 872, baseType: !935, size: 32, align: 32, offset: 32)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1385, file: !897, line: 878, baseType: !1390, size: 64, align: 64, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1392)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1393)
!1393 = !{!1394, !1395, !1396, !1397, !1532, !1533, !1534, !1535, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1561, !1565, !1566, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1745, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1392, file: !4, line: 1561, baseType: !1016, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1392, file: !4, line: 1562, baseType: !935, size: 32, align: 32, offset: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1392, file: !4, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1392, file: !4, line: 1565, baseType: !1398, size: 64, align: 64, offset: 128)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1400)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1401)
!1401 = !{!1402, !1403, !1404, !1405, !1406, !1407, !1410, !1413, !1416, !1419, !1422, !1423, !1424, !1432, !1433, !1434, !1436, !1440, !1446, !1451, !1455, !1456, !1497, !1504, !1508, !1509, !1513, !1517, !1521, !1525, !1526, !1527}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1400, file: !4, line: 3475, baseType: !944, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1400, file: !4, line: 3480, baseType: !944, size: 64, align: 64, offset: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1400, file: !4, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1400, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1400, file: !4, line: 3487, baseType: !935, size: 32, align: 32, offset: 192)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1400, file: !4, line: 3488, baseType: !1408, size: 64, align: 64, offset: 256)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1228)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1400, file: !4, line: 3489, baseType: !1411, size: 64, align: 64, offset: 320)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1400, file: !4, line: 3490, baseType: !1414, size: 64, align: 64, offset: 384)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1400, file: !4, line: 3491, baseType: !1417, size: 64, align: 64, offset: 448)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1400, file: !4, line: 3492, baseType: !1420, size: 64, align: 64, offset: 512)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1400, file: !4, line: 3493, baseType: !1117, size: 8, align: 8, offset: 576)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1400, file: !4, line: 3494, baseType: !1016, size: 64, align: 64, offset: 640)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1400, file: !4, line: 3495, baseType: !1425, size: 64, align: 64, offset: 704)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1427)
!1427 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1428)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1429)
!1429 = !{!1430, !1431}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1428, file: !4, line: 3402, baseType: !935, size: 32, align: 32)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1428, file: !4, line: 3403, baseType: !944, size: 64, align: 64, offset: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1400, file: !4, line: 3507, baseType: !944, size: 64, align: 64, offset: 768)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1400, file: !4, line: 3516, baseType: !935, size: 32, align: 32, offset: 832)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1400, file: !4, line: 3517, baseType: !1435, size: 64, align: 64, offset: 896)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1400, file: !4, line: 3527, baseType: !1437, size: 64, align: 64, offset: 960)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DISubroutineType(types: !1439)
!1439 = !{!935, !1390}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1400, file: !4, line: 3535, baseType: !1441, size: 64, align: 64, offset: 1024)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DISubroutineType(types: !1443)
!1443 = !{!935, !1390, !1444}
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1391)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1400, file: !4, line: 3541, baseType: !1447, size: 64, align: 64, offset: 1088)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1449)
!1449 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1450)
!1450 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1400, file: !4, line: 3549, baseType: !1452, size: 64, align: 64, offset: 1152)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DISubroutineType(types: !1454)
!1454 = !{null, !1435}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1400, file: !4, line: 3551, baseType: !1437, size: 64, align: 64, offset: 1216)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1400, file: !4, line: 3552, baseType: !1457, size: 64, align: 64, offset: 1280)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!935, !1390, !1116, !935, !1460}
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1462)
!1462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1463)
!1463 = !{!1464, !1467, !1468, !1469, !1470, !1496}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1462, file: !4, line: 3921, baseType: !1465, size: 16, align: 16)
!1465 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !931, line: 49, baseType: !1466)
!1466 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1462, file: !4, line: 3922, baseType: !941, size: 32, align: 32, offset: 32)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1462, file: !4, line: 3923, baseType: !941, size: 32, align: 32, offset: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1462, file: !4, line: 3924, baseType: !934, size: 32, align: 32, offset: 96)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1462, file: !4, line: 3925, baseType: !1471, size: 64, align: 64, offset: 128)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1474)
!1474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1475)
!1475 = !{!1476, !1477, !1478, !1479, !1480, !1481, !1487, !1490, !1492, !1493, !1494, !1495}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1474, file: !4, line: 3886, baseType: !935, size: 32, align: 32)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1474, file: !4, line: 3887, baseType: !935, size: 32, align: 32, offset: 32)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1474, file: !4, line: 3888, baseType: !935, size: 32, align: 32, offset: 64)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1474, file: !4, line: 3889, baseType: !935, size: 32, align: 32, offset: 96)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1474, file: !4, line: 3890, baseType: !935, size: 32, align: 32, offset: 128)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1474, file: !4, line: 3897, baseType: !1482, size: 768, align: 64, offset: 192)
!1482 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1483)
!1483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1484)
!1484 = !{!1485, !1486}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1483, file: !4, line: 3855, baseType: !1216, size: 512, align: 64)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1483, file: !4, line: 3857, baseType: !1218, size: 256, align: 32, offset: 512)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1474, file: !4, line: 3903, baseType: !1488, size: 256, align: 64, offset: 960)
!1488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1116, size: 256, align: 64, elements: !1489)
!1489 = !{!967}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1474, file: !4, line: 3904, baseType: !1491, size: 128, align: 32, offset: 1216)
!1491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 128, align: 32, elements: !1489)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1474, file: !4, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1474, file: !4, line: 3908, baseType: !942, size: 64, align: 64, offset: 1408)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1474, file: !4, line: 3915, baseType: !942, size: 64, align: 64, offset: 1472)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1474, file: !4, line: 3917, baseType: !935, size: 32, align: 32, offset: 1536)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1462, file: !4, line: 3926, baseType: !1120, size: 64, align: 64, offset: 192)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1400, file: !4, line: 3564, baseType: !1498, size: 64, align: 64, offset: 1344)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DISubroutineType(types: !1500)
!1500 = !{!935, !1390, !1101, !1501, !1503}
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1212)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1400, file: !4, line: 3566, baseType: !1505, size: 64, align: 64, offset: 1408)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DISubroutineType(types: !1507)
!1507 = !{!935, !1390, !933, !1503, !1101}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1400, file: !4, line: 3567, baseType: !1437, size: 64, align: 64, offset: 1472)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1400, file: !4, line: 3576, baseType: !1510, size: 64, align: 64, offset: 1536)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DISubroutineType(types: !1512)
!1512 = !{!935, !1390, !1501}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1400, file: !4, line: 3577, baseType: !1514, size: 64, align: 64, offset: 1600)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DISubroutineType(types: !1516)
!1516 = !{!935, !1390, !1101}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1400, file: !4, line: 3584, baseType: !1518, size: 64, align: 64, offset: 1664)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DISubroutineType(types: !1520)
!1520 = !{!935, !1390, !1211}
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1400, file: !4, line: 3589, baseType: !1522, size: 64, align: 64, offset: 1728)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!1523 = !DISubroutineType(types: !1524)
!1524 = !{null, !1390}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1400, file: !4, line: 3594, baseType: !935, size: 32, align: 32, offset: 1792)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1400, file: !4, line: 3600, baseType: !944, size: 64, align: 64, offset: 1856)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1400, file: !4, line: 3609, baseType: !1528, size: 64, align: 64, offset: 1920)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1531)
!1531 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1392, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1392, file: !4, line: 1581, baseType: !934, size: 32, align: 32, offset: 224)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1392, file: !4, line: 1583, baseType: !933, size: 64, align: 64, offset: 256)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1392, file: !4, line: 1591, baseType: !1536, size: 64, align: 64, offset: 320)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1392, file: !4, line: 1598, baseType: !933, size: 64, align: 64, offset: 384)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1392, file: !4, line: 1606, baseType: !1120, size: 64, align: 64, offset: 448)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1392, file: !4, line: 1614, baseType: !935, size: 32, align: 32, offset: 512)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1392, file: !4, line: 1622, baseType: !935, size: 32, align: 32, offset: 544)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1392, file: !4, line: 1628, baseType: !935, size: 32, align: 32, offset: 576)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1392, file: !4, line: 1636, baseType: !935, size: 32, align: 32, offset: 608)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1392, file: !4, line: 1643, baseType: !935, size: 32, align: 32, offset: 640)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1392, file: !4, line: 1657, baseType: !1116, size: 64, align: 64, offset: 704)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1392, file: !4, line: 1658, baseType: !935, size: 32, align: 32, offset: 768)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1392, file: !4, line: 1679, baseType: !1228, size: 64, align: 32, offset: 800)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1392, file: !4, line: 1688, baseType: !935, size: 32, align: 32, offset: 864)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1392, file: !4, line: 1712, baseType: !935, size: 32, align: 32, offset: 896)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1392, file: !4, line: 1729, baseType: !935, size: 32, align: 32, offset: 928)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1392, file: !4, line: 1729, baseType: !935, size: 32, align: 32, offset: 960)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1392, file: !4, line: 1744, baseType: !935, size: 32, align: 32, offset: 992)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1392, file: !4, line: 1744, baseType: !935, size: 32, align: 32, offset: 1024)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1392, file: !4, line: 1751, baseType: !935, size: 32, align: 32, offset: 1056)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1392, file: !4, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1392, file: !4, line: 1791, baseType: !1557, size: 64, align: 64, offset: 1152)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DISubroutineType(types: !1559)
!1559 = !{null, !1560, !1501, !1503, !935, !935, !935}
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1392, file: !4, line: 1808, baseType: !1562, size: 64, align: 64, offset: 1216)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DISubroutineType(types: !1564)
!1564 = !{!645, !1560, !1411}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1392, file: !4, line: 1816, baseType: !935, size: 32, align: 32, offset: 1280)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1392, file: !4, line: 1825, baseType: !1567, size: 32, align: 32, offset: 1312)
!1567 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1392, file: !4, line: 1830, baseType: !935, size: 32, align: 32, offset: 1344)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1392, file: !4, line: 1838, baseType: !1567, size: 32, align: 32, offset: 1376)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1392, file: !4, line: 1846, baseType: !935, size: 32, align: 32, offset: 1408)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1392, file: !4, line: 1851, baseType: !935, size: 32, align: 32, offset: 1440)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1392, file: !4, line: 1861, baseType: !1567, size: 32, align: 32, offset: 1472)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1392, file: !4, line: 1868, baseType: !1567, size: 32, align: 32, offset: 1504)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1392, file: !4, line: 1875, baseType: !1567, size: 32, align: 32, offset: 1536)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1392, file: !4, line: 1882, baseType: !1567, size: 32, align: 32, offset: 1568)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1392, file: !4, line: 1889, baseType: !1567, size: 32, align: 32, offset: 1600)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1392, file: !4, line: 1896, baseType: !1567, size: 32, align: 32, offset: 1632)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1392, file: !4, line: 1903, baseType: !1567, size: 32, align: 32, offset: 1664)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1392, file: !4, line: 1910, baseType: !935, size: 32, align: 32, offset: 1696)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1392, file: !4, line: 1915, baseType: !935, size: 32, align: 32, offset: 1728)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1392, file: !4, line: 1926, baseType: !1503, size: 64, align: 64, offset: 1792)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1392, file: !4, line: 1935, baseType: !1228, size: 64, align: 32, offset: 1856)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1392, file: !4, line: 1942, baseType: !935, size: 32, align: 32, offset: 1920)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1392, file: !4, line: 1948, baseType: !935, size: 32, align: 32, offset: 1952)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1392, file: !4, line: 1954, baseType: !935, size: 32, align: 32, offset: 1984)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1392, file: !4, line: 1960, baseType: !935, size: 32, align: 32, offset: 2016)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1392, file: !4, line: 1984, baseType: !935, size: 32, align: 32, offset: 2048)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1392, file: !4, line: 1991, baseType: !935, size: 32, align: 32, offset: 2080)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1392, file: !4, line: 1996, baseType: !935, size: 32, align: 32, offset: 2112)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1392, file: !4, line: 2004, baseType: !935, size: 32, align: 32, offset: 2144)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1392, file: !4, line: 2011, baseType: !935, size: 32, align: 32, offset: 2176)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1392, file: !4, line: 2018, baseType: !935, size: 32, align: 32, offset: 2208)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1392, file: !4, line: 2027, baseType: !935, size: 32, align: 32, offset: 2240)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1392, file: !4, line: 2034, baseType: !935, size: 32, align: 32, offset: 2272)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1392, file: !4, line: 2044, baseType: !935, size: 32, align: 32, offset: 2304)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1392, file: !4, line: 2054, baseType: !1597, size: 64, align: 64, offset: 2368)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1392, file: !4, line: 2061, baseType: !1597, size: 64, align: 64, offset: 2432)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1392, file: !4, line: 2066, baseType: !935, size: 32, align: 32, offset: 2496)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1392, file: !4, line: 2070, baseType: !935, size: 32, align: 32, offset: 2528)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1392, file: !4, line: 2078, baseType: !935, size: 32, align: 32, offset: 2560)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1392, file: !4, line: 2085, baseType: !935, size: 32, align: 32, offset: 2592)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1392, file: !4, line: 2092, baseType: !935, size: 32, align: 32, offset: 2624)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1392, file: !4, line: 2099, baseType: !935, size: 32, align: 32, offset: 2656)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1392, file: !4, line: 2106, baseType: !935, size: 32, align: 32, offset: 2688)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1392, file: !4, line: 2113, baseType: !935, size: 32, align: 32, offset: 2720)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1392, file: !4, line: 2120, baseType: !935, size: 32, align: 32, offset: 2752)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1392, file: !4, line: 2125, baseType: !935, size: 32, align: 32, offset: 2784)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1392, file: !4, line: 2133, baseType: !935, size: 32, align: 32, offset: 2816)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1392, file: !4, line: 2140, baseType: !935, size: 32, align: 32, offset: 2848)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1392, file: !4, line: 2145, baseType: !935, size: 32, align: 32, offset: 2880)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1392, file: !4, line: 2153, baseType: !935, size: 32, align: 32, offset: 2912)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1392, file: !4, line: 2158, baseType: !935, size: 32, align: 32, offset: 2944)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1392, file: !4, line: 2166, baseType: !565, size: 32, align: 32, offset: 2976)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1392, file: !4, line: 2173, baseType: !583, size: 32, align: 32, offset: 3008)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1392, file: !4, line: 2180, baseType: !607, size: 32, align: 32, offset: 3040)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1392, file: !4, line: 2187, baseType: !558, size: 32, align: 32, offset: 3072)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1392, file: !4, line: 2194, baseType: !626, size: 32, align: 32, offset: 3104)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1392, file: !4, line: 2203, baseType: !935, size: 32, align: 32, offset: 3136)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1392, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1392, file: !4, line: 2212, baseType: !935, size: 32, align: 32, offset: 3200)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1392, file: !4, line: 2213, baseType: !935, size: 32, align: 32, offset: 3232)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1392, file: !4, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1392, file: !4, line: 2232, baseType: !935, size: 32, align: 32, offset: 3296)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1392, file: !4, line: 2243, baseType: !935, size: 32, align: 32, offset: 3328)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1392, file: !4, line: 2249, baseType: !935, size: 32, align: 32, offset: 3360)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1392, file: !4, line: 2256, baseType: !935, size: 32, align: 32, offset: 3392)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1392, file: !4, line: 2263, baseType: !930, size: 64, align: 64, offset: 3456)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1392, file: !4, line: 2270, baseType: !930, size: 64, align: 64, offset: 3520)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1392, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1392, file: !4, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1392, file: !4, line: 2367, baseType: !1633, size: 64, align: 64, offset: 3648)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DISubroutineType(types: !1635)
!1635 = !{!935, !1560, !1211, !935}
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1392, file: !4, line: 2383, baseType: !935, size: 32, align: 32, offset: 3712)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1392, file: !4, line: 2386, baseType: !1567, size: 32, align: 32, offset: 3744)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1392, file: !4, line: 2387, baseType: !1567, size: 32, align: 32, offset: 3776)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1392, file: !4, line: 2394, baseType: !935, size: 32, align: 32, offset: 3808)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1392, file: !4, line: 2401, baseType: !935, size: 32, align: 32, offset: 3840)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1392, file: !4, line: 2408, baseType: !935, size: 32, align: 32, offset: 3872)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1392, file: !4, line: 2415, baseType: !935, size: 32, align: 32, offset: 3904)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1392, file: !4, line: 2422, baseType: !935, size: 32, align: 32, offset: 3936)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1392, file: !4, line: 2423, baseType: !1645, size: 64, align: 64, offset: 3968)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1647)
!1647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1648)
!1648 = !{!1649, !1650, !1651, !1652}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1647, file: !4, line: 827, baseType: !935, size: 32, align: 32)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1647, file: !4, line: 828, baseType: !935, size: 32, align: 32, offset: 32)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1647, file: !4, line: 829, baseType: !935, size: 32, align: 32, offset: 64)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1647, file: !4, line: 830, baseType: !1567, size: 32, align: 32, offset: 96)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1392, file: !4, line: 2430, baseType: !1120, size: 64, align: 64, offset: 4032)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1392, file: !4, line: 2437, baseType: !1120, size: 64, align: 64, offset: 4096)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1392, file: !4, line: 2444, baseType: !1567, size: 32, align: 32, offset: 4160)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1392, file: !4, line: 2451, baseType: !1567, size: 32, align: 32, offset: 4192)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1392, file: !4, line: 2458, baseType: !935, size: 32, align: 32, offset: 4224)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1392, file: !4, line: 2469, baseType: !935, size: 32, align: 32, offset: 4256)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1392, file: !4, line: 2475, baseType: !935, size: 32, align: 32, offset: 4288)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1392, file: !4, line: 2481, baseType: !935, size: 32, align: 32, offset: 4320)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1392, file: !4, line: 2485, baseType: !935, size: 32, align: 32, offset: 4352)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1392, file: !4, line: 2489, baseType: !935, size: 32, align: 32, offset: 4384)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1392, file: !4, line: 2493, baseType: !935, size: 32, align: 32, offset: 4416)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1392, file: !4, line: 2501, baseType: !935, size: 32, align: 32, offset: 4448)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1392, file: !4, line: 2506, baseType: !935, size: 32, align: 32, offset: 4480)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1392, file: !4, line: 2510, baseType: !935, size: 32, align: 32, offset: 4512)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1392, file: !4, line: 2514, baseType: !1120, size: 64, align: 64, offset: 4544)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1392, file: !4, line: 2528, baseType: !1669, size: 64, align: 64, offset: 4608)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DISubroutineType(types: !1671)
!1671 = !{null, !1560, !933, !935, !935}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1392, file: !4, line: 2534, baseType: !935, size: 32, align: 32, offset: 4672)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1392, file: !4, line: 2545, baseType: !935, size: 32, align: 32, offset: 4704)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1392, file: !4, line: 2547, baseType: !935, size: 32, align: 32, offset: 4736)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1392, file: !4, line: 2549, baseType: !935, size: 32, align: 32, offset: 4768)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1392, file: !4, line: 2551, baseType: !935, size: 32, align: 32, offset: 4800)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1392, file: !4, line: 2553, baseType: !935, size: 32, align: 32, offset: 4832)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1392, file: !4, line: 2555, baseType: !935, size: 32, align: 32, offset: 4864)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1392, file: !4, line: 2557, baseType: !935, size: 32, align: 32, offset: 4896)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1392, file: !4, line: 2559, baseType: !935, size: 32, align: 32, offset: 4928)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1392, file: !4, line: 2563, baseType: !935, size: 32, align: 32, offset: 4960)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1392, file: !4, line: 2571, baseType: !942, size: 64, align: 64, offset: 4992)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1392, file: !4, line: 2579, baseType: !942, size: 64, align: 64, offset: 5056)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1392, file: !4, line: 2586, baseType: !935, size: 32, align: 32, offset: 5120)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1392, file: !4, line: 2615, baseType: !935, size: 32, align: 32, offset: 5152)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1392, file: !4, line: 2627, baseType: !935, size: 32, align: 32, offset: 5184)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1392, file: !4, line: 2637, baseType: !935, size: 32, align: 32, offset: 5216)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1392, file: !4, line: 2681, baseType: !935, size: 32, align: 32, offset: 5248)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1392, file: !4, line: 2709, baseType: !1120, size: 64, align: 64, offset: 5312)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1392, file: !4, line: 2716, baseType: !1691, size: 64, align: 64, offset: 5376)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64, align: 64)
!1692 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1693)
!1693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1694)
!1694 = !{!1695, !1696, !1697, !1698, !1699, !1700, !1701, !1705, !1709, !1710, !1711, !1712, !1718, !1719, !1720, !1721, !1722}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1693, file: !4, line: 3642, baseType: !944, size: 64, align: 64)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1693, file: !4, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1693, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1693, file: !4, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1693, file: !4, line: 3669, baseType: !935, size: 32, align: 32, offset: 160)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1693, file: !4, line: 3682, baseType: !1518, size: 64, align: 64, offset: 192)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1693, file: !4, line: 3698, baseType: !1702, size: 64, align: 64, offset: 256)
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64, align: 64)
!1703 = !DISubroutineType(types: !1704)
!1704 = !{!935, !1390, !1344, !941}
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1693, file: !4, line: 3712, baseType: !1706, size: 64, align: 64, offset: 320)
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64, align: 64)
!1707 = !DISubroutineType(types: !1708)
!1708 = !{!935, !1390, !935, !1344, !941}
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1693, file: !4, line: 3726, baseType: !1702, size: 64, align: 64, offset: 384)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1693, file: !4, line: 3737, baseType: !1437, size: 64, align: 64, offset: 448)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1693, file: !4, line: 3746, baseType: !935, size: 32, align: 32, offset: 512)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1693, file: !4, line: 3757, baseType: !1713, size: 64, align: 64, offset: 576)
!1713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1714, size: 64, align: 64)
!1714 = !DISubroutineType(types: !1715)
!1715 = !{null, !1716}
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64, align: 64)
!1717 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1693, file: !4, line: 3766, baseType: !1437, size: 64, align: 64, offset: 640)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1693, file: !4, line: 3774, baseType: !1437, size: 64, align: 64, offset: 704)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1693, file: !4, line: 3780, baseType: !935, size: 32, align: 32, offset: 768)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1693, file: !4, line: 3785, baseType: !935, size: 32, align: 32, offset: 800)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1693, file: !4, line: 3795, baseType: !1723, size: 64, align: 64, offset: 832)
!1723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1724, size: 64, align: 64)
!1724 = !DISubroutineType(types: !1725)
!1725 = !{!935, !1390, !1106}
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1392, file: !4, line: 2728, baseType: !933, size: 64, align: 64, offset: 5440)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1392, file: !4, line: 2735, baseType: !1242, size: 512, align: 64, offset: 5504)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1392, file: !4, line: 2742, baseType: !935, size: 32, align: 32, offset: 6016)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1392, file: !4, line: 2755, baseType: !935, size: 32, align: 32, offset: 6048)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1392, file: !4, line: 2776, baseType: !935, size: 32, align: 32, offset: 6080)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1392, file: !4, line: 2783, baseType: !935, size: 32, align: 32, offset: 6112)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1392, file: !4, line: 2791, baseType: !935, size: 32, align: 32, offset: 6144)
