; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--av1_parser.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--av1_parser.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecParserContext = type { i8*, %struct.AVCodecParser*, i64, i64, i64, i32, i32, i64, i64, i64, i64, i32, i32, [4 x i64], [4 x i64], [4 x i64], i32, i64, [4 x i64], i32, i64, i32, i32, i32, [4 x i64], i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!851 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!852 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!853 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!854 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!855 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!856 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!857 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!858 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!859 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!860 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!861 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!862 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !509, line: 538, size: 32, align: 32, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871}
!864 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!865 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!866 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!867 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!868 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!869 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!870 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!871 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892}
!886 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!887 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!888 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!889 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!890 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!891 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!892 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !894, line: 28, size: 32, align: 32, elements: !895)
!894 = !DIFile(filename: "libavcodec/av1.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!895 = !{!896, !897, !898, !899, !900, !901, !902, !903, !904}
!896 = !DIEnumerator(name: "AV1_OBU_SEQUENCE_HEADER", value: 1)
!897 = !DIEnumerator(name: "AV1_OBU_TEMPORAL_DELIMITER", value: 2)
!898 = !DIEnumerator(name: "AV1_OBU_FRAME_HEADER", value: 3)
!899 = !DIEnumerator(name: "AV1_OBU_TILE_GROUP", value: 4)
!900 = !DIEnumerator(name: "AV1_OBU_METADATA", value: 5)
!901 = !DIEnumerator(name: "AV1_OBU_FRAME", value: 6)
!902 = !DIEnumerator(name: "AV1_OBU_REDUNDANT_FRAME_HEADER", value: 7)
!903 = !DIEnumerator(name: "AV1_OBU_TILE_LIST", value: 8)
!904 = !DIEnumerator(name: "AV1_OBU_PADDING", value: 15)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !894, line: 52, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV1_FRAME_KEY", value: 0)
!908 = !DIEnumerator(name: "AV1_FRAME_INTER", value: 1)
!909 = !DIEnumerator(name: "AV1_FRAME_INTRA_ONLY", value: 2)
!910 = !DIEnumerator(name: "AV1_FRAME_SWITCH", value: 3)
!911 = !{!912, !913}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64, align: 64)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamUnitType", file: !915, line: 53, baseType: !916)
!915 = !DIFile(filename: "libavcodec/cbs.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !917, line: 51, baseType: !918)
!917 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!918 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!919 = !{!920, !1587, !1590, !1594, !1595}
!920 = distinct !DIGlobalVariable(name: "ff_av1_parser", scope: !0, file: !921, line: 221, type: !922, isLocal: false, isDefinition: true, variable: { [5 x i32], i32, i32 (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecParserContext*, %struct.AVCodecContext*, i8**, i32*, i8*, i32)*, void (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecContext*, i8*, i32)*, %struct.AVCodecParser* }* @ff_av1_parser)
!921 = !DIFile(filename: "libavcodec/av1_parser.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParser", file: !4, line: 5272, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParser", file: !4, line: 5259, size: 512, align: 64, elements: !924)
!924 = !{!925, !930, !931, !981, !1578, !1582, !1586}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !923, file: !4, line: 5260, baseType: !926, size: 160, align: 32)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !927, size: 160, align: 32, elements: !928)
!927 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!928 = !{!929}
!929 = !DISubrange(count: 5)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !923, file: !4, line: 5261, baseType: !927, size: 32, align: 32, offset: 160)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "parser_init", scope: !923, file: !4, line: 5262, baseType: !932, size: 64, align: 64, offset: 192)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!927, !935}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParserContext", file: !4, line: 5257, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParserContext", file: !4, line: 5092, size: 2816, align: 64, elements: !938)
!938 = !{!939, !940, !942, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !937, file: !4, line: 5093, baseType: !912, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !937, file: !4, line: 5094, baseType: !941, size: 64, align: 64, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !937, file: !4, line: 5095, baseType: !943, size: 64, align: 64, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !917, line: 40, baseType: !944)
!944 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "cur_offset", scope: !937, file: !4, line: 5096, baseType: !943, size: 64, align: 64, offset: 192)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame_offset", scope: !937, file: !4, line: 5098, baseType: !943, size: 64, align: 64, offset: 256)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !937, file: !4, line: 5100, baseType: !927, size: 32, align: 32, offset: 320)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !937, file: !4, line: 5110, baseType: !927, size: 32, align: 32, offset: 352)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !937, file: !4, line: 5111, baseType: !943, size: 64, align: 64, offset: 384)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !937, file: !4, line: 5112, baseType: !943, size: 64, align: 64, offset: 448)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "last_pts", scope: !937, file: !4, line: 5115, baseType: !943, size: 64, align: 64, offset: 512)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "last_dts", scope: !937, file: !4, line: 5116, baseType: !943, size: 64, align: 64, offset: 576)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "fetch_timestamp", scope: !937, file: !4, line: 5117, baseType: !927, size: 32, align: 32, offset: 640)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_start_index", scope: !937, file: !4, line: 5120, baseType: !927, size: 32, align: 32, offset: 672)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_offset", scope: !937, file: !4, line: 5121, baseType: !956, size: 256, align: 64, offset: 704)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 256, align: 64, elements: !957)
!957 = !{!958}
!958 = !DISubrange(count: 4)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pts", scope: !937, file: !4, line: 5122, baseType: !956, size: 256, align: 64, offset: 960)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_dts", scope: !937, file: !4, line: 5123, baseType: !956, size: 256, align: 64, offset: 1216)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !937, file: !4, line: 5125, baseType: !927, size: 32, align: 32, offset: 1472)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !937, file: !4, line: 5132, baseType: !943, size: 64, align: 64, offset: 1536)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_end", scope: !937, file: !4, line: 5133, baseType: !956, size: 256, align: 64, offset: 1600)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !937, file: !4, line: 5141, baseType: !927, size: 32, align: 32, offset: 1856)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !937, file: !4, line: 5148, baseType: !943, size: 64, align: 64, offset: 1920)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "dts_sync_point", scope: !937, file: !4, line: 5161, baseType: !927, size: 32, align: 32, offset: 1984)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "dts_ref_dts_delta", scope: !937, file: !4, line: 5176, baseType: !927, size: 32, align: 32, offset: 2016)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "pts_dts_delta", scope: !937, file: !4, line: 5190, baseType: !927, size: 32, align: 32, offset: 2048)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pos", scope: !937, file: !4, line: 5197, baseType: !956, size: 256, align: 64, offset: 2112)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !937, file: !4, line: 5202, baseType: !943, size: 64, align: 64, offset: 2368)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !937, file: !4, line: 5207, baseType: !943, size: 64, align: 64, offset: 2432)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !937, file: !4, line: 5214, baseType: !927, size: 32, align: 32, offset: 2496)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !937, file: !4, line: 5216, baseType: !3, size: 32, align: 32, offset: 2528)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "picture_structure", scope: !937, file: !4, line: 5226, baseType: !12, size: 32, align: 32, offset: 2560)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "output_picture_number", scope: !937, file: !4, line: 5234, baseType: !927, size: 32, align: 32, offset: 2592)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !937, file: !4, line: 5239, baseType: !927, size: 32, align: 32, offset: 2624)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !937, file: !4, line: 5240, baseType: !927, size: 32, align: 32, offset: 2656)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !937, file: !4, line: 5245, baseType: !927, size: 32, align: 32, offset: 2688)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !937, file: !4, line: 5246, baseType: !927, size: 32, align: 32, offset: 2720)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !937, file: !4, line: 5256, baseType: !927, size: 32, align: 32, offset: 2752)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "parser_parse", scope: !923, file: !4, line: 5265, baseType: !982, size: 64, align: 64, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!927, !935, !985, !1577, !1270, !1473, !927}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !988)
!988 = !{!989, !1033, !1034, !1035, !1300, !1301, !1302, !1303, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1329, !1333, !1334, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1515, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !987, file: !4, line: 1561, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !19, line: 143, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !19, line: 67, size: 640, align: 64, elements: !994)
!994 = !{!995, !999, !1003, !1007, !1008, !1009, !1010, !1014, !1020, !1022, !1026}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !993, file: !19, line: 72, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!998 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !993, file: !19, line: 78, baseType: !1000, size: 64, align: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!996, !912}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !993, file: !19, line: 85, baseType: !1004, size: 64, align: 64, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1006 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !19, line: 85, flags: DIFlagFwdDecl)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !993, file: !19, line: 93, baseType: !927, size: 32, align: 32, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !993, file: !19, line: 99, baseType: !927, size: 32, align: 32, offset: 224)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !993, file: !19, line: 108, baseType: !927, size: 32, align: 32, offset: 256)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !993, file: !19, line: 113, baseType: !1011, size: 64, align: 64, offset: 320)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!912, !912, !912}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !993, file: !19, line: 123, baseType: !1015, size: 64, align: 64, offset: 384)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!1018, !1018}
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !993, file: !19, line: 130, baseType: !1021, size: 32, align: 32, offset: 448)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !19, line: 48, baseType: !18)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !993, file: !19, line: 136, baseType: !1023, size: 64, align: 64, offset: 512)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!1021, !912}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !993, file: !19, line: 142, baseType: !1027, size: 64, align: 64, offset: 576)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!927, !1030, !912, !996, !927}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !19, line: 60, flags: DIFlagFwdDecl)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !987, file: !4, line: 1562, baseType: !927, size: 32, align: 32, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !987, file: !4, line: 1564, baseType: !39, size: 32, align: 32, offset: 96)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !987, file: !4, line: 1565, baseType: !1036, size: 64, align: 64, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1039)
!1039 = !{!1040, !1041, !1042, !1043, !1044, !1045, !1054, !1057, !1060, !1063, !1068, !1071, !1072, !1080, !1081, !1082, !1084, !1088, !1094, !1099, !1103, !1104, !1150, !1271, !1275, !1276, !1280, !1284, !1289, !1293, !1294, !1295}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1038, file: !4, line: 3475, baseType: !996, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1038, file: !4, line: 3480, baseType: !996, size: 64, align: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1038, file: !4, line: 3481, baseType: !39, size: 32, align: 32, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1038, file: !4, line: 3482, baseType: !49, size: 32, align: 32, offset: 160)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1038, file: !4, line: 3487, baseType: !927, size: 32, align: 32, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1038, file: !4, line: 3488, baseType: !1046, size: 64, align: 64, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1049, line: 61, baseType: !1050)
!1049 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1049, line: 58, size: 64, align: 32, elements: !1051)
!1051 = !{!1052, !1053}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1050, file: !1049, line: 59, baseType: !927, size: 32, align: 32)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1050, file: !1049, line: 60, baseType: !927, size: 32, align: 32, offset: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1038, file: !4, line: 3489, baseType: !1055, size: 64, align: 64, offset: 320)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1038, file: !4, line: 3490, baseType: !1058, size: 64, align: 64, offset: 384)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1038, file: !4, line: 3491, baseType: !1061, size: 64, align: 64, offset: 448)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1038, file: !4, line: 3492, baseType: !1064, size: 64, align: 64, offset: 512)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1066)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !917, line: 55, baseType: !1067)
!1067 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1038, file: !4, line: 3493, baseType: !1069, size: 8, align: 8, offset: 576)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !917, line: 48, baseType: !1070)
!1070 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1038, file: !4, line: 3494, baseType: !990, size: 64, align: 64, offset: 640)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1038, file: !4, line: 3495, baseType: !1073, size: 64, align: 64, offset: 704)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1075)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1076)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1077)
!1077 = !{!1078, !1079}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1076, file: !4, line: 3402, baseType: !927, size: 32, align: 32)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1076, file: !4, line: 3403, baseType: !996, size: 64, align: 64, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1038, file: !4, line: 3507, baseType: !996, size: 64, align: 64, offset: 768)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1038, file: !4, line: 3516, baseType: !927, size: 32, align: 32, offset: 832)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1038, file: !4, line: 3517, baseType: !1083, size: 64, align: 64, offset: 896)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1038, file: !4, line: 3527, baseType: !1085, size: 64, align: 64, offset: 960)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!927, !985}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1038, file: !4, line: 3535, baseType: !1089, size: 64, align: 64, offset: 1024)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!927, !985, !1092}
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1038, file: !4, line: 3541, baseType: !1095, size: 64, align: 64, offset: 1088)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1098)
!1098 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1038, file: !4, line: 3549, baseType: !1100, size: 64, align: 64, offset: 1152)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{null, !1083}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1038, file: !4, line: 3551, baseType: !1085, size: 64, align: 64, offset: 1216)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1038, file: !4, line: 3552, baseType: !1105, size: 64, align: 64, offset: 1280)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!927, !985, !1108, !927, !1109}
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1112)
!1112 = !{!1113, !1116, !1117, !1118, !1119, !1149}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1111, file: !4, line: 3921, baseType: !1114, size: 16, align: 16)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !917, line: 49, baseType: !1115)
!1115 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1111, file: !4, line: 3922, baseType: !916, size: 32, align: 32, offset: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1111, file: !4, line: 3923, baseType: !916, size: 32, align: 32, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1111, file: !4, line: 3924, baseType: !918, size: 32, align: 32, offset: 96)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1111, file: !4, line: 3925, baseType: !1120, size: 64, align: 64, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1123)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1124)
!1124 = !{!1125, !1126, !1127, !1128, !1129, !1130, !1140, !1142, !1144, !1145, !1147, !1148}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1123, file: !4, line: 3886, baseType: !927, size: 32, align: 32)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1123, file: !4, line: 3887, baseType: !927, size: 32, align: 32, offset: 32)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1123, file: !4, line: 3888, baseType: !927, size: 32, align: 32, offset: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1123, file: !4, line: 3889, baseType: !927, size: 32, align: 32, offset: 96)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1123, file: !4, line: 3890, baseType: !927, size: 32, align: 32, offset: 128)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1123, file: !4, line: 3897, baseType: !1131, size: 768, align: 64, offset: 192)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1132)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1133)
!1133 = !{!1134, !1138}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1132, file: !4, line: 3855, baseType: !1135, size: 512, align: 64)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1108, size: 512, align: 64, elements: !1136)
!1136 = !{!1137}
!1137 = !DISubrange(count: 8)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1132, file: !4, line: 3857, baseType: !1139, size: 256, align: 32, offset: 512)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !927, size: 256, align: 32, elements: !1136)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1123, file: !4, line: 3903, baseType: !1141, size: 256, align: 64, offset: 960)
!1141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1108, size: 256, align: 64, elements: !957)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1123, file: !4, line: 3904, baseType: !1143, size: 128, align: 32, offset: 1216)
!1143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !927, size: 128, align: 32, elements: !957)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1123, file: !4, line: 3906, baseType: !725, size: 32, align: 32, offset: 1344)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1123, file: !4, line: 3908, baseType: !1146, size: 64, align: 64, offset: 1408)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1123, file: !4, line: 3915, baseType: !1146, size: 64, align: 64, offset: 1472)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1123, file: !4, line: 3917, baseType: !927, size: 32, align: 32, offset: 1536)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1111, file: !4, line: 3926, baseType: !943, size: 64, align: 64, offset: 192)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1038, file: !4, line: 3564, baseType: !1151, size: 64, align: 64, offset: 1344)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!927, !985, !1154, !1188, !1270}
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1157)
!1157 = !{!1158, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1184, !1185, !1186, !1187}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1156, file: !4, line: 1451, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1161, line: 94, baseType: !1162)
!1161 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1161, line: 81, size: 192, align: 64, elements: !1163)
!1163 = !{!1164, !1168, !1169}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1162, file: !1161, line: 82, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1161, line: 73, baseType: !1167)
!1167 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1161, line: 73, flags: DIFlagFwdDecl)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1162, file: !1161, line: 89, baseType: !1108, size: 64, align: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1162, file: !1161, line: 93, baseType: !927, size: 32, align: 32, offset: 128)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1156, file: !4, line: 1461, baseType: !943, size: 64, align: 64, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1156, file: !4, line: 1467, baseType: !943, size: 64, align: 64, offset: 128)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1156, file: !4, line: 1468, baseType: !1108, size: 64, align: 64, offset: 192)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1156, file: !4, line: 1469, baseType: !927, size: 32, align: 32, offset: 256)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1156, file: !4, line: 1470, baseType: !927, size: 32, align: 32, offset: 288)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1156, file: !4, line: 1474, baseType: !927, size: 32, align: 32, offset: 320)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1156, file: !4, line: 1479, baseType: !1177, size: 64, align: 64, offset: 384)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1180)
!1180 = !{!1181, !1182, !1183}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1179, file: !4, line: 1412, baseType: !1108, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1179, file: !4, line: 1413, baseType: !927, size: 32, align: 32, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1179, file: !4, line: 1414, baseType: !731, size: 32, align: 32, offset: 96)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1156, file: !4, line: 1480, baseType: !927, size: 32, align: 32, offset: 448)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1156, file: !4, line: 1486, baseType: !943, size: 64, align: 64, offset: 512)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1156, file: !4, line: 1488, baseType: !943, size: 64, align: 64, offset: 576)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1156, file: !4, line: 1497, baseType: !943, size: 64, align: 64, offset: 640)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1190)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !772, line: 646, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !772, line: 268, size: 4288, align: 64, elements: !1192)
!1192 = !{!1193, !1194, !1195, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1222, !1224, !1225, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1258, !1259, !1260, !1261, !1262, !1263, !1266, !1267, !1268, !1269}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1191, file: !772, line: 282, baseType: !1135, size: 512, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1191, file: !772, line: 299, baseType: !1139, size: 256, align: 32, offset: 512)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1191, file: !772, line: 315, baseType: !1196, size: 64, align: 64, offset: 768)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1191, file: !772, line: 326, baseType: !927, size: 32, align: 32, offset: 832)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1191, file: !772, line: 326, baseType: !927, size: 32, align: 32, offset: 864)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1191, file: !772, line: 334, baseType: !927, size: 32, align: 32, offset: 896)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1191, file: !772, line: 341, baseType: !927, size: 32, align: 32, offset: 928)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1191, file: !772, line: 346, baseType: !927, size: 32, align: 32, offset: 960)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1191, file: !772, line: 351, baseType: !761, size: 32, align: 32, offset: 992)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1191, file: !772, line: 356, baseType: !1048, size: 64, align: 32, offset: 1024)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1191, file: !772, line: 361, baseType: !943, size: 64, align: 64, offset: 1088)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1191, file: !772, line: 369, baseType: !943, size: 64, align: 64, offset: 1152)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1191, file: !772, line: 377, baseType: !943, size: 64, align: 64, offset: 1216)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1191, file: !772, line: 382, baseType: !927, size: 32, align: 32, offset: 1280)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1191, file: !772, line: 386, baseType: !927, size: 32, align: 32, offset: 1312)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1191, file: !772, line: 391, baseType: !927, size: 32, align: 32, offset: 1344)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1191, file: !772, line: 396, baseType: !912, size: 64, align: 64, offset: 1408)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1191, file: !772, line: 403, baseType: !1212, size: 512, align: 64, offset: 1472)
!1212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1066, size: 512, align: 64, elements: !1136)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1191, file: !772, line: 410, baseType: !927, size: 32, align: 32, offset: 1984)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1191, file: !772, line: 415, baseType: !927, size: 32, align: 32, offset: 2016)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1191, file: !772, line: 420, baseType: !927, size: 32, align: 32, offset: 2048)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1191, file: !772, line: 425, baseType: !927, size: 32, align: 32, offset: 2080)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1191, file: !772, line: 435, baseType: !943, size: 64, align: 64, offset: 2112)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1191, file: !772, line: 440, baseType: !927, size: 32, align: 32, offset: 2176)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1191, file: !772, line: 445, baseType: !1066, size: 64, align: 64, offset: 2240)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1191, file: !772, line: 459, baseType: !1221, size: 512, align: 64, offset: 2304)
!1221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1159, size: 512, align: 64, elements: !1136)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1191, file: !772, line: 473, baseType: !1223, size: 64, align: 64, offset: 2816)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1191, file: !772, line: 477, baseType: !927, size: 32, align: 32, offset: 2880)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1191, file: !772, line: 479, baseType: !1226, size: 64, align: 64, offset: 2944)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !772, line: 207, baseType: !1229)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !772, line: 201, size: 320, align: 64, elements: !1230)
!1230 = !{!1231, !1232, !1233, !1234, !1239}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1229, file: !772, line: 202, baseType: !771, size: 32, align: 32)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1229, file: !772, line: 203, baseType: !1108, size: 64, align: 64, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1229, file: !772, line: 204, baseType: !927, size: 32, align: 32, offset: 128)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1229, file: !772, line: 205, baseType: !1235, size: 64, align: 64, offset: 192)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1237, line: 86, baseType: !1238)
!1237 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1238 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1237, line: 86, flags: DIFlagFwdDecl)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1229, file: !772, line: 206, baseType: !1159, size: 64, align: 64, offset: 256)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1191, file: !772, line: 480, baseType: !927, size: 32, align: 32, offset: 3008)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1191, file: !772, line: 505, baseType: !927, size: 32, align: 32, offset: 3040)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1191, file: !772, line: 512, baseType: !795, size: 32, align: 32, offset: 3072)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1191, file: !772, line: 514, baseType: !801, size: 32, align: 32, offset: 3104)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1191, file: !772, line: 516, baseType: !819, size: 32, align: 32, offset: 3136)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1191, file: !772, line: 523, baseType: !843, size: 32, align: 32, offset: 3168)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1191, file: !772, line: 525, baseType: !862, size: 32, align: 32, offset: 3200)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1191, file: !772, line: 532, baseType: !943, size: 64, align: 64, offset: 3264)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1191, file: !772, line: 539, baseType: !943, size: 64, align: 64, offset: 3328)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1191, file: !772, line: 547, baseType: !943, size: 64, align: 64, offset: 3392)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1191, file: !772, line: 554, baseType: !1235, size: 64, align: 64, offset: 3456)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1191, file: !772, line: 563, baseType: !927, size: 32, align: 32, offset: 3520)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1191, file: !772, line: 572, baseType: !927, size: 32, align: 32, offset: 3552)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1191, file: !772, line: 581, baseType: !927, size: 32, align: 32, offset: 3584)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1191, file: !772, line: 588, baseType: !1255, size: 64, align: 64, offset: 3648)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !917, line: 36, baseType: !1257)
!1257 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1191, file: !772, line: 593, baseType: !927, size: 32, align: 32, offset: 3712)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1191, file: !772, line: 596, baseType: !927, size: 32, align: 32, offset: 3744)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1191, file: !772, line: 599, baseType: !1159, size: 64, align: 64, offset: 3776)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1191, file: !772, line: 605, baseType: !1159, size: 64, align: 64, offset: 3840)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1191, file: !772, line: 616, baseType: !1159, size: 64, align: 64, offset: 3904)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1191, file: !772, line: 626, baseType: !1264, size: 64, align: 64, offset: 3968)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1265, line: 216, baseType: !1067)
!1265 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1191, file: !772, line: 627, baseType: !1264, size: 64, align: 64, offset: 4032)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1191, file: !772, line: 628, baseType: !1264, size: 64, align: 64, offset: 4096)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1191, file: !772, line: 629, baseType: !1264, size: 64, align: 64, offset: 4160)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1191, file: !772, line: 645, baseType: !1159, size: 64, align: 64, offset: 4224)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1038, file: !4, line: 3566, baseType: !1272, size: 64, align: 64, offset: 1408)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{!927, !985, !912, !1270, !1154}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1038, file: !4, line: 3567, baseType: !1085, size: 64, align: 64, offset: 1472)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1038, file: !4, line: 3576, baseType: !1277, size: 64, align: 64, offset: 1536)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{!927, !985, !1188}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1038, file: !4, line: 3577, baseType: !1281, size: 64, align: 64, offset: 1600)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{!927, !985, !1154}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1038, file: !4, line: 3584, baseType: !1285, size: 64, align: 64, offset: 1664)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!927, !985, !1288}
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1038, file: !4, line: 3589, baseType: !1290, size: 64, align: 64, offset: 1728)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{null, !985}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1038, file: !4, line: 3594, baseType: !927, size: 32, align: 32, offset: 1792)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1038, file: !4, line: 3600, baseType: !996, size: 64, align: 64, offset: 1856)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1038, file: !4, line: 3609, baseType: !1296, size: 64, align: 64, offset: 1920)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1299)
!1299 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !987, file: !4, line: 1566, baseType: !49, size: 32, align: 32, offset: 192)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !987, file: !4, line: 1581, baseType: !918, size: 32, align: 32, offset: 224)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !987, file: !4, line: 1583, baseType: !912, size: 64, align: 64, offset: 256)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !987, file: !4, line: 1591, baseType: !1304, size: 64, align: 64, offset: 320)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !987, file: !4, line: 1598, baseType: !912, size: 64, align: 64, offset: 384)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !987, file: !4, line: 1606, baseType: !943, size: 64, align: 64, offset: 448)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !987, file: !4, line: 1614, baseType: !927, size: 32, align: 32, offset: 512)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !987, file: !4, line: 1622, baseType: !927, size: 32, align: 32, offset: 544)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !987, file: !4, line: 1628, baseType: !927, size: 32, align: 32, offset: 576)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !987, file: !4, line: 1636, baseType: !927, size: 32, align: 32, offset: 608)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !987, file: !4, line: 1643, baseType: !927, size: 32, align: 32, offset: 640)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !987, file: !4, line: 1657, baseType: !1108, size: 64, align: 64, offset: 704)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !987, file: !4, line: 1658, baseType: !927, size: 32, align: 32, offset: 768)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !987, file: !4, line: 1679, baseType: !1048, size: 64, align: 32, offset: 800)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !987, file: !4, line: 1688, baseType: !927, size: 32, align: 32, offset: 864)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !987, file: !4, line: 1712, baseType: !927, size: 32, align: 32, offset: 896)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !987, file: !4, line: 1729, baseType: !927, size: 32, align: 32, offset: 928)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !987, file: !4, line: 1729, baseType: !927, size: 32, align: 32, offset: 960)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !987, file: !4, line: 1744, baseType: !927, size: 32, align: 32, offset: 992)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !987, file: !4, line: 1744, baseType: !927, size: 32, align: 32, offset: 1024)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !987, file: !4, line: 1751, baseType: !927, size: 32, align: 32, offset: 1056)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !987, file: !4, line: 1766, baseType: !508, size: 32, align: 32, offset: 1088)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !987, file: !4, line: 1791, baseType: !1325, size: 64, align: 64, offset: 1152)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DISubroutineType(types: !1327)
!1327 = !{null, !1328, !1188, !1270, !927, !927, !927}
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !987, file: !4, line: 1808, baseType: !1330, size: 64, align: 64, offset: 1216)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DISubroutineType(types: !1332)
!1332 = !{!508, !1328, !1055}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !987, file: !4, line: 1816, baseType: !927, size: 32, align: 32, offset: 1280)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !987, file: !4, line: 1825, baseType: !1335, size: 32, align: 32, offset: 1312)
!1335 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !987, file: !4, line: 1830, baseType: !927, size: 32, align: 32, offset: 1344)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !987, file: !4, line: 1838, baseType: !1335, size: 32, align: 32, offset: 1376)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !987, file: !4, line: 1846, baseType: !927, size: 32, align: 32, offset: 1408)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !987, file: !4, line: 1851, baseType: !927, size: 32, align: 32, offset: 1440)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !987, file: !4, line: 1861, baseType: !1335, size: 32, align: 32, offset: 1472)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !987, file: !4, line: 1868, baseType: !1335, size: 32, align: 32, offset: 1504)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !987, file: !4, line: 1875, baseType: !1335, size: 32, align: 32, offset: 1536)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !987, file: !4, line: 1882, baseType: !1335, size: 32, align: 32, offset: 1568)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !987, file: !4, line: 1889, baseType: !1335, size: 32, align: 32, offset: 1600)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !987, file: !4, line: 1896, baseType: !1335, size: 32, align: 32, offset: 1632)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !987, file: !4, line: 1903, baseType: !1335, size: 32, align: 32, offset: 1664)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !987, file: !4, line: 1910, baseType: !927, size: 32, align: 32, offset: 1696)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !987, file: !4, line: 1915, baseType: !927, size: 32, align: 32, offset: 1728)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !987, file: !4, line: 1926, baseType: !1270, size: 64, align: 64, offset: 1792)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !987, file: !4, line: 1935, baseType: !1048, size: 64, align: 32, offset: 1856)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !987, file: !4, line: 1942, baseType: !927, size: 32, align: 32, offset: 1920)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !987, file: !4, line: 1948, baseType: !927, size: 32, align: 32, offset: 1952)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !987, file: !4, line: 1954, baseType: !927, size: 32, align: 32, offset: 1984)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !987, file: !4, line: 1960, baseType: !927, size: 32, align: 32, offset: 2016)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !987, file: !4, line: 1984, baseType: !927, size: 32, align: 32, offset: 2048)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !987, file: !4, line: 1991, baseType: !927, size: 32, align: 32, offset: 2080)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !987, file: !4, line: 1996, baseType: !927, size: 32, align: 32, offset: 2112)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !987, file: !4, line: 2004, baseType: !927, size: 32, align: 32, offset: 2144)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !987, file: !4, line: 2011, baseType: !927, size: 32, align: 32, offset: 2176)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !987, file: !4, line: 2018, baseType: !927, size: 32, align: 32, offset: 2208)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !987, file: !4, line: 2027, baseType: !927, size: 32, align: 32, offset: 2240)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !987, file: !4, line: 2034, baseType: !927, size: 32, align: 32, offset: 2272)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !987, file: !4, line: 2044, baseType: !927, size: 32, align: 32, offset: 2304)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !987, file: !4, line: 2054, baseType: !1365, size: 64, align: 64, offset: 2368)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !987, file: !4, line: 2061, baseType: !1365, size: 64, align: 64, offset: 2432)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !987, file: !4, line: 2066, baseType: !927, size: 32, align: 32, offset: 2496)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !987, file: !4, line: 2070, baseType: !927, size: 32, align: 32, offset: 2528)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !987, file: !4, line: 2078, baseType: !927, size: 32, align: 32, offset: 2560)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !987, file: !4, line: 2085, baseType: !927, size: 32, align: 32, offset: 2592)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !987, file: !4, line: 2092, baseType: !927, size: 32, align: 32, offset: 2624)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !987, file: !4, line: 2099, baseType: !927, size: 32, align: 32, offset: 2656)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !987, file: !4, line: 2106, baseType: !927, size: 32, align: 32, offset: 2688)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !987, file: !4, line: 2113, baseType: !927, size: 32, align: 32, offset: 2720)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !987, file: !4, line: 2120, baseType: !927, size: 32, align: 32, offset: 2752)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !987, file: !4, line: 2125, baseType: !927, size: 32, align: 32, offset: 2784)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !987, file: !4, line: 2133, baseType: !927, size: 32, align: 32, offset: 2816)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !987, file: !4, line: 2140, baseType: !927, size: 32, align: 32, offset: 2848)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !987, file: !4, line: 2145, baseType: !927, size: 32, align: 32, offset: 2880)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !987, file: !4, line: 2153, baseType: !927, size: 32, align: 32, offset: 2912)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !987, file: !4, line: 2158, baseType: !927, size: 32, align: 32, offset: 2944)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !987, file: !4, line: 2166, baseType: !801, size: 32, align: 32, offset: 2976)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !987, file: !4, line: 2173, baseType: !819, size: 32, align: 32, offset: 3008)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !987, file: !4, line: 2180, baseType: !843, size: 32, align: 32, offset: 3040)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !987, file: !4, line: 2187, baseType: !795, size: 32, align: 32, offset: 3072)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !987, file: !4, line: 2194, baseType: !862, size: 32, align: 32, offset: 3104)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !987, file: !4, line: 2203, baseType: !927, size: 32, align: 32, offset: 3136)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !987, file: !4, line: 2209, baseType: !3, size: 32, align: 32, offset: 3168)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !987, file: !4, line: 2212, baseType: !927, size: 32, align: 32, offset: 3200)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !987, file: !4, line: 2213, baseType: !927, size: 32, align: 32, offset: 3232)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !987, file: !4, line: 2220, baseType: !708, size: 32, align: 32, offset: 3264)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !987, file: !4, line: 2232, baseType: !927, size: 32, align: 32, offset: 3296)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !987, file: !4, line: 2243, baseType: !927, size: 32, align: 32, offset: 3328)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !987, file: !4, line: 2249, baseType: !927, size: 32, align: 32, offset: 3360)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !987, file: !4, line: 2256, baseType: !927, size: 32, align: 32, offset: 3392)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !987, file: !4, line: 2263, baseType: !1066, size: 64, align: 64, offset: 3456)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !987, file: !4, line: 2270, baseType: !1066, size: 64, align: 64, offset: 3520)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !987, file: !4, line: 2277, baseType: !872, size: 32, align: 32, offset: 3584)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !987, file: !4, line: 2285, baseType: !708, size: 32, align: 32, offset: 3616)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !987, file: !4, line: 2367, baseType: !1401, size: 64, align: 64, offset: 3648)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DISubroutineType(types: !1403)
!1403 = !{!927, !1328, !1288, !927}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !987, file: !4, line: 2383, baseType: !927, size: 32, align: 32, offset: 3712)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !987, file: !4, line: 2386, baseType: !1335, size: 32, align: 32, offset: 3744)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !987, file: !4, line: 2387, baseType: !1335, size: 32, align: 32, offset: 3776)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !987, file: !4, line: 2394, baseType: !927, size: 32, align: 32, offset: 3808)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !987, file: !4, line: 2401, baseType: !927, size: 32, align: 32, offset: 3840)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !987, file: !4, line: 2408, baseType: !927, size: 32, align: 32, offset: 3872)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !987, file: !4, line: 2415, baseType: !927, size: 32, align: 32, offset: 3904)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !987, file: !4, line: 2422, baseType: !927, size: 32, align: 32, offset: 3936)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !987, file: !4, line: 2423, baseType: !1413, size: 64, align: 64, offset: 3968)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1415)
!1415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1416)
!1416 = !{!1417, !1418, !1419, !1420}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1415, file: !4, line: 827, baseType: !927, size: 32, align: 32)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1415, file: !4, line: 828, baseType: !927, size: 32, align: 32, offset: 32)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1415, file: !4, line: 829, baseType: !927, size: 32, align: 32, offset: 64)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1415, file: !4, line: 830, baseType: !1335, size: 32, align: 32, offset: 96)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !987, file: !4, line: 2430, baseType: !943, size: 64, align: 64, offset: 4032)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !987, file: !4, line: 2437, baseType: !943, size: 64, align: 64, offset: 4096)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !987, file: !4, line: 2444, baseType: !1335, size: 32, align: 32, offset: 4160)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !987, file: !4, line: 2451, baseType: !1335, size: 32, align: 32, offset: 4192)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !987, file: !4, line: 2458, baseType: !927, size: 32, align: 32, offset: 4224)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !987, file: !4, line: 2469, baseType: !927, size: 32, align: 32, offset: 4256)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !987, file: !4, line: 2475, baseType: !927, size: 32, align: 32, offset: 4288)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !987, file: !4, line: 2481, baseType: !927, size: 32, align: 32, offset: 4320)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !987, file: !4, line: 2485, baseType: !927, size: 32, align: 32, offset: 4352)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !987, file: !4, line: 2489, baseType: !927, size: 32, align: 32, offset: 4384)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !987, file: !4, line: 2493, baseType: !927, size: 32, align: 32, offset: 4416)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !987, file: !4, line: 2501, baseType: !927, size: 32, align: 32, offset: 4448)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !987, file: !4, line: 2506, baseType: !927, size: 32, align: 32, offset: 4480)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !987, file: !4, line: 2510, baseType: !927, size: 32, align: 32, offset: 4512)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !987, file: !4, line: 2514, baseType: !943, size: 64, align: 64, offset: 4544)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !987, file: !4, line: 2528, baseType: !1437, size: 64, align: 64, offset: 4608)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DISubroutineType(types: !1439)
!1439 = !{null, !1328, !912, !927, !927}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !987, file: !4, line: 2534, baseType: !927, size: 32, align: 32, offset: 4672)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !987, file: !4, line: 2545, baseType: !927, size: 32, align: 32, offset: 4704)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !987, file: !4, line: 2547, baseType: !927, size: 32, align: 32, offset: 4736)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !987, file: !4, line: 2549, baseType: !927, size: 32, align: 32, offset: 4768)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !987, file: !4, line: 2551, baseType: !927, size: 32, align: 32, offset: 4800)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !987, file: !4, line: 2553, baseType: !927, size: 32, align: 32, offset: 4832)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !987, file: !4, line: 2555, baseType: !927, size: 32, align: 32, offset: 4864)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !987, file: !4, line: 2557, baseType: !927, size: 32, align: 32, offset: 4896)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !987, file: !4, line: 2559, baseType: !927, size: 32, align: 32, offset: 4928)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !987, file: !4, line: 2563, baseType: !927, size: 32, align: 32, offset: 4960)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !987, file: !4, line: 2571, baseType: !1146, size: 64, align: 64, offset: 4992)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !987, file: !4, line: 2579, baseType: !1146, size: 64, align: 64, offset: 5056)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !987, file: !4, line: 2586, baseType: !927, size: 32, align: 32, offset: 5120)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !987, file: !4, line: 2615, baseType: !927, size: 32, align: 32, offset: 5152)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !987, file: !4, line: 2627, baseType: !927, size: 32, align: 32, offset: 5184)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !987, file: !4, line: 2637, baseType: !927, size: 32, align: 32, offset: 5216)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !987, file: !4, line: 2681, baseType: !927, size: 32, align: 32, offset: 5248)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !987, file: !4, line: 2709, baseType: !943, size: 64, align: 64, offset: 5312)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !987, file: !4, line: 2716, baseType: !1459, size: 64, align: 64, offset: 5376)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1461)
!1461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1462)
!1462 = !{!1463, !1464, !1465, !1466, !1467, !1468, !1469, !1475, !1479, !1480, !1481, !1482, !1488, !1489, !1490, !1491, !1492}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1461, file: !4, line: 3642, baseType: !996, size: 64, align: 64)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1461, file: !4, line: 3649, baseType: !39, size: 32, align: 32, offset: 64)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1461, file: !4, line: 3656, baseType: !49, size: 32, align: 32, offset: 96)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1461, file: !4, line: 3663, baseType: !508, size: 32, align: 32, offset: 128)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1461, file: !4, line: 3669, baseType: !927, size: 32, align: 32, offset: 160)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1461, file: !4, line: 3682, baseType: !1285, size: 64, align: 64, offset: 192)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1461, file: !4, line: 3698, baseType: !1470, size: 64, align: 64, offset: 256)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{!927, !985, !1473, !916}
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1069)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1461, file: !4, line: 3712, baseType: !1476, size: 64, align: 64, offset: 320)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DISubroutineType(types: !1478)
!1478 = !{!927, !985, !927, !1473, !916}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1461, file: !4, line: 3726, baseType: !1470, size: 64, align: 64, offset: 384)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1461, file: !4, line: 3737, baseType: !1085, size: 64, align: 64, offset: 448)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1461, file: !4, line: 3746, baseType: !927, size: 32, align: 32, offset: 512)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1461, file: !4, line: 3757, baseType: !1483, size: 64, align: 64, offset: 576)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DISubroutineType(types: !1485)
!1485 = !{null, !1486}
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1461, file: !4, line: 3766, baseType: !1085, size: 64, align: 64, offset: 640)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1461, file: !4, line: 3774, baseType: !1085, size: 64, align: 64, offset: 704)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1461, file: !4, line: 3780, baseType: !927, size: 32, align: 32, offset: 768)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1461, file: !4, line: 3785, baseType: !927, size: 32, align: 32, offset: 800)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1461, file: !4, line: 3795, baseType: !1493, size: 64, align: 64, offset: 832)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DISubroutineType(types: !1495)
!1495 = !{!927, !985, !1159}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !987, file: !4, line: 2728, baseType: !912, size: 64, align: 64, offset: 5440)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !987, file: !4, line: 2735, baseType: !1212, size: 512, align: 64, offset: 5504)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !987, file: !4, line: 2742, baseType: !927, size: 32, align: 32, offset: 6016)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !987, file: !4, line: 2755, baseType: !927, size: 32, align: 32, offset: 6048)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !987, file: !4, line: 2776, baseType: !927, size: 32, align: 32, offset: 6080)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !987, file: !4, line: 2783, baseType: !927, size: 32, align: 32, offset: 6112)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !987, file: !4, line: 2791, baseType: !927, size: 32, align: 32, offset: 6144)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !987, file: !4, line: 2802, baseType: !1288, size: 64, align: 64, offset: 6208)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !987, file: !4, line: 2811, baseType: !927, size: 32, align: 32, offset: 6272)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !987, file: !4, line: 2821, baseType: !927, size: 32, align: 32, offset: 6304)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !987, file: !4, line: 2830, baseType: !927, size: 32, align: 32, offset: 6336)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !987, file: !4, line: 2840, baseType: !927, size: 32, align: 32, offset: 6368)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !987, file: !4, line: 2851, baseType: !1509, size: 64, align: 64, offset: 6400)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DISubroutineType(types: !1511)
!1511 = !{!927, !1328, !1512, !912, !1270, !927, !927}
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64, align: 64)
!1513 = !DISubroutineType(types: !1514)
!1514 = !{!927, !1328, !912}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !987, file: !4, line: 2871, baseType: !1516, size: 64, align: 64, offset: 6464)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DISubroutineType(types: !1518)
!1518 = !{!927, !1328, !1519, !912, !1270, !927}
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DISubroutineType(types: !1521)
!1521 = !{!927, !1328, !912, !927, !927}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !987, file: !4, line: 2878, baseType: !927, size: 32, align: 32, offset: 6528)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !987, file: !4, line: 2885, baseType: !927, size: 32, align: 32, offset: 6560)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !987, file: !4, line: 3005, baseType: !927, size: 32, align: 32, offset: 6592)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !987, file: !4, line: 3013, baseType: !884, size: 32, align: 32, offset: 6624)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !987, file: !4, line: 3020, baseType: !884, size: 32, align: 32, offset: 6656)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !987, file: !4, line: 3027, baseType: !884, size: 32, align: 32, offset: 6688)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !987, file: !4, line: 3037, baseType: !1108, size: 64, align: 64, offset: 6720)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !987, file: !4, line: 3038, baseType: !927, size: 32, align: 32, offset: 6784)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !987, file: !4, line: 3050, baseType: !1066, size: 64, align: 64, offset: 6848)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !987, file: !4, line: 3065, baseType: !927, size: 32, align: 32, offset: 6912)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !987, file: !4, line: 3083, baseType: !927, size: 32, align: 32, offset: 6944)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !987, file: !4, line: 3092, baseType: !1048, size: 64, align: 32, offset: 6976)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !987, file: !4, line: 3099, baseType: !508, size: 32, align: 32, offset: 7040)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !987, file: !4, line: 3106, baseType: !1048, size: 64, align: 32, offset: 7072)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !987, file: !4, line: 3113, baseType: !1537, size: 64, align: 64, offset: 7168)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64, align: 64)
!1538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1539)
!1539 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1540)
!1540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1541)
!1541 = !{!1542, !1543, !1544, !1545, !1546, !1547, !1550}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1540, file: !4, line: 713, baseType: !49, size: 32, align: 32)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1540, file: !4, line: 714, baseType: !39, size: 32, align: 32, offset: 32)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1540, file: !4, line: 720, baseType: !996, size: 64, align: 64, offset: 64)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1540, file: !4, line: 724, baseType: !996, size: 64, align: 64, offset: 128)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1540, file: !4, line: 728, baseType: !927, size: 32, align: 32, offset: 192)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1540, file: !4, line: 734, baseType: !1548, size: 64, align: 64, offset: 256)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1540, file: !4, line: 739, baseType: !1551, size: 64, align: 64, offset: 320)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1552, size: 64, align: 64)
!1552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1076)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !987, file: !4, line: 3129, baseType: !943, size: 64, align: 64, offset: 7232)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !987, file: !4, line: 3130, baseType: !943, size: 64, align: 64, offset: 7296)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !987, file: !4, line: 3131, baseType: !943, size: 64, align: 64, offset: 7360)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !987, file: !4, line: 3132, baseType: !943, size: 64, align: 64, offset: 7424)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !987, file: !4, line: 3139, baseType: !1146, size: 64, align: 64, offset: 7488)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !987, file: !4, line: 3147, baseType: !927, size: 32, align: 32, offset: 7552)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !987, file: !4, line: 3165, baseType: !927, size: 32, align: 32, offset: 7584)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !987, file: !4, line: 3172, baseType: !927, size: 32, align: 32, offset: 7616)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !987, file: !4, line: 3180, baseType: !927, size: 32, align: 32, offset: 7648)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !987, file: !4, line: 3191, baseType: !1365, size: 64, align: 64, offset: 7680)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !987, file: !4, line: 3199, baseType: !1108, size: 64, align: 64, offset: 7744)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !987, file: !4, line: 3207, baseType: !1146, size: 64, align: 64, offset: 7808)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !987, file: !4, line: 3214, baseType: !918, size: 32, align: 32, offset: 7872)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !987, file: !4, line: 3224, baseType: !1177, size: 64, align: 64, offset: 7936)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !987, file: !4, line: 3225, baseType: !927, size: 32, align: 32, offset: 8000)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !987, file: !4, line: 3249, baseType: !1159, size: 64, align: 64, offset: 8064)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !987, file: !4, line: 3256, baseType: !927, size: 32, align: 32, offset: 8128)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !987, file: !4, line: 3271, baseType: !927, size: 32, align: 32, offset: 8160)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !987, file: !4, line: 3279, baseType: !943, size: 64, align: 64, offset: 8192)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !987, file: !4, line: 3301, baseType: !1159, size: 64, align: 64, offset: 8256)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !987, file: !4, line: 3310, baseType: !927, size: 32, align: 32, offset: 8320)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !987, file: !4, line: 3337, baseType: !927, size: 32, align: 32, offset: 8352)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !987, file: !4, line: 3351, baseType: !927, size: 32, align: 32, offset: 8384)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !987, file: !4, line: 3359, baseType: !927, size: 32, align: 32, offset: 8416)
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "parser_close", scope: !923, file: !4, line: 5269, baseType: !1579, size: 64, align: 64, offset: 320)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DISubroutineType(types: !1581)
!1581 = !{null, !935}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !923, file: !4, line: 5270, baseType: !1583, size: 64, align: 64, offset: 384)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DISubroutineType(types: !1585)
!1585 = !{!927, !985, !1473, !927}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !923, file: !4, line: 5271, baseType: !941, size: 64, align: 64, offset: 448)
!1587 = distinct !DIGlobalVariable(name: "decompose_unit_types", scope: !0, file: !921, line: 169, type: !1588, isLocal: true, isDefinition: true, variable: [5 x i32]* @decompose_unit_types)
!1588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1589, size: 160, align: 32, elements: !928)
!1589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !914)
!1590 = distinct !DIGlobalVariable(name: "pix_fmts_8bit", scope: !0, file: !921, line: 34, type: !1591, isLocal: true, isDefinition: true, variable: [2 x [2 x i32]]* @pix_fmts_8bit)
!1591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1056, size: 128, align: 32, elements: !1592)
!1592 = !{!1593, !1593}
!1593 = !DISubrange(count: 2)
!1594 = distinct !DIGlobalVariable(name: "pix_fmts_10bit", scope: !0, file: !921, line: 38, type: !1591, isLocal: true, isDefinition: true, variable: [2 x [2 x i32]]* @pix_fmts_10bit)
!1595 = distinct !DIGlobalVariable(name: "pix_fmts_12bit", scope: !0, file: !921, line: 42, type: !1591, isLocal: true, isDefinition: true, variable: [2 x [2 x i32]]* @pix_fmts_12bit)
!1596 = !{i32 2, !"Dwarf Version", i32 4}
!1597 = !{i32 2, !"Debug Info Version", i32 3}
!1598 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1599 = distinct !DISubprogram(name: "av1_parser_init", scope: !921, file: !921, line: 177, type: !933, isLocal: true, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1600)
!1600 = !{}
!1601 = !DILocalVariable(name: "ctx", arg: 1, scope: !1599, file: !921, line: 177, type: !935)
!1602 = !DIExpression()
!1603 = !DILocation(line: 177, column: 72, scope: !1599)
!1604 = !DILocalVariable(name: "s", scope: !1599, file: !921, line: 179, type: !1605)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1ParseContext", file: !921, line: 32, baseType: !1607)
!1607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1ParseContext", file: !921, line: 28, size: 512, align: 64, elements: !1608)
!1608 = !{!1609, !1624, !1645}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "cbc", scope: !1607, file: !921, line: 29, baseType: !1610, size: 64, align: 64)
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64, align: 64)
!1611 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamContext", file: !915, line: 204, baseType: !1612)
!1612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamContext", file: !915, line: 159, size: 384, align: 64, elements: !1613)
!1613 = !{!1614, !1615, !1619, !1620, !1621, !1622, !1623}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !1612, file: !915, line: 164, baseType: !912, size: 64, align: 64)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1612, file: !915, line: 169, baseType: !1616, size: 64, align: 64, offset: 64)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1618)
!1618 = !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamType", file: !915, line: 43, flags: DIFlagFwdDecl)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1612, file: !915, line: 180, baseType: !912, size: 64, align: 64, offset: 128)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "decompose_unit_types", scope: !1612, file: !915, line: 188, baseType: !913, size: 64, align: 64, offset: 192)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "nb_decompose_unit_types", scope: !1612, file: !915, line: 192, baseType: !927, size: 32, align: 32, offset: 256)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "trace_enable", scope: !1612, file: !915, line: 197, baseType: !927, size: 32, align: 32, offset: 288)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !1612, file: !915, line: 203, baseType: !927, size: 32, align: 32, offset: 320)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_unit", scope: !1607, file: !921, line: 30, baseType: !1625, size: 384, align: 64, offset: 64)
!1625 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamFragment", file: !915, line: 154, baseType: !1626)
!1626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamFragment", file: !915, line: 116, size: 384, align: 64, elements: !1627)
!1627 = !{!1628, !1629, !1630, !1631, !1632, !1633}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1626, file: !915, line: 122, baseType: !1108, size: 64, align: 64)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !1626, file: !915, line: 129, baseType: !1264, size: 64, align: 64, offset: 64)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_padding", scope: !1626, file: !915, line: 133, baseType: !1264, size: 64, align: 64, offset: 128)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "data_ref", scope: !1626, file: !915, line: 139, baseType: !1159, size: 64, align: 64, offset: 192)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "nb_units", scope: !1626, file: !915, line: 147, baseType: !927, size: 32, align: 32, offset: 256)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1626, file: !915, line: 153, baseType: !1634, size: 64, align: 64, offset: 320)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamUnit", file: !915, line: 107, baseType: !1636)
!1636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamUnit", file: !915, line: 64, size: 448, align: 64, elements: !1637)
!1637 = !{!1638, !1639, !1640, !1641, !1642, !1643, !1644}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1636, file: !915, line: 68, baseType: !914, size: 32, align: 32)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1636, file: !915, line: 75, baseType: !1108, size: 64, align: 64, offset: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !1636, file: !915, line: 80, baseType: !1264, size: 64, align: 64, offset: 128)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_padding", scope: !1636, file: !915, line: 86, baseType: !1264, size: 64, align: 64, offset: 192)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "data_ref", scope: !1636, file: !915, line: 92, baseType: !1159, size: 64, align: 64, offset: 256)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "content", scope: !1636, file: !915, line: 101, baseType: !912, size: 64, align: 64, offset: 320)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "content_ref", scope: !1636, file: !915, line: 106, baseType: !1159, size: 64, align: 64, offset: 384)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "parsed_extradata", scope: !1607, file: !921, line: 31, baseType: !927, size: 32, align: 32, offset: 448)
!1646 = !DILocation(line: 179, column: 22, scope: !1599)
!1647 = !DILocation(line: 179, column: 26, scope: !1599)
!1648 = !DILocation(line: 179, column: 31, scope: !1599)
!1649 = !DILocalVariable(name: "ret", scope: !1599, file: !921, line: 180, type: !927)
!1650 = !DILocation(line: 180, column: 9, scope: !1599)
!1651 = !DILocation(line: 182, column: 24, scope: !1599)
!1652 = !DILocation(line: 182, column: 27, scope: !1599)
!1653 = !DILocation(line: 182, column: 11, scope: !1599)
!1654 = !DILocation(line: 182, column: 9, scope: !1599)
!1655 = !DILocation(line: 183, column: 9, scope: !1656)
!1656 = distinct !DILexicalBlock(scope: !1599, file: !921, line: 183, column: 9)
!1657 = !DILocation(line: 183, column: 13, scope: !1656)
!1658 = !DILocation(line: 183, column: 9, scope: !1599)
!1659 = !DILocation(line: 184, column: 16, scope: !1656)
!1660 = !DILocation(line: 184, column: 9, scope: !1656)
!1661 = !DILocation(line: 186, column: 5, scope: !1599)
!1662 = !DILocation(line: 186, column: 8, scope: !1599)
!1663 = !DILocation(line: 186, column: 13, scope: !1599)
!1664 = !DILocation(line: 186, column: 34, scope: !1599)
!1665 = !DILocation(line: 187, column: 5, scope: !1599)
!1666 = !DILocation(line: 187, column: 8, scope: !1599)
!1667 = !DILocation(line: 187, column: 13, scope: !1599)
!1668 = !DILocation(line: 187, column: 37, scope: !1599)
!1669 = !DILocation(line: 189, column: 5, scope: !1599)
!1670 = !DILocation(line: 190, column: 1, scope: !1599)
!1671 = distinct !DISubprogram(name: "av1_parser_parse", scope: !921, file: !921, line: 47, type: !983, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1600)
!1672 = !DILocalVariable(name: "ctx", arg: 1, scope: !1671, file: !921, line: 47, type: !935)
!1673 = !DILocation(line: 47, column: 51, scope: !1671)
!1674 = !DILocalVariable(name: "avctx", arg: 2, scope: !1671, file: !921, line: 48, type: !985)
!1675 = !DILocation(line: 48, column: 45, scope: !1671)
!1676 = !DILocalVariable(name: "out_data", arg: 3, scope: !1671, file: !921, line: 49, type: !1577)
!1677 = !DILocation(line: 49, column: 45, scope: !1671)
!1678 = !DILocalVariable(name: "out_size", arg: 4, scope: !1671, file: !921, line: 49, type: !1270)
!1679 = !DILocation(line: 49, column: 60, scope: !1671)
!1680 = !DILocalVariable(name: "data", arg: 5, scope: !1671, file: !921, line: 50, type: !1473)
!1681 = !DILocation(line: 50, column: 44, scope: !1671)
!1682 = !DILocalVariable(name: "size", arg: 6, scope: !1671, file: !921, line: 50, type: !927)
!1683 = !DILocation(line: 50, column: 54, scope: !1671)
!1684 = !DILocalVariable(name: "s", scope: !1671, file: !921, line: 52, type: !1605)
!1685 = !DILocation(line: 52, column: 22, scope: !1671)
!1686 = !DILocation(line: 52, column: 26, scope: !1671)
!1687 = !DILocation(line: 52, column: 31, scope: !1671)
!1688 = !DILocalVariable(name: "td", scope: !1671, file: !921, line: 53, type: !1689)
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1690 = !DILocation(line: 53, column: 29, scope: !1671)
!1691 = !DILocation(line: 53, column: 35, scope: !1671)
!1692 = !DILocation(line: 53, column: 38, scope: !1671)
!1693 = !DILocalVariable(name: "av1", scope: !1671, file: !921, line: 54, type: !1694)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64, align: 64)
!1695 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamAV1Context", file: !1696, line: 429, baseType: !1697)
!1696 = !DIFile(filename: "libavcodec/cbs_av1.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamAV1Context", file: !1696, line: 398, size: 4032, align: 64, elements: !1698)
!1698 = !{!1699, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1819, !1820}
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "sequence_header", scope: !1697, file: !1696, line: 399, baseType: !1700, size: 64, align: 64)
!1700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1701, size: 64, align: 64)
!1701 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1RawSequenceHeader", file: !1696, line: 131, baseType: !1702)
!1702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1RawSequenceHeader", file: !1696, line: 73, size: 4704, align: 32, elements: !1703)
