; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mpegvideoencdsp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mpegvideoencdsp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MpegvideoEncDSPContext = type { i32 (i16*, i16*, i16*, i32)*, void (i16*, i16*, i32)*, i32 (i8*, i32)*, i32 (i8*, i32)*, [4 x void (i8*, i32, i8*, i32, i32, i32)*], void (i8*, i32, i32, i32, i32, i32, i32)* }

!829 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !495, line: 493, size: 32, align: 32, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847}
!831 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!832 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!833 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!834 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!835 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!836 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!837 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!838 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!839 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!840 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!841 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!842 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!843 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!844 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!845 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!846 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!847 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!848 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !495, line: 538, size: 32, align: 32, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857}
!850 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!851 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!852 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!853 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!854 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!855 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!856 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!857 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !35, line: 1534, size: 32, align: 32, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865}
!860 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!861 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!862 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!863 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!864 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!865 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !35, line: 810, size: 32, align: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !{!888}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64, align: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !890, line: 55, baseType: !891)
!890 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!891 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!892 = !{i32 2, !"Dwarf Version", i32 4}
!893 = !{i32 2, !"Debug Info Version", i32 3}
!894 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!895 = distinct !DISubprogram(name: "ff_mpegvideoencdsp_init", scope: !896, file: !896, line: 232, type: !897, isLocal: false, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1527)
!896 = !DIFile(filename: "libavcodec/mpegvideoencdsp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!897 = !DISubroutineType(types: !898)
!898 = !{null, !899, !937}
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64, align: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "MpegvideoEncDSPContext", file: !901, line: 45, baseType: !902)
!901 = !DIFile(filename: "libavcodec/mpegvideoencdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegvideoEncDSPContext", file: !901, line: 32, size: 576, align: 64, elements: !903)
!903 = !{!904, !912, !916, !923, !924, !933}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "try_8x8basis", scope: !902, file: !901, line: 33, baseType: !905, size: 64, align: 64)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64, align: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!908, !909, !909, !909, !908}
!908 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !890, line: 37, baseType: !911)
!911 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "add_8x8basis", scope: !902, file: !901, line: 35, baseType: !913, size: 64, align: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64, align: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !909, !909, !908}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "pix_sum", scope: !902, file: !901, line: 37, baseType: !917, size: 64, align: 64, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!908, !920, !908}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !890, line: 48, baseType: !922)
!922 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "pix_norm1", scope: !902, file: !901, line: 38, baseType: !917, size: 64, align: 64, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "shrink", scope: !902, file: !901, line: 40, baseType: !925, size: 256, align: 64, offset: 256)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 256, align: 64, elements: !931)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !920, !908, !929, !908, !908, !908}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!931 = !{!932}
!932 = !DISubrange(count: 4)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "draw_edges", scope: !902, file: !901, line: 43, baseType: !934, size: 64, align: 64, offset: 512)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{null, !920, !908, !908, !908, !908, !908, !908}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !940)
!940 = !{!941, !986, !987, !988, !1252, !1253, !1254, !1255, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1281, !1285, !1286, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1465, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !939, file: !35, line: 1561, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !946)
!946 = !{!947, !951, !956, !960, !961, !962, !963, !967, !973, !975, !979}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !945, file: !4, line: 72, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !945, file: !4, line: 78, baseType: !952, size: 64, align: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!948, !955}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !945, file: !4, line: 85, baseType: !957, size: 64, align: 64, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !945, file: !4, line: 93, baseType: !908, size: 32, align: 32, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !945, file: !4, line: 99, baseType: !908, size: 32, align: 32, offset: 224)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !945, file: !4, line: 108, baseType: !908, size: 32, align: 32, offset: 256)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !945, file: !4, line: 113, baseType: !964, size: 64, align: 64, offset: 320)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!955, !955, !955}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !945, file: !4, line: 123, baseType: !968, size: 64, align: 64, offset: 384)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!971, !971}
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !945, file: !4, line: 130, baseType: !974, size: 32, align: 32, offset: 448)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !945, file: !4, line: 136, baseType: !976, size: 64, align: 64, offset: 512)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!974, !955}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !945, file: !4, line: 142, baseType: !980, size: 64, align: 64, offset: 576)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!908, !983, !955, !948, !908}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !939, file: !35, line: 1562, baseType: !908, size: 32, align: 32, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !939, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !939, file: !35, line: 1565, baseType: !989, size: 64, align: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !992)
!992 = !{!993, !994, !995, !996, !997, !998, !1007, !1010, !1013, !1016, !1019, !1020, !1021, !1029, !1030, !1031, !1033, !1037, !1043, !1048, !1052, !1053, !1102, !1223, !1227, !1228, !1232, !1236, !1241, !1245, !1246, !1247}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !991, file: !35, line: 3475, baseType: !948, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !991, file: !35, line: 3480, baseType: !948, size: 64, align: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !991, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !991, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !991, file: !35, line: 3487, baseType: !908, size: 32, align: 32, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !991, file: !35, line: 3488, baseType: !999, size: 64, align: 64, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1002, line: 61, baseType: !1003)
!1002 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1002, line: 58, size: 64, align: 32, elements: !1004)
!1004 = !{!1005, !1006}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1003, file: !1002, line: 59, baseType: !908, size: 32, align: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1003, file: !1002, line: 60, baseType: !908, size: 32, align: 32, offset: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !991, file: !35, line: 3489, baseType: !1008, size: 64, align: 64, offset: 320)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !991, file: !35, line: 3490, baseType: !1011, size: 64, align: 64, offset: 384)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !991, file: !35, line: 3491, baseType: !1014, size: 64, align: 64, offset: 448)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !991, file: !35, line: 3492, baseType: !1017, size: 64, align: 64, offset: 512)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !889)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !991, file: !35, line: 3493, baseType: !921, size: 8, align: 8, offset: 576)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !991, file: !35, line: 3494, baseType: !942, size: 64, align: 64, offset: 640)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !991, file: !35, line: 3495, baseType: !1022, size: 64, align: 64, offset: 704)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1024)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1026)
!1026 = !{!1027, !1028}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1025, file: !35, line: 3402, baseType: !908, size: 32, align: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1025, file: !35, line: 3403, baseType: !948, size: 64, align: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !991, file: !35, line: 3507, baseType: !948, size: 64, align: 64, offset: 768)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !991, file: !35, line: 3516, baseType: !908, size: 32, align: 32, offset: 832)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !991, file: !35, line: 3517, baseType: !1032, size: 64, align: 64, offset: 896)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !991, file: !35, line: 3527, baseType: !1034, size: 64, align: 64, offset: 960)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!908, !937}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !991, file: !35, line: 3535, baseType: !1038, size: 64, align: 64, offset: 1024)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!908, !937, !1041}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !991, file: !35, line: 3541, baseType: !1044, size: 64, align: 64, offset: 1088)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1047)
!1047 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !991, file: !35, line: 3549, baseType: !1049, size: 64, align: 64, offset: 1152)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{null, !1032}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !991, file: !35, line: 3551, baseType: !1034, size: 64, align: 64, offset: 1216)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !991, file: !35, line: 3552, baseType: !1054, size: 64, align: 64, offset: 1280)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!908, !937, !920, !908, !1057}
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1060)
!1060 = !{!1061, !1064, !1067, !1068, !1069, !1099}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1059, file: !35, line: 3921, baseType: !1062, size: 16, align: 16)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !890, line: 49, baseType: !1063)
!1063 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1059, file: !35, line: 3922, baseType: !1065, size: 32, align: 32, offset: 32)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !890, line: 51, baseType: !1066)
!1066 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1059, file: !35, line: 3923, baseType: !1065, size: 32, align: 32, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1059, file: !35, line: 3924, baseType: !1066, size: 32, align: 32, offset: 96)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1059, file: !35, line: 3925, baseType: !1070, size: 64, align: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1079, !1080, !1090, !1092, !1094, !1095, !1097, !1098}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1073, file: !35, line: 3886, baseType: !908, size: 32, align: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1073, file: !35, line: 3887, baseType: !908, size: 32, align: 32, offset: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1073, file: !35, line: 3888, baseType: !908, size: 32, align: 32, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1073, file: !35, line: 3889, baseType: !908, size: 32, align: 32, offset: 96)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1073, file: !35, line: 3890, baseType: !908, size: 32, align: 32, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1073, file: !35, line: 3897, baseType: !1081, size: 768, align: 64, offset: 192)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1083)
!1083 = !{!1084, !1088}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1082, file: !35, line: 3855, baseType: !1085, size: 512, align: 64)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 512, align: 64, elements: !1086)
!1086 = !{!1087}
!1087 = !DISubrange(count: 8)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1082, file: !35, line: 3857, baseType: !1089, size: 256, align: 32, offset: 512)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 256, align: 32, elements: !1086)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1073, file: !35, line: 3903, baseType: !1091, size: 256, align: 64, offset: 960)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 256, align: 64, elements: !931)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1073, file: !35, line: 3904, baseType: !1093, size: 128, align: 32, offset: 1216)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 128, align: 32, elements: !931)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1073, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1073, file: !35, line: 3908, baseType: !1096, size: 64, align: 64, offset: 1408)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1073, file: !35, line: 3915, baseType: !1096, size: 64, align: 64, offset: 1472)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1073, file: !35, line: 3917, baseType: !908, size: 32, align: 32, offset: 1536)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1059, file: !35, line: 3926, baseType: !1100, size: 64, align: 64, offset: 192)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !890, line: 40, baseType: !1101)
!1101 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !991, file: !35, line: 3564, baseType: !1103, size: 64, align: 64, offset: 1344)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!908, !937, !1106, !1140, !1222}
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1109)
!1109 = !{!1110, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1136, !1137, !1138, !1139}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1108, file: !35, line: 1451, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1113, line: 94, baseType: !1114)
!1113 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1113, line: 81, size: 192, align: 64, elements: !1115)
!1115 = !{!1116, !1120, !1121}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1114, file: !1113, line: 82, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1113, line: 73, baseType: !1119)
!1119 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1113, line: 73, flags: DIFlagFwdDecl)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1114, file: !1113, line: 89, baseType: !920, size: 64, align: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1114, file: !1113, line: 93, baseType: !908, size: 32, align: 32, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1108, file: !35, line: 1461, baseType: !1100, size: 64, align: 64, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1108, file: !35, line: 1467, baseType: !1100, size: 64, align: 64, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1108, file: !35, line: 1468, baseType: !920, size: 64, align: 64, offset: 192)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1108, file: !35, line: 1469, baseType: !908, size: 32, align: 32, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1108, file: !35, line: 1470, baseType: !908, size: 32, align: 32, offset: 288)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1108, file: !35, line: 1474, baseType: !908, size: 32, align: 32, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1108, file: !35, line: 1479, baseType: !1129, size: 64, align: 64, offset: 384)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1131)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1132)
!1132 = !{!1133, !1134, !1135}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1131, file: !35, line: 1412, baseType: !920, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1131, file: !35, line: 1413, baseType: !908, size: 32, align: 32, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1131, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1108, file: !35, line: 1480, baseType: !908, size: 32, align: 32, offset: 448)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1108, file: !35, line: 1486, baseType: !1100, size: 64, align: 64, offset: 512)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1108, file: !35, line: 1488, baseType: !1100, size: 64, align: 64, offset: 576)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1108, file: !35, line: 1497, baseType: !1100, size: 64, align: 64, offset: 640)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1142)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1143)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1144)
!1144 = !{!1145, !1146, !1147, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1174, !1176, !1177, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1210, !1211, !1212, !1213, !1214, !1215, !1218, !1219, !1220, !1221}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1143, file: !758, line: 282, baseType: !1085, size: 512, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1143, file: !758, line: 299, baseType: !1089, size: 256, align: 32, offset: 512)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1143, file: !758, line: 315, baseType: !1148, size: 64, align: 64, offset: 768)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1143, file: !758, line: 326, baseType: !908, size: 32, align: 32, offset: 832)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1143, file: !758, line: 326, baseType: !908, size: 32, align: 32, offset: 864)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1143, file: !758, line: 334, baseType: !908, size: 32, align: 32, offset: 896)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1143, file: !758, line: 341, baseType: !908, size: 32, align: 32, offset: 928)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1143, file: !758, line: 346, baseType: !908, size: 32, align: 32, offset: 960)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1143, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1143, file: !758, line: 356, baseType: !1001, size: 64, align: 32, offset: 1024)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1143, file: !758, line: 361, baseType: !1100, size: 64, align: 64, offset: 1088)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1143, file: !758, line: 369, baseType: !1100, size: 64, align: 64, offset: 1152)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1143, file: !758, line: 377, baseType: !1100, size: 64, align: 64, offset: 1216)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1143, file: !758, line: 382, baseType: !908, size: 32, align: 32, offset: 1280)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1143, file: !758, line: 386, baseType: !908, size: 32, align: 32, offset: 1312)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1143, file: !758, line: 391, baseType: !908, size: 32, align: 32, offset: 1344)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1143, file: !758, line: 396, baseType: !955, size: 64, align: 64, offset: 1408)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1143, file: !758, line: 403, baseType: !1164, size: 512, align: 64, offset: 1472)
!1164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 512, align: 64, elements: !1086)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1143, file: !758, line: 410, baseType: !908, size: 32, align: 32, offset: 1984)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1143, file: !758, line: 415, baseType: !908, size: 32, align: 32, offset: 2016)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1143, file: !758, line: 420, baseType: !908, size: 32, align: 32, offset: 2048)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1143, file: !758, line: 425, baseType: !908, size: 32, align: 32, offset: 2080)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1143, file: !758, line: 435, baseType: !1100, size: 64, align: 64, offset: 2112)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1143, file: !758, line: 440, baseType: !908, size: 32, align: 32, offset: 2176)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1143, file: !758, line: 445, baseType: !889, size: 64, align: 64, offset: 2240)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1143, file: !758, line: 459, baseType: !1173, size: 512, align: 64, offset: 2304)
!1173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1111, size: 512, align: 64, elements: !1086)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1143, file: !758, line: 473, baseType: !1175, size: 64, align: 64, offset: 2816)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1143, file: !758, line: 477, baseType: !908, size: 32, align: 32, offset: 2880)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1143, file: !758, line: 479, baseType: !1178, size: 64, align: 64, offset: 2944)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1182)
!1182 = !{!1183, !1184, !1185, !1186, !1191}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1181, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1181, file: !758, line: 203, baseType: !920, size: 64, align: 64, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1181, file: !758, line: 204, baseType: !908, size: 32, align: 32, offset: 128)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1181, file: !758, line: 205, baseType: !1187, size: 64, align: 64, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1189, line: 86, baseType: !1190)
!1189 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1190 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1189, line: 86, flags: DIFlagFwdDecl)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1181, file: !758, line: 206, baseType: !1111, size: 64, align: 64, offset: 256)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1143, file: !758, line: 480, baseType: !908, size: 32, align: 32, offset: 3008)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1143, file: !758, line: 505, baseType: !908, size: 32, align: 32, offset: 3040)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1143, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1143, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1143, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1143, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1143, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1143, file: !758, line: 532, baseType: !1100, size: 64, align: 64, offset: 3264)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1143, file: !758, line: 539, baseType: !1100, size: 64, align: 64, offset: 3328)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1143, file: !758, line: 547, baseType: !1100, size: 64, align: 64, offset: 3392)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1143, file: !758, line: 554, baseType: !1187, size: 64, align: 64, offset: 3456)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1143, file: !758, line: 563, baseType: !908, size: 32, align: 32, offset: 3520)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1143, file: !758, line: 572, baseType: !908, size: 32, align: 32, offset: 3552)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1143, file: !758, line: 581, baseType: !908, size: 32, align: 32, offset: 3584)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1143, file: !758, line: 588, baseType: !1207, size: 64, align: 64, offset: 3648)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !890, line: 36, baseType: !1209)
!1209 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1143, file: !758, line: 593, baseType: !908, size: 32, align: 32, offset: 3712)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1143, file: !758, line: 596, baseType: !908, size: 32, align: 32, offset: 3744)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1143, file: !758, line: 599, baseType: !1111, size: 64, align: 64, offset: 3776)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1143, file: !758, line: 605, baseType: !1111, size: 64, align: 64, offset: 3840)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1143, file: !758, line: 616, baseType: !1111, size: 64, align: 64, offset: 3904)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1143, file: !758, line: 626, baseType: !1216, size: 64, align: 64, offset: 3968)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1217, line: 216, baseType: !891)
!1217 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1143, file: !758, line: 627, baseType: !1216, size: 64, align: 64, offset: 4032)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1143, file: !758, line: 628, baseType: !1216, size: 64, align: 64, offset: 4096)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1143, file: !758, line: 629, baseType: !1216, size: 64, align: 64, offset: 4160)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1143, file: !758, line: 645, baseType: !1111, size: 64, align: 64, offset: 4224)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !991, file: !35, line: 3566, baseType: !1224, size: 64, align: 64, offset: 1408)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!908, !937, !955, !1222, !1106}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !991, file: !35, line: 3567, baseType: !1034, size: 64, align: 64, offset: 1472)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !991, file: !35, line: 3576, baseType: !1229, size: 64, align: 64, offset: 1536)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!908, !937, !1140}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !991, file: !35, line: 3577, baseType: !1233, size: 64, align: 64, offset: 1600)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!908, !937, !1106}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !991, file: !35, line: 3584, baseType: !1237, size: 64, align: 64, offset: 1664)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{!908, !937, !1240}
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !991, file: !35, line: 3589, baseType: !1242, size: 64, align: 64, offset: 1728)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{null, !937}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !991, file: !35, line: 3594, baseType: !908, size: 32, align: 32, offset: 1792)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !991, file: !35, line: 3600, baseType: !948, size: 64, align: 64, offset: 1856)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !991, file: !35, line: 3609, baseType: !1248, size: 64, align: 64, offset: 1920)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1251)
!1251 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !939, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !939, file: !35, line: 1581, baseType: !1066, size: 32, align: 32, offset: 224)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !939, file: !35, line: 1583, baseType: !955, size: 64, align: 64, offset: 256)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !939, file: !35, line: 1591, baseType: !1256, size: 64, align: 64, offset: 320)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !939, file: !35, line: 1598, baseType: !955, size: 64, align: 64, offset: 384)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !939, file: !35, line: 1606, baseType: !1100, size: 64, align: 64, offset: 448)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !939, file: !35, line: 1614, baseType: !908, size: 32, align: 32, offset: 512)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !939, file: !35, line: 1622, baseType: !908, size: 32, align: 32, offset: 544)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !939, file: !35, line: 1628, baseType: !908, size: 32, align: 32, offset: 576)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !939, file: !35, line: 1636, baseType: !908, size: 32, align: 32, offset: 608)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !939, file: !35, line: 1643, baseType: !908, size: 32, align: 32, offset: 640)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !939, file: !35, line: 1657, baseType: !920, size: 64, align: 64, offset: 704)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !939, file: !35, line: 1658, baseType: !908, size: 32, align: 32, offset: 768)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !939, file: !35, line: 1679, baseType: !1001, size: 64, align: 32, offset: 800)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !939, file: !35, line: 1688, baseType: !908, size: 32, align: 32, offset: 864)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !939, file: !35, line: 1712, baseType: !908, size: 32, align: 32, offset: 896)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !939, file: !35, line: 1729, baseType: !908, size: 32, align: 32, offset: 928)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !939, file: !35, line: 1729, baseType: !908, size: 32, align: 32, offset: 960)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !939, file: !35, line: 1744, baseType: !908, size: 32, align: 32, offset: 992)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !939, file: !35, line: 1744, baseType: !908, size: 32, align: 32, offset: 1024)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !939, file: !35, line: 1751, baseType: !908, size: 32, align: 32, offset: 1056)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !939, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !939, file: !35, line: 1791, baseType: !1277, size: 64, align: 64, offset: 1152)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{null, !1280, !1140, !1222, !908, !908, !908}
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !939, file: !35, line: 1808, baseType: !1282, size: 64, align: 64, offset: 1216)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!494, !1280, !1008}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !939, file: !35, line: 1816, baseType: !908, size: 32, align: 32, offset: 1280)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !939, file: !35, line: 1825, baseType: !1287, size: 32, align: 32, offset: 1312)
!1287 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !939, file: !35, line: 1830, baseType: !908, size: 32, align: 32, offset: 1344)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !939, file: !35, line: 1838, baseType: !1287, size: 32, align: 32, offset: 1376)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !939, file: !35, line: 1846, baseType: !908, size: 32, align: 32, offset: 1408)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !939, file: !35, line: 1851, baseType: !908, size: 32, align: 32, offset: 1440)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !939, file: !35, line: 1861, baseType: !1287, size: 32, align: 32, offset: 1472)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !939, file: !35, line: 1868, baseType: !1287, size: 32, align: 32, offset: 1504)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !939, file: !35, line: 1875, baseType: !1287, size: 32, align: 32, offset: 1536)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !939, file: !35, line: 1882, baseType: !1287, size: 32, align: 32, offset: 1568)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !939, file: !35, line: 1889, baseType: !1287, size: 32, align: 32, offset: 1600)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !939, file: !35, line: 1896, baseType: !1287, size: 32, align: 32, offset: 1632)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !939, file: !35, line: 1903, baseType: !1287, size: 32, align: 32, offset: 1664)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !939, file: !35, line: 1910, baseType: !908, size: 32, align: 32, offset: 1696)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !939, file: !35, line: 1915, baseType: !908, size: 32, align: 32, offset: 1728)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !939, file: !35, line: 1926, baseType: !1222, size: 64, align: 64, offset: 1792)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !939, file: !35, line: 1935, baseType: !1001, size: 64, align: 32, offset: 1856)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !939, file: !35, line: 1942, baseType: !908, size: 32, align: 32, offset: 1920)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !939, file: !35, line: 1948, baseType: !908, size: 32, align: 32, offset: 1952)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !939, file: !35, line: 1954, baseType: !908, size: 32, align: 32, offset: 1984)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !939, file: !35, line: 1960, baseType: !908, size: 32, align: 32, offset: 2016)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !939, file: !35, line: 1984, baseType: !908, size: 32, align: 32, offset: 2048)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !939, file: !35, line: 1991, baseType: !908, size: 32, align: 32, offset: 2080)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !939, file: !35, line: 1996, baseType: !908, size: 32, align: 32, offset: 2112)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !939, file: !35, line: 2004, baseType: !908, size: 32, align: 32, offset: 2144)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !939, file: !35, line: 2011, baseType: !908, size: 32, align: 32, offset: 2176)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !939, file: !35, line: 2018, baseType: !908, size: 32, align: 32, offset: 2208)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !939, file: !35, line: 2027, baseType: !908, size: 32, align: 32, offset: 2240)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !939, file: !35, line: 2034, baseType: !908, size: 32, align: 32, offset: 2272)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !939, file: !35, line: 2044, baseType: !908, size: 32, align: 32, offset: 2304)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !939, file: !35, line: 2054, baseType: !1317, size: 64, align: 64, offset: 2368)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !939, file: !35, line: 2061, baseType: !1317, size: 64, align: 64, offset: 2432)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !939, file: !35, line: 2066, baseType: !908, size: 32, align: 32, offset: 2496)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !939, file: !35, line: 2070, baseType: !908, size: 32, align: 32, offset: 2528)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !939, file: !35, line: 2078, baseType: !908, size: 32, align: 32, offset: 2560)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !939, file: !35, line: 2085, baseType: !908, size: 32, align: 32, offset: 2592)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !939, file: !35, line: 2092, baseType: !908, size: 32, align: 32, offset: 2624)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !939, file: !35, line: 2099, baseType: !908, size: 32, align: 32, offset: 2656)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !939, file: !35, line: 2106, baseType: !908, size: 32, align: 32, offset: 2688)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !939, file: !35, line: 2113, baseType: !908, size: 32, align: 32, offset: 2720)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !939, file: !35, line: 2120, baseType: !908, size: 32, align: 32, offset: 2752)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !939, file: !35, line: 2125, baseType: !908, size: 32, align: 32, offset: 2784)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !939, file: !35, line: 2133, baseType: !908, size: 32, align: 32, offset: 2816)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !939, file: !35, line: 2140, baseType: !908, size: 32, align: 32, offset: 2848)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !939, file: !35, line: 2145, baseType: !908, size: 32, align: 32, offset: 2880)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !939, file: !35, line: 2153, baseType: !908, size: 32, align: 32, offset: 2912)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !939, file: !35, line: 2158, baseType: !908, size: 32, align: 32, offset: 2944)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !939, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !939, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !939, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !939, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !939, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !939, file: !35, line: 2203, baseType: !908, size: 32, align: 32, offset: 3136)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !939, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !939, file: !35, line: 2212, baseType: !908, size: 32, align: 32, offset: 3200)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !939, file: !35, line: 2213, baseType: !908, size: 32, align: 32, offset: 3232)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !939, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !939, file: !35, line: 2232, baseType: !908, size: 32, align: 32, offset: 3296)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !939, file: !35, line: 2243, baseType: !908, size: 32, align: 32, offset: 3328)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !939, file: !35, line: 2249, baseType: !908, size: 32, align: 32, offset: 3360)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !939, file: !35, line: 2256, baseType: !908, size: 32, align: 32, offset: 3392)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !939, file: !35, line: 2263, baseType: !889, size: 64, align: 64, offset: 3456)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !939, file: !35, line: 2270, baseType: !889, size: 64, align: 64, offset: 3520)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !939, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !939, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !939, file: !35, line: 2367, baseType: !1353, size: 64, align: 64, offset: 3648)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DISubroutineType(types: !1355)
!1355 = !{!908, !1280, !1240, !908}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !939, file: !35, line: 2383, baseType: !908, size: 32, align: 32, offset: 3712)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !939, file: !35, line: 2386, baseType: !1287, size: 32, align: 32, offset: 3744)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !939, file: !35, line: 2387, baseType: !1287, size: 32, align: 32, offset: 3776)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !939, file: !35, line: 2394, baseType: !908, size: 32, align: 32, offset: 3808)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !939, file: !35, line: 2401, baseType: !908, size: 32, align: 32, offset: 3840)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !939, file: !35, line: 2408, baseType: !908, size: 32, align: 32, offset: 3872)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !939, file: !35, line: 2415, baseType: !908, size: 32, align: 32, offset: 3904)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !939, file: !35, line: 2422, baseType: !908, size: 32, align: 32, offset: 3936)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !939, file: !35, line: 2423, baseType: !1365, size: 64, align: 64, offset: 3968)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1367)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1368)
!1368 = !{!1369, !1370, !1371, !1372}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1367, file: !35, line: 827, baseType: !908, size: 32, align: 32)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1367, file: !35, line: 828, baseType: !908, size: 32, align: 32, offset: 32)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1367, file: !35, line: 829, baseType: !908, size: 32, align: 32, offset: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1367, file: !35, line: 830, baseType: !1287, size: 32, align: 32, offset: 96)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !939, file: !35, line: 2430, baseType: !1100, size: 64, align: 64, offset: 4032)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !939, file: !35, line: 2437, baseType: !1100, size: 64, align: 64, offset: 4096)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !939, file: !35, line: 2444, baseType: !1287, size: 32, align: 32, offset: 4160)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !939, file: !35, line: 2451, baseType: !1287, size: 32, align: 32, offset: 4192)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !939, file: !35, line: 2458, baseType: !908, size: 32, align: 32, offset: 4224)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !939, file: !35, line: 2469, baseType: !908, size: 32, align: 32, offset: 4256)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !939, file: !35, line: 2475, baseType: !908, size: 32, align: 32, offset: 4288)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !939, file: !35, line: 2481, baseType: !908, size: 32, align: 32, offset: 4320)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !939, file: !35, line: 2485, baseType: !908, size: 32, align: 32, offset: 4352)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !939, file: !35, line: 2489, baseType: !908, size: 32, align: 32, offset: 4384)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !939, file: !35, line: 2493, baseType: !908, size: 32, align: 32, offset: 4416)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !939, file: !35, line: 2501, baseType: !908, size: 32, align: 32, offset: 4448)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !939, file: !35, line: 2506, baseType: !908, size: 32, align: 32, offset: 4480)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !939, file: !35, line: 2510, baseType: !908, size: 32, align: 32, offset: 4512)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !939, file: !35, line: 2514, baseType: !1100, size: 64, align: 64, offset: 4544)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !939, file: !35, line: 2528, baseType: !1389, size: 64, align: 64, offset: 4608)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DISubroutineType(types: !1391)
!1391 = !{null, !1280, !955, !908, !908}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !939, file: !35, line: 2534, baseType: !908, size: 32, align: 32, offset: 4672)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !939, file: !35, line: 2545, baseType: !908, size: 32, align: 32, offset: 4704)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !939, file: !35, line: 2547, baseType: !908, size: 32, align: 32, offset: 4736)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !939, file: !35, line: 2549, baseType: !908, size: 32, align: 32, offset: 4768)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !939, file: !35, line: 2551, baseType: !908, size: 32, align: 32, offset: 4800)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !939, file: !35, line: 2553, baseType: !908, size: 32, align: 32, offset: 4832)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !939, file: !35, line: 2555, baseType: !908, size: 32, align: 32, offset: 4864)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !939, file: !35, line: 2557, baseType: !908, size: 32, align: 32, offset: 4896)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !939, file: !35, line: 2559, baseType: !908, size: 32, align: 32, offset: 4928)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !939, file: !35, line: 2563, baseType: !908, size: 32, align: 32, offset: 4960)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !939, file: !35, line: 2571, baseType: !1096, size: 64, align: 64, offset: 4992)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !939, file: !35, line: 2579, baseType: !1096, size: 64, align: 64, offset: 5056)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !939, file: !35, line: 2586, baseType: !908, size: 32, align: 32, offset: 5120)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !939, file: !35, line: 2615, baseType: !908, size: 32, align: 32, offset: 5152)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !939, file: !35, line: 2627, baseType: !908, size: 32, align: 32, offset: 5184)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !939, file: !35, line: 2637, baseType: !908, size: 32, align: 32, offset: 5216)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !939, file: !35, line: 2681, baseType: !908, size: 32, align: 32, offset: 5248)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !939, file: !35, line: 2709, baseType: !1100, size: 64, align: 64, offset: 5312)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !939, file: !35, line: 2716, baseType: !1411, size: 64, align: 64, offset: 5376)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1413)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1414)
!1414 = !{!1415, !1416, !1417, !1418, !1419, !1420, !1421, !1425, !1429, !1430, !1431, !1432, !1438, !1439, !1440, !1441, !1442}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1413, file: !35, line: 3642, baseType: !948, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1413, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1413, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1413, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1413, file: !35, line: 3669, baseType: !908, size: 32, align: 32, offset: 160)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1413, file: !35, line: 3682, baseType: !1237, size: 64, align: 64, offset: 192)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1413, file: !35, line: 3698, baseType: !1422, size: 64, align: 64, offset: 256)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{!908, !937, !929, !1065}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1413, file: !35, line: 3712, baseType: !1426, size: 64, align: 64, offset: 320)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DISubroutineType(types: !1428)
!1428 = !{!908, !937, !908, !929, !1065}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1413, file: !35, line: 3726, baseType: !1422, size: 64, align: 64, offset: 384)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1413, file: !35, line: 3737, baseType: !1034, size: 64, align: 64, offset: 448)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1413, file: !35, line: 3746, baseType: !908, size: 32, align: 32, offset: 512)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1413, file: !35, line: 3757, baseType: !1433, size: 64, align: 64, offset: 576)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DISubroutineType(types: !1435)
!1435 = !{null, !1436}
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1413, file: !35, line: 3766, baseType: !1034, size: 64, align: 64, offset: 640)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1413, file: !35, line: 3774, baseType: !1034, size: 64, align: 64, offset: 704)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1413, file: !35, line: 3780, baseType: !908, size: 32, align: 32, offset: 768)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1413, file: !35, line: 3785, baseType: !908, size: 32, align: 32, offset: 800)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1413, file: !35, line: 3795, baseType: !1443, size: 64, align: 64, offset: 832)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DISubroutineType(types: !1445)
!1445 = !{!908, !937, !1111}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !939, file: !35, line: 2728, baseType: !955, size: 64, align: 64, offset: 5440)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !939, file: !35, line: 2735, baseType: !1164, size: 512, align: 64, offset: 5504)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !939, file: !35, line: 2742, baseType: !908, size: 32, align: 32, offset: 6016)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !939, file: !35, line: 2755, baseType: !908, size: 32, align: 32, offset: 6048)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !939, file: !35, line: 2776, baseType: !908, size: 32, align: 32, offset: 6080)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !939, file: !35, line: 2783, baseType: !908, size: 32, align: 32, offset: 6112)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !939, file: !35, line: 2791, baseType: !908, size: 32, align: 32, offset: 6144)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !939, file: !35, line: 2802, baseType: !1240, size: 64, align: 64, offset: 6208)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !939, file: !35, line: 2811, baseType: !908, size: 32, align: 32, offset: 6272)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !939, file: !35, line: 2821, baseType: !908, size: 32, align: 32, offset: 6304)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !939, file: !35, line: 2830, baseType: !908, size: 32, align: 32, offset: 6336)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !939, file: !35, line: 2840, baseType: !908, size: 32, align: 32, offset: 6368)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !939, file: !35, line: 2851, baseType: !1459, size: 64, align: 64, offset: 6400)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DISubroutineType(types: !1461)
!1461 = !{!908, !1280, !1462, !955, !1222, !908, !908}
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{!908, !1280, !955}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !939, file: !35, line: 2871, baseType: !1466, size: 64, align: 64, offset: 6464)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DISubroutineType(types: !1468)
!1468 = !{!908, !1280, !1469, !955, !1222, !908}
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DISubroutineType(types: !1471)
!1471 = !{!908, !1280, !955, !908, !908}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !939, file: !35, line: 2878, baseType: !908, size: 32, align: 32, offset: 6528)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !939, file: !35, line: 2885, baseType: !908, size: 32, align: 32, offset: 6560)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !939, file: !35, line: 3005, baseType: !908, size: 32, align: 32, offset: 6592)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !939, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !939, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !939, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !939, file: !35, line: 3037, baseType: !920, size: 64, align: 64, offset: 6720)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !939, file: !35, line: 3038, baseType: !908, size: 32, align: 32, offset: 6784)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !939, file: !35, line: 3050, baseType: !889, size: 64, align: 64, offset: 6848)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !939, file: !35, line: 3065, baseType: !908, size: 32, align: 32, offset: 6912)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !939, file: !35, line: 3083, baseType: !908, size: 32, align: 32, offset: 6944)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !939, file: !35, line: 3092, baseType: !1001, size: 64, align: 32, offset: 6976)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !939, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !939, file: !35, line: 3106, baseType: !1001, size: 64, align: 32, offset: 7072)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !939, file: !35, line: 3113, baseType: !1487, size: 64, align: 64, offset: 7168)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1489)
!1489 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1490)
!1490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1491)
!1491 = !{!1492, !1493, !1494, !1495, !1496, !1497, !1500}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1490, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1490, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1490, file: !35, line: 720, baseType: !948, size: 64, align: 64, offset: 64)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1490, file: !35, line: 724, baseType: !948, size: 64, align: 64, offset: 128)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1490, file: !35, line: 728, baseType: !908, size: 32, align: 32, offset: 192)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1490, file: !35, line: 734, baseType: !1498, size: 64, align: 64, offset: 256)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1490, file: !35, line: 739, baseType: !1501, size: 64, align: 64, offset: 320)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1025)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !939, file: !35, line: 3129, baseType: !1100, size: 64, align: 64, offset: 7232)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !939, file: !35, line: 3130, baseType: !1100, size: 64, align: 64, offset: 7296)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !939, file: !35, line: 3131, baseType: !1100, size: 64, align: 64, offset: 7360)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !939, file: !35, line: 3132, baseType: !1100, size: 64, align: 64, offset: 7424)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !939, file: !35, line: 3139, baseType: !1096, size: 64, align: 64, offset: 7488)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !939, file: !35, line: 3147, baseType: !908, size: 32, align: 32, offset: 7552)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !939, file: !35, line: 3165, baseType: !908, size: 32, align: 32, offset: 7584)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !939, file: !35, line: 3172, baseType: !908, size: 32, align: 32, offset: 7616)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !939, file: !35, line: 3180, baseType: !908, size: 32, align: 32, offset: 7648)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !939, file: !35, line: 3191, baseType: !1317, size: 64, align: 64, offset: 7680)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !939, file: !35, line: 3199, baseType: !920, size: 64, align: 64, offset: 7744)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !939, file: !35, line: 3207, baseType: !1096, size: 64, align: 64, offset: 7808)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !939, file: !35, line: 3214, baseType: !1066, size: 32, align: 32, offset: 7872)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !939, file: !35, line: 3224, baseType: !1129, size: 64, align: 64, offset: 7936)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !939, file: !35, line: 3225, baseType: !908, size: 32, align: 32, offset: 8000)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !939, file: !35, line: 3249, baseType: !1111, size: 64, align: 64, offset: 8064)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !939, file: !35, line: 3256, baseType: !908, size: 32, align: 32, offset: 8128)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !939, file: !35, line: 3271, baseType: !908, size: 32, align: 32, offset: 8160)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !939, file: !35, line: 3279, baseType: !1100, size: 64, align: 64, offset: 8192)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !939, file: !35, line: 3301, baseType: !1111, size: 64, align: 64, offset: 8256)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !939, file: !35, line: 3310, baseType: !908, size: 32, align: 32, offset: 8320)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !939, file: !35, line: 3337, baseType: !908, size: 32, align: 32, offset: 8352)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !939, file: !35, line: 3351, baseType: !908, size: 32, align: 32, offset: 8384)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !939, file: !35, line: 3359, baseType: !908, size: 32, align: 32, offset: 8416)
!1527 = !{}
!1528 = !DILocalVariable(name: "c", arg: 1, scope: !895, file: !896, line: 232, type: !899)
!1529 = !DIExpression()
!1530 = !DILocation(line: 232, column: 76, scope: !895)
!1531 = !DILocalVariable(name: "avctx", arg: 2, scope: !895, file: !896, line: 233, type: !937)
!1532 = !DILocation(line: 233, column: 54, scope: !895)
!1533 = !DILocation(line: 235, column: 5, scope: !895)
!1534 = !DILocation(line: 235, column: 8, scope: !895)
!1535 = !DILocation(line: 235, column: 21, scope: !895)
!1536 = !DILocation(line: 236, column: 5, scope: !895)
!1537 = !DILocation(line: 236, column: 8, scope: !895)
!1538 = !DILocation(line: 236, column: 21, scope: !895)
!1539 = !DILocation(line: 238, column: 5, scope: !895)
!1540 = !DILocation(line: 238, column: 8, scope: !895)
!1541 = !DILocation(line: 238, column: 18, scope: !895)
!1542 = !DILocation(line: 239, column: 5, scope: !895)
!1543 = !DILocation(line: 239, column: 8, scope: !895)
!1544 = !DILocation(line: 239, column: 18, scope: !895)
!1545 = !DILocation(line: 240, column: 5, scope: !895)
!1546 = !DILocation(line: 240, column: 8, scope: !895)
!1547 = !DILocation(line: 240, column: 18, scope: !895)
!1548 = !DILocation(line: 241, column: 5, scope: !895)
!1549 = !DILocation(line: 241, column: 8, scope: !895)
!1550 = !DILocation(line: 241, column: 18, scope: !895)
!1551 = !DILocation(line: 243, column: 5, scope: !895)
!1552 = !DILocation(line: 243, column: 8, scope: !895)
!1553 = !DILocation(line: 243, column: 16, scope: !895)
!1554 = !DILocation(line: 244, column: 5, scope: !895)
!1555 = !DILocation(line: 244, column: 8, scope: !895)
!1556 = !DILocation(line: 244, column: 18, scope: !895)
!1557 = !DILocation(line: 246, column: 5, scope: !895)
!1558 = !DILocation(line: 246, column: 8, scope: !895)
!1559 = !DILocation(line: 246, column: 19, scope: !895)
!1560 = !DILocation(line: 253, column: 37, scope: !1561)
!1561 = distinct !DILexicalBlock(scope: !895, file: !896, line: 252, column: 9)
!1562 = !DILocation(line: 253, column: 40, scope: !1561)
!1563 = !DILocation(line: 253, column: 9, scope: !1561)
!1564 = !DILocation(line: 256, column: 1, scope: !895)
!1565 = distinct !DISubprogram(name: "try_8x8basis_c", scope: !896, file: !896, line: 31, type: !906, isLocal: true, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1527)
!1566 = !DILocalVariable(name: "rem", arg: 1, scope: !1565, file: !896, line: 31, type: !909)
!1567 = !DILocation(line: 31, column: 35, scope: !1565)
!1568 = !DILocalVariable(name: "weight", arg: 2, scope: !1565, file: !896, line: 31, type: !909)
!1569 = !DILocation(line: 31, column: 52, scope: !1565)
!1570 = !DILocalVariable(name: "basis", arg: 3, scope: !1565, file: !896, line: 32, type: !909)
!1571 = !DILocation(line: 32, column: 35, scope: !1565)
!1572 = !DILocalVariable(name: "scale", arg: 4, scope: !1565, file: !896, line: 32, type: !908)
!1573 = !DILocation(line: 32, column: 50, scope: !1565)
!1574 = !DILocalVariable(name: "i", scope: !1565, file: !896, line: 34, type: !908)
!1575 = !DILocation(line: 34, column: 9, scope: !1565)
!1576 = !DILocalVariable(name: "sum", scope: !1565, file: !896, line: 35, type: !1066)
!1577 = !DILocation(line: 35, column: 18, scope: !1565)
!1578 = !DILocation(line: 37, column: 12, scope: !1579)
!1579 = distinct !DILexicalBlock(scope: !1565, file: !896, line: 37, column: 5)
!1580 = !DILocation(line: 37, column: 10, scope: !1579)
!1581 = !DILocation(line: 37, column: 17, scope: !1582)
!1582 = !DILexicalBlockFile(scope: !1583, file: !896, discriminator: 1)
!1583 = distinct !DILexicalBlock(scope: !1579, file: !896, line: 37, column: 5)
!1584 = !DILocation(line: 37, column: 19, scope: !1582)
!1585 = !DILocation(line: 37, column: 5, scope: !1582)
!1586 = !DILocalVariable(name: "b", scope: !1587, file: !896, line: 38, type: !908)
