; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--rtpenc_vc2hq.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--rtpenc_vc2hq.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFormatContext = type { %struct.AVClass*, %struct.AVInputFormat*, %struct.AVOutputFormat*, i8*, %struct.AVIOContext*, i32, i32, %struct.AVStream**, [1024 x i8], i8*, i64, i64, i64, i32, i32, i32, i64, i64, i8*, i32, i32, %struct.AVProgram**, i32, i32, i32, i32, i32, i32, %struct.AVChapter**, %struct.AVDictionary*, i64, i32, i32, %struct.AVIOInterruptCB, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i8*, i8*, %struct.AVFormatInternal*, i32, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, i32, i8*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i64, i8*, i32, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVIOInterruptCB*, %struct.AVDictionary**)*, i8*, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVDictionary**)*, void (%struct.AVFormatContext*, %struct.AVIOContext*)*, i8*, i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque

!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !25, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !926, !932, !935, !936, !925, !923}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !920, line: 221, size: 32, align: 8, elements: !921)
!920 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!921 = !{!922}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !919, file: !920, line: 221, baseType: !923, size: 32, align: 32)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !924, line: 51, baseType: !925)
!924 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!925 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !920, line: 222, size: 16, align: 8, elements: !928)
!928 = !{!929}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !927, file: !920, line: 222, baseType: !930, size: 16, align: 16)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !924, line: 49, baseType: !931)
!931 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !924, line: 48, baseType: !934)
!934 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!936 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!937 = !{i32 2, !"Dwarf Version", i32 4}
!938 = !{i32 2, !"Debug Info Version", i32 3}
!939 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!940 = distinct !DISubprogram(name: "ff_rtp_send_vc2hq", scope: !941, file: !941, line: 102, type: !942, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2067)
!941 = !DIFile(filename: "libavformat/rtpenc_vc2hq.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!942 = !DISubroutineType(types: !943)
!943 = !{null, !944, !1278, !936, !936}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !897, line: 1947, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !947)
!947 = !{!948, !993, !1099, !1247, !1248, !1313, !1314, !1315, !1944, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1998, !1999, !2000, !2001, !2002, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2033, !2034, !2037, !2038, !2039, !2040, !2041, !2042, !2044, !2045, !2046, !2047, !2055, !2056, !2060, !2064, !2065, !2066}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !946, file: !897, line: 1342, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !953)
!953 = !{!954, !958, !963, !967, !968, !969, !970, !974, !980, !982, !986}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !952, file: !4, line: 72, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !952, file: !4, line: 78, baseType: !959, size: 64, align: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!955, !962}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !952, file: !4, line: 85, baseType: !964, size: 64, align: 64, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !952, file: !4, line: 93, baseType: !936, size: 32, align: 32, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !952, file: !4, line: 99, baseType: !936, size: 32, align: 32, offset: 224)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !952, file: !4, line: 108, baseType: !936, size: 32, align: 32, offset: 256)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !952, file: !4, line: 113, baseType: !971, size: 64, align: 64, offset: 320)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!962, !962, !962}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !952, file: !4, line: 123, baseType: !975, size: 64, align: 64, offset: 384)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!978, !978}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !952, file: !4, line: 130, baseType: !981, size: 32, align: 32, offset: 448)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !952, file: !4, line: 136, baseType: !983, size: 64, align: 64, offset: 512)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!981, !962}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !952, file: !4, line: 142, baseType: !987, size: 64, align: 64, offset: 576)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!936, !990, !962, !955, !936}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !946, file: !897, line: 1349, baseType: !994, size: 64, align: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !996)
!996 = !{!997, !998, !999, !1000, !1001, !1007, !1008, !1009, !1010, !1011, !1012, !1025, !1030, !1070, !1071, !1075, !1080, !1081, !1082, !1086, !1092, !1098}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !995, file: !897, line: 638, baseType: !955, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !995, file: !897, line: 645, baseType: !955, size: 64, align: 64, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !995, file: !897, line: 652, baseType: !936, size: 32, align: 32, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !995, file: !897, line: 659, baseType: !955, size: 64, align: 64, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !995, file: !897, line: 661, baseType: !1002, size: 64, align: 64, offset: 256)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1006 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !897, line: 443, flags: DIFlagFwdDecl)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !995, file: !897, line: 663, baseType: !949, size: 64, align: 64, offset: 320)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !995, file: !897, line: 670, baseType: !955, size: 64, align: 64, offset: 384)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !995, file: !897, line: 679, baseType: !994, size: 64, align: 64, offset: 448)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !995, file: !897, line: 684, baseType: !936, size: 32, align: 32, offset: 512)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !995, file: !897, line: 689, baseType: !936, size: 32, align: 32, offset: 544)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !995, file: !897, line: 696, baseType: !1013, size: 64, align: 64, offset: 576)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!936, !1016}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1019)
!1019 = !{!1020, !1021, !1023, !1024}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1018, file: !897, line: 449, baseType: !955, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1018, file: !897, line: 450, baseType: !1022, size: 64, align: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1018, file: !897, line: 451, baseType: !936, size: 32, align: 32, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1018, file: !897, line: 452, baseType: !955, size: 64, align: 64, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !995, file: !897, line: 703, baseType: !1026, size: 64, align: 64, offset: 640)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!936, !1029}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !995, file: !897, line: 714, baseType: !1031, size: 64, align: 64, offset: 704)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!936, !1029, !1034}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !25, line: 1499, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !25, line: 1445, size: 704, align: 64, elements: !1037)
!1037 = !{!1038, !1050, !1053, !1054, !1055, !1056, !1057, !1058, !1066, !1067, !1068, !1069}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1036, file: !25, line: 1451, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1041, line: 94, baseType: !1042)
!1041 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1041, line: 81, size: 192, align: 64, elements: !1043)
!1043 = !{!1044, !1048, !1049}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1042, file: !1041, line: 82, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1041, line: 73, baseType: !1047)
!1047 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1041, line: 73, flags: DIFlagFwdDecl)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1042, file: !1041, line: 89, baseType: !932, size: 64, align: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1042, file: !1041, line: 93, baseType: !936, size: 32, align: 32, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1036, file: !25, line: 1461, baseType: !1051, size: 64, align: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !924, line: 40, baseType: !1052)
!1052 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1036, file: !25, line: 1467, baseType: !1051, size: 64, align: 64, offset: 128)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1036, file: !25, line: 1468, baseType: !932, size: 64, align: 64, offset: 192)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1036, file: !25, line: 1469, baseType: !936, size: 32, align: 32, offset: 256)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1036, file: !25, line: 1470, baseType: !936, size: 32, align: 32, offset: 288)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1036, file: !25, line: 1474, baseType: !936, size: 32, align: 32, offset: 320)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1036, file: !25, line: 1479, baseType: !1059, size: 64, align: 64, offset: 384)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !25, line: 1415, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !25, line: 1411, size: 128, align: 64, elements: !1062)
!1062 = !{!1063, !1064, !1065}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1061, file: !25, line: 1412, baseType: !932, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1061, file: !25, line: 1413, baseType: !936, size: 32, align: 32, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1061, file: !25, line: 1414, baseType: !24, size: 32, align: 32, offset: 96)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1036, file: !25, line: 1480, baseType: !936, size: 32, align: 32, offset: 448)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1036, file: !25, line: 1486, baseType: !1051, size: 64, align: 64, offset: 512)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1036, file: !25, line: 1488, baseType: !1051, size: 64, align: 64, offset: 576)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1036, file: !25, line: 1497, baseType: !1051, size: 64, align: 64, offset: 640)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !995, file: !897, line: 720, baseType: !1026, size: 64, align: 64, offset: 768)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !995, file: !897, line: 730, baseType: !1072, size: 64, align: 64, offset: 832)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!936, !1029, !936, !1051, !936}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !995, file: !897, line: 737, baseType: !1076, size: 64, align: 64, offset: 896)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!1051, !1029, !936, !1079, !1051}
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !995, file: !897, line: 744, baseType: !1026, size: 64, align: 64, offset: 960)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !995, file: !897, line: 750, baseType: !1026, size: 64, align: 64, offset: 1024)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !995, file: !897, line: 758, baseType: !1083, size: 64, align: 64, offset: 1088)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!936, !1029, !936, !1051, !1051, !1051, !936}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !995, file: !897, line: 764, baseType: !1087, size: 64, align: 64, offset: 1152)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!936, !1029, !1090}
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !995, file: !897, line: 770, baseType: !1093, size: 64, align: 64, offset: 1216)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!936, !1029, !1096}
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !995, file: !897, line: 776, baseType: !1093, size: 64, align: 64, offset: 1280)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !946, file: !897, line: 1356, baseType: !1100, size: 64, align: 64, offset: 128)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1102)
!1102 = !{!1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1122, !1126, !1130, !1137, !1232, !1233, !1234, !1235, !1236, !1237, !1241}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1101, file: !897, line: 498, baseType: !955, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1101, file: !897, line: 504, baseType: !955, size: 64, align: 64, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1101, file: !897, line: 505, baseType: !955, size: 64, align: 64, offset: 128)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1101, file: !897, line: 506, baseType: !955, size: 64, align: 64, offset: 192)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1101, file: !897, line: 508, baseType: !55, size: 32, align: 32, offset: 256)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1101, file: !897, line: 509, baseType: !55, size: 32, align: 32, offset: 288)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1101, file: !897, line: 510, baseType: !55, size: 32, align: 32, offset: 320)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1101, file: !897, line: 517, baseType: !936, size: 32, align: 32, offset: 352)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1101, file: !897, line: 523, baseType: !1002, size: 64, align: 64, offset: 384)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1101, file: !897, line: 526, baseType: !949, size: 64, align: 64, offset: 448)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1101, file: !897, line: 535, baseType: !1100, size: 64, align: 64, offset: 512)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1101, file: !897, line: 539, baseType: !936, size: 32, align: 32, offset: 576)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1101, file: !897, line: 541, baseType: !1026, size: 64, align: 64, offset: 640)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1101, file: !897, line: 549, baseType: !1031, size: 64, align: 64, offset: 704)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1101, file: !897, line: 550, baseType: !1026, size: 64, align: 64, offset: 768)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1101, file: !897, line: 554, baseType: !1119, size: 64, align: 64, offset: 832)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!936, !1029, !1034, !1034, !936}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1101, file: !897, line: 563, baseType: !1123, size: 64, align: 64, offset: 896)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!936, !55, !936}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1101, file: !897, line: 565, baseType: !1127, size: 64, align: 64, offset: 960)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{null, !1029, !936, !1079, !1079}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1101, file: !897, line: 570, baseType: !1131, size: 64, align: 64, offset: 1024)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!936, !1029, !936, !962, !1134}
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1135, line: 216, baseType: !1136)
!1135 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1136 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1101, file: !897, line: 581, baseType: !1138, size: 64, align: 64, offset: 1088)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!936, !1029, !936, !1141, !925}
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1144)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1145)
!1145 = !{!1146, !1150, !1152, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1186, !1188, !1189, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1144, file: !526, line: 282, baseType: !1147, size: 512, align: 64)
!1147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 512, align: 64, elements: !1148)
!1148 = !{!1149}
!1149 = !DISubrange(count: 8)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1144, file: !526, line: 299, baseType: !1151, size: 256, align: 32, offset: 512)
!1151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 256, align: 32, elements: !1148)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1144, file: !526, line: 315, baseType: !1153, size: 64, align: 64, offset: 768)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1144, file: !526, line: 326, baseType: !936, size: 32, align: 32, offset: 832)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1144, file: !526, line: 326, baseType: !936, size: 32, align: 32, offset: 864)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1144, file: !526, line: 334, baseType: !936, size: 32, align: 32, offset: 896)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1144, file: !526, line: 341, baseType: !936, size: 32, align: 32, offset: 928)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1144, file: !526, line: 346, baseType: !936, size: 32, align: 32, offset: 960)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1144, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1144, file: !526, line: 356, baseType: !1161, size: 64, align: 32, offset: 1024)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1162, line: 61, baseType: !1163)
!1162 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1162, line: 58, size: 64, align: 32, elements: !1164)
!1164 = !{!1165, !1166}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1163, file: !1162, line: 59, baseType: !936, size: 32, align: 32)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1163, file: !1162, line: 60, baseType: !936, size: 32, align: 32, offset: 32)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1144, file: !526, line: 361, baseType: !1051, size: 64, align: 64, offset: 1088)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1144, file: !526, line: 369, baseType: !1051, size: 64, align: 64, offset: 1152)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1144, file: !526, line: 377, baseType: !1051, size: 64, align: 64, offset: 1216)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1144, file: !526, line: 382, baseType: !936, size: 32, align: 32, offset: 1280)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1144, file: !526, line: 386, baseType: !936, size: 32, align: 32, offset: 1312)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1144, file: !526, line: 391, baseType: !936, size: 32, align: 32, offset: 1344)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1144, file: !526, line: 396, baseType: !962, size: 64, align: 64, offset: 1408)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1144, file: !526, line: 403, baseType: !1175, size: 512, align: 64, offset: 1472)
!1175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1176, size: 512, align: 64, elements: !1148)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !924, line: 55, baseType: !1136)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1144, file: !526, line: 410, baseType: !936, size: 32, align: 32, offset: 1984)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1144, file: !526, line: 415, baseType: !936, size: 32, align: 32, offset: 2016)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1144, file: !526, line: 420, baseType: !936, size: 32, align: 32, offset: 2048)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1144, file: !526, line: 425, baseType: !936, size: 32, align: 32, offset: 2080)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1144, file: !526, line: 435, baseType: !1051, size: 64, align: 64, offset: 2112)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1144, file: !526, line: 440, baseType: !936, size: 32, align: 32, offset: 2176)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1144, file: !526, line: 445, baseType: !1176, size: 64, align: 64, offset: 2240)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1144, file: !526, line: 459, baseType: !1185, size: 512, align: 64, offset: 2304)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 512, align: 64, elements: !1148)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1144, file: !526, line: 473, baseType: !1187, size: 64, align: 64, offset: 2816)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1144, file: !526, line: 477, baseType: !936, size: 32, align: 32, offset: 2880)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1144, file: !526, line: 479, baseType: !1190, size: 64, align: 64, offset: 2944)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1194)
!1194 = !{!1195, !1196, !1197, !1198, !1203}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1193, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1193, file: !526, line: 203, baseType: !932, size: 64, align: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1193, file: !526, line: 204, baseType: !936, size: 32, align: 32, offset: 128)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1193, file: !526, line: 205, baseType: !1199, size: 64, align: 64, offset: 192)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1201, line: 86, baseType: !1202)
!1201 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1202 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1201, line: 86, flags: DIFlagFwdDecl)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1193, file: !526, line: 206, baseType: !1039, size: 64, align: 64, offset: 256)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1144, file: !526, line: 480, baseType: !936, size: 32, align: 32, offset: 3008)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1144, file: !526, line: 505, baseType: !936, size: 32, align: 32, offset: 3040)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1144, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1144, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1144, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1144, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1144, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1144, file: !526, line: 532, baseType: !1051, size: 64, align: 64, offset: 3264)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1144, file: !526, line: 539, baseType: !1051, size: 64, align: 64, offset: 3328)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1144, file: !526, line: 547, baseType: !1051, size: 64, align: 64, offset: 3392)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1144, file: !526, line: 554, baseType: !1199, size: 64, align: 64, offset: 3456)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1144, file: !526, line: 563, baseType: !936, size: 32, align: 32, offset: 3520)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1144, file: !526, line: 572, baseType: !936, size: 32, align: 32, offset: 3552)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1144, file: !526, line: 581, baseType: !936, size: 32, align: 32, offset: 3584)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1144, file: !526, line: 588, baseType: !1219, size: 64, align: 64, offset: 3648)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !924, line: 36, baseType: !1221)
!1221 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1144, file: !526, line: 593, baseType: !936, size: 32, align: 32, offset: 3712)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1144, file: !526, line: 596, baseType: !936, size: 32, align: 32, offset: 3744)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1144, file: !526, line: 599, baseType: !1039, size: 64, align: 64, offset: 3776)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1144, file: !526, line: 605, baseType: !1039, size: 64, align: 64, offset: 3840)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1144, file: !526, line: 616, baseType: !1039, size: 64, align: 64, offset: 3904)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1144, file: !526, line: 626, baseType: !1134, size: 64, align: 64, offset: 3968)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1144, file: !526, line: 627, baseType: !1134, size: 64, align: 64, offset: 4032)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1144, file: !526, line: 628, baseType: !1134, size: 64, align: 64, offset: 4096)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1144, file: !526, line: 629, baseType: !1134, size: 64, align: 64, offset: 4160)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1144, file: !526, line: 645, baseType: !1039, size: 64, align: 64, offset: 4224)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1101, file: !897, line: 587, baseType: !1087, size: 64, align: 64, offset: 1152)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1101, file: !897, line: 592, baseType: !1093, size: 64, align: 64, offset: 1216)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1101, file: !897, line: 597, baseType: !1093, size: 64, align: 64, offset: 1280)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1101, file: !897, line: 598, baseType: !55, size: 32, align: 32, offset: 1344)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1101, file: !897, line: 608, baseType: !1026, size: 64, align: 64, offset: 1408)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1101, file: !897, line: 617, baseType: !1238, size: 64, align: 64, offset: 1472)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{null, !1029}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1101, file: !897, line: 623, baseType: !1242, size: 64, align: 64, offset: 1536)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{!936, !1029, !1245}
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1035)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !946, file: !897, line: 1365, baseType: !962, size: 64, align: 64, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !946, file: !897, line: 1379, baseType: !1249, size: 64, align: 64, offset: 256)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1252)
!1252 = !{!1253, !1254, !1255, !1256, !1257, !1258, !1259, !1263, !1264, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1280, !1281, !1285, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1303, !1304, !1305, !1306, !1310, !1311, !1312}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1251, file: !628, line: 174, baseType: !949, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1251, file: !628, line: 226, baseType: !1022, size: 64, align: 64, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1251, file: !628, line: 227, baseType: !936, size: 32, align: 32, offset: 128)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1251, file: !628, line: 228, baseType: !1022, size: 64, align: 64, offset: 192)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1251, file: !628, line: 229, baseType: !1022, size: 64, align: 64, offset: 256)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1251, file: !628, line: 233, baseType: !962, size: 64, align: 64, offset: 320)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1251, file: !628, line: 235, baseType: !1260, size: 64, align: 64, offset: 384)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!936, !962, !932, !936}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1251, file: !628, line: 236, baseType: !1260, size: 64, align: 64, offset: 448)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1251, file: !628, line: 237, baseType: !1265, size: 64, align: 64, offset: 512)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!1051, !962, !1051, !936}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1251, file: !628, line: 238, baseType: !1051, size: 64, align: 64, offset: 576)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1251, file: !628, line: 239, baseType: !936, size: 32, align: 32, offset: 640)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1251, file: !628, line: 240, baseType: !936, size: 32, align: 32, offset: 672)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1251, file: !628, line: 241, baseType: !936, size: 32, align: 32, offset: 704)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1251, file: !628, line: 242, baseType: !1136, size: 64, align: 64, offset: 768)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1251, file: !628, line: 243, baseType: !1022, size: 64, align: 64, offset: 832)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1251, file: !628, line: 244, baseType: !1275, size: 64, align: 64, offset: 896)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!1136, !1136, !1278, !925}
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1251, file: !628, line: 245, baseType: !936, size: 32, align: 32, offset: 960)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1251, file: !628, line: 249, baseType: !1282, size: 64, align: 64, offset: 1024)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!936, !962, !936}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1251, file: !628, line: 255, baseType: !1286, size: 64, align: 64, offset: 1088)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DISubroutineType(types: !1288)
!1288 = !{!1051, !962, !936, !1051, !936}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1251, file: !628, line: 260, baseType: !936, size: 32, align: 32, offset: 1152)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1251, file: !628, line: 266, baseType: !1051, size: 64, align: 64, offset: 1216)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1251, file: !628, line: 273, baseType: !936, size: 32, align: 32, offset: 1280)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1251, file: !628, line: 279, baseType: !1051, size: 64, align: 64, offset: 1344)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1251, file: !628, line: 285, baseType: !936, size: 32, align: 32, offset: 1408)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1251, file: !628, line: 291, baseType: !936, size: 32, align: 32, offset: 1440)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1251, file: !628, line: 298, baseType: !936, size: 32, align: 32, offset: 1472)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1251, file: !628, line: 304, baseType: !936, size: 32, align: 32, offset: 1504)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1251, file: !628, line: 309, baseType: !955, size: 64, align: 64, offset: 1536)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1251, file: !628, line: 314, baseType: !955, size: 64, align: 64, offset: 1600)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1251, file: !628, line: 319, baseType: !1300, size: 64, align: 64, offset: 1664)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{!936, !962, !932, !936, !627, !1051}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1251, file: !628, line: 326, baseType: !936, size: 32, align: 32, offset: 1728)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1251, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1251, file: !628, line: 332, baseType: !1051, size: 64, align: 64, offset: 1792)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1251, file: !628, line: 338, baseType: !1307, size: 64, align: 64, offset: 1856)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!936, !962}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1251, file: !628, line: 340, baseType: !1051, size: 64, align: 64, offset: 1920)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1251, file: !628, line: 346, baseType: !1022, size: 64, align: 64, offset: 1984)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1251, file: !628, line: 351, baseType: !936, size: 32, align: 32, offset: 2048)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !946, file: !897, line: 1386, baseType: !936, size: 32, align: 32, offset: 320)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !946, file: !897, line: 1393, baseType: !925, size: 32, align: 32, offset: 352)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !946, file: !897, line: 1405, baseType: !1316, size: 64, align: 64, offset: 384)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1319)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1320)
!1320 = !{!1321, !1322, !1323, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1791, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1892, !1898, !1899, !1903, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1935, !1936, !1937, !1938, !1939, !1940}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1319, file: !897, line: 866, baseType: !936, size: 32, align: 32)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1319, file: !897, line: 872, baseType: !936, size: 32, align: 32, offset: 32)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1319, file: !897, line: 878, baseType: !1324, size: 64, align: 64, offset: 64)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !25, line: 3360, baseType: !1326)
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !25, line: 1556, size: 8448, align: 64, elements: !1327)
!1327 = !{!1328, !1329, !1330, !1331, !1466, !1467, !1468, !1469, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1495, !1499, !1500, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1679, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1326, file: !25, line: 1561, baseType: !949, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1326, file: !25, line: 1562, baseType: !936, size: 32, align: 32, offset: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1326, file: !25, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1326, file: !25, line: 1565, baseType: !1332, size: 64, align: 64, offset: 128)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1334)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !25, line: 3468, size: 1984, align: 64, elements: !1335)
!1335 = !{!1336, !1337, !1338, !1339, !1340, !1341, !1344, !1347, !1350, !1353, !1356, !1357, !1358, !1366, !1367, !1368, !1370, !1374, !1380, !1385, !1389, !1390, !1431, !1438, !1442, !1443, !1447, !1451, !1455, !1459, !1460, !1461}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1334, file: !25, line: 3475, baseType: !955, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1334, file: !25, line: 3480, baseType: !955, size: 64, align: 64, offset: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1334, file: !25, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1334, file: !25, line: 3482, baseType: !55, size: 32, align: 32, offset: 160)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1334, file: !25, line: 3487, baseType: !936, size: 32, align: 32, offset: 192)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1334, file: !25, line: 3488, baseType: !1342, size: 64, align: 64, offset: 256)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1161)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1334, file: !25, line: 3489, baseType: !1345, size: 64, align: 64, offset: 320)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1334, file: !25, line: 3490, baseType: !1348, size: 64, align: 64, offset: 384)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1334, file: !25, line: 3491, baseType: !1351, size: 64, align: 64, offset: 448)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1334, file: !25, line: 3492, baseType: !1354, size: 64, align: 64, offset: 512)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1176)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1334, file: !25, line: 3493, baseType: !933, size: 8, align: 8, offset: 576)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1334, file: !25, line: 3494, baseType: !949, size: 64, align: 64, offset: 640)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1334, file: !25, line: 3495, baseType: !1359, size: 64, align: 64, offset: 704)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1361)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !25, line: 3404, baseType: !1362)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !25, line: 3401, size: 128, align: 64, elements: !1363)
!1363 = !{!1364, !1365}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1362, file: !25, line: 3402, baseType: !936, size: 32, align: 32)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1362, file: !25, line: 3403, baseType: !955, size: 64, align: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1334, file: !25, line: 3507, baseType: !955, size: 64, align: 64, offset: 768)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1334, file: !25, line: 3516, baseType: !936, size: 32, align: 32, offset: 832)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1334, file: !25, line: 3517, baseType: !1369, size: 64, align: 64, offset: 896)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1334, file: !25, line: 3527, baseType: !1371, size: 64, align: 64, offset: 960)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DISubroutineType(types: !1373)
!1373 = !{!936, !1324}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1334, file: !25, line: 3535, baseType: !1375, size: 64, align: 64, offset: 1024)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DISubroutineType(types: !1377)
!1377 = !{!936, !1324, !1378}
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1325)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1334, file: !25, line: 3541, baseType: !1381, size: 64, align: 64, offset: 1088)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1383)
!1383 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !25, line: 3461, baseType: !1384)
!1384 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !25, line: 3461, flags: DIFlagFwdDecl)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1334, file: !25, line: 3549, baseType: !1386, size: 64, align: 64, offset: 1152)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DISubroutineType(types: !1388)
!1388 = !{null, !1369}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1334, file: !25, line: 3551, baseType: !1371, size: 64, align: 64, offset: 1216)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1334, file: !25, line: 3552, baseType: !1391, size: 64, align: 64, offset: 1280)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DISubroutineType(types: !1393)
!1393 = !{!936, !1324, !932, !936, !1394}
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1396)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !25, line: 3920, size: 256, align: 64, elements: !1397)
!1397 = !{!1398, !1399, !1400, !1401, !1402, !1430}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1396, file: !25, line: 3921, baseType: !930, size: 16, align: 16)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1396, file: !25, line: 3922, baseType: !923, size: 32, align: 32, offset: 32)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1396, file: !25, line: 3923, baseType: !923, size: 32, align: 32, offset: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1396, file: !25, line: 3924, baseType: !925, size: 32, align: 32, offset: 96)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1396, file: !25, line: 3925, baseType: !1403, size: 64, align: 64, offset: 128)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !25, line: 3918, baseType: !1406)
!1406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !25, line: 3885, size: 1600, align: 64, elements: !1407)
!1407 = !{!1408, !1409, !1410, !1411, !1412, !1413, !1419, !1423, !1425, !1426, !1428, !1429}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1406, file: !25, line: 3886, baseType: !936, size: 32, align: 32)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1406, file: !25, line: 3887, baseType: !936, size: 32, align: 32, offset: 32)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1406, file: !25, line: 3888, baseType: !936, size: 32, align: 32, offset: 64)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1406, file: !25, line: 3889, baseType: !936, size: 32, align: 32, offset: 96)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1406, file: !25, line: 3890, baseType: !936, size: 32, align: 32, offset: 128)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1406, file: !25, line: 3897, baseType: !1414, size: 768, align: 64, offset: 192)
!1414 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !25, line: 3858, baseType: !1415)
!1415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !25, line: 3853, size: 768, align: 64, elements: !1416)
!1416 = !{!1417, !1418}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1415, file: !25, line: 3855, baseType: !1147, size: 512, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1415, file: !25, line: 3857, baseType: !1151, size: 256, align: 32, offset: 512)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1406, file: !25, line: 3903, baseType: !1420, size: 256, align: 64, offset: 960)
!1420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 256, align: 64, elements: !1421)
!1421 = !{!1422}
!1422 = !DISubrange(count: 4)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1406, file: !25, line: 3904, baseType: !1424, size: 128, align: 32, offset: 1216)
!1424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 128, align: 32, elements: !1421)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1406, file: !25, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1406, file: !25, line: 3908, baseType: !1427, size: 64, align: 64, offset: 1408)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1406, file: !25, line: 3915, baseType: !1427, size: 64, align: 64, offset: 1472)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1406, file: !25, line: 3917, baseType: !936, size: 32, align: 32, offset: 1536)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1396, file: !25, line: 3926, baseType: !1051, size: 64, align: 64, offset: 192)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1334, file: !25, line: 3564, baseType: !1432, size: 64, align: 64, offset: 1344)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DISubroutineType(types: !1434)
!1434 = !{!936, !1324, !1034, !1435, !1437}
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1143)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1334, file: !25, line: 3566, baseType: !1439, size: 64, align: 64, offset: 1408)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1440 = !DISubroutineType(types: !1441)
!1441 = !{!936, !1324, !962, !1437, !1034}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1334, file: !25, line: 3567, baseType: !1371, size: 64, align: 64, offset: 1472)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1334, file: !25, line: 3576, baseType: !1444, size: 64, align: 64, offset: 1536)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DISubroutineType(types: !1446)
!1446 = !{!936, !1324, !1435}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1334, file: !25, line: 3577, baseType: !1448, size: 64, align: 64, offset: 1600)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{!936, !1324, !1034}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1334, file: !25, line: 3584, baseType: !1452, size: 64, align: 64, offset: 1664)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DISubroutineType(types: !1454)
!1454 = !{!936, !1324, !1142}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1334, file: !25, line: 3589, baseType: !1456, size: 64, align: 64, offset: 1728)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DISubroutineType(types: !1458)
!1458 = !{null, !1324}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1334, file: !25, line: 3594, baseType: !936, size: 32, align: 32, offset: 1792)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1334, file: !25, line: 3600, baseType: !955, size: 64, align: 64, offset: 1856)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1334, file: !25, line: 3609, baseType: !1462, size: 64, align: 64, offset: 1920)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1465)
!1465 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !25, line: 3609, flags: DIFlagFwdDecl)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1326, file: !25, line: 1566, baseType: !55, size: 32, align: 32, offset: 192)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1326, file: !25, line: 1581, baseType: !925, size: 32, align: 32, offset: 224)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1326, file: !25, line: 1583, baseType: !962, size: 64, align: 64, offset: 256)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1326, file: !25, line: 1591, baseType: !1470, size: 64, align: 64, offset: 320)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !25, line: 1532, flags: DIFlagFwdDecl)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1326, file: !25, line: 1598, baseType: !962, size: 64, align: 64, offset: 384)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1326, file: !25, line: 1606, baseType: !1051, size: 64, align: 64, offset: 448)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1326, file: !25, line: 1614, baseType: !936, size: 32, align: 32, offset: 512)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1326, file: !25, line: 1622, baseType: !936, size: 32, align: 32, offset: 544)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1326, file: !25, line: 1628, baseType: !936, size: 32, align: 32, offset: 576)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1326, file: !25, line: 1636, baseType: !936, size: 32, align: 32, offset: 608)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1326, file: !25, line: 1643, baseType: !936, size: 32, align: 32, offset: 640)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1326, file: !25, line: 1657, baseType: !932, size: 64, align: 64, offset: 704)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1326, file: !25, line: 1658, baseType: !936, size: 32, align: 32, offset: 768)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1326, file: !25, line: 1679, baseType: !1161, size: 64, align: 32, offset: 800)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1326, file: !25, line: 1688, baseType: !936, size: 32, align: 32, offset: 864)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1326, file: !25, line: 1712, baseType: !936, size: 32, align: 32, offset: 896)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1326, file: !25, line: 1729, baseType: !936, size: 32, align: 32, offset: 928)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1326, file: !25, line: 1729, baseType: !936, size: 32, align: 32, offset: 960)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1326, file: !25, line: 1744, baseType: !936, size: 32, align: 32, offset: 992)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1326, file: !25, line: 1744, baseType: !936, size: 32, align: 32, offset: 1024)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1326, file: !25, line: 1751, baseType: !936, size: 32, align: 32, offset: 1056)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1326, file: !25, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1326, file: !25, line: 1791, baseType: !1491, size: 64, align: 64, offset: 1152)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{null, !1494, !1435, !1437, !936, !936, !936}
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1326, file: !25, line: 1808, baseType: !1496, size: 64, align: 64, offset: 1216)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{!645, !1494, !1345}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1326, file: !25, line: 1816, baseType: !936, size: 32, align: 32, offset: 1280)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1326, file: !25, line: 1825, baseType: !1501, size: 32, align: 32, offset: 1312)
!1501 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1326, file: !25, line: 1830, baseType: !936, size: 32, align: 32, offset: 1344)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1326, file: !25, line: 1838, baseType: !1501, size: 32, align: 32, offset: 1376)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1326, file: !25, line: 1846, baseType: !936, size: 32, align: 32, offset: 1408)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1326, file: !25, line: 1851, baseType: !936, size: 32, align: 32, offset: 1440)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1326, file: !25, line: 1861, baseType: !1501, size: 32, align: 32, offset: 1472)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1326, file: !25, line: 1868, baseType: !1501, size: 32, align: 32, offset: 1504)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1326, file: !25, line: 1875, baseType: !1501, size: 32, align: 32, offset: 1536)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1326, file: !25, line: 1882, baseType: !1501, size: 32, align: 32, offset: 1568)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1326, file: !25, line: 1889, baseType: !1501, size: 32, align: 32, offset: 1600)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1326, file: !25, line: 1896, baseType: !1501, size: 32, align: 32, offset: 1632)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1326, file: !25, line: 1903, baseType: !1501, size: 32, align: 32, offset: 1664)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1326, file: !25, line: 1910, baseType: !936, size: 32, align: 32, offset: 1696)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1326, file: !25, line: 1915, baseType: !936, size: 32, align: 32, offset: 1728)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1326, file: !25, line: 1926, baseType: !1437, size: 64, align: 64, offset: 1792)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1326, file: !25, line: 1935, baseType: !1161, size: 64, align: 32, offset: 1856)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1326, file: !25, line: 1942, baseType: !936, size: 32, align: 32, offset: 1920)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1326, file: !25, line: 1948, baseType: !936, size: 32, align: 32, offset: 1952)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1326, file: !25, line: 1954, baseType: !936, size: 32, align: 32, offset: 1984)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1326, file: !25, line: 1960, baseType: !936, size: 32, align: 32, offset: 2016)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1326, file: !25, line: 1984, baseType: !936, size: 32, align: 32, offset: 2048)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1326, file: !25, line: 1991, baseType: !936, size: 32, align: 32, offset: 2080)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1326, file: !25, line: 1996, baseType: !936, size: 32, align: 32, offset: 2112)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1326, file: !25, line: 2004, baseType: !936, size: 32, align: 32, offset: 2144)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1326, file: !25, line: 2011, baseType: !936, size: 32, align: 32, offset: 2176)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1326, file: !25, line: 2018, baseType: !936, size: 32, align: 32, offset: 2208)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1326, file: !25, line: 2027, baseType: !936, size: 32, align: 32, offset: 2240)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1326, file: !25, line: 2034, baseType: !936, size: 32, align: 32, offset: 2272)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1326, file: !25, line: 2044, baseType: !936, size: 32, align: 32, offset: 2304)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1326, file: !25, line: 2054, baseType: !1531, size: 64, align: 64, offset: 2368)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1326, file: !25, line: 2061, baseType: !1531, size: 64, align: 64, offset: 2432)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1326, file: !25, line: 2066, baseType: !936, size: 32, align: 32, offset: 2496)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1326, file: !25, line: 2070, baseType: !936, size: 32, align: 32, offset: 2528)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1326, file: !25, line: 2078, baseType: !936, size: 32, align: 32, offset: 2560)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1326, file: !25, line: 2085, baseType: !936, size: 32, align: 32, offset: 2592)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1326, file: !25, line: 2092, baseType: !936, size: 32, align: 32, offset: 2624)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1326, file: !25, line: 2099, baseType: !936, size: 32, align: 32, offset: 2656)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1326, file: !25, line: 2106, baseType: !936, size: 32, align: 32, offset: 2688)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1326, file: !25, line: 2113, baseType: !936, size: 32, align: 32, offset: 2720)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1326, file: !25, line: 2120, baseType: !936, size: 32, align: 32, offset: 2752)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1326, file: !25, line: 2125, baseType: !936, size: 32, align: 32, offset: 2784)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1326, file: !25, line: 2133, baseType: !936, size: 32, align: 32, offset: 2816)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1326, file: !25, line: 2140, baseType: !936, size: 32, align: 32, offset: 2848)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1326, file: !25, line: 2145, baseType: !936, size: 32, align: 32, offset: 2880)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1326, file: !25, line: 2153, baseType: !936, size: 32, align: 32, offset: 2912)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1326, file: !25, line: 2158, baseType: !936, size: 32, align: 32, offset: 2944)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1326, file: !25, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1326, file: !25, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1326, file: !25, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1326, file: !25, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1326, file: !25, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1326, file: !25, line: 2203, baseType: !936, size: 32, align: 32, offset: 3136)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1326, file: !25, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1326, file: !25, line: 2212, baseType: !936, size: 32, align: 32, offset: 3200)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1326, file: !25, line: 2213, baseType: !936, size: 32, align: 32, offset: 3232)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1326, file: !25, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1326, file: !25, line: 2232, baseType: !936, size: 32, align: 32, offset: 3296)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1326, file: !25, line: 2243, baseType: !936, size: 32, align: 32, offset: 3328)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1326, file: !25, line: 2249, baseType: !936, size: 32, align: 32, offset: 3360)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1326, file: !25, line: 2256, baseType: !936, size: 32, align: 32, offset: 3392)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1326, file: !25, line: 2263, baseType: !1176, size: 64, align: 64, offset: 3456)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1326, file: !25, line: 2270, baseType: !1176, size: 64, align: 64, offset: 3520)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1326, file: !25, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1326, file: !25, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1326, file: !25, line: 2367, baseType: !1567, size: 64, align: 64, offset: 3648)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DISubroutineType(types: !1569)
!1569 = !{!936, !1494, !1142, !936}
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1326, file: !25, line: 2383, baseType: !936, size: 32, align: 32, offset: 3712)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1326, file: !25, line: 2386, baseType: !1501, size: 32, align: 32, offset: 3744)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1326, file: !25, line: 2387, baseType: !1501, size: 32, align: 32, offset: 3776)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1326, file: !25, line: 2394, baseType: !936, size: 32, align: 32, offset: 3808)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1326, file: !25, line: 2401, baseType: !936, size: 32, align: 32, offset: 3840)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1326, file: !25, line: 2408, baseType: !936, size: 32, align: 32, offset: 3872)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1326, file: !25, line: 2415, baseType: !936, size: 32, align: 32, offset: 3904)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1326, file: !25, line: 2422, baseType: !936, size: 32, align: 32, offset: 3936)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1326, file: !25, line: 2423, baseType: !1579, size: 64, align: 64, offset: 3968)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !25, line: 831, baseType: !1581)
!1581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !25, line: 826, size: 128, align: 32, elements: !1582)
!1582 = !{!1583, !1584, !1585, !1586}
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1581, file: !25, line: 827, baseType: !936, size: 32, align: 32)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1581, file: !25, line: 828, baseType: !936, size: 32, align: 32, offset: 32)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1581, file: !25, line: 829, baseType: !936, size: 32, align: 32, offset: 64)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1581, file: !25, line: 830, baseType: !1501, size: 32, align: 32, offset: 96)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1326, file: !25, line: 2430, baseType: !1051, size: 64, align: 64, offset: 4032)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1326, file: !25, line: 2437, baseType: !1051, size: 64, align: 64, offset: 4096)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1326, file: !25, line: 2444, baseType: !1501, size: 32, align: 32, offset: 4160)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1326, file: !25, line: 2451, baseType: !1501, size: 32, align: 32, offset: 4192)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1326, file: !25, line: 2458, baseType: !936, size: 32, align: 32, offset: 4224)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1326, file: !25, line: 2469, baseType: !936, size: 32, align: 32, offset: 4256)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1326, file: !25, line: 2475, baseType: !936, size: 32, align: 32, offset: 4288)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1326, file: !25, line: 2481, baseType: !936, size: 32, align: 32, offset: 4320)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1326, file: !25, line: 2485, baseType: !936, size: 32, align: 32, offset: 4352)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1326, file: !25, line: 2489, baseType: !936, size: 32, align: 32, offset: 4384)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1326, file: !25, line: 2493, baseType: !936, size: 32, align: 32, offset: 4416)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1326, file: !25, line: 2501, baseType: !936, size: 32, align: 32, offset: 4448)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1326, file: !25, line: 2506, baseType: !936, size: 32, align: 32, offset: 4480)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1326, file: !25, line: 2510, baseType: !936, size: 32, align: 32, offset: 4512)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1326, file: !25, line: 2514, baseType: !1051, size: 64, align: 64, offset: 4544)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1326, file: !25, line: 2528, baseType: !1603, size: 64, align: 64, offset: 4608)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DISubroutineType(types: !1605)
!1605 = !{null, !1494, !962, !936, !936}
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1326, file: !25, line: 2534, baseType: !936, size: 32, align: 32, offset: 4672)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1326, file: !25, line: 2545, baseType: !936, size: 32, align: 32, offset: 4704)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1326, file: !25, line: 2547, baseType: !936, size: 32, align: 32, offset: 4736)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1326, file: !25, line: 2549, baseType: !936, size: 32, align: 32, offset: 4768)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1326, file: !25, line: 2551, baseType: !936, size: 32, align: 32, offset: 4800)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1326, file: !25, line: 2553, baseType: !936, size: 32, align: 32, offset: 4832)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1326, file: !25, line: 2555, baseType: !936, size: 32, align: 32, offset: 4864)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1326, file: !25, line: 2557, baseType: !936, size: 32, align: 32, offset: 4896)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1326, file: !25, line: 2559, baseType: !936, size: 32, align: 32, offset: 4928)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1326, file: !25, line: 2563, baseType: !936, size: 32, align: 32, offset: 4960)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1326, file: !25, line: 2571, baseType: !1427, size: 64, align: 64, offset: 4992)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1326, file: !25, line: 2579, baseType: !1427, size: 64, align: 64, offset: 5056)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1326, file: !25, line: 2586, baseType: !936, size: 32, align: 32, offset: 5120)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1326, file: !25, line: 2615, baseType: !936, size: 32, align: 32, offset: 5152)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1326, file: !25, line: 2627, baseType: !936, size: 32, align: 32, offset: 5184)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1326, file: !25, line: 2637, baseType: !936, size: 32, align: 32, offset: 5216)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1326, file: !25, line: 2681, baseType: !936, size: 32, align: 32, offset: 5248)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1326, file: !25, line: 2709, baseType: !1051, size: 64, align: 64, offset: 5312)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1326, file: !25, line: 2716, baseType: !1625, size: 64, align: 64, offset: 5376)
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64, align: 64)
!1626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1627)
!1627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !25, line: 3636, size: 896, align: 64, elements: !1628)
!1628 = !{!1629, !1630, !1631, !1632, !1633, !1634, !1635, !1639, !1643, !1644, !1645, !1646, !1652, !1653, !1654, !1655, !1656}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1627, file: !25, line: 3642, baseType: !955, size: 64, align: 64)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1627, file: !25, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1627, file: !25, line: 3656, baseType: !55, size: 32, align: 32, offset: 96)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1627, file: !25, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1627, file: !25, line: 3669, baseType: !936, size: 32, align: 32, offset: 160)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1627, file: !25, line: 3682, baseType: !1452, size: 64, align: 64, offset: 192)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1627, file: !25, line: 3698, baseType: !1636, size: 64, align: 64, offset: 256)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DISubroutineType(types: !1638)
!1638 = !{!936, !1324, !1278, !923}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1627, file: !25, line: 3712, baseType: !1640, size: 64, align: 64, offset: 320)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DISubroutineType(types: !1642)
!1642 = !{!936, !1324, !936, !1278, !923}
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1627, file: !25, line: 3726, baseType: !1636, size: 64, align: 64, offset: 384)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1627, file: !25, line: 3737, baseType: !1371, size: 64, align: 64, offset: 448)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1627, file: !25, line: 3746, baseType: !936, size: 32, align: 32, offset: 512)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1627, file: !25, line: 3757, baseType: !1647, size: 64, align: 64, offset: 576)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DISubroutineType(types: !1649)
!1649 = !{null, !1650}
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !25, line: 3617, flags: DIFlagFwdDecl)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1627, file: !25, line: 3766, baseType: !1371, size: 64, align: 64, offset: 640)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1627, file: !25, line: 3774, baseType: !1371, size: 64, align: 64, offset: 704)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1627, file: !25, line: 3780, baseType: !936, size: 32, align: 32, offset: 768)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1627, file: !25, line: 3785, baseType: !936, size: 32, align: 32, offset: 800)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1627, file: !25, line: 3795, baseType: !1657, size: 64, align: 64, offset: 832)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DISubroutineType(types: !1659)
!1659 = !{!936, !1324, !1039}
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1326, file: !25, line: 2728, baseType: !962, size: 64, align: 64, offset: 5440)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1326, file: !25, line: 2735, baseType: !1175, size: 512, align: 64, offset: 5504)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1326, file: !25, line: 2742, baseType: !936, size: 32, align: 32, offset: 6016)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1326, file: !25, line: 2755, baseType: !936, size: 32, align: 32, offset: 6048)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1326, file: !25, line: 2776, baseType: !936, size: 32, align: 32, offset: 6080)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1326, file: !25, line: 2783, baseType: !936, size: 32, align: 32, offset: 6112)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1326, file: !25, line: 2791, baseType: !936, size: 32, align: 32, offset: 6144)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1326, file: !25, line: 2802, baseType: !1142, size: 64, align: 64, offset: 6208)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1326, file: !25, line: 2811, baseType: !936, size: 32, align: 32, offset: 6272)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1326, file: !25, line: 2821, baseType: !936, size: 32, align: 32, offset: 6304)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1326, file: !25, line: 2830, baseType: !936, size: 32, align: 32, offset: 6336)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1326, file: !25, line: 2840, baseType: !936, size: 32, align: 32, offset: 6368)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1326, file: !25, line: 2851, baseType: !1673, size: 64, align: 64, offset: 6400)
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64, align: 64)
!1674 = !DISubroutineType(types: !1675)
!1675 = !{!936, !1494, !1676, !962, !1437, !936, !936}
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DISubroutineType(types: !1678)
!1678 = !{!936, !1494, !962}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1326, file: !25, line: 2871, baseType: !1680, size: 64, align: 64, offset: 6464)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{!936, !1494, !1683, !962, !1437, !936}
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64, align: 64)
!1684 = !DISubroutineType(types: !1685)
!1685 = !{!936, !1494, !962, !936, !936}
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1326, file: !25, line: 2878, baseType: !936, size: 32, align: 32, offset: 6528)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1326, file: !25, line: 2885, baseType: !936, size: 32, align: 32, offset: 6560)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1326, file: !25, line: 3005, baseType: !936, size: 32, align: 32, offset: 6592)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1326, file: !25, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1326, file: !25, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1326, file: !25, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1326, file: !25, line: 3037, baseType: !932, size: 64, align: 64, offset: 6720)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1326, file: !25, line: 3038, baseType: !936, size: 32, align: 32, offset: 6784)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1326, file: !25, line: 3050, baseType: !1176, size: 64, align: 64, offset: 6848)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1326, file: !25, line: 3065, baseType: !936, size: 32, align: 32, offset: 6912)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1326, file: !25, line: 3083, baseType: !936, size: 32, align: 32, offset: 6944)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1326, file: !25, line: 3092, baseType: !1161, size: 64, align: 32, offset: 6976)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1326, file: !25, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1326, file: !25, line: 3106, baseType: !1161, size: 64, align: 32, offset: 7072)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1326, file: !25, line: 3113, baseType: !1701, size: 64, align: 64, offset: 7168)
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64, align: 64)
!1702 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1703)
!1703 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !25, line: 740, baseType: !1704)
!1704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !25, line: 712, size: 384, align: 64, elements: !1705)
!1705 = !{!1706, !1707, !1708, !1709, !1710, !1711, !1714}
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1704, file: !25, line: 713, baseType: !55, size: 32, align: 32)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1704, file: !25, line: 714, baseType: !636, size: 32, align: 32, offset: 32)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1704, file: !25, line: 720, baseType: !955, size: 64, align: 64, offset: 64)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1704, file: !25, line: 724, baseType: !955, size: 64, align: 64, offset: 128)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1704, file: !25, line: 728, baseType: !936, size: 32, align: 32, offset: 192)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1704, file: !25, line: 734, baseType: !1712, size: 64, align: 64, offset: 256)
!1712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1713, size: 64, align: 64)
!1713 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1704, file: !25, line: 739, baseType: !1715, size: 64, align: 64, offset: 320)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64, align: 64)
!1716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1362)
