; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--hevc_parser.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--hevc_parser.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecParserContext = type { i8*, %struct.AVCodecParser*, i64, i64, i64, i32, i32, i64, i64, i64, i64, i32, i32, [4 x i64], [4 x i64], [4 x i64], i32, i64, [4 x i64], i32, i64, i32, i32, i32, [4 x i64], i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!909 = !DIEnumerator(name: "HEVC_NAL_RASL_N", value: 8)
!910 = !DIEnumerator(name: "HEVC_NAL_RASL_R", value: 9)
!911 = !DIEnumerator(name: "HEVC_NAL_VCL_N10", value: 10)
!912 = !DIEnumerator(name: "HEVC_NAL_VCL_R11", value: 11)
!913 = !DIEnumerator(name: "HEVC_NAL_VCL_N12", value: 12)
!914 = !DIEnumerator(name: "HEVC_NAL_VCL_R13", value: 13)
!915 = !DIEnumerator(name: "HEVC_NAL_VCL_N14", value: 14)
!916 = !DIEnumerator(name: "HEVC_NAL_VCL_R15", value: 15)
!917 = !DIEnumerator(name: "HEVC_NAL_BLA_W_LP", value: 16)
!918 = !DIEnumerator(name: "HEVC_NAL_BLA_W_RADL", value: 17)
!919 = !DIEnumerator(name: "HEVC_NAL_BLA_N_LP", value: 18)
!920 = !DIEnumerator(name: "HEVC_NAL_IDR_W_RADL", value: 19)
!921 = !DIEnumerator(name: "HEVC_NAL_IDR_N_LP", value: 20)
!922 = !DIEnumerator(name: "HEVC_NAL_CRA_NUT", value: 21)
!923 = !DIEnumerator(name: "HEVC_NAL_IRAP_VCL22", value: 22)
!924 = !DIEnumerator(name: "HEVC_NAL_IRAP_VCL23", value: 23)
!925 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL24", value: 24)
!926 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL25", value: 25)
!927 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL26", value: 26)
!928 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL27", value: 27)
!929 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL28", value: 28)
!930 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL29", value: 29)
!931 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL30", value: 30)
!932 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL31", value: 31)
!933 = !DIEnumerator(name: "HEVC_NAL_VPS", value: 32)
!934 = !DIEnumerator(name: "HEVC_NAL_SPS", value: 33)
!935 = !DIEnumerator(name: "HEVC_NAL_PPS", value: 34)
!936 = !DIEnumerator(name: "HEVC_NAL_AUD", value: 35)
!937 = !DIEnumerator(name: "HEVC_NAL_EOS_NUT", value: 36)
!938 = !DIEnumerator(name: "HEVC_NAL_EOB_NUT", value: 37)
!939 = !DIEnumerator(name: "HEVC_NAL_FD_NUT", value: 38)
!940 = !DIEnumerator(name: "HEVC_NAL_SEI_PREFIX", value: 39)
!941 = !DIEnumerator(name: "HEVC_NAL_SEI_SUFFIX", value: 40)
!942 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL41", value: 41)
!943 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL42", value: 42)
!944 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL43", value: 43)
!945 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL44", value: 44)
!946 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL45", value: 45)
!947 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL46", value: 46)
!948 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL47", value: 47)
!949 = !DIEnumerator(name: "HEVC_NAL_UNSPEC48", value: 48)
!950 = !DIEnumerator(name: "HEVC_NAL_UNSPEC49", value: 49)
!951 = !DIEnumerator(name: "HEVC_NAL_UNSPEC50", value: 50)
!952 = !DIEnumerator(name: "HEVC_NAL_UNSPEC51", value: 51)
!953 = !DIEnumerator(name: "HEVC_NAL_UNSPEC52", value: 52)
!954 = !DIEnumerator(name: "HEVC_NAL_UNSPEC53", value: 53)
!955 = !DIEnumerator(name: "HEVC_NAL_UNSPEC54", value: 54)
!956 = !DIEnumerator(name: "HEVC_NAL_UNSPEC55", value: 55)
!957 = !DIEnumerator(name: "HEVC_NAL_UNSPEC56", value: 56)
!958 = !DIEnumerator(name: "HEVC_NAL_UNSPEC57", value: 57)
!959 = !DIEnumerator(name: "HEVC_NAL_UNSPEC58", value: 58)
!960 = !DIEnumerator(name: "HEVC_NAL_UNSPEC59", value: 59)
!961 = !DIEnumerator(name: "HEVC_NAL_UNSPEC60", value: 60)
!962 = !DIEnumerator(name: "HEVC_NAL_UNSPEC61", value: 61)
!963 = !DIEnumerator(name: "HEVC_NAL_UNSPEC62", value: 62)
!964 = !DIEnumerator(name: "HEVC_NAL_UNSPEC63", value: 63)
!965 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !894, line: 101, size: 32, align: 32, elements: !966)
!966 = !{!967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986}
!967 = !DIEnumerator(name: "HEVC_MAX_LAYERS", value: 63)
!968 = !DIEnumerator(name: "HEVC_MAX_SUB_LAYERS", value: 7)
!969 = !DIEnumerator(name: "HEVC_MAX_LAYER_SETS", value: 1024)
!970 = !DIEnumerator(name: "HEVC_MAX_VPS_COUNT", value: 16)
!971 = !DIEnumerator(name: "HEVC_MAX_SPS_COUNT", value: 16)
!972 = !DIEnumerator(name: "HEVC_MAX_PPS_COUNT", value: 64)
!973 = !DIEnumerator(name: "HEVC_MAX_DPB_SIZE", value: 16)
!974 = !DIEnumerator(name: "HEVC_MAX_REFS", value: 16)
!975 = !DIEnumerator(name: "HEVC_MAX_SHORT_TERM_REF_PIC_SETS", value: 64)
!976 = !DIEnumerator(name: "HEVC_MAX_LONG_TERM_REF_PICS", value: 32)
!977 = !DIEnumerator(name: "HEVC_MIN_LOG2_CTB_SIZE", value: 4)
!978 = !DIEnumerator(name: "HEVC_MAX_LOG2_CTB_SIZE", value: 6)
!979 = !DIEnumerator(name: "HEVC_MAX_CPB_CNT", value: 32)
!980 = !DIEnumerator(name: "HEVC_MAX_LUMA_PS", value: 35651584)
!981 = !DIEnumerator(name: "HEVC_MAX_WIDTH", value: 16888)
!982 = !DIEnumerator(name: "HEVC_MAX_HEIGHT", value: 16888)
!983 = !DIEnumerator(name: "HEVC_MAX_TILE_ROWS", value: 22)
!984 = !DIEnumerator(name: "HEVC_MAX_TILE_COLUMNS", value: 20)
!985 = !DIEnumerator(name: "HEVC_MAX_SLICE_SEGMENTS", value: 600)
!986 = !DIEnumerator(name: "HEVC_MAX_ENTRY_POINT_OFFSETS", value: 2700)
!987 = !{!988, !989, !990, !1079, !1254, !1277, !1142, !1283, !997}
!988 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!989 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCPPS", file: !992, line: 397, baseType: !993)
!992 = !DIFile(filename: "libavcodec/hevc_ps.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCPPS", file: !992, line: 321, size: 46784, align: 64, elements: !994)
!994 = !{!995, !996, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1058, !1059, !1060, !1061, !1063, !1064, !1065, !1066, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1078}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "sps_id", scope: !993, file: !992, line: 322, baseType: !989, size: 32, align: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "sign_data_hiding_flag", scope: !993, file: !992, line: 324, baseType: !997, size: 8, align: 8, offset: 32)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !998, line: 48, baseType: !999)
!998 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!999 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "cabac_init_present_flag", scope: !993, file: !992, line: 326, baseType: !997, size: 8, align: 8, offset: 40)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_default_active", scope: !993, file: !992, line: 328, baseType: !988, size: 32, align: 32, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_default_active", scope: !993, file: !992, line: 329, baseType: !988, size: 32, align: 32, offset: 96)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !993, file: !992, line: 330, baseType: !988, size: 32, align: 32, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !993, file: !992, line: 332, baseType: !997, size: 8, align: 8, offset: 160)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "transform_skip_enabled_flag", scope: !993, file: !992, line: 333, baseType: !997, size: 8, align: 8, offset: 168)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "cu_qp_delta_enabled_flag", scope: !993, file: !992, line: 335, baseType: !997, size: 8, align: 8, offset: 176)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "diff_cu_qp_delta_depth", scope: !993, file: !992, line: 336, baseType: !988, size: 32, align: 32, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_offset", scope: !993, file: !992, line: 338, baseType: !988, size: 32, align: 32, offset: 224)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_offset", scope: !993, file: !992, line: 339, baseType: !988, size: 32, align: 32, offset: 256)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "pic_slice_level_chroma_qp_offsets_present_flag", scope: !993, file: !992, line: 340, baseType: !997, size: 8, align: 8, offset: 288)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !993, file: !992, line: 341, baseType: !997, size: 8, align: 8, offset: 296)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_flag", scope: !993, file: !992, line: 342, baseType: !997, size: 8, align: 8, offset: 304)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "output_flag_present_flag", scope: !993, file: !992, line: 343, baseType: !997, size: 8, align: 8, offset: 312)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "transquant_bypass_enable_flag", scope: !993, file: !992, line: 344, baseType: !997, size: 8, align: 8, offset: 320)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "dependent_slice_segments_enabled_flag", scope: !993, file: !992, line: 346, baseType: !997, size: 8, align: 8, offset: 328)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "tiles_enabled_flag", scope: !993, file: !992, line: 347, baseType: !997, size: 8, align: 8, offset: 336)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_sync_enabled_flag", scope: !993, file: !992, line: 348, baseType: !997, size: 8, align: 8, offset: 344)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "num_tile_columns", scope: !993, file: !992, line: 350, baseType: !988, size: 32, align: 32, offset: 352)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "num_tile_rows", scope: !993, file: !992, line: 351, baseType: !988, size: 32, align: 32, offset: 384)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "uniform_spacing_flag", scope: !993, file: !992, line: 352, baseType: !997, size: 8, align: 8, offset: 416)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "loop_filter_across_tiles_enabled_flag", scope: !993, file: !992, line: 353, baseType: !997, size: 8, align: 8, offset: 424)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "seq_loop_filter_across_slices_enabled_flag", scope: !993, file: !992, line: 355, baseType: !997, size: 8, align: 8, offset: 432)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !993, file: !992, line: 357, baseType: !997, size: 8, align: 8, offset: 440)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_override_enabled_flag", scope: !993, file: !992, line: 358, baseType: !997, size: 8, align: 8, offset: 448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "disable_dbf", scope: !993, file: !992, line: 359, baseType: !997, size: 8, align: 8, offset: 456)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "beta_offset", scope: !993, file: !992, line: 360, baseType: !988, size: 32, align: 32, offset: 480)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "tc_offset", scope: !993, file: !992, line: 361, baseType: !988, size: 32, align: 32, offset: 512)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list_data_present_flag", scope: !993, file: !992, line: 363, baseType: !997, size: 8, align: 8, offset: 544)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !993, file: !992, line: 364, baseType: !1030, size: 12384, align: 8, offset: 552)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScalingList", file: !992, line: 223, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScalingList", file: !992, line: 218, size: 12384, align: 8, elements: !1032)
!1032 = !{!1033, !1039}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "sl", scope: !1031, file: !992, line: 221, baseType: !1034, size: 12288, align: 8)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !997, size: 12288, align: 8, elements: !1035)
!1035 = !{!1036, !1037, !1038}
!1036 = !DISubrange(count: 4)
!1037 = !DISubrange(count: 6)
!1038 = !DISubrange(count: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "sl_dc", scope: !1031, file: !992, line: 222, baseType: !1040, size: 96, align: 8, offset: 12288)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !997, size: 96, align: 8, elements: !1041)
!1041 = !{!1042, !1037}
!1042 = !DISubrange(count: 2)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "lists_modification_present_flag", scope: !993, file: !992, line: 366, baseType: !997, size: 8, align: 8, offset: 12936)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "log2_parallel_merge_level", scope: !993, file: !992, line: 367, baseType: !988, size: 32, align: 32, offset: 12960)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "num_extra_slice_header_bits", scope: !993, file: !992, line: 368, baseType: !988, size: 32, align: 32, offset: 12992)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "slice_header_extension_present_flag", scope: !993, file: !992, line: 369, baseType: !997, size: 8, align: 8, offset: 13024)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_transform_skip_block_size", scope: !993, file: !992, line: 370, baseType: !997, size: 8, align: 8, offset: 13032)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "pps_range_extensions_flag", scope: !993, file: !992, line: 371, baseType: !997, size: 8, align: 8, offset: 13040)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "cross_component_prediction_enabled_flag", scope: !993, file: !992, line: 372, baseType: !997, size: 8, align: 8, offset: 13048)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset_list_enabled_flag", scope: !993, file: !992, line: 373, baseType: !997, size: 8, align: 8, offset: 13056)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "diff_cu_chroma_qp_offset_depth", scope: !993, file: !992, line: 374, baseType: !997, size: 8, align: 8, offset: 13064)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset_list_len_minus1", scope: !993, file: !992, line: 375, baseType: !997, size: 8, align: 8, offset: 13072)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_offset_list", scope: !993, file: !992, line: 376, baseType: !1054, size: 48, align: 8, offset: 13080)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 48, align: 8, elements: !1057)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !998, line: 36, baseType: !1056)
!1056 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1057 = !{!1037}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_offset_list", scope: !993, file: !992, line: 377, baseType: !1054, size: 48, align: 8, offset: 13128)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "log2_sao_offset_scale_luma", scope: !993, file: !992, line: 378, baseType: !997, size: 8, align: 8, offset: 13176)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "log2_sao_offset_scale_chroma", scope: !993, file: !992, line: 379, baseType: !997, size: 8, align: 8, offset: 13184)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "column_width", scope: !993, file: !992, line: 382, baseType: !1062, size: 64, align: 64, offset: 13248)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "row_height", scope: !993, file: !992, line: 383, baseType: !1062, size: 64, align: 64, offset: 13312)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "col_bd", scope: !993, file: !992, line: 384, baseType: !1062, size: 64, align: 64, offset: 13376)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "row_bd", scope: !993, file: !992, line: 385, baseType: !1062, size: 64, align: 64, offset: 13440)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "col_idxX", scope: !993, file: !992, line: 386, baseType: !1067, size: 64, align: 64, offset: 13504)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ctb_addr_rs_to_ts", scope: !993, file: !992, line: 388, baseType: !1067, size: 64, align: 64, offset: 13568)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ctb_addr_ts_to_rs", scope: !993, file: !992, line: 389, baseType: !1067, size: 64, align: 64, offset: 13632)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "tile_id", scope: !993, file: !992, line: 390, baseType: !1067, size: 64, align: 64, offset: 13696)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "tile_pos_rs", scope: !993, file: !992, line: 391, baseType: !1067, size: 64, align: 64, offset: 13760)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "min_tb_addr_zs", scope: !993, file: !992, line: 392, baseType: !1067, size: 64, align: 64, offset: 13824)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "min_tb_addr_zs_tab", scope: !993, file: !992, line: 393, baseType: !1067, size: 64, align: 64, offset: 13888)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !993, file: !992, line: 395, baseType: !1075, size: 32768, align: 8, offset: 13952)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !997, size: 32768, align: 8, elements: !1076)
!1076 = !{!1077}
!1077 = !DISubrange(count: 4096)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !993, file: !992, line: 396, baseType: !988, size: 32, align: 32, offset: 46720)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSPS", file: !992, line: 319, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSPS", file: !992, line: 225, size: 140544, align: 32, elements: !1082)
!1082 = !{!1083, !1084, !1085, !1086, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1111, !1112, !1156, !1181, !1182, !1183, !1184, !1197, !1198, !1199, !1200, !1204, !1205, !1206, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1250, !1251, !1252, !1253}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "vps_id", scope: !1081, file: !992, line: 226, baseType: !989, size: 32, align: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !1081, file: !992, line: 227, baseType: !988, size: 32, align: 32, offset: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !1081, file: !992, line: 228, baseType: !997, size: 8, align: 8, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "output_window", scope: !1081, file: !992, line: 230, baseType: !1087, size: 128, align: 32, offset: 96)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCWindow", file: !992, line: 130, baseType: !1088)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCWindow", file: !992, line: 125, size: 128, align: 32, elements: !1089)
!1089 = !{!1090, !1091, !1092, !1093}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "left_offset", scope: !1088, file: !992, line: 126, baseType: !989, size: 32, align: 32)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "right_offset", scope: !1088, file: !992, line: 127, baseType: !989, size: 32, align: 32, offset: 32)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "top_offset", scope: !1088, file: !992, line: 128, baseType: !989, size: 32, align: 32, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_offset", scope: !1088, file: !992, line: 129, baseType: !989, size: 32, align: 32, offset: 96)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "pic_conf_win", scope: !1081, file: !992, line: 232, baseType: !1087, size: 128, align: 32, offset: 224)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !1081, file: !992, line: 234, baseType: !988, size: 32, align: 32, offset: 352)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma", scope: !1081, file: !992, line: 235, baseType: !988, size: 32, align: 32, offset: 384)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_shift", scope: !1081, file: !992, line: 236, baseType: !988, size: 32, align: 32, offset: 416)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1081, file: !992, line: 237, baseType: !508, size: 32, align: 32, offset: 448)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_poc_lsb", scope: !1081, file: !992, line: 239, baseType: !989, size: 32, align: 32, offset: 480)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "pcm_enabled_flag", scope: !1081, file: !992, line: 240, baseType: !988, size: 32, align: 32, offset: 512)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "max_sub_layers", scope: !1081, file: !992, line: 242, baseType: !988, size: 32, align: 32, offset: 544)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_layer", scope: !1081, file: !992, line: 247, baseType: !1103, size: 672, align: 32, offset: 576)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1104, size: 672, align: 32, elements: !1109)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1081, file: !992, line: 243, size: 96, align: 32, elements: !1105)
!1105 = !{!1106, !1107, !1108}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_pic_buffering", scope: !1104, file: !992, line: 244, baseType: !988, size: 32, align: 32)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_pics", scope: !1104, file: !992, line: 245, baseType: !988, size: 32, align: 32, offset: 32)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "max_latency_increase", scope: !1104, file: !992, line: 246, baseType: !988, size: 32, align: 32, offset: 64)
!1109 = !{!1110}
!1110 = !DISubrange(count: 7)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id_nesting_flag", scope: !1081, file: !992, line: 248, baseType: !997, size: 8, align: 8, offset: 1248)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !1081, file: !992, line: 250, baseType: !1113, size: 1120, align: 32, offset: 1280)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "VUI", file: !992, line: 173, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VUI", file: !992, line: 132, size: 1120, align: 32, elements: !1115)
!1115 = !{!1116, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "sar", scope: !1114, file: !992, line: 133, baseType: !1117, size: 64, align: 32)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1118, line: 61, baseType: !1119)
!1118 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1118, line: 58, size: 64, align: 32, elements: !1120)
!1120 = !{!1121, !1122}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1119, file: !1118, line: 59, baseType: !988, size: 32, align: 32)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1119, file: !1118, line: 60, baseType: !988, size: 32, align: 32, offset: 32)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !1114, file: !992, line: 135, baseType: !988, size: 32, align: 32, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !1114, file: !992, line: 136, baseType: !988, size: 32, align: 32, offset: 96)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !1114, file: !992, line: 138, baseType: !988, size: 32, align: 32, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !1114, file: !992, line: 139, baseType: !988, size: 32, align: 32, offset: 160)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !1114, file: !992, line: 140, baseType: !988, size: 32, align: 32, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !1114, file: !992, line: 141, baseType: !988, size: 32, align: 32, offset: 224)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !1114, file: !992, line: 142, baseType: !997, size: 8, align: 8, offset: 256)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristic", scope: !1114, file: !992, line: 143, baseType: !997, size: 8, align: 8, offset: 264)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coeffs", scope: !1114, file: !992, line: 144, baseType: !997, size: 8, align: 8, offset: 272)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_loc_info_present_flag", scope: !1114, file: !992, line: 146, baseType: !988, size: 32, align: 32, offset: 288)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !1114, file: !992, line: 147, baseType: !988, size: 32, align: 32, offset: 320)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !1114, file: !992, line: 148, baseType: !988, size: 32, align: 32, offset: 352)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "neutra_chroma_indication_flag", scope: !1114, file: !992, line: 149, baseType: !988, size: 32, align: 32, offset: 384)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "field_seq_flag", scope: !1114, file: !992, line: 151, baseType: !988, size: 32, align: 32, offset: 416)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "frame_field_info_present_flag", scope: !1114, file: !992, line: 152, baseType: !988, size: 32, align: 32, offset: 448)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "default_display_window_flag", scope: !1114, file: !992, line: 154, baseType: !988, size: 32, align: 32, offset: 480)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "def_disp_win", scope: !1114, file: !992, line: 155, baseType: !1087, size: 128, align: 32, offset: 512)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "vui_timing_info_present_flag", scope: !1114, file: !992, line: 157, baseType: !988, size: 32, align: 32, offset: 640)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "vui_num_units_in_tick", scope: !1114, file: !992, line: 158, baseType: !1142, size: 32, align: 32, offset: 672)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !998, line: 51, baseType: !989)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "vui_time_scale", scope: !1114, file: !992, line: 159, baseType: !1142, size: 32, align: 32, offset: 704)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "vui_poc_proportional_to_timing_flag", scope: !1114, file: !992, line: 160, baseType: !988, size: 32, align: 32, offset: 736)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "vui_num_ticks_poc_diff_one_minus1", scope: !1114, file: !992, line: 161, baseType: !988, size: 32, align: 32, offset: 768)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "vui_hrd_parameters_present_flag", scope: !1114, file: !992, line: 162, baseType: !988, size: 32, align: 32, offset: 800)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !1114, file: !992, line: 164, baseType: !988, size: 32, align: 32, offset: 832)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "tiles_fixed_structure_flag", scope: !1114, file: !992, line: 165, baseType: !988, size: 32, align: 32, offset: 864)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !1114, file: !992, line: 166, baseType: !988, size: 32, align: 32, offset: 896)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "restricted_ref_pic_lists_flag", scope: !1114, file: !992, line: 167, baseType: !988, size: 32, align: 32, offset: 928)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "min_spatial_segmentation_idc", scope: !1114, file: !992, line: 168, baseType: !988, size: 32, align: 32, offset: 960)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !1114, file: !992, line: 169, baseType: !988, size: 32, align: 32, offset: 992)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_min_cu_denom", scope: !1114, file: !992, line: 170, baseType: !988, size: 32, align: 32, offset: 1024)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !1114, file: !992, line: 171, baseType: !988, size: 32, align: 32, offset: 1056)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !1114, file: !992, line: 172, baseType: !988, size: 32, align: 32, offset: 1088)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "ptl", scope: !1081, file: !992, line: 251, baseType: !1157, size: 2672, align: 8, offset: 2400)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PTL", file: !992, line: 193, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PTL", file: !992, line: 187, size: 2672, align: 8, elements: !1159)
!1159 = !{!1160, !1176, !1178, !1180}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "general_ptl", scope: !1158, file: !992, line: 188, baseType: !1161, size: 320, align: 8)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PTLCommon", file: !992, line: 185, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PTLCommon", file: !992, line: 175, size: 320, align: 8, elements: !1163)
!1163 = !{!1164, !1165, !1166, !1167, !1171, !1172, !1173, !1174, !1175}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "profile_space", scope: !1162, file: !992, line: 176, baseType: !997, size: 8, align: 8)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "tier_flag", scope: !1162, file: !992, line: 177, baseType: !997, size: 8, align: 8, offset: 8)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !1162, file: !992, line: 178, baseType: !997, size: 8, align: 8, offset: 16)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "profile_compatibility_flag", scope: !1162, file: !992, line: 179, baseType: !1168, size: 256, align: 8, offset: 24)
!1168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !997, size: 256, align: 8, elements: !1169)
!1169 = !{!1170}
!1170 = !DISubrange(count: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !1162, file: !992, line: 180, baseType: !997, size: 8, align: 8, offset: 280)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_source_flag", scope: !1162, file: !992, line: 181, baseType: !997, size: 8, align: 8, offset: 288)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_source_flag", scope: !1162, file: !992, line: 182, baseType: !997, size: 8, align: 8, offset: 296)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "non_packed_constraint_flag", scope: !1162, file: !992, line: 183, baseType: !997, size: 8, align: 8, offset: 304)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "frame_only_constraint_flag", scope: !1162, file: !992, line: 184, baseType: !997, size: 8, align: 8, offset: 312)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_ptl", scope: !1158, file: !992, line: 189, baseType: !1177, size: 2240, align: 8, offset: 320)
!1177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1161, size: 2240, align: 8, elements: !1109)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_profile_present_flag", scope: !1158, file: !992, line: 191, baseType: !1179, size: 56, align: 8, offset: 2560)
!1179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !997, size: 56, align: 8, elements: !1109)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_level_present_flag", scope: !1158, file: !992, line: 192, baseType: !1179, size: 56, align: 8, offset: 2616)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list_enable_flag", scope: !1081, file: !992, line: 253, baseType: !997, size: 8, align: 8, offset: 5072)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !1081, file: !992, line: 254, baseType: !1030, size: 12384, align: 8, offset: 5080)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_st_rps", scope: !1081, file: !992, line: 256, baseType: !989, size: 32, align: 32, offset: 17472)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "st_rps", scope: !1081, file: !992, line: 257, baseType: !1185, size: 88064, align: 32, offset: 17504)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1186, size: 88064, align: 32, elements: !1196)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "ShortTermRPS", file: !992, line: 40, baseType: !1187)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ShortTermRPS", file: !992, line: 34, size: 1376, align: 32, elements: !1188)
!1188 = !{!1189, !1190, !1191, !1192, !1195}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "num_negative_pics", scope: !1187, file: !992, line: 35, baseType: !989, size: 32, align: 32)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "num_delta_pocs", scope: !1187, file: !992, line: 36, baseType: !988, size: 32, align: 32, offset: 32)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "rps_idx_num_delta_pocs", scope: !1187, file: !992, line: 37, baseType: !988, size: 32, align: 32, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "delta_poc", scope: !1187, file: !992, line: 38, baseType: !1193, size: 1024, align: 32, offset: 96)
!1193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1194, size: 1024, align: 32, elements: !1169)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !998, line: 38, baseType: !988)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1187, file: !992, line: 39, baseType: !1168, size: 256, align: 8, offset: 1120)
!1196 = !{!1038}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "amp_enabled_flag", scope: !1081, file: !992, line: 259, baseType: !997, size: 8, align: 8, offset: 105568)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "sao_enabled", scope: !1081, file: !992, line: 260, baseType: !997, size: 8, align: 8, offset: 105576)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_ref_pics_present_flag", scope: !1081, file: !992, line: 262, baseType: !997, size: 8, align: 8, offset: 105584)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "lt_ref_pic_poc_lsb_sps", scope: !1081, file: !992, line: 263, baseType: !1201, size: 512, align: 16, offset: 105600)
!1201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1202, size: 512, align: 16, elements: !1169)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !998, line: 49, baseType: !1203)
!1203 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "used_by_curr_pic_lt_sps_flag", scope: !1081, file: !992, line: 264, baseType: !1168, size: 256, align: 8, offset: 106112)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "num_long_term_ref_pics_sps", scope: !1081, file: !992, line: 265, baseType: !997, size: 8, align: 8, offset: 106368)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pcm", scope: !1081, file: !992, line: 273, baseType: !1207, size: 128, align: 32, offset: 106400)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1081, file: !992, line: 267, size: 128, align: 32, elements: !1208)
!1208 = !{!1209, !1210, !1211, !1212, !1213}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !1207, file: !992, line: 268, baseType: !997, size: 8, align: 8)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma", scope: !1207, file: !992, line: 269, baseType: !997, size: 8, align: 8, offset: 8)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "log2_min_pcm_cb_size", scope: !1207, file: !992, line: 270, baseType: !989, size: 32, align: 32, offset: 32)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pcm_cb_size", scope: !1207, file: !992, line: 271, baseType: !989, size: 32, align: 32, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "loop_filter_disable_flag", scope: !1207, file: !992, line: 272, baseType: !997, size: 8, align: 8, offset: 96)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "sps_temporal_mvp_enabled_flag", scope: !1081, file: !992, line: 274, baseType: !997, size: 8, align: 8, offset: 106528)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "sps_strong_intra_smoothing_enable_flag", scope: !1081, file: !992, line: 275, baseType: !997, size: 8, align: 8, offset: 106536)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "log2_min_cb_size", scope: !1081, file: !992, line: 277, baseType: !989, size: 32, align: 32, offset: 106560)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "log2_diff_max_min_coding_block_size", scope: !1081, file: !992, line: 278, baseType: !989, size: 32, align: 32, offset: 106592)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "log2_min_tb_size", scope: !1081, file: !992, line: 279, baseType: !989, size: 32, align: 32, offset: 106624)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_trafo_size", scope: !1081, file: !992, line: 280, baseType: !989, size: 32, align: 32, offset: 106656)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "log2_ctb_size", scope: !1081, file: !992, line: 281, baseType: !989, size: 32, align: 32, offset: 106688)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "log2_min_pu_size", scope: !1081, file: !992, line: 282, baseType: !989, size: 32, align: 32, offset: 106720)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "max_transform_hierarchy_depth_inter", scope: !1081, file: !992, line: 284, baseType: !988, size: 32, align: 32, offset: 106752)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "max_transform_hierarchy_depth_intra", scope: !1081, file: !992, line: 285, baseType: !988, size: 32, align: 32, offset: 106784)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "sps_range_extension_flag", scope: !1081, file: !992, line: 287, baseType: !988, size: 32, align: 32, offset: 106816)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "transform_skip_rotation_enabled_flag", scope: !1081, file: !992, line: 288, baseType: !988, size: 32, align: 32, offset: 106848)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "transform_skip_context_enabled_flag", scope: !1081, file: !992, line: 289, baseType: !988, size: 32, align: 32, offset: 106880)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_rdpcm_enabled_flag", scope: !1081, file: !992, line: 290, baseType: !988, size: 32, align: 32, offset: 106912)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_rdpcm_enabled_flag", scope: !1081, file: !992, line: 291, baseType: !988, size: 32, align: 32, offset: 106944)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "extended_precision_processing_flag", scope: !1081, file: !992, line: 292, baseType: !988, size: 32, align: 32, offset: 106976)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "intra_smoothing_disabled_flag", scope: !1081, file: !992, line: 293, baseType: !988, size: 32, align: 32, offset: 107008)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "high_precision_offsets_enabled_flag", scope: !1081, file: !992, line: 294, baseType: !988, size: 32, align: 32, offset: 107040)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "persistent_rice_adaptation_enabled_flag", scope: !1081, file: !992, line: 295, baseType: !988, size: 32, align: 32, offset: 107072)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "cabac_bypass_alignment_enabled_flag", scope: !1081, file: !992, line: 296, baseType: !988, size: 32, align: 32, offset: 107104)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1081, file: !992, line: 299, baseType: !988, size: 32, align: 32, offset: 107136)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1081, file: !992, line: 300, baseType: !988, size: 32, align: 32, offset: 107168)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "ctb_width", scope: !1081, file: !992, line: 301, baseType: !988, size: 32, align: 32, offset: 107200)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "ctb_height", scope: !1081, file: !992, line: 302, baseType: !988, size: 32, align: 32, offset: 107232)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "ctb_size", scope: !1081, file: !992, line: 303, baseType: !988, size: 32, align: 32, offset: 107264)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "min_cb_width", scope: !1081, file: !992, line: 304, baseType: !988, size: 32, align: 32, offset: 107296)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "min_cb_height", scope: !1081, file: !992, line: 305, baseType: !988, size: 32, align: 32, offset: 107328)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "min_tb_width", scope: !1081, file: !992, line: 306, baseType: !988, size: 32, align: 32, offset: 107360)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "min_tb_height", scope: !1081, file: !992, line: 307, baseType: !988, size: 32, align: 32, offset: 107392)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "min_pu_width", scope: !1081, file: !992, line: 308, baseType: !988, size: 32, align: 32, offset: 107424)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "min_pu_height", scope: !1081, file: !992, line: 309, baseType: !988, size: 32, align: 32, offset: 107456)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "tb_mask", scope: !1081, file: !992, line: 310, baseType: !988, size: 32, align: 32, offset: 107488)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "hshift", scope: !1081, file: !992, line: 312, baseType: !1247, size: 96, align: 32, offset: 107520)
!1247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !988, size: 96, align: 32, elements: !1248)
!1248 = !{!1249}
!1249 = !DISubrange(count: 3)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "vshift", scope: !1081, file: !992, line: 313, baseType: !1247, size: 96, align: 32, offset: 107616)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "qp_bd_offset", scope: !1081, file: !992, line: 315, baseType: !988, size: 32, align: 32, offset: 107712)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1081, file: !992, line: 317, baseType: !1075, size: 32768, align: 8, offset: 107744)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !1081, file: !992, line: 318, baseType: !988, size: 32, align: 32, offset: 140512)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCVPS", file: !992, line: 216, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCVPS", file: !992, line: 195, size: 36544, align: 32, elements: !1257)
!1257 = !{!1258, !1259, !1260, !1261, !1262, !1263, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "vps_temporal_id_nesting_flag", scope: !1256, file: !992, line: 196, baseType: !997, size: 8, align: 8)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "vps_max_layers", scope: !1256, file: !992, line: 197, baseType: !988, size: 32, align: 32, offset: 32)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "vps_max_sub_layers", scope: !1256, file: !992, line: 198, baseType: !988, size: 32, align: 32, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "ptl", scope: !1256, file: !992, line: 200, baseType: !1157, size: 2672, align: 8, offset: 96)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "vps_sub_layer_ordering_info_present_flag", scope: !1256, file: !992, line: 201, baseType: !988, size: 32, align: 32, offset: 2784)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "vps_max_dec_pic_buffering", scope: !1256, file: !992, line: 202, baseType: !1264, size: 224, align: 32, offset: 2816)
!1264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !989, size: 224, align: 32, elements: !1109)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "vps_num_reorder_pics", scope: !1256, file: !992, line: 203, baseType: !1264, size: 224, align: 32, offset: 3040)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "vps_max_latency_increase", scope: !1256, file: !992, line: 204, baseType: !1264, size: 224, align: 32, offset: 3264)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "vps_max_layer_id", scope: !1256, file: !992, line: 205, baseType: !988, size: 32, align: 32, offset: 3488)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "vps_num_layer_sets", scope: !1256, file: !992, line: 206, baseType: !988, size: 32, align: 32, offset: 3520)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "vps_timing_info_present_flag", scope: !1256, file: !992, line: 207, baseType: !997, size: 8, align: 8, offset: 3552)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "vps_num_units_in_tick", scope: !1256, file: !992, line: 208, baseType: !1142, size: 32, align: 32, offset: 3584)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "vps_time_scale", scope: !1256, file: !992, line: 209, baseType: !1142, size: 32, align: 32, offset: 3616)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "vps_poc_proportional_to_timing_flag", scope: !1256, file: !992, line: 210, baseType: !997, size: 8, align: 8, offset: 3648)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "vps_num_ticks_poc_diff_one", scope: !1256, file: !992, line: 211, baseType: !988, size: 32, align: 32, offset: 3680)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "vps_num_hrd_parameters", scope: !1256, file: !992, line: 212, baseType: !988, size: 32, align: 32, offset: 3712)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1256, file: !992, line: 214, baseType: !1075, size: 32768, align: 8, offset: 3744)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !1256, file: !992, line: 215, baseType: !988, size: 32, align: 32, offset: 36512)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1279)
!1279 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1280, line: 221, size: 32, align: 8, elements: !1281)
!1280 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1281 = !{!1282}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1279, file: !1280, line: 221, baseType: !1142, size: 32, align: 32)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1284 = !{!1285}
!1285 = distinct !DIGlobalVariable(name: "ff_hevc_parser", scope: !0, file: !1286, line: 372, type: !1287, isLocal: false, isDefinition: true, variable: { [5 x i32], i32, i32 (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecParserContext*, %struct.AVCodecContext*, i8**, i32*, i8*, i32)*, void (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecContext*, i8*, i32)*, %struct.AVCodecParser* }* @ff_hevc_parser)
!1286 = !DIFile(filename: "libavcodec/hevc_parser.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParser", file: !4, line: 5272, baseType: !1288)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParser", file: !4, line: 5259, size: 512, align: 64, elements: !1289)
!1289 = !{!1290, !1294, !1295, !1344, !2059, !2063, !2067}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1288, file: !4, line: 5260, baseType: !1291, size: 160, align: 32)
!1291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !988, size: 160, align: 32, elements: !1292)
!1292 = !{!1293}
!1293 = !DISubrange(count: 5)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1288, file: !4, line: 5261, baseType: !988, size: 32, align: 32, offset: 160)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "parser_init", scope: !1288, file: !4, line: 5262, baseType: !1296, size: 64, align: 64, offset: 192)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!988, !1299}
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParserContext", file: !4, line: 5257, baseType: !1301)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParserContext", file: !4, line: 5092, size: 2816, align: 64, elements: !1302)
!1302 = !{!1303, !1304, !1306, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1301, file: !4, line: 5093, baseType: !1283, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !1301, file: !4, line: 5094, baseType: !1305, size: 64, align: 64, offset: 64)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !1301, file: !4, line: 5095, baseType: !1307, size: 64, align: 64, offset: 128)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !998, line: 40, baseType: !1308)
!1308 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "cur_offset", scope: !1301, file: !4, line: 5096, baseType: !1307, size: 64, align: 64, offset: 192)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame_offset", scope: !1301, file: !4, line: 5098, baseType: !1307, size: 64, align: 64, offset: 256)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1301, file: !4, line: 5100, baseType: !988, size: 32, align: 32, offset: 320)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1301, file: !4, line: 5110, baseType: !988, size: 32, align: 32, offset: 352)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1301, file: !4, line: 5111, baseType: !1307, size: 64, align: 64, offset: 384)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1301, file: !4, line: 5112, baseType: !1307, size: 64, align: 64, offset: 448)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "last_pts", scope: !1301, file: !4, line: 5115, baseType: !1307, size: 64, align: 64, offset: 512)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "last_dts", scope: !1301, file: !4, line: 5116, baseType: !1307, size: 64, align: 64, offset: 576)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "fetch_timestamp", scope: !1301, file: !4, line: 5117, baseType: !988, size: 32, align: 32, offset: 640)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_start_index", scope: !1301, file: !4, line: 5120, baseType: !988, size: 32, align: 32, offset: 672)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_offset", scope: !1301, file: !4, line: 5121, baseType: !1320, size: 256, align: 64, offset: 704)
!1320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1307, size: 256, align: 64, elements: !1321)
!1321 = !{!1036}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pts", scope: !1301, file: !4, line: 5122, baseType: !1320, size: 256, align: 64, offset: 960)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_dts", scope: !1301, file: !4, line: 5123, baseType: !1320, size: 256, align: 64, offset: 1216)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1301, file: !4, line: 5125, baseType: !988, size: 32, align: 32, offset: 1472)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1301, file: !4, line: 5132, baseType: !1307, size: 64, align: 64, offset: 1536)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_end", scope: !1301, file: !4, line: 5133, baseType: !1320, size: 256, align: 64, offset: 1600)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1301, file: !4, line: 5141, baseType: !988, size: 32, align: 32, offset: 1856)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1301, file: !4, line: 5148, baseType: !1307, size: 64, align: 64, offset: 1920)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "dts_sync_point", scope: !1301, file: !4, line: 5161, baseType: !988, size: 32, align: 32, offset: 1984)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "dts_ref_dts_delta", scope: !1301, file: !4, line: 5176, baseType: !988, size: 32, align: 32, offset: 2016)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "pts_dts_delta", scope: !1301, file: !4, line: 5190, baseType: !988, size: 32, align: 32, offset: 2048)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pos", scope: !1301, file: !4, line: 5197, baseType: !1320, size: 256, align: 64, offset: 2112)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1301, file: !4, line: 5202, baseType: !1307, size: 64, align: 64, offset: 2368)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !1301, file: !4, line: 5207, baseType: !1307, size: 64, align: 64, offset: 2432)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1301, file: !4, line: 5214, baseType: !988, size: 32, align: 32, offset: 2496)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1301, file: !4, line: 5216, baseType: !3, size: 32, align: 32, offset: 2528)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "picture_structure", scope: !1301, file: !4, line: 5226, baseType: !12, size: 32, align: 32, offset: 2560)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "output_picture_number", scope: !1301, file: !4, line: 5234, baseType: !988, size: 32, align: 32, offset: 2592)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1301, file: !4, line: 5239, baseType: !988, size: 32, align: 32, offset: 2624)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1301, file: !4, line: 5240, baseType: !988, size: 32, align: 32, offset: 2656)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1301, file: !4, line: 5245, baseType: !988, size: 32, align: 32, offset: 2688)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1301, file: !4, line: 5246, baseType: !988, size: 32, align: 32, offset: 2720)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1301, file: !4, line: 5256, baseType: !988, size: 32, align: 32, offset: 2752)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "parser_parse", scope: !1288, file: !4, line: 5265, baseType: !1345, size: 64, align: 64, offset: 256)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DISubroutineType(types: !1347)
!1347 = !{!988, !1299, !1348, !2058, !1067, !1457, !988}
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1350)
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1351)
!1351 = !{!1352, !1396, !1397, !1398, !1656, !1657, !1658, !1659, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1812, !1816, !1817, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1996, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1350, file: !4, line: 1561, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1355)
!1355 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !19, line: 143, baseType: !1356)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !19, line: 67, size: 640, align: 64, elements: !1357)
!1357 = !{!1358, !1362, !1366, !1370, !1371, !1372, !1373, !1377, !1383, !1385, !1389}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1356, file: !19, line: 72, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1361)
!1361 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1356, file: !19, line: 78, baseType: !1363, size: 64, align: 64, offset: 64)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DISubroutineType(types: !1365)
!1365 = !{!1359, !1283}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1356, file: !19, line: 85, baseType: !1367, size: 64, align: 64, offset: 128)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1369)
!1369 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !19, line: 85, flags: DIFlagFwdDecl)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1356, file: !19, line: 93, baseType: !988, size: 32, align: 32, offset: 192)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1356, file: !19, line: 99, baseType: !988, size: 32, align: 32, offset: 224)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1356, file: !19, line: 108, baseType: !988, size: 32, align: 32, offset: 256)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1356, file: !19, line: 113, baseType: !1374, size: 64, align: 64, offset: 320)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DISubroutineType(types: !1376)
!1376 = !{!1283, !1283, !1283}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1356, file: !19, line: 123, baseType: !1378, size: 64, align: 64, offset: 384)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DISubroutineType(types: !1380)
!1380 = !{!1381, !1381}
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1356)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1356, file: !19, line: 130, baseType: !1384, size: 32, align: 32, offset: 448)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !19, line: 48, baseType: !18)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1356, file: !19, line: 136, baseType: !1386, size: 64, align: 64, offset: 512)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DISubroutineType(types: !1388)
!1388 = !{!1384, !1283}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1356, file: !19, line: 142, baseType: !1390, size: 64, align: 64, offset: 576)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DISubroutineType(types: !1392)
!1392 = !{!988, !1393, !1283, !1359, !988}
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !19, line: 60, flags: DIFlagFwdDecl)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1350, file: !4, line: 1562, baseType: !988, size: 32, align: 32, offset: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1350, file: !4, line: 1564, baseType: !39, size: 32, align: 32, offset: 96)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1350, file: !4, line: 1565, baseType: !1399, size: 64, align: 64, offset: 128)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1401)
!1401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1402)
!1402 = !{!1403, !1404, !1405, !1406, !1407, !1408, !1411, !1414, !1417, !1420, !1425, !1426, !1427, !1435, !1436, !1437, !1439, !1443, !1449, !1460, !1464, !1465, !1509, !1627, !1631, !1632, !1636, !1640, !1645, !1649, !1650, !1651}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1401, file: !4, line: 3475, baseType: !1359, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1401, file: !4, line: 3480, baseType: !1359, size: 64, align: 64, offset: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1401, file: !4, line: 3481, baseType: !39, size: 32, align: 32, offset: 128)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1401, file: !4, line: 3482, baseType: !49, size: 32, align: 32, offset: 160)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1401, file: !4, line: 3487, baseType: !988, size: 32, align: 32, offset: 192)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1401, file: !4, line: 3488, baseType: !1409, size: 64, align: 64, offset: 256)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1117)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1401, file: !4, line: 3489, baseType: !1412, size: 64, align: 64, offset: 320)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1401, file: !4, line: 3490, baseType: !1415, size: 64, align: 64, offset: 384)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1401, file: !4, line: 3491, baseType: !1418, size: 64, align: 64, offset: 448)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1401, file: !4, line: 3492, baseType: !1421, size: 64, align: 64, offset: 512)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1423)
!1423 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !998, line: 55, baseType: !1424)
!1424 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1401, file: !4, line: 3493, baseType: !997, size: 8, align: 8, offset: 576)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1401, file: !4, line: 3494, baseType: !1353, size: 64, align: 64, offset: 640)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1401, file: !4, line: 3495, baseType: !1428, size: 64, align: 64, offset: 704)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1430)
!1430 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1431)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1432)
!1432 = !{!1433, !1434}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1431, file: !4, line: 3402, baseType: !988, size: 32, align: 32)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1431, file: !4, line: 3403, baseType: !1359, size: 64, align: 64, offset: 64)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1401, file: !4, line: 3507, baseType: !1359, size: 64, align: 64, offset: 768)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1401, file: !4, line: 3516, baseType: !988, size: 32, align: 32, offset: 832)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1401, file: !4, line: 3517, baseType: !1438, size: 64, align: 64, offset: 896)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1401, file: !4, line: 3527, baseType: !1440, size: 64, align: 64, offset: 960)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DISubroutineType(types: !1442)
!1442 = !{!988, !1348}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1401, file: !4, line: 3535, baseType: !1444, size: 64, align: 64, offset: 1024)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DISubroutineType(types: !1446)
!1446 = !{!988, !1348, !1447}
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1349)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1401, file: !4, line: 3541, baseType: !1450, size: 64, align: 64, offset: 1088)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64, align: 64)
!1451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1452)
!1452 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1453)
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1454, line: 223, size: 128, align: 64, elements: !1455)
!1454 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1455 = !{!1456, !1459}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1453, file: !1454, line: 224, baseType: !1457, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1453, file: !1454, line: 225, baseType: !1457, size: 64, align: 64, offset: 64)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1401, file: !4, line: 3549, baseType: !1461, size: 64, align: 64, offset: 1152)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{null, !1438}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1401, file: !4, line: 3551, baseType: !1440, size: 64, align: 64, offset: 1216)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1401, file: !4, line: 3552, baseType: !1466, size: 64, align: 64, offset: 1280)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DISubroutineType(types: !1468)
!1468 = !{!988, !1348, !1469, !988, !1470}
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1472)
!1472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1473)
!1473 = !{!1474, !1475, !1476, !1477, !1478, !1508}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1472, file: !4, line: 3921, baseType: !1202, size: 16, align: 16)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1472, file: !4, line: 3922, baseType: !1142, size: 32, align: 32, offset: 32)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1472, file: !4, line: 3923, baseType: !1142, size: 32, align: 32, offset: 64)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1472, file: !4, line: 3924, baseType: !989, size: 32, align: 32, offset: 96)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1472, file: !4, line: 3925, baseType: !1479, size: 64, align: 64, offset: 128)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1482)
!1482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1483)
!1483 = !{!1484, !1485, !1486, !1487, !1488, !1489, !1499, !1501, !1503, !1504, !1506, !1507}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1482, file: !4, line: 3886, baseType: !988, size: 32, align: 32)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1482, file: !4, line: 3887, baseType: !988, size: 32, align: 32, offset: 32)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1482, file: !4, line: 3888, baseType: !988, size: 32, align: 32, offset: 64)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1482, file: !4, line: 3889, baseType: !988, size: 32, align: 32, offset: 96)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1482, file: !4, line: 3890, baseType: !988, size: 32, align: 32, offset: 128)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1482, file: !4, line: 3897, baseType: !1490, size: 768, align: 64, offset: 192)
!1490 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1491)
!1491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1492)
!1492 = !{!1493, !1497}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1491, file: !4, line: 3855, baseType: !1494, size: 512, align: 64)
!1494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1469, size: 512, align: 64, elements: !1495)
!1495 = !{!1496}
!1496 = !DISubrange(count: 8)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1491, file: !4, line: 3857, baseType: !1498, size: 256, align: 32, offset: 512)
!1498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !988, size: 256, align: 32, elements: !1495)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1482, file: !4, line: 3903, baseType: !1500, size: 256, align: 64, offset: 960)
!1500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1469, size: 256, align: 64, elements: !1321)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1482, file: !4, line: 3904, baseType: !1502, size: 128, align: 32, offset: 1216)
!1502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !988, size: 128, align: 32, elements: !1321)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1482, file: !4, line: 3906, baseType: !725, size: 32, align: 32, offset: 1344)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1482, file: !4, line: 3908, baseType: !1505, size: 64, align: 64, offset: 1408)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1482, file: !4, line: 3915, baseType: !1505, size: 64, align: 64, offset: 1472)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1482, file: !4, line: 3917, baseType: !988, size: 32, align: 32, offset: 1536)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1472, file: !4, line: 3926, baseType: !1307, size: 64, align: 64, offset: 192)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1401, file: !4, line: 3564, baseType: !1510, size: 64, align: 64, offset: 1344)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DISubroutineType(types: !1512)
!1512 = !{!988, !1348, !1513, !1547, !1067}
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1515)
!1515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1516)
!1516 = !{!1517, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1543, !1544, !1545, !1546}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1515, file: !4, line: 1451, baseType: !1518, size: 64, align: 64)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1520, line: 94, baseType: !1521)
!1520 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1520, line: 81, size: 192, align: 64, elements: !1522)
!1522 = !{!1523, !1527, !1528}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1521, file: !1520, line: 82, baseType: !1524, size: 64, align: 64)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1520, line: 73, baseType: !1526)
!1526 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1520, line: 73, flags: DIFlagFwdDecl)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1521, file: !1520, line: 89, baseType: !1469, size: 64, align: 64, offset: 64)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1521, file: !1520, line: 93, baseType: !988, size: 32, align: 32, offset: 128)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1515, file: !4, line: 1461, baseType: !1307, size: 64, align: 64, offset: 64)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1515, file: !4, line: 1467, baseType: !1307, size: 64, align: 64, offset: 128)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1515, file: !4, line: 1468, baseType: !1469, size: 64, align: 64, offset: 192)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1515, file: !4, line: 1469, baseType: !988, size: 32, align: 32, offset: 256)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1515, file: !4, line: 1470, baseType: !988, size: 32, align: 32, offset: 288)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1515, file: !4, line: 1474, baseType: !988, size: 32, align: 32, offset: 320)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1515, file: !4, line: 1479, baseType: !1536, size: 64, align: 64, offset: 384)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1538)
!1538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1539)
!1539 = !{!1540, !1541, !1542}
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1538, file: !4, line: 1412, baseType: !1469, size: 64, align: 64)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1538, file: !4, line: 1413, baseType: !988, size: 32, align: 32, offset: 64)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1538, file: !4, line: 1414, baseType: !731, size: 32, align: 32, offset: 96)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1515, file: !4, line: 1480, baseType: !988, size: 32, align: 32, offset: 448)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1515, file: !4, line: 1486, baseType: !1307, size: 64, align: 64, offset: 512)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1515, file: !4, line: 1488, baseType: !1307, size: 64, align: 64, offset: 576)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1515, file: !4, line: 1497, baseType: !1307, size: 64, align: 64, offset: 640)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1549)
!1549 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !772, line: 646, baseType: !1550)
!1550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !772, line: 268, size: 4288, align: 64, elements: !1551)
!1551 = !{!1552, !1553, !1554, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1581, !1583, !1584, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1615, !1616, !1617, !1618, !1619, !1620, !1623, !1624, !1625, !1626}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1550, file: !772, line: 282, baseType: !1494, size: 512, align: 64)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1550, file: !772, line: 299, baseType: !1498, size: 256, align: 32, offset: 512)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1550, file: !772, line: 315, baseType: !1555, size: 64, align: 64, offset: 768)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1550, file: !772, line: 326, baseType: !988, size: 32, align: 32, offset: 832)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1550, file: !772, line: 326, baseType: !988, size: 32, align: 32, offset: 864)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1550, file: !772, line: 334, baseType: !988, size: 32, align: 32, offset: 896)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1550, file: !772, line: 341, baseType: !988, size: 32, align: 32, offset: 928)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1550, file: !772, line: 346, baseType: !988, size: 32, align: 32, offset: 960)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1550, file: !772, line: 351, baseType: !761, size: 32, align: 32, offset: 992)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1550, file: !772, line: 356, baseType: !1117, size: 64, align: 32, offset: 1024)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1550, file: !772, line: 361, baseType: !1307, size: 64, align: 64, offset: 1088)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1550, file: !772, line: 369, baseType: !1307, size: 64, align: 64, offset: 1152)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1550, file: !772, line: 377, baseType: !1307, size: 64, align: 64, offset: 1216)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1550, file: !772, line: 382, baseType: !988, size: 32, align: 32, offset: 1280)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1550, file: !772, line: 386, baseType: !988, size: 32, align: 32, offset: 1312)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1550, file: !772, line: 391, baseType: !988, size: 32, align: 32, offset: 1344)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1550, file: !772, line: 396, baseType: !1283, size: 64, align: 64, offset: 1408)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1550, file: !772, line: 403, baseType: !1571, size: 512, align: 64, offset: 1472)
!1571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1423, size: 512, align: 64, elements: !1495)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1550, file: !772, line: 410, baseType: !988, size: 32, align: 32, offset: 1984)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1550, file: !772, line: 415, baseType: !988, size: 32, align: 32, offset: 2016)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1550, file: !772, line: 420, baseType: !988, size: 32, align: 32, offset: 2048)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1550, file: !772, line: 425, baseType: !988, size: 32, align: 32, offset: 2080)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1550, file: !772, line: 435, baseType: !1307, size: 64, align: 64, offset: 2112)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1550, file: !772, line: 440, baseType: !988, size: 32, align: 32, offset: 2176)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1550, file: !772, line: 445, baseType: !1423, size: 64, align: 64, offset: 2240)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1550, file: !772, line: 459, baseType: !1580, size: 512, align: 64, offset: 2304)
!1580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1518, size: 512, align: 64, elements: !1495)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1550, file: !772, line: 473, baseType: !1582, size: 64, align: 64, offset: 2816)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1550, file: !772, line: 477, baseType: !988, size: 32, align: 32, offset: 2880)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1550, file: !772, line: 479, baseType: !1585, size: 64, align: 64, offset: 2944)
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !772, line: 207, baseType: !1588)
!1588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !772, line: 201, size: 320, align: 64, elements: !1589)
!1589 = !{!1590, !1591, !1592, !1593, !1598}
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1588, file: !772, line: 202, baseType: !771, size: 32, align: 32)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1588, file: !772, line: 203, baseType: !1469, size: 64, align: 64, offset: 64)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1588, file: !772, line: 204, baseType: !988, size: 32, align: 32, offset: 128)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1588, file: !772, line: 205, baseType: !1594, size: 64, align: 64, offset: 192)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1596, line: 86, baseType: !1597)
!1596 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1597 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1596, line: 86, flags: DIFlagFwdDecl)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1588, file: !772, line: 206, baseType: !1518, size: 64, align: 64, offset: 256)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1550, file: !772, line: 480, baseType: !988, size: 32, align: 32, offset: 3008)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1550, file: !772, line: 505, baseType: !988, size: 32, align: 32, offset: 3040)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1550, file: !772, line: 512, baseType: !795, size: 32, align: 32, offset: 3072)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1550, file: !772, line: 514, baseType: !801, size: 32, align: 32, offset: 3104)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1550, file: !772, line: 516, baseType: !819, size: 32, align: 32, offset: 3136)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1550, file: !772, line: 523, baseType: !843, size: 32, align: 32, offset: 3168)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1550, file: !772, line: 525, baseType: !862, size: 32, align: 32, offset: 3200)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1550, file: !772, line: 532, baseType: !1307, size: 64, align: 64, offset: 3264)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1550, file: !772, line: 539, baseType: !1307, size: 64, align: 64, offset: 3328)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1550, file: !772, line: 547, baseType: !1307, size: 64, align: 64, offset: 3392)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1550, file: !772, line: 554, baseType: !1594, size: 64, align: 64, offset: 3456)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1550, file: !772, line: 563, baseType: !988, size: 32, align: 32, offset: 3520)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1550, file: !772, line: 572, baseType: !988, size: 32, align: 32, offset: 3552)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1550, file: !772, line: 581, baseType: !988, size: 32, align: 32, offset: 3584)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1550, file: !772, line: 588, baseType: !1614, size: 64, align: 64, offset: 3648)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1550, file: !772, line: 593, baseType: !988, size: 32, align: 32, offset: 3712)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1550, file: !772, line: 596, baseType: !988, size: 32, align: 32, offset: 3744)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1550, file: !772, line: 599, baseType: !1518, size: 64, align: 64, offset: 3776)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1550, file: !772, line: 605, baseType: !1518, size: 64, align: 64, offset: 3840)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1550, file: !772, line: 616, baseType: !1518, size: 64, align: 64, offset: 3904)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1550, file: !772, line: 626, baseType: !1621, size: 64, align: 64, offset: 3968)
!1621 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1622, line: 216, baseType: !1424)
!1622 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1550, file: !772, line: 627, baseType: !1621, size: 64, align: 64, offset: 4032)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1550, file: !772, line: 628, baseType: !1621, size: 64, align: 64, offset: 4096)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1550, file: !772, line: 629, baseType: !1621, size: 64, align: 64, offset: 4160)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1550, file: !772, line: 645, baseType: !1518, size: 64, align: 64, offset: 4224)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1401, file: !4, line: 3566, baseType: !1628, size: 64, align: 64, offset: 1408)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64, align: 64)
!1629 = !DISubroutineType(types: !1630)
!1630 = !{!988, !1348, !1283, !1067, !1513}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1401, file: !4, line: 3567, baseType: !1440, size: 64, align: 64, offset: 1472)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1401, file: !4, line: 3576, baseType: !1633, size: 64, align: 64, offset: 1536)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DISubroutineType(types: !1635)
!1635 = !{!988, !1348, !1547}
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1401, file: !4, line: 3577, baseType: !1637, size: 64, align: 64, offset: 1600)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DISubroutineType(types: !1639)
!1639 = !{!988, !1348, !1513}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1401, file: !4, line: 3584, baseType: !1641, size: 64, align: 64, offset: 1664)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{!988, !1348, !1644}
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1401, file: !4, line: 3589, baseType: !1646, size: 64, align: 64, offset: 1728)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DISubroutineType(types: !1648)
!1648 = !{null, !1348}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1401, file: !4, line: 3594, baseType: !988, size: 32, align: 32, offset: 1792)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1401, file: !4, line: 3600, baseType: !1359, size: 64, align: 64, offset: 1856)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1401, file: !4, line: 3609, baseType: !1652, size: 64, align: 64, offset: 1920)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64, align: 64)
!1654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1655)
!1655 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1350, file: !4, line: 1566, baseType: !49, size: 32, align: 32, offset: 192)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1350, file: !4, line: 1581, baseType: !989, size: 32, align: 32, offset: 224)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1350, file: !4, line: 1583, baseType: !1283, size: 64, align: 64, offset: 256)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1350, file: !4, line: 1591, baseType: !1660, size: 64, align: 64, offset: 320)
!1660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1661, size: 64, align: 64)
!1661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1454, line: 129, size: 1664, align: 64, elements: !1662)
!1662 = !{!1663, !1664, !1665, !1666, !1667, !1685, !1686, !1692, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788}
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1661, file: !1454, line: 136, baseType: !988, size: 32, align: 32)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1661, file: !1454, line: 151, baseType: !988, size: 32, align: 32, offset: 32)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1661, file: !1454, line: 157, baseType: !988, size: 32, align: 32, offset: 64)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1661, file: !1454, line: 159, baseType: !1644, size: 64, align: 64, offset: 128)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1661, file: !1454, line: 161, baseType: !1668, size: 64, align: 64, offset: 192)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1454, line: 117, baseType: !1670)
!1670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1454, line: 100, size: 832, align: 64, elements: !1671)
!1671 = !{!1672, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1670, file: !1454, line: 105, baseType: !1673, size: 256, align: 64)
!1673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1674, size: 256, align: 64, elements: !1321)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1520, line: 238, baseType: !1676)
!1676 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1520, line: 238, flags: DIFlagFwdDecl)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1670, file: !1454, line: 110, baseType: !988, size: 32, align: 32, offset: 256)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1670, file: !1454, line: 111, baseType: !988, size: 32, align: 32, offset: 288)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1670, file: !1454, line: 111, baseType: !988, size: 32, align: 32, offset: 320)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1670, file: !1454, line: 112, baseType: !1498, size: 256, align: 32, offset: 352)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1670, file: !1454, line: 113, baseType: !1502, size: 128, align: 32, offset: 608)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1670, file: !1454, line: 114, baseType: !988, size: 32, align: 32, offset: 736)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1670, file: !1454, line: 115, baseType: !988, size: 32, align: 32, offset: 768)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1670, file: !1454, line: 116, baseType: !988, size: 32, align: 32, offset: 800)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1661, file: !1454, line: 163, baseType: !1283, size: 64, align: 64, offset: 256)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1661, file: !1454, line: 165, baseType: !1687, size: 128, align: 64, offset: 320)
!1687 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1454, line: 122, baseType: !1688)
!1688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1454, line: 119, size: 128, align: 64, elements: !1689)
!1689 = !{!1690, !1691}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1688, file: !1454, line: 120, baseType: !1513, size: 64, align: 64)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1688, file: !1454, line: 121, baseType: !1644, size: 64, align: 64, offset: 64)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1661, file: !1454, line: 166, baseType: !1693, size: 128, align: 64, offset: 448)
!1693 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1454, line: 127, baseType: !1694)
!1694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1454, line: 124, size: 128, align: 64, elements: !1695)
!1695 = !{!1696, !1769}
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1694, file: !1454, line: 125, baseType: !1697, size: 64, align: 64)
!1697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1698, size: 64, align: 64)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
!1699 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !1700)
!1700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !1701)
!1701 = !{!1702, !1703, !1727, !1731, !1732, !1766, !1767, !1768}
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1700, file: !4, line: 5751, baseType: !1353, size: 64, align: 64)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1700, file: !4, line: 5756, baseType: !1704, size: 64, align: 64, offset: 64)
!1704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1705, size: 64, align: 64)
!1705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1706)
!1706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !1707)
!1707 = !{!1708, !1709, !1712, !1713, !1714, !1718, !1722, !1726}
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1706, file: !4, line: 5797, baseType: !1359, size: 64, align: 64)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1706, file: !4, line: 5804, baseType: !1710, size: 64, align: 64, offset: 64)
!1710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1711, size: 64, align: 64)
!1711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1706, file: !4, line: 5815, baseType: !1353, size: 64, align: 64, offset: 128)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1706, file: !4, line: 5825, baseType: !988, size: 32, align: 32, offset: 192)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1706, file: !4, line: 5826, baseType: !1715, size: 64, align: 64, offset: 256)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64, align: 64)
!1716 = !DISubroutineType(types: !1717)
!1717 = !{!988, !1698}
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1706, file: !4, line: 5827, baseType: !1719, size: 64, align: 64, offset: 320)
!1719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1720, size: 64, align: 64)
!1720 = !DISubroutineType(types: !1721)
!1721 = !{!988, !1698, !1513}
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1706, file: !4, line: 5828, baseType: !1723, size: 64, align: 64, offset: 384)
