; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--hapqa_extract_bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--hapqa_extract_bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, {}*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }

!574 = !{!575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!575 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!576 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!577 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!578 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!579 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!580 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!581 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!582 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!583 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!584 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!585 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!586 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!587 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!588 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!589 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!590 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!591 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!592 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !525, line: 538, size: 32, align: 32, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601}
!594 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!595 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!596 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!597 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!598 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!599 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!600 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!601 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!602 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !4, line: 1175, size: 32, align: 32, elements: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!604 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!605 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!606 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!607 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!608 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!609 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!610 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!611 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!612 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!613 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!614 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!615 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!616 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!617 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!618 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!619 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!620 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!621 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!622 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!623 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!624 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!625 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!626 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!627 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!628 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!629 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!630 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!631 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!632 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HapSectionType", file: !633, line: 46, size: 32, align: 32, elements: !634)
!633 = !DIFile(filename: "libavcodec/hap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!634 = !{!635, !636, !637, !638}
!635 = !DIEnumerator(name: "HAP_ST_DECODE_INSTRUCTIONS", value: 1)
!636 = !DIEnumerator(name: "HAP_ST_COMPRESSOR_TABLE", value: 2)
!637 = !DIEnumerator(name: "HAP_ST_SIZE_TABLE", value: 3)
!638 = !DIEnumerator(name: "HAP_ST_OFFSET_TABLE", value: 4)
!639 = !{!640, !641, !642}
!640 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!641 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!643 = !{!644, !843, !847, !848}
!644 = distinct !DIGlobalVariable(name: "ff_hapqa_extract_bsf", scope: !0, file: !645, line: 128, type: !646, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_hapqa_extract_bsf)
!645 = !DIFile(filename: "libavcodec/hapqa_extract_bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !649)
!649 = !{!650, !654, !657, !739, !740, !800, !838, !842}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !648, file: !4, line: 5797, baseType: !651, size: 64, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !653)
!653 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !648, file: !4, line: 5804, baseType: !655, size: 64, align: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !648, file: !4, line: 5815, baseType: !658, size: 64, align: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !662)
!662 = !{!663, !664, !668, !698, !699, !700, !701, !705, !711, !713, !717}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !661, file: !486, line: 72, baseType: !651, size: 64, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !661, file: !486, line: 78, baseType: !665, size: 64, align: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!651, !642}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !661, file: !486, line: 85, baseType: !669, size: 64, align: 64, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !694, !695, !696, !697}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !671, file: !464, line: 247, baseType: !651, size: 64, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !671, file: !464, line: 253, baseType: !651, size: 64, align: 64, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !671, file: !464, line: 259, baseType: !640, size: 32, align: 32, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !671, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !671, file: !464, line: 271, baseType: !678, size: 64, align: 64, offset: 192)
!678 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !671, file: !464, line: 265, size: 64, align: 64, elements: !679)
!679 = !{!680, !684, !686, !687}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !678, file: !464, line: 266, baseType: !681, size: 64, align: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !682, line: 40, baseType: !683)
!682 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!683 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !678, file: !464, line: 267, baseType: !685, size: 64, align: 64)
!685 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !678, file: !464, line: 268, baseType: !651, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !678, file: !464, line: 270, baseType: !688, size: 64, align: 32)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !689, line: 61, baseType: !690)
!689 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !689, line: 58, size: 64, align: 32, elements: !691)
!691 = !{!692, !693}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !690, file: !689, line: 59, baseType: !640, size: 32, align: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !690, file: !689, line: 60, baseType: !640, size: 32, align: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !671, file: !464, line: 272, baseType: !685, size: 64, align: 64, offset: 256)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !671, file: !464, line: 273, baseType: !685, size: 64, align: 64, offset: 320)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !671, file: !464, line: 275, baseType: !640, size: 32, align: 32, offset: 384)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !671, file: !464, line: 300, baseType: !651, size: 64, align: 64, offset: 448)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !661, file: !486, line: 93, baseType: !640, size: 32, align: 32, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !661, file: !486, line: 99, baseType: !640, size: 32, align: 32, offset: 224)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !661, file: !486, line: 108, baseType: !640, size: 32, align: 32, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !661, file: !486, line: 113, baseType: !702, size: 64, align: 64, offset: 320)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64, align: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!642, !642, !642}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !661, file: !486, line: 123, baseType: !706, size: 64, align: 64, offset: 384)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64, align: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!709, !709}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64, align: 64)
!710 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !661)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !661, file: !486, line: 130, baseType: !712, size: 32, align: 32, offset: 448)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !661, file: !486, line: 136, baseType: !714, size: 64, align: 64, offset: 512)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64, align: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!712, !642}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !661, file: !486, line: 142, baseType: !718, size: 64, align: 64, offset: 576)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64, align: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!640, !721, !642, !651, !640}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64, align: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64, align: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !724)
!724 = !{!725, !737, !738}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !723, file: !464, line: 360, baseType: !726, size: 64, align: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64, align: 64)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64, align: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !730)
!730 = !{!731, !732, !733, !734, !735, !736}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !729, file: !464, line: 307, baseType: !651, size: 64, align: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !729, file: !464, line: 313, baseType: !685, size: 64, align: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !729, file: !464, line: 313, baseType: !685, size: 64, align: 64, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !729, file: !464, line: 318, baseType: !685, size: 64, align: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !729, file: !464, line: 318, baseType: !685, size: 64, align: 64, offset: 256)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !729, file: !464, line: 323, baseType: !640, size: 32, align: 32, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !723, file: !464, line: 364, baseType: !640, size: 32, align: 32, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !723, file: !464, line: 368, baseType: !640, size: 32, align: 32, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !648, file: !4, line: 5825, baseType: !640, size: 32, align: 32, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !648, file: !4, line: 5826, baseType: !741, size: 64, align: 64, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64, align: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!640, !744}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64, align: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !747)
!747 = !{!748, !749, !752, !756, !757, !797, !798, !799}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !746, file: !4, line: 5751, baseType: !658, size: 64, align: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !746, file: !4, line: 5756, baseType: !750, size: 64, align: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !648)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !746, file: !4, line: 5762, baseType: !753, size: 64, align: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !755)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !746, file: !4, line: 5768, baseType: !642, size: 64, align: 64, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !746, file: !4, line: 5775, baseType: !758, size: 64, align: 64, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !761)
!761 = !{!762, !763, !764, !766, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !790, !791, !792, !793, !794, !795, !796}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !760, file: !4, line: 3940, baseType: !506, size: 32, align: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !760, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !760, file: !4, line: 3948, baseType: !765, size: 32, align: 32, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !682, line: 51, baseType: !641)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !760, file: !4, line: 3958, baseType: !767, size: 64, align: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64, align: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !682, line: 48, baseType: !769)
!769 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !760, file: !4, line: 3962, baseType: !640, size: 32, align: 32, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !760, file: !4, line: 3968, baseType: !640, size: 32, align: 32, offset: 224)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !760, file: !4, line: 3973, baseType: !681, size: 64, align: 64, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !760, file: !4, line: 3986, baseType: !640, size: 32, align: 32, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !760, file: !4, line: 3999, baseType: !640, size: 32, align: 32, offset: 352)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !760, file: !4, line: 4004, baseType: !640, size: 32, align: 32, offset: 384)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !760, file: !4, line: 4005, baseType: !640, size: 32, align: 32, offset: 416)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !760, file: !4, line: 4010, baseType: !640, size: 32, align: 32, offset: 448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !760, file: !4, line: 4011, baseType: !640, size: 32, align: 32, offset: 480)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !760, file: !4, line: 4020, baseType: !688, size: 64, align: 32, offset: 512)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !760, file: !4, line: 4025, baseType: !516, size: 32, align: 32, offset: 576)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !760, file: !4, line: 4030, baseType: !524, size: 32, align: 32, offset: 608)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !760, file: !4, line: 4031, baseType: !531, size: 32, align: 32, offset: 640)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !760, file: !4, line: 4032, baseType: !549, size: 32, align: 32, offset: 672)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !760, file: !4, line: 4033, baseType: !573, size: 32, align: 32, offset: 704)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !760, file: !4, line: 4034, baseType: !592, size: 32, align: 32, offset: 736)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !760, file: !4, line: 4039, baseType: !640, size: 32, align: 32, offset: 768)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !760, file: !4, line: 4046, baseType: !788, size: 64, align: 64, offset: 832)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !682, line: 55, baseType: !789)
!789 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !760, file: !4, line: 4050, baseType: !640, size: 32, align: 32, offset: 896)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !760, file: !4, line: 4054, baseType: !640, size: 32, align: 32, offset: 928)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !760, file: !4, line: 4061, baseType: !640, size: 32, align: 32, offset: 960)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !760, file: !4, line: 4065, baseType: !640, size: 32, align: 32, offset: 992)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !760, file: !4, line: 4073, baseType: !640, size: 32, align: 32, offset: 1024)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !760, file: !4, line: 4080, baseType: !640, size: 32, align: 32, offset: 1056)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !760, file: !4, line: 4084, baseType: !640, size: 32, align: 32, offset: 1088)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !746, file: !4, line: 5781, baseType: !758, size: 64, align: 64, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !746, file: !4, line: 5787, baseType: !688, size: 64, align: 32, offset: 384)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !746, file: !4, line: 5793, baseType: !688, size: 64, align: 32, offset: 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !648, file: !4, line: 5827, baseType: !801, size: 64, align: 64, offset: 320)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64, align: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!640, !744, !804}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64, align: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !807)
!807 = !{!808, !820, !821, !822, !823, !824, !825, !826, !834, !835, !836, !837}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !806, file: !4, line: 1451, baseType: !809, size: 64, align: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !811, line: 94, baseType: !812)
!811 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !811, line: 81, size: 192, align: 64, elements: !813)
!813 = !{!814, !818, !819}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !812, file: !811, line: 82, baseType: !815, size: 64, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64, align: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !811, line: 73, baseType: !817)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !811, line: 73, flags: DIFlagFwdDecl)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !812, file: !811, line: 89, baseType: !767, size: 64, align: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !812, file: !811, line: 93, baseType: !640, size: 32, align: 32, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !806, file: !4, line: 1461, baseType: !681, size: 64, align: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !806, file: !4, line: 1467, baseType: !681, size: 64, align: 64, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !806, file: !4, line: 1468, baseType: !767, size: 64, align: 64, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !806, file: !4, line: 1469, baseType: !640, size: 32, align: 32, offset: 256)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !806, file: !4, line: 1470, baseType: !640, size: 32, align: 32, offset: 288)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !806, file: !4, line: 1474, baseType: !640, size: 32, align: 32, offset: 320)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !806, file: !4, line: 1479, baseType: !827, size: 64, align: 64, offset: 384)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64, align: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !830)
!830 = !{!831, !832, !833}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !829, file: !4, line: 1412, baseType: !767, size: 64, align: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !829, file: !4, line: 1413, baseType: !640, size: 32, align: 32, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !829, file: !4, line: 1414, baseType: !602, size: 32, align: 32, offset: 96)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !806, file: !4, line: 1480, baseType: !640, size: 32, align: 32, offset: 448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !806, file: !4, line: 1486, baseType: !681, size: 64, align: 64, offset: 512)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !806, file: !4, line: 1488, baseType: !681, size: 64, align: 64, offset: 576)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !806, file: !4, line: 1497, baseType: !681, size: 64, align: 64, offset: 640)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !648, file: !4, line: 5828, baseType: !839, size: 64, align: 64, offset: 384)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64, align: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{null, !744}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !648, file: !4, line: 5829, baseType: !839, size: 64, align: 64, offset: 448)
!843 = distinct !DIGlobalVariable(name: "codec_ids", scope: !0, file: !645, line: 108, type: !844, isLocal: true, isDefinition: true, variable: [2 x i32]* @codec_ids)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !656, size: 64, align: 32, elements: !845)
!845 = !{!846}
!846 = !DISubrange(count: 2)
!847 = distinct !DIGlobalVariable(name: "hapqa_extract_class", scope: !0, file: !645, line: 121, type: !659, isLocal: true, isDefinition: true, variable: %struct.AVClass* @hapqa_extract_class)
!848 = distinct !DIGlobalVariable(name: "options", scope: !0, file: !645, line: 114, type: !849, isLocal: true, isDefinition: true, variable: [4 x %struct.AVOption]* @options)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !850, size: 2048, align: 64, elements: !852)
!850 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !464, line: 301, baseType: !671)
!852 = !{!853}
!853 = !DISubrange(count: 4)
!854 = !{i32 2, !"Dwarf Version", i32 4}
!855 = !{i32 2, !"Debug Info Version", i32 3}
!856 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!857 = distinct !DISubprogram(name: "hapqa_extract", scope: !645, file: !645, line: 48, type: !802, isLocal: true, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !858)
!858 = !{}
!859 = !DILocalVariable(name: "a", arg: 1, scope: !860, file: !861, line: 127, type: !640)
!860 = distinct !DISubprogram(name: "av_clip_c", scope: !861, file: !861, line: 127, type: !862, isLocal: true, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !858)
!861 = !DIFile(filename: "./libavutil/common.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!862 = !DISubroutineType(types: !863)
!863 = !{!640, !640, !640, !640}
!864 = !DIExpression()
!865 = !DILocation(line: 127, column: 87, scope: !860, inlinedAt: !866)
!866 = distinct !DILocation(line: 219, column: 18, scope: !867, inlinedAt: !881)
!867 = distinct !DILexicalBlock(scope: !869, file: !868, line: 212, column: 21)
!868 = !DIFile(filename: "libavcodec/bytestream.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!869 = distinct !DISubprogram(name: "bytestream2_seek", scope: !868, file: !868, line: 208, type: !870, isLocal: true, isDefinition: true, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !858)
!870 = !DISubroutineType(types: !871)
!871 = !{!640, !872, !640, !640}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64, align: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetByteContext", file: !868, line: 35, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetByteContext", file: !868, line: 33, size: 192, align: 64, elements: !875)
!875 = !{!876, !879, !880}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !874, file: !868, line: 34, baseType: !877, size: 64, align: 64)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64, align: 64)
!878 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !768)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !874, file: !868, line: 34, baseType: !877, size: 64, align: 64, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !874, file: !868, line: 34, baseType: !877, size: 64, align: 64, offset: 128)
!881 = distinct !DILocation(line: 85, column: 9, scope: !882)
!882 = distinct !DILexicalBlock(scope: !883, file: !645, line: 83, column: 48)
!883 = distinct !DILexicalBlock(scope: !857, file: !645, line: 83, column: 9)
!884 = !DILocalVariable(name: "amin", arg: 2, scope: !860, file: !861, line: 127, type: !640)
!885 = !DILocation(line: 127, column: 94, scope: !860, inlinedAt: !866)
!886 = !DILocalVariable(name: "amax", arg: 3, scope: !860, file: !861, line: 127, type: !640)
!887 = !DILocation(line: 127, column: 104, scope: !860, inlinedAt: !866)
!888 = !DILocation(line: 127, column: 87, scope: !860, inlinedAt: !889)
!889 = distinct !DILocation(line: 223, column: 18, scope: !867, inlinedAt: !881)
!890 = !DILocation(line: 127, column: 94, scope: !860, inlinedAt: !889)
!891 = !DILocation(line: 127, column: 104, scope: !860, inlinedAt: !889)
!892 = !DILocalVariable(name: "g", arg: 1, scope: !893, file: !868, line: 188, type: !872)
!893 = distinct !DISubprogram(name: "bytestream2_tell", scope: !868, file: !868, line: 188, type: !894, isLocal: true, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !858)
!894 = !DISubroutineType(types: !895)
!895 = !{!640, !872}
!896 = !DILocation(line: 188, column: 83, scope: !893, inlinedAt: !897)
!897 = distinct !DILocation(line: 229, column: 12, scope: !869, inlinedAt: !881)
!898 = !DILocation(line: 127, column: 87, scope: !860, inlinedAt: !899)
!899 = distinct !DILocation(line: 214, column: 18, scope: !867, inlinedAt: !881)
!900 = !DILocation(line: 127, column: 94, scope: !860, inlinedAt: !899)
!901 = !DILocation(line: 127, column: 104, scope: !860, inlinedAt: !899)
!902 = !DILocalVariable(name: "g", arg: 1, scope: !869, file: !868, line: 208, type: !872)
!903 = !DILocation(line: 208, column: 83, scope: !869, inlinedAt: !881)
!904 = !DILocalVariable(name: "offset", arg: 2, scope: !869, file: !868, line: 209, type: !640)
!905 = !DILocation(line: 209, column: 50, scope: !869, inlinedAt: !881)
!906 = !DILocalVariable(name: "whence", arg: 3, scope: !869, file: !868, line: 210, type: !640)
!907 = !DILocation(line: 210, column: 50, scope: !869, inlinedAt: !881)
!908 = !DILocation(line: 127, column: 87, scope: !860, inlinedAt: !909)
!909 = distinct !DILocation(line: 219, column: 18, scope: !867, inlinedAt: !910)
!910 = distinct !DILocation(line: 75, column: 5, scope: !857)
!911 = !DILocation(line: 127, column: 94, scope: !860, inlinedAt: !909)
!912 = !DILocation(line: 127, column: 104, scope: !860, inlinedAt: !909)
!913 = !DILocation(line: 127, column: 87, scope: !860, inlinedAt: !914)
!914 = distinct !DILocation(line: 223, column: 18, scope: !867, inlinedAt: !910)
!915 = !DILocation(line: 127, column: 94, scope: !860, inlinedAt: !914)
!916 = !DILocation(line: 127, column: 104, scope: !860, inlinedAt: !914)
!917 = !DILocation(line: 188, column: 83, scope: !893, inlinedAt: !918)
!918 = distinct !DILocation(line: 229, column: 12, scope: !869, inlinedAt: !910)
!919 = !DILocation(line: 127, column: 87, scope: !860, inlinedAt: !920)
!920 = distinct !DILocation(line: 214, column: 18, scope: !867, inlinedAt: !910)
!921 = !DILocation(line: 127, column: 94, scope: !860, inlinedAt: !920)
!922 = !DILocation(line: 127, column: 104, scope: !860, inlinedAt: !920)
!923 = !DILocation(line: 208, column: 83, scope: !869, inlinedAt: !910)
!924 = !DILocation(line: 209, column: 50, scope: !869, inlinedAt: !910)
!925 = !DILocation(line: 210, column: 50, scope: !869, inlinedAt: !910)
!926 = !DILocalVariable(name: "g", arg: 1, scope: !927, file: !868, line: 133, type: !872)
!927 = distinct !DISubprogram(name: "bytestream2_init", scope: !868, file: !868, line: 133, type: !928, isLocal: true, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !858)
!928 = !DISubroutineType(types: !929)
!929 = !{null, !872, !877, !640}
!930 = !DILocation(line: 133, column: 84, scope: !927, inlinedAt: !931)
!931 = distinct !DILocation(line: 62, column: 5, scope: !857)
!932 = !DILocalVariable(name: "buf", arg: 2, scope: !927, file: !868, line: 134, type: !877)
!933 = !DILocation(line: 134, column: 62, scope: !927, inlinedAt: !931)
!934 = !DILocalVariable(name: "buf_size", arg: 3, scope: !927, file: !868, line: 135, type: !640)
!935 = !DILocation(line: 135, column: 51, scope: !927, inlinedAt: !931)
!936 = !DILocalVariable(name: "bsf", arg: 1, scope: !857, file: !645, line: 48, type: !744)
!937 = !DILocation(line: 48, column: 40, scope: !857)
!938 = !DILocalVariable(name: "pkt", arg: 2, scope: !857, file: !645, line: 48, type: !804)
!939 = !DILocation(line: 48, column: 55, scope: !857)
!940 = !DILocalVariable(name: "ctx", scope: !857, file: !645, line: 50, type: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "HapqaExtractContext", file: !645, line: 36, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HapqaExtractContext", file: !645, line: 33, size: 128, align: 64, elements: !944)
!944 = !{!945, !946}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !943, file: !645, line: 34, baseType: !658, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !943, file: !645, line: 35, baseType: !640, size: 32, align: 32, offset: 64)
!947 = !DILocation(line: 50, column: 26, scope: !857)
!948 = !DILocation(line: 50, column: 32, scope: !857)
!949 = !DILocation(line: 50, column: 37, scope: !857)
!950 = !DILocalVariable(name: "gbc", scope: !857, file: !645, line: 51, type: !873)
!951 = !DILocation(line: 51, column: 20, scope: !857)
!952 = !DILocalVariable(name: "section_size", scope: !857, file: !645, line: 52, type: !640)
!953 = !DILocation(line: 52, column: 9, scope: !857)
!954 = !DILocalVariable(name: "section_type", scope: !857, file: !645, line: 53, type: !632)
!955 = !DILocation(line: 53, column: 25, scope: !857)
!956 = !DILocalVariable(name: "start_section_size", scope: !857, file: !645, line: 54, type: !640)
!957 = !DILocation(line: 54, column: 9, scope: !857)
!958 = !DILocalVariable(name: "target_packet_size", scope: !857, file: !645, line: 55, type: !640)
!959 = !DILocation(line: 55, column: 9, scope: !857)
!960 = !DILocalVariable(name: "ret", scope: !857, file: !645, line: 56, type: !640)
!961 = !DILocation(line: 56, column: 9, scope: !857)
!962 = !DILocation(line: 58, column: 33, scope: !857)
!963 = !DILocation(line: 58, column: 38, scope: !857)
!964 = !DILocation(line: 58, column: 11, scope: !857)
!965 = !DILocation(line: 58, column: 9, scope: !857)
!966 = !DILocation(line: 59, column: 9, scope: !967)
!967 = distinct !DILexicalBlock(scope: !857, file: !645, line: 59, column: 9)
!968 = !DILocation(line: 59, column: 13, scope: !967)
!969 = !DILocation(line: 59, column: 9, scope: !857)
!970 = !DILocation(line: 60, column: 16, scope: !967)
!971 = !DILocation(line: 60, column: 9, scope: !967)
!972 = !DILocation(line: 62, column: 28, scope: !857)
!973 = !DILocation(line: 62, column: 33, scope: !857)
!974 = !DILocation(line: 62, column: 39, scope: !857)
!975 = !DILocation(line: 62, column: 44, scope: !857)
!976 = !DILocation(line: 62, column: 5, scope: !857)
!977 = !DILocation(line: 137, column: 16, scope: !978, inlinedAt: !931)
!978 = !DILexicalBlockFile(scope: !979, file: !868, discriminator: 1)
!979 = distinct !DILexicalBlock(scope: !980, file: !868, line: 137, column: 14)
!980 = distinct !DILexicalBlock(scope: !927, file: !868, line: 137, column: 8)
!981 = !DILocation(line: 137, column: 25, scope: !978, inlinedAt: !931)
!982 = !DILocation(line: 137, column: 14, scope: !978, inlinedAt: !931)
!983 = !DILocation(line: 137, column: 34, scope: !984, inlinedAt: !931)
!984 = !DILexicalBlockFile(scope: !985, file: !868, discriminator: 2)
!985 = distinct !DILexicalBlock(scope: !979, file: !868, line: 137, column: 32)
!986 = !DILocation(line: 137, column: 93, scope: !987, inlinedAt: !931)
!987 = !DILexicalBlockFile(scope: !984, file: !868, discriminator: 4)
!988 = !DILocation(line: 137, column: 93, scope: !984, inlinedAt: !931)
!989 = !DILocation(line: 138, column: 17, scope: !927, inlinedAt: !931)
!990 = !DILocation(line: 138, column: 5, scope: !927, inlinedAt: !931)
!991 = !DILocation(line: 138, column: 8, scope: !927, inlinedAt: !931)
!992 = !DILocation(line: 138, column: 15, scope: !927, inlinedAt: !931)
!993 = !DILocation(line: 139, column: 23, scope: !927, inlinedAt: !931)
!994 = !DILocation(line: 139, column: 5, scope: !927, inlinedAt: !931)
!995 = !DILocation(line: 139, column: 8, scope: !927, inlinedAt: !931)
!996 = !DILocation(line: 139, column: 21, scope: !927, inlinedAt: !931)
!997 = !DILocation(line: 140, column: 21, scope: !927, inlinedAt: !931)
!998 = !DILocation(line: 140, column: 27, scope: !927, inlinedAt: !931)
!999 = !DILocation(line: 140, column: 25, scope: !927, inlinedAt: !931)
!1000 = !DILocation(line: 140, column: 5, scope: !927, inlinedAt: !931)
!1001 = !DILocation(line: 140, column: 8, scope: !927, inlinedAt: !931)
!1002 = !DILocation(line: 140, column: 19, scope: !927, inlinedAt: !931)
!1003 = !DILocation(line: 63, column: 11, scope: !857)
!1004 = !DILocation(line: 63, column: 9, scope: !857)
