; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libswscale--gamma.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libswscale--gamma.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SwsFilterDescriptor = type { %struct.SwsSlice*, %struct.SwsSlice*, i32, i8*, i32 (%struct.SwsContext*, %struct.SwsFilterDescriptor*, i32, i32)* }

!194 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14BE", value: 183)
!195 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14LE", value: 184)
!196 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32BE", value: 185)
!197 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32LE", value: 186)
!198 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12BE", value: 187)
!199 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12LE", value: 188)
!200 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12BE", value: 189)
!201 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12LE", value: 190)
!202 = !DIEnumerator(name: "AV_PIX_FMT_NB", value: 191)
!203 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !204, line: 29, size: 32, align: 32, elements: !205)
!204 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223}
!206 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!207 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!208 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!209 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!210 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!211 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!212 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!213 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!214 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!215 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!216 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!217 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!218 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!219 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!220 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!221 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!222 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!223 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!224 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SwsDither", file: !225, line: 65, size: 32, align: 32, elements: !226)
!225 = !DIFile(filename: "libswscale/swscale_internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!226 = !{!227, !228, !229, !230, !231, !232, !233}
!227 = !DIEnumerator(name: "SWS_DITHER_NONE", value: 0)
!228 = !DIEnumerator(name: "SWS_DITHER_AUTO", value: 1)
!229 = !DIEnumerator(name: "SWS_DITHER_BAYER", value: 2)
!230 = !DIEnumerator(name: "SWS_DITHER_ED", value: 3)
!231 = !DIEnumerator(name: "SWS_DITHER_A_DITHER", value: 4)
!232 = !DIEnumerator(name: "SWS_DITHER_X_DITHER", value: 5)
!233 = !DIEnumerator(name: "NB_SWS_DITHER", value: 6)
!234 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SwsAlphaBlend", file: !225, line: 75, size: 32, align: 32, elements: !235)
!235 = !{!236, !237, !238, !239}
!236 = !DIEnumerator(name: "SWS_ALPHA_BLEND_NONE", value: 0)
!237 = !DIEnumerator(name: "SWS_ALPHA_BLEND_UNIFORM", value: 1)
!238 = !DIEnumerator(name: "SWS_ALPHA_BLEND_CHECKERBOARD", value: 2)
!239 = !DIEnumerator(name: "SWS_ALPHA_BLEND_NB", value: 3)
!240 = !{!241, !245, !251}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !243, line: 49, baseType: !244)
!243 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!244 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !248, line: 222, size: 16, align: 8, elements: !249)
!248 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !247, file: !248, line: 222, baseType: !242, size: 16, align: 16)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!252 = !{i32 2, !"Dwarf Version", i32 4}
!253 = !{i32 2, !"Debug Info Version", i32 3}
!254 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!255 = distinct !DISubprogram(name: "ff_init_gamma_convert", scope: !256, file: !256, line: 58, type: !257, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !619)
!256 = !DIFile(filename: "libswscale/gamma.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!257 = !DISubroutineType(types: !258)
!258 = !{!259, !260, !265, !241}
!259 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsFilterDescriptor", file: !225, line: 968, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsFilterDescriptor", file: !225, line: 958, size: 320, align: 64, elements: !263)
!263 = !{!264, !291, !292, !293, !295}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !262, file: !225, line: 960, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsSlice", file: !225, line: 952, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsSlice", file: !225, line: 943, size: 1216, align: 64, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !275}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !267, file: !225, line: 945, baseType: !259, size: 32, align: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "h_chr_sub_sample", scope: !267, file: !225, line: 946, baseType: !259, size: 32, align: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "v_chr_sub_sample", scope: !267, file: !225, line: 947, baseType: !259, size: 32, align: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "is_ring", scope: !267, file: !225, line: 948, baseType: !259, size: 32, align: 32, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "should_free_lines", scope: !267, file: !225, line: 949, baseType: !259, size: 32, align: 32, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !267, file: !225, line: 950, baseType: !3, size: 32, align: 32, offset: 160)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !267, file: !225, line: 951, baseType: !276, size: 1024, align: 64, offset: 192)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 1024, align: 64, elements: !289)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsPlane", file: !225, line: 936, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsPlane", file: !225, line: 929, size: 256, align: 64, elements: !279)
!279 = !{!280, !281, !282, !283, !288}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "available_lines", scope: !278, file: !225, line: 931, baseType: !259, size: 32, align: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "sliceY", scope: !278, file: !225, line: 932, baseType: !259, size: 32, align: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "sliceH", scope: !278, file: !225, line: 933, baseType: !259, size: 32, align: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !278, file: !225, line: 934, baseType: !284, size: 64, align: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !243, line: 48, baseType: !287)
!287 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !278, file: !225, line: 935, baseType: !284, size: 64, align: 64, offset: 192)
!289 = !{!290}
!290 = !DISubrange(count: 4)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !262, file: !225, line: 961, baseType: !265, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !262, file: !225, line: 963, baseType: !259, size: 32, align: 32, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !262, file: !225, line: 964, baseType: !294, size: 64, align: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !262, file: !225, line: 967, baseType: !296, size: 64, align: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!259, !299, !408, !259, !259}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsContext", file: !225, line: 628, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsContext", file: !225, line: 280, size: 424064, align: 128, elements: !302)
!302 = !{!303, !347, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !385, !389, !391, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !404, !405, !407, !409, !415, !416, !419, !420, !421, !422, !423, !424, !425, !430, !431, !432, !433, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !456, !458, !459, !460, !464, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !504, !505, !506, !507, !508, !509, !510, !511, !512, !516, !517, !521, !523, !524, !525, !526, !527, !528, !529, !530, !533, !534, !541, !547, !552, !557, !562, !567, !572, !577, !578, !582, !586, !590, !591, !595, !599, !605, !606, !610, !614, !615, !617}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !301, file: !225, line: 284, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !204, line: 143, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !204, line: 67, size: 640, align: 64, elements: !308)
!308 = !{!309, !313, !317, !321, !322, !323, !324, !328, !334, !336, !340}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !307, file: !204, line: 72, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!312 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !307, file: !204, line: 78, baseType: !314, size: 64, align: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!310, !294}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !307, file: !204, line: 85, baseType: !318, size: 64, align: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !204, line: 85, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !307, file: !204, line: 93, baseType: !259, size: 32, align: 32, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !307, file: !204, line: 99, baseType: !259, size: 32, align: 32, offset: 224)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !307, file: !204, line: 108, baseType: !259, size: 32, align: 32, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !307, file: !204, line: 113, baseType: !325, size: 64, align: 64, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!294, !294, !294}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !307, file: !204, line: 123, baseType: !329, size: 64, align: 64, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!332, !332}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !307)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !307, file: !204, line: 130, baseType: !335, size: 32, align: 32, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !204, line: 48, baseType: !203)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !307, file: !204, line: 136, baseType: !337, size: 64, align: 64, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!335, !294}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !307, file: !204, line: 142, baseType: !341, size: 64, align: 64, offset: 576)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!259, !344, !294, !310, !259}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !204, line: 60, flags: DIFlagFwdDecl)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "swscale", scope: !301, file: !225, line: 290, baseType: !348, size: 64, align: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsFunc", file: !225, line: 82, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!259, !352, !353, !356, !259, !259, !284, !356}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "srcW", scope: !301, file: !225, line: 291, baseType: !259, size: 32, align: 32, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "srcH", scope: !301, file: !225, line: 292, baseType: !259, size: 32, align: 32, offset: 160)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "dstH", scope: !301, file: !225, line: 293, baseType: !259, size: 32, align: 32, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcW", scope: !301, file: !225, line: 294, baseType: !259, size: 32, align: 32, offset: 224)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcH", scope: !301, file: !225, line: 295, baseType: !259, size: 32, align: 32, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstW", scope: !301, file: !225, line: 296, baseType: !259, size: 32, align: 32, offset: 288)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstH", scope: !301, file: !225, line: 297, baseType: !259, size: 32, align: 32, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "lumXInc", scope: !301, file: !225, line: 298, baseType: !259, size: 32, align: 32, offset: 352)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "chrXInc", scope: !301, file: !225, line: 298, baseType: !259, size: 32, align: 32, offset: 384)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "lumYInc", scope: !301, file: !225, line: 299, baseType: !259, size: 32, align: 32, offset: 416)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "chrYInc", scope: !301, file: !225, line: 299, baseType: !259, size: 32, align: 32, offset: 448)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormat", scope: !301, file: !225, line: 300, baseType: !3, size: 32, align: 32, offset: 480)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormat", scope: !301, file: !225, line: 301, baseType: !3, size: 32, align: 32, offset: 512)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormatBpp", scope: !301, file: !225, line: 302, baseType: !259, size: 32, align: 32, offset: 544)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormatBpp", scope: !301, file: !225, line: 303, baseType: !259, size: 32, align: 32, offset: 576)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dstBpc", scope: !301, file: !225, line: 304, baseType: !259, size: 32, align: 32, offset: 608)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "srcBpc", scope: !301, file: !225, line: 304, baseType: !259, size: 32, align: 32, offset: 640)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcHSubSample", scope: !301, file: !225, line: 305, baseType: !259, size: 32, align: 32, offset: 672)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcVSubSample", scope: !301, file: !225, line: 306, baseType: !259, size: 32, align: 32, offset: 704)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstHSubSample", scope: !301, file: !225, line: 307, baseType: !259, size: 32, align: 32, offset: 736)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstVSubSample", scope: !301, file: !225, line: 308, baseType: !259, size: 32, align: 32, offset: 768)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "vChrDrop", scope: !301, file: !225, line: 309, baseType: !259, size: 32, align: 32, offset: 800)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sliceDir", scope: !301, file: !225, line: 310, baseType: !259, size: 32, align: 32, offset: 832)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !301, file: !225, line: 311, baseType: !381, size: 128, align: 64, offset: 896)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 128, align: 64, elements: !383)
!382 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!383 = !{!384}
!384 = !DISubrange(count: 2)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_context", scope: !301, file: !225, line: 317, baseType: !386, size: 192, align: 64, offset: 1024)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 192, align: 64, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 3)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmpStride", scope: !301, file: !225, line: 318, baseType: !390, size: 128, align: 32, offset: 1216)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 128, align: 32, elements: !289)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmp", scope: !301, file: !225, line: 319, baseType: !392, size: 256, align: 64, offset: 1344)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 256, align: 64, elements: !289)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmpStride", scope: !301, file: !225, line: 320, baseType: !390, size: 128, align: 32, offset: 1600)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmp", scope: !301, file: !225, line: 321, baseType: !392, size: 256, align: 64, offset: 1728)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_mainindex", scope: !301, file: !225, line: 322, baseType: !259, size: 32, align: 32, offset: 1984)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_value", scope: !301, file: !225, line: 324, baseType: !382, size: 64, align: 64, offset: 2048)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_flag", scope: !301, file: !225, line: 325, baseType: !259, size: 32, align: 32, offset: 2112)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "is_internal_gamma", scope: !301, file: !225, line: 326, baseType: !259, size: 32, align: 32, offset: 2144)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !301, file: !225, line: 327, baseType: !241, size: 64, align: 64, offset: 2176)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "inv_gamma", scope: !301, file: !225, line: 328, baseType: !241, size: 64, align: 64, offset: 2240)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "numDesc", scope: !301, file: !225, line: 330, baseType: !259, size: 32, align: 32, offset: 2304)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "descIndex", scope: !301, file: !225, line: 331, baseType: !403, size: 64, align: 32, offset: 2336)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 64, align: 32, elements: !383)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "numSlice", scope: !301, file: !225, line: 332, baseType: !259, size: 32, align: 32, offset: 2400)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !301, file: !225, line: 333, baseType: !406, size: 64, align: 64, offset: 2432)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !301, file: !225, line: 334, baseType: !408, size: 64, align: 64, offset: 2496)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pal_yuv", scope: !301, file: !225, line: 336, baseType: !410, size: 8192, align: 32, offset: 2560)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 8192, align: 32, elements: !413)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !243, line: 51, baseType: !412)
!412 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!413 = !{!414}
!414 = !DISubrange(count: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pal_rgb", scope: !301, file: !225, line: 337, baseType: !410, size: 8192, align: 32, offset: 10752)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "uint2float_lut", scope: !301, file: !225, line: 339, baseType: !417, size: 8192, align: 32, offset: 18944)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 8192, align: 32, elements: !413)
!418 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "lastInLumBuf", scope: !301, file: !225, line: 351, baseType: !259, size: 32, align: 32, offset: 27136)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "lastInChrBuf", scope: !301, file: !225, line: 352, baseType: !259, size: 32, align: 32, offset: 27168)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "lumBufIndex", scope: !301, file: !225, line: 353, baseType: !259, size: 32, align: 32, offset: 27200)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "chrBufIndex", scope: !301, file: !225, line: 354, baseType: !259, size: 32, align: 32, offset: 27232)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "formatConvBuffer", scope: !301, file: !225, line: 357, baseType: !285, size: 64, align: 64, offset: 27264)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "needAlpha", scope: !301, file: !225, line: 358, baseType: !259, size: 32, align: 32, offset: 27328)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilter", scope: !301, file: !225, line: 374, baseType: !426, size: 64, align: 64, offset: 27392)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !428, line: 195, baseType: !429)
!428 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!429 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilter", scope: !301, file: !225, line: 375, baseType: !426, size: 64, align: 64, offset: 27456)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilter", scope: !301, file: !225, line: 376, baseType: !426, size: 64, align: 64, offset: 27520)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilter", scope: !301, file: !225, line: 377, baseType: !426, size: 64, align: 64, offset: 27584)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterPos", scope: !301, file: !225, line: 378, baseType: !434, size: 64, align: 64, offset: 27648)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !428, line: 196, baseType: !259)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterPos", scope: !301, file: !225, line: 379, baseType: !434, size: 64, align: 64, offset: 27712)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterPos", scope: !301, file: !225, line: 380, baseType: !434, size: 64, align: 64, offset: 27776)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterPos", scope: !301, file: !225, line: 381, baseType: !434, size: 64, align: 64, offset: 27840)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterSize", scope: !301, file: !225, line: 382, baseType: !259, size: 32, align: 32, offset: 27904)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterSize", scope: !301, file: !225, line: 383, baseType: !259, size: 32, align: 32, offset: 27936)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterSize", scope: !301, file: !225, line: 384, baseType: !259, size: 32, align: 32, offset: 27968)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterSize", scope: !301, file: !225, line: 385, baseType: !259, size: 32, align: 32, offset: 28000)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCodeSize", scope: !301, file: !225, line: 388, baseType: !259, size: 32, align: 32, offset: 28032)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCodeSize", scope: !301, file: !225, line: 389, baseType: !259, size: 32, align: 32, offset: 28064)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCode", scope: !301, file: !225, line: 390, baseType: !285, size: 64, align: 64, offset: 28096)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCode", scope: !301, file: !225, line: 391, baseType: !285, size: 64, align: 64, offset: 28160)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "canMMXEXTBeUsed", scope: !301, file: !225, line: 393, baseType: !259, size: 32, align: 32, offset: 28224)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "warned_unuseable_bilinear", scope: !301, file: !225, line: 394, baseType: !259, size: 32, align: 32, offset: 28256)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dstY", scope: !301, file: !225, line: 396, baseType: !259, size: 32, align: 32, offset: 28288)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !301, file: !225, line: 397, baseType: !259, size: 32, align: 32, offset: 28320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "yuvTable", scope: !301, file: !225, line: 398, baseType: !294, size: 64, align: 64, offset: 28352)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "table_gV", scope: !301, file: !225, line: 401, baseType: !453, size: 40960, align: 32, offset: 28416)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 40960, align: 32, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 1280)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "table_rV", scope: !301, file: !225, line: 402, baseType: !457, size: 81920, align: 64, offset: 69376)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 81920, align: 64, elements: !454)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "table_gU", scope: !301, file: !225, line: 403, baseType: !457, size: 81920, align: 64, offset: 151296)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "table_bU", scope: !301, file: !225, line: 404, baseType: !457, size: 81920, align: 64, offset: 233216)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "input_rgb2yuv_table", scope: !301, file: !225, line: 405, baseType: !461, size: 5632, align: 32, offset: 315136)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 5632, align: 32, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 176)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "dither_error", scope: !301, file: !225, line: 417, baseType: !465, size: 256, align: 64, offset: 320768)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 256, align: 64, elements: !289)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !301, file: !225, line: 420, baseType: !259, size: 32, align: 32, offset: 321024)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "brightness", scope: !301, file: !225, line: 420, baseType: !259, size: 32, align: 32, offset: 321056)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !301, file: !225, line: 420, baseType: !259, size: 32, align: 32, offset: 321088)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "srcColorspaceTable", scope: !301, file: !225, line: 421, baseType: !390, size: 128, align: 32, offset: 321120)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "dstColorspaceTable", scope: !301, file: !225, line: 422, baseType: !390, size: 128, align: 32, offset: 321248)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "srcRange", scope: !301, file: !225, line: 423, baseType: !259, size: 32, align: 32, offset: 321376)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "dstRange", scope: !301, file: !225, line: 424, baseType: !259, size: 32, align: 32, offset: 321408)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "src0Alpha", scope: !301, file: !225, line: 425, baseType: !259, size: 32, align: 32, offset: 321440)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "dst0Alpha", scope: !301, file: !225, line: 426, baseType: !259, size: 32, align: 32, offset: 321472)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "srcXYZ", scope: !301, file: !225, line: 427, baseType: !259, size: 32, align: 32, offset: 321504)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "dstXYZ", scope: !301, file: !225, line: 428, baseType: !259, size: 32, align: 32, offset: 321536)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "src_h_chr_pos", scope: !301, file: !225, line: 429, baseType: !259, size: 32, align: 32, offset: 321568)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "dst_h_chr_pos", scope: !301, file: !225, line: 430, baseType: !259, size: 32, align: 32, offset: 321600)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "src_v_chr_pos", scope: !301, file: !225, line: 431, baseType: !259, size: 32, align: 32, offset: 321632)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dst_v_chr_pos", scope: !301, file: !225, line: 432, baseType: !259, size: 32, align: 32, offset: 321664)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_offset", scope: !301, file: !225, line: 433, baseType: !259, size: 32, align: 32, offset: 321696)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_coeff", scope: !301, file: !225, line: 434, baseType: !259, size: 32, align: 32, offset: 321728)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2r_coeff", scope: !301, file: !225, line: 435, baseType: !259, size: 32, align: 32, offset: 321760)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2g_coeff", scope: !301, file: !225, line: 436, baseType: !259, size: 32, align: 32, offset: 321792)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2g_coeff", scope: !301, file: !225, line: 437, baseType: !259, size: 32, align: 32, offset: 321824)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2b_coeff", scope: !301, file: !225, line: 438, baseType: !259, size: 32, align: 32, offset: 321856)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "redDither", scope: !301, file: !225, line: 466, baseType: !488, size: 64, align: 64, offset: 321920)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !243, line: 55, baseType: !489)
!489 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "greenDither", scope: !301, file: !225, line: 467, baseType: !488, size: 64, align: 64, offset: 321984)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "blueDither", scope: !301, file: !225, line: 468, baseType: !488, size: 64, align: 64, offset: 322048)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "yCoeff", scope: !301, file: !225, line: 470, baseType: !488, size: 64, align: 64, offset: 322112)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "vrCoeff", scope: !301, file: !225, line: 471, baseType: !488, size: 64, align: 64, offset: 322176)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ubCoeff", scope: !301, file: !225, line: 472, baseType: !488, size: 64, align: 64, offset: 322240)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "vgCoeff", scope: !301, file: !225, line: 473, baseType: !488, size: 64, align: 64, offset: 322304)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ugCoeff", scope: !301, file: !225, line: 474, baseType: !488, size: 64, align: 64, offset: 322368)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "yOffset", scope: !301, file: !225, line: 475, baseType: !488, size: 64, align: 64, offset: 322432)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "uOffset", scope: !301, file: !225, line: 476, baseType: !488, size: 64, align: 64, offset: 322496)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "vOffset", scope: !301, file: !225, line: 477, baseType: !488, size: 64, align: 64, offset: 322560)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxFilter", scope: !301, file: !225, line: 478, baseType: !501, size: 32768, align: 32, offset: 322624)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 32768, align: 32, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 1024)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxFilter", scope: !301, file: !225, line: 479, baseType: !501, size: 32768, align: 32, offset: 355392)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "dstW", scope: !301, file: !225, line: 480, baseType: !259, size: 32, align: 32, offset: 388160)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "esp", scope: !301, file: !225, line: 481, baseType: !488, size: 64, align: 64, offset: 388224)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "vRounder", scope: !301, file: !225, line: 482, baseType: !488, size: 64, align: 64, offset: 388288)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "u_temp", scope: !301, file: !225, line: 483, baseType: !488, size: 64, align: 64, offset: 388352)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "v_temp", scope: !301, file: !225, line: 484, baseType: !488, size: 64, align: 64, offset: 388416)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "y_temp", scope: !301, file: !225, line: 485, baseType: !488, size: 64, align: 64, offset: 388480)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "alpMmxFilter", scope: !301, file: !225, line: 486, baseType: !501, size: 32768, align: 32, offset: 388544)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "uv_off", scope: !301, file: !225, line: 490, baseType: !513, size: 64, align: 64, offset: 421312)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !514, line: 149, baseType: !515)
!514 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!515 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "uv_offx2", scope: !301, file: !225, line: 491, baseType: !513, size: 64, align: 64, offset: 421376)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "dither16", scope: !301, file: !225, line: 492, baseType: !518, size: 128, align: 16, offset: 421440)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 128, align: 16, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 8)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "dither32", scope: !301, file: !225, line: 493, baseType: !522, size: 256, align: 32, offset: 421568)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 256, align: 32, elements: !519)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "chrDither8", scope: !301, file: !225, line: 495, baseType: !354, size: 64, align: 64, offset: 421824)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "lumDither8", scope: !301, file: !225, line: 495, baseType: !354, size: 64, align: 64, offset: 421888)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "use_mmx_vfilter", scope: !301, file: !225, line: 508, baseType: !259, size: 32, align: 32, offset: 421952)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgamma", scope: !301, file: !225, line: 513, baseType: !426, size: 64, align: 64, offset: 422016)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgamma", scope: !301, file: !225, line: 514, baseType: !426, size: 64, align: 64, offset: 422080)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgammainv", scope: !301, file: !225, line: 515, baseType: !426, size: 64, align: 64, offset: 422144)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgammainv", scope: !301, file: !225, line: 516, baseType: !426, size: 64, align: 64, offset: 422208)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "xyz2rgb_matrix", scope: !301, file: !225, line: 517, baseType: !531, size: 192, align: 16, offset: 422272)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 192, align: 16, elements: !532)
!532 = !{!388, !290}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "rgb2xyz_matrix", scope: !301, file: !225, line: 518, baseType: !531, size: 192, align: 16, offset: 422464)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2plane1", scope: !301, file: !225, line: 521, baseType: !535, size: 64, align: 64, offset: 422656)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planar1_fn", file: !225, line: 98, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64, align: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{null, !539, !285, !259, !354, !259}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2planeX", scope: !301, file: !225, line: 522, baseType: !542, size: 64, align: 64, offset: 422720)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planarX_fn", file: !225, line: 114, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !539, !259, !546, !285, !259, !354, !259}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2nv12cX", scope: !301, file: !225, line: 523, baseType: !548, size: 64, align: 64, offset: 422784)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2interleavedX_fn", file: !225, line: 133, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64, align: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !352, !539, !259, !546, !546, !285, !259}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed1", scope: !301, file: !225, line: 524, baseType: !553, size: 64, align: 64, offset: 422848)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed1_fn", file: !225, line: 169, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !352, !539, !546, !546, !539, !285, !259, !259, !259}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed2", scope: !301, file: !225, line: 525, baseType: !558, size: 64, align: 64, offset: 422912)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed2_fn", file: !225, line: 202, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !352, !546, !546, !546, !546, !285, !259, !259, !259, !259}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packedX", scope: !301, file: !225, line: 526, baseType: !563, size: 64, align: 64, offset: 422976)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packedX_fn", file: !225, line: 234, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64, align: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !352, !539, !546, !259, !539, !546, !546, !259, !546, !285, !259, !259}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2anyX", scope: !301, file: !225, line: 527, baseType: !568, size: 64, align: 64, offset: 423040)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2anyX_fn", file: !225, line: 268, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64, align: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !352, !539, !546, !259, !539, !546, !546, !259, !546, !284, !259, !259}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "lumToYV12", scope: !301, file: !225, line: 530, baseType: !573, size: 64, align: 64, offset: 423104)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64, align: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !285, !354, !354, !354, !259, !576}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "alpToYV12", scope: !301, file: !225, line: 533, baseType: !573, size: 64, align: 64, offset: 423168)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "chrToYV12", scope: !301, file: !225, line: 536, baseType: !579, size: 64, align: 64, offset: 423232)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64, align: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !285, !285, !354, !354, !354, !259, !576}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "readLumPlanar", scope: !301, file: !225, line: 545, baseType: !583, size: 64, align: 64, offset: 423296)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64, align: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !285, !353, !259, !434}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "readChrPlanar", scope: !301, file: !225, line: 546, baseType: !587, size: 64, align: 64, offset: 423360)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{null, !285, !285, !353, !259, !434}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "readAlpPlanar", scope: !301, file: !225, line: 548, baseType: !583, size: 64, align: 64, offset: 423424)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "hyscale_fast", scope: !301, file: !225, line: 570, baseType: !592, size: 64, align: 64, offset: 423488)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{null, !352, !426, !259, !354, !259, !259}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "hcscale_fast", scope: !301, file: !225, line: 573, baseType: !596, size: 64, align: 64, offset: 423552)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64, align: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{null, !352, !426, !426, !259, !354, !354, !259, !259}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "hyScale", scope: !301, file: !225, line: 610, baseType: !600, size: 64, align: 64, offset: 423616)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, align: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !352, !426, !259, !354, !539, !603, !259}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !435)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "hcScale", scope: !301, file: !225, line: 613, baseType: !600, size: 64, align: 64, offset: 423680)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "lumConvertRange", scope: !301, file: !225, line: 619, baseType: !607, size: 64, align: 64, offset: 423744)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64, align: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{null, !426, !259}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "chrConvertRange", scope: !301, file: !225, line: 621, baseType: !611, size: 64, align: 64, offset: 423808)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !426, !426, !259}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "needs_hcscale", scope: !301, file: !225, line: 623, baseType: !259, size: 32, align: 32, offset: 423872)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !301, file: !225, line: 625, baseType: !616, size: 32, align: 32, offset: 423904)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsDither", file: !225, line: 73, baseType: !224)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "alphablend", scope: !301, file: !225, line: 627, baseType: !618, size: 32, align: 32, offset: 423936)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsAlphaBlend", file: !225, line: 80, baseType: !234)
!619 = !{}
!620 = !DILocalVariable(name: "desc", arg: 1, scope: !255, file: !256, line: 58, type: !260)
!621 = !DIExpression()
!622 = !DILocation(line: 58, column: 48, scope: !255)
!623 = !DILocalVariable(name: "src", arg: 2, scope: !255, file: !256, line: 58, type: !265)
!624 = !DILocation(line: 58, column: 65, scope: !255)
!625 = !DILocalVariable(name: "table", arg: 3, scope: !255, file: !256, line: 58, type: !241)
!626 = !DILocation(line: 58, column: 80, scope: !255)
!627 = !DILocalVariable(name: "li", scope: !255, file: !256, line: 60, type: !628)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64, align: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "GammaContext", file: !256, line: 26, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GammaContext", file: !256, line: 23, size: 64, align: 64, elements: !631)
!631 = !{!632}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !630, file: !256, line: 25, baseType: !241, size: 64, align: 64)
!633 = !DILocation(line: 60, column: 19, scope: !255)
!634 = !DILocation(line: 60, column: 24, scope: !255)
!635 = !DILocation(line: 61, column: 10, scope: !636)
!636 = distinct !DILexicalBlock(scope: !255, file: !256, line: 61, column: 9)
!637 = !DILocation(line: 61, column: 9, scope: !255)
!638 = !DILocation(line: 62, column: 9, scope: !636)
!639 = !DILocation(line: 63, column: 17, scope: !255)
!640 = !DILocation(line: 63, column: 5, scope: !255)
!641 = !DILocation(line: 63, column: 9, scope: !255)
!642 = !DILocation(line: 63, column: 15, scope: !255)
!643 = !DILocation(line: 65, column: 22, scope: !255)
!644 = !DILocation(line: 65, column: 5, scope: !255)
!645 = !DILocation(line: 65, column: 11, scope: !255)
!646 = !DILocation(line: 65, column: 20, scope: !255)
!647 = !DILocation(line: 66, column: 17, scope: !255)
!648 = !DILocation(line: 66, column: 5, scope: !255)
!649 = !DILocation(line: 66, column: 11, scope: !255)
!650 = !DILocation(line: 66, column: 15, scope: !255)
!651 = !DILocation(line: 67, column: 5, scope: !255)
!652 = !DILocation(line: 67, column: 11, scope: !255)
!653 = !DILocation(line: 67, column: 15, scope: !255)
!654 = !DILocation(line: 68, column: 5, scope: !255)
!655 = !DILocation(line: 68, column: 11, scope: !255)
!656 = !DILocation(line: 68, column: 19, scope: !255)
!657 = !DILocation(line: 70, column: 5, scope: !255)
!658 = !DILocation(line: 71, column: 1, scope: !255)
!659 = distinct !DISubprogram(name: "gamma_convert", scope: !256, file: !256, line: 30, type: !660, isLocal: true, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !619)
!660 = !DISubroutineType(types: !661)
!661 = !{!259, !299, !260, !259, !259}
!662 = !DILocalVariable(name: "c", arg: 1, scope: !659, file: !256, line: 30, type: !299)
!663 = !DILocation(line: 30, column: 38, scope: !659)
!664 = !DILocalVariable(name: "desc", arg: 2, scope: !659, file: !256, line: 30, type: !260)
!665 = !DILocation(line: 30, column: 62, scope: !659)
!666 = !DILocalVariable(name: "sliceY", arg: 3, scope: !659, file: !256, line: 30, type: !259)
!667 = !DILocation(line: 30, column: 72, scope: !659)
!668 = !DILocalVariable(name: "sliceH", arg: 4, scope: !659, file: !256, line: 30, type: !259)
!669 = !DILocation(line: 30, column: 84, scope: !659)
!670 = !DILocalVariable(name: "instance", scope: !659, file: !256, line: 32, type: !628)
!671 = !DILocation(line: 32, column: 19, scope: !659)
!672 = !DILocation(line: 32, column: 30, scope: !659)
!673 = !DILocation(line: 32, column: 36, scope: !659)
!674 = !DILocalVariable(name: "table", scope: !659, file: !256, line: 33, type: !241)
!675 = !DILocation(line: 33, column: 15, scope: !659)
