; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mjpegenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mjpegenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVProfile = type { i32, i8* }

!875 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!876 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!877 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!878 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!879 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!880 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !57, line: 1534, size: 32, align: 32, elements: !881)
!881 = !{!882, !883, !884, !885, !886, !887}
!882 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!883 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!884 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!885 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!886 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!887 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!888 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !57, line: 810, size: 32, align: 32, elements: !889)
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899}
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!894 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!895 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!896 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!897 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!898 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !57, line: 798, size: 32, align: 32, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908}
!902 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!903 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!904 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!905 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!906 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!907 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!908 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OutputFormat", file: !910, line: 123, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/mpegutils.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!911 = !{!912, !913, !914, !915}
!912 = !DIEnumerator(name: "FMT_MPEG1", value: 0)
!913 = !DIEnumerator(name: "FMT_H261", value: 1)
!914 = !DIEnumerator(name: "FMT_H263", value: 2)
!915 = !DIEnumerator(name: "FMT_MJPEG", value: 3)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !917, line: 37, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!918 = !{!919, !920, !921, !922, !923, !924}
!919 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!920 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!921 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!922 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!923 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!924 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!925 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HuffmanTableOption", file: !926, line: 95, size: 32, align: 32, elements: !927)
!926 = !DIFile(filename: "libavcodec/mjpegenc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!927 = !{!928, !929, !930}
!928 = !DIEnumerator(name: "HUFFMAN_TABLE_DEFAULT", value: 0)
!929 = !DIEnumerator(name: "HUFFMAN_TABLE_OPTIMAL", value: 1)
!930 = !DIEnumerator(name: "NB_HUFFMAN_TABLE_OPTION", value: 2)
!931 = !{!932, !933}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !935, line: 221, size: 32, align: 8, elements: !936)
!935 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!936 = !{!937}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !934, file: !935, line: 221, baseType: !938, size: 32, align: 32)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !939, line: 51, baseType: !940)
!939 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!940 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!941 = !{!942, !2639, !2640, !2641, !2647}
!942 = distinct !DIGlobalVariable(name: "ff_mjpeg_encoder", scope: !0, file: !943, line: 408, type: !944, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_mjpeg_encoder)
!943 = !DIFile(filename: "libavcodec/mjpegenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !57, line: 3610, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !946)
!946 = !{!947, !951, !952, !953, !954, !956, !965, !968, !971, !974, !979, !982, !1057, !1065, !1066, !1067, !1069, !2554, !2560, !2568, !2572, !2573, !2610, !2614, !2618, !2619, !2623, !2627, !2628, !2632, !2633, !2634}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !945, file: !57, line: 3475, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !945, file: !57, line: 3480, baseType: !948, size: 64, align: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !945, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !945, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !945, file: !57, line: 3487, baseType: !955, size: 32, align: 32, offset: 192)
!955 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !945, file: !57, line: 3488, baseType: !957, size: 64, align: 64, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !960, line: 61, baseType: !961)
!960 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !960, line: 58, size: 64, align: 32, elements: !962)
!962 = !{!963, !964}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !961, file: !960, line: 59, baseType: !955, size: 32, align: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !961, file: !960, line: 60, baseType: !955, size: 32, align: 32, offset: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !945, file: !57, line: 3489, baseType: !966, size: 64, align: 64, offset: 320)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !945, file: !57, line: 3490, baseType: !969, size: 64, align: 64, offset: 384)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !945, file: !57, line: 3491, baseType: !972, size: 64, align: 64, offset: 448)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !945, file: !57, line: 3492, baseType: !975, size: 64, align: 64, offset: 512)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !939, line: 55, baseType: !978)
!978 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !945, file: !57, line: 3493, baseType: !980, size: 8, align: 8, offset: 576)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !939, line: 48, baseType: !981)
!981 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !945, file: !57, line: 3494, baseType: !983, size: 64, align: 64, offset: 640)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !987)
!987 = !{!988, !989, !993, !1016, !1017, !1018, !1019, !1023, !1029, !1031, !1035}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !986, file: !26, line: 72, baseType: !948, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !986, file: !26, line: 78, baseType: !990, size: 64, align: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!948, !932}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !986, file: !26, line: 85, baseType: !994, size: 64, align: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002, !1012, !1013, !1014, !1015}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !996, file: !4, line: 247, baseType: !948, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !996, file: !4, line: 253, baseType: !948, size: 64, align: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !996, file: !4, line: 259, baseType: !955, size: 32, align: 32, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !996, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !996, file: !4, line: 271, baseType: !1003, size: 64, align: 64, offset: 192)
!1003 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !996, file: !4, line: 265, size: 64, align: 64, elements: !1004)
!1004 = !{!1005, !1008, !1010, !1011}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1003, file: !4, line: 266, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !939, line: 40, baseType: !1007)
!1007 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1003, file: !4, line: 267, baseType: !1009, size: 64, align: 64)
!1009 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1003, file: !4, line: 268, baseType: !948, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1003, file: !4, line: 270, baseType: !959, size: 64, align: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !996, file: !4, line: 272, baseType: !1009, size: 64, align: 64, offset: 256)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !996, file: !4, line: 273, baseType: !1009, size: 64, align: 64, offset: 320)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !996, file: !4, line: 275, baseType: !955, size: 32, align: 32, offset: 384)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !996, file: !4, line: 300, baseType: !948, size: 64, align: 64, offset: 448)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !986, file: !26, line: 93, baseType: !955, size: 32, align: 32, offset: 192)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !986, file: !26, line: 99, baseType: !955, size: 32, align: 32, offset: 224)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !986, file: !26, line: 108, baseType: !955, size: 32, align: 32, offset: 256)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !986, file: !26, line: 113, baseType: !1020, size: 64, align: 64, offset: 320)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!932, !932, !932}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !986, file: !26, line: 123, baseType: !1024, size: 64, align: 64, offset: 384)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!1027, !1027}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !986, file: !26, line: 130, baseType: !1030, size: 32, align: 32, offset: 448)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !986, file: !26, line: 136, baseType: !1032, size: 64, align: 64, offset: 512)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!1030, !932}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !986, file: !26, line: 142, baseType: !1036, size: 64, align: 64, offset: 576)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!955, !1039, !932, !948, !955}
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1042)
!1042 = !{!1043, !1055, !1056}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1041, file: !4, line: 360, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1048)
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1054}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1047, file: !4, line: 307, baseType: !948, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1047, file: !4, line: 313, baseType: !1009, size: 64, align: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1047, file: !4, line: 313, baseType: !1009, size: 64, align: 64, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1047, file: !4, line: 318, baseType: !1009, size: 64, align: 64, offset: 192)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1047, file: !4, line: 318, baseType: !1009, size: 64, align: 64, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1047, file: !4, line: 323, baseType: !955, size: 32, align: 32, offset: 320)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1041, file: !4, line: 364, baseType: !955, size: 32, align: 32, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1041, file: !4, line: 368, baseType: !955, size: 32, align: 32, offset: 96)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !945, file: !57, line: 3495, baseType: !1058, size: 64, align: 64, offset: 704)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1060)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1062)
!1062 = !{!1063, !1064}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1061, file: !57, line: 3402, baseType: !955, size: 32, align: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1061, file: !57, line: 3403, baseType: !948, size: 64, align: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !945, file: !57, line: 3507, baseType: !948, size: 64, align: 64, offset: 768)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !945, file: !57, line: 3516, baseType: !955, size: 32, align: 32, offset: 832)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !945, file: !57, line: 3517, baseType: !1068, size: 64, align: 64, offset: 896)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !945, file: !57, line: 3527, baseType: !1070, size: 64, align: 64, offset: 960)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!955, !1073}
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1075)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1076)
!1076 = !{!1077, !1078, !1079, !1080, !1083, !1084, !1085, !1086, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1366, !1370, !1371, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !2473, !2474, !2475, !2476, !2477, !2478, !2479, !2480, !2481, !2482, !2483, !2484, !2485, !2492, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2506, !2507, !2508, !2509, !2510, !2511, !2512, !2513, !2530, !2531, !2532, !2533, !2534, !2535, !2536, !2537, !2538, !2539, !2540, !2541, !2542, !2543, !2544, !2545, !2546, !2547, !2548, !2549, !2550, !2551, !2552, !2553}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1075, file: !57, line: 1561, baseType: !983, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1075, file: !57, line: 1562, baseType: !955, size: 32, align: 32, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1075, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1075, file: !57, line: 1565, baseType: !1081, size: 64, align: 64, offset: 128)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1075, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1075, file: !57, line: 1581, baseType: !940, size: 32, align: 32, offset: 224)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1075, file: !57, line: 1583, baseType: !932, size: 64, align: 64, offset: 256)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1075, file: !57, line: 1591, baseType: !1087, size: 64, align: 64, offset: 320)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1089, line: 129, size: 1664, align: 64, elements: !1090)
!1089 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1090 = !{!1091, !1092, !1093, !1094, !1192, !1213, !1214, !1243, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1088, file: !1089, line: 136, baseType: !955, size: 32, align: 32)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1088, file: !1089, line: 151, baseType: !955, size: 32, align: 32, offset: 32)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1088, file: !1089, line: 157, baseType: !955, size: 32, align: 32, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1088, file: !1089, line: 159, baseType: !1095, size: 64, align: 64, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1097)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1098)
!1098 = !{!1099, !1104, !1106, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1144, !1146, !1147, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1180, !1181, !1182, !1183, !1184, !1185, !1188, !1189, !1190, !1191}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1097, file: !780, line: 282, baseType: !1100, size: 512, align: 64)
!1100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1101, size: 512, align: 64, elements: !1102)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!1102 = !{!1103}
!1103 = !DISubrange(count: 8)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1097, file: !780, line: 299, baseType: !1105, size: 256, align: 32, offset: 512)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 256, align: 32, elements: !1102)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1097, file: !780, line: 315, baseType: !1107, size: 64, align: 64, offset: 768)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1097, file: !780, line: 326, baseType: !955, size: 32, align: 32, offset: 832)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1097, file: !780, line: 326, baseType: !955, size: 32, align: 32, offset: 864)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1097, file: !780, line: 334, baseType: !955, size: 32, align: 32, offset: 896)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1097, file: !780, line: 341, baseType: !955, size: 32, align: 32, offset: 928)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1097, file: !780, line: 346, baseType: !955, size: 32, align: 32, offset: 960)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1097, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1097, file: !780, line: 356, baseType: !959, size: 64, align: 32, offset: 1024)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1097, file: !780, line: 361, baseType: !1006, size: 64, align: 64, offset: 1088)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1097, file: !780, line: 369, baseType: !1006, size: 64, align: 64, offset: 1152)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1097, file: !780, line: 377, baseType: !1006, size: 64, align: 64, offset: 1216)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1097, file: !780, line: 382, baseType: !955, size: 32, align: 32, offset: 1280)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1097, file: !780, line: 386, baseType: !955, size: 32, align: 32, offset: 1312)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1097, file: !780, line: 391, baseType: !955, size: 32, align: 32, offset: 1344)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1097, file: !780, line: 396, baseType: !932, size: 64, align: 64, offset: 1408)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1097, file: !780, line: 403, baseType: !1123, size: 512, align: 64, offset: 1472)
!1123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 512, align: 64, elements: !1102)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1097, file: !780, line: 410, baseType: !955, size: 32, align: 32, offset: 1984)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1097, file: !780, line: 415, baseType: !955, size: 32, align: 32, offset: 2016)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1097, file: !780, line: 420, baseType: !955, size: 32, align: 32, offset: 2048)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1097, file: !780, line: 425, baseType: !955, size: 32, align: 32, offset: 2080)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1097, file: !780, line: 435, baseType: !1006, size: 64, align: 64, offset: 2112)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1097, file: !780, line: 440, baseType: !955, size: 32, align: 32, offset: 2176)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1097, file: !780, line: 445, baseType: !977, size: 64, align: 64, offset: 2240)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1097, file: !780, line: 459, baseType: !1132, size: 512, align: 64, offset: 2304)
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1133, size: 512, align: 64, elements: !1102)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1135, line: 94, baseType: !1136)
!1135 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1135, line: 81, size: 192, align: 64, elements: !1137)
!1137 = !{!1138, !1142, !1143}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1136, file: !1135, line: 82, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1135, line: 73, baseType: !1141)
!1141 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1135, line: 73, flags: DIFlagFwdDecl)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1136, file: !1135, line: 89, baseType: !1101, size: 64, align: 64, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1136, file: !1135, line: 93, baseType: !955, size: 32, align: 32, offset: 128)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1097, file: !780, line: 473, baseType: !1145, size: 64, align: 64, offset: 2816)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1097, file: !780, line: 477, baseType: !955, size: 32, align: 32, offset: 2880)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1097, file: !780, line: 479, baseType: !1148, size: 64, align: 64, offset: 2944)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1151)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1152)
!1152 = !{!1153, !1154, !1155, !1156, !1161}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1151, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1151, file: !780, line: 203, baseType: !1101, size: 64, align: 64, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1151, file: !780, line: 204, baseType: !955, size: 32, align: 32, offset: 128)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1151, file: !780, line: 205, baseType: !1157, size: 64, align: 64, offset: 192)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1159, line: 86, baseType: !1160)
!1159 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1160 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1159, line: 86, flags: DIFlagFwdDecl)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1151, file: !780, line: 206, baseType: !1133, size: 64, align: 64, offset: 256)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1097, file: !780, line: 480, baseType: !955, size: 32, align: 32, offset: 3008)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1097, file: !780, line: 505, baseType: !955, size: 32, align: 32, offset: 3040)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1097, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1097, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1097, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1097, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1097, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1097, file: !780, line: 532, baseType: !1006, size: 64, align: 64, offset: 3264)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1097, file: !780, line: 539, baseType: !1006, size: 64, align: 64, offset: 3328)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1097, file: !780, line: 547, baseType: !1006, size: 64, align: 64, offset: 3392)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1097, file: !780, line: 554, baseType: !1157, size: 64, align: 64, offset: 3456)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1097, file: !780, line: 563, baseType: !955, size: 32, align: 32, offset: 3520)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1097, file: !780, line: 572, baseType: !955, size: 32, align: 32, offset: 3552)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1097, file: !780, line: 581, baseType: !955, size: 32, align: 32, offset: 3584)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1097, file: !780, line: 588, baseType: !1177, size: 64, align: 64, offset: 3648)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !939, line: 36, baseType: !1179)
!1179 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1097, file: !780, line: 593, baseType: !955, size: 32, align: 32, offset: 3712)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1097, file: !780, line: 596, baseType: !955, size: 32, align: 32, offset: 3744)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1097, file: !780, line: 599, baseType: !1133, size: 64, align: 64, offset: 3776)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1097, file: !780, line: 605, baseType: !1133, size: 64, align: 64, offset: 3840)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1097, file: !780, line: 616, baseType: !1133, size: 64, align: 64, offset: 3904)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1097, file: !780, line: 626, baseType: !1186, size: 64, align: 64, offset: 3968)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1187, line: 216, baseType: !978)
!1187 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1097, file: !780, line: 627, baseType: !1186, size: 64, align: 64, offset: 4032)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1097, file: !780, line: 628, baseType: !1186, size: 64, align: 64, offset: 4096)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1097, file: !780, line: 629, baseType: !1186, size: 64, align: 64, offset: 4160)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1097, file: !780, line: 645, baseType: !1133, size: 64, align: 64, offset: 4224)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1088, file: !1089, line: 161, baseType: !1193, size: 64, align: 64, offset: 192)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1089, line: 117, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1089, line: 100, size: 832, align: 64, elements: !1196)
!1196 = !{!1197, !1204, !1205, !1206, !1207, !1208, !1210, !1211, !1212}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1195, file: !1089, line: 105, baseType: !1198, size: 256, align: 64)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1199, size: 256, align: 64, elements: !1202)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1135, line: 238, baseType: !1201)
!1201 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1135, line: 238, flags: DIFlagFwdDecl)
!1202 = !{!1203}
!1203 = !DISubrange(count: 4)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1195, file: !1089, line: 110, baseType: !955, size: 32, align: 32, offset: 256)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1195, file: !1089, line: 111, baseType: !955, size: 32, align: 32, offset: 288)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1195, file: !1089, line: 111, baseType: !955, size: 32, align: 32, offset: 320)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1195, file: !1089, line: 112, baseType: !1105, size: 256, align: 32, offset: 352)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1195, file: !1089, line: 113, baseType: !1209, size: 128, align: 32, offset: 608)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 128, align: 32, elements: !1202)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1195, file: !1089, line: 114, baseType: !955, size: 32, align: 32, offset: 736)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1195, file: !1089, line: 115, baseType: !955, size: 32, align: 32, offset: 768)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1195, file: !1089, line: 116, baseType: !955, size: 32, align: 32, offset: 800)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1088, file: !1089, line: 163, baseType: !932, size: 64, align: 64, offset: 256)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1088, file: !1089, line: 165, baseType: !1215, size: 128, align: 64, offset: 320)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1089, line: 122, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1089, line: 119, size: 128, align: 64, elements: !1217)
!1217 = !{!1218, !1242}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1216, file: !1089, line: 120, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1221)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1222)
!1222 = !{!1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1238, !1239, !1240, !1241}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1221, file: !57, line: 1451, baseType: !1133, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1221, file: !57, line: 1461, baseType: !1006, size: 64, align: 64, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1221, file: !57, line: 1467, baseType: !1006, size: 64, align: 64, offset: 128)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1221, file: !57, line: 1468, baseType: !1101, size: 64, align: 64, offset: 192)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1221, file: !57, line: 1469, baseType: !955, size: 32, align: 32, offset: 256)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1221, file: !57, line: 1470, baseType: !955, size: 32, align: 32, offset: 288)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1221, file: !57, line: 1474, baseType: !955, size: 32, align: 32, offset: 320)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1221, file: !57, line: 1479, baseType: !1231, size: 64, align: 64, offset: 384)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1233)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1234)
!1234 = !{!1235, !1236, !1237}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1233, file: !57, line: 1412, baseType: !1101, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1233, file: !57, line: 1413, baseType: !955, size: 32, align: 32, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1233, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1221, file: !57, line: 1480, baseType: !955, size: 32, align: 32, offset: 448)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1221, file: !57, line: 1486, baseType: !1006, size: 64, align: 64, offset: 512)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1221, file: !57, line: 1488, baseType: !1006, size: 64, align: 64, offset: 576)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1221, file: !57, line: 1497, baseType: !1006, size: 64, align: 64, offset: 640)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1216, file: !1089, line: 121, baseType: !1095, size: 64, align: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1088, file: !1089, line: 166, baseType: !1244, size: 128, align: 64, offset: 448)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1089, line: 127, baseType: !1245)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1089, line: 124, size: 128, align: 64, elements: !1246)
!1246 = !{!1247, !1320}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1245, file: !1089, line: 125, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1252)
!1252 = !{!1253, !1254, !1278, !1282, !1283, !1317, !1318, !1319}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1251, file: !57, line: 5751, baseType: !983, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1251, file: !57, line: 5756, baseType: !1255, size: 64, align: 64, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1257)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1258)
!1258 = !{!1259, !1260, !1263, !1264, !1265, !1269, !1273, !1277}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1257, file: !57, line: 5797, baseType: !948, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1257, file: !57, line: 5804, baseType: !1261, size: 64, align: 64, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1257, file: !57, line: 5815, baseType: !983, size: 64, align: 64, offset: 128)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1257, file: !57, line: 5825, baseType: !955, size: 32, align: 32, offset: 192)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1257, file: !57, line: 5826, baseType: !1266, size: 64, align: 64, offset: 256)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!955, !1249}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1257, file: !57, line: 5827, baseType: !1270, size: 64, align: 64, offset: 320)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!955, !1249, !1219}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1257, file: !57, line: 5828, baseType: !1274, size: 64, align: 64, offset: 384)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{null, !1249}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1257, file: !57, line: 5829, baseType: !1274, size: 64, align: 64, offset: 448)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1251, file: !57, line: 5762, baseType: !1279, size: 64, align: 64, offset: 128)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1281)
!1281 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1251, file: !57, line: 5768, baseType: !932, size: 64, align: 64, offset: 192)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1251, file: !57, line: 5775, baseType: !1284, size: 64, align: 64, offset: 256)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1286)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1287)
!1287 = !{!1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1286, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1286, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1286, file: !57, line: 3948, baseType: !938, size: 32, align: 32, offset: 64)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1286, file: !57, line: 3958, baseType: !1101, size: 64, align: 64, offset: 128)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1286, file: !57, line: 3962, baseType: !955, size: 32, align: 32, offset: 192)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1286, file: !57, line: 3968, baseType: !955, size: 32, align: 32, offset: 224)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1286, file: !57, line: 3973, baseType: !1006, size: 64, align: 64, offset: 256)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1286, file: !57, line: 3986, baseType: !955, size: 32, align: 32, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1286, file: !57, line: 3999, baseType: !955, size: 32, align: 32, offset: 352)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1286, file: !57, line: 4004, baseType: !955, size: 32, align: 32, offset: 384)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1286, file: !57, line: 4005, baseType: !955, size: 32, align: 32, offset: 416)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1286, file: !57, line: 4010, baseType: !955, size: 32, align: 32, offset: 448)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1286, file: !57, line: 4011, baseType: !955, size: 32, align: 32, offset: 480)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1286, file: !57, line: 4020, baseType: !959, size: 64, align: 32, offset: 512)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1286, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1286, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1286, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1286, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1286, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1286, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1286, file: !57, line: 4039, baseType: !955, size: 32, align: 32, offset: 768)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1286, file: !57, line: 4046, baseType: !977, size: 64, align: 64, offset: 832)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1286, file: !57, line: 4050, baseType: !955, size: 32, align: 32, offset: 896)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1286, file: !57, line: 4054, baseType: !955, size: 32, align: 32, offset: 928)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1286, file: !57, line: 4061, baseType: !955, size: 32, align: 32, offset: 960)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1286, file: !57, line: 4065, baseType: !955, size: 32, align: 32, offset: 992)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1286, file: !57, line: 4073, baseType: !955, size: 32, align: 32, offset: 1024)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1286, file: !57, line: 4080, baseType: !955, size: 32, align: 32, offset: 1056)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1286, file: !57, line: 4084, baseType: !955, size: 32, align: 32, offset: 1088)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1251, file: !57, line: 5781, baseType: !1284, size: 64, align: 64, offset: 320)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1251, file: !57, line: 5787, baseType: !959, size: 64, align: 32, offset: 384)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1251, file: !57, line: 5793, baseType: !959, size: 64, align: 32, offset: 448)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1245, file: !1089, line: 126, baseType: !955, size: 32, align: 32, offset: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1088, file: !1089, line: 172, baseType: !1219, size: 64, align: 64, offset: 576)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1088, file: !1089, line: 177, baseType: !1101, size: 64, align: 64, offset: 640)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1088, file: !1089, line: 178, baseType: !940, size: 32, align: 32, offset: 704)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1088, file: !1089, line: 180, baseType: !932, size: 64, align: 64, offset: 768)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1088, file: !1089, line: 185, baseType: !955, size: 32, align: 32, offset: 832)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1088, file: !1089, line: 190, baseType: !932, size: 64, align: 64, offset: 896)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1088, file: !1089, line: 195, baseType: !955, size: 32, align: 32, offset: 960)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1088, file: !1089, line: 200, baseType: !1219, size: 64, align: 64, offset: 1024)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1088, file: !1089, line: 201, baseType: !955, size: 32, align: 32, offset: 1088)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1088, file: !1089, line: 202, baseType: !1095, size: 64, align: 64, offset: 1152)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1088, file: !1089, line: 203, baseType: !955, size: 32, align: 32, offset: 1216)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1088, file: !1089, line: 205, baseType: !955, size: 32, align: 32, offset: 1248)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1088, file: !1089, line: 206, baseType: !955, size: 32, align: 32, offset: 1280)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1088, file: !1089, line: 209, baseType: !1186, size: 64, align: 64, offset: 1344)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1088, file: !1089, line: 212, baseType: !1186, size: 64, align: 64, offset: 1408)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1088, file: !1089, line: 213, baseType: !1095, size: 64, align: 64, offset: 1472)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1088, file: !1089, line: 215, baseType: !955, size: 32, align: 32, offset: 1536)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1088, file: !1089, line: 217, baseType: !955, size: 32, align: 32, offset: 1568)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1088, file: !1089, line: 220, baseType: !955, size: 32, align: 32, offset: 1600)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1075, file: !57, line: 1598, baseType: !932, size: 64, align: 64, offset: 384)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1075, file: !57, line: 1606, baseType: !1006, size: 64, align: 64, offset: 448)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1075, file: !57, line: 1614, baseType: !955, size: 32, align: 32, offset: 512)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1075, file: !57, line: 1622, baseType: !955, size: 32, align: 32, offset: 544)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1075, file: !57, line: 1628, baseType: !955, size: 32, align: 32, offset: 576)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1075, file: !57, line: 1636, baseType: !955, size: 32, align: 32, offset: 608)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1075, file: !57, line: 1643, baseType: !955, size: 32, align: 32, offset: 640)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1075, file: !57, line: 1657, baseType: !1101, size: 64, align: 64, offset: 704)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1075, file: !57, line: 1658, baseType: !955, size: 32, align: 32, offset: 768)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1075, file: !57, line: 1679, baseType: !959, size: 64, align: 32, offset: 800)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1075, file: !57, line: 1688, baseType: !955, size: 32, align: 32, offset: 864)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1075, file: !57, line: 1712, baseType: !955, size: 32, align: 32, offset: 896)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1075, file: !57, line: 1729, baseType: !955, size: 32, align: 32, offset: 928)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1075, file: !57, line: 1729, baseType: !955, size: 32, align: 32, offset: 960)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1075, file: !57, line: 1744, baseType: !955, size: 32, align: 32, offset: 992)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1075, file: !57, line: 1744, baseType: !955, size: 32, align: 32, offset: 1024)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1075, file: !57, line: 1751, baseType: !955, size: 32, align: 32, offset: 1056)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1075, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1075, file: !57, line: 1791, baseType: !1359, size: 64, align: 64, offset: 1152)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DISubroutineType(types: !1361)
!1361 = !{null, !1362, !1363, !1365, !955, !955, !955}
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1096)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1075, file: !57, line: 1808, baseType: !1367, size: 64, align: 64, offset: 1216)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DISubroutineType(types: !1369)
!1369 = !{!516, !1362, !966}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1075, file: !57, line: 1816, baseType: !955, size: 32, align: 32, offset: 1280)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1075, file: !57, line: 1825, baseType: !1372, size: 32, align: 32, offset: 1312)
!1372 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1075, file: !57, line: 1830, baseType: !955, size: 32, align: 32, offset: 1344)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1075, file: !57, line: 1838, baseType: !1372, size: 32, align: 32, offset: 1376)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1075, file: !57, line: 1846, baseType: !955, size: 32, align: 32, offset: 1408)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1075, file: !57, line: 1851, baseType: !955, size: 32, align: 32, offset: 1440)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1075, file: !57, line: 1861, baseType: !1372, size: 32, align: 32, offset: 1472)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1075, file: !57, line: 1868, baseType: !1372, size: 32, align: 32, offset: 1504)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1075, file: !57, line: 1875, baseType: !1372, size: 32, align: 32, offset: 1536)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1075, file: !57, line: 1882, baseType: !1372, size: 32, align: 32, offset: 1568)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1075, file: !57, line: 1889, baseType: !1372, size: 32, align: 32, offset: 1600)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1075, file: !57, line: 1896, baseType: !1372, size: 32, align: 32, offset: 1632)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1075, file: !57, line: 1903, baseType: !1372, size: 32, align: 32, offset: 1664)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1075, file: !57, line: 1910, baseType: !955, size: 32, align: 32, offset: 1696)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1075, file: !57, line: 1915, baseType: !955, size: 32, align: 32, offset: 1728)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1075, file: !57, line: 1926, baseType: !1365, size: 64, align: 64, offset: 1792)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1075, file: !57, line: 1935, baseType: !959, size: 64, align: 32, offset: 1856)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1075, file: !57, line: 1942, baseType: !955, size: 32, align: 32, offset: 1920)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1075, file: !57, line: 1948, baseType: !955, size: 32, align: 32, offset: 1952)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1075, file: !57, line: 1954, baseType: !955, size: 32, align: 32, offset: 1984)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1075, file: !57, line: 1960, baseType: !955, size: 32, align: 32, offset: 2016)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1075, file: !57, line: 1984, baseType: !955, size: 32, align: 32, offset: 2048)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1075, file: !57, line: 1991, baseType: !955, size: 32, align: 32, offset: 2080)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1075, file: !57, line: 1996, baseType: !955, size: 32, align: 32, offset: 2112)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1075, file: !57, line: 2004, baseType: !955, size: 32, align: 32, offset: 2144)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1075, file: !57, line: 2011, baseType: !955, size: 32, align: 32, offset: 2176)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1075, file: !57, line: 2018, baseType: !955, size: 32, align: 32, offset: 2208)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1075, file: !57, line: 2027, baseType: !955, size: 32, align: 32, offset: 2240)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1075, file: !57, line: 2034, baseType: !955, size: 32, align: 32, offset: 2272)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1075, file: !57, line: 2044, baseType: !955, size: 32, align: 32, offset: 2304)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1075, file: !57, line: 2054, baseType: !1402, size: 64, align: 64, offset: 2368)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !939, line: 49, baseType: !1404)
!1404 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1075, file: !57, line: 2061, baseType: !1402, size: 64, align: 64, offset: 2432)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1075, file: !57, line: 2066, baseType: !955, size: 32, align: 32, offset: 2496)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1075, file: !57, line: 2070, baseType: !955, size: 32, align: 32, offset: 2528)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1075, file: !57, line: 2078, baseType: !955, size: 32, align: 32, offset: 2560)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1075, file: !57, line: 2085, baseType: !955, size: 32, align: 32, offset: 2592)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1075, file: !57, line: 2092, baseType: !955, size: 32, align: 32, offset: 2624)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1075, file: !57, line: 2099, baseType: !955, size: 32, align: 32, offset: 2656)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1075, file: !57, line: 2106, baseType: !955, size: 32, align: 32, offset: 2688)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1075, file: !57, line: 2113, baseType: !955, size: 32, align: 32, offset: 2720)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1075, file: !57, line: 2120, baseType: !955, size: 32, align: 32, offset: 2752)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1075, file: !57, line: 2125, baseType: !955, size: 32, align: 32, offset: 2784)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1075, file: !57, line: 2133, baseType: !955, size: 32, align: 32, offset: 2816)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1075, file: !57, line: 2140, baseType: !955, size: 32, align: 32, offset: 2848)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1075, file: !57, line: 2145, baseType: !955, size: 32, align: 32, offset: 2880)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1075, file: !57, line: 2153, baseType: !955, size: 32, align: 32, offset: 2912)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1075, file: !57, line: 2158, baseType: !955, size: 32, align: 32, offset: 2944)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1075, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1075, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1075, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1075, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1075, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1075, file: !57, line: 2203, baseType: !955, size: 32, align: 32, offset: 3136)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1075, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1075, file: !57, line: 2212, baseType: !955, size: 32, align: 32, offset: 3200)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1075, file: !57, line: 2213, baseType: !955, size: 32, align: 32, offset: 3232)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1075, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1075, file: !57, line: 2232, baseType: !955, size: 32, align: 32, offset: 3296)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1075, file: !57, line: 2243, baseType: !955, size: 32, align: 32, offset: 3328)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1075, file: !57, line: 2249, baseType: !955, size: 32, align: 32, offset: 3360)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1075, file: !57, line: 2256, baseType: !955, size: 32, align: 32, offset: 3392)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1075, file: !57, line: 2263, baseType: !977, size: 64, align: 64, offset: 3456)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1075, file: !57, line: 2270, baseType: !977, size: 64, align: 64, offset: 3520)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1075, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1075, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1075, file: !57, line: 2367, baseType: !1440, size: 64, align: 64, offset: 3648)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DISubroutineType(types: !1442)
!1442 = !{!955, !1362, !1095, !955}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1075, file: !57, line: 2383, baseType: !955, size: 32, align: 32, offset: 3712)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1075, file: !57, line: 2386, baseType: !1372, size: 32, align: 32, offset: 3744)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1075, file: !57, line: 2387, baseType: !1372, size: 32, align: 32, offset: 3776)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1075, file: !57, line: 2394, baseType: !955, size: 32, align: 32, offset: 3808)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1075, file: !57, line: 2401, baseType: !955, size: 32, align: 32, offset: 3840)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1075, file: !57, line: 2408, baseType: !955, size: 32, align: 32, offset: 3872)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1075, file: !57, line: 2415, baseType: !955, size: 32, align: 32, offset: 3904)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1075, file: !57, line: 2422, baseType: !955, size: 32, align: 32, offset: 3936)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1075, file: !57, line: 2423, baseType: !1452, size: 64, align: 64, offset: 3968)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1454)
!1454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1455)
!1455 = !{!1456, !1457, !1458, !1459}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1454, file: !57, line: 827, baseType: !955, size: 32, align: 32)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1454, file: !57, line: 828, baseType: !955, size: 32, align: 32, offset: 32)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1454, file: !57, line: 829, baseType: !955, size: 32, align: 32, offset: 64)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1454, file: !57, line: 830, baseType: !1372, size: 32, align: 32, offset: 96)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1075, file: !57, line: 2430, baseType: !1006, size: 64, align: 64, offset: 4032)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1075, file: !57, line: 2437, baseType: !1006, size: 64, align: 64, offset: 4096)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1075, file: !57, line: 2444, baseType: !1372, size: 32, align: 32, offset: 4160)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1075, file: !57, line: 2451, baseType: !1372, size: 32, align: 32, offset: 4192)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1075, file: !57, line: 2458, baseType: !955, size: 32, align: 32, offset: 4224)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1075, file: !57, line: 2469, baseType: !955, size: 32, align: 32, offset: 4256)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1075, file: !57, line: 2475, baseType: !955, size: 32, align: 32, offset: 4288)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1075, file: !57, line: 2481, baseType: !955, size: 32, align: 32, offset: 4320)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1075, file: !57, line: 2485, baseType: !955, size: 32, align: 32, offset: 4352)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1075, file: !57, line: 2489, baseType: !955, size: 32, align: 32, offset: 4384)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1075, file: !57, line: 2493, baseType: !955, size: 32, align: 32, offset: 4416)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1075, file: !57, line: 2501, baseType: !955, size: 32, align: 32, offset: 4448)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1075, file: !57, line: 2506, baseType: !955, size: 32, align: 32, offset: 4480)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1075, file: !57, line: 2510, baseType: !955, size: 32, align: 32, offset: 4512)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1075, file: !57, line: 2514, baseType: !1006, size: 64, align: 64, offset: 4544)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1075, file: !57, line: 2528, baseType: !1476, size: 64, align: 64, offset: 4608)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DISubroutineType(types: !1478)
!1478 = !{null, !1362, !932, !955, !955}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1075, file: !57, line: 2534, baseType: !955, size: 32, align: 32, offset: 4672)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1075, file: !57, line: 2545, baseType: !955, size: 32, align: 32, offset: 4704)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1075, file: !57, line: 2547, baseType: !955, size: 32, align: 32, offset: 4736)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1075, file: !57, line: 2549, baseType: !955, size: 32, align: 32, offset: 4768)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1075, file: !57, line: 2551, baseType: !955, size: 32, align: 32, offset: 4800)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1075, file: !57, line: 2553, baseType: !955, size: 32, align: 32, offset: 4832)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1075, file: !57, line: 2555, baseType: !955, size: 32, align: 32, offset: 4864)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1075, file: !57, line: 2557, baseType: !955, size: 32, align: 32, offset: 4896)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1075, file: !57, line: 2559, baseType: !955, size: 32, align: 32, offset: 4928)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1075, file: !57, line: 2563, baseType: !955, size: 32, align: 32, offset: 4960)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1075, file: !57, line: 2571, baseType: !1490, size: 64, align: 64, offset: 4992)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1075, file: !57, line: 2579, baseType: !1490, size: 64, align: 64, offset: 5056)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1075, file: !57, line: 2586, baseType: !955, size: 32, align: 32, offset: 5120)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1075, file: !57, line: 2615, baseType: !955, size: 32, align: 32, offset: 5152)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1075, file: !57, line: 2627, baseType: !955, size: 32, align: 32, offset: 5184)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1075, file: !57, line: 2637, baseType: !955, size: 32, align: 32, offset: 5216)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1075, file: !57, line: 2681, baseType: !955, size: 32, align: 32, offset: 5248)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1075, file: !57, line: 2709, baseType: !1006, size: 64, align: 64, offset: 5312)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1075, file: !57, line: 2716, baseType: !1499, size: 64, align: 64, offset: 5376)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1501)
!1501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1502)
!1502 = !{!1503, !1504, !1505, !1506, !1507, !1508, !1512, !1518, !1522, !1523, !1524, !1525, !2465, !2466, !2467, !2468, !2469}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1501, file: !57, line: 3642, baseType: !948, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1501, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1501, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1501, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1501, file: !57, line: 3669, baseType: !955, size: 32, align: 32, offset: 160)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1501, file: !57, line: 3682, baseType: !1509, size: 64, align: 64, offset: 192)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DISubroutineType(types: !1511)
!1511 = !{!955, !1073, !1095}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1501, file: !57, line: 3698, baseType: !1513, size: 64, align: 64, offset: 256)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DISubroutineType(types: !1515)
!1515 = !{!955, !1073, !1516, !938}
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1501, file: !57, line: 3712, baseType: !1519, size: 64, align: 64, offset: 320)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DISubroutineType(types: !1521)
!1521 = !{!955, !1073, !955, !1516, !938}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1501, file: !57, line: 3726, baseType: !1513, size: 64, align: 64, offset: 384)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1501, file: !57, line: 3737, baseType: !1070, size: 64, align: 64, offset: 448)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1501, file: !57, line: 3746, baseType: !955, size: 32, align: 32, offset: 512)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1501, file: !57, line: 3757, baseType: !1526, size: 64, align: 64, offset: 576)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64, align: 64)
!1527 = !DISubroutineType(types: !1528)
!1528 = !{null, !1529}
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !1531, line: 81, size: 86208, align: 64, elements: !1532)
!1531 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1532 = !{!1533, !1535, !1536, !1537, !1538, !1542, !1543, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1590, !1591, !1646, !1648, !1649, !1650, !1651, !1652, !1663, !1664, !1665, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1681, !1683, !1685, !1686, !1687, !1688, !1689, !1690, !1695, !1697, !1698, !1699, !1700, !1701, !1702, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1729, !1730, !1731, !1732, !1748, !1755, !1767, !1783, !1805, !1845, !1858, !1885, !1900, !1914, !1927, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1948, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1961, !1963, !1964, !1965, !1966, !1967, !1968, !1971, !1973, !1975, !1976, !1979, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2046, !2047, !2049, !2050, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2072, !2073, !2074, !2077, !2078, !2079, !2080, !2082, !2084, !2085, !2086, !2087, !2088, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2170, !2171, !2172, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2341, !2342, !2343, !2344, !2348, !2349, !2353, !2357, !2361, !2362, !2366, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2381, !2382, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2400, !2401, !2402, !2452, !2453, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2464}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1530, file: !1531, line: 82, baseType: !1534, size: 64, align: 64)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !1530, file: !1531, line: 84, baseType: !955, size: 32, align: 32, offset: 64)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !1530, file: !1531, line: 84, baseType: !955, size: 32, align: 32, offset: 96)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !1530, file: !1531, line: 85, baseType: !955, size: 32, align: 32, offset: 128)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !1530, file: !1531, line: 86, baseType: !1539, size: 384, align: 32, offset: 160)
!1539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 384, align: 32, elements: !1540)
!1540 = !{!1541}
!1541 = !DISubrange(count: 12)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !1530, file: !1531, line: 87, baseType: !955, size: 32, align: 32, offset: 544)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !1530, file: !1531, line: 90, baseType: !1544, size: 1088, align: 64, offset: 576)
!1544 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !917, line: 35, baseType: !1545)
!1545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !917, line: 31, size: 1088, align: 64, elements: !1546)
!1546 = !{!1547, !1548, !1552}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1545, file: !917, line: 32, baseType: !1516, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1545, file: !917, line: 33, baseType: !1549, size: 512, align: 8, offset: 64)
!1549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !980, size: 512, align: 8, elements: !1550)
!1550 = !{!1551}
!1551 = !DISubrange(count: 64)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1545, file: !917, line: 34, baseType: !1549, size: 512, align: 8, offset: 576)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !1530, file: !1531, line: 91, baseType: !1544, size: 1088, align: 64, offset: 1664)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !1530, file: !1531, line: 92, baseType: !1544, size: 1088, align: 64, offset: 2752)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !1530, file: !1531, line: 93, baseType: !1544, size: 1088, align: 64, offset: 3840)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1530, file: !1531, line: 98, baseType: !1362, size: 64, align: 64, offset: 4928)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1530, file: !1531, line: 100, baseType: !955, size: 32, align: 32, offset: 4992)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1530, file: !1531, line: 100, baseType: !955, size: 32, align: 32, offset: 5024)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1530, file: !1531, line: 101, baseType: !955, size: 32, align: 32, offset: 5056)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "intra_only", scope: !1530, file: !1531, line: 102, baseType: !955, size: 32, align: 32, offset: 5088)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1530, file: !1531, line: 103, baseType: !1006, size: 64, align: 64, offset: 5120)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "out_format", scope: !1530, file: !1531, line: 104, baseType: !909, size: 32, align: 32, offset: 5184)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "h263_pred", scope: !1530, file: !1531, line: 105, baseType: !955, size: 32, align: 32, offset: 5216)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "pb_frame", scope: !1530, file: !1531, line: 106, baseType: !955, size: 32, align: 32, offset: 5248)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "h263_plus", scope: !1530, file: !1531, line: 109, baseType: !955, size: 32, align: 32, offset: 5280)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "h263_flv", scope: !1530, file: !1531, line: 110, baseType: !955, size: 32, align: 32, offset: 5312)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1530, file: !1531, line: 112, baseType: !56, size: 32, align: 32, offset: 5344)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_qscale", scope: !1530, file: !1531, line: 113, baseType: !955, size: 32, align: 32, offset: 5376)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1530, file: !1531, line: 114, baseType: !955, size: 32, align: 32, offset: 5408)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1530, file: !1531, line: 115, baseType: !955, size: 32, align: 32, offset: 5440)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "luma_elim_threshold", scope: !1530, file: !1531, line: 116, baseType: !955, size: 32, align: 32, offset: 5472)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_elim_threshold", scope: !1530, file: !1531, line: 117, baseType: !955, size: 32, align: 32, offset: 5504)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1530, file: !1531, line: 118, baseType: !955, size: 32, align: 32, offset: 5536)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1530, file: !1531, line: 119, baseType: !955, size: 32, align: 32, offset: 5568)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1530, file: !1531, line: 120, baseType: !955, size: 32, align: 32, offset: 5600)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "context_initialized", scope: !1530, file: !1531, line: 124, baseType: !955, size: 32, align: 32, offset: 5632)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture_number", scope: !1530, file: !1531, line: 125, baseType: !955, size: 32, align: 32, offset: 5664)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1530, file: !1531, line: 126, baseType: !955, size: 32, align: 32, offset: 5696)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "picture_number", scope: !1530, file: !1531, line: 127, baseType: !955, size: 32, align: 32, offset: 5728)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "picture_in_gop_number", scope: !1530, file: !1531, line: 128, baseType: !955, size: 32, align: 32, offset: 5760)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !1530, file: !1531, line: 129, baseType: !955, size: 32, align: 32, offset: 5792)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !1530, file: !1531, line: 129, baseType: !955, size: 32, align: 32, offset: 5824)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "mb_stride", scope: !1530, file: !1531, line: 130, baseType: !955, size: 32, align: 32, offset: 5856)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "b8_stride", scope: !1530, file: !1531, line: 131, baseType: !955, size: 32, align: 32, offset: 5888)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "h_edge_pos", scope: !1530, file: !1531, line: 132, baseType: !955, size: 32, align: 32, offset: 5920)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "v_edge_pos", scope: !1530, file: !1531, line: 132, baseType: !955, size: 32, align: 32, offset: 5952)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "mb_num", scope: !1530, file: !1531, line: 133, baseType: !955, size: 32, align: 32, offset: 5984)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1530, file: !1531, line: 134, baseType: !1589, size: 64, align: 64, offset: 6016)
!1589 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1187, line: 149, baseType: !1007)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "uvlinesize", scope: !1530, file: !1531, line: 135, baseType: !1589, size: 64, align: 64, offset: 6080)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "picture", scope: !1530, file: !1531, line: 136, baseType: !1592, size: 64, align: 64, offset: 6144)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !1594, line: 91, baseType: !1595)
!1594 = !DIFile(filename: "libavcodec/mpegpicture.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Picture", file: !1594, line: 45, size: 2624, align: 64, elements: !1596)
!1596 = !{!1597, !1599, !1610, !1611, !1612, !1614, !1620, !1621, !1623, !1624, !1625, !1626, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1595, file: !1594, line: 46, baseType: !1598, size: 64, align: 64)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "tf", scope: !1595, file: !1594, line: 47, baseType: !1600, size: 256, align: 64, offset: 64)
!1600 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadFrame", file: !1601, line: 40, baseType: !1602)
!1601 = !DIFile(filename: "libavcodec/thread.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadFrame", file: !1601, line: 34, size: 256, align: 64, elements: !1603)
!1603 = !{!1604, !1605, !1609}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1602, file: !1601, line: 35, baseType: !1095, size: 64, align: 64)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1602, file: !1601, line: 36, baseType: !1606, size: 128, align: 64, offset: 64)
!1606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1073, size: 128, align: 64, elements: !1607)
!1607 = !{!1608}
!1608 = !DISubrange(count: 2)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1602, file: !1601, line: 39, baseType: !1133, size: 64, align: 64, offset: 192)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table_buf", scope: !1595, file: !1594, line: 49, baseType: !1133, size: 64, align: 64, offset: 320)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1595, file: !1594, line: 50, baseType: !1177, size: 64, align: 64, offset: 384)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val_buf", scope: !1595, file: !1594, line: 52, baseType: !1613, size: 128, align: 64, offset: 448)
!1613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1133, size: 128, align: 64, elements: !1607)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val", scope: !1595, file: !1594, line: 53, baseType: !1615, size: 128, align: 64, offset: 576)
!1615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1616, size: 128, align: 64, elements: !1607)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1618, size: 32, align: 16, elements: !1607)
!1618 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !939, line: 37, baseType: !1619)
!1619 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_buf", scope: !1595, file: !1594, line: 55, baseType: !1133, size: 64, align: 64, offset: 704)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !1595, file: !1594, line: 56, baseType: !1622, size: 64, align: 64, offset: 768)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "mbskip_table_buf", scope: !1595, file: !1594, line: 58, baseType: !1133, size: 64, align: 64, offset: 832)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "mbskip_table", scope: !1595, file: !1594, line: 59, baseType: !1101, size: 64, align: 64, offset: 896)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "ref_index_buf", scope: !1595, file: !1594, line: 61, baseType: !1613, size: 128, align: 64, offset: 960)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "ref_index", scope: !1595, file: !1594, line: 62, baseType: !1627, size: 128, align: 64, offset: 1088)
!1627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1177, size: 128, align: 64, elements: !1607)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var_buf", scope: !1595, file: !1594, line: 64, baseType: !1133, size: 64, align: 64, offset: 1216)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var", scope: !1595, file: !1594, line: 65, baseType: !1402, size: 64, align: 64, offset: 1280)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var_buf", scope: !1595, file: !1594, line: 67, baseType: !1133, size: 64, align: 64, offset: 1344)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var", scope: !1595, file: !1594, line: 68, baseType: !1402, size: 64, align: 64, offset: 1408)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_mb_width", scope: !1595, file: !1594, line: 70, baseType: !955, size: 32, align: 32, offset: 1472)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_mb_height", scope: !1595, file: !1594, line: 71, baseType: !955, size: 32, align: 32, offset: 1504)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "mb_mean_buf", scope: !1595, file: !1594, line: 73, baseType: !1133, size: 64, align: 64, offset: 1536)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "mb_mean", scope: !1595, file: !1594, line: 74, baseType: !1101, size: 64, align: 64, offset: 1600)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_buf", scope: !1595, file: !1594, line: 76, baseType: !1133, size: 64, align: 64, offset: 1664)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_picture_private", scope: !1595, file: !1594, line: 77, baseType: !932, size: 64, align: 64, offset: 1728)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "field_picture", scope: !1595, file: !1594, line: 79, baseType: !955, size: 32, align: 32, offset: 1792)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var_sum", scope: !1595, file: !1594, line: 81, baseType: !1006, size: 64, align: 64, offset: 1856)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var_sum", scope: !1595, file: !1594, line: 82, baseType: !1006, size: 64, align: 64, offset: 1920)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_score", scope: !1595, file: !1594, line: 84, baseType: !955, size: 32, align: 32, offset: 1984)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "needs_realloc", scope: !1595, file: !1594, line: 85, baseType: !955, size: 32, align: 32, offset: 2016)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !1595, file: !1594, line: 87, baseType: !955, size: 32, align: 32, offset: 2048)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !1595, file: !1594, line: 88, baseType: !955, size: 32, align: 32, offset: 2080)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "encoding_error", scope: !1595, file: !1594, line: 90, baseType: !1123, size: 512, align: 64, offset: 2112)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture", scope: !1530, file: !1531, line: 137, baseType: !1647, size: 64, align: 64, offset: 6208)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64, align: 64)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_input_picture", scope: !1530, file: !1531, line: 138, baseType: !1647, size: 64, align: 64, offset: 6272)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "user_specified_pts", scope: !1530, file: !1531, line: 140, baseType: !1006, size: 64, align: 64, offset: 6336)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "dts_delta", scope: !1530, file: !1531, line: 144, baseType: !1006, size: 64, align: 64, offset: 6400)
