; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--vf_hflip.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--vf_hflip.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFilterPad = type { i8*, i32, %struct.AVFrame* (%struct.AVFilterLink*, i32, i32)*, %struct.AVFrame* (%struct.AVFilterLink*, i32)*, i32 (%struct.AVFilterLink*, %struct.AVFrame*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32, i32 }
%struct.AVFrame = type { [8 x i8*], [8 x i32], i8**, i32, i32, i32, i32, i32, i32, %struct.AVRational, i64, i64, i64, i32, i32, i32, i8*, [8 x i64], i32, i32, i32, i32, i64, i32, i64, [8 x %struct.AVBufferRef*], %struct.AVBufferRef**, i32, %struct.AVFrameSideData**, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, %struct.AVDictionary*, i32, i32, i32, i8*, i32, i32, %struct.AVBufferRef*, %struct.AVBufferRef*, %struct.AVBufferRef*, i64, i64, i64, i64, %struct.AVBufferRef* }
%struct.AVRational = type { i32, i32 }
%struct.AVFrameSideData = type { i32, i8*, i32, %struct.AVDictionary*, %struct.AVBufferRef* }
%struct.AVDictionary = type opaque
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

!110 = !DIEnumerator(name: "AVCOL_PRI_SMPTEST428_1", value: 10)
!111 = !DIEnumerator(name: "AVCOL_PRI_SMPTE431", value: 11)
!112 = !DIEnumerator(name: "AVCOL_PRI_SMPTE432", value: 12)
!113 = !DIEnumerator(name: "AVCOL_PRI_JEDEC_P22", value: 22)
!114 = !DIEnumerator(name: "AVCOL_PRI_NB", value: 23)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorTransferCharacteristic", file: !91, line: 464, size: 32, align: 32, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138}
!117 = !DIEnumerator(name: "AVCOL_TRC_RESERVED0", value: 0)
!118 = !DIEnumerator(name: "AVCOL_TRC_BT709", value: 1)
!119 = !DIEnumerator(name: "AVCOL_TRC_UNSPECIFIED", value: 2)
!120 = !DIEnumerator(name: "AVCOL_TRC_RESERVED", value: 3)
!121 = !DIEnumerator(name: "AVCOL_TRC_GAMMA22", value: 4)
!122 = !DIEnumerator(name: "AVCOL_TRC_GAMMA28", value: 5)
!123 = !DIEnumerator(name: "AVCOL_TRC_SMPTE170M", value: 6)
!124 = !DIEnumerator(name: "AVCOL_TRC_SMPTE240M", value: 7)
!125 = !DIEnumerator(name: "AVCOL_TRC_LINEAR", value: 8)
!126 = !DIEnumerator(name: "AVCOL_TRC_LOG", value: 9)
!127 = !DIEnumerator(name: "AVCOL_TRC_LOG_SQRT", value: 10)
!128 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_4", value: 11)
!129 = !DIEnumerator(name: "AVCOL_TRC_BT1361_ECG", value: 12)
!130 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_1", value: 13)
!131 = !DIEnumerator(name: "AVCOL_TRC_BT2020_10", value: 14)
!132 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!133 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!134 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!135 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!136 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!137 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!138 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !91, line: 493, size: 32, align: 32, elements: !140)
!140 = !{!141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157}
!141 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!142 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!143 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!144 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!145 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!146 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!147 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!148 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!149 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!150 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!151 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!152 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!153 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!154 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!155 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!156 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!157 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !91, line: 538, size: 32, align: 32, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167}
!160 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!161 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!162 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!163 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!164 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!165 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!166 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!167 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !170, file: !169, line: 503, size: 32, align: 32, elements: !575)
!169 = !DIFile(filename: "libavfilter/avfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterLink", file: !169, line: 439, size: 493504, align: 64, elements: !171)
!171 = !{!172, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !536, !537, !538, !539, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !170, file: !169, line: 440, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterContext", file: !169, line: 67, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterContext", file: !169, line: 338, size: 1344, align: 64, elements: !176)
!176 = !{!177, !264, !436, !437, !439, !441, !443, !444, !445, !446, !447, !487, !488, !494, !503, !504, !505, !507, !508, !509, !510, !511}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !175, file: !169, line: 339, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !182)
!182 = !{!183, !187, !192, !223, !224, !225, !226, !230, !236, !238, !242}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !181, file: !26, line: 72, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !181, file: !26, line: 78, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!184, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !181, file: !26, line: 85, baseType: !193, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !196)
!196 = !{!197, !198, !199, !201, !202, !219, !220, !221, !222}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !4, line: 247, baseType: !184, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !195, file: !4, line: 253, baseType: !184, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !195, file: !4, line: 259, baseType: !200, size: 32, align: 32, offset: 128)
!200 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !195, file: !4, line: 271, baseType: !203, size: 64, align: 64, offset: 192)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !195, file: !4, line: 265, size: 64, align: 64, elements: !204)
!204 = !{!205, !209, !211, !212}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !203, file: !4, line: 266, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !207, line: 40, baseType: !208)
!207 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!208 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !203, file: !4, line: 267, baseType: !210, size: 64, align: 64)
!210 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !203, file: !4, line: 268, baseType: !184, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !203, file: !4, line: 270, baseType: !213, size: 64, align: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !214, line: 61, baseType: !215)
!214 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !214, line: 58, size: 64, align: 32, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !215, file: !214, line: 59, baseType: !200, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !215, file: !214, line: 60, baseType: !200, size: 32, align: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !195, file: !4, line: 272, baseType: !210, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !195, file: !4, line: 273, baseType: !210, size: 64, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !195, file: !4, line: 275, baseType: !200, size: 32, align: 32, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !195, file: !4, line: 300, baseType: !184, size: 64, align: 64, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !181, file: !26, line: 93, baseType: !200, size: 32, align: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !181, file: !26, line: 99, baseType: !200, size: 32, align: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !181, file: !26, line: 108, baseType: !200, size: 32, align: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !181, file: !26, line: 113, baseType: !227, size: 64, align: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!191, !191, !191}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !181, file: !26, line: 123, baseType: !231, size: 64, align: 64, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!234, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !181, file: !26, line: 130, baseType: !237, size: 32, align: 32, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !181, file: !26, line: 136, baseType: !239, size: 64, align: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!237, !191}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !181, file: !26, line: 142, baseType: !243, size: 64, align: 64, offset: 576)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!200, !246, !191, !184, !200}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !249)
!249 = !{!250, !262, !263}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !248, file: !4, line: 360, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !254, file: !4, line: 307, baseType: !184, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !254, file: !4, line: 313, baseType: !210, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !254, file: !4, line: 313, baseType: !210, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !254, file: !4, line: 318, baseType: !210, size: 64, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !254, file: !4, line: 318, baseType: !210, size: 64, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !254, file: !4, line: 323, baseType: !200, size: 32, align: 32, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !248, file: !4, line: 364, baseType: !200, size: 32, align: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !248, file: !4, line: 368, baseType: !200, size: 32, align: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !175, file: !169, line: 341, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilter", file: !169, line: 328, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilter", file: !169, line: 144, size: 1024, align: 64, elements: !269)
!269 = !{!270, !271, !272, !404, !405, !406, !407, !411, !412, !417, !421, !422, !423, !424, !426, !431, !435}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !169, line: 148, baseType: !184, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !268, file: !169, line: 155, baseType: !184, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !268, file: !169, line: 164, baseType: !273, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterPad", file: !169, line: 69, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterPad", file: !277, line: 54, size: 576, align: 64, elements: !278)
!277 = !DIFile(filename: "libavfilter/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!278 = !{!279, !280, !281, !388, !392, !396, !400, !401, !402, !403}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !277, line: 60, baseType: !184, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !276, file: !277, line: 65, baseType: !46, size: 32, align: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "get_video_buffer", scope: !276, file: !277, line: 73, baseType: !282, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!285, !386, !200, !200}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !67, line: 646, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !67, line: 268, size: 4288, align: 64, elements: !288)
!288 = !{!289, !296, !298, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !318, !319, !320, !321, !322, !323, !324, !325, !338, !340, !341, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !374, !375, !376, !377, !378, !379, !382, !383, !384, !385}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !287, file: !67, line: 282, baseType: !290, size: 512, align: 64)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 512, align: 64, elements: !294)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !207, line: 48, baseType: !293)
!293 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!294 = !{!295}
!295 = !DISubrange(count: 8)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !287, file: !67, line: 299, baseType: !297, size: 256, align: 32, offset: 512)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 256, align: 32, elements: !294)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !287, file: !67, line: 315, baseType: !299, size: 64, align: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !287, file: !67, line: 326, baseType: !200, size: 32, align: 32, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !287, file: !67, line: 326, baseType: !200, size: 32, align: 32, offset: 864)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !287, file: !67, line: 334, baseType: !200, size: 32, align: 32, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !287, file: !67, line: 341, baseType: !200, size: 32, align: 32, offset: 928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !287, file: !67, line: 346, baseType: !200, size: 32, align: 32, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !287, file: !67, line: 351, baseType: !56, size: 32, align: 32, offset: 992)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !287, file: !67, line: 356, baseType: !213, size: 64, align: 32, offset: 1024)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !287, file: !67, line: 361, baseType: !206, size: 64, align: 64, offset: 1088)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !287, file: !67, line: 369, baseType: !206, size: 64, align: 64, offset: 1152)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !287, file: !67, line: 377, baseType: !206, size: 64, align: 64, offset: 1216)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !287, file: !67, line: 382, baseType: !200, size: 32, align: 32, offset: 1280)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !287, file: !67, line: 386, baseType: !200, size: 32, align: 32, offset: 1312)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !287, file: !67, line: 391, baseType: !200, size: 32, align: 32, offset: 1344)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !287, file: !67, line: 396, baseType: !191, size: 64, align: 64, offset: 1408)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !287, file: !67, line: 403, baseType: !315, size: 512, align: 64, offset: 1472)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 512, align: 64, elements: !294)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !207, line: 55, baseType: !317)
!317 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !287, file: !67, line: 410, baseType: !200, size: 32, align: 32, offset: 1984)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !287, file: !67, line: 415, baseType: !200, size: 32, align: 32, offset: 2016)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !287, file: !67, line: 420, baseType: !200, size: 32, align: 32, offset: 2048)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !287, file: !67, line: 425, baseType: !200, size: 32, align: 32, offset: 2080)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !287, file: !67, line: 435, baseType: !206, size: 64, align: 64, offset: 2112)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !287, file: !67, line: 440, baseType: !200, size: 32, align: 32, offset: 2176)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !287, file: !67, line: 445, baseType: !316, size: 64, align: 64, offset: 2240)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !287, file: !67, line: 459, baseType: !326, size: 512, align: 64, offset: 2304)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 512, align: 64, elements: !294)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !329, line: 94, baseType: !330)
!329 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !329, line: 81, size: 192, align: 64, elements: !331)
!331 = !{!332, !336, !337}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !330, file: !329, line: 82, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !329, line: 73, baseType: !335)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !329, line: 73, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !330, file: !329, line: 89, baseType: !291, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !330, file: !329, line: 93, baseType: !200, size: 32, align: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !287, file: !67, line: 473, baseType: !339, size: 64, align: 64, offset: 2816)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !287, file: !67, line: 477, baseType: !200, size: 32, align: 32, offset: 2880)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !287, file: !67, line: 479, baseType: !342, size: 64, align: 64, offset: 2944)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !67, line: 207, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !67, line: 201, size: 320, align: 64, elements: !346)
!346 = !{!347, !348, !349, !350, !355}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !345, file: !67, line: 202, baseType: !66, size: 32, align: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !345, file: !67, line: 203, baseType: !291, size: 64, align: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !345, file: !67, line: 204, baseType: !200, size: 32, align: 32, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !345, file: !67, line: 205, baseType: !351, size: 64, align: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !353, line: 86, baseType: !354)
!353 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !353, line: 86, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !345, file: !67, line: 206, baseType: !327, size: 64, align: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !287, file: !67, line: 480, baseType: !200, size: 32, align: 32, offset: 3008)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !67, line: 505, baseType: !200, size: 32, align: 32, offset: 3040)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !287, file: !67, line: 512, baseType: !90, size: 32, align: 32, offset: 3072)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !287, file: !67, line: 514, baseType: !97, size: 32, align: 32, offset: 3104)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !287, file: !67, line: 516, baseType: !115, size: 32, align: 32, offset: 3136)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !287, file: !67, line: 523, baseType: !139, size: 32, align: 32, offset: 3168)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !287, file: !67, line: 525, baseType: !158, size: 32, align: 32, offset: 3200)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !287, file: !67, line: 532, baseType: !206, size: 64, align: 64, offset: 3264)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !287, file: !67, line: 539, baseType: !206, size: 64, align: 64, offset: 3328)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !287, file: !67, line: 547, baseType: !206, size: 64, align: 64, offset: 3392)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !287, file: !67, line: 554, baseType: !351, size: 64, align: 64, offset: 3456)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !287, file: !67, line: 563, baseType: !200, size: 32, align: 32, offset: 3520)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !287, file: !67, line: 572, baseType: !200, size: 32, align: 32, offset: 3552)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !287, file: !67, line: 581, baseType: !200, size: 32, align: 32, offset: 3584)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !287, file: !67, line: 588, baseType: !371, size: 64, align: 64, offset: 3648)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !207, line: 36, baseType: !373)
!373 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !287, file: !67, line: 593, baseType: !200, size: 32, align: 32, offset: 3712)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !287, file: !67, line: 596, baseType: !200, size: 32, align: 32, offset: 3744)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !287, file: !67, line: 599, baseType: !327, size: 64, align: 64, offset: 3776)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !287, file: !67, line: 605, baseType: !327, size: 64, align: 64, offset: 3840)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !287, file: !67, line: 616, baseType: !327, size: 64, align: 64, offset: 3904)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !287, file: !67, line: 626, baseType: !380, size: 64, align: 64, offset: 3968)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !381, line: 216, baseType: !317)
!381 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!382 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !287, file: !67, line: 627, baseType: !380, size: 64, align: 64, offset: 4032)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !287, file: !67, line: 628, baseType: !380, size: 64, align: 64, offset: 4096)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !287, file: !67, line: 629, baseType: !380, size: 64, align: 64, offset: 4160)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !287, file: !67, line: 645, baseType: !327, size: 64, align: 64, offset: 4224)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterLink", file: !169, line: 68, baseType: !170)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "get_audio_buffer", scope: !276, file: !277, line: 81, baseType: !389, size: 64, align: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!285, !386, !200}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "filter_frame", scope: !276, file: !277, line: 93, baseType: !393, size: 64, align: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!200, !386, !285}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "poll_frame", scope: !276, file: !277, line: 104, baseType: !397, size: 64, align: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!200, !386}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "request_frame", scope: !276, file: !277, line: 113, baseType: !397, size: 64, align: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "config_props", scope: !276, file: !277, line: 129, baseType: !397, size: 64, align: 64, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "needs_fifo", scope: !276, file: !277, line: 137, baseType: !200, size: 32, align: 32, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "needs_writable", scope: !276, file: !277, line: 145, baseType: !200, size: 32, align: 32, offset: 544)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !268, file: !169, line: 172, baseType: !273, size: 64, align: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !268, file: !169, line: 182, baseType: !178, size: 64, align: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !268, file: !169, line: 187, baseType: !200, size: 32, align: 32, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "preinit", scope: !268, file: !169, line: 210, baseType: !408, size: 64, align: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!200, !173}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !268, file: !169, line: 233, baseType: !408, size: 64, align: 64, offset: 448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "init_dict", scope: !268, file: !169, line: 246, baseType: !413, size: 64, align: 64, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!200, !173, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !268, file: !169, line: 258, baseType: !418, size: 64, align: 64, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !173}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "query_formats", scope: !268, file: !169, line: 282, baseType: !408, size: 64, align: 64, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "priv_size", scope: !268, file: !169, line: 284, baseType: !200, size: 32, align: 32, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flags_internal", scope: !268, file: !169, line: 286, baseType: !200, size: 32, align: 32, offset: 736)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !169, line: 292, baseType: !425, size: 64, align: 64, offset: 768)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "process_command", scope: !268, file: !169, line: 306, baseType: !427, size: 64, align: 64, offset: 832)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!200, !173, !184, !184, !430, !200, !200}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "init_opaque", scope: !268, file: !169, line: 313, baseType: !432, size: 64, align: 64, offset: 896)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!200, !173, !191}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !268, file: !169, line: 327, baseType: !408, size: 64, align: 64, offset: 960)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !169, line: 343, baseType: !430, size: 64, align: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "input_pads", scope: !175, file: !169, line: 345, baseType: !438, size: 64, align: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !175, file: !169, line: 346, baseType: !440, size: 64, align: 64, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !175, file: !169, line: 347, baseType: !442, size: 32, align: 32, offset: 320)
!442 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "output_pads", scope: !175, file: !169, line: 349, baseType: !438, size: 64, align: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !175, file: !169, line: 350, baseType: !440, size: 64, align: 64, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "nb_outputs", scope: !175, file: !169, line: 351, baseType: !442, size: 32, align: 32, offset: 512)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !175, file: !169, line: 353, baseType: !191, size: 64, align: 64, offset: 576)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !175, file: !169, line: 355, baseType: !448, size: 64, align: 64, offset: 640)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraph", file: !169, line: 840, size: 768, align: 64, elements: !450)
!450 = !{!451, !452, !454, !455, !456, !457, !458, !459, !481, !482, !483, !484, !485, !486}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !449, file: !169, line: 841, baseType: !178, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !449, file: !169, line: 842, baseType: !453, size: 64, align: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "nb_filters", scope: !449, file: !169, line: 843, baseType: !442, size: 32, align: 32, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "scale_sws_opts", scope: !449, file: !169, line: 845, baseType: !430, size: 64, align: 64, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "resample_lavr_opts", scope: !449, file: !169, line: 847, baseType: !430, size: 64, align: 64, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !449, file: !169, line: 862, baseType: !200, size: 32, align: 32, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !449, file: !169, line: 869, baseType: !200, size: 32, align: 32, offset: 352)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !449, file: !169, line: 874, baseType: !460, size: 64, align: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterGraphInternal", file: !169, line: 809, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraphInternal", file: !277, line: 148, size: 192, align: 64, elements: !463)
!463 = !{!464, !465, !475}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !462, file: !277, line: 149, baseType: !191, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "thread_execute", scope: !462, file: !277, line: 150, baseType: !466, size: 64, align: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_execute_func", file: !169, line: 837, baseType: !468)
!468 = !DISubroutineType(types: !469)
!469 = !{!200, !173, !470, !191, !474, !200}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_action_func", file: !169, line: 823, baseType: !472)
!472 = !DISubroutineType(types: !473)
!473 = !{!200, !173, !191, !200, !200}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "frame_queues", scope: !462, file: !277, line: 151, baseType: !476, size: 8, align: 8, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameQueueGlobal", file: !477, line: 48, baseType: !478)
!477 = !DIFile(filename: "libavfilter/framequeue.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameQueueGlobal", file: !477, line: 46, size: 8, align: 8, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !478, file: !477, line: 47, baseType: !186, size: 8, align: 8)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !449, file: !169, line: 881, baseType: !191, size: 64, align: 64, offset: 448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !449, file: !169, line: 895, baseType: !466, size: 64, align: 64, offset: 512)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "aresample_swr_opts", scope: !449, file: !169, line: 897, baseType: !430, size: 64, align: 64, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links", scope: !449, file: !169, line: 906, baseType: !440, size: 64, align: 64, offset: 640)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links_count", scope: !449, file: !169, line: 907, baseType: !200, size: 32, align: 32, offset: 704)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "disable_auto_convert", scope: !449, file: !169, line: 909, baseType: !442, size: 32, align: 32, offset: 736)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !175, file: !169, line: 373, baseType: !200, size: 32, align: 32, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !175, file: !169, line: 378, baseType: !489, size: 64, align: 64, offset: 768)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterInternal", file: !169, line: 335, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterInternal", file: !277, line: 154, size: 64, align: 64, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !491, file: !277, line: 155, baseType: !466, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "command_queue", scope: !175, file: !169, line: 380, baseType: !495, size: 64, align: 64, offset: 832)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterCommand", file: !277, line: 38, size: 320, align: 64, elements: !497)
!497 = !{!498, !499, !500, !501, !502}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !496, file: !277, line: 39, baseType: !210, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !496, file: !277, line: 40, baseType: !430, size: 64, align: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !496, file: !277, line: 41, baseType: !430, size: 64, align: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !496, file: !277, line: 42, baseType: !200, size: 32, align: 32, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !277, line: 43, baseType: !495, size: 64, align: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "enable_str", scope: !175, file: !169, line: 382, baseType: !430, size: 64, align: 64, offset: 896)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !175, file: !169, line: 383, baseType: !191, size: 64, align: 64, offset: 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "var_values", scope: !175, file: !169, line: 384, baseType: !506, size: 64, align: 64, offset: 1024)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "is_disabled", scope: !175, file: !169, line: 385, baseType: !200, size: 32, align: 32, offset: 1088)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !175, file: !169, line: 394, baseType: !327, size: 64, align: 64, offset: 1152)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !175, file: !169, line: 401, baseType: !200, size: 32, align: 32, offset: 1216)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !175, file: !169, line: 408, baseType: !442, size: 32, align: 32, offset: 1248)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !175, file: !169, line: 424, baseType: !200, size: 32, align: 32, offset: 1280)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "srcpad", scope: !170, file: !169, line: 441, baseType: !438, size: 64, align: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !170, file: !169, line: 443, baseType: !173, size: 64, align: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dstpad", scope: !170, file: !169, line: 444, baseType: !438, size: 64, align: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !169, line: 446, baseType: !46, size: 32, align: 32, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !170, file: !169, line: 449, baseType: !200, size: 32, align: 32, offset: 288)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !170, file: !169, line: 450, baseType: !200, size: 32, align: 32, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !170, file: !169, line: 451, baseType: !213, size: 64, align: 32, offset: 352)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !170, file: !169, line: 453, baseType: !316, size: 64, align: 64, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !170, file: !169, line: 454, baseType: !200, size: 32, align: 32, offset: 512)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !170, file: !169, line: 456, baseType: !200, size: 32, align: 32, offset: 544)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !170, file: !169, line: 465, baseType: !213, size: 64, align: 32, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "in_formats", scope: !170, file: !169, line: 481, baseType: !524, size: 64, align: 64, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterFormats", file: !169, line: 70, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterFormats", file: !527, line: 64, size: 256, align: 64, elements: !528)
!527 = !DIFile(filename: "libavfilter/formats.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!528 = !{!529, !530, !531, !532}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nb_formats", scope: !526, file: !527, line: 65, baseType: !442, size: 32, align: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !526, file: !527, line: 66, baseType: !474, size: 64, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !526, file: !527, line: 68, baseType: !442, size: 32, align: 32, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !526, file: !527, line: 69, baseType: !533, size: 64, align: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "out_formats", scope: !170, file: !169, line: 482, baseType: !524, size: 64, align: 64, offset: 704)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "in_samplerates", scope: !170, file: !169, line: 488, baseType: !524, size: 64, align: 64, offset: 768)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "out_samplerates", scope: !170, file: !169, line: 489, baseType: !524, size: 64, align: 64, offset: 832)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "in_channel_layouts", scope: !170, file: !169, line: 490, baseType: !540, size: 64, align: 64, offset: 896)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterChannelLayouts", file: !527, line: 85, size: 256, align: 64, elements: !542)
!542 = !{!543, !545, !546, !547, !548, !549}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !541, file: !527, line: 86, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "nb_channel_layouts", scope: !541, file: !527, line: 87, baseType: !200, size: 32, align: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "all_layouts", scope: !541, file: !527, line: 88, baseType: !186, size: 8, align: 8, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "all_counts", scope: !541, file: !527, line: 89, baseType: !186, size: 8, align: 8, offset: 104)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !541, file: !527, line: 91, baseType: !442, size: 32, align: 32, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !541, file: !527, line: 92, baseType: !550, size: 64, align: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "out_channel_layouts", scope: !170, file: !169, line: 491, baseType: !540, size: 64, align: 64, offset: 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "request_samples", scope: !170, file: !169, line: 500, baseType: !200, size: 32, align: 32, offset: 1024)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !170, file: !169, line: 507, baseType: !168, size: 32, align: 32, offset: 1056)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !170, file: !169, line: 512, baseType: !448, size: 64, align: 64, offset: 1088)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts", scope: !170, file: !169, line: 518, baseType: !206, size: 64, align: 64, offset: 1152)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts_us", scope: !170, file: !169, line: 524, baseType: !206, size: 64, align: 64, offset: 1216)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "age_index", scope: !170, file: !169, line: 529, baseType: !200, size: 32, align: 32, offset: 1280)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !170, file: !169, line: 542, baseType: !213, size: 64, align: 32, offset: 1312)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf", scope: !170, file: !169, line: 547, baseType: !285, size: 64, align: 64, offset: 1408)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf_size", scope: !170, file: !169, line: 553, baseType: !200, size: 32, align: 32, offset: 1472)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "min_samples", scope: !170, file: !169, line: 562, baseType: !200, size: 32, align: 32, offset: 1504)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "max_samples", scope: !170, file: !169, line: 568, baseType: !200, size: 32, align: 32, offset: 1536)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !170, file: !169, line: 573, baseType: !200, size: 32, align: 32, offset: 1568)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !170, file: !169, line: 578, baseType: !442, size: 32, align: 32, offset: 1600)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_in", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1664)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_out", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1728)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pool", scope: !170, file: !169, line: 588, baseType: !191, size: 64, align: 64, offset: 1792)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "frame_wanted_out", scope: !170, file: !169, line: 595, baseType: !200, size: 32, align: 32, offset: 1856)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !170, file: !169, line: 601, baseType: !327, size: 64, align: 64, offset: 1920)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !170, file: !169, line: 610, baseType: !572, size: 491520, align: 8, offset: 1984)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 491520, align: 8, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 61440)
!575 = !{!576, !577, !578}
!576 = !DIEnumerator(name: "AVLINK_UNINIT", value: 0)
!577 = !DIEnumerator(name: "AVLINK_STARTINIT", value: 1)
!578 = !DIEnumerator(name: "AVLINK_INIT", value: 2)
!579 = !{!200, !442, !580, !584, !585, !291, !587, !590, !316, !591, !544}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !207, line: 49, baseType: !583)
!583 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !589)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !207, line: 51, baseType: !442)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !316)
!593 = !{!594, !596, !600, !601, !602}
!594 = distinct !DIGlobalVariable(name: "ff_vf_hflip", scope: !0, file: !595, line: 246, type: !267, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_vf_hflip)
!595 = !DIFile(filename: "libavfilter/vf_hflip.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!596 = distinct !DIGlobalVariable(name: "avfilter_vf_hflip_inputs", scope: !0, file: !595, line: 228, type: !597, isLocal: true, isDefinition: true, variable: [2 x %struct.AVFilterPad]* @avfilter_vf_hflip_inputs)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 1152, align: 64, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 2)
!600 = distinct !DIGlobalVariable(name: "avfilter_vf_hflip_outputs", scope: !0, file: !595, line: 238, type: !597, isLocal: true, isDefinition: true, variable: [2 x %struct.AVFilterPad]* @avfilter_vf_hflip_outputs)
!601 = distinct !DIGlobalVariable(name: "hflip_class", scope: !0, file: !595, line: 44, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @hflip_class)
!602 = distinct !DIGlobalVariable(name: "hflip_options", scope: !0, file: !595, line: 40, type: !603, isLocal: true, isDefinition: true, variable: [1 x %struct.AVOption]* @hflip_options)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !604, size: 512, align: 64, elements: !606)
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !4, line: 301, baseType: !195)
!606 = !{!607}
!607 = !DISubrange(count: 1)
!608 = !{i32 2, !"Dwarf Version", i32 4}
!609 = !{i32 2, !"Debug Info Version", i32 3}
!610 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!611 = distinct !DISubprogram(name: "ff_hflip_init", scope: !595, file: !595, line: 147, type: !612, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !631)
!612 = !DISubroutineType(types: !613)
!613 = !{!200, !614, !474, !200}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "FlipContext", file: !616, line: 34, baseType: !617)
!616 = !DIFile(filename: "libavfilter/hflip.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FlipContext", file: !616, line: 27, size: 704, align: 64, elements: !618)
!618 = !{!619, !620, !624, !625, !626}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !617, file: !616, line: 28, baseType: !178, size: 64, align: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "max_step", scope: !617, file: !616, line: 29, baseType: !621, size: 128, align: 32, offset: 64)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 128, align: 32, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 4)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "planewidth", scope: !617, file: !616, line: 30, baseType: !621, size: 128, align: 32, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "planeheight", scope: !617, file: !616, line: 31, baseType: !621, size: 128, align: 32, offset: 320)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "flip_line", scope: !617, file: !616, line: 33, baseType: !627, size: 256, align: 64, offset: 448)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 256, align: 64, elements: !622)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64, align: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !585, !291, !200}
!631 = !{}
!632 = !DILocalVariable(name: "s", arg: 1, scope: !611, file: !595, line: 147, type: !614)
!633 = !DIExpression()
!634 = !DILocation(line: 147, column: 32, scope: !611)
!635 = !DILocalVariable(name: "step", arg: 2, scope: !611, file: !595, line: 147, type: !474)
!636 = !DILocation(line: 147, column: 39, scope: !611)
!637 = !DILocalVariable(name: "nb_planes", arg: 3, scope: !611, file: !595, line: 147, type: !200)
!638 = !DILocation(line: 147, column: 52, scope: !611)
!639 = !DILocalVariable(name: "i", scope: !611, file: !595, line: 149, type: !200)
!640 = !DILocation(line: 149, column: 9, scope: !611)
!641 = !DILocation(line: 151, column: 12, scope: !642)
!642 = distinct !DILexicalBlock(scope: !611, file: !595, line: 151, column: 5)
!643 = !DILocation(line: 151, column: 10, scope: !642)
!644 = !DILocation(line: 151, column: 17, scope: !645)
!645 = !DILexicalBlockFile(scope: !646, file: !595, discriminator: 1)
!646 = distinct !DILexicalBlock(scope: !642, file: !595, line: 151, column: 5)
!647 = !DILocation(line: 151, column: 21, scope: !645)
!648 = !DILocation(line: 151, column: 19, scope: !645)
!649 = !DILocation(line: 151, column: 5, scope: !645)
!650 = !DILocation(line: 152, column: 22, scope: !651)
!651 = distinct !DILexicalBlock(scope: !646, file: !595, line: 151, column: 37)
!652 = !DILocation(line: 152, column: 17, scope: !651)
!653 = !DILocation(line: 152, column: 9, scope: !651)
!654 = !DILocation(line: 153, column: 30, scope: !655)
!655 = distinct !DILexicalBlock(scope: !651, file: !595, line: 152, column: 26)
!656 = !DILocation(line: 153, column: 17, scope: !655)
!657 = !DILocation(line: 153, column: 20, scope: !655)
!658 = !DILocation(line: 153, column: 33, scope: !655)
!659 = !DILocation(line: 153, column: 49, scope: !655)
!660 = !DILocation(line: 154, column: 30, scope: !655)
!661 = !DILocation(line: 154, column: 17, scope: !655)
!662 = !DILocation(line: 154, column: 20, scope: !655)
!663 = !DILocation(line: 154, column: 33, scope: !655)
!664 = !DILocation(line: 154, column: 50, scope: !655)
!665 = !DILocation(line: 155, column: 30, scope: !655)
!666 = !DILocation(line: 155, column: 17, scope: !655)
!667 = !DILocation(line: 155, column: 20, scope: !655)
!668 = !DILocation(line: 155, column: 33, scope: !655)
!669 = !DILocation(line: 155, column: 48, scope: !655)
!670 = !DILocation(line: 156, column: 30, scope: !655)
!671 = !DILocation(line: 156, column: 17, scope: !655)
!672 = !DILocation(line: 156, column: 20, scope: !655)
!673 = !DILocation(line: 156, column: 33, scope: !655)
!674 = !DILocation(line: 156, column: 50, scope: !655)
!675 = !DILocation(line: 157, column: 30, scope: !655)
!676 = !DILocation(line: 157, column: 17, scope: !655)
!677 = !DILocation(line: 157, column: 20, scope: !655)
!678 = !DILocation(line: 157, column: 33, scope: !655)
!679 = !DILocation(line: 157, column: 48, scope: !655)
!680 = !DILocation(line: 158, column: 30, scope: !655)
!681 = !DILocation(line: 158, column: 17, scope: !655)
!682 = !DILocation(line: 158, column: 20, scope: !655)
!683 = !DILocation(line: 158, column: 33, scope: !655)
!684 = !DILocation(line: 158, column: 50, scope: !655)
!685 = !DILocation(line: 160, column: 13, scope: !655)
!686 = !DILocation(line: 162, column: 5, scope: !651)
!687 = !DILocation(line: 151, column: 33, scope: !688)
!688 = !DILexicalBlockFile(scope: !646, file: !595, discriminator: 2)
!689 = !DILocation(line: 151, column: 5, scope: !688)
!690 = distinct !{!690, !691}
!691 = !DILocation(line: 151, column: 5, scope: !611)
!692 = !DILocation(line: 164, column: 27, scope: !693)
!693 = distinct !DILexicalBlock(scope: !611, file: !595, line: 163, column: 9)
!694 = !DILocation(line: 164, column: 30, scope: !693)
!695 = !DILocation(line: 164, column: 36, scope: !693)
!696 = !DILocation(line: 164, column: 9, scope: !693)
!697 = !DILocation(line: 166, column: 5, scope: !611)
!698 = !DILocation(line: 167, column: 1, scope: !611)
!699 = distinct !DISubprogram(name: "hflip_byte_c", scope: !595, file: !595, line: 64, type: !629, isLocal: true, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !631)
!700 = !DILocalVariable(name: "src", arg: 1, scope: !699, file: !595, line: 64, type: !585)
!701 = !DILocation(line: 64, column: 41, scope: !699)
!702 = !DILocalVariable(name: "dst", arg: 2, scope: !699, file: !595, line: 64, type: !291)
!703 = !DILocation(line: 64, column: 55, scope: !699)
!704 = !DILocalVariable(name: "w", arg: 3, scope: !699, file: !595, line: 64, type: !200)
!705 = !DILocation(line: 64, column: 64, scope: !699)
!706 = !DILocalVariable(name: "j", scope: !699, file: !595, line: 66, type: !200)
!707 = !DILocation(line: 66, column: 9, scope: !699)
!708 = !DILocation(line: 68, column: 12, scope: !709)
!709 = distinct !DILexicalBlock(scope: !699, file: !595, line: 68, column: 5)
!710 = !DILocation(line: 68, column: 10, scope: !709)
!711 = !DILocation(line: 68, column: 17, scope: !712)
!712 = !DILexicalBlockFile(scope: !713, file: !595, discriminator: 1)
!713 = distinct !DILexicalBlock(scope: !709, file: !595, line: 68, column: 5)
!714 = !DILocation(line: 68, column: 21, scope: !712)
!715 = !DILocation(line: 68, column: 19, scope: !712)
!716 = !DILocation(line: 68, column: 5, scope: !712)
!717 = !DILocation(line: 69, column: 23, scope: !713)
!718 = !DILocation(line: 69, column: 22, scope: !713)
!719 = !DILocation(line: 69, column: 18, scope: !713)
!720 = !DILocation(line: 69, column: 13, scope: !713)
!721 = !DILocation(line: 69, column: 9, scope: !713)
!722 = !DILocation(line: 69, column: 16, scope: !713)
!723 = !DILocation(line: 68, column: 25, scope: !724)
!724 = !DILexicalBlockFile(scope: !713, file: !595, discriminator: 2)
!725 = !DILocation(line: 68, column: 5, scope: !724)
!726 = distinct !{!726, !727}
!727 = !DILocation(line: 68, column: 5, scope: !699)
!728 = !DILocation(line: 70, column: 1, scope: !699)
!729 = distinct !DISubprogram(name: "hflip_short_c", scope: !595, file: !595, line: 72, type: !629, isLocal: true, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !631)
!730 = !DILocalVariable(name: "ssrc", arg: 1, scope: !729, file: !595, line: 72, type: !585)
!731 = !DILocation(line: 72, column: 42, scope: !729)
!732 = !DILocalVariable(name: "ddst", arg: 2, scope: !729, file: !595, line: 72, type: !291)
!733 = !DILocation(line: 72, column: 57, scope: !729)
!734 = !DILocalVariable(name: "w", arg: 3, scope: !729, file: !595, line: 72, type: !200)
!735 = !DILocation(line: 72, column: 67, scope: !729)
!736 = !DILocalVariable(name: "src", scope: !729, file: !595, line: 74, type: !580)
!737 = !DILocation(line: 74, column: 21, scope: !729)
!738 = !DILocation(line: 74, column: 45, scope: !729)
!739 = !DILocation(line: 74, column: 27, scope: !729)
!740 = !DILocalVariable(name: "dst", scope: !729, file: !595, line: 75, type: !584)
!741 = !DILocation(line: 75, column: 15, scope: !729)
!742 = !DILocation(line: 75, column: 33, scope: !729)
!743 = !DILocation(line: 75, column: 21, scope: !729)
!744 = !DILocalVariable(name: "j", scope: !729, file: !595, line: 76, type: !200)
!745 = !DILocation(line: 76, column: 9, scope: !729)
!746 = !DILocation(line: 78, column: 12, scope: !747)
!747 = distinct !DILexicalBlock(scope: !729, file: !595, line: 78, column: 5)
!748 = !DILocation(line: 78, column: 10, scope: !747)
!749 = !DILocation(line: 78, column: 17, scope: !750)
!750 = !DILexicalBlockFile(scope: !751, file: !595, discriminator: 1)
!751 = distinct !DILexicalBlock(scope: !747, file: !595, line: 78, column: 5)
!752 = !DILocation(line: 78, column: 21, scope: !750)
!753 = !DILocation(line: 78, column: 19, scope: !750)
!754 = !DILocation(line: 78, column: 5, scope: !750)
!755 = !DILocation(line: 79, column: 23, scope: !751)
!756 = !DILocation(line: 79, column: 22, scope: !751)
!757 = !DILocation(line: 79, column: 18, scope: !751)
!758 = !DILocation(line: 79, column: 13, scope: !751)
!759 = !DILocation(line: 79, column: 9, scope: !751)
!760 = !DILocation(line: 79, column: 16, scope: !751)
!761 = !DILocation(line: 78, column: 25, scope: !762)
!762 = !DILexicalBlockFile(scope: !751, file: !595, discriminator: 2)
!763 = !DILocation(line: 78, column: 5, scope: !762)
!764 = distinct !{!764, !765}
!765 = !DILocation(line: 78, column: 5, scope: !729)
!766 = !DILocation(line: 80, column: 1, scope: !729)
!767 = distinct !DISubprogram(name: "hflip_b24_c", scope: !595, file: !595, line: 92, type: !629, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !631)
!768 = !DILocalVariable(name: "src", arg: 1, scope: !767, file: !595, line: 92, type: !585)
!769 = !DILocation(line: 92, column: 40, scope: !767)
!770 = !DILocalVariable(name: "dst", arg: 2, scope: !767, file: !595, line: 92, type: !291)
!771 = !DILocation(line: 92, column: 54, scope: !767)
!772 = !DILocalVariable(name: "w", arg: 3, scope: !767, file: !595, line: 92, type: !200)
!773 = !DILocation(line: 92, column: 63, scope: !767)
!774 = !DILocalVariable(name: "in", scope: !767, file: !595, line: 94, type: !585)
!775 = !DILocation(line: 94, column: 20, scope: !767)
!776 = !DILocation(line: 94, column: 25, scope: !767)
!777 = !DILocalVariable(name: "out", scope: !767, file: !595, line: 95, type: !291)
!778 = !DILocation(line: 95, column: 14, scope: !767)
!779 = !DILocation(line: 95, column: 20, scope: !767)
!780 = !DILocalVariable(name: "j", scope: !767, file: !595, line: 96, type: !200)
!781 = !DILocation(line: 96, column: 9, scope: !767)
!782 = !DILocation(line: 98, column: 12, scope: !783)
!783 = distinct !DILexicalBlock(scope: !767, file: !595, line: 98, column: 5)
!784 = !DILocation(line: 98, column: 10, scope: !783)
!785 = !DILocation(line: 98, column: 17, scope: !786)
!786 = !DILexicalBlockFile(scope: !787, file: !595, discriminator: 1)
!787 = distinct !DILexicalBlock(scope: !783, file: !595, line: 98, column: 5)
!788 = !DILocation(line: 98, column: 21, scope: !786)
!789 = !DILocation(line: 98, column: 19, scope: !786)
!790 = !DILocation(line: 98, column: 5, scope: !786)
!791 = !DILocalVariable(name: "v", scope: !792, file: !595, line: 99, type: !793)
!792 = distinct !DILexicalBlock(scope: !787, file: !595, line: 98, column: 48)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !207, line: 38, baseType: !200)
!794 = !DILocation(line: 99, column: 17, scope: !792)
!795 = !DILocation(line: 99, column: 41, scope: !792)
!796 = !DILocation(line: 99, column: 23, scope: !792)
!797 = !DILocation(line: 99, column: 49, scope: !792)
!798 = !DILocation(line: 99, column: 77, scope: !792)
!799 = !DILocation(line: 99, column: 59, scope: !792)
!800 = !DILocation(line: 99, column: 85, scope: !792)
!801 = !DILocation(line: 99, column: 56, scope: !792)
!802 = !DILocation(line: 99, column: 111, scope: !792)
!803 = !DILocation(line: 99, column: 93, scope: !792)
!804 = !DILocation(line: 99, column: 91, scope: !792)
!805 = !DILocation(line: 101, column: 9, scope: !792)
!806 = distinct !{!806, !805}
!807 = !DILocation(line: 101, column: 38, scope: !808)
!808 = !DILexicalBlockFile(scope: !809, file: !595, discriminator: 1)
!809 = distinct !DILexicalBlock(scope: !792, file: !595, line: 101, column: 12)
!810 = !DILocation(line: 101, column: 37, scope: !808)
!811 = !DILocation(line: 101, column: 26, scope: !808)
!812 = !DILocation(line: 101, column: 14, scope: !808)
!813 = !DILocation(line: 101, column: 35, scope: !808)
!814 = !DILocation(line: 101, column: 66, scope: !808)
!815 = !DILocation(line: 101, column: 68, scope: !808)
!816 = !DILocation(line: 101, column: 65, scope: !808)
!817 = !DILocation(line: 101, column: 54, scope: !808)
!818 = !DILocation(line: 101, column: 42, scope: !808)
!819 = !DILocation(line: 101, column: 63, scope: !808)
!820 = !DILocation(line: 101, column: 97, scope: !808)
!821 = !DILocation(line: 101, column: 99, scope: !808)
!822 = !DILocation(line: 101, column: 96, scope: !808)
!823 = !DILocation(line: 101, column: 85, scope: !808)
!824 = !DILocation(line: 101, column: 73, scope: !808)
!825 = !DILocation(line: 101, column: 94, scope: !808)
!826 = !DILocation(line: 101, column: 105, scope: !808)
!827 = !DILocation(line: 102, column: 5, scope: !792)
!828 = !DILocation(line: 98, column: 25, scope: !829)
!829 = !DILexicalBlockFile(scope: !787, file: !595, discriminator: 2)
!830 = !DILocation(line: 98, column: 33, scope: !829)
!831 = !DILocation(line: 98, column: 42, scope: !829)
!832 = !DILocation(line: 98, column: 5, scope: !829)
!833 = distinct !{!833, !834}
!834 = !DILocation(line: 98, column: 5, scope: !767)
!835 = !DILocation(line: 103, column: 1, scope: !767)
!836 = distinct !DISubprogram(name: "hflip_dword_c", scope: !595, file: !595, line: 82, type: !629, isLocal: true, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !631)
!837 = !DILocalVariable(name: "ssrc", arg: 1, scope: !836, file: !595, line: 82, type: !585)
!838 = !DILocation(line: 82, column: 42, scope: !836)
!839 = !DILocalVariable(name: "ddst", arg: 2, scope: !836, file: !595, line: 82, type: !291)
!840 = !DILocation(line: 82, column: 57, scope: !836)
!841 = !DILocalVariable(name: "w", arg: 3, scope: !836, file: !595, line: 82, type: !200)
!842 = !DILocation(line: 82, column: 67, scope: !836)
!843 = !DILocalVariable(name: "src", scope: !836, file: !595, line: 84, type: !587)
!844 = !DILocation(line: 84, column: 21, scope: !836)
!845 = !DILocation(line: 84, column: 45, scope: !836)
!846 = !DILocation(line: 84, column: 27, scope: !836)
!847 = !DILocalVariable(name: "dst", scope: !836, file: !595, line: 85, type: !590)
!848 = !DILocation(line: 85, column: 15, scope: !836)
!849 = !DILocation(line: 85, column: 33, scope: !836)
!850 = !DILocation(line: 85, column: 21, scope: !836)
!851 = !DILocalVariable(name: "j", scope: !836, file: !595, line: 86, type: !200)
!852 = !DILocation(line: 86, column: 9, scope: !836)
!853 = !DILocation(line: 88, column: 12, scope: !854)
!854 = distinct !DILexicalBlock(scope: !836, file: !595, line: 88, column: 5)
!855 = !DILocation(line: 88, column: 10, scope: !854)
!856 = !DILocation(line: 88, column: 17, scope: !857)
!857 = !DILexicalBlockFile(scope: !858, file: !595, discriminator: 1)
!858 = distinct !DILexicalBlock(scope: !854, file: !595, line: 88, column: 5)
!859 = !DILocation(line: 88, column: 21, scope: !857)
!860 = !DILocation(line: 88, column: 19, scope: !857)
!861 = !DILocation(line: 88, column: 5, scope: !857)
!862 = !DILocation(line: 89, column: 23, scope: !858)
!863 = !DILocation(line: 89, column: 22, scope: !858)
!864 = !DILocation(line: 89, column: 18, scope: !858)
!865 = !DILocation(line: 89, column: 13, scope: !858)
!866 = !DILocation(line: 89, column: 9, scope: !858)
!867 = !DILocation(line: 89, column: 16, scope: !858)
!868 = !DILocation(line: 88, column: 25, scope: !869)
!869 = !DILexicalBlockFile(scope: !858, file: !595, discriminator: 2)
!870 = !DILocation(line: 88, column: 5, scope: !869)
!871 = distinct !{!871, !872}
!872 = !DILocation(line: 88, column: 5, scope: !836)
!873 = !DILocation(line: 90, column: 1, scope: !836)
!874 = distinct !DISubprogram(name: "hflip_b48_c", scope: !595, file: !595, line: 105, type: !629, isLocal: true, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !631)
!875 = !DILocalVariable(name: "src", arg: 1, scope: !874, file: !595, line: 105, type: !585)
!876 = !DILocation(line: 105, column: 40, scope: !874)
!877 = !DILocalVariable(name: "dst", arg: 2, scope: !874, file: !595, line: 105, type: !291)
!878 = !DILocation(line: 105, column: 54, scope: !874)
!879 = !DILocalVariable(name: "w", arg: 3, scope: !874, file: !595, line: 105, type: !200)
!880 = !DILocation(line: 105, column: 63, scope: !874)
!881 = !DILocalVariable(name: "in", scope: !874, file: !595, line: 107, type: !585)
!882 = !DILocation(line: 107, column: 20, scope: !874)
!883 = !DILocation(line: 107, column: 25, scope: !874)
!884 = !DILocalVariable(name: "out", scope: !874, file: !595, line: 108, type: !291)
!885 = !DILocation(line: 108, column: 14, scope: !874)
!886 = !DILocation(line: 108, column: 20, scope: !874)
!887 = !DILocalVariable(name: "j", scope: !874, file: !595, line: 109, type: !200)
!888 = !DILocation(line: 109, column: 9, scope: !874)
!889 = !DILocation(line: 111, column: 12, scope: !890)
!890 = distinct !DILexicalBlock(scope: !874, file: !595, line: 111, column: 5)
!891 = !DILocation(line: 111, column: 10, scope: !890)
!892 = !DILocation(line: 111, column: 17, scope: !893)
!893 = !DILexicalBlockFile(scope: !894, file: !595, discriminator: 1)
!894 = distinct !DILexicalBlock(scope: !890, file: !595, line: 111, column: 5)
!895 = !DILocation(line: 111, column: 21, scope: !893)
!896 = !DILocation(line: 111, column: 19, scope: !893)
!897 = !DILocation(line: 111, column: 5, scope: !893)
!898 = !DILocalVariable(name: "v", scope: !899, file: !595, line: 112, type: !206)
!899 = distinct !DILexicalBlock(scope: !894, file: !595, line: 111, column: 48)
!900 = !DILocation(line: 112, column: 17, scope: !899)
!901 = !DILocation(line: 112, column: 51, scope: !899)
!902 = !DILocation(line: 112, column: 33, scope: !899)
!903 = !DILocation(line: 112, column: 23, scope: !899)
!904 = !DILocation(line: 112, column: 59, scope: !899)
!905 = !DILocation(line: 112, column: 97, scope: !899)
!906 = !DILocation(line: 112, column: 79, scope: !899)
!907 = !DILocation(line: 112, column: 69, scope: !899)
!908 = !DILocation(line: 112, column: 105, scope: !899)
!909 = !DILocation(line: 112, column: 66, scope: !899)
!910 = !DILocation(line: 112, column: 143, scope: !899)
!911 = !DILocation(line: 112, column: 125, scope: !899)
!912 = !DILocation(line: 112, column: 115, scope: !899)
!913 = !DILocation(line: 112, column: 151, scope: !899)
!914 = !DILocation(line: 112, column: 112, scope: !899)
!915 = !DILocation(line: 112, column: 189, scope: !899)
!916 = !DILocation(line: 112, column: 171, scope: !899)
!917 = !DILocation(line: 112, column: 161, scope: !899)
!918 = !DILocation(line: 112, column: 197, scope: !899)
!919 = !DILocation(line: 112, column: 158, scope: !899)
!920 = !DILocation(line: 112, column: 235, scope: !899)
!921 = !DILocation(line: 112, column: 217, scope: !899)
!922 = !DILocation(line: 112, column: 207, scope: !899)
!923 = !DILocation(line: 112, column: 243, scope: !899)
!924 = !DILocation(line: 112, column: 204, scope: !899)
!925 = !DILocation(line: 112, column: 279, scope: !899)
!926 = !DILocation(line: 112, column: 261, scope: !899)
!927 = !DILocation(line: 112, column: 251, scope: !899)
!928 = !DILocation(line: 112, column: 249, scope: !899)
!929 = !DILocation(line: 114, column: 9, scope: !899)
!930 = distinct !{!930, !929}
!931 = !DILocalVariable(name: "d", scope: !932, file: !595, line: 114, type: !316)
!932 = distinct !DILexicalBlock(scope: !899, file: !595, line: 114, column: 12)
!933 = !DILocation(line: 114, column: 23, scope: !932)
!934 = !DILocation(line: 114, column: 28, scope: !935)
!935 = !DILexicalBlockFile(scope: !932, file: !595, discriminator: 1)
!936 = !DILocation(line: 114, column: 23, scope: !935)
!937 = !DILocation(line: 114, column: 56, scope: !935)
!938 = !DILocation(line: 114, column: 55, scope: !935)
!939 = !DILocation(line: 114, column: 44, scope: !935)
!940 = !DILocation(line: 114, column: 32, scope: !935)
!941 = !DILocation(line: 114, column: 53, scope: !935)
!942 = !DILocation(line: 114, column: 84, scope: !935)
!943 = !DILocation(line: 114, column: 86, scope: !935)
!944 = !DILocation(line: 114, column: 83, scope: !935)
!945 = !DILocation(line: 114, column: 72, scope: !935)
!946 = !DILocation(line: 114, column: 60, scope: !935)
!947 = !DILocation(line: 114, column: 81, scope: !935)
!948 = !DILocation(line: 114, column: 115, scope: !935)
!949 = !DILocation(line: 114, column: 117, scope: !935)
!950 = !DILocation(line: 114, column: 114, scope: !935)
!951 = !DILocation(line: 114, column: 103, scope: !935)
!952 = !DILocation(line: 114, column: 91, scope: !935)
!953 = !DILocation(line: 114, column: 112, scope: !935)
!954 = !DILocation(line: 114, column: 147, scope: !935)
!955 = !DILocation(line: 114, column: 149, scope: !935)
!956 = !DILocation(line: 114, column: 146, scope: !935)
!957 = !DILocation(line: 114, column: 135, scope: !935)
!958 = !DILocation(line: 114, column: 123, scope: !935)
!959 = !DILocation(line: 114, column: 144, scope: !935)
!960 = !DILocation(line: 114, column: 179, scope: !935)
!961 = !DILocation(line: 114, column: 181, scope: !935)
!962 = !DILocation(line: 114, column: 178, scope: !935)
!963 = !DILocation(line: 114, column: 167, scope: !935)
!964 = !DILocation(line: 114, column: 155, scope: !935)
!965 = !DILocation(line: 114, column: 176, scope: !935)
!966 = !DILocation(line: 114, column: 211, scope: !935)
!967 = !DILocation(line: 114, column: 213, scope: !935)
!968 = !DILocation(line: 114, column: 210, scope: !935)
!969 = !DILocation(line: 114, column: 199, scope: !935)
!970 = !DILocation(line: 114, column: 187, scope: !935)
!971 = !DILocation(line: 114, column: 208, scope: !935)
!972 = !DILocation(line: 114, column: 219, scope: !935)
!973 = !DILocation(line: 115, column: 5, scope: !899)
!974 = !DILocation(line: 111, column: 25, scope: !975)
!975 = !DILexicalBlockFile(scope: !894, file: !595, discriminator: 2)
!976 = !DILocation(line: 111, column: 33, scope: !975)
!977 = !DILocation(line: 111, column: 42, scope: !975)
!978 = !DILocation(line: 111, column: 5, scope: !975)
!979 = distinct !{!979, !980}
!980 = !DILocation(line: 111, column: 5, scope: !874)
!981 = !DILocation(line: 116, column: 1, scope: !874)
!982 = distinct !DISubprogram(name: "hflip_qword_c", scope: !595, file: !595, line: 118, type: !629, isLocal: true, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !631)
!983 = !DILocalVariable(name: "ssrc", arg: 1, scope: !982, file: !595, line: 118, type: !585)
!984 = !DILocation(line: 118, column: 42, scope: !982)
!985 = !DILocalVariable(name: "ddst", arg: 2, scope: !982, file: !595, line: 118, type: !291)
!986 = !DILocation(line: 118, column: 57, scope: !982)
!987 = !DILocalVariable(name: "w", arg: 3, scope: !982, file: !595, line: 118, type: !200)
!988 = !DILocation(line: 118, column: 67, scope: !982)
!989 = !DILocalVariable(name: "src", scope: !982, file: !595, line: 120, type: !591)
!990 = !DILocation(line: 120, column: 21, scope: !982)
!991 = !DILocation(line: 120, column: 45, scope: !982)
!992 = !DILocation(line: 120, column: 27, scope: !982)
!993 = !DILocalVariable(name: "dst", scope: !982, file: !595, line: 121, type: !544)
!994 = !DILocation(line: 121, column: 15, scope: !982)
!995 = !DILocation(line: 121, column: 33, scope: !982)
!996 = !DILocation(line: 121, column: 21, scope: !982)
!997 = !DILocalVariable(name: "j", scope: !982, file: !595, line: 122, type: !200)
!998 = !DILocation(line: 122, column: 9, scope: !982)
!999 = !DILocation(line: 124, column: 12, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !982, file: !595, line: 124, column: 5)
!1001 = !DILocation(line: 124, column: 10, scope: !1000)
!1002 = !DILocation(line: 124, column: 17, scope: !1003)
!1003 = !DILexicalBlockFile(scope: !1004, file: !595, discriminator: 1)
!1004 = distinct !DILexicalBlock(scope: !1000, file: !595, line: 124, column: 5)
!1005 = !DILocation(line: 124, column: 21, scope: !1003)
!1006 = !DILocation(line: 124, column: 19, scope: !1003)
!1007 = !DILocation(line: 124, column: 5, scope: !1003)
!1008 = !DILocation(line: 125, column: 23, scope: !1004)
!1009 = !DILocation(line: 125, column: 22, scope: !1004)
!1010 = !DILocation(line: 125, column: 18, scope: !1004)
!1011 = !DILocation(line: 125, column: 13, scope: !1004)
!1012 = !DILocation(line: 125, column: 9, scope: !1004)
!1013 = !DILocation(line: 125, column: 16, scope: !1004)
!1014 = !DILocation(line: 124, column: 25, scope: !1015)
!1015 = !DILexicalBlockFile(scope: !1004, file: !595, discriminator: 2)
!1016 = !DILocation(line: 124, column: 5, scope: !1015)
!1017 = distinct !{!1017, !1018}
!1018 = !DILocation(line: 124, column: 5, scope: !982)
!1019 = !DILocation(line: 126, column: 1, scope: !982)
!1020 = distinct !DISubprogram(name: "query_formats", scope: !595, file: !595, line: 46, type: !409, isLocal: true, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !631)
!1021 = !DILocalVariable(name: "ctx", arg: 1, scope: !1020, file: !595, line: 46, type: !173)
!1022 = !DILocation(line: 46, column: 43, scope: !1020)
!1023 = !DILocalVariable(name: "pix_fmts", scope: !1020, file: !595, line: 48, type: !524)
!1024 = !DILocation(line: 48, column: 22, scope: !1020)
!1025 = !DILocalVariable(name: "fmt", scope: !1020, file: !595, line: 49, type: !200)
!1026 = !DILocation(line: 49, column: 9, scope: !1020)
!1027 = !DILocalVariable(name: "ret", scope: !1020, file: !595, line: 49, type: !200)
!1028 = !DILocation(line: 49, column: 14, scope: !1020)
!1029 = !DILocation(line: 51, column: 14, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1020, file: !595, line: 51, column: 5)
!1031 = !DILocation(line: 51, column: 10, scope: !1030)
!1032 = !DILocation(line: 51, column: 39, scope: !1033)
!1033 = !DILexicalBlockFile(scope: !1034, file: !595, discriminator: 1)
!1034 = distinct !DILexicalBlock(scope: !1030, file: !595, line: 51, column: 5)
!1035 = !DILocation(line: 51, column: 19, scope: !1033)
!1036 = !DILocation(line: 51, column: 5, scope: !1033)
!1037 = !DILocalVariable(name: "desc", scope: !1038, file: !595, line: 52, type: !1039)
!1038 = distinct !DILexicalBlock(scope: !1034, file: !595, line: 51, column: 52)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1041)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPixFmtDescriptor", file: !1042, line: 123, baseType: !1043)
!1042 = !DIFile(filename: "./libavutil/pixdesc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPixFmtDescriptor", file: !1042, line: 81, size: 1280, align: 64, elements: !1044)
!1044 = !{!1045, !1046, !1047, !1048, !1049, !1050, !1063}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1043, file: !1042, line: 82, baseType: !184, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1043, file: !1042, line: 83, baseType: !292, size: 8, align: 8, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_w", scope: !1043, file: !1042, line: 92, baseType: !292, size: 8, align: 8, offset: 72)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_h", scope: !1043, file: !1042, line: 101, baseType: !292, size: 8, align: 8, offset: 80)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1043, file: !1042, line: 106, baseType: !316, size: 64, align: 64, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !1043, file: !1042, line: 117, baseType: !1051, size: 1024, align: 32, offset: 192)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 1024, align: 32, elements: !622)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVComponentDescriptor", file: !1042, line: 70, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVComponentDescriptor", file: !1042, line: 31, size: 256, align: 32, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !1053, file: !1042, line: 35, baseType: !200, size: 32, align: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !1053, file: !1042, line: 41, baseType: !200, size: 32, align: 32, offset: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1053, file: !1042, line: 47, baseType: !200, size: 32, align: 32, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !1053, file: !1042, line: 53, baseType: !200, size: 32, align: 32, offset: 96)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1053, file: !1042, line: 58, baseType: !200, size: 32, align: 32, offset: 128)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "step_minus1", scope: !1053, file: !1042, line: 62, baseType: !200, size: 32, align: 32, offset: 160)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "depth_minus1", scope: !1053, file: !1042, line: 65, baseType: !200, size: 32, align: 32, offset: 192)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "offset_plus1", scope: !1053, file: !1042, line: 68, baseType: !200, size: 32, align: 32, offset: 224)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1043, file: !1042, line: 122, baseType: !184, size: 64, align: 64, offset: 1216)
!1064 = !DILocation(line: 52, column: 35, scope: !1038)
!1065 = !DILocation(line: 52, column: 62, scope: !1038)
!1066 = !DILocation(line: 52, column: 42, scope: !1038)
!1067 = !DILocation(line: 53, column: 15, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1038, file: !595, line: 53, column: 13)
!1069 = !DILocation(line: 53, column: 21, scope: !1068)
!1070 = !DILocation(line: 53, column: 27, scope: !1068)
!1071 = !DILocation(line: 53, column: 38, scope: !1068)
!1072 = !DILocation(line: 54, column: 15, scope: !1068)
!1073 = !DILocation(line: 54, column: 21, scope: !1068)
!1074 = !DILocation(line: 54, column: 27, scope: !1068)
!1075 = !DILocation(line: 54, column: 38, scope: !1068)
!1076 = !DILocation(line: 55, column: 16, scope: !1068)
!1077 = !DILocation(line: 55, column: 22, scope: !1068)
!1078 = !DILocation(line: 55, column: 39, scope: !1068)
!1079 = !DILocation(line: 55, column: 45, scope: !1068)
!1080 = !DILocation(line: 55, column: 36, scope: !1068)
!1081 = !DILocation(line: 55, column: 59, scope: !1068)
!1082 = !DILocation(line: 56, column: 16, scope: !1068)
!1083 = !DILocation(line: 56, column: 22, scope: !1068)
!1084 = !DILocation(line: 56, column: 30, scope: !1068)
!1085 = !DILocation(line: 56, column: 39, scope: !1068)
!1086 = !DILocation(line: 56, column: 45, scope: !1068)
!1087 = !DILocation(line: 56, column: 53, scope: !1068)
!1088 = !DILocation(line: 56, column: 36, scope: !1068)
!1089 = !DILocation(line: 56, column: 61, scope: !1068)
!1090 = !DILocation(line: 57, column: 45, scope: !1068)
!1091 = !DILocation(line: 57, column: 20, scope: !1068)
!1092 = !DILocation(line: 57, column: 18, scope: !1068)
!1093 = !DILocation(line: 57, column: 51, scope: !1068)
!1094 = !DILocation(line: 53, column: 13, scope: !1095)
!1095 = !DILexicalBlockFile(scope: !1038, file: !595, discriminator: 1)
!1096 = !DILocation(line: 58, column: 20, scope: !1068)
!1097 = !DILocation(line: 58, column: 13, scope: !1068)
!1098 = !DILocation(line: 59, column: 5, scope: !1038)
!1099 = !DILocation(line: 51, column: 48, scope: !1100)
!1100 = !DILexicalBlockFile(scope: !1034, file: !595, discriminator: 2)
!1101 = !DILocation(line: 51, column: 5, scope: !1100)
!1102 = distinct !{!1102, !1103}
!1103 = !DILocation(line: 51, column: 5, scope: !1020)
!1104 = !DILocation(line: 61, column: 34, scope: !1020)
!1105 = !DILocation(line: 61, column: 39, scope: !1020)
!1106 = !DILocation(line: 61, column: 12, scope: !1020)
!1107 = !DILocation(line: 61, column: 5, scope: !1020)
!1108 = !DILocation(line: 62, column: 1, scope: !1020)
!1109 = distinct !DISubprogram(name: "filter_frame", scope: !595, file: !595, line: 203, type: !394, isLocal: true, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !631)
!1110 = !DILocalVariable(name: "inlink", arg: 1, scope: !1109, file: !595, line: 203, type: !386)
!1111 = !DILocation(line: 203, column: 39, scope: !1109)
!1112 = !DILocalVariable(name: "in", arg: 2, scope: !1109, file: !595, line: 203, type: !285)
!1113 = !DILocation(line: 203, column: 56, scope: !1109)
!1114 = !DILocalVariable(name: "ctx", scope: !1109, file: !595, line: 205, type: !173)
!1115 = !DILocation(line: 205, column: 22, scope: !1109)
!1116 = !DILocation(line: 205, column: 28, scope: !1109)
!1117 = !DILocation(line: 205, column: 36, scope: !1109)
!1118 = !DILocalVariable(name: "outlink", scope: !1109, file: !595, line: 206, type: !386)
!1119 = !DILocation(line: 206, column: 19, scope: !1109)
!1120 = !DILocation(line: 206, column: 29, scope: !1109)
!1121 = !DILocation(line: 206, column: 34, scope: !1109)
!1122 = !DILocalVariable(name: "td", scope: !1109, file: !595, line: 207, type: !1123)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadData", file: !595, line: 171, baseType: !1124)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadData", file: !595, line: 169, size: 128, align: 64, elements: !1125)
!1125 = !{!1126, !1127}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !1124, file: !595, line: 170, baseType: !285, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !1124, file: !595, line: 170, baseType: !285, size: 64, align: 64, offset: 64)
!1128 = !DILocation(line: 207, column: 16, scope: !1109)
!1129 = !DILocalVariable(name: "out", scope: !1109, file: !595, line: 208, type: !285)
!1130 = !DILocation(line: 208, column: 14, scope: !1109)
!1131 = !DILocation(line: 210, column: 31, scope: !1109)
!1132 = !DILocation(line: 210, column: 40, scope: !1109)
!1133 = !DILocation(line: 210, column: 49, scope: !1109)
!1134 = !DILocation(line: 210, column: 52, scope: !1109)
!1135 = !DILocation(line: 210, column: 61, scope: !1109)
!1136 = !DILocation(line: 210, column: 11, scope: !1109)
!1137 = !DILocation(line: 210, column: 9, scope: !1109)
!1138 = !DILocation(line: 211, column: 10, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1109, file: !595, line: 211, column: 9)
!1140 = !DILocation(line: 211, column: 9, scope: !1109)
!1141 = !DILocation(line: 212, column: 9, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1139, file: !595, line: 211, column: 15)
!1143 = !DILocation(line: 213, column: 9, scope: !1142)
!1144 = !DILocation(line: 215, column: 25, scope: !1109)
!1145 = !DILocation(line: 215, column: 30, scope: !1109)
!1146 = !DILocation(line: 215, column: 5, scope: !1109)
!1147 = !DILocation(line: 218, column: 29, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1109, file: !595, line: 218, column: 9)
!1149 = !DILocation(line: 218, column: 37, scope: !1148)
!1150 = !DILocation(line: 218, column: 9, scope: !1148)
!1151 = !DILocation(line: 218, column: 46, scope: !1148)
!1152 = !DILocation(line: 218, column: 52, scope: !1148)
!1153 = !DILocation(line: 218, column: 9, scope: !1109)
!1154 = !DILocation(line: 219, column: 16, scope: !1148)
!1155 = !DILocation(line: 219, column: 21, scope: !1148)
!1156 = !DILocation(line: 219, column: 30, scope: !1148)
!1157 = !DILocation(line: 219, column: 34, scope: !1148)
!1158 = !DILocation(line: 219, column: 9, scope: !1148)
!1159 = !DILocation(line: 221, column: 13, scope: !1109)
!1160 = !DILocation(line: 221, column: 8, scope: !1109)
!1161 = !DILocation(line: 221, column: 11, scope: !1109)
!1162 = !DILocation(line: 221, column: 26, scope: !1109)
!1163 = !DILocation(line: 221, column: 20, scope: !1109)
!1164 = !DILocation(line: 221, column: 24, scope: !1109)
!1165 = !DILocation(line: 222, column: 5, scope: !1109)
!1166 = !DILocation(line: 222, column: 10, scope: !1109)
!1167 = !DILocation(line: 222, column: 20, scope: !1109)
!1168 = !DILocation(line: 222, column: 28, scope: !1109)
!1169 = !DILocation(line: 222, column: 47, scope: !1109)
!1170 = !DILocation(line: 222, column: 59, scope: !1109)
!1171 = !DILocation(line: 222, column: 68, scope: !1109)
!1172 = !DILocation(line: 222, column: 99, scope: !1109)
!1173 = !DILocation(line: 222, column: 74, scope: !1109)
!1174 = !DILocation(line: 222, column: 71, scope: !1109)
!1175 = !DILocation(line: 222, column: 58, scope: !1109)
!1176 = !DILocation(line: 222, column: 133, scope: !1177)
!1177 = !DILexicalBlockFile(scope: !1109, file: !595, discriminator: 1)
!1178 = !DILocation(line: 222, column: 108, scope: !1177)
!1179 = !DILocation(line: 222, column: 58, scope: !1177)
!1180 = !DILocation(line: 222, column: 142, scope: !1181)
!1181 = !DILexicalBlockFile(scope: !1109, file: !595, discriminator: 2)
!1182 = !DILocation(line: 222, column: 151, scope: !1181)
!1183 = !DILocation(line: 222, column: 58, scope: !1181)
!1184 = !DILocation(line: 222, column: 58, scope: !1185)
!1185 = !DILexicalBlockFile(scope: !1109, file: !595, discriminator: 3)
!1186 = !DILocation(line: 222, column: 5, scope: !1185)
!1187 = !DILocation(line: 224, column: 5, scope: !1109)
!1188 = !DILocation(line: 225, column: 28, scope: !1109)
!1189 = !DILocation(line: 225, column: 37, scope: !1109)
!1190 = !DILocation(line: 225, column: 12, scope: !1109)
!1191 = !DILocation(line: 225, column: 5, scope: !1109)
!1192 = !DILocation(line: 226, column: 1, scope: !1109)
