; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--gifdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--gifdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }

!883 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !4, line: 3865, size: 32, align: 32, elements: !884)
!884 = !{!885, !886, !887, !888}
!885 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!886 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!887 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!888 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !{!939, !948, !949}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !942, line: 222, size: 16, align: 8, elements: !943)
!942 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!943 = !{!944}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !941, file: !942, line: 222, baseType: !945, size: 16, align: 16)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !946, line: 49, baseType: !947)
!946 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!947 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!948 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!949 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!950 = !{!951, !2196, !2197, !2201, !2206}
!951 = distinct !DIGlobalVariable(name: "ff_gif_demuxer", scope: !0, file: !952, line: 400, type: !953, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_gif_demuxer)
!952 = !DIFile(filename: "libavformat/gifdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !955)
!955 = !{!956, !960, !961, !962, !963, !973, !1055, !1056, !1058, !1059, !1060, !1074, !2177, !2178, !2179, !2183, !2187, !2188, !2189, !2193, !2194, !2195}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !954, file: !919, line: 638, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !954, file: !919, line: 645, baseType: !957, size: 64, align: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !954, file: !919, line: 652, baseType: !948, size: 32, align: 32, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !954, file: !919, line: 659, baseType: !957, size: 64, align: 64, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !954, file: !919, line: 661, baseType: !964, size: 64, align: 64, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !969, line: 44, size: 64, align: 32, elements: !970)
!969 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!970 = !{!971, !972}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !968, file: !969, line: 45, baseType: !3, size: 32, align: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !968, file: !969, line: 46, baseType: !949, size: 32, align: 32, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !954, file: !919, line: 663, baseType: !974, size: 64, align: 64, offset: 320)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !978)
!978 = !{!979, !980, !985, !1014, !1015, !1016, !1017, !1021, !1027, !1029, !1033}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !977, file: !486, line: 72, baseType: !957, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !977, file: !486, line: 78, baseType: !981, size: 64, align: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!957, !984}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !977, file: !486, line: 85, baseType: !986, size: 64, align: 64, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !989)
!989 = !{!990, !991, !992, !993, !994, !1010, !1011, !1012, !1013}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !988, file: !464, line: 247, baseType: !957, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !988, file: !464, line: 253, baseType: !957, size: 64, align: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !988, file: !464, line: 259, baseType: !948, size: 32, align: 32, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !988, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !988, file: !464, line: 271, baseType: !995, size: 64, align: 64, offset: 192)
!995 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !988, file: !464, line: 265, size: 64, align: 64, elements: !996)
!996 = !{!997, !1000, !1002, !1003}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !995, file: !464, line: 266, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !946, line: 40, baseType: !999)
!999 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !995, file: !464, line: 267, baseType: !1001, size: 64, align: 64)
!1001 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !995, file: !464, line: 268, baseType: !957, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !995, file: !464, line: 270, baseType: !1004, size: 64, align: 32)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1005, line: 61, baseType: !1006)
!1005 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1005, line: 58, size: 64, align: 32, elements: !1007)
!1007 = !{!1008, !1009}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1006, file: !1005, line: 59, baseType: !948, size: 32, align: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1006, file: !1005, line: 60, baseType: !948, size: 32, align: 32, offset: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !988, file: !464, line: 272, baseType: !1001, size: 64, align: 64, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !988, file: !464, line: 273, baseType: !1001, size: 64, align: 64, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !988, file: !464, line: 275, baseType: !948, size: 32, align: 32, offset: 384)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !988, file: !464, line: 300, baseType: !957, size: 64, align: 64, offset: 448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !977, file: !486, line: 93, baseType: !948, size: 32, align: 32, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !977, file: !486, line: 99, baseType: !948, size: 32, align: 32, offset: 224)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !977, file: !486, line: 108, baseType: !948, size: 32, align: 32, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !977, file: !486, line: 113, baseType: !1018, size: 64, align: 64, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!984, !984, !984}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !977, file: !486, line: 123, baseType: !1022, size: 64, align: 64, offset: 384)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!1025, !1025}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !977, file: !486, line: 130, baseType: !1028, size: 32, align: 32, offset: 448)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !977, file: !486, line: 136, baseType: !1030, size: 64, align: 64, offset: 512)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!1028, !984}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !977, file: !486, line: 142, baseType: !1034, size: 64, align: 64, offset: 576)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!948, !1037, !984, !957, !948}
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1040)
!1040 = !{!1041, !1053, !1054}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1039, file: !464, line: 360, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1046)
!1046 = !{!1047, !1048, !1049, !1050, !1051, !1052}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1045, file: !464, line: 307, baseType: !957, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1045, file: !464, line: 313, baseType: !1001, size: 64, align: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1045, file: !464, line: 313, baseType: !1001, size: 64, align: 64, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1045, file: !464, line: 318, baseType: !1001, size: 64, align: 64, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1045, file: !464, line: 318, baseType: !1001, size: 64, align: 64, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1045, file: !464, line: 323, baseType: !948, size: 32, align: 32, offset: 320)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1039, file: !464, line: 364, baseType: !948, size: 32, align: 32, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1039, file: !464, line: 368, baseType: !948, size: 32, align: 32, offset: 96)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !954, file: !919, line: 670, baseType: !957, size: 64, align: 64, offset: 384)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !954, file: !919, line: 679, baseType: !1057, size: 64, align: 64, offset: 448)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !954, file: !919, line: 684, baseType: !948, size: 32, align: 32, offset: 512)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !954, file: !919, line: 689, baseType: !948, size: 32, align: 32, offset: 544)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !954, file: !919, line: 696, baseType: !1061, size: 64, align: 64, offset: 576)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!948, !1064}
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1067)
!1067 = !{!1068, !1069, !1072, !1073}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1066, file: !919, line: 449, baseType: !957, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1066, file: !919, line: 450, baseType: !1070, size: 64, align: 64, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1066, file: !919, line: 451, baseType: !948, size: 32, align: 32, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1066, file: !919, line: 452, baseType: !957, size: 64, align: 64, offset: 192)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !954, file: !919, line: 703, baseType: !1075, size: 64, align: 64, offset: 640)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!948, !1078}
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1080)
!1080 = !{!1081, !1082, !1083, !1275, !1276, !1341, !1342, !1343, !2034, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2088, !2089, !2090, !2091, !2092, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2143, !2144, !2147, !2148, !2149, !2150, !2151, !2152, !2154, !2155, !2156, !2157, !2165, !2166, !2170, !2174, !2175, !2176}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1079, file: !919, line: 1342, baseType: !974, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1079, file: !919, line: 1349, baseType: !1057, size: 64, align: 64, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1079, file: !919, line: 1356, baseType: !1084, size: 64, align: 64, offset: 128)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1086)
!1086 = !{!1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1140, !1141, !1145, !1149, !1154, !1161, !1250, !1256, !1262, !1263, !1264, !1265, !1269}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1085, file: !919, line: 498, baseType: !957, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1085, file: !919, line: 504, baseType: !957, size: 64, align: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1085, file: !919, line: 505, baseType: !957, size: 64, align: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1085, file: !919, line: 506, baseType: !957, size: 64, align: 64, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1085, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1085, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1085, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1085, file: !919, line: 517, baseType: !948, size: 32, align: 32, offset: 352)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1085, file: !919, line: 523, baseType: !964, size: 64, align: 64, offset: 384)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1085, file: !919, line: 526, baseType: !974, size: 64, align: 64, offset: 448)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1085, file: !919, line: 535, baseType: !1084, size: 64, align: 64, offset: 512)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1085, file: !919, line: 539, baseType: !948, size: 32, align: 32, offset: 576)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1085, file: !919, line: 541, baseType: !1075, size: 64, align: 64, offset: 640)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1085, file: !919, line: 549, baseType: !1101, size: 64, align: 64, offset: 704)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!948, !1078, !1104}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1107)
!1107 = !{!1108, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1136, !1137, !1138, !1139}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1106, file: !4, line: 1451, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1111, line: 94, baseType: !1112)
!1111 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1111, line: 81, size: 192, align: 64, elements: !1113)
!1113 = !{!1114, !1118, !1121}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1112, file: !1111, line: 82, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1111, line: 73, baseType: !1117)
!1117 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1111, line: 73, flags: DIFlagFwdDecl)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1112, file: !1111, line: 89, baseType: !1119, size: 64, align: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !946, line: 48, baseType: !1071)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1112, file: !1111, line: 93, baseType: !948, size: 32, align: 32, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1106, file: !4, line: 1461, baseType: !998, size: 64, align: 64, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1106, file: !4, line: 1467, baseType: !998, size: 64, align: 64, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1106, file: !4, line: 1468, baseType: !1119, size: 64, align: 64, offset: 192)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1106, file: !4, line: 1469, baseType: !948, size: 32, align: 32, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1106, file: !4, line: 1470, baseType: !948, size: 32, align: 32, offset: 288)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1106, file: !4, line: 1474, baseType: !948, size: 32, align: 32, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1106, file: !4, line: 1479, baseType: !1129, size: 64, align: 64, offset: 384)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1131)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1132)
!1132 = !{!1133, !1134, !1135}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1131, file: !4, line: 1412, baseType: !1119, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1131, file: !4, line: 1413, baseType: !948, size: 32, align: 32, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1131, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1106, file: !4, line: 1480, baseType: !948, size: 32, align: 32, offset: 448)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1106, file: !4, line: 1486, baseType: !998, size: 64, align: 64, offset: 512)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1106, file: !4, line: 1488, baseType: !998, size: 64, align: 64, offset: 576)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1106, file: !4, line: 1497, baseType: !998, size: 64, align: 64, offset: 640)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1085, file: !919, line: 550, baseType: !1075, size: 64, align: 64, offset: 768)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1085, file: !919, line: 554, baseType: !1142, size: 64, align: 64, offset: 832)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!948, !1078, !1104, !1104, !948}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1085, file: !919, line: 563, baseType: !1146, size: 64, align: 64, offset: 896)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!948, !3, !948}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1085, file: !919, line: 565, baseType: !1150, size: 64, align: 64, offset: 960)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{null, !1078, !948, !1153, !1153}
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1085, file: !919, line: 570, baseType: !1155, size: 64, align: 64, offset: 1024)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!948, !1078, !948, !984, !1158}
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1159, line: 216, baseType: !1160)
!1159 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1160 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1085, file: !919, line: 581, baseType: !1162, size: 64, align: 64, offset: 1088)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!948, !1078, !948, !1165, !949}
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1169)
!1169 = !{!1170, !1174, !1176, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1204, !1206, !1207, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1168, file: !548, line: 282, baseType: !1171, size: 512, align: 64)
!1171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1119, size: 512, align: 64, elements: !1172)
!1172 = !{!1173}
!1173 = !DISubrange(count: 8)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1168, file: !548, line: 299, baseType: !1175, size: 256, align: 32, offset: 512)
!1175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !948, size: 256, align: 32, elements: !1172)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1168, file: !548, line: 315, baseType: !1177, size: 64, align: 64, offset: 768)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1168, file: !548, line: 326, baseType: !948, size: 32, align: 32, offset: 832)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1168, file: !548, line: 326, baseType: !948, size: 32, align: 32, offset: 864)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1168, file: !548, line: 334, baseType: !948, size: 32, align: 32, offset: 896)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1168, file: !548, line: 341, baseType: !948, size: 32, align: 32, offset: 928)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1168, file: !548, line: 346, baseType: !948, size: 32, align: 32, offset: 960)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1168, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1168, file: !548, line: 356, baseType: !1004, size: 64, align: 32, offset: 1024)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1168, file: !548, line: 361, baseType: !998, size: 64, align: 64, offset: 1088)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1168, file: !548, line: 369, baseType: !998, size: 64, align: 64, offset: 1152)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1168, file: !548, line: 377, baseType: !998, size: 64, align: 64, offset: 1216)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1168, file: !548, line: 382, baseType: !948, size: 32, align: 32, offset: 1280)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1168, file: !548, line: 386, baseType: !948, size: 32, align: 32, offset: 1312)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1168, file: !548, line: 391, baseType: !948, size: 32, align: 32, offset: 1344)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1168, file: !548, line: 396, baseType: !984, size: 64, align: 64, offset: 1408)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1168, file: !548, line: 403, baseType: !1193, size: 512, align: 64, offset: 1472)
!1193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1194, size: 512, align: 64, elements: !1172)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !946, line: 55, baseType: !1160)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1168, file: !548, line: 410, baseType: !948, size: 32, align: 32, offset: 1984)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1168, file: !548, line: 415, baseType: !948, size: 32, align: 32, offset: 2016)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1168, file: !548, line: 420, baseType: !948, size: 32, align: 32, offset: 2048)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1168, file: !548, line: 425, baseType: !948, size: 32, align: 32, offset: 2080)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1168, file: !548, line: 435, baseType: !998, size: 64, align: 64, offset: 2112)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1168, file: !548, line: 440, baseType: !948, size: 32, align: 32, offset: 2176)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1168, file: !548, line: 445, baseType: !1194, size: 64, align: 64, offset: 2240)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1168, file: !548, line: 459, baseType: !1203, size: 512, align: 64, offset: 2304)
!1203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1109, size: 512, align: 64, elements: !1172)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1168, file: !548, line: 473, baseType: !1205, size: 64, align: 64, offset: 2816)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1168, file: !548, line: 477, baseType: !948, size: 32, align: 32, offset: 2880)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1168, file: !548, line: 479, baseType: !1208, size: 64, align: 64, offset: 2944)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1212)
!1212 = !{!1213, !1214, !1215, !1216, !1221}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1211, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1211, file: !548, line: 203, baseType: !1119, size: 64, align: 64, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1211, file: !548, line: 204, baseType: !948, size: 32, align: 32, offset: 128)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1211, file: !548, line: 205, baseType: !1217, size: 64, align: 64, offset: 192)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1219, line: 86, baseType: !1220)
!1219 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1220 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1219, line: 86, flags: DIFlagFwdDecl)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1211, file: !548, line: 206, baseType: !1109, size: 64, align: 64, offset: 256)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1168, file: !548, line: 480, baseType: !948, size: 32, align: 32, offset: 3008)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1168, file: !548, line: 505, baseType: !948, size: 32, align: 32, offset: 3040)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1168, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1168, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1168, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1168, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1168, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1168, file: !548, line: 532, baseType: !998, size: 64, align: 64, offset: 3264)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1168, file: !548, line: 539, baseType: !998, size: 64, align: 64, offset: 3328)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1168, file: !548, line: 547, baseType: !998, size: 64, align: 64, offset: 3392)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1168, file: !548, line: 554, baseType: !1217, size: 64, align: 64, offset: 3456)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1168, file: !548, line: 563, baseType: !948, size: 32, align: 32, offset: 3520)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1168, file: !548, line: 572, baseType: !948, size: 32, align: 32, offset: 3552)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1168, file: !548, line: 581, baseType: !948, size: 32, align: 32, offset: 3584)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1168, file: !548, line: 588, baseType: !1237, size: 64, align: 64, offset: 3648)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !946, line: 36, baseType: !1239)
!1239 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1168, file: !548, line: 593, baseType: !948, size: 32, align: 32, offset: 3712)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1168, file: !548, line: 596, baseType: !948, size: 32, align: 32, offset: 3744)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1168, file: !548, line: 599, baseType: !1109, size: 64, align: 64, offset: 3776)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1168, file: !548, line: 605, baseType: !1109, size: 64, align: 64, offset: 3840)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1168, file: !548, line: 616, baseType: !1109, size: 64, align: 64, offset: 3904)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1168, file: !548, line: 626, baseType: !1158, size: 64, align: 64, offset: 3968)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1168, file: !548, line: 627, baseType: !1158, size: 64, align: 64, offset: 4032)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1168, file: !548, line: 628, baseType: !1158, size: 64, align: 64, offset: 4096)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1168, file: !548, line: 629, baseType: !1158, size: 64, align: 64, offset: 4160)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1168, file: !548, line: 645, baseType: !1109, size: 64, align: 64, offset: 4224)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1085, file: !919, line: 587, baseType: !1251, size: 64, align: 64, offset: 1152)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!948, !1078, !1254}
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1085, file: !919, line: 592, baseType: !1257, size: 64, align: 64, offset: 1216)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{!948, !1078, !1260}
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1085, file: !919, line: 597, baseType: !1257, size: 64, align: 64, offset: 1280)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1085, file: !919, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1085, file: !919, line: 608, baseType: !1075, size: 64, align: 64, offset: 1408)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1085, file: !919, line: 617, baseType: !1266, size: 64, align: 64, offset: 1472)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{null, !1078}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1085, file: !919, line: 623, baseType: !1270, size: 64, align: 64, offset: 1536)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!948, !1078, !1273}
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1105)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1079, file: !919, line: 1365, baseType: !984, size: 64, align: 64, offset: 192)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1079, file: !919, line: 1379, baseType: !1277, size: 64, align: 64, offset: 256)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1279)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1280)
!1280 = !{!1281, !1282, !1283, !1284, !1285, !1286, !1287, !1291, !1292, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1308, !1309, !1313, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1331, !1332, !1333, !1334, !1338, !1339, !1340}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1279, file: !650, line: 174, baseType: !974, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1279, file: !650, line: 226, baseType: !1070, size: 64, align: 64, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1279, file: !650, line: 227, baseType: !948, size: 32, align: 32, offset: 128)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1279, file: !650, line: 228, baseType: !1070, size: 64, align: 64, offset: 192)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1279, file: !650, line: 229, baseType: !1070, size: 64, align: 64, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1279, file: !650, line: 233, baseType: !984, size: 64, align: 64, offset: 320)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1279, file: !650, line: 235, baseType: !1288, size: 64, align: 64, offset: 384)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{!948, !984, !1119, !948}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1279, file: !650, line: 236, baseType: !1288, size: 64, align: 64, offset: 448)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1279, file: !650, line: 237, baseType: !1293, size: 64, align: 64, offset: 512)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!998, !984, !998, !948}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1279, file: !650, line: 238, baseType: !998, size: 64, align: 64, offset: 576)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1279, file: !650, line: 239, baseType: !948, size: 32, align: 32, offset: 640)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1279, file: !650, line: 240, baseType: !948, size: 32, align: 32, offset: 672)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1279, file: !650, line: 241, baseType: !948, size: 32, align: 32, offset: 704)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1279, file: !650, line: 242, baseType: !1160, size: 64, align: 64, offset: 768)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1279, file: !650, line: 243, baseType: !1070, size: 64, align: 64, offset: 832)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1279, file: !650, line: 244, baseType: !1303, size: 64, align: 64, offset: 896)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{!1160, !1160, !1306, !949}
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1120)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1279, file: !650, line: 245, baseType: !948, size: 32, align: 32, offset: 960)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1279, file: !650, line: 249, baseType: !1310, size: 64, align: 64, offset: 1024)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DISubroutineType(types: !1312)
!1312 = !{!948, !984, !948}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1279, file: !650, line: 255, baseType: !1314, size: 64, align: 64, offset: 1088)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DISubroutineType(types: !1316)
!1316 = !{!998, !984, !948, !998, !948}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1279, file: !650, line: 260, baseType: !948, size: 32, align: 32, offset: 1152)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1279, file: !650, line: 266, baseType: !998, size: 64, align: 64, offset: 1216)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1279, file: !650, line: 273, baseType: !948, size: 32, align: 32, offset: 1280)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1279, file: !650, line: 279, baseType: !998, size: 64, align: 64, offset: 1344)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1279, file: !650, line: 285, baseType: !948, size: 32, align: 32, offset: 1408)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1279, file: !650, line: 291, baseType: !948, size: 32, align: 32, offset: 1440)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1279, file: !650, line: 298, baseType: !948, size: 32, align: 32, offset: 1472)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1279, file: !650, line: 304, baseType: !948, size: 32, align: 32, offset: 1504)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1279, file: !650, line: 309, baseType: !957, size: 64, align: 64, offset: 1536)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1279, file: !650, line: 314, baseType: !957, size: 64, align: 64, offset: 1600)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1279, file: !650, line: 319, baseType: !1328, size: 64, align: 64, offset: 1664)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = !DISubroutineType(types: !1330)
!1330 = !{!948, !984, !1119, !948, !649, !998}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1279, file: !650, line: 326, baseType: !948, size: 32, align: 32, offset: 1728)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1279, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1279, file: !650, line: 332, baseType: !998, size: 64, align: 64, offset: 1792)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1279, file: !650, line: 338, baseType: !1335, size: 64, align: 64, offset: 1856)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DISubroutineType(types: !1337)
!1337 = !{!948, !984}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1279, file: !650, line: 340, baseType: !998, size: 64, align: 64, offset: 1920)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1279, file: !650, line: 346, baseType: !1070, size: 64, align: 64, offset: 1984)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1279, file: !650, line: 351, baseType: !948, size: 32, align: 32, offset: 2048)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1079, file: !919, line: 1386, baseType: !948, size: 32, align: 32, offset: 320)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1079, file: !919, line: 1393, baseType: !949, size: 32, align: 32, offset: 352)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1079, file: !919, line: 1405, baseType: !1344, size: 64, align: 64, offset: 384)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1347)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1348)
!1348 = !{!1349, !1350, !1351, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1820, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1920, !1926, !1927, !1931, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1963, !1964, !1965, !1966, !1967, !1968}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1347, file: !919, line: 866, baseType: !948, size: 32, align: 32)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1347, file: !919, line: 872, baseType: !948, size: 32, align: 32, offset: 32)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1347, file: !919, line: 878, baseType: !1352, size: 64, align: 64, offset: 64)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1354)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1355)
!1355 = !{!1356, !1357, !1358, !1359, !1495, !1496, !1497, !1498, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1524, !1528, !1529, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1708, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1354, file: !4, line: 1561, baseType: !974, size: 64, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1354, file: !4, line: 1562, baseType: !948, size: 32, align: 32, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1354, file: !4, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1354, file: !4, line: 1565, baseType: !1360, size: 64, align: 64, offset: 128)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1362)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1363)
!1363 = !{!1364, !1365, !1366, !1367, !1368, !1369, !1372, !1375, !1378, !1381, !1384, !1385, !1386, !1394, !1395, !1396, !1398, !1402, !1408, !1413, !1417, !1418, !1460, !1467, !1471, !1472, !1476, !1480, !1484, !1488, !1489, !1490}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1362, file: !4, line: 3475, baseType: !957, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1362, file: !4, line: 3480, baseType: !957, size: 64, align: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1362, file: !4, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1362, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1362, file: !4, line: 3487, baseType: !948, size: 32, align: 32, offset: 192)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1362, file: !4, line: 3488, baseType: !1370, size: 64, align: 64, offset: 256)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1362, file: !4, line: 3489, baseType: !1373, size: 64, align: 64, offset: 320)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1362, file: !4, line: 3490, baseType: !1376, size: 64, align: 64, offset: 384)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1362, file: !4, line: 3491, baseType: !1379, size: 64, align: 64, offset: 448)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1362, file: !4, line: 3492, baseType: !1382, size: 64, align: 64, offset: 512)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1194)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1362, file: !4, line: 3493, baseType: !1120, size: 8, align: 8, offset: 576)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1362, file: !4, line: 3494, baseType: !974, size: 64, align: 64, offset: 640)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1362, file: !4, line: 3495, baseType: !1387, size: 64, align: 64, offset: 704)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1389)
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1390)
!1390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1391)
!1391 = !{!1392, !1393}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1390, file: !4, line: 3402, baseType: !948, size: 32, align: 32)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1390, file: !4, line: 3403, baseType: !957, size: 64, align: 64, offset: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1362, file: !4, line: 3507, baseType: !957, size: 64, align: 64, offset: 768)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1362, file: !4, line: 3516, baseType: !948, size: 32, align: 32, offset: 832)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1362, file: !4, line: 3517, baseType: !1397, size: 64, align: 64, offset: 896)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1362, file: !4, line: 3527, baseType: !1399, size: 64, align: 64, offset: 960)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DISubroutineType(types: !1401)
!1401 = !{!948, !1352}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1362, file: !4, line: 3535, baseType: !1403, size: 64, align: 64, offset: 1024)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DISubroutineType(types: !1405)
!1405 = !{!948, !1352, !1406}
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1353)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1362, file: !4, line: 3541, baseType: !1409, size: 64, align: 64, offset: 1088)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1411)
!1411 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1412)
!1412 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1362, file: !4, line: 3549, baseType: !1414, size: 64, align: 64, offset: 1152)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{null, !1397}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1362, file: !4, line: 3551, baseType: !1399, size: 64, align: 64, offset: 1216)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1362, file: !4, line: 3552, baseType: !1419, size: 64, align: 64, offset: 1280)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DISubroutineType(types: !1421)
!1421 = !{!948, !1352, !1119, !948, !1422}
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1424)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1425)
!1425 = !{!1426, !1427, !1429, !1430, !1431, !1459}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1424, file: !4, line: 3921, baseType: !945, size: 16, align: 16)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1424, file: !4, line: 3922, baseType: !1428, size: 32, align: 32, offset: 32)
!1428 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !946, line: 51, baseType: !949)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1424, file: !4, line: 3923, baseType: !1428, size: 32, align: 32, offset: 64)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1424, file: !4, line: 3924, baseType: !949, size: 32, align: 32, offset: 96)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1424, file: !4, line: 3925, baseType: !1432, size: 64, align: 64, offset: 128)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1435)
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1436)
!1436 = !{!1437, !1438, !1439, !1440, !1441, !1442, !1448, !1452, !1454, !1455, !1457, !1458}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1435, file: !4, line: 3886, baseType: !948, size: 32, align: 32)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1435, file: !4, line: 3887, baseType: !948, size: 32, align: 32, offset: 32)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1435, file: !4, line: 3888, baseType: !948, size: 32, align: 32, offset: 64)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1435, file: !4, line: 3889, baseType: !948, size: 32, align: 32, offset: 96)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1435, file: !4, line: 3890, baseType: !948, size: 32, align: 32, offset: 128)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1435, file: !4, line: 3897, baseType: !1443, size: 768, align: 64, offset: 192)
!1443 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1444)
!1444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1445)
!1445 = !{!1446, !1447}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1444, file: !4, line: 3855, baseType: !1171, size: 512, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1444, file: !4, line: 3857, baseType: !1175, size: 256, align: 32, offset: 512)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1435, file: !4, line: 3903, baseType: !1449, size: 256, align: 64, offset: 960)
!1449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1119, size: 256, align: 64, elements: !1450)
!1450 = !{!1451}
!1451 = !DISubrange(count: 4)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1435, file: !4, line: 3904, baseType: !1453, size: 128, align: 32, offset: 1216)
!1453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !948, size: 128, align: 32, elements: !1450)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1435, file: !4, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1435, file: !4, line: 3908, baseType: !1456, size: 64, align: 64, offset: 1408)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1435, file: !4, line: 3915, baseType: !1456, size: 64, align: 64, offset: 1472)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1435, file: !4, line: 3917, baseType: !948, size: 32, align: 32, offset: 1536)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1424, file: !4, line: 3926, baseType: !998, size: 64, align: 64, offset: 192)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1362, file: !4, line: 3564, baseType: !1461, size: 64, align: 64, offset: 1344)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!948, !1352, !1104, !1464, !1466}
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1167)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1362, file: !4, line: 3566, baseType: !1468, size: 64, align: 64, offset: 1408)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!948, !1352, !984, !1466, !1104}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1362, file: !4, line: 3567, baseType: !1399, size: 64, align: 64, offset: 1472)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1362, file: !4, line: 3576, baseType: !1473, size: 64, align: 64, offset: 1536)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DISubroutineType(types: !1475)
!1475 = !{!948, !1352, !1464}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1362, file: !4, line: 3577, baseType: !1477, size: 64, align: 64, offset: 1600)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DISubroutineType(types: !1479)
!1479 = !{!948, !1352, !1104}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1362, file: !4, line: 3584, baseType: !1481, size: 64, align: 64, offset: 1664)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{!948, !1352, !1166}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1362, file: !4, line: 3589, baseType: !1485, size: 64, align: 64, offset: 1728)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{null, !1352}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1362, file: !4, line: 3594, baseType: !948, size: 32, align: 32, offset: 1792)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1362, file: !4, line: 3600, baseType: !957, size: 64, align: 64, offset: 1856)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1362, file: !4, line: 3609, baseType: !1491, size: 64, align: 64, offset: 1920)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1494)
!1494 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1354, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1354, file: !4, line: 1581, baseType: !949, size: 32, align: 32, offset: 224)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1354, file: !4, line: 1583, baseType: !984, size: 64, align: 64, offset: 256)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1354, file: !4, line: 1591, baseType: !1499, size: 64, align: 64, offset: 320)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1354, file: !4, line: 1598, baseType: !984, size: 64, align: 64, offset: 384)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1354, file: !4, line: 1606, baseType: !998, size: 64, align: 64, offset: 448)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1354, file: !4, line: 1614, baseType: !948, size: 32, align: 32, offset: 512)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1354, file: !4, line: 1622, baseType: !948, size: 32, align: 32, offset: 544)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1354, file: !4, line: 1628, baseType: !948, size: 32, align: 32, offset: 576)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1354, file: !4, line: 1636, baseType: !948, size: 32, align: 32, offset: 608)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1354, file: !4, line: 1643, baseType: !948, size: 32, align: 32, offset: 640)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1354, file: !4, line: 1657, baseType: !1119, size: 64, align: 64, offset: 704)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1354, file: !4, line: 1658, baseType: !948, size: 32, align: 32, offset: 768)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1354, file: !4, line: 1679, baseType: !1004, size: 64, align: 32, offset: 800)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1354, file: !4, line: 1688, baseType: !948, size: 32, align: 32, offset: 864)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1354, file: !4, line: 1712, baseType: !948, size: 32, align: 32, offset: 896)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1354, file: !4, line: 1729, baseType: !948, size: 32, align: 32, offset: 928)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1354, file: !4, line: 1729, baseType: !948, size: 32, align: 32, offset: 960)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1354, file: !4, line: 1744, baseType: !948, size: 32, align: 32, offset: 992)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1354, file: !4, line: 1744, baseType: !948, size: 32, align: 32, offset: 1024)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1354, file: !4, line: 1751, baseType: !948, size: 32, align: 32, offset: 1056)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1354, file: !4, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1354, file: !4, line: 1791, baseType: !1520, size: 64, align: 64, offset: 1152)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DISubroutineType(types: !1522)
!1522 = !{null, !1523, !1464, !1466, !948, !948, !948}
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1354, file: !4, line: 1808, baseType: !1525, size: 64, align: 64, offset: 1216)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64, align: 64)
!1526 = !DISubroutineType(types: !1527)
!1527 = !{!667, !1523, !1373}
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1354, file: !4, line: 1816, baseType: !948, size: 32, align: 32, offset: 1280)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1354, file: !4, line: 1825, baseType: !1530, size: 32, align: 32, offset: 1312)
!1530 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1354, file: !4, line: 1830, baseType: !948, size: 32, align: 32, offset: 1344)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1354, file: !4, line: 1838, baseType: !1530, size: 32, align: 32, offset: 1376)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1354, file: !4, line: 1846, baseType: !948, size: 32, align: 32, offset: 1408)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1354, file: !4, line: 1851, baseType: !948, size: 32, align: 32, offset: 1440)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1354, file: !4, line: 1861, baseType: !1530, size: 32, align: 32, offset: 1472)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1354, file: !4, line: 1868, baseType: !1530, size: 32, align: 32, offset: 1504)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1354, file: !4, line: 1875, baseType: !1530, size: 32, align: 32, offset: 1536)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1354, file: !4, line: 1882, baseType: !1530, size: 32, align: 32, offset: 1568)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1354, file: !4, line: 1889, baseType: !1530, size: 32, align: 32, offset: 1600)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1354, file: !4, line: 1896, baseType: !1530, size: 32, align: 32, offset: 1632)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1354, file: !4, line: 1903, baseType: !1530, size: 32, align: 32, offset: 1664)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1354, file: !4, line: 1910, baseType: !948, size: 32, align: 32, offset: 1696)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1354, file: !4, line: 1915, baseType: !948, size: 32, align: 32, offset: 1728)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1354, file: !4, line: 1926, baseType: !1466, size: 64, align: 64, offset: 1792)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1354, file: !4, line: 1935, baseType: !1004, size: 64, align: 32, offset: 1856)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1354, file: !4, line: 1942, baseType: !948, size: 32, align: 32, offset: 1920)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1354, file: !4, line: 1948, baseType: !948, size: 32, align: 32, offset: 1952)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1354, file: !4, line: 1954, baseType: !948, size: 32, align: 32, offset: 1984)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1354, file: !4, line: 1960, baseType: !948, size: 32, align: 32, offset: 2016)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1354, file: !4, line: 1984, baseType: !948, size: 32, align: 32, offset: 2048)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1354, file: !4, line: 1991, baseType: !948, size: 32, align: 32, offset: 2080)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1354, file: !4, line: 1996, baseType: !948, size: 32, align: 32, offset: 2112)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1354, file: !4, line: 2004, baseType: !948, size: 32, align: 32, offset: 2144)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1354, file: !4, line: 2011, baseType: !948, size: 32, align: 32, offset: 2176)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1354, file: !4, line: 2018, baseType: !948, size: 32, align: 32, offset: 2208)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1354, file: !4, line: 2027, baseType: !948, size: 32, align: 32, offset: 2240)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1354, file: !4, line: 2034, baseType: !948, size: 32, align: 32, offset: 2272)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1354, file: !4, line: 2044, baseType: !948, size: 32, align: 32, offset: 2304)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1354, file: !4, line: 2054, baseType: !1560, size: 64, align: 64, offset: 2368)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1354, file: !4, line: 2061, baseType: !1560, size: 64, align: 64, offset: 2432)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1354, file: !4, line: 2066, baseType: !948, size: 32, align: 32, offset: 2496)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1354, file: !4, line: 2070, baseType: !948, size: 32, align: 32, offset: 2528)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1354, file: !4, line: 2078, baseType: !948, size: 32, align: 32, offset: 2560)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1354, file: !4, line: 2085, baseType: !948, size: 32, align: 32, offset: 2592)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1354, file: !4, line: 2092, baseType: !948, size: 32, align: 32, offset: 2624)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1354, file: !4, line: 2099, baseType: !948, size: 32, align: 32, offset: 2656)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1354, file: !4, line: 2106, baseType: !948, size: 32, align: 32, offset: 2688)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1354, file: !4, line: 2113, baseType: !948, size: 32, align: 32, offset: 2720)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1354, file: !4, line: 2120, baseType: !948, size: 32, align: 32, offset: 2752)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1354, file: !4, line: 2125, baseType: !948, size: 32, align: 32, offset: 2784)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1354, file: !4, line: 2133, baseType: !948, size: 32, align: 32, offset: 2816)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1354, file: !4, line: 2140, baseType: !948, size: 32, align: 32, offset: 2848)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1354, file: !4, line: 2145, baseType: !948, size: 32, align: 32, offset: 2880)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1354, file: !4, line: 2153, baseType: !948, size: 32, align: 32, offset: 2912)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1354, file: !4, line: 2158, baseType: !948, size: 32, align: 32, offset: 2944)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1354, file: !4, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1354, file: !4, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1354, file: !4, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1354, file: !4, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1354, file: !4, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1354, file: !4, line: 2203, baseType: !948, size: 32, align: 32, offset: 3136)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1354, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1354, file: !4, line: 2212, baseType: !948, size: 32, align: 32, offset: 3200)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1354, file: !4, line: 2213, baseType: !948, size: 32, align: 32, offset: 3232)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1354, file: !4, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1354, file: !4, line: 2232, baseType: !948, size: 32, align: 32, offset: 3296)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1354, file: !4, line: 2243, baseType: !948, size: 32, align: 32, offset: 3328)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1354, file: !4, line: 2249, baseType: !948, size: 32, align: 32, offset: 3360)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1354, file: !4, line: 2256, baseType: !948, size: 32, align: 32, offset: 3392)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1354, file: !4, line: 2263, baseType: !1194, size: 64, align: 64, offset: 3456)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1354, file: !4, line: 2270, baseType: !1194, size: 64, align: 64, offset: 3520)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1354, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1354, file: !4, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1354, file: !4, line: 2367, baseType: !1596, size: 64, align: 64, offset: 3648)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{!948, !1523, !1166, !948}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1354, file: !4, line: 2383, baseType: !948, size: 32, align: 32, offset: 3712)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1354, file: !4, line: 2386, baseType: !1530, size: 32, align: 32, offset: 3744)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1354, file: !4, line: 2387, baseType: !1530, size: 32, align: 32, offset: 3776)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1354, file: !4, line: 2394, baseType: !948, size: 32, align: 32, offset: 3808)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1354, file: !4, line: 2401, baseType: !948, size: 32, align: 32, offset: 3840)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1354, file: !4, line: 2408, baseType: !948, size: 32, align: 32, offset: 3872)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1354, file: !4, line: 2415, baseType: !948, size: 32, align: 32, offset: 3904)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1354, file: !4, line: 2422, baseType: !948, size: 32, align: 32, offset: 3936)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1354, file: !4, line: 2423, baseType: !1608, size: 64, align: 64, offset: 3968)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1610)
!1610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1611)
!1611 = !{!1612, !1613, !1614, !1615}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1610, file: !4, line: 827, baseType: !948, size: 32, align: 32)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1610, file: !4, line: 828, baseType: !948, size: 32, align: 32, offset: 32)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1610, file: !4, line: 829, baseType: !948, size: 32, align: 32, offset: 64)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1610, file: !4, line: 830, baseType: !1530, size: 32, align: 32, offset: 96)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1354, file: !4, line: 2430, baseType: !998, size: 64, align: 64, offset: 4032)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1354, file: !4, line: 2437, baseType: !998, size: 64, align: 64, offset: 4096)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1354, file: !4, line: 2444, baseType: !1530, size: 32, align: 32, offset: 4160)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1354, file: !4, line: 2451, baseType: !1530, size: 32, align: 32, offset: 4192)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1354, file: !4, line: 2458, baseType: !948, size: 32, align: 32, offset: 4224)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1354, file: !4, line: 2469, baseType: !948, size: 32, align: 32, offset: 4256)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1354, file: !4, line: 2475, baseType: !948, size: 32, align: 32, offset: 4288)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1354, file: !4, line: 2481, baseType: !948, size: 32, align: 32, offset: 4320)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1354, file: !4, line: 2485, baseType: !948, size: 32, align: 32, offset: 4352)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1354, file: !4, line: 2489, baseType: !948, size: 32, align: 32, offset: 4384)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1354, file: !4, line: 2493, baseType: !948, size: 32, align: 32, offset: 4416)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1354, file: !4, line: 2501, baseType: !948, size: 32, align: 32, offset: 4448)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1354, file: !4, line: 2506, baseType: !948, size: 32, align: 32, offset: 4480)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1354, file: !4, line: 2510, baseType: !948, size: 32, align: 32, offset: 4512)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1354, file: !4, line: 2514, baseType: !998, size: 64, align: 64, offset: 4544)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1354, file: !4, line: 2528, baseType: !1632, size: 64, align: 64, offset: 4608)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64, align: 64)
!1633 = !DISubroutineType(types: !1634)
!1634 = !{null, !1523, !984, !948, !948}
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1354, file: !4, line: 2534, baseType: !948, size: 32, align: 32, offset: 4672)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1354, file: !4, line: 2545, baseType: !948, size: 32, align: 32, offset: 4704)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1354, file: !4, line: 2547, baseType: !948, size: 32, align: 32, offset: 4736)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1354, file: !4, line: 2549, baseType: !948, size: 32, align: 32, offset: 4768)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1354, file: !4, line: 2551, baseType: !948, size: 32, align: 32, offset: 4800)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1354, file: !4, line: 2553, baseType: !948, size: 32, align: 32, offset: 4832)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1354, file: !4, line: 2555, baseType: !948, size: 32, align: 32, offset: 4864)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1354, file: !4, line: 2557, baseType: !948, size: 32, align: 32, offset: 4896)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1354, file: !4, line: 2559, baseType: !948, size: 32, align: 32, offset: 4928)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1354, file: !4, line: 2563, baseType: !948, size: 32, align: 32, offset: 4960)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1354, file: !4, line: 2571, baseType: !1456, size: 64, align: 64, offset: 4992)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1354, file: !4, line: 2579, baseType: !1456, size: 64, align: 64, offset: 5056)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1354, file: !4, line: 2586, baseType: !948, size: 32, align: 32, offset: 5120)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1354, file: !4, line: 2615, baseType: !948, size: 32, align: 32, offset: 5152)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1354, file: !4, line: 2627, baseType: !948, size: 32, align: 32, offset: 5184)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1354, file: !4, line: 2637, baseType: !948, size: 32, align: 32, offset: 5216)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1354, file: !4, line: 2681, baseType: !948, size: 32, align: 32, offset: 5248)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1354, file: !4, line: 2709, baseType: !998, size: 64, align: 64, offset: 5312)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1354, file: !4, line: 2716, baseType: !1654, size: 64, align: 64, offset: 5376)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1656)
!1656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1657)
!1657 = !{!1658, !1659, !1660, !1661, !1662, !1663, !1664, !1668, !1672, !1673, !1674, !1675, !1681, !1682, !1683, !1684, !1685}
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1656, file: !4, line: 3642, baseType: !957, size: 64, align: 64)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1656, file: !4, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1656, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1656, file: !4, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1656, file: !4, line: 3669, baseType: !948, size: 32, align: 32, offset: 160)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1656, file: !4, line: 3682, baseType: !1481, size: 64, align: 64, offset: 192)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1656, file: !4, line: 3698, baseType: !1665, size: 64, align: 64, offset: 256)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DISubroutineType(types: !1667)
!1667 = !{!948, !1352, !1306, !1428}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1656, file: !4, line: 3712, baseType: !1669, size: 64, align: 64, offset: 320)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DISubroutineType(types: !1671)
!1671 = !{!948, !1352, !948, !1306, !1428}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1656, file: !4, line: 3726, baseType: !1665, size: 64, align: 64, offset: 384)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1656, file: !4, line: 3737, baseType: !1399, size: 64, align: 64, offset: 448)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1656, file: !4, line: 3746, baseType: !948, size: 32, align: 32, offset: 512)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1656, file: !4, line: 3757, baseType: !1676, size: 64, align: 64, offset: 576)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DISubroutineType(types: !1678)
!1678 = !{null, !1679}
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1656, file: !4, line: 3766, baseType: !1399, size: 64, align: 64, offset: 640)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1656, file: !4, line: 3774, baseType: !1399, size: 64, align: 64, offset: 704)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1656, file: !4, line: 3780, baseType: !948, size: 32, align: 32, offset: 768)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1656, file: !4, line: 3785, baseType: !948, size: 32, align: 32, offset: 800)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1656, file: !4, line: 3795, baseType: !1686, size: 64, align: 64, offset: 832)
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64, align: 64)
!1687 = !DISubroutineType(types: !1688)
!1688 = !{!948, !1352, !1109}
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1354, file: !4, line: 2728, baseType: !984, size: 64, align: 64, offset: 5440)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1354, file: !4, line: 2735, baseType: !1193, size: 512, align: 64, offset: 5504)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1354, file: !4, line: 2742, baseType: !948, size: 32, align: 32, offset: 6016)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1354, file: !4, line: 2755, baseType: !948, size: 32, align: 32, offset: 6048)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1354, file: !4, line: 2776, baseType: !948, size: 32, align: 32, offset: 6080)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1354, file: !4, line: 2783, baseType: !948, size: 32, align: 32, offset: 6112)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1354, file: !4, line: 2791, baseType: !948, size: 32, align: 32, offset: 6144)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1354, file: !4, line: 2802, baseType: !1166, size: 64, align: 64, offset: 6208)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1354, file: !4, line: 2811, baseType: !948, size: 32, align: 32, offset: 6272)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1354, file: !4, line: 2821, baseType: !948, size: 32, align: 32, offset: 6304)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1354, file: !4, line: 2830, baseType: !948, size: 32, align: 32, offset: 6336)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1354, file: !4, line: 2840, baseType: !948, size: 32, align: 32, offset: 6368)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1354, file: !4, line: 2851, baseType: !1702, size: 64, align: 64, offset: 6400)
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64, align: 64)
!1703 = !DISubroutineType(types: !1704)
!1704 = !{!948, !1523, !1705, !984, !1466, !948, !948}
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64, align: 64)
!1706 = !DISubroutineType(types: !1707)
!1707 = !{!948, !1523, !984}
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1354, file: !4, line: 2871, baseType: !1709, size: 64, align: 64, offset: 6464)
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1710 = !DISubroutineType(types: !1711)
!1711 = !{!948, !1523, !1712, !984, !1466, !948}
!1712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1713, size: 64, align: 64)
!1713 = !DISubroutineType(types: !1714)
!1714 = !{!948, !1523, !984, !948, !948}
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1354, file: !4, line: 2878, baseType: !948, size: 32, align: 32, offset: 6528)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1354, file: !4, line: 2885, baseType: !948, size: 32, align: 32, offset: 6560)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1354, file: !4, line: 3005, baseType: !948, size: 32, align: 32, offset: 6592)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1354, file: !4, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
