; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dolby_e.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dolby_e.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!867 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880}
!874 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!875 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!876 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!877 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!878 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!879 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!880 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fft_permutation_type", file: !888, line: 77, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/fft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!889 = !{!890, !891, !892}
!890 = !DIEnumerator(name: "FF_FFT_PERM_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "FF_FFT_PERM_SWAP_LSBS", value: 1)
!892 = !DIEnumerator(name: "FF_FFT_PERM_AVX", value: 2)
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mdct_permutation_type", file: !888, line: 83, size: 32, align: 32, elements: !894)
!894 = !{!895, !896}
!895 = !DIEnumerator(name: "FF_MDCT_PERM_NONE", value: 0)
!896 = !DIEnumerator(name: "FF_MDCT_PERM_INTERLEAVE", value: 1)
!897 = !{!898, !899, !900, !905, !906, !914, !915, !916, !921, !902, !923}
!898 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!899 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!901 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !902)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !903, line: 48, baseType: !904)
!903 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!904 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64, align: 64)
!907 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !909, line: 222, size: 16, align: 8, elements: !910)
!909 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!910 = !{!911}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !908, file: !909, line: 222, baseType: !912, size: 16, align: 16)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !903, line: 49, baseType: !913)
!913 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64, align: 64)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!917 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !909, line: 221, size: 32, align: 8, elements: !918)
!918 = !{!919}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !917, file: !909, line: 221, baseType: !920, size: 32, align: 32)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !903, line: 51, baseType: !899)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!924 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!925 = !{!926, !1648, !1653, !1658, !1659, !1660, !1664, !1668, !1672, !1677, !1678, !1682, !1686, !1690, !1691, !1696, !1699, !1701, !1702, !1725, !1729, !1731, !1733, !1737, !1741, !1745, !1746, !1747, !1748, !1749, !1750, !1754, !1755, !1757, !1760, !1763, !1766, !1769, !1773, !1776, !1779, !1783, !1784, !1791, !1793, !1795, !1798, !1799, !1800, !1804, !1806}
!926 = distinct !DIGlobalVariable(name: "ff_dolby_e_decoder", scope: !0, file: !927, line: 792, type: !928, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_dolby_e_decoder)
!927 = !DIFile(filename: "libavcodec/dolby_e.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !930)
!930 = !{!931, !935, !936, !937, !938, !939, !948, !951, !954, !957, !962, !963, !1004, !1012, !1013, !1014, !1016, !1563, !1569, !1577, !1581, !1582, !1619, !1623, !1627, !1628, !1632, !1636, !1637, !1641, !1642, !1643}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !929, file: !14, line: 3475, baseType: !932, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!934 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !929, file: !14, line: 3480, baseType: !932, size: 64, align: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !929, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !929, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !929, file: !14, line: 3487, baseType: !898, size: 32, align: 32, offset: 192)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !929, file: !14, line: 3488, baseType: !940, size: 64, align: 64, offset: 256)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !943, line: 61, baseType: !944)
!943 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !943, line: 58, size: 64, align: 32, elements: !945)
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !944, file: !943, line: 59, baseType: !898, size: 32, align: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !944, file: !943, line: 60, baseType: !898, size: 32, align: 32, offset: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !929, file: !14, line: 3489, baseType: !949, size: 64, align: 64, offset: 320)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !929, file: !14, line: 3490, baseType: !952, size: 64, align: 64, offset: 384)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !898)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !929, file: !14, line: 3491, baseType: !955, size: 64, align: 64, offset: 448)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !929, file: !14, line: 3492, baseType: !958, size: 64, align: 64, offset: 512)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !903, line: 55, baseType: !961)
!961 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !929, file: !14, line: 3493, baseType: !902, size: 8, align: 8, offset: 576)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !929, file: !14, line: 3494, baseType: !964, size: 64, align: 64, offset: 640)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !968)
!968 = !{!969, !970, !974, !978, !979, !980, !981, !985, !991, !993, !997}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !967, file: !691, line: 72, baseType: !932, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !967, file: !691, line: 78, baseType: !971, size: 64, align: 64, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!932, !905}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !967, file: !691, line: 85, baseType: !975, size: 64, align: 64, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !967, file: !691, line: 93, baseType: !898, size: 32, align: 32, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !967, file: !691, line: 99, baseType: !898, size: 32, align: 32, offset: 224)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !967, file: !691, line: 108, baseType: !898, size: 32, align: 32, offset: 256)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !967, file: !691, line: 113, baseType: !982, size: 64, align: 64, offset: 320)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!905, !905, !905}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !967, file: !691, line: 123, baseType: !986, size: 64, align: 64, offset: 384)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!989, !989}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !967, file: !691, line: 130, baseType: !992, size: 32, align: 32, offset: 448)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !967, file: !691, line: 136, baseType: !994, size: 64, align: 64, offset: 512)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!992, !905}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !967, file: !691, line: 142, baseType: !998, size: 64, align: 64, offset: 576)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!898, !1001, !905, !932, !898}
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !929, file: !14, line: 3495, baseType: !1005, size: 64, align: 64, offset: 704)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1009)
!1009 = !{!1010, !1011}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1008, file: !14, line: 3402, baseType: !898, size: 32, align: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1008, file: !14, line: 3403, baseType: !932, size: 64, align: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !929, file: !14, line: 3507, baseType: !932, size: 64, align: 64, offset: 768)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !929, file: !14, line: 3516, baseType: !898, size: 32, align: 32, offset: 832)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !929, file: !14, line: 3517, baseType: !1015, size: 64, align: 64, offset: 896)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !929, file: !14, line: 3527, baseType: !1017, size: 64, align: 64, offset: 960)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!898, !1020}
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1023)
!1023 = !{!1024, !1025, !1026, !1027, !1030, !1031, !1032, !1033, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1314, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1501, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1022, file: !14, line: 1561, baseType: !964, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1022, file: !14, line: 1562, baseType: !898, size: 32, align: 32, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1022, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1022, file: !14, line: 1565, baseType: !1028, size: 64, align: 64, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1022, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1022, file: !14, line: 1581, baseType: !899, size: 32, align: 32, offset: 224)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1022, file: !14, line: 1583, baseType: !905, size: 64, align: 64, offset: 256)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1022, file: !14, line: 1591, baseType: !1034, size: 64, align: 64, offset: 320)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1036, line: 129, size: 1664, align: 64, elements: !1037)
!1036 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1037 = !{!1038, !1039, !1040, !1041, !1140, !1161, !1162, !1191, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1035, file: !1036, line: 136, baseType: !898, size: 32, align: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1035, file: !1036, line: 151, baseType: !898, size: 32, align: 32, offset: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1035, file: !1036, line: 157, baseType: !898, size: 32, align: 32, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1035, file: !1036, line: 159, baseType: !1042, size: 64, align: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1045)
!1045 = !{!1046, !1050, !1052, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1092, !1094, !1095, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1128, !1129, !1130, !1131, !1132, !1133, !1136, !1137, !1138, !1139}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1044, file: !722, line: 282, baseType: !1047, size: 512, align: 64)
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 512, align: 64, elements: !1048)
!1048 = !{!1049}
!1049 = !DISubrange(count: 8)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1044, file: !722, line: 299, baseType: !1051, size: 256, align: 32, offset: 512)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 256, align: 32, elements: !1048)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1044, file: !722, line: 315, baseType: !1053, size: 64, align: 64, offset: 768)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1044, file: !722, line: 326, baseType: !898, size: 32, align: 32, offset: 832)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1044, file: !722, line: 326, baseType: !898, size: 32, align: 32, offset: 864)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1044, file: !722, line: 334, baseType: !898, size: 32, align: 32, offset: 896)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1044, file: !722, line: 341, baseType: !898, size: 32, align: 32, offset: 928)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1044, file: !722, line: 346, baseType: !898, size: 32, align: 32, offset: 960)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1044, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1044, file: !722, line: 356, baseType: !942, size: 64, align: 32, offset: 1024)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1044, file: !722, line: 361, baseType: !1062, size: 64, align: 64, offset: 1088)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !903, line: 40, baseType: !1063)
!1063 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1044, file: !722, line: 369, baseType: !1062, size: 64, align: 64, offset: 1152)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1044, file: !722, line: 377, baseType: !1062, size: 64, align: 64, offset: 1216)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1044, file: !722, line: 382, baseType: !898, size: 32, align: 32, offset: 1280)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1044, file: !722, line: 386, baseType: !898, size: 32, align: 32, offset: 1312)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1044, file: !722, line: 391, baseType: !898, size: 32, align: 32, offset: 1344)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1044, file: !722, line: 396, baseType: !905, size: 64, align: 64, offset: 1408)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1044, file: !722, line: 403, baseType: !1071, size: 512, align: 64, offset: 1472)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 512, align: 64, elements: !1048)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1044, file: !722, line: 410, baseType: !898, size: 32, align: 32, offset: 1984)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1044, file: !722, line: 415, baseType: !898, size: 32, align: 32, offset: 2016)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1044, file: !722, line: 420, baseType: !898, size: 32, align: 32, offset: 2048)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1044, file: !722, line: 425, baseType: !898, size: 32, align: 32, offset: 2080)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1044, file: !722, line: 435, baseType: !1062, size: 64, align: 64, offset: 2112)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1044, file: !722, line: 440, baseType: !898, size: 32, align: 32, offset: 2176)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1044, file: !722, line: 445, baseType: !960, size: 64, align: 64, offset: 2240)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1044, file: !722, line: 459, baseType: !1080, size: 512, align: 64, offset: 2304)
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1081, size: 512, align: 64, elements: !1048)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1083, line: 94, baseType: !1084)
!1083 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1083, line: 81, size: 192, align: 64, elements: !1085)
!1085 = !{!1086, !1090, !1091}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1084, file: !1083, line: 82, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1083, line: 73, baseType: !1089)
!1089 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1083, line: 73, flags: DIFlagFwdDecl)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1084, file: !1083, line: 89, baseType: !915, size: 64, align: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1084, file: !1083, line: 93, baseType: !898, size: 32, align: 32, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1044, file: !722, line: 473, baseType: !1093, size: 64, align: 64, offset: 2816)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1044, file: !722, line: 477, baseType: !898, size: 32, align: 32, offset: 2880)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1044, file: !722, line: 479, baseType: !1096, size: 64, align: 64, offset: 2944)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1104, !1109}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1099, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1099, file: !722, line: 203, baseType: !915, size: 64, align: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1099, file: !722, line: 204, baseType: !898, size: 32, align: 32, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1099, file: !722, line: 205, baseType: !1105, size: 64, align: 64, offset: 192)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1107, line: 86, baseType: !1108)
!1107 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1108 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1107, line: 86, flags: DIFlagFwdDecl)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1099, file: !722, line: 206, baseType: !1081, size: 64, align: 64, offset: 256)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1044, file: !722, line: 480, baseType: !898, size: 32, align: 32, offset: 3008)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1044, file: !722, line: 505, baseType: !898, size: 32, align: 32, offset: 3040)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1044, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1044, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1044, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1044, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1044, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1044, file: !722, line: 532, baseType: !1062, size: 64, align: 64, offset: 3264)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1044, file: !722, line: 539, baseType: !1062, size: 64, align: 64, offset: 3328)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1044, file: !722, line: 547, baseType: !1062, size: 64, align: 64, offset: 3392)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1044, file: !722, line: 554, baseType: !1105, size: 64, align: 64, offset: 3456)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1044, file: !722, line: 563, baseType: !898, size: 32, align: 32, offset: 3520)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1044, file: !722, line: 572, baseType: !898, size: 32, align: 32, offset: 3552)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1044, file: !722, line: 581, baseType: !898, size: 32, align: 32, offset: 3584)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1044, file: !722, line: 588, baseType: !1125, size: 64, align: 64, offset: 3648)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !903, line: 36, baseType: !1127)
!1127 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1044, file: !722, line: 593, baseType: !898, size: 32, align: 32, offset: 3712)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1044, file: !722, line: 596, baseType: !898, size: 32, align: 32, offset: 3744)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1044, file: !722, line: 599, baseType: !1081, size: 64, align: 64, offset: 3776)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1044, file: !722, line: 605, baseType: !1081, size: 64, align: 64, offset: 3840)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1044, file: !722, line: 616, baseType: !1081, size: 64, align: 64, offset: 3904)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1044, file: !722, line: 626, baseType: !1134, size: 64, align: 64, offset: 3968)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1135, line: 216, baseType: !961)
!1135 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1044, file: !722, line: 627, baseType: !1134, size: 64, align: 64, offset: 4032)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1044, file: !722, line: 628, baseType: !1134, size: 64, align: 64, offset: 4096)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1044, file: !722, line: 629, baseType: !1134, size: 64, align: 64, offset: 4160)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1044, file: !722, line: 645, baseType: !1081, size: 64, align: 64, offset: 4224)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1035, file: !1036, line: 161, baseType: !1141, size: 64, align: 64, offset: 192)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1036, line: 117, baseType: !1143)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1036, line: 100, size: 832, align: 64, elements: !1144)
!1144 = !{!1145, !1152, !1153, !1154, !1155, !1156, !1158, !1159, !1160}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1143, file: !1036, line: 105, baseType: !1146, size: 256, align: 64)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1147, size: 256, align: 64, elements: !1150)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1083, line: 238, baseType: !1149)
!1149 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1083, line: 238, flags: DIFlagFwdDecl)
!1150 = !{!1151}
!1151 = !DISubrange(count: 4)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1143, file: !1036, line: 110, baseType: !898, size: 32, align: 32, offset: 256)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1143, file: !1036, line: 111, baseType: !898, size: 32, align: 32, offset: 288)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1143, file: !1036, line: 111, baseType: !898, size: 32, align: 32, offset: 320)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1143, file: !1036, line: 112, baseType: !1051, size: 256, align: 32, offset: 352)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1143, file: !1036, line: 113, baseType: !1157, size: 128, align: 32, offset: 608)
!1157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 128, align: 32, elements: !1150)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1143, file: !1036, line: 114, baseType: !898, size: 32, align: 32, offset: 736)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1143, file: !1036, line: 115, baseType: !898, size: 32, align: 32, offset: 768)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1143, file: !1036, line: 116, baseType: !898, size: 32, align: 32, offset: 800)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1035, file: !1036, line: 163, baseType: !905, size: 64, align: 64, offset: 256)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1035, file: !1036, line: 165, baseType: !1163, size: 128, align: 64, offset: 320)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1036, line: 122, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1036, line: 119, size: 128, align: 64, elements: !1165)
!1165 = !{!1166, !1190}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1164, file: !1036, line: 120, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1169)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1170)
!1170 = !{!1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1186, !1187, !1188, !1189}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1169, file: !14, line: 1451, baseType: !1081, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1169, file: !14, line: 1461, baseType: !1062, size: 64, align: 64, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1169, file: !14, line: 1467, baseType: !1062, size: 64, align: 64, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1169, file: !14, line: 1468, baseType: !915, size: 64, align: 64, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1169, file: !14, line: 1469, baseType: !898, size: 32, align: 32, offset: 256)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1169, file: !14, line: 1470, baseType: !898, size: 32, align: 32, offset: 288)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1169, file: !14, line: 1474, baseType: !898, size: 32, align: 32, offset: 320)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1169, file: !14, line: 1479, baseType: !1179, size: 64, align: 64, offset: 384)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1182)
!1182 = !{!1183, !1184, !1185}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1181, file: !14, line: 1412, baseType: !915, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1181, file: !14, line: 1413, baseType: !898, size: 32, align: 32, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1181, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1169, file: !14, line: 1480, baseType: !898, size: 32, align: 32, offset: 448)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1169, file: !14, line: 1486, baseType: !1062, size: 64, align: 64, offset: 512)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1169, file: !14, line: 1488, baseType: !1062, size: 64, align: 64, offset: 576)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1169, file: !14, line: 1497, baseType: !1062, size: 64, align: 64, offset: 640)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1164, file: !1036, line: 121, baseType: !1042, size: 64, align: 64, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1035, file: !1036, line: 166, baseType: !1192, size: 128, align: 64, offset: 448)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1036, line: 127, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1036, line: 124, size: 128, align: 64, elements: !1194)
!1194 = !{!1195, !1268}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1193, file: !1036, line: 125, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1200)
!1200 = !{!1201, !1202, !1226, !1230, !1231, !1265, !1266, !1267}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1199, file: !14, line: 5751, baseType: !964, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1199, file: !14, line: 5756, baseType: !1203, size: 64, align: 64, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1205)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1206)
!1206 = !{!1207, !1208, !1211, !1212, !1213, !1217, !1221, !1225}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1205, file: !14, line: 5797, baseType: !932, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1205, file: !14, line: 5804, baseType: !1209, size: 64, align: 64, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1205, file: !14, line: 5815, baseType: !964, size: 64, align: 64, offset: 128)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1205, file: !14, line: 5825, baseType: !898, size: 32, align: 32, offset: 192)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1205, file: !14, line: 5826, baseType: !1214, size: 64, align: 64, offset: 256)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!898, !1197}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1205, file: !14, line: 5827, baseType: !1218, size: 64, align: 64, offset: 320)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!898, !1197, !1167}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1205, file: !14, line: 5828, baseType: !1222, size: 64, align: 64, offset: 384)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{null, !1197}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1205, file: !14, line: 5829, baseType: !1222, size: 64, align: 64, offset: 448)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1199, file: !14, line: 5762, baseType: !1227, size: 64, align: 64, offset: 128)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1229)
!1229 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1199, file: !14, line: 5768, baseType: !905, size: 64, align: 64, offset: 192)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1199, file: !14, line: 5775, baseType: !1232, size: 64, align: 64, offset: 256)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1235)
!1235 = !{!1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1234, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1234, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1234, file: !14, line: 3948, baseType: !920, size: 32, align: 32, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1234, file: !14, line: 3958, baseType: !915, size: 64, align: 64, offset: 128)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1234, file: !14, line: 3962, baseType: !898, size: 32, align: 32, offset: 192)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1234, file: !14, line: 3968, baseType: !898, size: 32, align: 32, offset: 224)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1234, file: !14, line: 3973, baseType: !1062, size: 64, align: 64, offset: 256)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1234, file: !14, line: 3986, baseType: !898, size: 32, align: 32, offset: 320)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1234, file: !14, line: 3999, baseType: !898, size: 32, align: 32, offset: 352)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1234, file: !14, line: 4004, baseType: !898, size: 32, align: 32, offset: 384)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1234, file: !14, line: 4005, baseType: !898, size: 32, align: 32, offset: 416)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1234, file: !14, line: 4010, baseType: !898, size: 32, align: 32, offset: 448)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1234, file: !14, line: 4011, baseType: !898, size: 32, align: 32, offset: 480)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1234, file: !14, line: 4020, baseType: !942, size: 64, align: 32, offset: 512)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1234, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1234, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1234, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1234, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1234, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1234, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1234, file: !14, line: 4039, baseType: !898, size: 32, align: 32, offset: 768)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1234, file: !14, line: 4046, baseType: !960, size: 64, align: 64, offset: 832)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1234, file: !14, line: 4050, baseType: !898, size: 32, align: 32, offset: 896)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1234, file: !14, line: 4054, baseType: !898, size: 32, align: 32, offset: 928)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1234, file: !14, line: 4061, baseType: !898, size: 32, align: 32, offset: 960)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1234, file: !14, line: 4065, baseType: !898, size: 32, align: 32, offset: 992)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1234, file: !14, line: 4073, baseType: !898, size: 32, align: 32, offset: 1024)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1234, file: !14, line: 4080, baseType: !898, size: 32, align: 32, offset: 1056)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1234, file: !14, line: 4084, baseType: !898, size: 32, align: 32, offset: 1088)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1199, file: !14, line: 5781, baseType: !1232, size: 64, align: 64, offset: 320)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1199, file: !14, line: 5787, baseType: !942, size: 64, align: 32, offset: 384)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1199, file: !14, line: 5793, baseType: !942, size: 64, align: 32, offset: 448)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1193, file: !1036, line: 126, baseType: !898, size: 32, align: 32, offset: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1035, file: !1036, line: 172, baseType: !1167, size: 64, align: 64, offset: 576)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1035, file: !1036, line: 177, baseType: !915, size: 64, align: 64, offset: 640)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1035, file: !1036, line: 178, baseType: !899, size: 32, align: 32, offset: 704)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1035, file: !1036, line: 180, baseType: !905, size: 64, align: 64, offset: 768)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1035, file: !1036, line: 185, baseType: !898, size: 32, align: 32, offset: 832)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1035, file: !1036, line: 190, baseType: !905, size: 64, align: 64, offset: 896)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1035, file: !1036, line: 195, baseType: !898, size: 32, align: 32, offset: 960)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1035, file: !1036, line: 200, baseType: !1167, size: 64, align: 64, offset: 1024)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1035, file: !1036, line: 201, baseType: !898, size: 32, align: 32, offset: 1088)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1035, file: !1036, line: 202, baseType: !1042, size: 64, align: 64, offset: 1152)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1035, file: !1036, line: 203, baseType: !898, size: 32, align: 32, offset: 1216)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1035, file: !1036, line: 205, baseType: !898, size: 32, align: 32, offset: 1248)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1035, file: !1036, line: 206, baseType: !898, size: 32, align: 32, offset: 1280)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1035, file: !1036, line: 209, baseType: !1134, size: 64, align: 64, offset: 1344)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1035, file: !1036, line: 212, baseType: !1134, size: 64, align: 64, offset: 1408)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1035, file: !1036, line: 213, baseType: !1042, size: 64, align: 64, offset: 1472)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1035, file: !1036, line: 215, baseType: !898, size: 32, align: 32, offset: 1536)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1035, file: !1036, line: 217, baseType: !898, size: 32, align: 32, offset: 1568)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1035, file: !1036, line: 220, baseType: !898, size: 32, align: 32, offset: 1600)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1022, file: !14, line: 1598, baseType: !905, size: 64, align: 64, offset: 384)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1022, file: !14, line: 1606, baseType: !1062, size: 64, align: 64, offset: 448)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1022, file: !14, line: 1614, baseType: !898, size: 32, align: 32, offset: 512)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1022, file: !14, line: 1622, baseType: !898, size: 32, align: 32, offset: 544)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1022, file: !14, line: 1628, baseType: !898, size: 32, align: 32, offset: 576)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1022, file: !14, line: 1636, baseType: !898, size: 32, align: 32, offset: 608)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1022, file: !14, line: 1643, baseType: !898, size: 32, align: 32, offset: 640)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1022, file: !14, line: 1657, baseType: !915, size: 64, align: 64, offset: 704)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1022, file: !14, line: 1658, baseType: !898, size: 32, align: 32, offset: 768)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1022, file: !14, line: 1679, baseType: !942, size: 64, align: 32, offset: 800)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1022, file: !14, line: 1688, baseType: !898, size: 32, align: 32, offset: 864)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1022, file: !14, line: 1712, baseType: !898, size: 32, align: 32, offset: 896)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1022, file: !14, line: 1729, baseType: !898, size: 32, align: 32, offset: 928)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1022, file: !14, line: 1729, baseType: !898, size: 32, align: 32, offset: 960)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1022, file: !14, line: 1744, baseType: !898, size: 32, align: 32, offset: 992)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1022, file: !14, line: 1744, baseType: !898, size: 32, align: 32, offset: 1024)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1022, file: !14, line: 1751, baseType: !898, size: 32, align: 32, offset: 1056)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1022, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1022, file: !14, line: 1791, baseType: !1307, size: 64, align: 64, offset: 1152)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{null, !1310, !1311, !1313, !898, !898, !898}
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1022, file: !14, line: 1808, baseType: !1315, size: 64, align: 64, offset: 1216)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{!473, !1310, !949}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1022, file: !14, line: 1816, baseType: !898, size: 32, align: 32, offset: 1280)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1022, file: !14, line: 1825, baseType: !924, size: 32, align: 32, offset: 1312)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1022, file: !14, line: 1830, baseType: !898, size: 32, align: 32, offset: 1344)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1022, file: !14, line: 1838, baseType: !924, size: 32, align: 32, offset: 1376)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1022, file: !14, line: 1846, baseType: !898, size: 32, align: 32, offset: 1408)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1022, file: !14, line: 1851, baseType: !898, size: 32, align: 32, offset: 1440)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1022, file: !14, line: 1861, baseType: !924, size: 32, align: 32, offset: 1472)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1022, file: !14, line: 1868, baseType: !924, size: 32, align: 32, offset: 1504)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1022, file: !14, line: 1875, baseType: !924, size: 32, align: 32, offset: 1536)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1022, file: !14, line: 1882, baseType: !924, size: 32, align: 32, offset: 1568)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1022, file: !14, line: 1889, baseType: !924, size: 32, align: 32, offset: 1600)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1022, file: !14, line: 1896, baseType: !924, size: 32, align: 32, offset: 1632)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1022, file: !14, line: 1903, baseType: !924, size: 32, align: 32, offset: 1664)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1022, file: !14, line: 1910, baseType: !898, size: 32, align: 32, offset: 1696)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1022, file: !14, line: 1915, baseType: !898, size: 32, align: 32, offset: 1728)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1022, file: !14, line: 1926, baseType: !1313, size: 64, align: 64, offset: 1792)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1022, file: !14, line: 1935, baseType: !942, size: 64, align: 32, offset: 1856)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1022, file: !14, line: 1942, baseType: !898, size: 32, align: 32, offset: 1920)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1022, file: !14, line: 1948, baseType: !898, size: 32, align: 32, offset: 1952)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1022, file: !14, line: 1954, baseType: !898, size: 32, align: 32, offset: 1984)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1022, file: !14, line: 1960, baseType: !898, size: 32, align: 32, offset: 2016)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1022, file: !14, line: 1984, baseType: !898, size: 32, align: 32, offset: 2048)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1022, file: !14, line: 1991, baseType: !898, size: 32, align: 32, offset: 2080)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1022, file: !14, line: 1996, baseType: !898, size: 32, align: 32, offset: 2112)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1022, file: !14, line: 2004, baseType: !898, size: 32, align: 32, offset: 2144)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1022, file: !14, line: 2011, baseType: !898, size: 32, align: 32, offset: 2176)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1022, file: !14, line: 2018, baseType: !898, size: 32, align: 32, offset: 2208)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1022, file: !14, line: 2027, baseType: !898, size: 32, align: 32, offset: 2240)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1022, file: !14, line: 2034, baseType: !898, size: 32, align: 32, offset: 2272)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1022, file: !14, line: 2044, baseType: !898, size: 32, align: 32, offset: 2304)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1022, file: !14, line: 2054, baseType: !1349, size: 64, align: 64, offset: 2368)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1022, file: !14, line: 2061, baseType: !1349, size: 64, align: 64, offset: 2432)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1022, file: !14, line: 2066, baseType: !898, size: 32, align: 32, offset: 2496)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1022, file: !14, line: 2070, baseType: !898, size: 32, align: 32, offset: 2528)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1022, file: !14, line: 2078, baseType: !898, size: 32, align: 32, offset: 2560)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1022, file: !14, line: 2085, baseType: !898, size: 32, align: 32, offset: 2592)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1022, file: !14, line: 2092, baseType: !898, size: 32, align: 32, offset: 2624)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1022, file: !14, line: 2099, baseType: !898, size: 32, align: 32, offset: 2656)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1022, file: !14, line: 2106, baseType: !898, size: 32, align: 32, offset: 2688)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1022, file: !14, line: 2113, baseType: !898, size: 32, align: 32, offset: 2720)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1022, file: !14, line: 2120, baseType: !898, size: 32, align: 32, offset: 2752)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1022, file: !14, line: 2125, baseType: !898, size: 32, align: 32, offset: 2784)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1022, file: !14, line: 2133, baseType: !898, size: 32, align: 32, offset: 2816)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1022, file: !14, line: 2140, baseType: !898, size: 32, align: 32, offset: 2848)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1022, file: !14, line: 2145, baseType: !898, size: 32, align: 32, offset: 2880)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1022, file: !14, line: 2153, baseType: !898, size: 32, align: 32, offset: 2912)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1022, file: !14, line: 2158, baseType: !898, size: 32, align: 32, offset: 2944)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1022, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1022, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1022, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1022, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1022, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1022, file: !14, line: 2203, baseType: !898, size: 32, align: 32, offset: 3136)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1022, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1022, file: !14, line: 2212, baseType: !898, size: 32, align: 32, offset: 3200)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1022, file: !14, line: 2213, baseType: !898, size: 32, align: 32, offset: 3232)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1022, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1022, file: !14, line: 2232, baseType: !898, size: 32, align: 32, offset: 3296)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1022, file: !14, line: 2243, baseType: !898, size: 32, align: 32, offset: 3328)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1022, file: !14, line: 2249, baseType: !898, size: 32, align: 32, offset: 3360)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1022, file: !14, line: 2256, baseType: !898, size: 32, align: 32, offset: 3392)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1022, file: !14, line: 2263, baseType: !960, size: 64, align: 64, offset: 3456)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1022, file: !14, line: 2270, baseType: !960, size: 64, align: 64, offset: 3520)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1022, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1022, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1022, file: !14, line: 2367, baseType: !1385, size: 64, align: 64, offset: 3648)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DISubroutineType(types: !1387)
!1387 = !{!898, !1310, !1042, !898}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1022, file: !14, line: 2383, baseType: !898, size: 32, align: 32, offset: 3712)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1022, file: !14, line: 2386, baseType: !924, size: 32, align: 32, offset: 3744)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1022, file: !14, line: 2387, baseType: !924, size: 32, align: 32, offset: 3776)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1022, file: !14, line: 2394, baseType: !898, size: 32, align: 32, offset: 3808)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1022, file: !14, line: 2401, baseType: !898, size: 32, align: 32, offset: 3840)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1022, file: !14, line: 2408, baseType: !898, size: 32, align: 32, offset: 3872)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1022, file: !14, line: 2415, baseType: !898, size: 32, align: 32, offset: 3904)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1022, file: !14, line: 2422, baseType: !898, size: 32, align: 32, offset: 3936)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1022, file: !14, line: 2423, baseType: !1397, size: 64, align: 64, offset: 3968)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1399)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1400)
!1400 = !{!1401, !1402, !1403, !1404}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1399, file: !14, line: 827, baseType: !898, size: 32, align: 32)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1399, file: !14, line: 828, baseType: !898, size: 32, align: 32, offset: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1399, file: !14, line: 829, baseType: !898, size: 32, align: 32, offset: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1399, file: !14, line: 830, baseType: !924, size: 32, align: 32, offset: 96)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1022, file: !14, line: 2430, baseType: !1062, size: 64, align: 64, offset: 4032)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1022, file: !14, line: 2437, baseType: !1062, size: 64, align: 64, offset: 4096)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1022, file: !14, line: 2444, baseType: !924, size: 32, align: 32, offset: 4160)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1022, file: !14, line: 2451, baseType: !924, size: 32, align: 32, offset: 4192)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1022, file: !14, line: 2458, baseType: !898, size: 32, align: 32, offset: 4224)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1022, file: !14, line: 2469, baseType: !898, size: 32, align: 32, offset: 4256)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1022, file: !14, line: 2475, baseType: !898, size: 32, align: 32, offset: 4288)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1022, file: !14, line: 2481, baseType: !898, size: 32, align: 32, offset: 4320)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1022, file: !14, line: 2485, baseType: !898, size: 32, align: 32, offset: 4352)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1022, file: !14, line: 2489, baseType: !898, size: 32, align: 32, offset: 4384)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1022, file: !14, line: 2493, baseType: !898, size: 32, align: 32, offset: 4416)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1022, file: !14, line: 2501, baseType: !898, size: 32, align: 32, offset: 4448)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1022, file: !14, line: 2506, baseType: !898, size: 32, align: 32, offset: 4480)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1022, file: !14, line: 2510, baseType: !898, size: 32, align: 32, offset: 4512)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1022, file: !14, line: 2514, baseType: !1062, size: 64, align: 64, offset: 4544)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1022, file: !14, line: 2528, baseType: !1421, size: 64, align: 64, offset: 4608)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DISubroutineType(types: !1423)
!1423 = !{null, !1310, !905, !898, !898}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1022, file: !14, line: 2534, baseType: !898, size: 32, align: 32, offset: 4672)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1022, file: !14, line: 2545, baseType: !898, size: 32, align: 32, offset: 4704)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1022, file: !14, line: 2547, baseType: !898, size: 32, align: 32, offset: 4736)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1022, file: !14, line: 2549, baseType: !898, size: 32, align: 32, offset: 4768)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1022, file: !14, line: 2551, baseType: !898, size: 32, align: 32, offset: 4800)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1022, file: !14, line: 2553, baseType: !898, size: 32, align: 32, offset: 4832)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1022, file: !14, line: 2555, baseType: !898, size: 32, align: 32, offset: 4864)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1022, file: !14, line: 2557, baseType: !898, size: 32, align: 32, offset: 4896)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1022, file: !14, line: 2559, baseType: !898, size: 32, align: 32, offset: 4928)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1022, file: !14, line: 2563, baseType: !898, size: 32, align: 32, offset: 4960)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1022, file: !14, line: 2571, baseType: !1435, size: 64, align: 64, offset: 4992)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1022, file: !14, line: 2579, baseType: !1435, size: 64, align: 64, offset: 5056)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1022, file: !14, line: 2586, baseType: !898, size: 32, align: 32, offset: 5120)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1022, file: !14, line: 2615, baseType: !898, size: 32, align: 32, offset: 5152)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1022, file: !14, line: 2627, baseType: !898, size: 32, align: 32, offset: 5184)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1022, file: !14, line: 2637, baseType: !898, size: 32, align: 32, offset: 5216)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1022, file: !14, line: 2681, baseType: !898, size: 32, align: 32, offset: 5248)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1022, file: !14, line: 2709, baseType: !1062, size: 64, align: 64, offset: 5312)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1022, file: !14, line: 2716, baseType: !1444, size: 64, align: 64, offset: 5376)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1446)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1447)
!1447 = !{!1448, !1449, !1450, !1451, !1452, !1453, !1457, !1461, !1465, !1466, !1467, !1468, !1474, !1475, !1476, !1477, !1478}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1446, file: !14, line: 3642, baseType: !932, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1446, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1446, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1446, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1446, file: !14, line: 3669, baseType: !898, size: 32, align: 32, offset: 160)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1446, file: !14, line: 3682, baseType: !1454, size: 64, align: 64, offset: 192)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DISubroutineType(types: !1456)
!1456 = !{!898, !1020, !1042}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1446, file: !14, line: 3698, baseType: !1458, size: 64, align: 64, offset: 256)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DISubroutineType(types: !1460)
!1460 = !{!898, !1020, !900, !920}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1446, file: !14, line: 3712, baseType: !1462, size: 64, align: 64, offset: 320)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{!898, !1020, !898, !900, !920}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1446, file: !14, line: 3726, baseType: !1458, size: 64, align: 64, offset: 384)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1446, file: !14, line: 3737, baseType: !1017, size: 64, align: 64, offset: 448)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1446, file: !14, line: 3746, baseType: !898, size: 32, align: 32, offset: 512)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1446, file: !14, line: 3757, baseType: !1469, size: 64, align: 64, offset: 576)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DISubroutineType(types: !1471)
!1471 = !{null, !1472}
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1446, file: !14, line: 3766, baseType: !1017, size: 64, align: 64, offset: 640)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1446, file: !14, line: 3774, baseType: !1017, size: 64, align: 64, offset: 704)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1446, file: !14, line: 3780, baseType: !898, size: 32, align: 32, offset: 768)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1446, file: !14, line: 3785, baseType: !898, size: 32, align: 32, offset: 800)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1446, file: !14, line: 3795, baseType: !1479, size: 64, align: 64, offset: 832)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{!898, !1020, !1081}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1022, file: !14, line: 2728, baseType: !905, size: 64, align: 64, offset: 5440)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1022, file: !14, line: 2735, baseType: !1071, size: 512, align: 64, offset: 5504)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1022, file: !14, line: 2742, baseType: !898, size: 32, align: 32, offset: 6016)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1022, file: !14, line: 2755, baseType: !898, size: 32, align: 32, offset: 6048)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1022, file: !14, line: 2776, baseType: !898, size: 32, align: 32, offset: 6080)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1022, file: !14, line: 2783, baseType: !898, size: 32, align: 32, offset: 6112)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1022, file: !14, line: 2791, baseType: !898, size: 32, align: 32, offset: 6144)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1022, file: !14, line: 2802, baseType: !1042, size: 64, align: 64, offset: 6208)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1022, file: !14, line: 2811, baseType: !898, size: 32, align: 32, offset: 6272)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1022, file: !14, line: 2821, baseType: !898, size: 32, align: 32, offset: 6304)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1022, file: !14, line: 2830, baseType: !898, size: 32, align: 32, offset: 6336)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1022, file: !14, line: 2840, baseType: !898, size: 32, align: 32, offset: 6368)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1022, file: !14, line: 2851, baseType: !1495, size: 64, align: 64, offset: 6400)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{!898, !1310, !1498, !905, !1313, !898, !898}
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DISubroutineType(types: !1500)
!1500 = !{!898, !1310, !905}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1022, file: !14, line: 2871, baseType: !1502, size: 64, align: 64, offset: 6464)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{!898, !1310, !1505, !905, !1313, !898}
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DISubroutineType(types: !1507)
!1507 = !{!898, !1310, !905, !898, !898}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1022, file: !14, line: 2878, baseType: !898, size: 32, align: 32, offset: 6528)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1022, file: !14, line: 2885, baseType: !898, size: 32, align: 32, offset: 6560)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1022, file: !14, line: 3005, baseType: !898, size: 32, align: 32, offset: 6592)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1022, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1022, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1022, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1022, file: !14, line: 3037, baseType: !915, size: 64, align: 64, offset: 6720)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1022, file: !14, line: 3038, baseType: !898, size: 32, align: 32, offset: 6784)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1022, file: !14, line: 3050, baseType: !960, size: 64, align: 64, offset: 6848)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1022, file: !14, line: 3065, baseType: !898, size: 32, align: 32, offset: 6912)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1022, file: !14, line: 3083, baseType: !898, size: 32, align: 32, offset: 6944)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1022, file: !14, line: 3092, baseType: !942, size: 64, align: 32, offset: 6976)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1022, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1022, file: !14, line: 3106, baseType: !942, size: 64, align: 32, offset: 7072)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1022, file: !14, line: 3113, baseType: !1523, size: 64, align: 64, offset: 7168)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1525)
!1525 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1526)
!1526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1527)
!1527 = !{!1528, !1529, !1530, !1531, !1532, !1533, !1536}
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1526, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1526, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1526, file: !14, line: 720, baseType: !932, size: 64, align: 64, offset: 64)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1526, file: !14, line: 724, baseType: !932, size: 64, align: 64, offset: 128)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1526, file: !14, line: 728, baseType: !898, size: 32, align: 32, offset: 192)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1526, file: !14, line: 734, baseType: !1534, size: 64, align: 64, offset: 256)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1526, file: !14, line: 739, baseType: !1537, size: 64, align: 64, offset: 320)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64, align: 64)
!1538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1022, file: !14, line: 3129, baseType: !1062, size: 64, align: 64, offset: 7232)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1022, file: !14, line: 3130, baseType: !1062, size: 64, align: 64, offset: 7296)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1022, file: !14, line: 3131, baseType: !1062, size: 64, align: 64, offset: 7360)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1022, file: !14, line: 3132, baseType: !1062, size: 64, align: 64, offset: 7424)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1022, file: !14, line: 3139, baseType: !1435, size: 64, align: 64, offset: 7488)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1022, file: !14, line: 3147, baseType: !898, size: 32, align: 32, offset: 7552)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1022, file: !14, line: 3165, baseType: !898, size: 32, align: 32, offset: 7584)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1022, file: !14, line: 3172, baseType: !898, size: 32, align: 32, offset: 7616)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1022, file: !14, line: 3180, baseType: !898, size: 32, align: 32, offset: 7648)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1022, file: !14, line: 3191, baseType: !1349, size: 64, align: 64, offset: 7680)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1022, file: !14, line: 3199, baseType: !915, size: 64, align: 64, offset: 7744)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1022, file: !14, line: 3207, baseType: !1435, size: 64, align: 64, offset: 7808)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1022, file: !14, line: 3214, baseType: !899, size: 32, align: 32, offset: 7872)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1022, file: !14, line: 3224, baseType: !1179, size: 64, align: 64, offset: 7936)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1022, file: !14, line: 3225, baseType: !898, size: 32, align: 32, offset: 8000)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1022, file: !14, line: 3249, baseType: !1081, size: 64, align: 64, offset: 8064)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1022, file: !14, line: 3256, baseType: !898, size: 32, align: 32, offset: 8128)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1022, file: !14, line: 3271, baseType: !898, size: 32, align: 32, offset: 8160)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1022, file: !14, line: 3279, baseType: !1062, size: 64, align: 64, offset: 8192)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1022, file: !14, line: 3301, baseType: !1081, size: 64, align: 64, offset: 8256)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1022, file: !14, line: 3310, baseType: !898, size: 32, align: 32, offset: 8320)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1022, file: !14, line: 3337, baseType: !898, size: 32, align: 32, offset: 8352)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1022, file: !14, line: 3351, baseType: !898, size: 32, align: 32, offset: 8384)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1022, file: !14, line: 3359, baseType: !898, size: 32, align: 32, offset: 8416)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !929, file: !14, line: 3535, baseType: !1564, size: 64, align: 64, offset: 1024)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DISubroutineType(types: !1566)
!1566 = !{!898, !1020, !1567}
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1021)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !929, file: !14, line: 3541, baseType: !1570, size: 64, align: 64, offset: 1088)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1572)
!1572 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1573)
!1573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1036, line: 223, size: 128, align: 64, elements: !1574)
!1574 = !{!1575, !1576}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1573, file: !1036, line: 224, baseType: !900, size: 64, align: 64)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1573, file: !1036, line: 225, baseType: !900, size: 64, align: 64, offset: 64)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !929, file: !14, line: 3549, baseType: !1578, size: 64, align: 64, offset: 1152)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64, align: 64)
!1579 = !DISubroutineType(types: !1580)
!1580 = !{null, !1015}
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !929, file: !14, line: 3551, baseType: !1017, size: 64, align: 64, offset: 1216)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !929, file: !14, line: 3552, baseType: !1583, size: 64, align: 64, offset: 1280)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DISubroutineType(types: !1585)
!1585 = !{!898, !1020, !915, !898, !1586}
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1588)
!1588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1589)
!1589 = !{!1590, !1591, !1592, !1593, !1594, !1618}
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1588, file: !14, line: 3921, baseType: !912, size: 16, align: 16)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1588, file: !14, line: 3922, baseType: !920, size: 32, align: 32, offset: 32)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1588, file: !14, line: 3923, baseType: !920, size: 32, align: 32, offset: 64)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1588, file: !14, line: 3924, baseType: !899, size: 32, align: 32, offset: 96)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1588, file: !14, line: 3925, baseType: !1595, size: 64, align: 64, offset: 128)
!1595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1596, size: 64, align: 64)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1598)
!1598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1599)
!1599 = !{!1600, !1601, !1602, !1603, !1604, !1605, !1611, !1613, !1614, !1615, !1616, !1617}
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1598, file: !14, line: 3886, baseType: !898, size: 32, align: 32)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1598, file: !14, line: 3887, baseType: !898, size: 32, align: 32, offset: 32)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1598, file: !14, line: 3888, baseType: !898, size: 32, align: 32, offset: 64)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1598, file: !14, line: 3889, baseType: !898, size: 32, align: 32, offset: 96)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1598, file: !14, line: 3890, baseType: !898, size: 32, align: 32, offset: 128)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1598, file: !14, line: 3897, baseType: !1606, size: 768, align: 64, offset: 192)
!1606 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1607)
!1607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1608)
!1608 = !{!1609, !1610}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1607, file: !14, line: 3855, baseType: !1047, size: 512, align: 64)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1607, file: !14, line: 3857, baseType: !1051, size: 256, align: 32, offset: 512)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1598, file: !14, line: 3903, baseType: !1612, size: 256, align: 64, offset: 960)
!1612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 256, align: 64, elements: !1150)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1598, file: !14, line: 3904, baseType: !1157, size: 128, align: 32, offset: 1216)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1598, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1598, file: !14, line: 3908, baseType: !1435, size: 64, align: 64, offset: 1408)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1598, file: !14, line: 3915, baseType: !1435, size: 64, align: 64, offset: 1472)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1598, file: !14, line: 3917, baseType: !898, size: 32, align: 32, offset: 1536)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1588, file: !14, line: 3926, baseType: !1062, size: 64, align: 64, offset: 192)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !929, file: !14, line: 3564, baseType: !1620, size: 64, align: 64, offset: 1344)
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64, align: 64)
!1621 = !DISubroutineType(types: !1622)
!1622 = !{!898, !1020, !1167, !1311, !1313}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !929, file: !14, line: 3566, baseType: !1624, size: 64, align: 64, offset: 1408)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DISubroutineType(types: !1626)
!1626 = !{!898, !1020, !905, !1313, !1167}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !929, file: !14, line: 3567, baseType: !1017, size: 64, align: 64, offset: 1472)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !929, file: !14, line: 3576, baseType: !1629, size: 64, align: 64, offset: 1536)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DISubroutineType(types: !1631)
!1631 = !{!898, !1020, !1311}
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !929, file: !14, line: 3577, baseType: !1633, size: 64, align: 64, offset: 1600)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DISubroutineType(types: !1635)
!1635 = !{!898, !1020, !1167}
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !929, file: !14, line: 3584, baseType: !1454, size: 64, align: 64, offset: 1664)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !929, file: !14, line: 3589, baseType: !1638, size: 64, align: 64, offset: 1728)
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64, align: 64)
!1639 = !DISubroutineType(types: !1640)
!1640 = !{null, !1020}
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !929, file: !14, line: 3594, baseType: !898, size: 32, align: 32, offset: 1792)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !929, file: !14, line: 3600, baseType: !932, size: 64, align: 64, offset: 1856)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !929, file: !14, line: 3609, baseType: !1644, size: 64, align: 64, offset: 1920)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1647)
!1647 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1648 = distinct !DIGlobalVariable(name: "init_once", scope: !1649, file: !927, line: 773, type: !1651, isLocal: true, isDefinition: true, variable: i32* @dolby_e_init.init_once)
!1649 = distinct !DISubprogram(name: "dolby_e_init", scope: !927, file: !927, line: 771, type: !1018, isLocal: true, isDefinition: true, scopeLine: 772, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1650)
!1650 = !{}
!1651 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_once_t", file: !1652, line: 168, baseType: !898)
!1652 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1653 = distinct !DIGlobalVariable(name: "mantissa_tab1", scope: !0, file: !1654, line: 639, type: !1655, isLocal: true, isDefinition: true, variable: [17 x [4 x float]]* @mantissa_tab1)
!1654 = !DIFile(filename: "libavcodec/dolby_e.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !924, size: 2176, align: 32, elements: !1656)
!1656 = !{!1657, !1151}
!1657 = !DISubrange(count: 17)
!1658 = distinct !DIGlobalVariable(name: "mantissa_tab2", scope: !0, file: !1654, line: 640, type: !1655, isLocal: true, isDefinition: true, variable: [17 x [4 x float]]* @mantissa_tab2)
!1659 = distinct !DIGlobalVariable(name: "mantissa_tab3", scope: !0, file: !1654, line: 641, type: !1655, isLocal: true, isDefinition: true, variable: [17 x [4 x float]]* @mantissa_tab3)
!1660 = distinct !DIGlobalVariable(name: "exponent_tab", scope: !0, file: !1654, line: 642, type: !1661, isLocal: true, isDefinition: true, variable: [50 x float]* @exponent_tab)
!1661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !924, size: 1600, align: 32, elements: !1662)
!1662 = !{!1663}
!1663 = !DISubrange(count: 50)
!1664 = distinct !DIGlobalVariable(name: "gain_tab", scope: !0, file: !1654, line: 643, type: !1665, isLocal: true, isDefinition: true, variable: [1024 x float]* @gain_tab)
