; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--sapenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--sapenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVOutputFormat = type { i8*, i8*, i8*, i8*, i32, i32, i32, i32, %struct.AVCodecTag**, %struct.AVClass*, %struct.AVOutputFormat*, i32, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*, %struct.AVPacket*, i32)*, i32 (i32, i32)*, void (%struct.AVFormatContext*, i32, i64*, i64*)*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i32 (%struct.AVFormatContext*, i32, %struct.AVFrame**, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32, i32 (%struct.AVFormatContext*)*, void (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!847 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!848 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!849 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!850 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!851 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!852 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!853 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!854 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!855 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!856 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!857 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !534, line: 538, size: 32, align: 32, elements: !858)
!858 = !{!859, !860, !861, !862, !863, !864, !865, !866}
!859 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!860 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!861 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!862 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!863 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!864 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!865 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!866 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874}
!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !920, !933, !939, !958, !976, !952, !977}
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !918, line: 40, baseType: !919)
!918 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!919 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !922, line: 153, size: 128, align: 16, elements: !923)
!922 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!923 = !{!924, !928}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !921, file: !922, line: 155, baseType: !925, size: 16, align: 16)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !926, line: 28, baseType: !927)
!926 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!927 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !921, file: !922, line: 156, baseType: !929, size: 112, align: 8, offset: 16)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 112, align: 8, elements: !931)
!930 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!931 = !{!932}
!932 = !DISubrange(count: 14)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !935, line: 222, size: 16, align: 8, elements: !936)
!935 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!936 = !{!937}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !934, file: !935, line: 222, baseType: !938, size: 16, align: 16)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !918, line: 49, baseType: !927)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !941, line: 239, size: 128, align: 32, elements: !942)
!941 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!942 = !{!943, !944, !946, !953}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !940, file: !941, line: 241, baseType: !925, size: 16, align: 16)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !940, file: !941, line: 242, baseType: !945, size: 16, align: 16, offset: 16)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !941, line: 119, baseType: !938)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !940, file: !941, line: 243, baseType: !947, size: 32, align: 32, offset: 32)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !941, line: 31, size: 32, align: 32, elements: !948)
!948 = !{!949}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !947, file: !941, line: 33, baseType: !950, size: 32, align: 32)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !941, line: 30, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !918, line: 51, baseType: !952)
!952 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !940, file: !941, line: 246, baseType: !954, size: 64, align: 8, offset: 64)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 64, align: 8, elements: !956)
!955 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!956 = !{!957}
!957 = !DISubrange(count: 8)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !941, line: 254, size: 224, align: 32, elements: !960)
!960 = !{!961, !962, !963, !964, !975}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !959, file: !941, line: 256, baseType: !925, size: 16, align: 16)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !959, file: !941, line: 257, baseType: !945, size: 16, align: 16, offset: 16)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !959, file: !941, line: 258, baseType: !951, size: 32, align: 32, offset: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !959, file: !941, line: 259, baseType: !965, size: 128, align: 8, offset: 64)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !941, line: 211, size: 128, align: 8, elements: !966)
!966 = !{!967}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !965, file: !941, line: 220, baseType: !968, size: 128, align: 8)
!968 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !965, file: !941, line: 213, size: 128, align: 8, elements: !969)
!969 = !{!970}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !968, file: !941, line: 215, baseType: !971, size: 128, align: 8)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 128, align: 8, elements: !973)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !918, line: 48, baseType: !955)
!973 = !{!974}
!974 = !DISubrange(count: 16)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !959, file: !941, line: 260, baseType: !951, size: 32, align: 32, offset: 192)
!976 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!978 = !{!979}
!979 = distinct !DIGlobalVariable(name: "ff_sap_muxer", scope: !0, file: !980, line: 271, type: !981, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_sap_muxer)
!980 = !DIFile(filename: "libavformat/sapenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !897, line: 624, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !983)
!983 = !{!984, !987, !988, !989, !990, !991, !992, !993, !994, !1004, !1045, !1047, !1048, !2149, !2150, !2151, !2155, !2159, !2163, !2164, !2169, !2170, !2171, !2172, !2173, !2174, !2178}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !982, file: !897, line: 498, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !982, file: !897, line: 504, baseType: !985, size: 64, align: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !982, file: !897, line: 505, baseType: !985, size: 64, align: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !982, file: !897, line: 506, baseType: !985, size: 64, align: 64, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !982, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !982, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !982, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !982, file: !897, line: 517, baseType: !976, size: 32, align: 32, offset: 352)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !982, file: !897, line: 523, baseType: !995, size: 64, align: 64, offset: 384)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1000, line: 44, size: 64, align: 32, elements: !1001)
!1000 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1001 = !{!1002, !1003}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !999, file: !1000, line: 45, baseType: !3, size: 32, align: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !999, file: !1000, line: 46, baseType: !952, size: 32, align: 32, offset: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !982, file: !897, line: 526, baseType: !1005, size: 64, align: 64, offset: 448)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !1009)
!1009 = !{!1010, !1011, !1015, !1019, !1020, !1021, !1022, !1026, !1032, !1034, !1038}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1008, file: !464, line: 72, baseType: !985, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1008, file: !464, line: 78, baseType: !1012, size: 64, align: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!985, !977}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1008, file: !464, line: 85, baseType: !1016, size: 64, align: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1018 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1008, file: !464, line: 93, baseType: !976, size: 32, align: 32, offset: 192)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1008, file: !464, line: 99, baseType: !976, size: 32, align: 32, offset: 224)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1008, file: !464, line: 108, baseType: !976, size: 32, align: 32, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1008, file: !464, line: 113, baseType: !1023, size: 64, align: 64, offset: 320)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!977, !977, !977}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1008, file: !464, line: 123, baseType: !1027, size: 64, align: 64, offset: 384)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!1030, !1030}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1008, file: !464, line: 130, baseType: !1033, size: 32, align: 32, offset: 448)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1008, file: !464, line: 136, baseType: !1035, size: 64, align: 64, offset: 512)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!1033, !977}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1008, file: !464, line: 142, baseType: !1039, size: 64, align: 64, offset: 576)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!976, !1042, !977, !985, !976}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !982, file: !897, line: 535, baseType: !1046, size: 64, align: 64, offset: 512)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !982, file: !897, line: 539, baseType: !976, size: 32, align: 32, offset: 576)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !982, file: !897, line: 541, baseType: !1049, size: 64, align: 64, offset: 640)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!976, !1052}
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1054)
!1054 = !{!1055, !1056, !1152, !1153, !1154, !1220, !1221, !1222, !2003, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2057, !2058, !2059, !2060, !2061, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2112, !2113, !2116, !2117, !2118, !2119, !2120, !2121, !2126, !2127, !2128, !2129, !2137, !2138, !2142, !2146, !2147, !2148}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1053, file: !897, line: 1342, baseType: !1005, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1053, file: !897, line: 1349, baseType: !1057, size: 64, align: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1059)
!1059 = !{!1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1083, !1084, !1123, !1124, !1128, !1133, !1134, !1135, !1139, !1145, !1151}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1058, file: !897, line: 638, baseType: !985, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1058, file: !897, line: 645, baseType: !985, size: 64, align: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1058, file: !897, line: 652, baseType: !976, size: 32, align: 32, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1058, file: !897, line: 659, baseType: !985, size: 64, align: 64, offset: 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1058, file: !897, line: 661, baseType: !995, size: 64, align: 64, offset: 256)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1058, file: !897, line: 663, baseType: !1005, size: 64, align: 64, offset: 320)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1058, file: !897, line: 670, baseType: !985, size: 64, align: 64, offset: 384)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1058, file: !897, line: 679, baseType: !1057, size: 64, align: 64, offset: 448)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1058, file: !897, line: 684, baseType: !976, size: 32, align: 32, offset: 512)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1058, file: !897, line: 689, baseType: !976, size: 32, align: 32, offset: 544)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1058, file: !897, line: 696, baseType: !1071, size: 64, align: 64, offset: 576)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!976, !1074}
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1076)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1077)
!1077 = !{!1078, !1079, !1081, !1082}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1076, file: !897, line: 449, baseType: !985, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1076, file: !897, line: 450, baseType: !1080, size: 64, align: 64, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1076, file: !897, line: 451, baseType: !976, size: 32, align: 32, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1076, file: !897, line: 452, baseType: !985, size: 64, align: 64, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1058, file: !897, line: 703, baseType: !1049, size: 64, align: 64, offset: 640)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1058, file: !897, line: 714, baseType: !1085, size: 64, align: 64, offset: 704)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!976, !1052, !1088}
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1091)
!1091 = !{!1092, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1119, !1120, !1121, !1122}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1090, file: !4, line: 1451, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1095, line: 94, baseType: !1096)
!1095 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1095, line: 81, size: 192, align: 64, elements: !1097)
!1097 = !{!1098, !1102, !1104}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1096, file: !1095, line: 82, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1095, line: 73, baseType: !1101)
!1101 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1095, line: 73, flags: DIFlagFwdDecl)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1096, file: !1095, line: 89, baseType: !1103, size: 64, align: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1096, file: !1095, line: 93, baseType: !976, size: 32, align: 32, offset: 128)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1090, file: !4, line: 1461, baseType: !917, size: 64, align: 64, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1090, file: !4, line: 1467, baseType: !917, size: 64, align: 64, offset: 128)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1090, file: !4, line: 1468, baseType: !1103, size: 64, align: 64, offset: 192)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1090, file: !4, line: 1469, baseType: !976, size: 32, align: 32, offset: 256)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1090, file: !4, line: 1470, baseType: !976, size: 32, align: 32, offset: 288)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1090, file: !4, line: 1474, baseType: !976, size: 32, align: 32, offset: 320)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1090, file: !4, line: 1479, baseType: !1112, size: 64, align: 64, offset: 384)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1115)
!1115 = !{!1116, !1117, !1118}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1114, file: !4, line: 1412, baseType: !1103, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1114, file: !4, line: 1413, baseType: !976, size: 32, align: 32, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1114, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1090, file: !4, line: 1480, baseType: !976, size: 32, align: 32, offset: 448)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1090, file: !4, line: 1486, baseType: !917, size: 64, align: 64, offset: 512)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1090, file: !4, line: 1488, baseType: !917, size: 64, align: 64, offset: 576)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1090, file: !4, line: 1497, baseType: !917, size: 64, align: 64, offset: 640)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1058, file: !897, line: 720, baseType: !1049, size: 64, align: 64, offset: 768)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1058, file: !897, line: 730, baseType: !1125, size: 64, align: 64, offset: 832)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!976, !1052, !976, !917, !976}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1058, file: !897, line: 737, baseType: !1129, size: 64, align: 64, offset: 896)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!917, !1052, !976, !1132, !917}
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1058, file: !897, line: 744, baseType: !1049, size: 64, align: 64, offset: 960)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1058, file: !897, line: 750, baseType: !1049, size: 64, align: 64, offset: 1024)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1058, file: !897, line: 758, baseType: !1136, size: 64, align: 64, offset: 1088)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!976, !1052, !976, !917, !917, !917, !976}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1058, file: !897, line: 764, baseType: !1140, size: 64, align: 64, offset: 1152)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!976, !1052, !1143}
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1058, file: !897, line: 770, baseType: !1146, size: 64, align: 64, offset: 1216)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!976, !1052, !1149}
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1058, file: !897, line: 776, baseType: !1146, size: 64, align: 64, offset: 1280)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1053, file: !897, line: 1356, baseType: !1046, size: 64, align: 64, offset: 128)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1053, file: !897, line: 1365, baseType: !977, size: 64, align: 64, offset: 192)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1053, file: !897, line: 1379, baseType: !1155, size: 64, align: 64, offset: 256)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !515, line: 352, baseType: !1157)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !515, line: 161, size: 2112, align: 64, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1162, !1163, !1164, !1165, !1169, !1170, !1174, !1175, !1176, !1177, !1178, !1180, !1181, !1187, !1188, !1192, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1210, !1211, !1212, !1213, !1217, !1218, !1219}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1157, file: !515, line: 174, baseType: !1005, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1157, file: !515, line: 226, baseType: !1080, size: 64, align: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1157, file: !515, line: 227, baseType: !976, size: 32, align: 32, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1157, file: !515, line: 228, baseType: !1080, size: 64, align: 64, offset: 192)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1157, file: !515, line: 229, baseType: !1080, size: 64, align: 64, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1157, file: !515, line: 233, baseType: !977, size: 64, align: 64, offset: 320)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1157, file: !515, line: 235, baseType: !1166, size: 64, align: 64, offset: 384)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!976, !977, !1103, !976}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1157, file: !515, line: 236, baseType: !1166, size: 64, align: 64, offset: 448)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1157, file: !515, line: 237, baseType: !1171, size: 64, align: 64, offset: 512)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!917, !977, !917, !976}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1157, file: !515, line: 238, baseType: !917, size: 64, align: 64, offset: 576)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1157, file: !515, line: 239, baseType: !976, size: 32, align: 32, offset: 640)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1157, file: !515, line: 240, baseType: !976, size: 32, align: 32, offset: 672)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1157, file: !515, line: 241, baseType: !976, size: 32, align: 32, offset: 704)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1157, file: !515, line: 242, baseType: !1179, size: 64, align: 64, offset: 768)
!1179 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1157, file: !515, line: 243, baseType: !1080, size: 64, align: 64, offset: 832)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1157, file: !515, line: 244, baseType: !1182, size: 64, align: 64, offset: 896)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!1179, !1179, !1185, !952}
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1157, file: !515, line: 245, baseType: !976, size: 32, align: 32, offset: 960)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1157, file: !515, line: 249, baseType: !1189, size: 64, align: 64, offset: 1024)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!976, !977, !976}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1157, file: !515, line: 255, baseType: !1193, size: 64, align: 64, offset: 1088)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!917, !977, !976, !917, !976}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1157, file: !515, line: 260, baseType: !976, size: 32, align: 32, offset: 1152)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1157, file: !515, line: 266, baseType: !917, size: 64, align: 64, offset: 1216)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1157, file: !515, line: 273, baseType: !976, size: 32, align: 32, offset: 1280)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1157, file: !515, line: 279, baseType: !917, size: 64, align: 64, offset: 1344)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1157, file: !515, line: 285, baseType: !976, size: 32, align: 32, offset: 1408)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1157, file: !515, line: 291, baseType: !976, size: 32, align: 32, offset: 1440)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1157, file: !515, line: 298, baseType: !976, size: 32, align: 32, offset: 1472)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1157, file: !515, line: 304, baseType: !976, size: 32, align: 32, offset: 1504)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1157, file: !515, line: 309, baseType: !985, size: 64, align: 64, offset: 1536)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1157, file: !515, line: 314, baseType: !985, size: 64, align: 64, offset: 1600)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1157, file: !515, line: 319, baseType: !1207, size: 64, align: 64, offset: 1664)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!976, !977, !1103, !976, !514, !917}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1157, file: !515, line: 326, baseType: !976, size: 32, align: 32, offset: 1728)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1157, file: !515, line: 331, baseType: !514, size: 32, align: 32, offset: 1760)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1157, file: !515, line: 332, baseType: !917, size: 64, align: 64, offset: 1792)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1157, file: !515, line: 338, baseType: !1214, size: 64, align: 64, offset: 1856)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!976, !977}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1157, file: !515, line: 340, baseType: !917, size: 64, align: 64, offset: 1920)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1157, file: !515, line: 346, baseType: !1080, size: 64, align: 64, offset: 1984)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1157, file: !515, line: 351, baseType: !976, size: 32, align: 32, offset: 2048)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1053, file: !897, line: 1386, baseType: !976, size: 32, align: 32, offset: 320)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1053, file: !897, line: 1393, baseType: !952, size: 32, align: 32, offset: 352)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1053, file: !897, line: 1405, baseType: !1223, size: 64, align: 64, offset: 384)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1227)
!1227 = !{!1228, !1229, !1230, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1788, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1889, !1895, !1896, !1900, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1932, !1933, !1934, !1935, !1936, !1937}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1226, file: !897, line: 866, baseType: !976, size: 32, align: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1226, file: !897, line: 872, baseType: !976, size: 32, align: 32, offset: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1226, file: !897, line: 878, baseType: !1231, size: 64, align: 64, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1233)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1234)
!1234 = !{!1235, !1236, !1237, !1238, !1463, !1464, !1465, !1466, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1492, !1496, !1497, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1676, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1233, file: !4, line: 1561, baseType: !1005, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1233, file: !4, line: 1562, baseType: !976, size: 32, align: 32, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1233, file: !4, line: 1564, baseType: !523, size: 32, align: 32, offset: 96)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1233, file: !4, line: 1565, baseType: !1239, size: 64, align: 64, offset: 128)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1241)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1242)
!1242 = !{!1243, !1244, !1245, !1246, !1247, !1248, !1257, !1260, !1263, !1266, !1270, !1271, !1272, !1280, !1281, !1282, !1284, !1288, !1294, !1299, !1303, !1304, !1347, !1434, !1438, !1439, !1443, !1447, !1452, !1456, !1457, !1458}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1241, file: !4, line: 3475, baseType: !985, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1241, file: !4, line: 3480, baseType: !985, size: 64, align: 64, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1241, file: !4, line: 3481, baseType: !523, size: 32, align: 32, offset: 128)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1241, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1241, file: !4, line: 3487, baseType: !976, size: 32, align: 32, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1241, file: !4, line: 3488, baseType: !1249, size: 64, align: 64, offset: 256)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1251)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1252, line: 61, baseType: !1253)
!1252 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1252, line: 58, size: 64, align: 32, elements: !1254)
!1254 = !{!1255, !1256}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1253, file: !1252, line: 59, baseType: !976, size: 32, align: 32)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1253, file: !1252, line: 60, baseType: !976, size: 32, align: 32, offset: 32)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1241, file: !4, line: 3489, baseType: !1258, size: 64, align: 64, offset: 320)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !533)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1241, file: !4, line: 3490, baseType: !1261, size: 64, align: 64, offset: 384)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1241, file: !4, line: 3491, baseType: !1264, size: 64, align: 64, offset: 448)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !733)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1241, file: !4, line: 3492, baseType: !1267, size: 64, align: 64, offset: 512)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1269)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !918, line: 55, baseType: !1179)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1241, file: !4, line: 3493, baseType: !972, size: 8, align: 8, offset: 576)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1241, file: !4, line: 3494, baseType: !1005, size: 64, align: 64, offset: 640)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1241, file: !4, line: 3495, baseType: !1273, size: 64, align: 64, offset: 704)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1275)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1276)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1277)
!1277 = !{!1278, !1279}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1276, file: !4, line: 3402, baseType: !976, size: 32, align: 32)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1276, file: !4, line: 3403, baseType: !985, size: 64, align: 64, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1241, file: !4, line: 3507, baseType: !985, size: 64, align: 64, offset: 768)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1241, file: !4, line: 3516, baseType: !976, size: 32, align: 32, offset: 832)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1241, file: !4, line: 3517, baseType: !1283, size: 64, align: 64, offset: 896)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1241, file: !4, line: 3527, baseType: !1285, size: 64, align: 64, offset: 960)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!976, !1231}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1241, file: !4, line: 3535, baseType: !1289, size: 64, align: 64, offset: 1024)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!976, !1231, !1292}
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1232)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1241, file: !4, line: 3541, baseType: !1295, size: 64, align: 64, offset: 1088)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1297)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1298)
!1298 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1241, file: !4, line: 3549, baseType: !1300, size: 64, align: 64, offset: 1152)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{null, !1283}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1241, file: !4, line: 3551, baseType: !1285, size: 64, align: 64, offset: 1216)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1241, file: !4, line: 3552, baseType: !1305, size: 64, align: 64, offset: 1280)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DISubroutineType(types: !1307)
!1307 = !{!976, !1231, !1103, !976, !1308}
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1311)
!1311 = !{!1312, !1313, !1314, !1315, !1316, !1346}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1310, file: !4, line: 3921, baseType: !938, size: 16, align: 16)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1310, file: !4, line: 3922, baseType: !951, size: 32, align: 32, offset: 32)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1310, file: !4, line: 3923, baseType: !951, size: 32, align: 32, offset: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1310, file: !4, line: 3924, baseType: !952, size: 32, align: 32, offset: 96)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1310, file: !4, line: 3925, baseType: !1317, size: 64, align: 64, offset: 128)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1320)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1321)
!1321 = !{!1322, !1323, !1324, !1325, !1326, !1327, !1335, !1339, !1341, !1342, !1344, !1345}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1320, file: !4, line: 3886, baseType: !976, size: 32, align: 32)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1320, file: !4, line: 3887, baseType: !976, size: 32, align: 32, offset: 32)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1320, file: !4, line: 3888, baseType: !976, size: 32, align: 32, offset: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1320, file: !4, line: 3889, baseType: !976, size: 32, align: 32, offset: 96)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1320, file: !4, line: 3890, baseType: !976, size: 32, align: 32, offset: 128)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1320, file: !4, line: 3897, baseType: !1328, size: 768, align: 64, offset: 192)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1329)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1330)
!1330 = !{!1331, !1333}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1329, file: !4, line: 3855, baseType: !1332, size: 512, align: 64)
!1332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1103, size: 512, align: 64, elements: !956)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1329, file: !4, line: 3857, baseType: !1334, size: 256, align: 32, offset: 512)
!1334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !976, size: 256, align: 32, elements: !956)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1320, file: !4, line: 3903, baseType: !1336, size: 256, align: 64, offset: 960)
!1336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1103, size: 256, align: 64, elements: !1337)
!1337 = !{!1338}
!1338 = !DISubrange(count: 4)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1320, file: !4, line: 3904, baseType: !1340, size: 128, align: 32, offset: 1216)
!1340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !976, size: 128, align: 32, elements: !1337)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1320, file: !4, line: 3906, baseType: !750, size: 32, align: 32, offset: 1344)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1320, file: !4, line: 3908, baseType: !1343, size: 64, align: 64, offset: 1408)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1320, file: !4, line: 3915, baseType: !1343, size: 64, align: 64, offset: 1472)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1320, file: !4, line: 3917, baseType: !976, size: 32, align: 32, offset: 1536)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1310, file: !4, line: 3926, baseType: !917, size: 64, align: 64, offset: 192)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1241, file: !4, line: 3564, baseType: !1348, size: 64, align: 64, offset: 1344)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DISubroutineType(types: !1350)
!1350 = !{!976, !1231, !1088, !1351, !1433}
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1353)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !767, line: 646, baseType: !1354)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !767, line: 268, size: 4288, align: 64, elements: !1355)
!1355 = !{!1356, !1357, !1358, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1385, !1387, !1388, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1421, !1422, !1423, !1424, !1425, !1426, !1429, !1430, !1431, !1432}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1354, file: !767, line: 282, baseType: !1332, size: 512, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1354, file: !767, line: 299, baseType: !1334, size: 256, align: 32, offset: 512)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1354, file: !767, line: 315, baseType: !1359, size: 64, align: 64, offset: 768)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1354, file: !767, line: 326, baseType: !976, size: 32, align: 32, offset: 832)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1354, file: !767, line: 326, baseType: !976, size: 32, align: 32, offset: 864)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1354, file: !767, line: 334, baseType: !976, size: 32, align: 32, offset: 896)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1354, file: !767, line: 341, baseType: !976, size: 32, align: 32, offset: 928)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1354, file: !767, line: 346, baseType: !976, size: 32, align: 32, offset: 960)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1354, file: !767, line: 351, baseType: !756, size: 32, align: 32, offset: 992)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1354, file: !767, line: 356, baseType: !1251, size: 64, align: 32, offset: 1024)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1354, file: !767, line: 361, baseType: !917, size: 64, align: 64, offset: 1088)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1354, file: !767, line: 369, baseType: !917, size: 64, align: 64, offset: 1152)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1354, file: !767, line: 377, baseType: !917, size: 64, align: 64, offset: 1216)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1354, file: !767, line: 382, baseType: !976, size: 32, align: 32, offset: 1280)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1354, file: !767, line: 386, baseType: !976, size: 32, align: 32, offset: 1312)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1354, file: !767, line: 391, baseType: !976, size: 32, align: 32, offset: 1344)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1354, file: !767, line: 396, baseType: !977, size: 64, align: 64, offset: 1408)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1354, file: !767, line: 403, baseType: !1375, size: 512, align: 64, offset: 1472)
!1375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1269, size: 512, align: 64, elements: !956)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1354, file: !767, line: 410, baseType: !976, size: 32, align: 32, offset: 1984)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1354, file: !767, line: 415, baseType: !976, size: 32, align: 32, offset: 2016)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1354, file: !767, line: 420, baseType: !976, size: 32, align: 32, offset: 2048)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1354, file: !767, line: 425, baseType: !976, size: 32, align: 32, offset: 2080)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1354, file: !767, line: 435, baseType: !917, size: 64, align: 64, offset: 2112)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1354, file: !767, line: 440, baseType: !976, size: 32, align: 32, offset: 2176)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1354, file: !767, line: 445, baseType: !1269, size: 64, align: 64, offset: 2240)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1354, file: !767, line: 459, baseType: !1384, size: 512, align: 64, offset: 2304)
!1384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1093, size: 512, align: 64, elements: !956)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1354, file: !767, line: 473, baseType: !1386, size: 64, align: 64, offset: 2816)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1354, file: !767, line: 477, baseType: !976, size: 32, align: 32, offset: 2880)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1354, file: !767, line: 479, baseType: !1389, size: 64, align: 64, offset: 2944)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !767, line: 207, baseType: !1392)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !767, line: 201, size: 320, align: 64, elements: !1393)
!1393 = !{!1394, !1395, !1396, !1397, !1402}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1392, file: !767, line: 202, baseType: !766, size: 32, align: 32)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1392, file: !767, line: 203, baseType: !1103, size: 64, align: 64, offset: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1392, file: !767, line: 204, baseType: !976, size: 32, align: 32, offset: 128)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1392, file: !767, line: 205, baseType: !1398, size: 64, align: 64, offset: 192)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1400, line: 86, baseType: !1401)
!1400 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1401 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1400, line: 86, flags: DIFlagFwdDecl)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1392, file: !767, line: 206, baseType: !1093, size: 64, align: 64, offset: 256)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1354, file: !767, line: 480, baseType: !976, size: 32, align: 32, offset: 3008)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1354, file: !767, line: 505, baseType: !976, size: 32, align: 32, offset: 3040)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1354, file: !767, line: 512, baseType: !790, size: 32, align: 32, offset: 3072)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1354, file: !767, line: 514, baseType: !796, size: 32, align: 32, offset: 3104)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1354, file: !767, line: 516, baseType: !814, size: 32, align: 32, offset: 3136)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1354, file: !767, line: 523, baseType: !838, size: 32, align: 32, offset: 3168)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1354, file: !767, line: 525, baseType: !857, size: 32, align: 32, offset: 3200)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1354, file: !767, line: 532, baseType: !917, size: 64, align: 64, offset: 3264)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1354, file: !767, line: 539, baseType: !917, size: 64, align: 64, offset: 3328)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1354, file: !767, line: 547, baseType: !917, size: 64, align: 64, offset: 3392)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1354, file: !767, line: 554, baseType: !1398, size: 64, align: 64, offset: 3456)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1354, file: !767, line: 563, baseType: !976, size: 32, align: 32, offset: 3520)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1354, file: !767, line: 572, baseType: !976, size: 32, align: 32, offset: 3552)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1354, file: !767, line: 581, baseType: !976, size: 32, align: 32, offset: 3584)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1354, file: !767, line: 588, baseType: !1418, size: 64, align: 64, offset: 3648)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !918, line: 36, baseType: !1420)
!1420 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1354, file: !767, line: 593, baseType: !976, size: 32, align: 32, offset: 3712)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1354, file: !767, line: 596, baseType: !976, size: 32, align: 32, offset: 3744)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1354, file: !767, line: 599, baseType: !1093, size: 64, align: 64, offset: 3776)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1354, file: !767, line: 605, baseType: !1093, size: 64, align: 64, offset: 3840)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1354, file: !767, line: 616, baseType: !1093, size: 64, align: 64, offset: 3904)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1354, file: !767, line: 626, baseType: !1427, size: 64, align: 64, offset: 3968)
!1427 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1428, line: 216, baseType: !1179)
!1428 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1354, file: !767, line: 627, baseType: !1427, size: 64, align: 64, offset: 4032)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1354, file: !767, line: 628, baseType: !1427, size: 64, align: 64, offset: 4096)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1354, file: !767, line: 629, baseType: !1427, size: 64, align: 64, offset: 4160)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1354, file: !767, line: 645, baseType: !1093, size: 64, align: 64, offset: 4224)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1241, file: !4, line: 3566, baseType: !1435, size: 64, align: 64, offset: 1408)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DISubroutineType(types: !1437)
!1437 = !{!976, !1231, !977, !1433, !1088}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1241, file: !4, line: 3567, baseType: !1285, size: 64, align: 64, offset: 1472)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1241, file: !4, line: 3576, baseType: !1440, size: 64, align: 64, offset: 1536)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DISubroutineType(types: !1442)
!1442 = !{!976, !1231, !1351}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1241, file: !4, line: 3577, baseType: !1444, size: 64, align: 64, offset: 1600)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DISubroutineType(types: !1446)
!1446 = !{!976, !1231, !1088}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1241, file: !4, line: 3584, baseType: !1448, size: 64, align: 64, offset: 1664)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{!976, !1231, !1451}
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1241, file: !4, line: 3589, baseType: !1453, size: 64, align: 64, offset: 1728)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DISubroutineType(types: !1455)
!1455 = !{null, !1231}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1241, file: !4, line: 3594, baseType: !976, size: 32, align: 32, offset: 1792)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1241, file: !4, line: 3600, baseType: !985, size: 64, align: 64, offset: 1856)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1241, file: !4, line: 3609, baseType: !1459, size: 64, align: 64, offset: 1920)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1462)
!1462 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1233, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1233, file: !4, line: 1581, baseType: !952, size: 32, align: 32, offset: 224)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1233, file: !4, line: 1583, baseType: !977, size: 64, align: 64, offset: 256)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1233, file: !4, line: 1591, baseType: !1467, size: 64, align: 64, offset: 320)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1233, file: !4, line: 1598, baseType: !977, size: 64, align: 64, offset: 384)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1233, file: !4, line: 1606, baseType: !917, size: 64, align: 64, offset: 448)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1233, file: !4, line: 1614, baseType: !976, size: 32, align: 32, offset: 512)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1233, file: !4, line: 1622, baseType: !976, size: 32, align: 32, offset: 544)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1233, file: !4, line: 1628, baseType: !976, size: 32, align: 32, offset: 576)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1233, file: !4, line: 1636, baseType: !976, size: 32, align: 32, offset: 608)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1233, file: !4, line: 1643, baseType: !976, size: 32, align: 32, offset: 640)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1233, file: !4, line: 1657, baseType: !1103, size: 64, align: 64, offset: 704)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1233, file: !4, line: 1658, baseType: !976, size: 32, align: 32, offset: 768)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1233, file: !4, line: 1679, baseType: !1251, size: 64, align: 32, offset: 800)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1233, file: !4, line: 1688, baseType: !976, size: 32, align: 32, offset: 864)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1233, file: !4, line: 1712, baseType: !976, size: 32, align: 32, offset: 896)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1233, file: !4, line: 1729, baseType: !976, size: 32, align: 32, offset: 928)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1233, file: !4, line: 1729, baseType: !976, size: 32, align: 32, offset: 960)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1233, file: !4, line: 1744, baseType: !976, size: 32, align: 32, offset: 992)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1233, file: !4, line: 1744, baseType: !976, size: 32, align: 32, offset: 1024)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1233, file: !4, line: 1751, baseType: !976, size: 32, align: 32, offset: 1056)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1233, file: !4, line: 1766, baseType: !533, size: 32, align: 32, offset: 1088)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1233, file: !4, line: 1791, baseType: !1488, size: 64, align: 64, offset: 1152)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{null, !1491, !1351, !1433, !976, !976, !976}
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1233, file: !4, line: 1808, baseType: !1493, size: 64, align: 64, offset: 1216)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DISubroutineType(types: !1495)
!1495 = !{!533, !1491, !1258}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1233, file: !4, line: 1816, baseType: !976, size: 32, align: 32, offset: 1280)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1233, file: !4, line: 1825, baseType: !1498, size: 32, align: 32, offset: 1312)
!1498 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1233, file: !4, line: 1830, baseType: !976, size: 32, align: 32, offset: 1344)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1233, file: !4, line: 1838, baseType: !1498, size: 32, align: 32, offset: 1376)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1233, file: !4, line: 1846, baseType: !976, size: 32, align: 32, offset: 1408)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1233, file: !4, line: 1851, baseType: !976, size: 32, align: 32, offset: 1440)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1233, file: !4, line: 1861, baseType: !1498, size: 32, align: 32, offset: 1472)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1233, file: !4, line: 1868, baseType: !1498, size: 32, align: 32, offset: 1504)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1233, file: !4, line: 1875, baseType: !1498, size: 32, align: 32, offset: 1536)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1233, file: !4, line: 1882, baseType: !1498, size: 32, align: 32, offset: 1568)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1233, file: !4, line: 1889, baseType: !1498, size: 32, align: 32, offset: 1600)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1233, file: !4, line: 1896, baseType: !1498, size: 32, align: 32, offset: 1632)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1233, file: !4, line: 1903, baseType: !1498, size: 32, align: 32, offset: 1664)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1233, file: !4, line: 1910, baseType: !976, size: 32, align: 32, offset: 1696)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1233, file: !4, line: 1915, baseType: !976, size: 32, align: 32, offset: 1728)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1233, file: !4, line: 1926, baseType: !1433, size: 64, align: 64, offset: 1792)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1233, file: !4, line: 1935, baseType: !1251, size: 64, align: 32, offset: 1856)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1233, file: !4, line: 1942, baseType: !976, size: 32, align: 32, offset: 1920)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1233, file: !4, line: 1948, baseType: !976, size: 32, align: 32, offset: 1952)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1233, file: !4, line: 1954, baseType: !976, size: 32, align: 32, offset: 1984)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1233, file: !4, line: 1960, baseType: !976, size: 32, align: 32, offset: 2016)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1233, file: !4, line: 1984, baseType: !976, size: 32, align: 32, offset: 2048)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1233, file: !4, line: 1991, baseType: !976, size: 32, align: 32, offset: 2080)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1233, file: !4, line: 1996, baseType: !976, size: 32, align: 32, offset: 2112)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1233, file: !4, line: 2004, baseType: !976, size: 32, align: 32, offset: 2144)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1233, file: !4, line: 2011, baseType: !976, size: 32, align: 32, offset: 2176)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1233, file: !4, line: 2018, baseType: !976, size: 32, align: 32, offset: 2208)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1233, file: !4, line: 2027, baseType: !976, size: 32, align: 32, offset: 2240)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1233, file: !4, line: 2034, baseType: !976, size: 32, align: 32, offset: 2272)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1233, file: !4, line: 2044, baseType: !976, size: 32, align: 32, offset: 2304)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1233, file: !4, line: 2054, baseType: !1528, size: 64, align: 64, offset: 2368)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1233, file: !4, line: 2061, baseType: !1528, size: 64, align: 64, offset: 2432)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1233, file: !4, line: 2066, baseType: !976, size: 32, align: 32, offset: 2496)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1233, file: !4, line: 2070, baseType: !976, size: 32, align: 32, offset: 2528)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1233, file: !4, line: 2078, baseType: !976, size: 32, align: 32, offset: 2560)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1233, file: !4, line: 2085, baseType: !976, size: 32, align: 32, offset: 2592)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1233, file: !4, line: 2092, baseType: !976, size: 32, align: 32, offset: 2624)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1233, file: !4, line: 2099, baseType: !976, size: 32, align: 32, offset: 2656)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1233, file: !4, line: 2106, baseType: !976, size: 32, align: 32, offset: 2688)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1233, file: !4, line: 2113, baseType: !976, size: 32, align: 32, offset: 2720)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1233, file: !4, line: 2120, baseType: !976, size: 32, align: 32, offset: 2752)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1233, file: !4, line: 2125, baseType: !976, size: 32, align: 32, offset: 2784)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1233, file: !4, line: 2133, baseType: !976, size: 32, align: 32, offset: 2816)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1233, file: !4, line: 2140, baseType: !976, size: 32, align: 32, offset: 2848)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1233, file: !4, line: 2145, baseType: !976, size: 32, align: 32, offset: 2880)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1233, file: !4, line: 2153, baseType: !976, size: 32, align: 32, offset: 2912)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1233, file: !4, line: 2158, baseType: !976, size: 32, align: 32, offset: 2944)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1233, file: !4, line: 2166, baseType: !796, size: 32, align: 32, offset: 2976)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1233, file: !4, line: 2173, baseType: !814, size: 32, align: 32, offset: 3008)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1233, file: !4, line: 2180, baseType: !838, size: 32, align: 32, offset: 3040)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1233, file: !4, line: 2187, baseType: !790, size: 32, align: 32, offset: 3072)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1233, file: !4, line: 2194, baseType: !857, size: 32, align: 32, offset: 3104)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1233, file: !4, line: 2203, baseType: !976, size: 32, align: 32, offset: 3136)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1233, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1233, file: !4, line: 2212, baseType: !976, size: 32, align: 32, offset: 3200)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1233, file: !4, line: 2213, baseType: !976, size: 32, align: 32, offset: 3232)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1233, file: !4, line: 2220, baseType: !733, size: 32, align: 32, offset: 3264)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1233, file: !4, line: 2232, baseType: !976, size: 32, align: 32, offset: 3296)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1233, file: !4, line: 2243, baseType: !976, size: 32, align: 32, offset: 3328)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1233, file: !4, line: 2249, baseType: !976, size: 32, align: 32, offset: 3360)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1233, file: !4, line: 2256, baseType: !976, size: 32, align: 32, offset: 3392)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1233, file: !4, line: 2263, baseType: !1269, size: 64, align: 64, offset: 3456)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1233, file: !4, line: 2270, baseType: !1269, size: 64, align: 64, offset: 3520)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1233, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1233, file: !4, line: 2285, baseType: !733, size: 32, align: 32, offset: 3616)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1233, file: !4, line: 2367, baseType: !1564, size: 64, align: 64, offset: 3648)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DISubroutineType(types: !1566)
!1566 = !{!976, !1491, !1451, !976}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1233, file: !4, line: 2383, baseType: !976, size: 32, align: 32, offset: 3712)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1233, file: !4, line: 2386, baseType: !1498, size: 32, align: 32, offset: 3744)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1233, file: !4, line: 2387, baseType: !1498, size: 32, align: 32, offset: 3776)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1233, file: !4, line: 2394, baseType: !976, size: 32, align: 32, offset: 3808)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1233, file: !4, line: 2401, baseType: !976, size: 32, align: 32, offset: 3840)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1233, file: !4, line: 2408, baseType: !976, size: 32, align: 32, offset: 3872)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1233, file: !4, line: 2415, baseType: !976, size: 32, align: 32, offset: 3904)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1233, file: !4, line: 2422, baseType: !976, size: 32, align: 32, offset: 3936)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1233, file: !4, line: 2423, baseType: !1576, size: 64, align: 64, offset: 3968)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1578)
!1578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1579)
!1579 = !{!1580, !1581, !1582, !1583}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1578, file: !4, line: 827, baseType: !976, size: 32, align: 32)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1578, file: !4, line: 828, baseType: !976, size: 32, align: 32, offset: 32)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1578, file: !4, line: 829, baseType: !976, size: 32, align: 32, offset: 64)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1578, file: !4, line: 830, baseType: !1498, size: 32, align: 32, offset: 96)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1233, file: !4, line: 2430, baseType: !917, size: 64, align: 64, offset: 4032)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1233, file: !4, line: 2437, baseType: !917, size: 64, align: 64, offset: 4096)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1233, file: !4, line: 2444, baseType: !1498, size: 32, align: 32, offset: 4160)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1233, file: !4, line: 2451, baseType: !1498, size: 32, align: 32, offset: 4192)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1233, file: !4, line: 2458, baseType: !976, size: 32, align: 32, offset: 4224)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1233, file: !4, line: 2469, baseType: !976, size: 32, align: 32, offset: 4256)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1233, file: !4, line: 2475, baseType: !976, size: 32, align: 32, offset: 4288)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1233, file: !4, line: 2481, baseType: !976, size: 32, align: 32, offset: 4320)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1233, file: !4, line: 2485, baseType: !976, size: 32, align: 32, offset: 4352)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1233, file: !4, line: 2489, baseType: !976, size: 32, align: 32, offset: 4384)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1233, file: !4, line: 2493, baseType: !976, size: 32, align: 32, offset: 4416)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1233, file: !4, line: 2501, baseType: !976, size: 32, align: 32, offset: 4448)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1233, file: !4, line: 2506, baseType: !976, size: 32, align: 32, offset: 4480)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1233, file: !4, line: 2510, baseType: !976, size: 32, align: 32, offset: 4512)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1233, file: !4, line: 2514, baseType: !917, size: 64, align: 64, offset: 4544)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1233, file: !4, line: 2528, baseType: !1600, size: 64, align: 64, offset: 4608)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DISubroutineType(types: !1602)
!1602 = !{null, !1491, !977, !976, !976}
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1233, file: !4, line: 2534, baseType: !976, size: 32, align: 32, offset: 4672)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1233, file: !4, line: 2545, baseType: !976, size: 32, align: 32, offset: 4704)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1233, file: !4, line: 2547, baseType: !976, size: 32, align: 32, offset: 4736)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1233, file: !4, line: 2549, baseType: !976, size: 32, align: 32, offset: 4768)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1233, file: !4, line: 2551, baseType: !976, size: 32, align: 32, offset: 4800)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1233, file: !4, line: 2553, baseType: !976, size: 32, align: 32, offset: 4832)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1233, file: !4, line: 2555, baseType: !976, size: 32, align: 32, offset: 4864)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1233, file: !4, line: 2557, baseType: !976, size: 32, align: 32, offset: 4896)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1233, file: !4, line: 2559, baseType: !976, size: 32, align: 32, offset: 4928)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1233, file: !4, line: 2563, baseType: !976, size: 32, align: 32, offset: 4960)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1233, file: !4, line: 2571, baseType: !1343, size: 64, align: 64, offset: 4992)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1233, file: !4, line: 2579, baseType: !1343, size: 64, align: 64, offset: 5056)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1233, file: !4, line: 2586, baseType: !976, size: 32, align: 32, offset: 5120)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1233, file: !4, line: 2615, baseType: !976, size: 32, align: 32, offset: 5152)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1233, file: !4, line: 2627, baseType: !976, size: 32, align: 32, offset: 5184)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1233, file: !4, line: 2637, baseType: !976, size: 32, align: 32, offset: 5216)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1233, file: !4, line: 2681, baseType: !976, size: 32, align: 32, offset: 5248)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1233, file: !4, line: 2709, baseType: !917, size: 64, align: 64, offset: 5312)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1233, file: !4, line: 2716, baseType: !1622, size: 64, align: 64, offset: 5376)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1624)
!1624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1625)
!1625 = !{!1626, !1627, !1628, !1629, !1630, !1631, !1632, !1636, !1640, !1641, !1642, !1643, !1649, !1650, !1651, !1652, !1653}
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1624, file: !4, line: 3642, baseType: !985, size: 64, align: 64)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1624, file: !4, line: 3649, baseType: !523, size: 32, align: 32, offset: 64)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1624, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1624, file: !4, line: 3663, baseType: !533, size: 32, align: 32, offset: 128)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1624, file: !4, line: 3669, baseType: !976, size: 32, align: 32, offset: 160)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1624, file: !4, line: 3682, baseType: !1448, size: 64, align: 64, offset: 192)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1624, file: !4, line: 3698, baseType: !1633, size: 64, align: 64, offset: 256)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DISubroutineType(types: !1635)
!1635 = !{!976, !1231, !1185, !951}
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1624, file: !4, line: 3712, baseType: !1637, size: 64, align: 64, offset: 320)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DISubroutineType(types: !1639)
!1639 = !{!976, !1231, !976, !1185, !951}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1624, file: !4, line: 3726, baseType: !1633, size: 64, align: 64, offset: 384)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1624, file: !4, line: 3737, baseType: !1285, size: 64, align: 64, offset: 448)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1624, file: !4, line: 3746, baseType: !976, size: 32, align: 32, offset: 512)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1624, file: !4, line: 3757, baseType: !1644, size: 64, align: 64, offset: 576)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DISubroutineType(types: !1646)
!1646 = !{null, !1647}
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1624, file: !4, line: 3766, baseType: !1285, size: 64, align: 64, offset: 640)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1624, file: !4, line: 3774, baseType: !1285, size: 64, align: 64, offset: 704)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1624, file: !4, line: 3780, baseType: !976, size: 32, align: 32, offset: 768)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1624, file: !4, line: 3785, baseType: !976, size: 32, align: 32, offset: 800)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1624, file: !4, line: 3795, baseType: !1654, size: 64, align: 64, offset: 832)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DISubroutineType(types: !1656)
!1656 = !{!976, !1231, !1093}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1233, file: !4, line: 2728, baseType: !977, size: 64, align: 64, offset: 5440)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1233, file: !4, line: 2735, baseType: !1375, size: 512, align: 64, offset: 5504)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1233, file: !4, line: 2742, baseType: !976, size: 32, align: 32, offset: 6016)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1233, file: !4, line: 2755, baseType: !976, size: 32, align: 32, offset: 6048)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1233, file: !4, line: 2776, baseType: !976, size: 32, align: 32, offset: 6080)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1233, file: !4, line: 2783, baseType: !976, size: 32, align: 32, offset: 6112)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1233, file: !4, line: 2791, baseType: !976, size: 32, align: 32, offset: 6144)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1233, file: !4, line: 2802, baseType: !1451, size: 64, align: 64, offset: 6208)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1233, file: !4, line: 2811, baseType: !976, size: 32, align: 32, offset: 6272)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1233, file: !4, line: 2821, baseType: !976, size: 32, align: 32, offset: 6304)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1233, file: !4, line: 2830, baseType: !976, size: 32, align: 32, offset: 6336)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1233, file: !4, line: 2840, baseType: !976, size: 32, align: 32, offset: 6368)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1233, file: !4, line: 2851, baseType: !1670, size: 64, align: 64, offset: 6400)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{!976, !1491, !1673, !977, !1433, !976, !976}
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64, align: 64)
!1674 = !DISubroutineType(types: !1675)
!1675 = !{!976, !1491, !977}
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1233, file: !4, line: 2871, baseType: !1677, size: 64, align: 64, offset: 6464)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64, align: 64)
!1678 = !DISubroutineType(types: !1679)
!1679 = !{!976, !1491, !1680, !977, !1433, !976}
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{!976, !1491, !977, !976, !976}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1233, file: !4, line: 2878, baseType: !976, size: 32, align: 32, offset: 6528)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1233, file: !4, line: 2885, baseType: !976, size: 32, align: 32, offset: 6560)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1233, file: !4, line: 3005, baseType: !976, size: 32, align: 32, offset: 6592)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1233, file: !4, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1233, file: !4, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1233, file: !4, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
