; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--rtpdec_mpeg4.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--rtpdec_mpeg4.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RTPDynamicProtocolHandler = type { i8*, i32, i32, i32, i32, i32, i32 (%struct.AVFormatContext*, i32, %struct.PayloadContext*)*, i32 (%struct.AVFormatContext*, i32, %struct.PayloadContext*, i8*)*, void (%struct.PayloadContext*)*, i32 (%struct.AVFormatContext*, %struct.PayloadContext*, %struct.AVStream*, %struct.AVPacket*, i32*, i8*, i32, i16, i32)*, i32 (%struct.PayloadContext*)*, %struct.RTPDynamicProtocolHandler* }

!878 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!879 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!880 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!881 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!882 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!883 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892, !893, !894, !895}
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!887 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!888 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!889 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!894 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!895 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !897)
!897 = !{!898, !899, !900, !901, !902, !903, !904}
!898 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!899 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!900 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!901 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!902 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!903 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!904 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !14, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !474, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !918, !919, !920, !922, !923, !932, !938}
!917 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!918 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!921 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!925 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !926, line: 222, size: 16, align: 8, elements: !927)
!926 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!927 = !{!928}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !925, file: !926, line: 222, baseType: !929, size: 16, align: 16)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !930, line: 49, baseType: !931)
!930 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!931 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !926, line: 221, size: 32, align: 8, elements: !935)
!935 = !{!936}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !934, file: !926, line: 221, baseType: !937, size: 32, align: 32)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !930, line: 51, baseType: !918)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !930, line: 48, baseType: !939)
!939 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!940 = !{!941, !2219, !2220}
!941 = distinct !DIGlobalVariable(name: "ff_mp4v_es_dynamic_handler", scope: !0, file: !942, line: 328, type: !943, isLocal: false, isDefinition: true, variable: %struct.RTPDynamicProtocolHandler* @ff_mp4v_es_dynamic_handler)
!942 = !DIFile(filename: "libavformat/rtpdec_mpeg4.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "RTPDynamicProtocolHandler", file: !945, line: 33, baseType: !946)
!945 = !DIFile(filename: "libavformat/rtpdec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RTPDynamicProtocolHandler", file: !945, line: 115, size: 640, align: 64, elements: !947)
!947 = !{!948, !951, !952, !953, !954, !955, !956, !2199, !2203, !2207, !2213, !2217}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "enc_name", scope: !946, file: !945, line: 116, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !946, file: !945, line: 117, baseType: !3, size: 32, align: 32, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !946, file: !945, line: 118, baseType: !13, size: 32, align: 32, offset: 96)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "need_parsing", scope: !946, file: !945, line: 119, baseType: !473, size: 32, align: 32, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "static_payload_id", scope: !946, file: !945, line: 120, baseType: !917, size: 32, align: 32, offset: 160)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !946, file: !945, line: 123, baseType: !917, size: 32, align: 32, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !946, file: !945, line: 126, baseType: !957, size: 64, align: 64, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!917, !960, !917, !2165}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !474, line: 1947, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !474, line: 1337, size: 11968, align: 64, elements: !963)
!963 = !{!964, !1006, !1117, !1265, !1266, !1331, !1332, !1333, !2022, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2076, !2077, !2078, !2079, !2080, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2131, !2132, !2135, !2136, !2137, !2138, !2139, !2140, !2142, !2143, !2144, !2145, !2153, !2154, !2158, !2162, !2163, !2164}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !962, file: !474, line: 1342, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !483, line: 143, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !483, line: 67, size: 640, align: 64, elements: !969)
!969 = !{!970, !971, !976, !980, !981, !982, !983, !987, !993, !995, !999}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !968, file: !483, line: 72, baseType: !949, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !968, file: !483, line: 78, baseType: !972, size: 64, align: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!949, !975}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !968, file: !483, line: 85, baseType: !977, size: 64, align: 64, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!979 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !483, line: 85, flags: DIFlagFwdDecl)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !968, file: !483, line: 93, baseType: !917, size: 32, align: 32, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !968, file: !483, line: 99, baseType: !917, size: 32, align: 32, offset: 224)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !968, file: !483, line: 108, baseType: !917, size: 32, align: 32, offset: 256)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !968, file: !483, line: 113, baseType: !984, size: 64, align: 64, offset: 320)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!975, !975, !975}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !968, file: !483, line: 123, baseType: !988, size: 64, align: 64, offset: 384)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!991, !991}
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !968, file: !483, line: 130, baseType: !994, size: 32, align: 32, offset: 448)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !483, line: 48, baseType: !482)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !968, file: !483, line: 136, baseType: !996, size: 64, align: 64, offset: 512)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!994, !975}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !968, file: !483, line: 142, baseType: !1000, size: 64, align: 64, offset: 576)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!917, !1003, !975, !949, !917}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !483, line: 60, flags: DIFlagFwdDecl)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !962, file: !474, line: 1349, baseType: !1007, size: 64, align: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !474, line: 633, size: 1344, align: 64, elements: !1009)
!1009 = !{!1010, !1011, !1012, !1013, !1014, !1024, !1025, !1026, !1027, !1028, !1029, !1042, !1047, !1088, !1089, !1093, !1098, !1099, !1100, !1104, !1110, !1116}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1008, file: !474, line: 638, baseType: !949, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1008, file: !474, line: 645, baseType: !949, size: 64, align: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1008, file: !474, line: 652, baseType: !917, size: 32, align: 32, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1008, file: !474, line: 659, baseType: !949, size: 64, align: 64, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1008, file: !474, line: 661, baseType: !1015, size: 64, align: 64, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1017)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1020, line: 44, size: 64, align: 32, elements: !1021)
!1020 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1021 = !{!1022, !1023}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1019, file: !1020, line: 45, baseType: !13, size: 32, align: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1019, file: !1020, line: 46, baseType: !918, size: 32, align: 32, offset: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1008, file: !474, line: 663, baseType: !965, size: 64, align: 64, offset: 320)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1008, file: !474, line: 670, baseType: !949, size: 64, align: 64, offset: 384)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1008, file: !474, line: 679, baseType: !1007, size: 64, align: 64, offset: 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1008, file: !474, line: 684, baseType: !917, size: 32, align: 32, offset: 512)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1008, file: !474, line: 689, baseType: !917, size: 32, align: 32, offset: 544)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1008, file: !474, line: 696, baseType: !1030, size: 64, align: 64, offset: 576)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!917, !1033}
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !474, line: 453, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !474, line: 448, size: 256, align: 64, elements: !1036)
!1036 = !{!1037, !1038, !1040, !1041}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1035, file: !474, line: 449, baseType: !949, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1035, file: !474, line: 450, baseType: !1039, size: 64, align: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1035, file: !474, line: 451, baseType: !917, size: 32, align: 32, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1035, file: !474, line: 452, baseType: !949, size: 64, align: 64, offset: 192)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1008, file: !474, line: 703, baseType: !1043, size: 64, align: 64, offset: 640)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!917, !1046}
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1008, file: !474, line: 714, baseType: !1048, size: 64, align: 64, offset: 704)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!917, !1046, !1051}
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1054)
!1054 = !{!1055, !1068, !1071, !1072, !1073, !1074, !1075, !1076, !1084, !1085, !1086, !1087}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1053, file: !14, line: 1451, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1058, line: 94, baseType: !1059)
!1058 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1058, line: 81, size: 192, align: 64, elements: !1060)
!1060 = !{!1061, !1065, !1067}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1059, file: !1058, line: 82, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1058, line: 73, baseType: !1064)
!1064 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1058, line: 73, flags: DIFlagFwdDecl)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1059, file: !1058, line: 89, baseType: !1066, size: 64, align: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1059, file: !1058, line: 93, baseType: !917, size: 32, align: 32, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1053, file: !14, line: 1461, baseType: !1069, size: 64, align: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !930, line: 40, baseType: !1070)
!1070 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1053, file: !14, line: 1467, baseType: !1069, size: 64, align: 64, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1053, file: !14, line: 1468, baseType: !1066, size: 64, align: 64, offset: 192)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1053, file: !14, line: 1469, baseType: !917, size: 32, align: 32, offset: 256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1053, file: !14, line: 1470, baseType: !917, size: 32, align: 32, offset: 288)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1053, file: !14, line: 1474, baseType: !917, size: 32, align: 32, offset: 320)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1053, file: !14, line: 1479, baseType: !1077, size: 64, align: 64, offset: 384)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1080)
!1080 = !{!1081, !1082, !1083}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1079, file: !14, line: 1412, baseType: !1066, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1079, file: !14, line: 1413, baseType: !917, size: 32, align: 32, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1079, file: !14, line: 1414, baseType: !503, size: 32, align: 32, offset: 96)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1053, file: !14, line: 1480, baseType: !917, size: 32, align: 32, offset: 448)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1053, file: !14, line: 1486, baseType: !1069, size: 64, align: 64, offset: 512)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1053, file: !14, line: 1488, baseType: !1069, size: 64, align: 64, offset: 576)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1053, file: !14, line: 1497, baseType: !1069, size: 64, align: 64, offset: 640)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1008, file: !474, line: 720, baseType: !1043, size: 64, align: 64, offset: 768)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1008, file: !474, line: 730, baseType: !1090, size: 64, align: 64, offset: 832)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!917, !1046, !917, !1069, !917}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1008, file: !474, line: 737, baseType: !1094, size: 64, align: 64, offset: 896)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!1069, !1046, !917, !1097, !1069}
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1008, file: !474, line: 744, baseType: !1043, size: 64, align: 64, offset: 960)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1008, file: !474, line: 750, baseType: !1043, size: 64, align: 64, offset: 1024)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1008, file: !474, line: 758, baseType: !1101, size: 64, align: 64, offset: 1088)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!917, !1046, !917, !1069, !1069, !1069, !917}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1008, file: !474, line: 764, baseType: !1105, size: 64, align: 64, offset: 1152)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!917, !1046, !1108}
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !474, line: 328, flags: DIFlagFwdDecl)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1008, file: !474, line: 770, baseType: !1111, size: 64, align: 64, offset: 1216)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!917, !1046, !1114}
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !474, line: 329, flags: DIFlagFwdDecl)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1008, file: !474, line: 776, baseType: !1111, size: 64, align: 64, offset: 1280)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !962, file: !474, line: 1356, baseType: !1118, size: 64, align: 64, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !474, line: 497, size: 1600, align: 64, elements: !1120)
!1120 = !{!1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1140, !1144, !1148, !1155, !1250, !1251, !1252, !1253, !1254, !1255, !1259}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1119, file: !474, line: 498, baseType: !949, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1119, file: !474, line: 504, baseType: !949, size: 64, align: 64, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1119, file: !474, line: 505, baseType: !949, size: 64, align: 64, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1119, file: !474, line: 506, baseType: !949, size: 64, align: 64, offset: 192)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1119, file: !474, line: 508, baseType: !13, size: 32, align: 32, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1119, file: !474, line: 509, baseType: !13, size: 32, align: 32, offset: 288)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1119, file: !474, line: 510, baseType: !13, size: 32, align: 32, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1119, file: !474, line: 517, baseType: !917, size: 32, align: 32, offset: 352)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1119, file: !474, line: 523, baseType: !1015, size: 64, align: 64, offset: 384)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1119, file: !474, line: 526, baseType: !965, size: 64, align: 64, offset: 448)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1119, file: !474, line: 535, baseType: !1118, size: 64, align: 64, offset: 512)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1119, file: !474, line: 539, baseType: !917, size: 32, align: 32, offset: 576)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1119, file: !474, line: 541, baseType: !1043, size: 64, align: 64, offset: 640)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1119, file: !474, line: 549, baseType: !1048, size: 64, align: 64, offset: 704)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1119, file: !474, line: 550, baseType: !1043, size: 64, align: 64, offset: 768)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1119, file: !474, line: 554, baseType: !1137, size: 64, align: 64, offset: 832)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!917, !1046, !1051, !1051, !917}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1119, file: !474, line: 563, baseType: !1141, size: 64, align: 64, offset: 896)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!917, !13, !917}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1119, file: !474, line: 565, baseType: !1145, size: 64, align: 64, offset: 960)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{null, !1046, !917, !1097, !1097}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1119, file: !474, line: 570, baseType: !1149, size: 64, align: 64, offset: 1024)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!917, !1046, !917, !975, !1152}
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1153, line: 216, baseType: !1154)
!1153 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1154 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1119, file: !474, line: 581, baseType: !1156, size: 64, align: 64, offset: 1088)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!917, !1046, !917, !1159, !918}
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !544, line: 646, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !544, line: 268, size: 4288, align: 64, elements: !1163)
!1163 = !{!1164, !1168, !1170, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1204, !1206, !1207, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1162, file: !544, line: 282, baseType: !1165, size: 512, align: 64)
!1165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1066, size: 512, align: 64, elements: !1166)
!1166 = !{!1167}
!1167 = !DISubrange(count: 8)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1162, file: !544, line: 299, baseType: !1169, size: 256, align: 32, offset: 512)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 256, align: 32, elements: !1166)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1162, file: !544, line: 315, baseType: !1171, size: 64, align: 64, offset: 768)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1162, file: !544, line: 326, baseType: !917, size: 32, align: 32, offset: 832)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1162, file: !544, line: 326, baseType: !917, size: 32, align: 32, offset: 864)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1162, file: !544, line: 334, baseType: !917, size: 32, align: 32, offset: 896)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1162, file: !544, line: 341, baseType: !917, size: 32, align: 32, offset: 928)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1162, file: !544, line: 346, baseType: !917, size: 32, align: 32, offset: 960)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1162, file: !544, line: 351, baseType: !533, size: 32, align: 32, offset: 992)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1162, file: !544, line: 356, baseType: !1179, size: 64, align: 32, offset: 1024)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1180, line: 61, baseType: !1181)
!1180 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1180, line: 58, size: 64, align: 32, elements: !1182)
!1182 = !{!1183, !1184}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1181, file: !1180, line: 59, baseType: !917, size: 32, align: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1181, file: !1180, line: 60, baseType: !917, size: 32, align: 32, offset: 32)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1162, file: !544, line: 361, baseType: !1069, size: 64, align: 64, offset: 1088)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1162, file: !544, line: 369, baseType: !1069, size: 64, align: 64, offset: 1152)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1162, file: !544, line: 377, baseType: !1069, size: 64, align: 64, offset: 1216)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1162, file: !544, line: 382, baseType: !917, size: 32, align: 32, offset: 1280)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1162, file: !544, line: 386, baseType: !917, size: 32, align: 32, offset: 1312)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1162, file: !544, line: 391, baseType: !917, size: 32, align: 32, offset: 1344)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1162, file: !544, line: 396, baseType: !975, size: 64, align: 64, offset: 1408)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1162, file: !544, line: 403, baseType: !1193, size: 512, align: 64, offset: 1472)
!1193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1194, size: 512, align: 64, elements: !1166)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !930, line: 55, baseType: !1154)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1162, file: !544, line: 410, baseType: !917, size: 32, align: 32, offset: 1984)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1162, file: !544, line: 415, baseType: !917, size: 32, align: 32, offset: 2016)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1162, file: !544, line: 420, baseType: !917, size: 32, align: 32, offset: 2048)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1162, file: !544, line: 425, baseType: !917, size: 32, align: 32, offset: 2080)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1162, file: !544, line: 435, baseType: !1069, size: 64, align: 64, offset: 2112)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1162, file: !544, line: 440, baseType: !917, size: 32, align: 32, offset: 2176)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1162, file: !544, line: 445, baseType: !1194, size: 64, align: 64, offset: 2240)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1162, file: !544, line: 459, baseType: !1203, size: 512, align: 64, offset: 2304)
!1203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1056, size: 512, align: 64, elements: !1166)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1162, file: !544, line: 473, baseType: !1205, size: 64, align: 64, offset: 2816)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1162, file: !544, line: 477, baseType: !917, size: 32, align: 32, offset: 2880)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1162, file: !544, line: 479, baseType: !1208, size: 64, align: 64, offset: 2944)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !544, line: 207, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !544, line: 201, size: 320, align: 64, elements: !1212)
!1212 = !{!1213, !1214, !1215, !1216, !1221}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1211, file: !544, line: 202, baseType: !543, size: 32, align: 32)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1211, file: !544, line: 203, baseType: !1066, size: 64, align: 64, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1211, file: !544, line: 204, baseType: !917, size: 32, align: 32, offset: 128)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1211, file: !544, line: 205, baseType: !1217, size: 64, align: 64, offset: 192)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1219, line: 86, baseType: !1220)
!1219 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1220 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1219, line: 86, flags: DIFlagFwdDecl)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1211, file: !544, line: 206, baseType: !1056, size: 64, align: 64, offset: 256)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1162, file: !544, line: 480, baseType: !917, size: 32, align: 32, offset: 3008)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1162, file: !544, line: 505, baseType: !917, size: 32, align: 32, offset: 3040)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1162, file: !544, line: 512, baseType: !567, size: 32, align: 32, offset: 3072)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1162, file: !544, line: 514, baseType: !574, size: 32, align: 32, offset: 3104)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1162, file: !544, line: 516, baseType: !592, size: 32, align: 32, offset: 3136)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1162, file: !544, line: 523, baseType: !616, size: 32, align: 32, offset: 3168)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1162, file: !544, line: 525, baseType: !635, size: 32, align: 32, offset: 3200)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1162, file: !544, line: 532, baseType: !1069, size: 64, align: 64, offset: 3264)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1162, file: !544, line: 539, baseType: !1069, size: 64, align: 64, offset: 3328)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1162, file: !544, line: 547, baseType: !1069, size: 64, align: 64, offset: 3392)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1162, file: !544, line: 554, baseType: !1217, size: 64, align: 64, offset: 3456)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1162, file: !544, line: 563, baseType: !917, size: 32, align: 32, offset: 3520)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1162, file: !544, line: 572, baseType: !917, size: 32, align: 32, offset: 3552)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1162, file: !544, line: 581, baseType: !917, size: 32, align: 32, offset: 3584)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1162, file: !544, line: 588, baseType: !1237, size: 64, align: 64, offset: 3648)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !930, line: 36, baseType: !1239)
!1239 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1162, file: !544, line: 593, baseType: !917, size: 32, align: 32, offset: 3712)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1162, file: !544, line: 596, baseType: !917, size: 32, align: 32, offset: 3744)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1162, file: !544, line: 599, baseType: !1056, size: 64, align: 64, offset: 3776)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1162, file: !544, line: 605, baseType: !1056, size: 64, align: 64, offset: 3840)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1162, file: !544, line: 616, baseType: !1056, size: 64, align: 64, offset: 3904)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1162, file: !544, line: 626, baseType: !1152, size: 64, align: 64, offset: 3968)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1162, file: !544, line: 627, baseType: !1152, size: 64, align: 64, offset: 4032)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1162, file: !544, line: 628, baseType: !1152, size: 64, align: 64, offset: 4096)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1162, file: !544, line: 629, baseType: !1152, size: 64, align: 64, offset: 4160)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1162, file: !544, line: 645, baseType: !1056, size: 64, align: 64, offset: 4224)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1119, file: !474, line: 587, baseType: !1105, size: 64, align: 64, offset: 1152)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1119, file: !474, line: 592, baseType: !1111, size: 64, align: 64, offset: 1216)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1119, file: !474, line: 597, baseType: !1111, size: 64, align: 64, offset: 1280)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1119, file: !474, line: 598, baseType: !13, size: 32, align: 32, offset: 1344)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1119, file: !474, line: 608, baseType: !1043, size: 64, align: 64, offset: 1408)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1119, file: !474, line: 617, baseType: !1256, size: 64, align: 64, offset: 1472)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{null, !1046}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1119, file: !474, line: 623, baseType: !1260, size: 64, align: 64, offset: 1536)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!917, !1046, !1263}
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !962, file: !474, line: 1365, baseType: !975, size: 64, align: 64, offset: 192)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !962, file: !474, line: 1379, baseType: !1267, size: 64, align: 64, offset: 256)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !646, line: 352, baseType: !1269)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !646, line: 161, size: 2112, align: 64, elements: !1270)
!1270 = !{!1271, !1272, !1273, !1274, !1275, !1276, !1277, !1281, !1282, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1298, !1299, !1303, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1321, !1322, !1323, !1324, !1328, !1329, !1330}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1269, file: !646, line: 174, baseType: !965, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1269, file: !646, line: 226, baseType: !1039, size: 64, align: 64, offset: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1269, file: !646, line: 227, baseType: !917, size: 32, align: 32, offset: 128)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1269, file: !646, line: 228, baseType: !1039, size: 64, align: 64, offset: 192)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1269, file: !646, line: 229, baseType: !1039, size: 64, align: 64, offset: 256)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1269, file: !646, line: 233, baseType: !975, size: 64, align: 64, offset: 320)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1269, file: !646, line: 235, baseType: !1278, size: 64, align: 64, offset: 384)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{!917, !975, !1066, !917}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1269, file: !646, line: 236, baseType: !1278, size: 64, align: 64, offset: 448)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1269, file: !646, line: 237, baseType: !1283, size: 64, align: 64, offset: 512)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!1069, !975, !1069, !917}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1269, file: !646, line: 238, baseType: !1069, size: 64, align: 64, offset: 576)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1269, file: !646, line: 239, baseType: !917, size: 32, align: 32, offset: 640)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1269, file: !646, line: 240, baseType: !917, size: 32, align: 32, offset: 672)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1269, file: !646, line: 241, baseType: !917, size: 32, align: 32, offset: 704)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1269, file: !646, line: 242, baseType: !1154, size: 64, align: 64, offset: 768)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1269, file: !646, line: 243, baseType: !1039, size: 64, align: 64, offset: 832)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1269, file: !646, line: 244, baseType: !1293, size: 64, align: 64, offset: 896)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!1154, !1154, !1296, !918}
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1269, file: !646, line: 245, baseType: !917, size: 32, align: 32, offset: 960)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1269, file: !646, line: 249, baseType: !1300, size: 64, align: 64, offset: 1024)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{!917, !975, !917}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1269, file: !646, line: 255, baseType: !1304, size: 64, align: 64, offset: 1088)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DISubroutineType(types: !1306)
!1306 = !{!1069, !975, !917, !1069, !917}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1269, file: !646, line: 260, baseType: !917, size: 32, align: 32, offset: 1152)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1269, file: !646, line: 266, baseType: !1069, size: 64, align: 64, offset: 1216)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1269, file: !646, line: 273, baseType: !917, size: 32, align: 32, offset: 1280)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1269, file: !646, line: 279, baseType: !1069, size: 64, align: 64, offset: 1344)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1269, file: !646, line: 285, baseType: !917, size: 32, align: 32, offset: 1408)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1269, file: !646, line: 291, baseType: !917, size: 32, align: 32, offset: 1440)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1269, file: !646, line: 298, baseType: !917, size: 32, align: 32, offset: 1472)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1269, file: !646, line: 304, baseType: !917, size: 32, align: 32, offset: 1504)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1269, file: !646, line: 309, baseType: !949, size: 64, align: 64, offset: 1536)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1269, file: !646, line: 314, baseType: !949, size: 64, align: 64, offset: 1600)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1269, file: !646, line: 319, baseType: !1318, size: 64, align: 64, offset: 1664)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DISubroutineType(types: !1320)
!1320 = !{!917, !975, !1066, !917, !645, !1069}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1269, file: !646, line: 326, baseType: !917, size: 32, align: 32, offset: 1728)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1269, file: !646, line: 331, baseType: !645, size: 32, align: 32, offset: 1760)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1269, file: !646, line: 332, baseType: !1069, size: 64, align: 64, offset: 1792)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1269, file: !646, line: 338, baseType: !1325, size: 64, align: 64, offset: 1856)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DISubroutineType(types: !1327)
!1327 = !{!917, !975}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1269, file: !646, line: 340, baseType: !1069, size: 64, align: 64, offset: 1920)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1269, file: !646, line: 346, baseType: !1039, size: 64, align: 64, offset: 1984)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1269, file: !646, line: 351, baseType: !917, size: 32, align: 32, offset: 2048)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !962, file: !474, line: 1386, baseType: !917, size: 32, align: 32, offset: 320)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !962, file: !474, line: 1393, baseType: !918, size: 32, align: 32, offset: 352)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !962, file: !474, line: 1405, baseType: !1334, size: 64, align: 64, offset: 384)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !474, line: 1223, baseType: !1337)
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !474, line: 865, size: 6144, align: 64, elements: !1338)
!1338 = !{!1339, !1340, !1341, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1807, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1908, !1914, !1915, !1919, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1951, !1952, !1953, !1954, !1955, !1956}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1337, file: !474, line: 866, baseType: !917, size: 32, align: 32)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1337, file: !474, line: 872, baseType: !917, size: 32, align: 32, offset: 32)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1337, file: !474, line: 878, baseType: !1342, size: 64, align: 64, offset: 64)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1344)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1345)
!1345 = !{!1346, !1347, !1348, !1349, !1482, !1483, !1484, !1485, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1511, !1515, !1516, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1695, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1344, file: !14, line: 1561, baseType: !965, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1344, file: !14, line: 1562, baseType: !917, size: 32, align: 32, offset: 64)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1344, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1344, file: !14, line: 1565, baseType: !1350, size: 64, align: 64, offset: 128)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1352)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1353)
!1353 = !{!1354, !1355, !1356, !1357, !1358, !1359, !1362, !1365, !1368, !1371, !1374, !1375, !1376, !1384, !1385, !1386, !1388, !1392, !1398, !1403, !1407, !1408, !1448, !1454, !1458, !1459, !1463, !1467, !1471, !1475, !1476, !1477}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1352, file: !14, line: 3475, baseType: !949, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1352, file: !14, line: 3480, baseType: !949, size: 64, align: 64, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1352, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1352, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1352, file: !14, line: 3487, baseType: !917, size: 32, align: 32, offset: 192)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1352, file: !14, line: 3488, baseType: !1360, size: 64, align: 64, offset: 256)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1179)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1352, file: !14, line: 3489, baseType: !1363, size: 64, align: 64, offset: 320)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1352, file: !14, line: 3490, baseType: !1366, size: 64, align: 64, offset: 384)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1352, file: !14, line: 3491, baseType: !1369, size: 64, align: 64, offset: 448)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !853)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1352, file: !14, line: 3492, baseType: !1372, size: 64, align: 64, offset: 512)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1194)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1352, file: !14, line: 3493, baseType: !938, size: 8, align: 8, offset: 576)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1352, file: !14, line: 3494, baseType: !965, size: 64, align: 64, offset: 640)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1352, file: !14, line: 3495, baseType: !1377, size: 64, align: 64, offset: 704)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1379)
!1379 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1380)
!1380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1381)
!1381 = !{!1382, !1383}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1380, file: !14, line: 3402, baseType: !917, size: 32, align: 32)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1380, file: !14, line: 3403, baseType: !949, size: 64, align: 64, offset: 64)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1352, file: !14, line: 3507, baseType: !949, size: 64, align: 64, offset: 768)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1352, file: !14, line: 3516, baseType: !917, size: 32, align: 32, offset: 832)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1352, file: !14, line: 3517, baseType: !1387, size: 64, align: 64, offset: 896)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1352, file: !14, line: 3527, baseType: !1389, size: 64, align: 64, offset: 960)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DISubroutineType(types: !1391)
!1391 = !{!917, !1342}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1352, file: !14, line: 3535, baseType: !1393, size: 64, align: 64, offset: 1024)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DISubroutineType(types: !1395)
!1395 = !{!917, !1342, !1396}
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1343)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1352, file: !14, line: 3541, baseType: !1399, size: 64, align: 64, offset: 1088)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1401)
!1401 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1402)
!1402 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !14, line: 3461, flags: DIFlagFwdDecl)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1352, file: !14, line: 3549, baseType: !1404, size: 64, align: 64, offset: 1152)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DISubroutineType(types: !1406)
!1406 = !{null, !1387}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1352, file: !14, line: 3551, baseType: !1389, size: 64, align: 64, offset: 1216)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1352, file: !14, line: 3552, baseType: !1409, size: 64, align: 64, offset: 1280)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DISubroutineType(types: !1411)
!1411 = !{!917, !1342, !1066, !917, !1412}
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1414)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1415)
!1415 = !{!1416, !1417, !1418, !1419, !1420, !1447}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1414, file: !14, line: 3921, baseType: !929, size: 16, align: 16)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1414, file: !14, line: 3922, baseType: !937, size: 32, align: 32, offset: 32)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1414, file: !14, line: 3923, baseType: !937, size: 32, align: 32, offset: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1414, file: !14, line: 3924, baseType: !918, size: 32, align: 32, offset: 96)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1414, file: !14, line: 3925, baseType: !1421, size: 64, align: 64, offset: 128)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1424)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1425)
!1425 = !{!1426, !1427, !1428, !1429, !1430, !1431, !1437, !1441, !1443, !1444, !1445, !1446}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1424, file: !14, line: 3886, baseType: !917, size: 32, align: 32)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1424, file: !14, line: 3887, baseType: !917, size: 32, align: 32, offset: 32)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1424, file: !14, line: 3888, baseType: !917, size: 32, align: 32, offset: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1424, file: !14, line: 3889, baseType: !917, size: 32, align: 32, offset: 96)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1424, file: !14, line: 3890, baseType: !917, size: 32, align: 32, offset: 128)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1424, file: !14, line: 3897, baseType: !1432, size: 768, align: 64, offset: 192)
!1432 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1433)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1434)
!1434 = !{!1435, !1436}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1433, file: !14, line: 3855, baseType: !1165, size: 512, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1433, file: !14, line: 3857, baseType: !1169, size: 256, align: 32, offset: 512)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1424, file: !14, line: 3903, baseType: !1438, size: 256, align: 64, offset: 960)
!1438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1066, size: 256, align: 64, elements: !1439)
!1439 = !{!1440}
!1440 = !DISubrange(count: 4)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1424, file: !14, line: 3904, baseType: !1442, size: 128, align: 32, offset: 1216)
!1442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 128, align: 32, elements: !1439)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1424, file: !14, line: 3906, baseType: !870, size: 32, align: 32, offset: 1344)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1424, file: !14, line: 3908, baseType: !920, size: 64, align: 64, offset: 1408)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1424, file: !14, line: 3915, baseType: !920, size: 64, align: 64, offset: 1472)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1424, file: !14, line: 3917, baseType: !917, size: 32, align: 32, offset: 1536)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1414, file: !14, line: 3926, baseType: !1069, size: 64, align: 64, offset: 192)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1352, file: !14, line: 3564, baseType: !1449, size: 64, align: 64, offset: 1344)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DISubroutineType(types: !1451)
!1451 = !{!917, !1342, !1051, !1452, !919}
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1161)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1352, file: !14, line: 3566, baseType: !1455, size: 64, align: 64, offset: 1408)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{!917, !1342, !975, !919, !1051}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1352, file: !14, line: 3567, baseType: !1389, size: 64, align: 64, offset: 1472)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1352, file: !14, line: 3576, baseType: !1460, size: 64, align: 64, offset: 1536)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DISubroutineType(types: !1462)
!1462 = !{!917, !1342, !1452}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1352, file: !14, line: 3577, baseType: !1464, size: 64, align: 64, offset: 1600)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DISubroutineType(types: !1466)
!1466 = !{!917, !1342, !1051}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1352, file: !14, line: 3584, baseType: !1468, size: 64, align: 64, offset: 1664)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!917, !1342, !1160}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1352, file: !14, line: 3589, baseType: !1472, size: 64, align: 64, offset: 1728)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DISubroutineType(types: !1474)
!1474 = !{null, !1342}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1352, file: !14, line: 3594, baseType: !917, size: 32, align: 32, offset: 1792)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1352, file: !14, line: 3600, baseType: !949, size: 64, align: 64, offset: 1856)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1352, file: !14, line: 3609, baseType: !1478, size: 64, align: 64, offset: 1920)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1481)
!1481 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1344, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1344, file: !14, line: 1581, baseType: !918, size: 32, align: 32, offset: 224)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1344, file: !14, line: 1583, baseType: !975, size: 64, align: 64, offset: 256)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1344, file: !14, line: 1591, baseType: !1486, size: 64, align: 64, offset: 320)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !14, line: 1532, flags: DIFlagFwdDecl)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1344, file: !14, line: 1598, baseType: !975, size: 64, align: 64, offset: 384)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1344, file: !14, line: 1606, baseType: !1069, size: 64, align: 64, offset: 448)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1344, file: !14, line: 1614, baseType: !917, size: 32, align: 32, offset: 512)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1344, file: !14, line: 1622, baseType: !917, size: 32, align: 32, offset: 544)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1344, file: !14, line: 1628, baseType: !917, size: 32, align: 32, offset: 576)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1344, file: !14, line: 1636, baseType: !917, size: 32, align: 32, offset: 608)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1344, file: !14, line: 1643, baseType: !917, size: 32, align: 32, offset: 640)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1344, file: !14, line: 1657, baseType: !1066, size: 64, align: 64, offset: 704)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1344, file: !14, line: 1658, baseType: !917, size: 32, align: 32, offset: 768)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1344, file: !14, line: 1679, baseType: !1179, size: 64, align: 32, offset: 800)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1344, file: !14, line: 1688, baseType: !917, size: 32, align: 32, offset: 864)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1344, file: !14, line: 1712, baseType: !917, size: 32, align: 32, offset: 896)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1344, file: !14, line: 1729, baseType: !917, size: 32, align: 32, offset: 928)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1344, file: !14, line: 1729, baseType: !917, size: 32, align: 32, offset: 960)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1344, file: !14, line: 1744, baseType: !917, size: 32, align: 32, offset: 992)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1344, file: !14, line: 1744, baseType: !917, size: 32, align: 32, offset: 1024)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1344, file: !14, line: 1751, baseType: !917, size: 32, align: 32, offset: 1056)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1344, file: !14, line: 1766, baseType: !654, size: 32, align: 32, offset: 1088)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1344, file: !14, line: 1791, baseType: !1507, size: 64, align: 64, offset: 1152)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DISubroutineType(types: !1509)
!1509 = !{null, !1510, !1452, !919, !917, !917, !917}
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1344, file: !14, line: 1808, baseType: !1512, size: 64, align: 64, offset: 1216)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64, align: 64)
!1513 = !DISubroutineType(types: !1514)
!1514 = !{!654, !1510, !1363}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1344, file: !14, line: 1816, baseType: !917, size: 32, align: 32, offset: 1280)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1344, file: !14, line: 1825, baseType: !1517, size: 32, align: 32, offset: 1312)
!1517 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1344, file: !14, line: 1830, baseType: !917, size: 32, align: 32, offset: 1344)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1344, file: !14, line: 1838, baseType: !1517, size: 32, align: 32, offset: 1376)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1344, file: !14, line: 1846, baseType: !917, size: 32, align: 32, offset: 1408)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1344, file: !14, line: 1851, baseType: !917, size: 32, align: 32, offset: 1440)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1344, file: !14, line: 1861, baseType: !1517, size: 32, align: 32, offset: 1472)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1344, file: !14, line: 1868, baseType: !1517, size: 32, align: 32, offset: 1504)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1344, file: !14, line: 1875, baseType: !1517, size: 32, align: 32, offset: 1536)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1344, file: !14, line: 1882, baseType: !1517, size: 32, align: 32, offset: 1568)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1344, file: !14, line: 1889, baseType: !1517, size: 32, align: 32, offset: 1600)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1344, file: !14, line: 1896, baseType: !1517, size: 32, align: 32, offset: 1632)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1344, file: !14, line: 1903, baseType: !1517, size: 32, align: 32, offset: 1664)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1344, file: !14, line: 1910, baseType: !917, size: 32, align: 32, offset: 1696)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1344, file: !14, line: 1915, baseType: !917, size: 32, align: 32, offset: 1728)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1344, file: !14, line: 1926, baseType: !919, size: 64, align: 64, offset: 1792)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1344, file: !14, line: 1935, baseType: !1179, size: 64, align: 32, offset: 1856)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1344, file: !14, line: 1942, baseType: !917, size: 32, align: 32, offset: 1920)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1344, file: !14, line: 1948, baseType: !917, size: 32, align: 32, offset: 1952)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1344, file: !14, line: 1954, baseType: !917, size: 32, align: 32, offset: 1984)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1344, file: !14, line: 1960, baseType: !917, size: 32, align: 32, offset: 2016)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1344, file: !14, line: 1984, baseType: !917, size: 32, align: 32, offset: 2048)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1344, file: !14, line: 1991, baseType: !917, size: 32, align: 32, offset: 2080)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1344, file: !14, line: 1996, baseType: !917, size: 32, align: 32, offset: 2112)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1344, file: !14, line: 2004, baseType: !917, size: 32, align: 32, offset: 2144)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1344, file: !14, line: 2011, baseType: !917, size: 32, align: 32, offset: 2176)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1344, file: !14, line: 2018, baseType: !917, size: 32, align: 32, offset: 2208)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1344, file: !14, line: 2027, baseType: !917, size: 32, align: 32, offset: 2240)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1344, file: !14, line: 2034, baseType: !917, size: 32, align: 32, offset: 2272)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1344, file: !14, line: 2044, baseType: !917, size: 32, align: 32, offset: 2304)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1344, file: !14, line: 2054, baseType: !1547, size: 64, align: 64, offset: 2368)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1344, file: !14, line: 2061, baseType: !1547, size: 64, align: 64, offset: 2432)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1344, file: !14, line: 2066, baseType: !917, size: 32, align: 32, offset: 2496)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1344, file: !14, line: 2070, baseType: !917, size: 32, align: 32, offset: 2528)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1344, file: !14, line: 2078, baseType: !917, size: 32, align: 32, offset: 2560)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1344, file: !14, line: 2085, baseType: !917, size: 32, align: 32, offset: 2592)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1344, file: !14, line: 2092, baseType: !917, size: 32, align: 32, offset: 2624)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1344, file: !14, line: 2099, baseType: !917, size: 32, align: 32, offset: 2656)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1344, file: !14, line: 2106, baseType: !917, size: 32, align: 32, offset: 2688)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1344, file: !14, line: 2113, baseType: !917, size: 32, align: 32, offset: 2720)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1344, file: !14, line: 2120, baseType: !917, size: 32, align: 32, offset: 2752)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1344, file: !14, line: 2125, baseType: !917, size: 32, align: 32, offset: 2784)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1344, file: !14, line: 2133, baseType: !917, size: 32, align: 32, offset: 2816)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1344, file: !14, line: 2140, baseType: !917, size: 32, align: 32, offset: 2848)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1344, file: !14, line: 2145, baseType: !917, size: 32, align: 32, offset: 2880)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1344, file: !14, line: 2153, baseType: !917, size: 32, align: 32, offset: 2912)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1344, file: !14, line: 2158, baseType: !917, size: 32, align: 32, offset: 2944)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1344, file: !14, line: 2166, baseType: !574, size: 32, align: 32, offset: 2976)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1344, file: !14, line: 2173, baseType: !592, size: 32, align: 32, offset: 3008)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1344, file: !14, line: 2180, baseType: !616, size: 32, align: 32, offset: 3040)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1344, file: !14, line: 2187, baseType: !567, size: 32, align: 32, offset: 3072)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1344, file: !14, line: 2194, baseType: !635, size: 32, align: 32, offset: 3104)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1344, file: !14, line: 2203, baseType: !917, size: 32, align: 32, offset: 3136)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1344, file: !14, line: 2209, baseType: !876, size: 32, align: 32, offset: 3168)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1344, file: !14, line: 2212, baseType: !917, size: 32, align: 32, offset: 3200)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1344, file: !14, line: 2213, baseType: !917, size: 32, align: 32, offset: 3232)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1344, file: !14, line: 2220, baseType: !853, size: 32, align: 32, offset: 3264)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1344, file: !14, line: 2232, baseType: !917, size: 32, align: 32, offset: 3296)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1344, file: !14, line: 2243, baseType: !917, size: 32, align: 32, offset: 3328)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1344, file: !14, line: 2249, baseType: !917, size: 32, align: 32, offset: 3360)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1344, file: !14, line: 2256, baseType: !917, size: 32, align: 32, offset: 3392)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1344, file: !14, line: 2263, baseType: !1194, size: 64, align: 64, offset: 3456)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1344, file: !14, line: 2270, baseType: !1194, size: 64, align: 64, offset: 3520)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1344, file: !14, line: 2277, baseType: !884, size: 32, align: 32, offset: 3584)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1344, file: !14, line: 2285, baseType: !853, size: 32, align: 32, offset: 3616)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1344, file: !14, line: 2367, baseType: !1583, size: 64, align: 64, offset: 3648)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DISubroutineType(types: !1585)
!1585 = !{!917, !1510, !1160, !917}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1344, file: !14, line: 2383, baseType: !917, size: 32, align: 32, offset: 3712)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1344, file: !14, line: 2386, baseType: !1517, size: 32, align: 32, offset: 3744)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1344, file: !14, line: 2387, baseType: !1517, size: 32, align: 32, offset: 3776)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1344, file: !14, line: 2394, baseType: !917, size: 32, align: 32, offset: 3808)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1344, file: !14, line: 2401, baseType: !917, size: 32, align: 32, offset: 3840)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1344, file: !14, line: 2408, baseType: !917, size: 32, align: 32, offset: 3872)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1344, file: !14, line: 2415, baseType: !917, size: 32, align: 32, offset: 3904)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1344, file: !14, line: 2422, baseType: !917, size: 32, align: 32, offset: 3936)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1344, file: !14, line: 2423, baseType: !1595, size: 64, align: 64, offset: 3968)
!1595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1596, size: 64, align: 64)
!1596 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1597)
!1597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1598)
!1598 = !{!1599, !1600, !1601, !1602}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1597, file: !14, line: 827, baseType: !917, size: 32, align: 32)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1597, file: !14, line: 828, baseType: !917, size: 32, align: 32, offset: 32)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1597, file: !14, line: 829, baseType: !917, size: 32, align: 32, offset: 64)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1597, file: !14, line: 830, baseType: !1517, size: 32, align: 32, offset: 96)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1344, file: !14, line: 2430, baseType: !1069, size: 64, align: 64, offset: 4032)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1344, file: !14, line: 2437, baseType: !1069, size: 64, align: 64, offset: 4096)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1344, file: !14, line: 2444, baseType: !1517, size: 32, align: 32, offset: 4160)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1344, file: !14, line: 2451, baseType: !1517, size: 32, align: 32, offset: 4192)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1344, file: !14, line: 2458, baseType: !917, size: 32, align: 32, offset: 4224)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1344, file: !14, line: 2469, baseType: !917, size: 32, align: 32, offset: 4256)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1344, file: !14, line: 2475, baseType: !917, size: 32, align: 32, offset: 4288)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1344, file: !14, line: 2481, baseType: !917, size: 32, align: 32, offset: 4320)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1344, file: !14, line: 2485, baseType: !917, size: 32, align: 32, offset: 4352)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1344, file: !14, line: 2489, baseType: !917, size: 32, align: 32, offset: 4384)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1344, file: !14, line: 2493, baseType: !917, size: 32, align: 32, offset: 4416)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1344, file: !14, line: 2501, baseType: !917, size: 32, align: 32, offset: 4448)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1344, file: !14, line: 2506, baseType: !917, size: 32, align: 32, offset: 4480)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1344, file: !14, line: 2510, baseType: !917, size: 32, align: 32, offset: 4512)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1344, file: !14, line: 2514, baseType: !1069, size: 64, align: 64, offset: 4544)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1344, file: !14, line: 2528, baseType: !1619, size: 64, align: 64, offset: 4608)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DISubroutineType(types: !1621)
!1621 = !{null, !1510, !975, !917, !917}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1344, file: !14, line: 2534, baseType: !917, size: 32, align: 32, offset: 4672)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1344, file: !14, line: 2545, baseType: !917, size: 32, align: 32, offset: 4704)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1344, file: !14, line: 2547, baseType: !917, size: 32, align: 32, offset: 4736)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1344, file: !14, line: 2549, baseType: !917, size: 32, align: 32, offset: 4768)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1344, file: !14, line: 2551, baseType: !917, size: 32, align: 32, offset: 4800)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1344, file: !14, line: 2553, baseType: !917, size: 32, align: 32, offset: 4832)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1344, file: !14, line: 2555, baseType: !917, size: 32, align: 32, offset: 4864)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1344, file: !14, line: 2557, baseType: !917, size: 32, align: 32, offset: 4896)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1344, file: !14, line: 2559, baseType: !917, size: 32, align: 32, offset: 4928)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1344, file: !14, line: 2563, baseType: !917, size: 32, align: 32, offset: 4960)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1344, file: !14, line: 2571, baseType: !920, size: 64, align: 64, offset: 4992)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1344, file: !14, line: 2579, baseType: !920, size: 64, align: 64, offset: 5056)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1344, file: !14, line: 2586, baseType: !917, size: 32, align: 32, offset: 5120)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1344, file: !14, line: 2615, baseType: !917, size: 32, align: 32, offset: 5152)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1344, file: !14, line: 2627, baseType: !917, size: 32, align: 32, offset: 5184)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1344, file: !14, line: 2637, baseType: !917, size: 32, align: 32, offset: 5216)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1344, file: !14, line: 2681, baseType: !917, size: 32, align: 32, offset: 5248)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1344, file: !14, line: 2709, baseType: !1069, size: 64, align: 64, offset: 5312)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1344, file: !14, line: 2716, baseType: !1641, size: 64, align: 64, offset: 5376)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1643)
!1643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1644)
!1644 = !{!1645, !1646, !1647, !1648, !1649, !1650, !1651, !1655, !1659, !1660, !1661, !1662, !1668, !1669, !1670, !1671, !1672}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1643, file: !14, line: 3642, baseType: !949, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1643, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1643, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1643, file: !14, line: 3663, baseType: !654, size: 32, align: 32, offset: 128)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1643, file: !14, line: 3669, baseType: !917, size: 32, align: 32, offset: 160)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1643, file: !14, line: 3682, baseType: !1468, size: 64, align: 64, offset: 192)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1643, file: !14, line: 3698, baseType: !1652, size: 64, align: 64, offset: 256)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{!917, !1342, !1296, !937}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1643, file: !14, line: 3712, baseType: !1656, size: 64, align: 64, offset: 320)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DISubroutineType(types: !1658)
!1658 = !{!917, !1342, !917, !1296, !937}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1643, file: !14, line: 3726, baseType: !1652, size: 64, align: 64, offset: 384)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1643, file: !14, line: 3737, baseType: !1389, size: 64, align: 64, offset: 448)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1643, file: !14, line: 3746, baseType: !917, size: 32, align: 32, offset: 512)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1643, file: !14, line: 3757, baseType: !1663, size: 64, align: 64, offset: 576)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DISubroutineType(types: !1665)
!1665 = !{null, !1666}
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1643, file: !14, line: 3766, baseType: !1389, size: 64, align: 64, offset: 640)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1643, file: !14, line: 3774, baseType: !1389, size: 64, align: 64, offset: 704)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1643, file: !14, line: 3780, baseType: !917, size: 32, align: 32, offset: 768)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1643, file: !14, line: 3785, baseType: !917, size: 32, align: 32, offset: 800)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1643, file: !14, line: 3795, baseType: !1673, size: 64, align: 64, offset: 832)
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64, align: 64)
!1674 = !DISubroutineType(types: !1675)
!1675 = !{!917, !1342, !1056}
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1344, file: !14, line: 2728, baseType: !975, size: 64, align: 64, offset: 5440)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1344, file: !14, line: 2735, baseType: !1193, size: 512, align: 64, offset: 5504)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1344, file: !14, line: 2742, baseType: !917, size: 32, align: 32, offset: 6016)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1344, file: !14, line: 2755, baseType: !917, size: 32, align: 32, offset: 6048)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1344, file: !14, line: 2776, baseType: !917, size: 32, align: 32, offset: 6080)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1344, file: !14, line: 2783, baseType: !917, size: 32, align: 32, offset: 6112)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1344, file: !14, line: 2791, baseType: !917, size: 32, align: 32, offset: 6144)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1344, file: !14, line: 2802, baseType: !1160, size: 64, align: 64, offset: 6208)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1344, file: !14, line: 2811, baseType: !917, size: 32, align: 32, offset: 6272)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1344, file: !14, line: 2821, baseType: !917, size: 32, align: 32, offset: 6304)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1344, file: !14, line: 2830, baseType: !917, size: 32, align: 32, offset: 6336)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1344, file: !14, line: 2840, baseType: !917, size: 32, align: 32, offset: 6368)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1344, file: !14, line: 2851, baseType: !1689, size: 64, align: 64, offset: 6400)
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64, align: 64)
!1690 = !DISubroutineType(types: !1691)
!1691 = !{!917, !1510, !1692, !975, !919, !917, !917}
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DISubroutineType(types: !1694)
!1694 = !{!917, !1510, !975}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1344, file: !14, line: 2871, baseType: !1696, size: 64, align: 64, offset: 6464)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{!917, !1510, !1699, !975, !919, !917}
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DISubroutineType(types: !1701)
!1701 = !{!917, !1510, !975, !917, !917}
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1344, file: !14, line: 2878, baseType: !917, size: 32, align: 32, offset: 6528)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1344, file: !14, line: 2885, baseType: !917, size: 32, align: 32, offset: 6560)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1344, file: !14, line: 3005, baseType: !917, size: 32, align: 32, offset: 6592)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1344, file: !14, line: 3013, baseType: !896, size: 32, align: 32, offset: 6624)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1344, file: !14, line: 3020, baseType: !896, size: 32, align: 32, offset: 6656)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1344, file: !14, line: 3027, baseType: !896, size: 32, align: 32, offset: 6688)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1344, file: !14, line: 3037, baseType: !1066, size: 64, align: 64, offset: 6720)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1344, file: !14, line: 3038, baseType: !917, size: 32, align: 32, offset: 6784)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1344, file: !14, line: 3050, baseType: !1194, size: 64, align: 64, offset: 6848)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1344, file: !14, line: 3065, baseType: !917, size: 32, align: 32, offset: 6912)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1344, file: !14, line: 3083, baseType: !917, size: 32, align: 32, offset: 6944)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1344, file: !14, line: 3092, baseType: !1179, size: 64, align: 32, offset: 6976)
