; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--mxfdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--mxfdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }

!952 = !DIEnumerator(name: "OP3a", value: 7)
!953 = !DIEnumerator(name: "OP3b", value: 8)
!954 = !DIEnumerator(name: "OP3c", value: 9)
!955 = !DIEnumerator(name: "OPAtom", value: 10)
!956 = !DIEnumerator(name: "OPSONYOpt", value: 11)
!957 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MXFMetadataSetType", file: !958, line: 30, size: 32, align: 32, elements: !959)
!958 = !DIFile(filename: "libavformat/mxf.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!959 = !{!960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979}
!960 = !DIEnumerator(name: "AnyType", value: 0)
!961 = !DIEnumerator(name: "MaterialPackage", value: 1)
!962 = !DIEnumerator(name: "SourcePackage", value: 2)
!963 = !DIEnumerator(name: "SourceClip", value: 3)
!964 = !DIEnumerator(name: "TimecodeComponent", value: 4)
!965 = !DIEnumerator(name: "PulldownComponent", value: 5)
!966 = !DIEnumerator(name: "Sequence", value: 6)
!967 = !DIEnumerator(name: "MultipleDescriptor", value: 7)
!968 = !DIEnumerator(name: "Descriptor", value: 8)
!969 = !DIEnumerator(name: "Track", value: 9)
!970 = !DIEnumerator(name: "CryptoContext", value: 10)
!971 = !DIEnumerator(name: "Preface", value: 11)
!972 = !DIEnumerator(name: "Identification", value: 12)
!973 = !DIEnumerator(name: "ContentStorage", value: 13)
!974 = !DIEnumerator(name: "SubDescriptor", value: 14)
!975 = !DIEnumerator(name: "IndexTableSegment", value: 15)
!976 = !DIEnumerator(name: "EssenceContainerData", value: 16)
!977 = !DIEnumerator(name: "EssenceGroup", value: 17)
!978 = !DIEnumerator(name: "TaggedValue", value: 18)
!979 = !DIEnumerator(name: "TapeDescriptor", value: 19)
!980 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 82, size: 32, align: 32, elements: !981)
!981 = !{!982, !983, !984}
!982 = !DIEnumerator(name: "UnknownWrapped", value: 0)
!983 = !DIEnumerator(name: "FrameWrapped", value: 1)
!984 = !DIEnumerator(name: "ClipWrapped", value: 2)
!985 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !958, line: 68, size: 32, align: 32, elements: !986)
!986 = !{!987, !988, !989, !990}
!987 = !DIEnumerator(name: "NormalWrap", value: 0)
!988 = !DIEnumerator(name: "D10D11Wrap", value: 1)
!989 = !DIEnumerator(name: "RawAWrap", value: 2)
!990 = !DIEnumerator(name: "RawVWrap", value: 3)
!991 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVTimecodeFlag", file: !992, line: 35, size: 32, align: 32, elements: !993)
!992 = !DIFile(filename: "./libavutil/timecode.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!993 = !{!994, !995, !996}
!994 = !DIEnumerator(name: "AV_TIMECODE_FLAG_DROPFRAME", value: 1)
!995 = !DIEnumerator(name: "AV_TIMECODE_FLAG_24HOURSMAX", value: 2)
!996 = !DIEnumerator(name: "AV_TIMECODE_FLAG_ALLOWNEGATIVE", value: 4)
!997 = !{!998, !1007, !1014, !1006, !1015, !1017, !1020, !1021, !1063, !1074, !1083, !1100, !1108, !1133, !1154, !1171, !3, !667, !1178, !1185, !1125, !1192}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1001, line: 221, size: 32, align: 8, elements: !1002)
!1001 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1002 = !{!1003}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1000, file: !1001, line: 221, baseType: !1004, size: 32, align: 32)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1005, line: 51, baseType: !1006)
!1005 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1006 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !1001, line: 222, size: 16, align: 8, elements: !1010)
!1010 = !{!1011}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1009, file: !1001, line: 222, baseType: !1012, size: 16, align: 16)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1005, line: 49, baseType: !1013)
!1013 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1014 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1005, line: 40, baseType: !1016)
!1016 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1005, line: 48, baseType: !1019)
!1019 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXFDescriptor", file: !939, line: 210, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MXFDescriptor", file: !939, line: 182, size: 1408, align: 64, elements: !1024)
!1024 = !{!1025, !1030, !1031, !1032, !1033, !1034, !1041, !1042, !1043, !1044, !1045, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1058, !1059, !1060, !1061, !1062}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1023, file: !939, line: 183, baseType: !1026, size: 128, align: 8)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "UID", file: !958, line: 28, baseType: !1027)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 128, align: 8, elements: !1028)
!1028 = !{!1029}
!1029 = !DISubrange(count: 16)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1023, file: !939, line: 184, baseType: !957, size: 32, align: 32, offset: 128)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "essence_container_ul", scope: !1023, file: !939, line: 185, baseType: !1026, size: 128, align: 8, offset: 160)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "essence_codec_ul", scope: !1023, file: !939, line: 186, baseType: !1026, size: 128, align: 8, offset: 288)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ul", scope: !1023, file: !939, line: 187, baseType: !1026, size: 128, align: 8, offset: 416)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1023, file: !939, line: 188, baseType: !1035, size: 64, align: 32, offset: 544)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1036, line: 61, baseType: !1037)
!1036 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1036, line: 58, size: 64, align: 32, elements: !1038)
!1038 = !{!1039, !1040}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1037, file: !1036, line: 59, baseType: !1014, size: 32, align: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1037, file: !1036, line: 60, baseType: !1014, size: 32, align: 32, offset: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio", scope: !1023, file: !939, line: 189, baseType: !1035, size: 64, align: 32, offset: 608)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1023, file: !939, line: 190, baseType: !1014, size: 32, align: 32, offset: 672)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1023, file: !939, line: 191, baseType: !1014, size: 32, align: 32, offset: 704)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "frame_layout", scope: !1023, file: !939, line: 192, baseType: !1014, size: 32, align: 32, offset: 736)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "video_line_map", scope: !1023, file: !939, line: 193, baseType: !1046, size: 64, align: 32, offset: 768)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1014, size: 64, align: 32, elements: !1047)
!1047 = !{!1048}
!1048 = !DISubrange(count: 2)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "field_dominance", scope: !1023, file: !939, line: 197, baseType: !1014, size: 32, align: 32, offset: 832)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1023, file: !939, line: 198, baseType: !1014, size: 32, align: 32, offset: 864)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_sample", scope: !1023, file: !939, line: 199, baseType: !1014, size: 32, align: 32, offset: 896)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1023, file: !939, line: 200, baseType: !1015, size: 64, align: 64, offset: 960)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "component_depth", scope: !1023, file: !939, line: 201, baseType: !1006, size: 32, align: 32, offset: 1024)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "horiz_subsampling", scope: !1023, file: !939, line: 202, baseType: !1006, size: 32, align: 32, offset: 1056)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "vert_subsampling", scope: !1023, file: !939, line: 203, baseType: !1006, size: 32, align: 32, offset: 1088)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "sub_descriptors_refs", scope: !1023, file: !939, line: 204, baseType: !1057, size: 64, align: 64, offset: 1152)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "sub_descriptors_count", scope: !1023, file: !939, line: 205, baseType: !1014, size: 32, align: 32, offset: 1216)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "linked_track_id", scope: !1023, file: !939, line: 206, baseType: !1014, size: 32, align: 32, offset: 1248)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1023, file: !939, line: 207, baseType: !1017, size: 64, align: 64, offset: 1280)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1023, file: !939, line: 208, baseType: !1014, size: 32, align: 32, offset: 1344)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1023, file: !939, line: 209, baseType: !667, size: 32, align: 32, offset: 1376)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXFSequence", file: !939, line: 132, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MXFSequence", file: !939, line: 124, size: 576, align: 64, elements: !1066)
!1066 = !{!1067, !1068, !1069, !1070, !1071, !1072, !1073}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1065, file: !939, line: 125, baseType: !1026, size: 128, align: 8)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1065, file: !939, line: 126, baseType: !957, size: 32, align: 32, offset: 128)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "data_definition_ul", scope: !1065, file: !939, line: 127, baseType: !1026, size: 128, align: 8, offset: 160)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "structural_components_refs", scope: !1065, file: !939, line: 128, baseType: !1057, size: 64, align: 64, offset: 320)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "structural_components_count", scope: !1065, file: !939, line: 129, baseType: !1014, size: 32, align: 32, offset: 384)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1065, file: !939, line: 130, baseType: !1015, size: 64, align: 64, offset: 448)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !1065, file: !939, line: 131, baseType: !1018, size: 8, align: 8, offset: 512)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXFEssenceGroup", file: !939, line: 155, baseType: !1076)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !939, line: 149, size: 384, align: 64, elements: !1077)
!1077 = !{!1078, !1079, !1080, !1081, !1082}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1076, file: !939, line: 150, baseType: !1026, size: 128, align: 8)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1076, file: !939, line: 151, baseType: !957, size: 32, align: 32, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "structural_components_refs", scope: !1076, file: !939, line: 152, baseType: !1057, size: 64, align: 64, offset: 192)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "structural_components_count", scope: !1076, file: !939, line: 153, baseType: !1014, size: 32, align: 32, offset: 256)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1076, file: !939, line: 154, baseType: !1015, size: 64, align: 64, offset: 320)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXFPackage", file: !939, line: 239, baseType: !1085)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MXFPackage", file: !939, line: 227, size: 960, align: 64, elements: !1086)
!1086 = !{!1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1098, !1099}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1085, file: !939, line: 228, baseType: !1026, size: 128, align: 8)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1085, file: !939, line: 229, baseType: !957, size: 32, align: 32, offset: 128)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "package_uid", scope: !1085, file: !939, line: 230, baseType: !1026, size: 128, align: 8, offset: 160)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "package_ul", scope: !1085, file: !939, line: 231, baseType: !1026, size: 128, align: 8, offset: 288)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "tracks_refs", scope: !1085, file: !939, line: 232, baseType: !1057, size: 64, align: 64, offset: 448)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "tracks_count", scope: !1085, file: !939, line: 233, baseType: !1014, size: 32, align: 32, offset: 512)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor", scope: !1085, file: !939, line: 234, baseType: !1021, size: 64, align: 64, offset: 576)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_ref", scope: !1085, file: !939, line: 235, baseType: !1026, size: 128, align: 8, offset: 640)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1085, file: !939, line: 236, baseType: !1096, size: 64, align: 64, offset: 768)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "comment_refs", scope: !1085, file: !939, line: 237, baseType: !1057, size: 64, align: 64, offset: 832)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "comment_count", scope: !1085, file: !939, line: 238, baseType: !1014, size: 32, align: 32, offset: 896)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXFTaggedValue", file: !939, line: 162, baseType: !1102)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !939, line: 157, size: 320, align: 64, elements: !1103)
!1103 = !{!1104, !1105, !1106, !1107}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1102, file: !939, line: 158, baseType: !1026, size: 128, align: 8)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1102, file: !939, line: 159, baseType: !957, size: 32, align: 32, offset: 128)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1102, file: !939, line: 160, baseType: !1096, size: 64, align: 64, offset: 192)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1102, file: !939, line: 161, baseType: !1096, size: 64, align: 64, offset: 256)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXFTrack", file: !939, line: 180, baseType: !1110)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !939, line: 164, size: 896, align: 64, elements: !1111)
!1111 = !{!1112, !1113, !1114, !1115, !1116, !1117, !1118, !1122, !1123, !1124, !1127, !1128, !1129, !1130, !1132}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1110, file: !939, line: 165, baseType: !1026, size: 128, align: 8)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1110, file: !939, line: 166, baseType: !957, size: 32, align: 32, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !1110, file: !939, line: 167, baseType: !1063, size: 64, align: 64, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "sequence_ref", scope: !1110, file: !939, line: 168, baseType: !1026, size: 128, align: 8, offset: 256)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "track_id", scope: !1110, file: !939, line: 169, baseType: !1014, size: 32, align: 32, offset: 384)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1110, file: !939, line: 170, baseType: !1096, size: 64, align: 64, offset: 448)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "track_number", scope: !1110, file: !939, line: 171, baseType: !1119, size: 32, align: 8, offset: 512)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 32, align: 8, elements: !1120)
!1120 = !{!1121}
!1121 = !DISubrange(count: 4)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "edit_rate", scope: !1110, file: !939, line: 172, baseType: !1035, size: 64, align: 32, offset: 544)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "intra_only", scope: !1110, file: !939, line: 173, baseType: !1014, size: 32, align: 32, offset: 608)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "sample_count", scope: !1110, file: !939, line: 174, baseType: !1125, size: 64, align: 64, offset: 640)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1005, line: 55, baseType: !1126)
!1126 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "original_duration", scope: !1110, file: !939, line: 175, baseType: !1015, size: 64, align: 64, offset: 704)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "index_sid", scope: !1110, file: !939, line: 176, baseType: !1014, size: 32, align: 32, offset: 768)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "body_sid", scope: !1110, file: !939, line: 177, baseType: !1014, size: 32, align: 32, offset: 800)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "wrapping", scope: !1110, file: !939, line: 178, baseType: !1131, size: 32, align: 32, offset: 832)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXFWrappingScheme", file: !939, line: 86, baseType: !980)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "edit_units_per_packet", scope: !1110, file: !939, line: 179, baseType: !1014, size: 32, align: 32, offset: 864)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXFIndexTableSegment", file: !939, line: 225, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MXFIndexTableSegment", file: !939, line: 212, size: 704, align: 64, elements: !1136)
!1136 = !{!1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1149, !1151, !1153}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1135, file: !939, line: 213, baseType: !1026, size: 128, align: 8)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1135, file: !939, line: 214, baseType: !957, size: 32, align: 32, offset: 128)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "edit_unit_byte_count", scope: !1135, file: !939, line: 215, baseType: !1014, size: 32, align: 32, offset: 160)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "index_sid", scope: !1135, file: !939, line: 216, baseType: !1014, size: 32, align: 32, offset: 192)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "body_sid", scope: !1135, file: !939, line: 217, baseType: !1014, size: 32, align: 32, offset: 224)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "index_edit_rate", scope: !1135, file: !939, line: 218, baseType: !1035, size: 64, align: 32, offset: 256)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "index_start_position", scope: !1135, file: !939, line: 219, baseType: !1125, size: 64, align: 64, offset: 320)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "index_duration", scope: !1135, file: !939, line: 220, baseType: !1125, size: 64, align: 64, offset: 384)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_offset_entries", scope: !1135, file: !939, line: 221, baseType: !1146, size: 64, align: 64, offset: 448)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1005, line: 36, baseType: !1148)
!1148 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "flag_entries", scope: !1135, file: !939, line: 222, baseType: !1150, size: 64, align: 64, offset: 512)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "stream_offset_entries", scope: !1135, file: !939, line: 223, baseType: !1152, size: 64, align: 64, offset: 576)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index_entries", scope: !1135, file: !939, line: 224, baseType: !1014, size: 32, align: 32, offset: 640)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXFTimecodeComponent", file: !939, line: 141, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MXFTrack", file: !939, line: 134, size: 448, align: 32, elements: !1157)
!1157 = !{!1158, !1159, !1160, !1161, !1162, !1163}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1156, file: !939, line: 135, baseType: !1026, size: 128, align: 8)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1156, file: !939, line: 136, baseType: !957, size: 32, align: 32, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "drop_frame", scope: !1156, file: !939, line: 137, baseType: !1014, size: 32, align: 32, offset: 160)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1156, file: !939, line: 138, baseType: !1014, size: 32, align: 32, offset: 192)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !1156, file: !939, line: 139, baseType: !1037, size: 64, align: 32, offset: 224)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1156, file: !939, line: 140, baseType: !1164, size: 160, align: 32, offset: 288)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVTimecode", file: !992, line: 46, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !992, line: 41, size: 160, align: 32, elements: !1166)
!1166 = !{!1167, !1168, !1169, !1170}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1165, file: !992, line: 42, baseType: !1014, size: 32, align: 32)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1165, file: !992, line: 43, baseType: !1004, size: 32, align: 32, offset: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !1165, file: !992, line: 44, baseType: !1035, size: 64, align: 32, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "fps", scope: !1165, file: !992, line: 45, baseType: !1006, size: 32, align: 32, offset: 128)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXFCryptoContext", file: !939, line: 111, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MXFCryptoContext", file: !939, line: 107, size: 288, align: 32, elements: !1174)
!1174 = !{!1175, !1176, !1177}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1173, file: !939, line: 108, baseType: !1026, size: 128, align: 8)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1173, file: !939, line: 109, baseType: !957, size: 32, align: 32, offset: 128)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "source_container_ul", scope: !1173, file: !939, line: 110, baseType: !1026, size: 128, align: 8, offset: 160)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXFPulldownComponent", file: !939, line: 147, baseType: !1180)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !939, line: 143, size: 288, align: 32, elements: !1181)
!1181 = !{!1182, !1183, !1184}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1180, file: !939, line: 144, baseType: !1026, size: 128, align: 8)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1180, file: !939, line: 145, baseType: !957, size: 32, align: 32, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "input_segment_ref", scope: !1180, file: !939, line: 146, baseType: !1026, size: 128, align: 8, offset: 160)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXFMetadataSet", file: !939, line: 253, baseType: !1188)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MXFMetadataSet", file: !939, line: 250, size: 160, align: 32, elements: !1189)
!1189 = !{!1190, !1191}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1188, file: !939, line: 251, baseType: !1026, size: 128, align: 8)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1188, file: !939, line: 252, baseType: !957, size: 32, align: 32, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1193 = !{!1194, !2414, !2415, !2419, !2423, !2425, !2427, !2428, !2432, !2433, !2434, !2438, !2439, !2456, !2457, !2459, !2460, !2461, !2462, !2463, !2464, !2477, !2481, !2483, !2487, !2489, !2491}
!1194 = distinct !DIGlobalVariable(name: "ff_mxf_demuxer", scope: !0, file: !939, line: 3728, type: !1195, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_mxf_demuxer)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !1196)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1197)
!1197 = !{!1198, !1201, !1202, !1203, !1204, !1214, !1287, !1288, !1290, !1291, !1292, !1305, !2395, !2396, !2397, !2401, !2405, !2406, !2407, !2411, !2412, !2413}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1196, file: !919, line: 638, baseType: !1199, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1097)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1196, file: !919, line: 645, baseType: !1199, size: 64, align: 64, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1196, file: !919, line: 652, baseType: !1014, size: 32, align: 32, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1196, file: !919, line: 659, baseType: !1199, size: 64, align: 64, offset: 192)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1196, file: !919, line: 661, baseType: !1205, size: 64, align: 64, offset: 256)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1207)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1210, line: 44, size: 64, align: 32, elements: !1211)
!1210 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1211 = !{!1212, !1213}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1209, file: !1210, line: 45, baseType: !3, size: 32, align: 32)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1209, file: !1210, line: 46, baseType: !1006, size: 32, align: 32, offset: 32)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1196, file: !919, line: 663, baseType: !1215, size: 64, align: 64, offset: 320)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1217)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1219)
!1219 = !{!1220, !1221, !1225, !1246, !1247, !1248, !1249, !1253, !1259, !1261, !1265}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1218, file: !486, line: 72, baseType: !1199, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1218, file: !486, line: 78, baseType: !1222, size: 64, align: 64, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!1199, !1020}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1218, file: !486, line: 85, baseType: !1226, size: 64, align: 64, offset: 128)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1228)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1229)
!1229 = !{!1230, !1231, !1232, !1233, !1234, !1242, !1243, !1244, !1245}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1228, file: !464, line: 247, baseType: !1199, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1228, file: !464, line: 253, baseType: !1199, size: 64, align: 64, offset: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1228, file: !464, line: 259, baseType: !1014, size: 32, align: 32, offset: 128)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1228, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1228, file: !464, line: 271, baseType: !1235, size: 64, align: 64, offset: 192)
!1235 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1228, file: !464, line: 265, size: 64, align: 64, elements: !1236)
!1236 = !{!1237, !1238, !1240, !1241}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1235, file: !464, line: 266, baseType: !1015, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1235, file: !464, line: 267, baseType: !1239, size: 64, align: 64)
!1239 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1235, file: !464, line: 268, baseType: !1199, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1235, file: !464, line: 270, baseType: !1035, size: 64, align: 32)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1228, file: !464, line: 272, baseType: !1239, size: 64, align: 64, offset: 256)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1228, file: !464, line: 273, baseType: !1239, size: 64, align: 64, offset: 320)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1228, file: !464, line: 275, baseType: !1014, size: 32, align: 32, offset: 384)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1228, file: !464, line: 300, baseType: !1199, size: 64, align: 64, offset: 448)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1218, file: !486, line: 93, baseType: !1014, size: 32, align: 32, offset: 192)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1218, file: !486, line: 99, baseType: !1014, size: 32, align: 32, offset: 224)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1218, file: !486, line: 108, baseType: !1014, size: 32, align: 32, offset: 256)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1218, file: !486, line: 113, baseType: !1250, size: 64, align: 64, offset: 320)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!1020, !1020, !1020}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1218, file: !486, line: 123, baseType: !1254, size: 64, align: 64, offset: 384)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!1257, !1257}
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1218)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1218, file: !486, line: 130, baseType: !1260, size: 32, align: 32, offset: 448)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1218, file: !486, line: 136, baseType: !1262, size: 64, align: 64, offset: 512)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!1260, !1020}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1218, file: !486, line: 142, baseType: !1266, size: 64, align: 64, offset: 576)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!1014, !1269, !1020, !1199, !1014}
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1272)
!1272 = !{!1273, !1285, !1286}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1271, file: !464, line: 360, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1277)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1278)
!1278 = !{!1279, !1280, !1281, !1282, !1283, !1284}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1277, file: !464, line: 307, baseType: !1199, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1277, file: !464, line: 313, baseType: !1239, size: 64, align: 64, offset: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1277, file: !464, line: 313, baseType: !1239, size: 64, align: 64, offset: 128)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1277, file: !464, line: 318, baseType: !1239, size: 64, align: 64, offset: 192)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1277, file: !464, line: 318, baseType: !1239, size: 64, align: 64, offset: 256)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1277, file: !464, line: 323, baseType: !1014, size: 32, align: 32, offset: 320)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1271, file: !464, line: 364, baseType: !1014, size: 32, align: 32, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1271, file: !464, line: 368, baseType: !1014, size: 32, align: 32, offset: 96)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1196, file: !919, line: 670, baseType: !1199, size: 64, align: 64, offset: 384)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1196, file: !919, line: 679, baseType: !1289, size: 64, align: 64, offset: 448)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1196, file: !919, line: 684, baseType: !1014, size: 32, align: 32, offset: 512)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1196, file: !919, line: 689, baseType: !1014, size: 32, align: 32, offset: 544)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1196, file: !919, line: 696, baseType: !1293, size: 64, align: 64, offset: 576)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!1014, !1296}
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1298)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1299)
!1299 = !{!1300, !1301, !1303, !1304}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1298, file: !919, line: 449, baseType: !1199, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1298, file: !919, line: 450, baseType: !1302, size: 64, align: 64, offset: 64)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1298, file: !919, line: 451, baseType: !1014, size: 32, align: 32, offset: 128)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1298, file: !919, line: 452, baseType: !1199, size: 64, align: 64, offset: 192)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1196, file: !919, line: 703, baseType: !1306, size: 64, align: 64, offset: 640)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!1014, !1309}
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1311)
!1311 = !{!1312, !1313, !1314, !1499, !1500, !1565, !1566, !1567, !2252, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2306, !2307, !2308, !2309, !2310, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2335, !2336, !2337, !2361, !2362, !2365, !2366, !2367, !2368, !2369, !2370, !2372, !2373, !2374, !2375, !2383, !2384, !2388, !2392, !2393, !2394}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1310, file: !919, line: 1342, baseType: !1215, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1310, file: !919, line: 1349, baseType: !1289, size: 64, align: 64, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1310, file: !919, line: 1356, baseType: !1315, size: 64, align: 64, offset: 128)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1317)
!1317 = !{!1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1369, !1370, !1374, !1378, !1383, !1389, !1474, !1480, !1486, !1487, !1488, !1489, !1493}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1316, file: !919, line: 498, baseType: !1199, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1316, file: !919, line: 504, baseType: !1199, size: 64, align: 64, offset: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1316, file: !919, line: 505, baseType: !1199, size: 64, align: 64, offset: 128)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1316, file: !919, line: 506, baseType: !1199, size: 64, align: 64, offset: 192)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1316, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1316, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1316, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1316, file: !919, line: 517, baseType: !1014, size: 32, align: 32, offset: 352)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1316, file: !919, line: 523, baseType: !1205, size: 64, align: 64, offset: 384)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1316, file: !919, line: 526, baseType: !1215, size: 64, align: 64, offset: 448)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1316, file: !919, line: 535, baseType: !1315, size: 64, align: 64, offset: 512)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1316, file: !919, line: 539, baseType: !1014, size: 32, align: 32, offset: 576)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1316, file: !919, line: 541, baseType: !1306, size: 64, align: 64, offset: 640)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1316, file: !919, line: 549, baseType: !1332, size: 64, align: 64, offset: 704)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!1014, !1309, !1335}
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1337)
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1338)
!1338 = !{!1339, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1365, !1366, !1367, !1368}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1337, file: !4, line: 1451, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1342, line: 94, baseType: !1343)
!1342 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1342, line: 81, size: 192, align: 64, elements: !1344)
!1344 = !{!1345, !1349, !1350}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1343, file: !1342, line: 82, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1342, line: 73, baseType: !1348)
!1348 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1342, line: 73, flags: DIFlagFwdDecl)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1343, file: !1342, line: 89, baseType: !1017, size: 64, align: 64, offset: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1343, file: !1342, line: 93, baseType: !1014, size: 32, align: 32, offset: 128)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1337, file: !4, line: 1461, baseType: !1015, size: 64, align: 64, offset: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1337, file: !4, line: 1467, baseType: !1015, size: 64, align: 64, offset: 128)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1337, file: !4, line: 1468, baseType: !1017, size: 64, align: 64, offset: 192)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1337, file: !4, line: 1469, baseType: !1014, size: 32, align: 32, offset: 256)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1337, file: !4, line: 1470, baseType: !1014, size: 32, align: 32, offset: 288)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1337, file: !4, line: 1474, baseType: !1014, size: 32, align: 32, offset: 320)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1337, file: !4, line: 1479, baseType: !1358, size: 64, align: 64, offset: 384)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1360)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1361)
!1361 = !{!1362, !1363, !1364}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1360, file: !4, line: 1412, baseType: !1017, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1360, file: !4, line: 1413, baseType: !1014, size: 32, align: 32, offset: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1360, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1337, file: !4, line: 1480, baseType: !1014, size: 32, align: 32, offset: 448)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1337, file: !4, line: 1486, baseType: !1015, size: 64, align: 64, offset: 512)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1337, file: !4, line: 1488, baseType: !1015, size: 64, align: 64, offset: 576)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1337, file: !4, line: 1497, baseType: !1015, size: 64, align: 64, offset: 640)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1316, file: !919, line: 550, baseType: !1306, size: 64, align: 64, offset: 768)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1316, file: !919, line: 554, baseType: !1371, size: 64, align: 64, offset: 832)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DISubroutineType(types: !1373)
!1373 = !{!1014, !1309, !1335, !1335, !1014}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1316, file: !919, line: 563, baseType: !1375, size: 64, align: 64, offset: 896)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DISubroutineType(types: !1377)
!1377 = !{!1014, !3, !1014}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1316, file: !919, line: 565, baseType: !1379, size: 64, align: 64, offset: 960)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DISubroutineType(types: !1381)
!1381 = !{null, !1309, !1014, !1382, !1382}
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1316, file: !919, line: 570, baseType: !1384, size: 64, align: 64, offset: 1024)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DISubroutineType(types: !1386)
!1386 = !{!1014, !1309, !1014, !1020, !1387}
!1387 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1388, line: 216, baseType: !1126)
!1388 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1316, file: !919, line: 581, baseType: !1390, size: 64, align: 64, offset: 1088)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DISubroutineType(types: !1392)
!1392 = !{!1014, !1309, !1014, !1393, !1006}
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1396)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1397)
!1397 = !{!1398, !1402, !1404, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1431, !1433, !1434, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1396, file: !548, line: 282, baseType: !1399, size: 512, align: 64)
!1399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 512, align: 64, elements: !1400)
!1400 = !{!1401}
!1401 = !DISubrange(count: 8)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1396, file: !548, line: 299, baseType: !1403, size: 256, align: 32, offset: 512)
!1403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1014, size: 256, align: 32, elements: !1400)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1396, file: !548, line: 315, baseType: !1405, size: 64, align: 64, offset: 768)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1396, file: !548, line: 326, baseType: !1014, size: 32, align: 32, offset: 832)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1396, file: !548, line: 326, baseType: !1014, size: 32, align: 32, offset: 864)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1396, file: !548, line: 334, baseType: !1014, size: 32, align: 32, offset: 896)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1396, file: !548, line: 341, baseType: !1014, size: 32, align: 32, offset: 928)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1396, file: !548, line: 346, baseType: !1014, size: 32, align: 32, offset: 960)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1396, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1396, file: !548, line: 356, baseType: !1035, size: 64, align: 32, offset: 1024)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1396, file: !548, line: 361, baseType: !1015, size: 64, align: 64, offset: 1088)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1396, file: !548, line: 369, baseType: !1015, size: 64, align: 64, offset: 1152)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1396, file: !548, line: 377, baseType: !1015, size: 64, align: 64, offset: 1216)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1396, file: !548, line: 382, baseType: !1014, size: 32, align: 32, offset: 1280)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1396, file: !548, line: 386, baseType: !1014, size: 32, align: 32, offset: 1312)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1396, file: !548, line: 391, baseType: !1014, size: 32, align: 32, offset: 1344)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1396, file: !548, line: 396, baseType: !1020, size: 64, align: 64, offset: 1408)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1396, file: !548, line: 403, baseType: !1421, size: 512, align: 64, offset: 1472)
!1421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1125, size: 512, align: 64, elements: !1400)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1396, file: !548, line: 410, baseType: !1014, size: 32, align: 32, offset: 1984)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1396, file: !548, line: 415, baseType: !1014, size: 32, align: 32, offset: 2016)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1396, file: !548, line: 420, baseType: !1014, size: 32, align: 32, offset: 2048)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1396, file: !548, line: 425, baseType: !1014, size: 32, align: 32, offset: 2080)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1396, file: !548, line: 435, baseType: !1015, size: 64, align: 64, offset: 2112)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1396, file: !548, line: 440, baseType: !1014, size: 32, align: 32, offset: 2176)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1396, file: !548, line: 445, baseType: !1125, size: 64, align: 64, offset: 2240)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1396, file: !548, line: 459, baseType: !1430, size: 512, align: 64, offset: 2304)
!1430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1340, size: 512, align: 64, elements: !1400)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1396, file: !548, line: 473, baseType: !1432, size: 64, align: 64, offset: 2816)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1396, file: !548, line: 477, baseType: !1014, size: 32, align: 32, offset: 2880)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1396, file: !548, line: 479, baseType: !1435, size: 64, align: 64, offset: 2944)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1438)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1439)
!1439 = !{!1440, !1441, !1442, !1443, !1448}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1438, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1438, file: !548, line: 203, baseType: !1017, size: 64, align: 64, offset: 64)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1438, file: !548, line: 204, baseType: !1014, size: 32, align: 32, offset: 128)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1438, file: !548, line: 205, baseType: !1444, size: 64, align: 64, offset: 192)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1446, line: 86, baseType: !1447)
!1446 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1447 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1446, line: 86, flags: DIFlagFwdDecl)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1438, file: !548, line: 206, baseType: !1340, size: 64, align: 64, offset: 256)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1396, file: !548, line: 480, baseType: !1014, size: 32, align: 32, offset: 3008)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1396, file: !548, line: 505, baseType: !1014, size: 32, align: 32, offset: 3040)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1396, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1396, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1396, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1396, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1396, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1396, file: !548, line: 532, baseType: !1015, size: 64, align: 64, offset: 3264)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1396, file: !548, line: 539, baseType: !1015, size: 64, align: 64, offset: 3328)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1396, file: !548, line: 547, baseType: !1015, size: 64, align: 64, offset: 3392)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1396, file: !548, line: 554, baseType: !1444, size: 64, align: 64, offset: 3456)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1396, file: !548, line: 563, baseType: !1014, size: 32, align: 32, offset: 3520)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1396, file: !548, line: 572, baseType: !1014, size: 32, align: 32, offset: 3552)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1396, file: !548, line: 581, baseType: !1014, size: 32, align: 32, offset: 3584)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1396, file: !548, line: 588, baseType: !1146, size: 64, align: 64, offset: 3648)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1396, file: !548, line: 593, baseType: !1014, size: 32, align: 32, offset: 3712)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1396, file: !548, line: 596, baseType: !1014, size: 32, align: 32, offset: 3744)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1396, file: !548, line: 599, baseType: !1340, size: 64, align: 64, offset: 3776)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1396, file: !548, line: 605, baseType: !1340, size: 64, align: 64, offset: 3840)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1396, file: !548, line: 616, baseType: !1340, size: 64, align: 64, offset: 3904)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1396, file: !548, line: 626, baseType: !1387, size: 64, align: 64, offset: 3968)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1396, file: !548, line: 627, baseType: !1387, size: 64, align: 64, offset: 4032)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1396, file: !548, line: 628, baseType: !1387, size: 64, align: 64, offset: 4096)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1396, file: !548, line: 629, baseType: !1387, size: 64, align: 64, offset: 4160)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1396, file: !548, line: 645, baseType: !1340, size: 64, align: 64, offset: 4224)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1316, file: !919, line: 587, baseType: !1475, size: 64, align: 64, offset: 1152)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{!1014, !1309, !1478}
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1316, file: !919, line: 592, baseType: !1481, size: 64, align: 64, offset: 1216)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{!1014, !1309, !1484}
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1316, file: !919, line: 597, baseType: !1481, size: 64, align: 64, offset: 1280)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1316, file: !919, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1316, file: !919, line: 608, baseType: !1306, size: 64, align: 64, offset: 1408)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1316, file: !919, line: 617, baseType: !1490, size: 64, align: 64, offset: 1472)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DISubroutineType(types: !1492)
!1492 = !{null, !1309}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1316, file: !919, line: 623, baseType: !1494, size: 64, align: 64, offset: 1536)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DISubroutineType(types: !1496)
!1496 = !{!1014, !1309, !1497}
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1336)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1310, file: !919, line: 1365, baseType: !1020, size: 64, align: 64, offset: 192)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1310, file: !919, line: 1379, baseType: !1501, size: 64, align: 64, offset: 256)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1503)
!1503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1504)
!1504 = !{!1505, !1506, !1507, !1508, !1509, !1510, !1511, !1515, !1516, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1532, !1533, !1537, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1555, !1556, !1557, !1558, !1562, !1563, !1564}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1503, file: !650, line: 174, baseType: !1215, size: 64, align: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1503, file: !650, line: 226, baseType: !1302, size: 64, align: 64, offset: 64)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1503, file: !650, line: 227, baseType: !1014, size: 32, align: 32, offset: 128)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1503, file: !650, line: 228, baseType: !1302, size: 64, align: 64, offset: 192)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1503, file: !650, line: 229, baseType: !1302, size: 64, align: 64, offset: 256)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1503, file: !650, line: 233, baseType: !1020, size: 64, align: 64, offset: 320)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1503, file: !650, line: 235, baseType: !1512, size: 64, align: 64, offset: 384)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64, align: 64)
!1513 = !DISubroutineType(types: !1514)
!1514 = !{!1014, !1020, !1017, !1014}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1503, file: !650, line: 236, baseType: !1512, size: 64, align: 64, offset: 448)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1503, file: !650, line: 237, baseType: !1517, size: 64, align: 64, offset: 512)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64, align: 64)
!1518 = !DISubroutineType(types: !1519)
!1519 = !{!1015, !1020, !1015, !1014}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1503, file: !650, line: 238, baseType: !1015, size: 64, align: 64, offset: 576)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1503, file: !650, line: 239, baseType: !1014, size: 32, align: 32, offset: 640)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1503, file: !650, line: 240, baseType: !1014, size: 32, align: 32, offset: 672)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1503, file: !650, line: 241, baseType: !1014, size: 32, align: 32, offset: 704)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1503, file: !650, line: 242, baseType: !1126, size: 64, align: 64, offset: 768)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1503, file: !650, line: 243, baseType: !1302, size: 64, align: 64, offset: 832)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1503, file: !650, line: 244, baseType: !1527, size: 64, align: 64, offset: 896)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64, align: 64)
!1528 = !DISubroutineType(types: !1529)
!1529 = !{!1126, !1126, !1530, !1006}
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1503, file: !650, line: 245, baseType: !1014, size: 32, align: 32, offset: 960)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1503, file: !650, line: 249, baseType: !1534, size: 64, align: 64, offset: 1024)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{!1014, !1020, !1014}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1503, file: !650, line: 255, baseType: !1538, size: 64, align: 64, offset: 1088)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DISubroutineType(types: !1540)
!1540 = !{!1015, !1020, !1014, !1015, !1014}
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1503, file: !650, line: 260, baseType: !1014, size: 32, align: 32, offset: 1152)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1503, file: !650, line: 266, baseType: !1015, size: 64, align: 64, offset: 1216)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1503, file: !650, line: 273, baseType: !1014, size: 32, align: 32, offset: 1280)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1503, file: !650, line: 279, baseType: !1015, size: 64, align: 64, offset: 1344)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1503, file: !650, line: 285, baseType: !1014, size: 32, align: 32, offset: 1408)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1503, file: !650, line: 291, baseType: !1014, size: 32, align: 32, offset: 1440)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1503, file: !650, line: 298, baseType: !1014, size: 32, align: 32, offset: 1472)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1503, file: !650, line: 304, baseType: !1014, size: 32, align: 32, offset: 1504)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1503, file: !650, line: 309, baseType: !1199, size: 64, align: 64, offset: 1536)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1503, file: !650, line: 314, baseType: !1199, size: 64, align: 64, offset: 1600)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1503, file: !650, line: 319, baseType: !1552, size: 64, align: 64, offset: 1664)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1553 = !DISubroutineType(types: !1554)
!1554 = !{!1014, !1020, !1017, !1014, !649, !1015}
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1503, file: !650, line: 326, baseType: !1014, size: 32, align: 32, offset: 1728)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1503, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1503, file: !650, line: 332, baseType: !1015, size: 64, align: 64, offset: 1792)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1503, file: !650, line: 338, baseType: !1559, size: 64, align: 64, offset: 1856)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64, align: 64)
!1560 = !DISubroutineType(types: !1561)
!1561 = !{!1014, !1020}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1503, file: !650, line: 340, baseType: !1015, size: 64, align: 64, offset: 1920)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1503, file: !650, line: 346, baseType: !1302, size: 64, align: 64, offset: 1984)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1503, file: !650, line: 351, baseType: !1014, size: 32, align: 32, offset: 2048)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1310, file: !919, line: 1386, baseType: !1014, size: 32, align: 32, offset: 320)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1310, file: !919, line: 1393, baseType: !1006, size: 32, align: 32, offset: 352)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1310, file: !919, line: 1405, baseType: !1568, size: 64, align: 64, offset: 384)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64, align: 64)
!1570 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1571)
!1571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1572)
!1572 = !{!1573, !1574, !1575, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2039, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2138, !2144, !2145, !2149, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2181, !2182, !2183, !2184, !2185, !2186}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1571, file: !919, line: 866, baseType: !1014, size: 32, align: 32)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1571, file: !919, line: 872, baseType: !1014, size: 32, align: 32, offset: 32)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1571, file: !919, line: 878, baseType: !1576, size: 64, align: 64, offset: 64)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1578)
!1578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1579)
!1579 = !{!1580, !1581, !1582, !1583, !1714, !1715, !1716, !1717, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1743, !1747, !1748, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1927, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1578, file: !4, line: 1561, baseType: !1215, size: 64, align: 64)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1578, file: !4, line: 1562, baseType: !1014, size: 32, align: 32, offset: 64)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1578, file: !4, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1578, file: !4, line: 1565, baseType: !1584, size: 64, align: 64, offset: 128)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1586)
!1586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1587)
!1587 = !{!1588, !1589, !1590, !1591, !1592, !1593, !1596, !1599, !1602, !1605, !1608, !1609, !1610, !1618, !1619, !1620, !1622, !1626, !1632, !1637, !1641, !1642, !1680, !1686, !1690, !1691, !1695, !1699, !1703, !1707, !1708, !1709}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1586, file: !4, line: 3475, baseType: !1199, size: 64, align: 64)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1586, file: !4, line: 3480, baseType: !1199, size: 64, align: 64, offset: 64)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1586, file: !4, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1586, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1586, file: !4, line: 3487, baseType: !1014, size: 32, align: 32, offset: 192)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1586, file: !4, line: 3488, baseType: !1594, size: 64, align: 64, offset: 256)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1035)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1586, file: !4, line: 3489, baseType: !1597, size: 64, align: 64, offset: 320)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1586, file: !4, line: 3490, baseType: !1600, size: 64, align: 64, offset: 384)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1014)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1586, file: !4, line: 3491, baseType: !1603, size: 64, align: 64, offset: 448)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1586, file: !4, line: 3492, baseType: !1606, size: 64, align: 64, offset: 512)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1125)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1586, file: !4, line: 3493, baseType: !1018, size: 8, align: 8, offset: 576)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1586, file: !4, line: 3494, baseType: !1215, size: 64, align: 64, offset: 640)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1586, file: !4, line: 3495, baseType: !1611, size: 64, align: 64, offset: 704)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1613)
!1613 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1614)
!1614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1615)
!1615 = !{!1616, !1617}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1614, file: !4, line: 3402, baseType: !1014, size: 32, align: 32)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1614, file: !4, line: 3403, baseType: !1199, size: 64, align: 64, offset: 64)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1586, file: !4, line: 3507, baseType: !1199, size: 64, align: 64, offset: 768)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1586, file: !4, line: 3516, baseType: !1014, size: 32, align: 32, offset: 832)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1586, file: !4, line: 3517, baseType: !1621, size: 64, align: 64, offset: 896)
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1586, file: !4, line: 3527, baseType: !1623, size: 64, align: 64, offset: 960)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DISubroutineType(types: !1625)
!1625 = !{!1014, !1576}
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1586, file: !4, line: 3535, baseType: !1627, size: 64, align: 64, offset: 1024)
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64, align: 64)
!1628 = !DISubroutineType(types: !1629)
!1629 = !{!1014, !1576, !1630}
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1577)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1586, file: !4, line: 3541, baseType: !1633, size: 64, align: 64, offset: 1088)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1635)
!1635 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1636)
!1636 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1586, file: !4, line: 3549, baseType: !1638, size: 64, align: 64, offset: 1152)
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64, align: 64)
!1639 = !DISubroutineType(types: !1640)
!1640 = !{null, !1621}
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1586, file: !4, line: 3551, baseType: !1623, size: 64, align: 64, offset: 1216)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1586, file: !4, line: 3552, baseType: !1643, size: 64, align: 64, offset: 1280)
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64, align: 64)
!1644 = !DISubroutineType(types: !1645)
!1645 = !{!1014, !1576, !1017, !1014, !1646}
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1648)
!1648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1649)
!1649 = !{!1650, !1651, !1652, !1653, !1654, !1679}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1648, file: !4, line: 3921, baseType: !1012, size: 16, align: 16)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1648, file: !4, line: 3922, baseType: !1004, size: 32, align: 32, offset: 32)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1648, file: !4, line: 3923, baseType: !1004, size: 32, align: 32, offset: 64)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1648, file: !4, line: 3924, baseType: !1006, size: 32, align: 32, offset: 96)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1648, file: !4, line: 3925, baseType: !1655, size: 64, align: 64, offset: 128)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1658)
!1658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1659)
!1659 = !{!1660, !1661, !1662, !1663, !1664, !1665, !1671, !1673, !1675, !1676, !1677, !1678}
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1658, file: !4, line: 3886, baseType: !1014, size: 32, align: 32)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1658, file: !4, line: 3887, baseType: !1014, size: 32, align: 32, offset: 32)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1658, file: !4, line: 3888, baseType: !1014, size: 32, align: 32, offset: 64)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1658, file: !4, line: 3889, baseType: !1014, size: 32, align: 32, offset: 96)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1658, file: !4, line: 3890, baseType: !1014, size: 32, align: 32, offset: 128)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1658, file: !4, line: 3897, baseType: !1666, size: 768, align: 64, offset: 192)
!1666 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1667)
!1667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1668)
!1668 = !{!1669, !1670}
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1667, file: !4, line: 3855, baseType: !1399, size: 512, align: 64)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1667, file: !4, line: 3857, baseType: !1403, size: 256, align: 32, offset: 512)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1658, file: !4, line: 3903, baseType: !1672, size: 256, align: 64, offset: 960)
!1672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 256, align: 64, elements: !1120)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1658, file: !4, line: 3904, baseType: !1674, size: 128, align: 32, offset: 1216)
!1674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1014, size: 128, align: 32, elements: !1120)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1658, file: !4, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1658, file: !4, line: 3908, baseType: !1096, size: 64, align: 64, offset: 1408)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1658, file: !4, line: 3915, baseType: !1096, size: 64, align: 64, offset: 1472)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1658, file: !4, line: 3917, baseType: !1014, size: 32, align: 32, offset: 1536)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1648, file: !4, line: 3926, baseType: !1015, size: 64, align: 64, offset: 192)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1586, file: !4, line: 3564, baseType: !1681, size: 64, align: 64, offset: 1344)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DISubroutineType(types: !1683)
!1683 = !{!1014, !1576, !1335, !1684, !1150}
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1395)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1586, file: !4, line: 3566, baseType: !1687, size: 64, align: 64, offset: 1408)
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64, align: 64)
!1688 = !DISubroutineType(types: !1689)
!1689 = !{!1014, !1576, !1020, !1150, !1335}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1586, file: !4, line: 3567, baseType: !1623, size: 64, align: 64, offset: 1472)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1586, file: !4, line: 3576, baseType: !1692, size: 64, align: 64, offset: 1536)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DISubroutineType(types: !1694)
!1694 = !{!1014, !1576, !1684}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1586, file: !4, line: 3577, baseType: !1696, size: 64, align: 64, offset: 1600)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{!1014, !1576, !1335}
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1586, file: !4, line: 3584, baseType: !1700, size: 64, align: 64, offset: 1664)
!1700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1701, size: 64, align: 64)
!1701 = !DISubroutineType(types: !1702)
!1702 = !{!1014, !1576, !1394}
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1586, file: !4, line: 3589, baseType: !1704, size: 64, align: 64, offset: 1728)
!1704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1705, size: 64, align: 64)
!1705 = !DISubroutineType(types: !1706)
!1706 = !{null, !1576}
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1586, file: !4, line: 3594, baseType: !1014, size: 32, align: 32, offset: 1792)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1586, file: !4, line: 3600, baseType: !1199, size: 64, align: 64, offset: 1856)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1586, file: !4, line: 3609, baseType: !1710, size: 64, align: 64, offset: 1920)
!1710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1711, size: 64, align: 64)
!1711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1712, size: 64, align: 64)
!1712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1713)
!1713 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1578, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1578, file: !4, line: 1581, baseType: !1006, size: 32, align: 32, offset: 224)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1578, file: !4, line: 1583, baseType: !1020, size: 64, align: 64, offset: 256)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1578, file: !4, line: 1591, baseType: !1718, size: 64, align: 64, offset: 320)
!1718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1719, size: 64, align: 64)
!1719 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1578, file: !4, line: 1598, baseType: !1020, size: 64, align: 64, offset: 384)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1578, file: !4, line: 1606, baseType: !1015, size: 64, align: 64, offset: 448)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1578, file: !4, line: 1614, baseType: !1014, size: 32, align: 32, offset: 512)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1578, file: !4, line: 1622, baseType: !1014, size: 32, align: 32, offset: 544)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1578, file: !4, line: 1628, baseType: !1014, size: 32, align: 32, offset: 576)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1578, file: !4, line: 1636, baseType: !1014, size: 32, align: 32, offset: 608)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1578, file: !4, line: 1643, baseType: !1014, size: 32, align: 32, offset: 640)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1578, file: !4, line: 1657, baseType: !1017, size: 64, align: 64, offset: 704)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1578, file: !4, line: 1658, baseType: !1014, size: 32, align: 32, offset: 768)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1578, file: !4, line: 1679, baseType: !1035, size: 64, align: 32, offset: 800)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1578, file: !4, line: 1688, baseType: !1014, size: 32, align: 32, offset: 864)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1578, file: !4, line: 1712, baseType: !1014, size: 32, align: 32, offset: 896)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1578, file: !4, line: 1729, baseType: !1014, size: 32, align: 32, offset: 928)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1578, file: !4, line: 1729, baseType: !1014, size: 32, align: 32, offset: 960)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1578, file: !4, line: 1744, baseType: !1014, size: 32, align: 32, offset: 992)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1578, file: !4, line: 1744, baseType: !1014, size: 32, align: 32, offset: 1024)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1578, file: !4, line: 1751, baseType: !1014, size: 32, align: 32, offset: 1056)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1578, file: !4, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1578, file: !4, line: 1791, baseType: !1739, size: 64, align: 64, offset: 1152)
!1739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1740, size: 64, align: 64)
!1740 = !DISubroutineType(types: !1741)
!1741 = !{null, !1742, !1684, !1150, !1014, !1014, !1014}
!1742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64, align: 64)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1578, file: !4, line: 1808, baseType: !1744, size: 64, align: 64, offset: 1216)
!1744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1745, size: 64, align: 64)
!1745 = !DISubroutineType(types: !1746)
!1746 = !{!667, !1742, !1597}
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1578, file: !4, line: 1816, baseType: !1014, size: 32, align: 32, offset: 1280)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1578, file: !4, line: 1825, baseType: !1749, size: 32, align: 32, offset: 1312)
!1749 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1578, file: !4, line: 1830, baseType: !1014, size: 32, align: 32, offset: 1344)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1578, file: !4, line: 1838, baseType: !1749, size: 32, align: 32, offset: 1376)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1578, file: !4, line: 1846, baseType: !1014, size: 32, align: 32, offset: 1408)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1578, file: !4, line: 1851, baseType: !1014, size: 32, align: 32, offset: 1440)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1578, file: !4, line: 1861, baseType: !1749, size: 32, align: 32, offset: 1472)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1578, file: !4, line: 1868, baseType: !1749, size: 32, align: 32, offset: 1504)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1578, file: !4, line: 1875, baseType: !1749, size: 32, align: 32, offset: 1536)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1578, file: !4, line: 1882, baseType: !1749, size: 32, align: 32, offset: 1568)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1578, file: !4, line: 1889, baseType: !1749, size: 32, align: 32, offset: 1600)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1578, file: !4, line: 1896, baseType: !1749, size: 32, align: 32, offset: 1632)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1578, file: !4, line: 1903, baseType: !1749, size: 32, align: 32, offset: 1664)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1578, file: !4, line: 1910, baseType: !1014, size: 32, align: 32, offset: 1696)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1578, file: !4, line: 1915, baseType: !1014, size: 32, align: 32, offset: 1728)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1578, file: !4, line: 1926, baseType: !1150, size: 64, align: 64, offset: 1792)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1578, file: !4, line: 1935, baseType: !1035, size: 64, align: 32, offset: 1856)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1578, file: !4, line: 1942, baseType: !1014, size: 32, align: 32, offset: 1920)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1578, file: !4, line: 1948, baseType: !1014, size: 32, align: 32, offset: 1952)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1578, file: !4, line: 1954, baseType: !1014, size: 32, align: 32, offset: 1984)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1578, file: !4, line: 1960, baseType: !1014, size: 32, align: 32, offset: 2016)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1578, file: !4, line: 1984, baseType: !1014, size: 32, align: 32, offset: 2048)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1578, file: !4, line: 1991, baseType: !1014, size: 32, align: 32, offset: 2080)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1578, file: !4, line: 1996, baseType: !1014, size: 32, align: 32, offset: 2112)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1578, file: !4, line: 2004, baseType: !1014, size: 32, align: 32, offset: 2144)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1578, file: !4, line: 2011, baseType: !1014, size: 32, align: 32, offset: 2176)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1578, file: !4, line: 2018, baseType: !1014, size: 32, align: 32, offset: 2208)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1578, file: !4, line: 2027, baseType: !1014, size: 32, align: 32, offset: 2240)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1578, file: !4, line: 2034, baseType: !1014, size: 32, align: 32, offset: 2272)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1578, file: !4, line: 2044, baseType: !1014, size: 32, align: 32, offset: 2304)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1578, file: !4, line: 2054, baseType: !1779, size: 64, align: 64, offset: 2368)
!1779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1578, file: !4, line: 2061, baseType: !1779, size: 64, align: 64, offset: 2432)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1578, file: !4, line: 2066, baseType: !1014, size: 32, align: 32, offset: 2496)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1578, file: !4, line: 2070, baseType: !1014, size: 32, align: 32, offset: 2528)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1578, file: !4, line: 2078, baseType: !1014, size: 32, align: 32, offset: 2560)
