; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dirac.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dirac.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.dirac_source_params = type { i32, i32, i8, i8, i8, i8, i8, i16, i16, i16, i16, i8, i8 }
%struct.AVRational = type { i32, i32 }
%struct.anon = type { i8, i32 }
%struct.anon.0 = type { i32, i32, i32 }
%struct.AVDiracSeqHeader = type { i32, i32, i8, i8, i8, i8, i8, i16, i16, i16, i16, i8, i8, i32, i32, %struct.AVRational, %struct.AVRational, i32, i32, i32, i32, i32, %struct.DiracVersionInfo, i32 }
%struct.DiracVersionInfo = type { i32, i32 }
%struct.GetBitContext = type { i8*, i8*, i32, i32, i32 }
%union.unaligned_32 = type { i32 }

@.str = private unnamed_addr constant [32 x i8] c"Stream is old and may not work\0A\00", align 1
@.str.1 = private unnamed_addr constant [36 x i8] c"Stream may have unhandled features\0A\00", align 1

!209 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorPrimaries", file: !4, line: 440, size: 32, align: 32, elements: !210)
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226}
!211 = !DIEnumerator(name: "AVCOL_PRI_RESERVED0", value: 0)
!212 = !DIEnumerator(name: "AVCOL_PRI_BT709", value: 1)
!213 = !DIEnumerator(name: "AVCOL_PRI_UNSPECIFIED", value: 2)
!214 = !DIEnumerator(name: "AVCOL_PRI_RESERVED", value: 3)
!215 = !DIEnumerator(name: "AVCOL_PRI_BT470M", value: 4)
!216 = !DIEnumerator(name: "AVCOL_PRI_BT470BG", value: 5)
!217 = !DIEnumerator(name: "AVCOL_PRI_SMPTE170M", value: 6)
!218 = !DIEnumerator(name: "AVCOL_PRI_SMPTE240M", value: 7)
!219 = !DIEnumerator(name: "AVCOL_PRI_FILM", value: 8)
!220 = !DIEnumerator(name: "AVCOL_PRI_BT2020", value: 9)
!221 = !DIEnumerator(name: "AVCOL_PRI_SMPTE428", value: 10)
!222 = !DIEnumerator(name: "AVCOL_PRI_SMPTEST428_1", value: 10)
!223 = !DIEnumerator(name: "AVCOL_PRI_SMPTE431", value: 11)
!224 = !DIEnumerator(name: "AVCOL_PRI_SMPTE432", value: 12)
!225 = !DIEnumerator(name: "AVCOL_PRI_JEDEC_P22", value: 22)
!226 = !DIEnumerator(name: "AVCOL_PRI_NB", value: 23)
!227 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorTransferCharacteristic", file: !4, line: 464, size: 32, align: 32, elements: !228)
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250}
!229 = !DIEnumerator(name: "AVCOL_TRC_RESERVED0", value: 0)
!230 = !DIEnumerator(name: "AVCOL_TRC_BT709", value: 1)
!231 = !DIEnumerator(name: "AVCOL_TRC_UNSPECIFIED", value: 2)
!232 = !DIEnumerator(name: "AVCOL_TRC_RESERVED", value: 3)
!233 = !DIEnumerator(name: "AVCOL_TRC_GAMMA22", value: 4)
!234 = !DIEnumerator(name: "AVCOL_TRC_GAMMA28", value: 5)
!235 = !DIEnumerator(name: "AVCOL_TRC_SMPTE170M", value: 6)
!236 = !DIEnumerator(name: "AVCOL_TRC_SMPTE240M", value: 7)
!237 = !DIEnumerator(name: "AVCOL_TRC_LINEAR", value: 8)
!238 = !DIEnumerator(name: "AVCOL_TRC_LOG", value: 9)
!239 = !DIEnumerator(name: "AVCOL_TRC_LOG_SQRT", value: 10)
!240 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_4", value: 11)
!241 = !DIEnumerator(name: "AVCOL_TRC_BT1361_ECG", value: 12)
!242 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_1", value: 13)
!243 = !DIEnumerator(name: "AVCOL_TRC_BT2020_10", value: 14)
!244 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!245 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!246 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!247 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!248 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!249 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!250 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!251 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !4, line: 493, size: 32, align: 32, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269}
!253 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!254 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!255 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!256 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!257 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!258 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!259 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!260 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!261 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!262 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!263 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!264 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!265 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!266 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!267 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!268 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!269 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!270 = !{!271, !272, !273, !279}
!271 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!272 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !276, line: 221, size: 32, align: 8, elements: !277)
!276 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!277 = !{!278}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !275, file: !276, line: 221, baseType: !279, size: 32, align: 32)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !280, line: 51, baseType: !272)
!280 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!281 = !{!282, !308, !319, !323, !332, !337, !347}
!282 = distinct !DIGlobalVariable(name: "dirac_source_parameters_defaults", scope: !0, file: !283, line: 60, type: !284, isLocal: true, isDefinition: true, variable: [21 x %struct.dirac_source_params]* @dirac_source_parameters_defaults)
!283 = !DIFile(filename: "libavcodec/dirac.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 4032, align: 32, elements: !306)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "dirac_source_params", file: !283, line: 57, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirac_source_params", file: !283, line: 39, size: 192, align: 32, elements: !288)
!288 = !{!289, !290, !291, !294, !295, !296, !297, !298, !301, !302, !303, !304, !305}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !287, file: !283, line: 40, baseType: !272, size: 32, align: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !287, file: !283, line: 41, baseType: !272, size: 32, align: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format", scope: !287, file: !283, line: 42, baseType: !292, size: 8, align: 8, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !280, line: 48, baseType: !293)
!293 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !287, file: !283, line: 44, baseType: !292, size: 8, align: 8, offset: 72)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !287, file: !283, line: 45, baseType: !292, size: 8, align: 8, offset: 80)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate_index", scope: !287, file: !283, line: 47, baseType: !292, size: 8, align: 8, offset: 88)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_index", scope: !287, file: !283, line: 48, baseType: !292, size: 8, align: 8, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "clean_width", scope: !287, file: !283, line: 50, baseType: !299, size: 16, align: 16, offset: 112)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !280, line: 49, baseType: !300)
!300 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "clean_height", scope: !287, file: !283, line: 51, baseType: !299, size: 16, align: 16, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "clean_left_offset", scope: !287, file: !283, line: 52, baseType: !299, size: 16, align: 16, offset: 144)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "clean_right_offset", scope: !287, file: !283, line: 53, baseType: !299, size: 16, align: 16, offset: 160)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_range_index", scope: !287, file: !283, line: 55, baseType: !292, size: 8, align: 8, offset: 176)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "color_spec_index", scope: !287, file: !283, line: 56, baseType: !292, size: 8, align: 8, offset: 184)
!306 = !{!307}
!307 = !DISubrange(count: 21)
!308 = distinct !DIGlobalVariable(name: "dirac_frame_rate", scope: !0, file: !283, line: 99, type: !309, isLocal: true, isDefinition: true, variable: [2 x %struct.AVRational]* @dirac_frame_rate)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 128, align: 32, elements: !317)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !312, line: 61, baseType: !313)
!312 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !312, line: 58, size: 64, align: 32, elements: !314)
!314 = !{!315, !316}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !313, file: !312, line: 59, baseType: !271, size: 32, align: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !313, file: !312, line: 60, baseType: !271, size: 32, align: 32, offset: 32)
!317 = !{!318}
!318 = !DISubrange(count: 2)
!319 = distinct !DIGlobalVariable(name: "dirac_preset_aspect_ratios", scope: !0, file: !283, line: 87, type: !320, isLocal: true, isDefinition: true, variable: [6 x %struct.AVRational]* @dirac_preset_aspect_ratios)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 384, align: 32, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 6)
!323 = distinct !DIGlobalVariable(name: "pixel_range_presets", scope: !0, file: !283, line: 109, type: !324, isLocal: true, isDefinition: true, variable: [4 x %struct.anon]* @pixel_range_presets)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 256, align: 32, elements: !330)
!325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !283, line: 106, size: 64, align: 32, elements: !327)
!327 = !{!328, !329}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth", scope: !326, file: !283, line: 107, baseType: !292, size: 8, align: 8)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !326, file: !283, line: 108, baseType: !203, size: 32, align: 32, offset: 32)
!330 = !{!331}
!331 = !DISubrange(count: 4)
!332 = distinct !DIGlobalVariable(name: "dirac_pix_fmt", scope: !0, file: !283, line: 135, type: !333, isLocal: true, isDefinition: true, variable: [3 x [3 x i32]]* @dirac_pix_fmt)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 288, align: 32, elements: !335)
!334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!335 = !{!336, !336}
!336 = !DISubrange(count: 3)
!337 = distinct !DIGlobalVariable(name: "dirac_color_presets", scope: !0, file: !283, line: 126, type: !338, isLocal: true, isDefinition: true, variable: [5 x %struct.anon.0]* @dirac_color_presets)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 480, align: 32, elements: !345)
!339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !283, line: 122, size: 96, align: 32, elements: !341)
!341 = !{!342, !343, !344}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !340, file: !283, line: 123, baseType: !209, size: 32, align: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !340, file: !283, line: 124, baseType: !251, size: 32, align: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !340, file: !283, line: 125, baseType: !227, size: 32, align: 32, offset: 64)
!345 = !{!346}
!346 = !DISubrange(count: 5)
!347 = distinct !DIGlobalVariable(name: "dirac_primaries", scope: !0, file: !283, line: 116, type: !348, isLocal: true, isDefinition: true, variable: [3 x i32]* @dirac_primaries)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 96, align: 32, elements: !350)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!350 = !{!336}
!351 = !{i32 2, !"Dwarf Version", i32 4}
!352 = !{i32 2, !"Debug Info Version", i32 3}
!353 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!354 = distinct !DISubprogram(name: "av_dirac_parse_sequence_header", scope: !283, file: !283, line: 325, type: !355, isLocal: false, isDefinition: true, scopeLine: 328, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !398)
!355 = !DISubroutineType(types: !356)
!356 = !{!271, !357, !392, !394, !397}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDiracSeqHeader", file: !360, line: 114, baseType: !361)
!360 = !DIFile(filename: "libavcodec/dirac.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDiracSeqHeader", file: !360, line: 81, size: 640, align: 32, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !391}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !361, file: !360, line: 82, baseType: !272, size: 32, align: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !361, file: !360, line: 83, baseType: !272, size: 32, align: 32, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format", scope: !361, file: !360, line: 84, baseType: !292, size: 8, align: 8, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !361, file: !360, line: 86, baseType: !292, size: 8, align: 8, offset: 72)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !361, file: !360, line: 87, baseType: !292, size: 8, align: 8, offset: 80)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate_index", scope: !361, file: !360, line: 89, baseType: !292, size: 8, align: 8, offset: 88)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_index", scope: !361, file: !360, line: 90, baseType: !292, size: 8, align: 8, offset: 96)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "clean_width", scope: !361, file: !360, line: 92, baseType: !299, size: 16, align: 16, offset: 112)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "clean_height", scope: !361, file: !360, line: 93, baseType: !299, size: 16, align: 16, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "clean_left_offset", scope: !361, file: !360, line: 94, baseType: !299, size: 16, align: 16, offset: 144)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "clean_right_offset", scope: !361, file: !360, line: 95, baseType: !299, size: 16, align: 16, offset: 160)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_range_index", scope: !361, file: !360, line: 97, baseType: !292, size: 8, align: 8, offset: 176)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "color_spec_index", scope: !361, file: !360, line: 98, baseType: !292, size: 8, align: 8, offset: 184)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !361, file: !360, line: 100, baseType: !271, size: 32, align: 32, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !361, file: !360, line: 101, baseType: !271, size: 32, align: 32, offset: 224)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !361, file: !360, line: 103, baseType: !311, size: 64, align: 32, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !361, file: !360, line: 104, baseType: !311, size: 64, align: 32, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !361, file: !360, line: 106, baseType: !3, size: 32, align: 32, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !361, file: !360, line: 107, baseType: !203, size: 32, align: 32, offset: 416)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !361, file: !360, line: 108, baseType: !209, size: 32, align: 32, offset: 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !361, file: !360, line: 109, baseType: !227, size: 32, align: 32, offset: 480)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !361, file: !360, line: 110, baseType: !251, size: 32, align: 32, offset: 512)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !361, file: !360, line: 112, baseType: !386, size: 64, align: 32, offset: 544)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "DiracVersionInfo", file: !360, line: 79, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DiracVersionInfo", file: !360, line: 76, size: 64, align: 32, elements: !388)
!388 = !{!389, !390}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !387, file: !360, line: 77, baseType: !271, size: 32, align: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !387, file: !360, line: 78, baseType: !271, size: 32, align: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !361, file: !360, line: 113, baseType: !271, size: 32, align: 32, offset: 608)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !395, line: 216, baseType: !396)
!395 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!396 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!398 = !{}
!399 = !DILocalVariable(name: "pdsh", arg: 1, scope: !354, file: !283, line: 325, type: !357)
!400 = !DIExpression()
!401 = !DILocation(line: 325, column: 55, scope: !354)
!402 = !DILocalVariable(name: "buf", arg: 2, scope: !354, file: !283, line: 326, type: !392)
!403 = !DILocation(line: 326, column: 51, scope: !354)
!404 = !DILocalVariable(name: "buf_size", arg: 3, scope: !354, file: !283, line: 326, type: !394)
!405 = !DILocation(line: 326, column: 63, scope: !354)
!406 = !DILocalVariable(name: "log_ctx", arg: 4, scope: !354, file: !283, line: 327, type: !397)
!407 = !DILocation(line: 327, column: 42, scope: !354)
!408 = !DILocalVariable(name: "dsh", scope: !354, file: !283, line: 329, type: !358)
!409 = !DILocation(line: 329, column: 23, scope: !354)
!410 = !DILocalVariable(name: "gb", scope: !354, file: !283, line: 330, type: !411)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !412, line: 70, baseType: !413)
!412 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !412, line: 61, size: 256, align: 64, elements: !414)
!414 = !{!415, !416, !417, !418, !419}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !413, file: !412, line: 62, baseType: !392, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !413, file: !412, line: 62, baseType: !392, size: 64, align: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !413, file: !412, line: 67, baseType: !271, size: 32, align: 32, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !413, file: !412, line: 68, baseType: !271, size: 32, align: 32, offset: 160)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !413, file: !412, line: 69, baseType: !271, size: 32, align: 32, offset: 192)
!420 = !DILocation(line: 330, column: 19, scope: !354)
!421 = !DILocalVariable(name: "video_format", scope: !354, file: !283, line: 331, type: !272)
!422 = !DILocation(line: 331, column: 14, scope: !354)
!423 = !DILocalVariable(name: "picture_coding_mode", scope: !354, file: !283, line: 331, type: !272)
!424 = !DILocation(line: 331, column: 28, scope: !354)
!425 = !DILocalVariable(name: "ret", scope: !354, file: !283, line: 332, type: !271)
!426 = !DILocation(line: 332, column: 9, scope: !354)
!427 = !DILocation(line: 334, column: 11, scope: !354)
!428 = !DILocation(line: 334, column: 9, scope: !354)
!429 = !DILocation(line: 335, column: 10, scope: !430)
!430 = distinct !DILexicalBlock(scope: !354, file: !283, line: 335, column: 9)
!431 = !DILocation(line: 335, column: 9, scope: !354)
!432 = !DILocation(line: 336, column: 9, scope: !430)
!433 = !DILocation(line: 338, column: 31, scope: !354)
!434 = !DILocation(line: 338, column: 36, scope: !354)
!435 = !DILocation(line: 338, column: 11, scope: !354)
!436 = !DILocation(line: 338, column: 9, scope: !354)
!437 = !DILocation(line: 339, column: 9, scope: !438)
!438 = distinct !DILexicalBlock(scope: !354, file: !283, line: 339, column: 9)
!439 = !DILocation(line: 339, column: 13, scope: !438)
!440 = !DILocation(line: 339, column: 9, scope: !354)
!441 = !DILocation(line: 340, column: 9, scope: !438)
!442 = !DILocation(line: 343, column: 26, scope: !354)
!443 = !DILocation(line: 343, column: 5, scope: !354)
!444 = !DILocation(line: 343, column: 10, scope: !354)
!445 = !DILocation(line: 343, column: 18, scope: !354)
!446 = !DILocation(line: 343, column: 24, scope: !354)
!447 = !DILocation(line: 344, column: 26, scope: !354)
!448 = !DILocation(line: 344, column: 5, scope: !354)
!449 = !DILocation(line: 344, column: 10, scope: !354)
!450 = !DILocation(line: 344, column: 18, scope: !354)
!451 = !DILocation(line: 344, column: 24, scope: !354)
!452 = !DILocation(line: 345, column: 20, scope: !354)
!453 = !DILocation(line: 345, column: 5, scope: !354)
!454 = !DILocation(line: 345, column: 10, scope: !354)
!455 = !DILocation(line: 345, column: 18, scope: !354)
!456 = !DILocation(line: 346, column: 18, scope: !354)
!457 = !DILocation(line: 346, column: 5, scope: !354)
!458 = !DILocation(line: 346, column: 10, scope: !354)
!459 = !DILocation(line: 346, column: 16, scope: !354)
!460 = !DILocation(line: 349, column: 20, scope: !354)
!461 = !DILocation(line: 349, column: 18, scope: !354)
!462 = !DILocation(line: 351, column: 9, scope: !463)
!463 = distinct !DILexicalBlock(scope: !354, file: !283, line: 351, column: 9)
!464 = !DILocation(line: 351, column: 14, scope: !463)
!465 = !DILocation(line: 351, column: 22, scope: !463)
!466 = !DILocation(line: 351, column: 28, scope: !463)
!467 = !DILocation(line: 351, column: 32, scope: !463)
!468 = !DILocation(line: 351, column: 35, scope: !469)
!469 = !DILexicalBlockFile(scope: !463, file: !283, discriminator: 1)
!470 = !DILocation(line: 351, column: 9, scope: !469)
!471 = !DILocation(line: 352, column: 16, scope: !463)
!472 = !DILocation(line: 352, column: 9, scope: !463)
!473 = !DILocation(line: 353, column: 14, scope: !474)
!474 = distinct !DILexicalBlock(scope: !463, file: !283, line: 353, column: 14)
!475 = !DILocation(line: 353, column: 19, scope: !474)
!476 = !DILocation(line: 353, column: 27, scope: !474)
!477 = !DILocation(line: 353, column: 33, scope: !474)
!478 = !DILocation(line: 353, column: 37, scope: !474)
!479 = !DILocation(line: 353, column: 40, scope: !480)
!480 = !DILexicalBlockFile(scope: !474, file: !283, discriminator: 1)
!481 = !DILocation(line: 353, column: 14, scope: !480)
!482 = !DILocation(line: 354, column: 16, scope: !474)
!483 = !DILocation(line: 354, column: 9, scope: !474)
!484 = !DILocation(line: 356, column: 9, scope: !485)
