; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--cache.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--cache.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !46, globals: !65)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--cache.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVOptionType", file: !4, line: 221, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavutil/opt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!6 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!7 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!8 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!9 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!10 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!11 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!12 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!13 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!14 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!15 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!16 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!17 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!18 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!19 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!20 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!21 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!22 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!23 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!24 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 29, size: 32, align: 32, elements: !27)
!26 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!28 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!29 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!30 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!31 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!32 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!33 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!34 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!35 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!36 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!37 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!38 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!39 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!40 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!41 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!42 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!43 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!44 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!45 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!46 = !{!47, !48, !49, !50, !51, !56}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!49 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!50 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !54, line: 197, baseType: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!55 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheEntry", file: !59, line: 52, baseType: !60)
!59 = !DIFile(filename: "libavformat/cache.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CacheEntry", file: !59, line: 48, size: 192, align: 64, elements: !61)
!61 = !{!62, !63, !64}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "logical_pos", scope: !60, file: !59, line: 49, baseType: !53, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "physical_pos", scope: !60, file: !59, line: 50, baseType: !53, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !60, file: !59, line: 51, baseType: !49, size: 32, align: 32, offset: 128)
!65 = !{!66, !270, !271}
!66 = distinct !DIGlobalVariable(name: "ff_cache_protocol", scope: !0, file: !59, line: 322, type: !67, isLocal: false, isDefinition: true, variable: { i8*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }* @ff_cache_protocol)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLProtocol", file: !69, line: 100, baseType: !70)
!69 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !69, line: 54, size: 1600, align: 64, elements: !71)
!71 = !{!72, !76, !187, !196, !201, !205, !211, !217, !221, !222, !226, !230, !231, !237, !238, !239, !240, !241, !242, !243, !244, !263, !264, !265, !269}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !70, file: !69, line: 55, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !70, file: !69, line: 56, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!49, !80, !73, !49}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !69, line: 52, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !69, line: 38, size: 768, align: 64, elements: !83)
!83 = !{!84, !163, !166, !167, !169, !170, !171, !172, !173, !183, !184, !185, !186}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !82, file: !69, line: 39, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !89)
!89 = !{!90, !91, !95, !122, !123, !124, !125, !129, !135, !137, !141}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !88, file: !26, line: 72, baseType: !73, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !88, file: !26, line: 78, baseType: !92, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!73, !48}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !88, file: !26, line: 85, baseType: !96, size: 64, align: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !99)
!99 = !{!100, !101, !102, !103, !104, !118, !119, !120, !121}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !98, file: !4, line: 247, baseType: !73, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !98, file: !4, line: 253, baseType: !73, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !98, file: !4, line: 259, baseType: !49, size: 32, align: 32, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !98, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !98, file: !4, line: 271, baseType: !105, size: 64, align: 64, offset: 192)
!105 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !98, file: !4, line: 265, size: 64, align: 64, elements: !106)
!106 = !{!107, !108, !110, !111}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !105, file: !4, line: 266, baseType: !53, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !105, file: !4, line: 267, baseType: !109, size: 64, align: 64)
!109 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !105, file: !4, line: 268, baseType: !73, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !105, file: !4, line: 270, baseType: !112, size: 64, align: 32)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !113, line: 61, baseType: !114)
!113 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !113, line: 58, size: 64, align: 32, elements: !115)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !114, file: !113, line: 59, baseType: !49, size: 32, align: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !114, file: !113, line: 60, baseType: !49, size: 32, align: 32, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !98, file: !4, line: 272, baseType: !109, size: 64, align: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !98, file: !4, line: 273, baseType: !109, size: 64, align: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !98, file: !4, line: 275, baseType: !49, size: 32, align: 32, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !98, file: !4, line: 300, baseType: !73, size: 64, align: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !88, file: !26, line: 93, baseType: !49, size: 32, align: 32, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !88, file: !26, line: 99, baseType: !49, size: 32, align: 32, offset: 224)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !88, file: !26, line: 108, baseType: !49, size: 32, align: 32, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !88, file: !26, line: 113, baseType: !126, size: 64, align: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!48, !48, !48}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !88, file: !26, line: 123, baseType: !130, size: 64, align: 64, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!133, !133}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !88, file: !26, line: 130, baseType: !136, size: 32, align: 32, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !88, file: !26, line: 136, baseType: !138, size: 64, align: 64, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!136, !48}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !88, file: !26, line: 142, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!49, !145, !48, !73, !49}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !148)
!148 = !{!149, !161, !162}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !147, file: !4, line: 360, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !154)
!154 = !{!155, !156, !157, !158, !159, !160}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !153, file: !4, line: 307, baseType: !73, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !153, file: !4, line: 313, baseType: !109, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !153, file: !4, line: 313, baseType: !109, size: 64, align: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !153, file: !4, line: 318, baseType: !109, size: 64, align: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !153, file: !4, line: 318, baseType: !109, size: 64, align: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !153, file: !4, line: 323, baseType: !49, size: 32, align: 32, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !147, file: !4, line: 364, baseType: !49, size: 32, align: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !147, file: !4, line: 368, baseType: !49, size: 32, align: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !82, file: !69, line: 40, baseType: !164, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !82, file: !69, line: 41, baseType: !48, size: 64, align: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !82, file: !69, line: 42, baseType: !168, size: 64, align: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !82, file: !69, line: 43, baseType: !49, size: 32, align: 32, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !82, file: !69, line: 44, baseType: !49, size: 32, align: 32, offset: 288)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !82, file: !69, line: 45, baseType: !49, size: 32, align: 32, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !82, file: !69, line: 46, baseType: !49, size: 32, align: 32, offset: 352)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !82, file: !69, line: 47, baseType: !174, size: 128, align: 64, offset: 384)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !175, line: 61, baseType: !176)
!175 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !175, line: 58, size: 128, align: 64, elements: !177)
!177 = !{!178, !182}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !176, file: !175, line: 59, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!49, !48}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !176, file: !175, line: 60, baseType: !48, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !82, file: !69, line: 48, baseType: !53, size: 64, align: 64, offset: 512)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !82, file: !69, line: 49, baseType: !73, size: 64, align: 64, offset: 576)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !82, file: !69, line: 50, baseType: !73, size: 64, align: 64, offset: 640)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !82, file: !69, line: 51, baseType: !49, size: 32, align: 32, offset: 704)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !70, file: !69, line: 62, baseType: !188, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!49, !80, !73, !49, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !194, line: 86, baseType: !195)
!194 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !194, line: 86, flags: DIFlagFwdDecl)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !70, file: !69, line: 63, baseType: !197, size: 64, align: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!49, !80, !200}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !70, file: !69, line: 64, baseType: !202, size: 64, align: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!49, !80}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !70, file: !69, line: 78, baseType: !206, size: 64, align: 64, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!49, !80, !209, !49}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !70, file: !69, line: 79, baseType: !212, size: 64, align: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!49, !80, !215, !49}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !70, file: !69, line: 80, baseType: !218, size: 64, align: 64, offset: 448)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!53, !80, !53, !49}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !70, file: !69, line: 81, baseType: !202, size: 64, align: 64, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !70, file: !69, line: 82, baseType: !223, size: 64, align: 64, offset: 576)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!49, !80, !49}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !70, file: !69, line: 83, baseType: !227, size: 64, align: 64, offset: 640)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!53, !80, !49, !53, !49}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !70, file: !69, line: 85, baseType: !202, size: 64, align: 64, offset: 704)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !70, file: !69, line: 86, baseType: !232, size: 64, align: 64, offset: 768)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!49, !80, !235, !236}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !70, file: !69, line: 88, baseType: !202, size: 64, align: 64, offset: 832)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !70, file: !69, line: 89, baseType: !223, size: 64, align: 64, offset: 896)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !70, file: !69, line: 90, baseType: !49, size: 32, align: 32, offset: 960)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !70, file: !69, line: 91, baseType: !85, size: 64, align: 64, offset: 1024)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !70, file: !69, line: 92, baseType: !49, size: 32, align: 32, offset: 1088)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !70, file: !69, line: 93, baseType: !223, size: 64, align: 64, offset: 1152)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !70, file: !69, line: 94, baseType: !202, size: 64, align: 64, offset: 1216)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !70, file: !69, line: 95, baseType: !245, size: 64, align: 64, offset: 1280)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!49, !80, !248}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !175, line: 101, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !175, line: 86, size: 576, align: 64, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !261, !262}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !251, file: !175, line: 87, baseType: !168, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !251, file: !175, line: 88, baseType: !49, size: 32, align: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !251, file: !175, line: 89, baseType: !49, size: 32, align: 32, offset: 96)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !251, file: !175, line: 91, baseType: !53, size: 64, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !251, file: !175, line: 92, baseType: !53, size: 64, align: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !251, file: !175, line: 94, baseType: !53, size: 64, align: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !251, file: !175, line: 96, baseType: !53, size: 64, align: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !251, file: !175, line: 98, baseType: !53, size: 64, align: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !251, file: !175, line: 99, baseType: !53, size: 64, align: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !251, file: !175, line: 100, baseType: !53, size: 64, align: 64, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !70, file: !69, line: 96, baseType: !202, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !70, file: !69, line: 97, baseType: !202, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !70, file: !69, line: 98, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!49, !80, !80}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !70, file: !69, line: 99, baseType: !73, size: 64, align: 64, offset: 1536)
!270 = distinct !DIGlobalVariable(name: "cache_context_class", scope: !0, file: !59, line: 315, type: !86, isLocal: true, isDefinition: true, variable: %struct.AVClass* @cache_context_class)
!271 = distinct !DIGlobalVariable(name: "options", scope: !0, file: !59, line: 310, type: !272, isLocal: true, isDefinition: true, variable: [2 x %struct.AVOption]* @options)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 1024, align: 64, elements: !275)
!273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !4, line: 301, baseType: !98)
!275 = !{!276}
!276 = !DISubrange(count: 2)
!277 = !{i32 2, !"Dwarf Version", i32 4}
!278 = !{i32 2, !"Debug Info Version", i32 3}
!279 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!280 = distinct !DISubprogram(name: "cache_open", scope: !59, file: !59, line: 73, type: !189, isLocal: true, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !281)
!281 = !{}
!282 = !DILocalVariable(name: "h", arg: 1, scope: !280, file: !59, line: 73, type: !80)
!283 = !DIExpression()
!284 = !DILocation(line: 73, column: 35, scope: !280)
!285 = !DILocalVariable(name: "arg", arg: 2, scope: !280, file: !59, line: 73, type: !73)
!286 = !DILocation(line: 73, column: 50, scope: !280)
!287 = !DILocalVariable(name: "flags", arg: 3, scope: !280, file: !59, line: 73, type: !49)
!288 = !DILocation(line: 73, column: 59, scope: !280)
!289 = !DILocalVariable(name: "options", arg: 4, scope: !280, file: !59, line: 73, type: !191)
!290 = !DILocation(line: 73, column: 81, scope: !280)
!291 = !DILocalVariable(name: "buffername", scope: !280, file: !59, line: 75, type: !168)
!292 = !DILocation(line: 75, column: 11, scope: !280)
!293 = !DILocalVariable(name: "c", scope: !280, file: !59, line: 76, type: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "Context", file: !59, line: 66, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !59, line: 54, size: 768, align: 64, elements: !297)
!297 = !{!298, !300, !301, !305, !306, !307, !308, !309, !310, !311, !312, !313}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !296, file: !59, line: 55, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !296, file: !59, line: 56, baseType: !49, size: 32, align: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !296, file: !59, line: 57, baseType: !302, size: 64, align: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVTreeNode", file: !304, line: 45, flags: DIFlagFwdDecl)
!304 = !DIFile(filename: "./libavutil/tree.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!305 = !DIDerivedType(tag: DW_TAG_member, name: "logical_pos", scope: !296, file: !59, line: 58, baseType: !53, size: 64, align: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "cache_pos", scope: !296, file: !59, line: 59, baseType: !53, size: 64, align: 64, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "inner_pos", scope: !296, file: !59, line: 60, baseType: !53, size: 64, align: 64, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !296, file: !59, line: 61, baseType: !53, size: 64, align: 64, offset: 384)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "is_true_eof", scope: !296, file: !59, line: 62, baseType: !49, size: 32, align: 32, offset: 448)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !296, file: !59, line: 63, baseType: !80, size: 64, align: 64, offset: 512)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "cache_hit", scope: !296, file: !59, line: 64, baseType: !53, size: 64, align: 64, offset: 576)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "cache_miss", scope: !296, file: !59, line: 64, baseType: !53, size: 64, align: 64, offset: 640)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "read_ahead_limit", scope: !296, file: !59, line: 65, baseType: !49, size: 32, align: 32, offset: 704)
!314 = !DILocation(line: 76, column: 14, scope: !280)
!315 = !DILocation(line: 76, column: 17, scope: !280)
!316 = !DILocation(line: 76, column: 20, scope: !280)
!317 = !DILocation(line: 78, column: 17, scope: !280)
!318 = !DILocation(line: 78, column: 5, scope: !280)
!319 = !DILocation(line: 80, column: 56, scope: !280)
!320 = !DILocation(line: 80, column: 13, scope: !280)
!321 = !DILocation(line: 80, column: 5, scope: !280)
!322 = !DILocation(line: 80, column: 8, scope: !280)
!323 = !DILocation(line: 80, column: 11, scope: !280)
!324 = !DILocation(line: 81, column: 9, scope: !325)
!325 = distinct !DILexicalBlock(scope: !280, file: !59, line: 81, column: 9)
!326 = !DILocation(line: 81, column: 12, scope: !325)
!327 = !DILocation(line: 81, column: 15, scope: !325)
!328 = !DILocation(line: 81, column: 9, scope: !280)
!329 = !DILocation(line: 82, column: 16, scope: !330)
!330 = distinct !DILexicalBlock(scope: !325, file: !59, line: 81, column: 19)
!331 = !DILocation(line: 82, column: 9, scope: !330)
!332 = !DILocation(line: 83, column: 16, scope: !330)
!333 = !DILocation(line: 83, column: 19, scope: !330)
!334 = !DILocation(line: 83, column: 9, scope: !330)
!335 = !DILocation(line: 86, column: 12, scope: !280)
!336 = !DILocation(line: 86, column: 5, scope: !280)
!337 = !DILocation(line: 87, column: 14, scope: !280)
!338 = !DILocation(line: 87, column: 5, scope: !280)
!339 = !DILocation(line: 89, column: 34, scope: !280)
!340 = !DILocation(line: 89, column: 37, scope: !280)
!341 = !DILocation(line: 89, column: 44, scope: !280)
!342 = !DILocation(line: 89, column: 49, scope: !280)
!343 = !DILocation(line: 89, column: 57, scope: !280)
!344 = !DILocation(line: 89, column: 60, scope: !280)
!345 = !DILocation(line: 90, column: 33, scope: !280)
!346 = !DILocation(line: 90, column: 42, scope: !280)
!347 = !DILocation(line: 90, column: 45, scope: !280)
!348 = !DILocation(line: 90, column: 65, scope: !280)
!349 = !DILocation(line: 90, column: 68, scope: !280)
!350 = !DILocation(line: 90, column: 88, scope: !280)
!351 = !DILocation(line: 89, column: 12, scope: !280)
!352 = !DILocation(line: 89, column: 5, scope: !280)
!353 = !DILocation(line: 91, column: 1, scope: !280)
!354 = distinct !DISubprogram(name: "cache_read", scope: !59, file: !59, line: 156, type: !207, isLocal: true, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !281)
!355 = !DILocalVariable(name: "h", arg: 1, scope: !354, file: !59, line: 156, type: !80)
!356 = !DILocation(line: 156, column: 35, scope: !354)
!357 = !DILocalVariable(name: "buf", arg: 2, scope: !354, file: !59, line: 156, type: !209)
!358 = !DILocation(line: 156, column: 53, scope: !354)
!359 = !DILocalVariable(name: "size", arg: 3, scope: !354, file: !59, line: 156, type: !49)
!360 = !DILocation(line: 156, column: 62, scope: !354)
!361 = !DILocalVariable(name: "c", scope: !354, file: !59, line: 158, type: !294)
!362 = !DILocation(line: 158, column: 14, scope: !354)
!363 = !DILocation(line: 158, column: 17, scope: !354)
!364 = !DILocation(line: 158, column: 20, scope: !354)
!365 = !DILocalVariable(name: "entry", scope: !354, file: !59, line: 159, type: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!367 = !DILocation(line: 159, column: 17, scope: !354)
!368 = !DILocalVariable(name: "next", scope: !354, file: !59, line: 159, type: !369)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 128, align: 64, elements: !275)
!370 = !DILocation(line: 159, column: 25, scope: !354)
!371 = !DILocalVariable(name: "r", scope: !354, file: !59, line: 160, type: !53)
!372 = !DILocation(line: 160, column: 13, scope: !354)
!373 = !DILocation(line: 162, column: 26, scope: !354)
!374 = !DILocation(line: 162, column: 29, scope: !354)
!375 = !DILocation(line: 162, column: 36, scope: !354)
