; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--ra144.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--ra144.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!968 = !{i32 2, !"Debug Info Version", i32 3}
!969 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!970 = distinct !DISubprogram(name: "ff_copy_and_dup", scope: !905, file: !905, line: 1530, type: !971, isLocal: false, isDefinition: true, scopeLine: 1531, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !974)
!971 = !DISubroutineType(types: !972)
!972 = !{null, !973, !942, !898}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64, align: 64)
!974 = !{}
!975 = !DILocalVariable(name: "target", arg: 1, scope: !970, file: !905, line: 1530, type: !973)
!976 = !DIExpression()
!977 = !DILocation(line: 1530, column: 31, scope: !970)
!978 = !DILocalVariable(name: "source", arg: 2, scope: !970, file: !905, line: 1530, type: !942)
!979 = !DILocation(line: 1530, column: 54, scope: !970)
!980 = !DILocalVariable(name: "offset", arg: 3, scope: !970, file: !905, line: 1530, type: !898)
!981 = !DILocation(line: 1530, column: 66, scope: !970)
!982 = !DILocation(line: 1532, column: 21, scope: !970)
!983 = !DILocation(line: 1532, column: 19, scope: !970)
!984 = !DILocation(line: 1532, column: 12, scope: !970)
!985 = !DILocation(line: 1534, column: 12, scope: !970)
!986 = !DILocation(line: 1534, column: 5, scope: !970)
!987 = !DILocation(line: 1534, column: 20, scope: !970)
!988 = !DILocation(line: 1534, column: 37, scope: !970)
!989 = !DILocation(line: 1534, column: 34, scope: !970)
!990 = !DILocation(line: 1534, column: 29, scope: !970)
!991 = !DILocation(line: 1534, column: 48, scope: !992)
!992 = !DILexicalBlockFile(scope: !970, file: !905, discriminator: 1)
!993 = !DILocation(line: 1534, column: 29, scope: !992)
!994 = !DILocation(line: 1534, column: 29, scope: !995)
!995 = !DILexicalBlockFile(scope: !970, file: !905, discriminator: 2)
!996 = !DILocation(line: 1534, column: 29, scope: !997)
!997 = !DILexicalBlockFile(scope: !970, file: !905, discriminator: 3)
!998 = !DILocation(line: 1534, column: 28, scope: !997)
!999 = !DILocation(line: 1534, column: 63, scope: !997)
!1000 = !DILocation(line: 1534, column: 5, scope: !997)
!1001 = !DILocation(line: 1535, column: 9, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !970, file: !905, line: 1535, column: 9)
!1003 = !DILocation(line: 1535, column: 16, scope: !1002)
!1004 = !DILocation(line: 1535, column: 9, scope: !970)
!1005 = !DILocation(line: 1536, column: 16, scope: !1002)
!1006 = !DILocation(line: 1536, column: 25, scope: !1002)
!1007 = !DILocation(line: 1536, column: 23, scope: !1002)
!1008 = !DILocation(line: 1536, column: 9, scope: !1002)
!1009 = !DILocation(line: 1536, column: 33, scope: !1002)
!1010 = !DILocation(line: 1536, column: 47, scope: !1002)
!1011 = !DILocation(line: 1536, column: 45, scope: !1002)
!1012 = !DILocation(line: 1536, column: 41, scope: !1002)
!1013 = !DILocation(line: 1536, column: 54, scope: !1002)
!1014 = !DILocation(line: 1537, column: 1, scope: !970)
!1015 = distinct !DISubprogram(name: "ff_eval_refl", scope: !905, file: !905, line: 1545, type: !1016, isLocal: false, isDefinition: true, scopeLine: 1546, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !974)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!898, !1018, !942, !1019}
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1022)
!1022 = !{!1023, !1068, !1069, !1070, !1326, !1327, !1328, !1329, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1355, !1359, !1360, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1540, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1021, file: !35, line: 1561, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1028)
!1028 = !{!1029, !1033, !1038, !1042, !1043, !1044, !1045, !1049, !1055, !1057, !1061}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1027, file: !4, line: 72, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1032)
!1032 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1027, file: !4, line: 78, baseType: !1034, size: 64, align: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!1030, !1037}
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1027, file: !4, line: 85, baseType: !1039, size: 64, align: 64, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1041)
!1041 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1027, file: !4, line: 93, baseType: !898, size: 32, align: 32, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1027, file: !4, line: 99, baseType: !898, size: 32, align: 32, offset: 224)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1027, file: !4, line: 108, baseType: !898, size: 32, align: 32, offset: 256)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1027, file: !4, line: 113, baseType: !1046, size: 64, align: 64, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!1037, !1037, !1037}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1027, file: !4, line: 123, baseType: !1050, size: 64, align: 64, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!1053, !1053}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1027)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1027, file: !4, line: 130, baseType: !1056, size: 32, align: 32, offset: 448)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1027, file: !4, line: 136, baseType: !1058, size: 64, align: 64, offset: 512)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!1056, !1037}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1027, file: !4, line: 142, baseType: !1062, size: 64, align: 64, offset: 576)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!898, !1065, !1037, !1030, !898}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1021, file: !35, line: 1562, baseType: !898, size: 32, align: 32, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1021, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1021, file: !35, line: 1565, baseType: !1071, size: 64, align: 64, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1079, !1080, !1089, !1092, !1095, !1098, !1101, !1102, !1103, !1111, !1112, !1113, !1115, !1119, !1125, !1130, !1134, !1135, !1179, !1297, !1301, !1302, !1306, !1310, !1315, !1319, !1320, !1321}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1073, file: !35, line: 3475, baseType: !1030, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1073, file: !35, line: 3480, baseType: !1030, size: 64, align: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1073, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1073, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1073, file: !35, line: 3487, baseType: !898, size: 32, align: 32, offset: 192)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1073, file: !35, line: 3488, baseType: !1081, size: 64, align: 64, offset: 256)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1083)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1084, line: 61, baseType: !1085)
!1084 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1084, line: 58, size: 64, align: 32, elements: !1086)
!1086 = !{!1087, !1088}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1085, file: !1084, line: 59, baseType: !898, size: 32, align: 32)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1085, file: !1084, line: 60, baseType: !898, size: 32, align: 32, offset: 32)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1073, file: !35, line: 3489, baseType: !1090, size: 64, align: 64, offset: 320)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1073, file: !35, line: 3490, baseType: !1093, size: 64, align: 64, offset: 384)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !898)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1073, file: !35, line: 3491, baseType: !1096, size: 64, align: 64, offset: 448)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1073, file: !35, line: 3492, baseType: !1099, size: 64, align: 64, offset: 512)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1073, file: !35, line: 3493, baseType: !916, size: 8, align: 8, offset: 576)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1073, file: !35, line: 3494, baseType: !1024, size: 64, align: 64, offset: 640)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1073, file: !35, line: 3495, baseType: !1104, size: 64, align: 64, offset: 704)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1106)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1107)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1108)
!1108 = !{!1109, !1110}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1107, file: !35, line: 3402, baseType: !898, size: 32, align: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1107, file: !35, line: 3403, baseType: !1030, size: 64, align: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1073, file: !35, line: 3507, baseType: !1030, size: 64, align: 64, offset: 768)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1073, file: !35, line: 3516, baseType: !898, size: 32, align: 32, offset: 832)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1073, file: !35, line: 3517, baseType: !1114, size: 64, align: 64, offset: 896)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1073, file: !35, line: 3527, baseType: !1116, size: 64, align: 64, offset: 960)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!898, !1019}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1073, file: !35, line: 3535, baseType: !1120, size: 64, align: 64, offset: 1024)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!898, !1019, !1123}
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1073, file: !35, line: 3541, baseType: !1126, size: 64, align: 64, offset: 1088)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1128)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1129)
!1129 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1073, file: !35, line: 3549, baseType: !1131, size: 64, align: 64, offset: 1152)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{null, !1114}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1073, file: !35, line: 3551, baseType: !1116, size: 64, align: 64, offset: 1216)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1073, file: !35, line: 3552, baseType: !1136, size: 64, align: 64, offset: 1280)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!898, !1019, !1139, !898, !1140}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1142)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1143)
!1143 = !{!1144, !1145, !1146, !1147, !1148, !1176}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1142, file: !35, line: 3921, baseType: !931, size: 16, align: 16)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1142, file: !35, line: 3922, baseType: !899, size: 32, align: 32, offset: 32)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1142, file: !35, line: 3923, baseType: !899, size: 32, align: 32, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1142, file: !35, line: 3924, baseType: !897, size: 32, align: 32, offset: 96)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1142, file: !35, line: 3925, baseType: !1149, size: 64, align: 64, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1152)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1153)
!1153 = !{!1154, !1155, !1156, !1157, !1158, !1159, !1167, !1169, !1171, !1172, !1174, !1175}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1152, file: !35, line: 3886, baseType: !898, size: 32, align: 32)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1152, file: !35, line: 3887, baseType: !898, size: 32, align: 32, offset: 32)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1152, file: !35, line: 3888, baseType: !898, size: 32, align: 32, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1152, file: !35, line: 3889, baseType: !898, size: 32, align: 32, offset: 96)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1152, file: !35, line: 3890, baseType: !898, size: 32, align: 32, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1152, file: !35, line: 3897, baseType: !1160, size: 768, align: 64, offset: 192)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1162)
!1162 = !{!1163, !1165}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1161, file: !35, line: 3855, baseType: !1164, size: 512, align: 64)
!1164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 512, align: 64, elements: !958)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1161, file: !35, line: 3857, baseType: !1166, size: 256, align: 32, offset: 512)
!1166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 256, align: 32, elements: !958)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1152, file: !35, line: 3903, baseType: !1168, size: 256, align: 64, offset: 960)
!1168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 256, align: 64, elements: !965)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1152, file: !35, line: 3904, baseType: !1170, size: 128, align: 32, offset: 1216)
!1170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 128, align: 32, elements: !965)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1152, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1152, file: !35, line: 3908, baseType: !1173, size: 64, align: 64, offset: 1408)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1152, file: !35, line: 3915, baseType: !1173, size: 64, align: 64, offset: 1472)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1152, file: !35, line: 3917, baseType: !898, size: 32, align: 32, offset: 1536)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1142, file: !35, line: 3926, baseType: !1177, size: 64, align: 64, offset: 192)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !900, line: 40, baseType: !1178)
!1178 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1073, file: !35, line: 3564, baseType: !1180, size: 64, align: 64, offset: 1344)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!898, !1019, !1183, !1217, !1018}
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1186)
!1186 = !{!1187, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1213, !1214, !1215, !1216}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1185, file: !35, line: 1451, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1190, line: 94, baseType: !1191)
!1190 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1190, line: 81, size: 192, align: 64, elements: !1192)
!1192 = !{!1193, !1197, !1198}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1191, file: !1190, line: 82, baseType: !1194, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1190, line: 73, baseType: !1196)
!1196 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1190, line: 73, flags: DIFlagFwdDecl)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1191, file: !1190, line: 89, baseType: !1139, size: 64, align: 64, offset: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1191, file: !1190, line: 93, baseType: !898, size: 32, align: 32, offset: 128)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1185, file: !35, line: 1461, baseType: !1177, size: 64, align: 64, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1185, file: !35, line: 1467, baseType: !1177, size: 64, align: 64, offset: 128)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1185, file: !35, line: 1468, baseType: !1139, size: 64, align: 64, offset: 192)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1185, file: !35, line: 1469, baseType: !898, size: 32, align: 32, offset: 256)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1185, file: !35, line: 1470, baseType: !898, size: 32, align: 32, offset: 288)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1185, file: !35, line: 1474, baseType: !898, size: 32, align: 32, offset: 320)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1185, file: !35, line: 1479, baseType: !1206, size: 64, align: 64, offset: 384)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1209)
!1209 = !{!1210, !1211, !1212}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1208, file: !35, line: 1412, baseType: !1139, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1208, file: !35, line: 1413, baseType: !898, size: 32, align: 32, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1208, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1185, file: !35, line: 1480, baseType: !898, size: 32, align: 32, offset: 448)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1185, file: !35, line: 1486, baseType: !1177, size: 64, align: 64, offset: 512)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1185, file: !35, line: 1488, baseType: !1177, size: 64, align: 64, offset: 576)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1185, file: !35, line: 1497, baseType: !1177, size: 64, align: 64, offset: 640)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1219)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1220)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1221)
!1221 = !{!1222, !1223, !1224, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1251, !1253, !1254, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1285, !1286, !1287, !1288, !1289, !1290, !1293, !1294, !1295, !1296}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1220, file: !758, line: 282, baseType: !1164, size: 512, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1220, file: !758, line: 299, baseType: !1166, size: 256, align: 32, offset: 512)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1220, file: !758, line: 315, baseType: !1225, size: 64, align: 64, offset: 768)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1220, file: !758, line: 326, baseType: !898, size: 32, align: 32, offset: 832)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1220, file: !758, line: 326, baseType: !898, size: 32, align: 32, offset: 864)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1220, file: !758, line: 334, baseType: !898, size: 32, align: 32, offset: 896)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1220, file: !758, line: 341, baseType: !898, size: 32, align: 32, offset: 928)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1220, file: !758, line: 346, baseType: !898, size: 32, align: 32, offset: 960)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1220, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1220, file: !758, line: 356, baseType: !1083, size: 64, align: 32, offset: 1024)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1220, file: !758, line: 361, baseType: !1177, size: 64, align: 64, offset: 1088)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1220, file: !758, line: 369, baseType: !1177, size: 64, align: 64, offset: 1152)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1220, file: !758, line: 377, baseType: !1177, size: 64, align: 64, offset: 1216)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1220, file: !758, line: 382, baseType: !898, size: 32, align: 32, offset: 1280)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1220, file: !758, line: 386, baseType: !898, size: 32, align: 32, offset: 1312)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1220, file: !758, line: 391, baseType: !898, size: 32, align: 32, offset: 1344)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1220, file: !758, line: 396, baseType: !1037, size: 64, align: 64, offset: 1408)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1220, file: !758, line: 403, baseType: !1241, size: 512, align: 64, offset: 1472)
!1241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 512, align: 64, elements: !958)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1220, file: !758, line: 410, baseType: !898, size: 32, align: 32, offset: 1984)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1220, file: !758, line: 415, baseType: !898, size: 32, align: 32, offset: 2016)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1220, file: !758, line: 420, baseType: !898, size: 32, align: 32, offset: 2048)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1220, file: !758, line: 425, baseType: !898, size: 32, align: 32, offset: 2080)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1220, file: !758, line: 435, baseType: !1177, size: 64, align: 64, offset: 2112)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1220, file: !758, line: 440, baseType: !898, size: 32, align: 32, offset: 2176)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1220, file: !758, line: 445, baseType: !901, size: 64, align: 64, offset: 2240)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1220, file: !758, line: 459, baseType: !1250, size: 512, align: 64, offset: 2304)
!1250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1188, size: 512, align: 64, elements: !958)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1220, file: !758, line: 473, baseType: !1252, size: 64, align: 64, offset: 2816)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1220, file: !758, line: 477, baseType: !898, size: 32, align: 32, offset: 2880)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1220, file: !758, line: 479, baseType: !1255, size: 64, align: 64, offset: 2944)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1258)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1259)
!1259 = !{!1260, !1261, !1262, !1263, !1268}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1258, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1258, file: !758, line: 203, baseType: !1139, size: 64, align: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1258, file: !758, line: 204, baseType: !898, size: 32, align: 32, offset: 128)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1258, file: !758, line: 205, baseType: !1264, size: 64, align: 64, offset: 192)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1266, line: 86, baseType: !1267)
!1266 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1267 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1266, line: 86, flags: DIFlagFwdDecl)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1258, file: !758, line: 206, baseType: !1188, size: 64, align: 64, offset: 256)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1220, file: !758, line: 480, baseType: !898, size: 32, align: 32, offset: 3008)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1220, file: !758, line: 505, baseType: !898, size: 32, align: 32, offset: 3040)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1220, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1220, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1220, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1220, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1220, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1220, file: !758, line: 532, baseType: !1177, size: 64, align: 64, offset: 3264)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1220, file: !758, line: 539, baseType: !1177, size: 64, align: 64, offset: 3328)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1220, file: !758, line: 547, baseType: !1177, size: 64, align: 64, offset: 3392)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1220, file: !758, line: 554, baseType: !1264, size: 64, align: 64, offset: 3456)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1220, file: !758, line: 563, baseType: !898, size: 32, align: 32, offset: 3520)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1220, file: !758, line: 572, baseType: !898, size: 32, align: 32, offset: 3552)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1220, file: !758, line: 581, baseType: !898, size: 32, align: 32, offset: 3584)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1220, file: !758, line: 588, baseType: !1284, size: 64, align: 64, offset: 3648)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1220, file: !758, line: 593, baseType: !898, size: 32, align: 32, offset: 3712)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1220, file: !758, line: 596, baseType: !898, size: 32, align: 32, offset: 3744)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1220, file: !758, line: 599, baseType: !1188, size: 64, align: 64, offset: 3776)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1220, file: !758, line: 605, baseType: !1188, size: 64, align: 64, offset: 3840)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1220, file: !758, line: 616, baseType: !1188, size: 64, align: 64, offset: 3904)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1220, file: !758, line: 626, baseType: !1291, size: 64, align: 64, offset: 3968)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1292, line: 216, baseType: !902)
!1292 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1220, file: !758, line: 627, baseType: !1291, size: 64, align: 64, offset: 4032)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1220, file: !758, line: 628, baseType: !1291, size: 64, align: 64, offset: 4096)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1220, file: !758, line: 629, baseType: !1291, size: 64, align: 64, offset: 4160)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1220, file: !758, line: 645, baseType: !1188, size: 64, align: 64, offset: 4224)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1073, file: !35, line: 3566, baseType: !1298, size: 64, align: 64, offset: 1408)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!898, !1019, !1037, !1018, !1183}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1073, file: !35, line: 3567, baseType: !1116, size: 64, align: 64, offset: 1472)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1073, file: !35, line: 3576, baseType: !1303, size: 64, align: 64, offset: 1536)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{!898, !1019, !1217}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1073, file: !35, line: 3577, baseType: !1307, size: 64, align: 64, offset: 1600)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!898, !1019, !1183}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1073, file: !35, line: 3584, baseType: !1311, size: 64, align: 64, offset: 1664)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!898, !1019, !1314}
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1073, file: !35, line: 3589, baseType: !1316, size: 64, align: 64, offset: 1728)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{null, !1019}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1073, file: !35, line: 3594, baseType: !898, size: 32, align: 32, offset: 1792)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1073, file: !35, line: 3600, baseType: !1030, size: 64, align: 64, offset: 1856)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1073, file: !35, line: 3609, baseType: !1322, size: 64, align: 64, offset: 1920)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1325)
!1325 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1021, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1021, file: !35, line: 1581, baseType: !897, size: 32, align: 32, offset: 224)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1021, file: !35, line: 1583, baseType: !1037, size: 64, align: 64, offset: 256)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1021, file: !35, line: 1591, baseType: !1330, size: 64, align: 64, offset: 320)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1021, file: !35, line: 1598, baseType: !1037, size: 64, align: 64, offset: 384)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1021, file: !35, line: 1606, baseType: !1177, size: 64, align: 64, offset: 448)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1021, file: !35, line: 1614, baseType: !898, size: 32, align: 32, offset: 512)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1021, file: !35, line: 1622, baseType: !898, size: 32, align: 32, offset: 544)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1021, file: !35, line: 1628, baseType: !898, size: 32, align: 32, offset: 576)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1021, file: !35, line: 1636, baseType: !898, size: 32, align: 32, offset: 608)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1021, file: !35, line: 1643, baseType: !898, size: 32, align: 32, offset: 640)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1021, file: !35, line: 1657, baseType: !1139, size: 64, align: 64, offset: 704)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1021, file: !35, line: 1658, baseType: !898, size: 32, align: 32, offset: 768)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1021, file: !35, line: 1679, baseType: !1083, size: 64, align: 32, offset: 800)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1021, file: !35, line: 1688, baseType: !898, size: 32, align: 32, offset: 864)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1021, file: !35, line: 1712, baseType: !898, size: 32, align: 32, offset: 896)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1021, file: !35, line: 1729, baseType: !898, size: 32, align: 32, offset: 928)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1021, file: !35, line: 1729, baseType: !898, size: 32, align: 32, offset: 960)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1021, file: !35, line: 1744, baseType: !898, size: 32, align: 32, offset: 992)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1021, file: !35, line: 1744, baseType: !898, size: 32, align: 32, offset: 1024)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1021, file: !35, line: 1751, baseType: !898, size: 32, align: 32, offset: 1056)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1021, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1021, file: !35, line: 1791, baseType: !1351, size: 64, align: 64, offset: 1152)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{null, !1354, !1217, !1018, !898, !898, !898}
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1021, file: !35, line: 1808, baseType: !1356, size: 64, align: 64, offset: 1216)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!494, !1354, !1090}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1021, file: !35, line: 1816, baseType: !898, size: 32, align: 32, offset: 1280)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1021, file: !35, line: 1825, baseType: !1361, size: 32, align: 32, offset: 1312)
!1361 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1021, file: !35, line: 1830, baseType: !898, size: 32, align: 32, offset: 1344)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1021, file: !35, line: 1838, baseType: !1361, size: 32, align: 32, offset: 1376)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1021, file: !35, line: 1846, baseType: !898, size: 32, align: 32, offset: 1408)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1021, file: !35, line: 1851, baseType: !898, size: 32, align: 32, offset: 1440)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1021, file: !35, line: 1861, baseType: !1361, size: 32, align: 32, offset: 1472)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1021, file: !35, line: 1868, baseType: !1361, size: 32, align: 32, offset: 1504)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1021, file: !35, line: 1875, baseType: !1361, size: 32, align: 32, offset: 1536)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1021, file: !35, line: 1882, baseType: !1361, size: 32, align: 32, offset: 1568)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1021, file: !35, line: 1889, baseType: !1361, size: 32, align: 32, offset: 1600)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1021, file: !35, line: 1896, baseType: !1361, size: 32, align: 32, offset: 1632)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1021, file: !35, line: 1903, baseType: !1361, size: 32, align: 32, offset: 1664)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1021, file: !35, line: 1910, baseType: !898, size: 32, align: 32, offset: 1696)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1021, file: !35, line: 1915, baseType: !898, size: 32, align: 32, offset: 1728)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1021, file: !35, line: 1926, baseType: !1018, size: 64, align: 64, offset: 1792)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1021, file: !35, line: 1935, baseType: !1083, size: 64, align: 32, offset: 1856)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1021, file: !35, line: 1942, baseType: !898, size: 32, align: 32, offset: 1920)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1021, file: !35, line: 1948, baseType: !898, size: 32, align: 32, offset: 1952)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1021, file: !35, line: 1954, baseType: !898, size: 32, align: 32, offset: 1984)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1021, file: !35, line: 1960, baseType: !898, size: 32, align: 32, offset: 2016)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1021, file: !35, line: 1984, baseType: !898, size: 32, align: 32, offset: 2048)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1021, file: !35, line: 1991, baseType: !898, size: 32, align: 32, offset: 2080)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1021, file: !35, line: 1996, baseType: !898, size: 32, align: 32, offset: 2112)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1021, file: !35, line: 2004, baseType: !898, size: 32, align: 32, offset: 2144)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1021, file: !35, line: 2011, baseType: !898, size: 32, align: 32, offset: 2176)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1021, file: !35, line: 2018, baseType: !898, size: 32, align: 32, offset: 2208)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1021, file: !35, line: 2027, baseType: !898, size: 32, align: 32, offset: 2240)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1021, file: !35, line: 2034, baseType: !898, size: 32, align: 32, offset: 2272)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1021, file: !35, line: 2044, baseType: !898, size: 32, align: 32, offset: 2304)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1021, file: !35, line: 2054, baseType: !1391, size: 64, align: 64, offset: 2368)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1021, file: !35, line: 2061, baseType: !1391, size: 64, align: 64, offset: 2432)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1021, file: !35, line: 2066, baseType: !898, size: 32, align: 32, offset: 2496)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1021, file: !35, line: 2070, baseType: !898, size: 32, align: 32, offset: 2528)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1021, file: !35, line: 2078, baseType: !898, size: 32, align: 32, offset: 2560)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1021, file: !35, line: 2085, baseType: !898, size: 32, align: 32, offset: 2592)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1021, file: !35, line: 2092, baseType: !898, size: 32, align: 32, offset: 2624)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1021, file: !35, line: 2099, baseType: !898, size: 32, align: 32, offset: 2656)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1021, file: !35, line: 2106, baseType: !898, size: 32, align: 32, offset: 2688)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1021, file: !35, line: 2113, baseType: !898, size: 32, align: 32, offset: 2720)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1021, file: !35, line: 2120, baseType: !898, size: 32, align: 32, offset: 2752)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1021, file: !35, line: 2125, baseType: !898, size: 32, align: 32, offset: 2784)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1021, file: !35, line: 2133, baseType: !898, size: 32, align: 32, offset: 2816)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1021, file: !35, line: 2140, baseType: !898, size: 32, align: 32, offset: 2848)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1021, file: !35, line: 2145, baseType: !898, size: 32, align: 32, offset: 2880)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1021, file: !35, line: 2153, baseType: !898, size: 32, align: 32, offset: 2912)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1021, file: !35, line: 2158, baseType: !898, size: 32, align: 32, offset: 2944)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1021, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1021, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1021, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1021, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1021, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1021, file: !35, line: 2203, baseType: !898, size: 32, align: 32, offset: 3136)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1021, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1021, file: !35, line: 2212, baseType: !898, size: 32, align: 32, offset: 3200)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1021, file: !35, line: 2213, baseType: !898, size: 32, align: 32, offset: 3232)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1021, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1021, file: !35, line: 2232, baseType: !898, size: 32, align: 32, offset: 3296)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1021, file: !35, line: 2243, baseType: !898, size: 32, align: 32, offset: 3328)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1021, file: !35, line: 2249, baseType: !898, size: 32, align: 32, offset: 3360)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1021, file: !35, line: 2256, baseType: !898, size: 32, align: 32, offset: 3392)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1021, file: !35, line: 2263, baseType: !901, size: 64, align: 64, offset: 3456)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1021, file: !35, line: 2270, baseType: !901, size: 64, align: 64, offset: 3520)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1021, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1021, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1021, file: !35, line: 2367, baseType: !1427, size: 64, align: 64, offset: 3648)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{!898, !1354, !1314, !898}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1021, file: !35, line: 2383, baseType: !898, size: 32, align: 32, offset: 3712)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1021, file: !35, line: 2386, baseType: !1361, size: 32, align: 32, offset: 3744)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1021, file: !35, line: 2387, baseType: !1361, size: 32, align: 32, offset: 3776)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1021, file: !35, line: 2394, baseType: !898, size: 32, align: 32, offset: 3808)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1021, file: !35, line: 2401, baseType: !898, size: 32, align: 32, offset: 3840)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1021, file: !35, line: 2408, baseType: !898, size: 32, align: 32, offset: 3872)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1021, file: !35, line: 2415, baseType: !898, size: 32, align: 32, offset: 3904)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1021, file: !35, line: 2422, baseType: !898, size: 32, align: 32, offset: 3936)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1021, file: !35, line: 2423, baseType: !1439, size: 64, align: 64, offset: 3968)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1440 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1441)
!1441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1442)
!1442 = !{!1443, !1444, !1445, !1446}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1441, file: !35, line: 827, baseType: !898, size: 32, align: 32)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1441, file: !35, line: 828, baseType: !898, size: 32, align: 32, offset: 32)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1441, file: !35, line: 829, baseType: !898, size: 32, align: 32, offset: 64)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1441, file: !35, line: 830, baseType: !1361, size: 32, align: 32, offset: 96)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1021, file: !35, line: 2430, baseType: !1177, size: 64, align: 64, offset: 4032)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1021, file: !35, line: 2437, baseType: !1177, size: 64, align: 64, offset: 4096)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1021, file: !35, line: 2444, baseType: !1361, size: 32, align: 32, offset: 4160)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1021, file: !35, line: 2451, baseType: !1361, size: 32, align: 32, offset: 4192)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1021, file: !35, line: 2458, baseType: !898, size: 32, align: 32, offset: 4224)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1021, file: !35, line: 2469, baseType: !898, size: 32, align: 32, offset: 4256)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1021, file: !35, line: 2475, baseType: !898, size: 32, align: 32, offset: 4288)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1021, file: !35, line: 2481, baseType: !898, size: 32, align: 32, offset: 4320)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1021, file: !35, line: 2485, baseType: !898, size: 32, align: 32, offset: 4352)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1021, file: !35, line: 2489, baseType: !898, size: 32, align: 32, offset: 4384)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1021, file: !35, line: 2493, baseType: !898, size: 32, align: 32, offset: 4416)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1021, file: !35, line: 2501, baseType: !898, size: 32, align: 32, offset: 4448)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1021, file: !35, line: 2506, baseType: !898, size: 32, align: 32, offset: 4480)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1021, file: !35, line: 2510, baseType: !898, size: 32, align: 32, offset: 4512)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1021, file: !35, line: 2514, baseType: !1177, size: 64, align: 64, offset: 4544)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1021, file: !35, line: 2528, baseType: !1463, size: 64, align: 64, offset: 4608)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DISubroutineType(types: !1465)
!1465 = !{null, !1354, !1037, !898, !898}
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1021, file: !35, line: 2534, baseType: !898, size: 32, align: 32, offset: 4672)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1021, file: !35, line: 2545, baseType: !898, size: 32, align: 32, offset: 4704)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1021, file: !35, line: 2547, baseType: !898, size: 32, align: 32, offset: 4736)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1021, file: !35, line: 2549, baseType: !898, size: 32, align: 32, offset: 4768)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1021, file: !35, line: 2551, baseType: !898, size: 32, align: 32, offset: 4800)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1021, file: !35, line: 2553, baseType: !898, size: 32, align: 32, offset: 4832)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1021, file: !35, line: 2555, baseType: !898, size: 32, align: 32, offset: 4864)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1021, file: !35, line: 2557, baseType: !898, size: 32, align: 32, offset: 4896)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1021, file: !35, line: 2559, baseType: !898, size: 32, align: 32, offset: 4928)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1021, file: !35, line: 2563, baseType: !898, size: 32, align: 32, offset: 4960)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1021, file: !35, line: 2571, baseType: !1173, size: 64, align: 64, offset: 4992)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1021, file: !35, line: 2579, baseType: !1173, size: 64, align: 64, offset: 5056)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1021, file: !35, line: 2586, baseType: !898, size: 32, align: 32, offset: 5120)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1021, file: !35, line: 2615, baseType: !898, size: 32, align: 32, offset: 5152)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1021, file: !35, line: 2627, baseType: !898, size: 32, align: 32, offset: 5184)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1021, file: !35, line: 2637, baseType: !898, size: 32, align: 32, offset: 5216)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1021, file: !35, line: 2681, baseType: !898, size: 32, align: 32, offset: 5248)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1021, file: !35, line: 2709, baseType: !1177, size: 64, align: 64, offset: 5312)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1021, file: !35, line: 2716, baseType: !1485, size: 64, align: 64, offset: 5376)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1487)
!1487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1488)
!1488 = !{!1489, !1490, !1491, !1492, !1493, !1494, !1495, !1500, !1504, !1505, !1506, !1507, !1513, !1514, !1515, !1516, !1517}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1487, file: !35, line: 3642, baseType: !1030, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1487, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1487, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1487, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1487, file: !35, line: 3669, baseType: !898, size: 32, align: 32, offset: 160)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1487, file: !35, line: 3682, baseType: !1311, size: 64, align: 64, offset: 192)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1487, file: !35, line: 3698, baseType: !1496, size: 64, align: 64, offset: 256)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{!898, !1019, !1499, !899}
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1487, file: !35, line: 3712, baseType: !1501, size: 64, align: 64, offset: 320)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{!898, !1019, !898, !1499, !899}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1487, file: !35, line: 3726, baseType: !1496, size: 64, align: 64, offset: 384)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1487, file: !35, line: 3737, baseType: !1116, size: 64, align: 64, offset: 448)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1487, file: !35, line: 3746, baseType: !898, size: 32, align: 32, offset: 512)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1487, file: !35, line: 3757, baseType: !1508, size: 64, align: 64, offset: 576)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DISubroutineType(types: !1510)
!1510 = !{null, !1511}
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1487, file: !35, line: 3766, baseType: !1116, size: 64, align: 64, offset: 640)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1487, file: !35, line: 3774, baseType: !1116, size: 64, align: 64, offset: 704)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1487, file: !35, line: 3780, baseType: !898, size: 32, align: 32, offset: 768)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1487, file: !35, line: 3785, baseType: !898, size: 32, align: 32, offset: 800)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1487, file: !35, line: 3795, baseType: !1518, size: 64, align: 64, offset: 832)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DISubroutineType(types: !1520)
!1520 = !{!898, !1019, !1188}
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1021, file: !35, line: 2728, baseType: !1037, size: 64, align: 64, offset: 5440)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1021, file: !35, line: 2735, baseType: !1241, size: 512, align: 64, offset: 5504)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1021, file: !35, line: 2742, baseType: !898, size: 32, align: 32, offset: 6016)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1021, file: !35, line: 2755, baseType: !898, size: 32, align: 32, offset: 6048)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1021, file: !35, line: 2776, baseType: !898, size: 32, align: 32, offset: 6080)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1021, file: !35, line: 2783, baseType: !898, size: 32, align: 32, offset: 6112)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1021, file: !35, line: 2791, baseType: !898, size: 32, align: 32, offset: 6144)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1021, file: !35, line: 2802, baseType: !1314, size: 64, align: 64, offset: 6208)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1021, file: !35, line: 2811, baseType: !898, size: 32, align: 32, offset: 6272)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1021, file: !35, line: 2821, baseType: !898, size: 32, align: 32, offset: 6304)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1021, file: !35, line: 2830, baseType: !898, size: 32, align: 32, offset: 6336)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1021, file: !35, line: 2840, baseType: !898, size: 32, align: 32, offset: 6368)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1021, file: !35, line: 2851, baseType: !1534, size: 64, align: 64, offset: 6400)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{!898, !1354, !1537, !1037, !1018, !898, !898}
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64, align: 64)
!1538 = !DISubroutineType(types: !1539)
!1539 = !{!898, !1354, !1037}
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1021, file: !35, line: 2871, baseType: !1541, size: 64, align: 64, offset: 6464)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{!898, !1354, !1544, !1037, !1018, !898}
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DISubroutineType(types: !1546)
!1546 = !{!898, !1354, !1037, !898, !898}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1021, file: !35, line: 2878, baseType: !898, size: 32, align: 32, offset: 6528)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1021, file: !35, line: 2885, baseType: !898, size: 32, align: 32, offset: 6560)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1021, file: !35, line: 3005, baseType: !898, size: 32, align: 32, offset: 6592)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1021, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1021, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1021, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1021, file: !35, line: 3037, baseType: !1139, size: 64, align: 64, offset: 6720)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1021, file: !35, line: 3038, baseType: !898, size: 32, align: 32, offset: 6784)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1021, file: !35, line: 3050, baseType: !901, size: 64, align: 64, offset: 6848)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1021, file: !35, line: 3065, baseType: !898, size: 32, align: 32, offset: 6912)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1021, file: !35, line: 3083, baseType: !898, size: 32, align: 32, offset: 6944)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1021, file: !35, line: 3092, baseType: !1083, size: 64, align: 32, offset: 6976)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1021, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1021, file: !35, line: 3106, baseType: !1083, size: 64, align: 32, offset: 7072)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1021, file: !35, line: 3113, baseType: !1562, size: 64, align: 64, offset: 7168)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1564)
!1564 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1565)
!1565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1566)
!1566 = !{!1567, !1568, !1569, !1570, !1571, !1572, !1575}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1565, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1565, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1565, file: !35, line: 720, baseType: !1030, size: 64, align: 64, offset: 64)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1565, file: !35, line: 724, baseType: !1030, size: 64, align: 64, offset: 128)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1565, file: !35, line: 728, baseType: !898, size: 32, align: 32, offset: 192)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1565, file: !35, line: 734, baseType: !1573, size: 64, align: 64, offset: 256)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1030)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1565, file: !35, line: 739, baseType: !1576, size: 64, align: 64, offset: 320)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1107)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1021, file: !35, line: 3129, baseType: !1177, size: 64, align: 64, offset: 7232)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1021, file: !35, line: 3130, baseType: !1177, size: 64, align: 64, offset: 7296)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1021, file: !35, line: 3131, baseType: !1177, size: 64, align: 64, offset: 7360)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1021, file: !35, line: 3132, baseType: !1177, size: 64, align: 64, offset: 7424)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1021, file: !35, line: 3139, baseType: !1173, size: 64, align: 64, offset: 7488)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1021, file: !35, line: 3147, baseType: !898, size: 32, align: 32, offset: 7552)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1021, file: !35, line: 3165, baseType: !898, size: 32, align: 32, offset: 7584)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1021, file: !35, line: 3172, baseType: !898, size: 32, align: 32, offset: 7616)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1021, file: !35, line: 3180, baseType: !898, size: 32, align: 32, offset: 7648)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1021, file: !35, line: 3191, baseType: !1391, size: 64, align: 64, offset: 7680)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1021, file: !35, line: 3199, baseType: !1139, size: 64, align: 64, offset: 7744)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1021, file: !35, line: 3207, baseType: !1173, size: 64, align: 64, offset: 7808)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1021, file: !35, line: 3214, baseType: !897, size: 32, align: 32, offset: 7872)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1021, file: !35, line: 3224, baseType: !1206, size: 64, align: 64, offset: 7936)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1021, file: !35, line: 3225, baseType: !898, size: 32, align: 32, offset: 8000)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1021, file: !35, line: 3249, baseType: !1188, size: 64, align: 64, offset: 8064)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1021, file: !35, line: 3256, baseType: !898, size: 32, align: 32, offset: 8128)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1021, file: !35, line: 3271, baseType: !898, size: 32, align: 32, offset: 8160)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1021, file: !35, line: 3279, baseType: !1177, size: 64, align: 64, offset: 8192)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1021, file: !35, line: 3301, baseType: !1188, size: 64, align: 64, offset: 8256)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1021, file: !35, line: 3310, baseType: !898, size: 32, align: 32, offset: 8320)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1021, file: !35, line: 3337, baseType: !898, size: 32, align: 32, offset: 8352)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1021, file: !35, line: 3351, baseType: !898, size: 32, align: 32, offset: 8384)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1021, file: !35, line: 3359, baseType: !898, size: 32, align: 32, offset: 8416)
!1602 = !DILocalVariable(name: "refl", arg: 1, scope: !1015, file: !905, line: 1545, type: !1018)
!1603 = !DILocation(line: 1545, column: 23, scope: !1015)
!1604 = !DILocalVariable(name: "coefs", arg: 2, scope: !1015, file: !905, line: 1545, type: !942)
!1605 = !DILocation(line: 1545, column: 44, scope: !1015)
!1606 = !DILocalVariable(name: "avctx", arg: 3, scope: !1015, file: !905, line: 1545, type: !1019)
!1607 = !DILocation(line: 1545, column: 67, scope: !1015)
!1608 = !DILocalVariable(name: "b", scope: !1015, file: !905, line: 1547, type: !898)
!1609 = !DILocation(line: 1547, column: 9, scope: !1015)
!1610 = !DILocalVariable(name: "i", scope: !1015, file: !905, line: 1547, type: !898)
!1611 = !DILocation(line: 1547, column: 12, scope: !1015)
!1612 = !DILocalVariable(name: "j", scope: !1015, file: !905, line: 1547, type: !898)
!1613 = !DILocation(line: 1547, column: 15, scope: !1015)
!1614 = !DILocalVariable(name: "buffer1", scope: !1015, file: !905, line: 1548, type: !1615)
!1615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 320, align: 32, elements: !943)
!1616 = !DILocation(line: 1548, column: 9, scope: !1015)
!1617 = !DILocalVariable(name: "buffer2", scope: !1015, file: !905, line: 1549, type: !1615)
!1618 = !DILocation(line: 1549, column: 9, scope: !1015)
!1619 = !DILocalVariable(name: "bp1", scope: !1015, file: !905, line: 1550, type: !1018)
!1620 = !DILocation(line: 1550, column: 10, scope: !1015)
!1621 = !DILocation(line: 1550, column: 16, scope: !1015)
!1622 = !DILocalVariable(name: "bp2", scope: !1015, file: !905, line: 1551, type: !1018)
!1623 = !DILocation(line: 1551, column: 10, scope: !1015)
!1624 = !DILocation(line: 1551, column: 16, scope: !1015)
!1625 = !DILocation(line: 1553, column: 11, scope: !1626)
!1626 = distinct !DILexicalBlock(scope: !1015, file: !905, line: 1553, column: 5)
!1627 = !DILocation(line: 1553, column: 10, scope: !1626)
!1628 = !DILocation(line: 1553, column: 15, scope: !1629)
!1629 = !DILexicalBlockFile(scope: !1630, file: !905, discriminator: 1)
!1630 = distinct !DILexicalBlock(scope: !1626, file: !905, line: 1553, column: 5)
!1631 = !DILocation(line: 1553, column: 17, scope: !1629)
!1632 = !DILocation(line: 1553, column: 5, scope: !1629)
!1633 = !DILocation(line: 1554, column: 28, scope: !1630)
!1634 = !DILocation(line: 1554, column: 22, scope: !1630)
!1635 = !DILocation(line: 1554, column: 17, scope: !1630)
!1636 = !DILocation(line: 1554, column: 9, scope: !1630)
!1637 = !DILocation(line: 1554, column: 20, scope: !1630)
!1638 = !DILocation(line: 1553, column: 24, scope: !1639)
!1639 = !DILexicalBlockFile(scope: !1630, file: !905, discriminator: 2)
!1640 = !DILocation(line: 1553, column: 5, scope: !1639)
!1641 = distinct !{!1641, !1642}
!1642 = !DILocation(line: 1553, column: 5, scope: !1015)
!1643 = !DILocation(line: 1556, column: 19, scope: !1015)
!1644 = !DILocation(line: 1556, column: 5, scope: !1015)
!1645 = !DILocation(line: 1556, column: 17, scope: !1015)
!1646 = !DILocation(line: 1558, column: 20, scope: !1647)
!1647 = distinct !DILexicalBlock(scope: !1015, file: !905, line: 1558, column: 9)
!1648 = !DILocation(line: 1558, column: 31, scope: !1647)
!1649 = !DILocation(line: 1558, column: 40, scope: !1647)
!1650 = !DILocation(line: 1558, column: 9, scope: !1015)
!1651 = !DILocation(line: 1559, column: 16, scope: !1652)
!1652 = distinct !DILexicalBlock(scope: !1647, file: !905, line: 1558, column: 50)
!1653 = !DILocation(line: 1559, column: 9, scope: !1652)
!1654 = !DILocation(line: 1560, column: 9, scope: !1652)
!1655 = !DILocation(line: 1563, column: 12, scope: !1656)
!1656 = distinct !DILexicalBlock(scope: !1015, file: !905, line: 1563, column: 5)
!1657 = !DILocation(line: 1563, column: 10, scope: !1656)
!1658 = !DILocation(line: 1563, column: 21, scope: !1659)
!1659 = !DILexicalBlockFile(scope: !1660, file: !905, discriminator: 1)
!1660 = distinct !DILexicalBlock(scope: !1656, file: !905, line: 1563, column: 5)
!1661 = !DILocation(line: 1563, column: 23, scope: !1659)
!1662 = !DILocation(line: 1563, column: 5, scope: !1659)
!1663 = !DILocation(line: 1564, column: 26, scope: !1664)
!1664 = distinct !DILexicalBlock(scope: !1660, file: !905, line: 1563, column: 34)
!1665 = !DILocation(line: 1564, column: 27, scope: !1664)
!1666 = !DILocation(line: 1564, column: 22, scope: !1664)
!1667 = !DILocation(line: 1564, column: 37, scope: !1664)
!1668 = !DILocation(line: 1564, column: 38, scope: !1664)
!1669 = !DILocation(line: 1564, column: 33, scope: !1664)
!1670 = !DILocation(line: 1564, column: 31, scope: !1664)
!1671 = !DILocation(line: 1564, column: 43, scope: !1664)
!1672 = !DILocation(line: 1564, column: 19, scope: !1664)
!1673 = !DILocation(line: 1564, column: 11, scope: !1664)
!1674 = !DILocation(line: 1566, column: 14, scope: !1675)
!1675 = distinct !DILexicalBlock(scope: !1664, file: !905, line: 1566, column: 13)
!1676 = !DILocation(line: 1566, column: 13, scope: !1664)
!1677 = !DILocation(line: 1567, column: 15, scope: !1675)
!1678 = !DILocation(line: 1567, column: 13, scope: !1675)
!1679 = !DILocation(line: 1569, column: 25, scope: !1664)
!1680 = !DILocation(line: 1569, column: 23, scope: !1664)
!1681 = !DILocation(line: 1569, column: 11, scope: !1664)
!1682 = !DILocation(line: 1570, column: 15, scope: !1683)
!1683 = distinct !DILexicalBlock(scope: !1664, file: !905, line: 1570, column: 9)
!1684 = !DILocation(line: 1570, column: 14, scope: !1683)
!1685 = !DILocation(line: 1570, column: 19, scope: !1686)
!1686 = !DILexicalBlockFile(scope: !1687, file: !905, discriminator: 1)
!1687 = distinct !DILexicalBlock(scope: !1683, file: !905, line: 1570, column: 9)
!1688 = !DILocation(line: 1570, column: 24, scope: !1686)
!1689 = !DILocation(line: 1570, column: 21, scope: !1686)
!1690 = !DILocation(line: 1570, column: 9, scope: !1686)
!1691 = !DILocation(line: 1576, column: 33, scope: !1692)
!1692 = distinct !DILexicalBlock(scope: !1687, file: !905, line: 1570, column: 32)
!1693 = !DILocation(line: 1576, column: 29, scope: !1692)
!1694 = !DILocation(line: 1576, column: 50, scope: !1692)
!1695 = !DILocation(line: 1576, column: 51, scope: !1692)
!1696 = !DILocation(line: 1576, column: 45, scope: !1692)
!1697 = !DILocation(line: 1576, column: 71, scope: !1692)
!1698 = !DILocation(line: 1576, column: 73, scope: !1692)
!1699 = !DILocation(line: 1576, column: 72, scope: !1692)
!1700 = !DILocation(line: 1576, column: 67, scope: !1692)
!1701 = !DILocation(line: 1576, column: 55, scope: !1692)
!1702 = !DILocation(line: 1576, column: 77, scope: !1692)
!1703 = !DILocation(line: 1576, column: 36, scope: !1692)
!1704 = !DILocation(line: 1576, column: 97, scope: !1692)
!1705 = !DILocation(line: 1576, column: 85, scope: !1692)
!1706 = !DILocation(line: 1576, column: 100, scope: !1692)
!1707 = !DILocation(line: 1576, column: 17, scope: !1692)
!1708 = !DILocation(line: 1576, column: 13, scope: !1692)
!1709 = !DILocation(line: 1576, column: 20, scope: !1692)
!1710 = !DILocation(line: 1577, column: 9, scope: !1692)
!1711 = !DILocation(line: 1570, column: 28, scope: !1712)
!1712 = !DILexicalBlockFile(scope: !1687, file: !905, discriminator: 2)
!1713 = !DILocation(line: 1570, column: 9, scope: !1712)
!1714 = distinct !{!1714, !1715}
!1715 = !DILocation(line: 1570, column: 9, scope: !1664)
!1716 = !DILocation(line: 1579, column: 28, scope: !1717)
!1717 = distinct !DILexicalBlock(scope: !1664, file: !905, line: 1579, column: 13)
!1718 = !DILocation(line: 1579, column: 24, scope: !1717)
!1719 = !DILocation(line: 1579, column: 31, scope: !1717)
!1720 = !DILocation(line: 1579, column: 40, scope: !1717)
!1721 = !DILocation(line: 1579, column: 13, scope: !1664)
!1722 = !DILocation(line: 1580, column: 13, scope: !1717)
!1723 = !DILocation(line: 1582, column: 23, scope: !1664)
!1724 = !DILocation(line: 1582, column: 19, scope: !1664)
!1725 = !DILocation(line: 1582, column: 14, scope: !1664)
!1726 = !DILocation(line: 1582, column: 9, scope: !1664)
!1727 = !DILocation(line: 1582, column: 17, scope: !1664)
!1728 = !DILocation(line: 1584, column: 9, scope: !1664)
!1729 = distinct !{!1729, !1728}
!1730 = !DILocalVariable(name: "SWAP_tmp", scope: !1731, file: !905, line: 1584, type: !1018)
!1731 = distinct !DILexicalBlock(scope: !1664, file: !905, line: 1584, column: 11)
!1732 = !DILocation(line: 1584, column: 18, scope: !1731)
!1733 = !DILocation(line: 1584, column: 28, scope: !1734)
!1734 = !DILexicalBlockFile(scope: !1731, file: !905, discriminator: 1)
!1735 = !DILocation(line: 1584, column: 18, scope: !1734)
!1736 = !DILocation(line: 1584, column: 38, scope: !1734)
!1737 = !DILocation(line: 1584, column: 36, scope: !1734)
!1738 = !DILocation(line: 1584, column: 48, scope: !1734)
!1739 = !DILocation(line: 1584, column: 46, scope: !1734)
!1740 = !DILocation(line: 1584, column: 57, scope: !1734)
!1741 = !DILocation(line: 1585, column: 5, scope: !1664)
!1742 = !DILocation(line: 1563, column: 30, scope: !1743)
!1743 = !DILexicalBlockFile(scope: !1660, file: !905, discriminator: 2)
!1744 = !DILocation(line: 1563, column: 5, scope: !1743)
!1745 = distinct !{!1745, !1746}
!1746 = !DILocation(line: 1563, column: 5, scope: !1015)
!1747 = !DILocation(line: 1586, column: 5, scope: !1015)
!1748 = !DILocation(line: 1587, column: 1, scope: !1015)
!1749 = distinct !DISubprogram(name: "ff_eval_coefs", scope: !905, file: !905, line: 1593, type: !1750, isLocal: false, isDefinition: true, scopeLine: 1594, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !974)
!1750 = !DISubroutineType(types: !1751)
!1751 = !{null, !1018, !1093}
!1752 = !DILocalVariable(name: "coefs", arg: 1, scope: !1749, file: !905, line: 1593, type: !1018)
!1753 = !DILocation(line: 1593, column: 25, scope: !1749)
!1754 = !DILocalVariable(name: "refl", arg: 2, scope: !1749, file: !905, line: 1593, type: !1093)
!1755 = !DILocation(line: 1593, column: 43, scope: !1749)
!1756 = !DILocalVariable(name: "buffer", scope: !1749, file: !905, line: 1595, type: !1615)
!1757 = !DILocation(line: 1595, column: 9, scope: !1749)
!1758 = !DILocalVariable(name: "b1", scope: !1749, file: !905, line: 1596, type: !1018)
!1759 = !DILocation(line: 1596, column: 10, scope: !1749)
!1760 = !DILocation(line: 1596, column: 15, scope: !1749)
!1761 = !DILocalVariable(name: "b2", scope: !1749, file: !905, line: 1597, type: !1018)
!1762 = !DILocation(line: 1597, column: 10, scope: !1749)
!1763 = !DILocation(line: 1597, column: 15, scope: !1749)
!1764 = !DILocalVariable(name: "i", scope: !1749, file: !905, line: 1598, type: !898)
!1765 = !DILocation(line: 1598, column: 9, scope: !1749)
!1766 = !DILocalVariable(name: "j", scope: !1749, file: !905, line: 1598, type: !898)
!1767 = !DILocation(line: 1598, column: 12, scope: !1749)
!1768 = !DILocation(line: 1600, column: 11, scope: !1769)
!1769 = distinct !DILexicalBlock(scope: !1749, file: !905, line: 1600, column: 5)
!1770 = !DILocation(line: 1600, column: 10, scope: !1769)
!1771 = !DILocation(line: 1600, column: 15, scope: !1772)
!1772 = !DILexicalBlockFile(scope: !1773, file: !905, discriminator: 1)
!1773 = distinct !DILexicalBlock(scope: !1769, file: !905, line: 1600, column: 5)
!1774 = !DILocation(line: 1600, column: 17, scope: !1772)
!1775 = !DILocation(line: 1600, column: 5, scope: !1772)
!1776 = !DILocation(line: 1601, column: 22, scope: !1777)
!1777 = distinct !DILexicalBlock(scope: !1773, file: !905, line: 1600, column: 28)
!1778 = !DILocation(line: 1601, column: 17, scope: !1777)
!1779 = !DILocation(line: 1601, column: 25, scope: !1777)
!1780 = !DILocation(line: 1601, column: 12, scope: !1777)
!1781 = !DILocation(line: 1601, column: 9, scope: !1777)
!1782 = !DILocation(line: 1601, column: 15, scope: !1777)
!1783 = !DILocation(line: 1603, column: 15, scope: !1784)
!1784 = distinct !DILexicalBlock(scope: !1777, file: !905, line: 1603, column: 9)
!1785 = !DILocation(line: 1603, column: 14, scope: !1784)
!1786 = !DILocation(line: 1603, column: 19, scope: !1787)
!1787 = !DILexicalBlockFile(scope: !1788, file: !905, discriminator: 1)
!1788 = distinct !DILexicalBlock(scope: !1784, file: !905, line: 1603, column: 9)
!1789 = !DILocation(line: 1603, column: 23, scope: !1787)
!1790 = !DILocation(line: 1603, column: 21, scope: !1787)
!1791 = !DILocation(line: 1603, column: 9, scope: !1787)
!1792 = !DILocation(line: 1604, column: 33, scope: !1788)
!1793 = !DILocation(line: 1604, column: 28, scope: !1788)
!1794 = !DILocation(line: 1604, column: 51, scope: !1788)
!1795 = !DILocation(line: 1604, column: 53, scope: !1788)
!1796 = !DILocation(line: 1604, column: 52, scope: !1788)
!1797 = !DILocation(line: 1604, column: 54, scope: !1788)
!1798 = !DILocation(line: 1604, column: 48, scope: !1788)
!1799 = !DILocation(line: 1604, column: 36, scope: !1788)
!1800 = !DILocation(line: 1604, column: 59, scope: !1788)
!1801 = !DILocation(line: 1604, column: 71, scope: !1788)
!1802 = !DILocation(line: 1604, column: 68, scope: !1788)
!1803 = !DILocation(line: 1604, column: 66, scope: !1788)
!1804 = !DILocation(line: 1604, column: 16, scope: !1788)
!1805 = !DILocation(line: 1604, column: 13, scope: !1788)
!1806 = !DILocation(line: 1604, column: 19, scope: !1788)
!1807 = !DILocation(line: 1603, column: 27, scope: !1808)
!1808 = !DILexicalBlockFile(scope: !1788, file: !905, discriminator: 2)
!1809 = !DILocation(line: 1603, column: 9, scope: !1808)
!1810 = distinct !{!1810, !1811}
!1811 = !DILocation(line: 1603, column: 9, scope: !1777)
!1812 = !DILocation(line: 1606, column: 9, scope: !1777)
!1813 = distinct !{!1813, !1812}
!1814 = !DILocalVariable(name: "SWAP_tmp", scope: !1815, file: !905, line: 1606, type: !1018)
!1815 = distinct !DILexicalBlock(scope: !1777, file: !905, line: 1606, column: 11)
!1816 = !DILocation(line: 1606, column: 18, scope: !1815)
!1817 = !DILocation(line: 1606, column: 28, scope: !1818)
!1818 = !DILexicalBlockFile(scope: !1815, file: !905, discriminator: 1)
!1819 = !DILocation(line: 1606, column: 18, scope: !1818)
!1820 = !DILocation(line: 1606, column: 36, scope: !1818)
!1821 = !DILocation(line: 1606, column: 34, scope: !1818)
!1822 = !DILocation(line: 1606, column: 44, scope: !1818)
!1823 = !DILocation(line: 1606, column: 42, scope: !1818)
!1824 = !DILocation(line: 1606, column: 53, scope: !1818)
!1825 = !DILocation(line: 1607, column: 5, scope: !1777)
!1826 = !DILocation(line: 1600, column: 24, scope: !1827)
!1827 = !DILexicalBlockFile(scope: !1773, file: !905, discriminator: 2)
!1828 = !DILocation(line: 1600, column: 5, scope: !1827)
!1829 = distinct !{!1829, !1830}
!1830 = !DILocation(line: 1600, column: 5, scope: !1749)
!1831 = !DILocation(line: 1609, column: 11, scope: !1832)
!1832 = distinct !DILexicalBlock(scope: !1749, file: !905, line: 1609, column: 5)
!1833 = !DILocation(line: 1609, column: 10, scope: !1832)
!1834 = !DILocation(line: 1609, column: 15, scope: !1835)
!1835 = !DILexicalBlockFile(scope: !1836, file: !905, discriminator: 1)
!1836 = distinct !DILexicalBlock(scope: !1832, file: !905, line: 1609, column: 5)
!1837 = !DILocation(line: 1609, column: 17, scope: !1835)
!1838 = !DILocation(line: 1609, column: 5, scope: !1835)
!1839 = !DILocation(line: 1610, column: 15, scope: !1836)
!1840 = !DILocation(line: 1610, column: 9, scope: !1836)
!1841 = !DILocation(line: 1610, column: 18, scope: !1836)
!1842 = !DILocation(line: 1609, column: 24, scope: !1843)
!1843 = !DILexicalBlockFile(scope: !1836, file: !905, discriminator: 2)
!1844 = !DILocation(line: 1609, column: 5, scope: !1843)
!1845 = distinct !{!1845, !1846}
!1846 = !DILocation(line: 1609, column: 5, scope: !1749)
!1847 = !DILocation(line: 1611, column: 1, scope: !1749)
!1848 = distinct !DISubprogram(name: "ff_int_to_int16", scope: !905, file: !905, line: 1613, type: !1849, isLocal: false, isDefinition: true, scopeLine: 1614, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !974)
!1849 = !DISubroutineType(types: !1850)
!1850 = !{null, !973, !1093}
!1851 = !DILocalVariable(name: "out", arg: 1, scope: !1848, file: !905, line: 1613, type: !973)
!1852 = !DILocation(line: 1613, column: 31, scope: !1848)
!1853 = !DILocalVariable(name: "inp", arg: 2, scope: !1848, file: !905, line: 1613, type: !1093)
!1854 = !DILocation(line: 1613, column: 47, scope: !1848)
!1855 = !DILocalVariable(name: "i", scope: !1848, file: !905, line: 1615, type: !898)
!1856 = !DILocation(line: 1615, column: 9, scope: !1848)
!1857 = !DILocation(line: 1617, column: 12, scope: !1858)
!1858 = distinct !DILexicalBlock(scope: !1848, file: !905, line: 1617, column: 5)
!1859 = !DILocation(line: 1617, column: 10, scope: !1858)
!1860 = !DILocation(line: 1617, column: 17, scope: !1861)
!1861 = !DILexicalBlockFile(scope: !1862, file: !905, discriminator: 1)
!1862 = distinct !DILexicalBlock(scope: !1858, file: !905, line: 1617, column: 5)
!1863 = !DILocation(line: 1617, column: 19, scope: !1861)
!1864 = !DILocation(line: 1617, column: 5, scope: !1861)
!1865 = !DILocation(line: 1618, column: 22, scope: !1862)
!1866 = !DILocation(line: 1618, column: 18, scope: !1862)
!1867 = !DILocation(line: 1618, column: 13, scope: !1862)
!1868 = !DILocation(line: 1618, column: 16, scope: !1862)
!1869 = !DILocation(line: 1618, column: 9, scope: !1862)
!1870 = !DILocation(line: 1617, column: 26, scope: !1871)
!1871 = !DILexicalBlockFile(scope: !1862, file: !905, discriminator: 2)
!1872 = !DILocation(line: 1617, column: 5, scope: !1871)
!1873 = distinct !{!1873, !1874}
!1874 = !DILocation(line: 1617, column: 5, scope: !1848)
!1875 = !DILocation(line: 1619, column: 1, scope: !1848)
!1876 = distinct !DISubprogram(name: "ff_t_sqrt", scope: !905, file: !905, line: 1625, type: !1877, isLocal: false, isDefinition: true, scopeLine: 1626, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !974)
!1877 = !DISubroutineType(types: !1878)
!1878 = !{!898, !897}
!1879 = !DILocalVariable(name: "x", arg: 1, scope: !1876, file: !905, line: 1625, type: !897)
!1880 = !DILocation(line: 1625, column: 28, scope: !1876)
!1881 = !DILocalVariable(name: "s", scope: !1876, file: !905, line: 1627, type: !898)
!1882 = !DILocation(line: 1627, column: 9, scope: !1876)
!1883 = !DILocation(line: 1628, column: 5, scope: !1876)
!1884 = !DILocation(line: 1628, column: 12, scope: !1885)
!1885 = !DILexicalBlockFile(scope: !1876, file: !905, discriminator: 1)
!1886 = !DILocation(line: 1628, column: 14, scope: !1885)
!1887 = !DILocation(line: 1628, column: 5, scope: !1885)
!1888 = !DILocation(line: 1629, column: 10, scope: !1889)
!1889 = distinct !DILexicalBlock(scope: !1876, file: !905, line: 1628, column: 23)
!1890 = !DILocation(line: 1630, column: 11, scope: !1889)
!1891 = !DILocation(line: 1628, column: 5, scope: !1892)
!1892 = !DILexicalBlockFile(scope: !1876, file: !905, discriminator: 2)
!1893 = distinct !{!1893, !1883}
!1894 = !DILocation(line: 1633, column: 20, scope: !1876)
!1895 = !DILocation(line: 1633, column: 22, scope: !1876)
!1896 = !DILocation(line: 1633, column: 12, scope: !1876)
!1897 = !DILocation(line: 1633, column: 32, scope: !1876)
!1898 = !DILocation(line: 1633, column: 29, scope: !1876)
!1899 = !DILocation(line: 1633, column: 5, scope: !1876)
!1900 = distinct !DISubprogram(name: "ff_sqrt", scope: !1901, file: !1901, line: 207, type: !1902, isLocal: true, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !974)
!1901 = !DIFile(filename: "libavcodec/mathops.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1902 = !DISubroutineType(types: !1903)
!1903 = !{!897, !897}
!1904 = !DILocalVariable(name: "a", arg: 1, scope: !1900, file: !1901, line: 207, type: !897)
!1905 = !DILocation(line: 207, column: 72, scope: !1900)
!1906 = !DILocalVariable(name: "b", scope: !1900, file: !1901, line: 209, type: !897)
!1907 = !DILocation(line: 209, column: 18, scope: !1900)
!1908 = !DILocation(line: 211, column: 9, scope: !1909)
!1909 = distinct !DILexicalBlock(scope: !1900, file: !1901, line: 211, column: 9)
!1910 = !DILocation(line: 211, column: 11, scope: !1909)
!1911 = !DILocation(line: 211, column: 9, scope: !1900)
!1912 = !DILocation(line: 211, column: 38, scope: !1913)
!1913 = !DILexicalBlockFile(scope: !1909, file: !1901, discriminator: 1)
!1914 = !DILocation(line: 211, column: 40, scope: !1913)
!1915 = !DILocation(line: 211, column: 26, scope: !1913)
!1916 = !DILocation(line: 211, column: 45, scope: !1913)
!1917 = !DILocation(line: 211, column: 50, scope: !1913)
!1918 = !DILocation(line: 211, column: 18, scope: !1913)
!1919 = !DILocation(line: 212, column: 14, scope: !1920)
!1920 = distinct !DILexicalBlock(scope: !1909, file: !1901, line: 212, column: 14)
!1921 = !DILocation(line: 212, column: 16, scope: !1920)
!1922 = !DILocation(line: 212, column: 14, scope: !1909)
!1923 = !DILocation(line: 212, column: 45, scope: !1924)
!1924 = !DILexicalBlockFile(scope: !1920, file: !1901, discriminator: 1)
!1925 = !DILocation(line: 212, column: 47, scope: !1924)
!1926 = !DILocation(line: 212, column: 33, scope: !1924)
!1927 = !DILocation(line: 212, column: 53, scope: !1924)
!1928 = !DILocation(line: 212, column: 31, scope: !1924)
!1929 = !DILocation(line: 212, column: 29, scope: !1924)
!1930 = !DILocation(line: 214, column: 14, scope: !1931)
!1931 = distinct !DILexicalBlock(scope: !1920, file: !1901, line: 214, column: 14)
!1932 = !DILocation(line: 214, column: 16, scope: !1931)
!1933 = !DILocation(line: 214, column: 14, scope: !1920)
!1934 = !DILocation(line: 214, column: 45, scope: !1935)
!1935 = !DILexicalBlockFile(scope: !1931, file: !1901, discriminator: 1)
!1936 = !DILocation(line: 214, column: 47, scope: !1935)
!1937 = !DILocation(line: 214, column: 33, scope: !1935)
!1938 = !DILocation(line: 214, column: 53, scope: !1935)
!1939 = !DILocation(line: 214, column: 31, scope: !1935)
!1940 = !DILocation(line: 214, column: 29, scope: !1935)
!1941 = !DILocation(line: 215, column: 14, scope: !1942)
!1942 = distinct !DILexicalBlock(scope: !1931, file: !1901, line: 215, column: 14)
!1943 = !DILocation(line: 215, column: 16, scope: !1942)
!1944 = !DILocation(line: 215, column: 14, scope: !1931)
!1945 = !DILocation(line: 215, column: 45, scope: !1946)
!1946 = !DILexicalBlockFile(scope: !1942, file: !1901, discriminator: 1)
!1947 = !DILocation(line: 215, column: 47, scope: !1946)
!1948 = !DILocation(line: 215, column: 33, scope: !1946)
!1949 = !DILocation(line: 215, column: 31, scope: !1946)
!1950 = !DILocation(line: 215, column: 29, scope: !1946)
!1951 = !DILocalVariable(name: "s", scope: !1952, file: !1901, line: 218, type: !898)
