; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mpegutils.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mpegutils.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!847 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!848 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !495, line: 538, size: 32, align: 32, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857}
!850 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!851 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!852 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!853 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!854 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!855 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!856 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!857 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !35, line: 1534, size: 32, align: 32, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865}
!860 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!861 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!862 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!863 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!864 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!865 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !35, line: 810, size: 32, align: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !{i32 2, !"Dwarf Version", i32 4}
!888 = !{i32 2, !"Debug Info Version", i32 3}
!889 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!890 = distinct !DISubprogram(name: "ff_draw_horiz_band", scope: !891, file: !891, line: 51, type: !892, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1495)
!891 = !DIFile(filename: "libavcodec/mpegutils.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!892 = !DISubroutineType(types: !893)
!893 = !{null, !894, !1206, !1206, !918, !918, !918, !918, !918}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64, align: 64)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !896)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !897)
!897 = !{!898, !944, !945, !946, !1218, !1219, !1220, !1221, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1247, !1251, !1252, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1433, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !896, file: !35, line: 1561, baseType: !899, size: 64, align: 64)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64, align: 64)
!900 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !903)
!903 = !{!904, !908, !913, !917, !919, !920, !921, !925, !931, !933, !937}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !902, file: !4, line: 72, baseType: !905, size: 64, align: 64)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !907)
!907 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !902, file: !4, line: 78, baseType: !909, size: 64, align: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64, align: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!905, !912}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !902, file: !4, line: 85, baseType: !914, size: 64, align: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !902, file: !4, line: 93, baseType: !918, size: 32, align: 32, offset: 192)
!918 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !902, file: !4, line: 99, baseType: !918, size: 32, align: 32, offset: 224)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !902, file: !4, line: 108, baseType: !918, size: 32, align: 32, offset: 256)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !902, file: !4, line: 113, baseType: !922, size: 64, align: 64, offset: 320)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!912, !912, !912}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !902, file: !4, line: 123, baseType: !926, size: 64, align: 64, offset: 384)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!929, !929}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !902)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !902, file: !4, line: 130, baseType: !932, size: 32, align: 32, offset: 448)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !902, file: !4, line: 136, baseType: !934, size: 64, align: 64, offset: 512)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!932, !912}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !902, file: !4, line: 142, baseType: !938, size: 64, align: 64, offset: 576)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!918, !941, !912, !905, !918}
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !896, file: !35, line: 1562, baseType: !918, size: 32, align: 32, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !896, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !896, file: !35, line: 1565, baseType: !947, size: 64, align: 64, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !950)
!950 = !{!951, !952, !953, !954, !955, !956, !965, !968, !971, !974, !980, !983, !984, !992, !993, !994, !996, !1000, !1006, !1011, !1015, !1016, !1068, !1189, !1193, !1194, !1198, !1202, !1207, !1211, !1212, !1213}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !949, file: !35, line: 3475, baseType: !905, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !949, file: !35, line: 3480, baseType: !905, size: 64, align: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !949, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !949, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !949, file: !35, line: 3487, baseType: !918, size: 32, align: 32, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !949, file: !35, line: 3488, baseType: !957, size: 64, align: 64, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !960, line: 61, baseType: !961)
!960 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !960, line: 58, size: 64, align: 32, elements: !962)
!962 = !{!963, !964}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !961, file: !960, line: 59, baseType: !918, size: 32, align: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !961, file: !960, line: 60, baseType: !918, size: 32, align: 32, offset: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !949, file: !35, line: 3489, baseType: !966, size: 64, align: 64, offset: 320)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !949, file: !35, line: 3490, baseType: !969, size: 64, align: 64, offset: 384)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !918)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !949, file: !35, line: 3491, baseType: !972, size: 64, align: 64, offset: 448)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !949, file: !35, line: 3492, baseType: !975, size: 64, align: 64, offset: 512)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !978, line: 55, baseType: !979)
!978 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!979 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !949, file: !35, line: 3493, baseType: !981, size: 8, align: 8, offset: 576)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !978, line: 48, baseType: !982)
!982 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !949, file: !35, line: 3494, baseType: !899, size: 64, align: 64, offset: 640)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !949, file: !35, line: 3495, baseType: !985, size: 64, align: 64, offset: 704)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !989)
!989 = !{!990, !991}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !988, file: !35, line: 3402, baseType: !918, size: 32, align: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !988, file: !35, line: 3403, baseType: !905, size: 64, align: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !949, file: !35, line: 3507, baseType: !905, size: 64, align: 64, offset: 768)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !949, file: !35, line: 3516, baseType: !918, size: 32, align: 32, offset: 832)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !949, file: !35, line: 3517, baseType: !995, size: 64, align: 64, offset: 896)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !949, file: !35, line: 3527, baseType: !997, size: 64, align: 64, offset: 960)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!918, !894}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !949, file: !35, line: 3535, baseType: !1001, size: 64, align: 64, offset: 1024)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!918, !894, !1004}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !895)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !949, file: !35, line: 3541, baseType: !1007, size: 64, align: 64, offset: 1088)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1010)
!1010 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !949, file: !35, line: 3549, baseType: !1012, size: 64, align: 64, offset: 1152)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{null, !995}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !949, file: !35, line: 3551, baseType: !997, size: 64, align: 64, offset: 1216)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !949, file: !35, line: 3552, baseType: !1017, size: 64, align: 64, offset: 1280)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!918, !894, !1020, !918, !1021}
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1024)
!1024 = !{!1025, !1028, !1031, !1032, !1033, !1065}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1023, file: !35, line: 3921, baseType: !1026, size: 16, align: 16)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !978, line: 49, baseType: !1027)
!1027 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1023, file: !35, line: 3922, baseType: !1029, size: 32, align: 32, offset: 32)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !978, line: 51, baseType: !1030)
!1030 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1023, file: !35, line: 3923, baseType: !1029, size: 32, align: 32, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1023, file: !35, line: 3924, baseType: !1030, size: 32, align: 32, offset: 96)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1023, file: !35, line: 3925, baseType: !1034, size: 64, align: 64, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1042, !1043, !1044, !1054, !1058, !1060, !1061, !1063, !1064}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1037, file: !35, line: 3886, baseType: !918, size: 32, align: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1037, file: !35, line: 3887, baseType: !918, size: 32, align: 32, offset: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1037, file: !35, line: 3888, baseType: !918, size: 32, align: 32, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1037, file: !35, line: 3889, baseType: !918, size: 32, align: 32, offset: 96)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1037, file: !35, line: 3890, baseType: !918, size: 32, align: 32, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1037, file: !35, line: 3897, baseType: !1045, size: 768, align: 64, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1047)
!1047 = !{!1048, !1052}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1046, file: !35, line: 3855, baseType: !1049, size: 512, align: 64)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1020, size: 512, align: 64, elements: !1050)
!1050 = !{!1051}
!1051 = !DISubrange(count: 8)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1046, file: !35, line: 3857, baseType: !1053, size: 256, align: 32, offset: 512)
!1053 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 256, align: 32, elements: !1050)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1037, file: !35, line: 3903, baseType: !1055, size: 256, align: 64, offset: 960)
!1055 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1020, size: 256, align: 64, elements: !1056)
!1056 = !{!1057}
!1057 = !DISubrange(count: 4)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1037, file: !35, line: 3904, baseType: !1059, size: 128, align: 32, offset: 1216)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 128, align: 32, elements: !1056)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1037, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1037, file: !35, line: 3908, baseType: !1062, size: 64, align: 64, offset: 1408)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1037, file: !35, line: 3915, baseType: !1062, size: 64, align: 64, offset: 1472)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1037, file: !35, line: 3917, baseType: !918, size: 32, align: 32, offset: 1536)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1023, file: !35, line: 3926, baseType: !1066, size: 64, align: 64, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !978, line: 40, baseType: !1067)
!1067 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !949, file: !35, line: 3564, baseType: !1069, size: 64, align: 64, offset: 1344)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!918, !894, !1072, !1106, !1188}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1074)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1075)
!1075 = !{!1076, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1102, !1103, !1104, !1105}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1074, file: !35, line: 1451, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1079, line: 94, baseType: !1080)
!1079 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1079, line: 81, size: 192, align: 64, elements: !1081)
!1081 = !{!1082, !1086, !1087}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1080, file: !1079, line: 82, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1079, line: 73, baseType: !1085)
!1085 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1079, line: 73, flags: DIFlagFwdDecl)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1080, file: !1079, line: 89, baseType: !1020, size: 64, align: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1080, file: !1079, line: 93, baseType: !918, size: 32, align: 32, offset: 128)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1074, file: !35, line: 1461, baseType: !1066, size: 64, align: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1074, file: !35, line: 1467, baseType: !1066, size: 64, align: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1074, file: !35, line: 1468, baseType: !1020, size: 64, align: 64, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1074, file: !35, line: 1469, baseType: !918, size: 32, align: 32, offset: 256)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1074, file: !35, line: 1470, baseType: !918, size: 32, align: 32, offset: 288)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1074, file: !35, line: 1474, baseType: !918, size: 32, align: 32, offset: 320)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1074, file: !35, line: 1479, baseType: !1095, size: 64, align: 64, offset: 384)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1097)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1098)
!1098 = !{!1099, !1100, !1101}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1097, file: !35, line: 1412, baseType: !1020, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1097, file: !35, line: 1413, baseType: !918, size: 32, align: 32, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1097, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1074, file: !35, line: 1480, baseType: !918, size: 32, align: 32, offset: 448)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1074, file: !35, line: 1486, baseType: !1066, size: 64, align: 64, offset: 512)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1074, file: !35, line: 1488, baseType: !1066, size: 64, align: 64, offset: 576)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1074, file: !35, line: 1497, baseType: !1066, size: 64, align: 64, offset: 640)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1108)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1109)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1110)
!1110 = !{!1111, !1112, !1113, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1140, !1142, !1143, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1176, !1177, !1178, !1179, !1180, !1181, !1184, !1185, !1186, !1187}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1109, file: !758, line: 282, baseType: !1049, size: 512, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1109, file: !758, line: 299, baseType: !1053, size: 256, align: 32, offset: 512)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1109, file: !758, line: 315, baseType: !1114, size: 64, align: 64, offset: 768)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1109, file: !758, line: 326, baseType: !918, size: 32, align: 32, offset: 832)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1109, file: !758, line: 326, baseType: !918, size: 32, align: 32, offset: 864)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1109, file: !758, line: 334, baseType: !918, size: 32, align: 32, offset: 896)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1109, file: !758, line: 341, baseType: !918, size: 32, align: 32, offset: 928)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1109, file: !758, line: 346, baseType: !918, size: 32, align: 32, offset: 960)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1109, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1109, file: !758, line: 356, baseType: !959, size: 64, align: 32, offset: 1024)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1109, file: !758, line: 361, baseType: !1066, size: 64, align: 64, offset: 1088)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1109, file: !758, line: 369, baseType: !1066, size: 64, align: 64, offset: 1152)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1109, file: !758, line: 377, baseType: !1066, size: 64, align: 64, offset: 1216)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1109, file: !758, line: 382, baseType: !918, size: 32, align: 32, offset: 1280)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1109, file: !758, line: 386, baseType: !918, size: 32, align: 32, offset: 1312)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1109, file: !758, line: 391, baseType: !918, size: 32, align: 32, offset: 1344)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1109, file: !758, line: 396, baseType: !912, size: 64, align: 64, offset: 1408)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1109, file: !758, line: 403, baseType: !1130, size: 512, align: 64, offset: 1472)
!1130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 512, align: 64, elements: !1050)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1109, file: !758, line: 410, baseType: !918, size: 32, align: 32, offset: 1984)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1109, file: !758, line: 415, baseType: !918, size: 32, align: 32, offset: 2016)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1109, file: !758, line: 420, baseType: !918, size: 32, align: 32, offset: 2048)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1109, file: !758, line: 425, baseType: !918, size: 32, align: 32, offset: 2080)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1109, file: !758, line: 435, baseType: !1066, size: 64, align: 64, offset: 2112)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1109, file: !758, line: 440, baseType: !918, size: 32, align: 32, offset: 2176)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1109, file: !758, line: 445, baseType: !977, size: 64, align: 64, offset: 2240)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1109, file: !758, line: 459, baseType: !1139, size: 512, align: 64, offset: 2304)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1077, size: 512, align: 64, elements: !1050)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1109, file: !758, line: 473, baseType: !1141, size: 64, align: 64, offset: 2816)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1109, file: !758, line: 477, baseType: !918, size: 32, align: 32, offset: 2880)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1109, file: !758, line: 479, baseType: !1144, size: 64, align: 64, offset: 2944)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1147)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1148)
!1148 = !{!1149, !1150, !1151, !1152, !1157}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1147, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1147, file: !758, line: 203, baseType: !1020, size: 64, align: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1147, file: !758, line: 204, baseType: !918, size: 32, align: 32, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1147, file: !758, line: 205, baseType: !1153, size: 64, align: 64, offset: 192)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1155, line: 86, baseType: !1156)
!1155 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1156 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1155, line: 86, flags: DIFlagFwdDecl)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1147, file: !758, line: 206, baseType: !1077, size: 64, align: 64, offset: 256)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1109, file: !758, line: 480, baseType: !918, size: 32, align: 32, offset: 3008)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1109, file: !758, line: 505, baseType: !918, size: 32, align: 32, offset: 3040)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1109, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1109, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1109, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1109, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1109, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1109, file: !758, line: 532, baseType: !1066, size: 64, align: 64, offset: 3264)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1109, file: !758, line: 539, baseType: !1066, size: 64, align: 64, offset: 3328)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1109, file: !758, line: 547, baseType: !1066, size: 64, align: 64, offset: 3392)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1109, file: !758, line: 554, baseType: !1153, size: 64, align: 64, offset: 3456)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1109, file: !758, line: 563, baseType: !918, size: 32, align: 32, offset: 3520)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1109, file: !758, line: 572, baseType: !918, size: 32, align: 32, offset: 3552)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1109, file: !758, line: 581, baseType: !918, size: 32, align: 32, offset: 3584)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1109, file: !758, line: 588, baseType: !1173, size: 64, align: 64, offset: 3648)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !978, line: 36, baseType: !1175)
!1175 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1109, file: !758, line: 593, baseType: !918, size: 32, align: 32, offset: 3712)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1109, file: !758, line: 596, baseType: !918, size: 32, align: 32, offset: 3744)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1109, file: !758, line: 599, baseType: !1077, size: 64, align: 64, offset: 3776)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1109, file: !758, line: 605, baseType: !1077, size: 64, align: 64, offset: 3840)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1109, file: !758, line: 616, baseType: !1077, size: 64, align: 64, offset: 3904)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1109, file: !758, line: 626, baseType: !1182, size: 64, align: 64, offset: 3968)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1183, line: 216, baseType: !979)
!1183 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1109, file: !758, line: 627, baseType: !1182, size: 64, align: 64, offset: 4032)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1109, file: !758, line: 628, baseType: !1182, size: 64, align: 64, offset: 4096)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1109, file: !758, line: 629, baseType: !1182, size: 64, align: 64, offset: 4160)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1109, file: !758, line: 645, baseType: !1077, size: 64, align: 64, offset: 4224)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !949, file: !35, line: 3566, baseType: !1190, size: 64, align: 64, offset: 1408)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!918, !894, !912, !1188, !1072}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !949, file: !35, line: 3567, baseType: !997, size: 64, align: 64, offset: 1472)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !949, file: !35, line: 3576, baseType: !1195, size: 64, align: 64, offset: 1536)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!918, !894, !1106}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !949, file: !35, line: 3577, baseType: !1199, size: 64, align: 64, offset: 1600)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{!918, !894, !1072}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !949, file: !35, line: 3584, baseType: !1203, size: 64, align: 64, offset: 1664)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!918, !894, !1206}
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !949, file: !35, line: 3589, baseType: !1208, size: 64, align: 64, offset: 1728)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{null, !894}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !949, file: !35, line: 3594, baseType: !918, size: 32, align: 32, offset: 1792)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !949, file: !35, line: 3600, baseType: !905, size: 64, align: 64, offset: 1856)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !949, file: !35, line: 3609, baseType: !1214, size: 64, align: 64, offset: 1920)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1217)
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !896, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !896, file: !35, line: 1581, baseType: !1030, size: 32, align: 32, offset: 224)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !896, file: !35, line: 1583, baseType: !912, size: 64, align: 64, offset: 256)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !896, file: !35, line: 1591, baseType: !1222, size: 64, align: 64, offset: 320)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !896, file: !35, line: 1598, baseType: !912, size: 64, align: 64, offset: 384)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !896, file: !35, line: 1606, baseType: !1066, size: 64, align: 64, offset: 448)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !896, file: !35, line: 1614, baseType: !918, size: 32, align: 32, offset: 512)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !896, file: !35, line: 1622, baseType: !918, size: 32, align: 32, offset: 544)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !896, file: !35, line: 1628, baseType: !918, size: 32, align: 32, offset: 576)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !896, file: !35, line: 1636, baseType: !918, size: 32, align: 32, offset: 608)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !896, file: !35, line: 1643, baseType: !918, size: 32, align: 32, offset: 640)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !896, file: !35, line: 1657, baseType: !1020, size: 64, align: 64, offset: 704)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !896, file: !35, line: 1658, baseType: !918, size: 32, align: 32, offset: 768)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !896, file: !35, line: 1679, baseType: !959, size: 64, align: 32, offset: 800)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !896, file: !35, line: 1688, baseType: !918, size: 32, align: 32, offset: 864)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !896, file: !35, line: 1712, baseType: !918, size: 32, align: 32, offset: 896)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !896, file: !35, line: 1729, baseType: !918, size: 32, align: 32, offset: 928)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !896, file: !35, line: 1729, baseType: !918, size: 32, align: 32, offset: 960)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !896, file: !35, line: 1744, baseType: !918, size: 32, align: 32, offset: 992)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !896, file: !35, line: 1744, baseType: !918, size: 32, align: 32, offset: 1024)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !896, file: !35, line: 1751, baseType: !918, size: 32, align: 32, offset: 1056)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !896, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !896, file: !35, line: 1791, baseType: !1243, size: 64, align: 64, offset: 1152)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{null, !1246, !1106, !1188, !918, !918, !918}
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !896, file: !35, line: 1808, baseType: !1248, size: 64, align: 64, offset: 1216)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!494, !1246, !966}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !896, file: !35, line: 1816, baseType: !918, size: 32, align: 32, offset: 1280)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !896, file: !35, line: 1825, baseType: !1253, size: 32, align: 32, offset: 1312)
!1253 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !896, file: !35, line: 1830, baseType: !918, size: 32, align: 32, offset: 1344)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !896, file: !35, line: 1838, baseType: !1253, size: 32, align: 32, offset: 1376)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !896, file: !35, line: 1846, baseType: !918, size: 32, align: 32, offset: 1408)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !896, file: !35, line: 1851, baseType: !918, size: 32, align: 32, offset: 1440)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !896, file: !35, line: 1861, baseType: !1253, size: 32, align: 32, offset: 1472)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !896, file: !35, line: 1868, baseType: !1253, size: 32, align: 32, offset: 1504)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !896, file: !35, line: 1875, baseType: !1253, size: 32, align: 32, offset: 1536)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !896, file: !35, line: 1882, baseType: !1253, size: 32, align: 32, offset: 1568)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !896, file: !35, line: 1889, baseType: !1253, size: 32, align: 32, offset: 1600)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !896, file: !35, line: 1896, baseType: !1253, size: 32, align: 32, offset: 1632)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !896, file: !35, line: 1903, baseType: !1253, size: 32, align: 32, offset: 1664)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !896, file: !35, line: 1910, baseType: !918, size: 32, align: 32, offset: 1696)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !896, file: !35, line: 1915, baseType: !918, size: 32, align: 32, offset: 1728)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !896, file: !35, line: 1926, baseType: !1188, size: 64, align: 64, offset: 1792)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !896, file: !35, line: 1935, baseType: !959, size: 64, align: 32, offset: 1856)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !896, file: !35, line: 1942, baseType: !918, size: 32, align: 32, offset: 1920)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !896, file: !35, line: 1948, baseType: !918, size: 32, align: 32, offset: 1952)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !896, file: !35, line: 1954, baseType: !918, size: 32, align: 32, offset: 1984)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !896, file: !35, line: 1960, baseType: !918, size: 32, align: 32, offset: 2016)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !896, file: !35, line: 1984, baseType: !918, size: 32, align: 32, offset: 2048)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !896, file: !35, line: 1991, baseType: !918, size: 32, align: 32, offset: 2080)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !896, file: !35, line: 1996, baseType: !918, size: 32, align: 32, offset: 2112)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !896, file: !35, line: 2004, baseType: !918, size: 32, align: 32, offset: 2144)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !896, file: !35, line: 2011, baseType: !918, size: 32, align: 32, offset: 2176)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !896, file: !35, line: 2018, baseType: !918, size: 32, align: 32, offset: 2208)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !896, file: !35, line: 2027, baseType: !918, size: 32, align: 32, offset: 2240)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !896, file: !35, line: 2034, baseType: !918, size: 32, align: 32, offset: 2272)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !896, file: !35, line: 2044, baseType: !918, size: 32, align: 32, offset: 2304)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !896, file: !35, line: 2054, baseType: !1283, size: 64, align: 64, offset: 2368)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !896, file: !35, line: 2061, baseType: !1283, size: 64, align: 64, offset: 2432)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !896, file: !35, line: 2066, baseType: !918, size: 32, align: 32, offset: 2496)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !896, file: !35, line: 2070, baseType: !918, size: 32, align: 32, offset: 2528)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !896, file: !35, line: 2078, baseType: !918, size: 32, align: 32, offset: 2560)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !896, file: !35, line: 2085, baseType: !918, size: 32, align: 32, offset: 2592)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !896, file: !35, line: 2092, baseType: !918, size: 32, align: 32, offset: 2624)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !896, file: !35, line: 2099, baseType: !918, size: 32, align: 32, offset: 2656)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !896, file: !35, line: 2106, baseType: !918, size: 32, align: 32, offset: 2688)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !896, file: !35, line: 2113, baseType: !918, size: 32, align: 32, offset: 2720)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !896, file: !35, line: 2120, baseType: !918, size: 32, align: 32, offset: 2752)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !896, file: !35, line: 2125, baseType: !918, size: 32, align: 32, offset: 2784)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !896, file: !35, line: 2133, baseType: !918, size: 32, align: 32, offset: 2816)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !896, file: !35, line: 2140, baseType: !918, size: 32, align: 32, offset: 2848)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !896, file: !35, line: 2145, baseType: !918, size: 32, align: 32, offset: 2880)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !896, file: !35, line: 2153, baseType: !918, size: 32, align: 32, offset: 2912)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !896, file: !35, line: 2158, baseType: !918, size: 32, align: 32, offset: 2944)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !896, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !896, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !896, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !896, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !896, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !896, file: !35, line: 2203, baseType: !918, size: 32, align: 32, offset: 3136)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !896, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !896, file: !35, line: 2212, baseType: !918, size: 32, align: 32, offset: 3200)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !896, file: !35, line: 2213, baseType: !918, size: 32, align: 32, offset: 3232)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !896, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !896, file: !35, line: 2232, baseType: !918, size: 32, align: 32, offset: 3296)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !896, file: !35, line: 2243, baseType: !918, size: 32, align: 32, offset: 3328)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !896, file: !35, line: 2249, baseType: !918, size: 32, align: 32, offset: 3360)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !896, file: !35, line: 2256, baseType: !918, size: 32, align: 32, offset: 3392)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !896, file: !35, line: 2263, baseType: !977, size: 64, align: 64, offset: 3456)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !896, file: !35, line: 2270, baseType: !977, size: 64, align: 64, offset: 3520)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !896, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !896, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !896, file: !35, line: 2367, baseType: !1319, size: 64, align: 64, offset: 3648)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!918, !1246, !1206, !918}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !896, file: !35, line: 2383, baseType: !918, size: 32, align: 32, offset: 3712)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !896, file: !35, line: 2386, baseType: !1253, size: 32, align: 32, offset: 3744)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !896, file: !35, line: 2387, baseType: !1253, size: 32, align: 32, offset: 3776)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !896, file: !35, line: 2394, baseType: !918, size: 32, align: 32, offset: 3808)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !896, file: !35, line: 2401, baseType: !918, size: 32, align: 32, offset: 3840)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !896, file: !35, line: 2408, baseType: !918, size: 32, align: 32, offset: 3872)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !896, file: !35, line: 2415, baseType: !918, size: 32, align: 32, offset: 3904)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !896, file: !35, line: 2422, baseType: !918, size: 32, align: 32, offset: 3936)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !896, file: !35, line: 2423, baseType: !1331, size: 64, align: 64, offset: 3968)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1333)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1334)
!1334 = !{!1335, !1336, !1337, !1338}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1333, file: !35, line: 827, baseType: !918, size: 32, align: 32)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1333, file: !35, line: 828, baseType: !918, size: 32, align: 32, offset: 32)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1333, file: !35, line: 829, baseType: !918, size: 32, align: 32, offset: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1333, file: !35, line: 830, baseType: !1253, size: 32, align: 32, offset: 96)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !896, file: !35, line: 2430, baseType: !1066, size: 64, align: 64, offset: 4032)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !896, file: !35, line: 2437, baseType: !1066, size: 64, align: 64, offset: 4096)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !896, file: !35, line: 2444, baseType: !1253, size: 32, align: 32, offset: 4160)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !896, file: !35, line: 2451, baseType: !1253, size: 32, align: 32, offset: 4192)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !896, file: !35, line: 2458, baseType: !918, size: 32, align: 32, offset: 4224)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !896, file: !35, line: 2469, baseType: !918, size: 32, align: 32, offset: 4256)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !896, file: !35, line: 2475, baseType: !918, size: 32, align: 32, offset: 4288)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !896, file: !35, line: 2481, baseType: !918, size: 32, align: 32, offset: 4320)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !896, file: !35, line: 2485, baseType: !918, size: 32, align: 32, offset: 4352)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !896, file: !35, line: 2489, baseType: !918, size: 32, align: 32, offset: 4384)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !896, file: !35, line: 2493, baseType: !918, size: 32, align: 32, offset: 4416)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !896, file: !35, line: 2501, baseType: !918, size: 32, align: 32, offset: 4448)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !896, file: !35, line: 2506, baseType: !918, size: 32, align: 32, offset: 4480)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !896, file: !35, line: 2510, baseType: !918, size: 32, align: 32, offset: 4512)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !896, file: !35, line: 2514, baseType: !1066, size: 64, align: 64, offset: 4544)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !896, file: !35, line: 2528, baseType: !1355, size: 64, align: 64, offset: 4608)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{null, !1246, !912, !918, !918}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !896, file: !35, line: 2534, baseType: !918, size: 32, align: 32, offset: 4672)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !896, file: !35, line: 2545, baseType: !918, size: 32, align: 32, offset: 4704)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !896, file: !35, line: 2547, baseType: !918, size: 32, align: 32, offset: 4736)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !896, file: !35, line: 2549, baseType: !918, size: 32, align: 32, offset: 4768)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !896, file: !35, line: 2551, baseType: !918, size: 32, align: 32, offset: 4800)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !896, file: !35, line: 2553, baseType: !918, size: 32, align: 32, offset: 4832)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !896, file: !35, line: 2555, baseType: !918, size: 32, align: 32, offset: 4864)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !896, file: !35, line: 2557, baseType: !918, size: 32, align: 32, offset: 4896)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !896, file: !35, line: 2559, baseType: !918, size: 32, align: 32, offset: 4928)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !896, file: !35, line: 2563, baseType: !918, size: 32, align: 32, offset: 4960)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !896, file: !35, line: 2571, baseType: !1062, size: 64, align: 64, offset: 4992)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !896, file: !35, line: 2579, baseType: !1062, size: 64, align: 64, offset: 5056)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !896, file: !35, line: 2586, baseType: !918, size: 32, align: 32, offset: 5120)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !896, file: !35, line: 2615, baseType: !918, size: 32, align: 32, offset: 5152)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !896, file: !35, line: 2627, baseType: !918, size: 32, align: 32, offset: 5184)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !896, file: !35, line: 2637, baseType: !918, size: 32, align: 32, offset: 5216)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !896, file: !35, line: 2681, baseType: !918, size: 32, align: 32, offset: 5248)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !896, file: !35, line: 2709, baseType: !1066, size: 64, align: 64, offset: 5312)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !896, file: !35, line: 2716, baseType: !1377, size: 64, align: 64, offset: 5376)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1379)
!1379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1380)
!1380 = !{!1381, !1382, !1383, !1384, !1385, !1386, !1387, !1393, !1397, !1398, !1399, !1400, !1406, !1407, !1408, !1409, !1410}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1379, file: !35, line: 3642, baseType: !905, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1379, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1379, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1379, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1379, file: !35, line: 3669, baseType: !918, size: 32, align: 32, offset: 160)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1379, file: !35, line: 3682, baseType: !1203, size: 64, align: 64, offset: 192)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1379, file: !35, line: 3698, baseType: !1388, size: 64, align: 64, offset: 256)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DISubroutineType(types: !1390)
!1390 = !{!918, !894, !1391, !1029}
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1379, file: !35, line: 3712, baseType: !1394, size: 64, align: 64, offset: 320)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DISubroutineType(types: !1396)
!1396 = !{!918, !894, !918, !1391, !1029}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1379, file: !35, line: 3726, baseType: !1388, size: 64, align: 64, offset: 384)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1379, file: !35, line: 3737, baseType: !997, size: 64, align: 64, offset: 448)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1379, file: !35, line: 3746, baseType: !918, size: 32, align: 32, offset: 512)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1379, file: !35, line: 3757, baseType: !1401, size: 64, align: 64, offset: 576)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DISubroutineType(types: !1403)
!1403 = !{null, !1404}
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1379, file: !35, line: 3766, baseType: !997, size: 64, align: 64, offset: 640)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1379, file: !35, line: 3774, baseType: !997, size: 64, align: 64, offset: 704)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1379, file: !35, line: 3780, baseType: !918, size: 32, align: 32, offset: 768)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1379, file: !35, line: 3785, baseType: !918, size: 32, align: 32, offset: 800)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1379, file: !35, line: 3795, baseType: !1411, size: 64, align: 64, offset: 832)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DISubroutineType(types: !1413)
!1413 = !{!918, !894, !1077}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !896, file: !35, line: 2728, baseType: !912, size: 64, align: 64, offset: 5440)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !896, file: !35, line: 2735, baseType: !1130, size: 512, align: 64, offset: 5504)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !896, file: !35, line: 2742, baseType: !918, size: 32, align: 32, offset: 6016)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !896, file: !35, line: 2755, baseType: !918, size: 32, align: 32, offset: 6048)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !896, file: !35, line: 2776, baseType: !918, size: 32, align: 32, offset: 6080)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !896, file: !35, line: 2783, baseType: !918, size: 32, align: 32, offset: 6112)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !896, file: !35, line: 2791, baseType: !918, size: 32, align: 32, offset: 6144)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !896, file: !35, line: 2802, baseType: !1206, size: 64, align: 64, offset: 6208)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !896, file: !35, line: 2811, baseType: !918, size: 32, align: 32, offset: 6272)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !896, file: !35, line: 2821, baseType: !918, size: 32, align: 32, offset: 6304)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !896, file: !35, line: 2830, baseType: !918, size: 32, align: 32, offset: 6336)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !896, file: !35, line: 2840, baseType: !918, size: 32, align: 32, offset: 6368)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !896, file: !35, line: 2851, baseType: !1427, size: 64, align: 64, offset: 6400)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{!918, !1246, !1430, !912, !1188, !918, !918}
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DISubroutineType(types: !1432)
!1432 = !{!918, !1246, !912}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !896, file: !35, line: 2871, baseType: !1434, size: 64, align: 64, offset: 6464)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DISubroutineType(types: !1436)
!1436 = !{!918, !1246, !1437, !912, !1188, !918}
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DISubroutineType(types: !1439)
!1439 = !{!918, !1246, !912, !918, !918}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !896, file: !35, line: 2878, baseType: !918, size: 32, align: 32, offset: 6528)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !896, file: !35, line: 2885, baseType: !918, size: 32, align: 32, offset: 6560)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !896, file: !35, line: 3005, baseType: !918, size: 32, align: 32, offset: 6592)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !896, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !896, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !896, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !896, file: !35, line: 3037, baseType: !1020, size: 64, align: 64, offset: 6720)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !896, file: !35, line: 3038, baseType: !918, size: 32, align: 32, offset: 6784)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !896, file: !35, line: 3050, baseType: !977, size: 64, align: 64, offset: 6848)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !896, file: !35, line: 3065, baseType: !918, size: 32, align: 32, offset: 6912)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !896, file: !35, line: 3083, baseType: !918, size: 32, align: 32, offset: 6944)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !896, file: !35, line: 3092, baseType: !959, size: 64, align: 32, offset: 6976)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !896, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !896, file: !35, line: 3106, baseType: !959, size: 64, align: 32, offset: 7072)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !896, file: !35, line: 3113, baseType: !1455, size: 64, align: 64, offset: 7168)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1457)
!1457 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1458)
!1458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1459)
!1459 = !{!1460, !1461, !1462, !1463, !1464, !1465, !1468}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1458, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1458, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1458, file: !35, line: 720, baseType: !905, size: 64, align: 64, offset: 64)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1458, file: !35, line: 724, baseType: !905, size: 64, align: 64, offset: 128)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1458, file: !35, line: 728, baseType: !918, size: 32, align: 32, offset: 192)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1458, file: !35, line: 734, baseType: !1466, size: 64, align: 64, offset: 256)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1458, file: !35, line: 739, baseType: !1469, size: 64, align: 64, offset: 320)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !896, file: !35, line: 3129, baseType: !1066, size: 64, align: 64, offset: 7232)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !896, file: !35, line: 3130, baseType: !1066, size: 64, align: 64, offset: 7296)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !896, file: !35, line: 3131, baseType: !1066, size: 64, align: 64, offset: 7360)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !896, file: !35, line: 3132, baseType: !1066, size: 64, align: 64, offset: 7424)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !896, file: !35, line: 3139, baseType: !1062, size: 64, align: 64, offset: 7488)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !896, file: !35, line: 3147, baseType: !918, size: 32, align: 32, offset: 7552)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !896, file: !35, line: 3165, baseType: !918, size: 32, align: 32, offset: 7584)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !896, file: !35, line: 3172, baseType: !918, size: 32, align: 32, offset: 7616)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !896, file: !35, line: 3180, baseType: !918, size: 32, align: 32, offset: 7648)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !896, file: !35, line: 3191, baseType: !1283, size: 64, align: 64, offset: 7680)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !896, file: !35, line: 3199, baseType: !1020, size: 64, align: 64, offset: 7744)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !896, file: !35, line: 3207, baseType: !1062, size: 64, align: 64, offset: 7808)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !896, file: !35, line: 3214, baseType: !1030, size: 32, align: 32, offset: 7872)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !896, file: !35, line: 3224, baseType: !1095, size: 64, align: 64, offset: 7936)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !896, file: !35, line: 3225, baseType: !918, size: 32, align: 32, offset: 8000)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !896, file: !35, line: 3249, baseType: !1077, size: 64, align: 64, offset: 8064)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !896, file: !35, line: 3256, baseType: !918, size: 32, align: 32, offset: 8128)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !896, file: !35, line: 3271, baseType: !918, size: 32, align: 32, offset: 8160)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !896, file: !35, line: 3279, baseType: !1066, size: 64, align: 64, offset: 8192)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !896, file: !35, line: 3301, baseType: !1077, size: 64, align: 64, offset: 8256)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !896, file: !35, line: 3310, baseType: !918, size: 32, align: 32, offset: 8320)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !896, file: !35, line: 3337, baseType: !918, size: 32, align: 32, offset: 8352)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !896, file: !35, line: 3351, baseType: !918, size: 32, align: 32, offset: 8384)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !896, file: !35, line: 3359, baseType: !918, size: 32, align: 32, offset: 8416)
!1495 = !{}
!1496 = !DILocalVariable(name: "avctx", arg: 1, scope: !890, file: !891, line: 51, type: !894)
!1497 = !DIExpression()
!1498 = !DILocation(line: 51, column: 41, scope: !890)
!1499 = !DILocalVariable(name: "cur", arg: 2, scope: !890, file: !891, line: 52, type: !1206)
!1500 = !DILocation(line: 52, column: 34, scope: !890)
!1501 = !DILocalVariable(name: "last", arg: 3, scope: !890, file: !891, line: 52, type: !1206)
!1502 = !DILocation(line: 52, column: 48, scope: !890)
!1503 = !DILocalVariable(name: "y", arg: 4, scope: !890, file: !891, line: 53, type: !918)
!1504 = !DILocation(line: 53, column: 29, scope: !890)
!1505 = !DILocalVariable(name: "h", arg: 5, scope: !890, file: !891, line: 53, type: !918)
!1506 = !DILocation(line: 53, column: 36, scope: !890)
!1507 = !DILocalVariable(name: "picture_structure", arg: 6, scope: !890, file: !891, line: 53, type: !918)
!1508 = !DILocation(line: 53, column: 43, scope: !890)
!1509 = !DILocalVariable(name: "first_field", arg: 7, scope: !890, file: !891, line: 54, type: !918)
!1510 = !DILocation(line: 54, column: 29, scope: !890)
!1511 = !DILocalVariable(name: "low_delay", arg: 8, scope: !890, file: !891, line: 54, type: !918)
!1512 = !DILocation(line: 54, column: 46, scope: !890)
!1513 = !DILocalVariable(name: "desc", scope: !890, file: !891, line: 56, type: !1514)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1516)
!1516 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPixFmtDescriptor", file: !1517, line: 123, baseType: !1518)
!1517 = !DIFile(filename: "./libavutil/pixdesc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPixFmtDescriptor", file: !1517, line: 81, size: 1280, align: 64, elements: !1519)
!1519 = !{!1520, !1521, !1522, !1523, !1524, !1525, !1538}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1518, file: !1517, line: 82, baseType: !905, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1518, file: !1517, line: 83, baseType: !981, size: 8, align: 8, offset: 64)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_w", scope: !1518, file: !1517, line: 92, baseType: !981, size: 8, align: 8, offset: 72)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_h", scope: !1518, file: !1517, line: 101, baseType: !981, size: 8, align: 8, offset: 80)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1518, file: !1517, line: 106, baseType: !977, size: 64, align: 64, offset: 128)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !1518, file: !1517, line: 117, baseType: !1526, size: 1024, align: 32, offset: 192)
!1526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1527, size: 1024, align: 32, elements: !1056)
!1527 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVComponentDescriptor", file: !1517, line: 70, baseType: !1528)
!1528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVComponentDescriptor", file: !1517, line: 31, size: 256, align: 32, elements: !1529)
!1529 = !{!1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !1528, file: !1517, line: 35, baseType: !918, size: 32, align: 32)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !1528, file: !1517, line: 41, baseType: !918, size: 32, align: 32, offset: 32)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1528, file: !1517, line: 47, baseType: !918, size: 32, align: 32, offset: 64)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !1528, file: !1517, line: 53, baseType: !918, size: 32, align: 32, offset: 96)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1528, file: !1517, line: 58, baseType: !918, size: 32, align: 32, offset: 128)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "step_minus1", scope: !1528, file: !1517, line: 62, baseType: !918, size: 32, align: 32, offset: 160)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "depth_minus1", scope: !1528, file: !1517, line: 65, baseType: !918, size: 32, align: 32, offset: 192)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "offset_plus1", scope: !1528, file: !1517, line: 68, baseType: !918, size: 32, align: 32, offset: 224)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1518, file: !1517, line: 122, baseType: !905, size: 64, align: 64, offset: 1216)
!1539 = !DILocation(line: 56, column: 31, scope: !890)
!1540 = !DILocation(line: 56, column: 58, scope: !890)
!1541 = !DILocation(line: 56, column: 65, scope: !890)
!1542 = !DILocation(line: 56, column: 38, scope: !890)
!1543 = !DILocalVariable(name: "vshift", scope: !890, file: !891, line: 57, type: !918)
!1544 = !DILocation(line: 57, column: 9, scope: !890)
!1545 = !DILocation(line: 57, column: 18, scope: !890)
!1546 = !DILocation(line: 57, column: 24, scope: !890)
!1547 = !DILocalVariable(name: "field_pic", scope: !890, file: !891, line: 58, type: !970)
!1548 = !DILocation(line: 58, column: 15, scope: !890)
!1549 = !DILocation(line: 58, column: 27, scope: !890)
!1550 = !DILocation(line: 58, column: 45, scope: !890)
!1551 = !DILocation(line: 59, column: 9, scope: !1552)
!1552 = distinct !DILexicalBlock(scope: !890, file: !891, line: 59, column: 9)
!1553 = !DILocation(line: 59, column: 9, scope: !890)
!1554 = !DILocation(line: 60, column: 11, scope: !1555)
!1555 = distinct !DILexicalBlock(scope: !1552, file: !891, line: 59, column: 20)
!1556 = !DILocation(line: 61, column: 11, scope: !1555)
!1557 = !DILocation(line: 62, column: 5, scope: !1555)
!1558 = !DILocation(line: 64, column: 11, scope: !890)
!1559 = !DILocation(line: 64, column: 17, scope: !890)
!1560 = !DILocation(line: 64, column: 24, scope: !890)
!1561 = !DILocation(line: 64, column: 33, scope: !890)
!1562 = !DILocation(line: 64, column: 31, scope: !890)
!1563 = !DILocation(line: 64, column: 14, scope: !890)
!1564 = !DILocation(line: 64, column: 10, scope: !890)
!1565 = !DILocation(line: 64, column: 39, scope: !1566)
!1566 = !DILexicalBlockFile(scope: !890, file: !891, discriminator: 1)
!1567 = !DILocation(line: 64, column: 46, scope: !1566)
!1568 = !DILocation(line: 64, column: 55, scope: !1566)
!1569 = !DILocation(line: 64, column: 53, scope: !1566)
!1570 = !DILocation(line: 64, column: 10, scope: !1566)
!1571 = !DILocation(line: 64, column: 61, scope: !1572)
!1572 = !DILexicalBlockFile(scope: !890, file: !891, discriminator: 2)
!1573 = !DILocation(line: 64, column: 10, scope: !1572)
!1574 = !DILocation(line: 64, column: 10, scope: !1575)
!1575 = !DILexicalBlockFile(scope: !890, file: !891, discriminator: 3)
!1576 = !DILocation(line: 64, column: 7, scope: !1575)
!1577 = !DILocation(line: 66, column: 9, scope: !1578)
!1578 = distinct !DILexicalBlock(scope: !890, file: !891, line: 66, column: 9)
!1579 = !DILocation(line: 66, column: 19, scope: !1578)
!1580 = !DILocation(line: 66, column: 22, scope: !1581)
!1581 = !DILexicalBlockFile(scope: !1578, file: !891, discriminator: 1)
!1582 = !DILocation(line: 66, column: 34, scope: !1581)
!1583 = !DILocation(line: 67, column: 11, scope: !1578)
!1584 = !DILocation(line: 67, column: 18, scope: !1578)
!1585 = !DILocation(line: 67, column: 30, scope: !1578)
!1586 = !DILocation(line: 66, column: 9, scope: !1572)
!1587 = !DILocation(line: 68, column: 9, scope: !1578)
!1588 = !DILocation(line: 70, column: 9, scope: !1589)
!1589 = distinct !DILexicalBlock(scope: !890, file: !891, line: 70, column: 9)
!1590 = !DILocation(line: 70, column: 16, scope: !1589)
!1591 = !DILocation(line: 70, column: 9, scope: !890)
!1592 = !DILocalVariable(name: "src", scope: !1593, file: !891, line: 71, type: !1206)
!1593 = distinct !DILexicalBlock(scope: !1589, file: !891, line: 70, column: 33)
!1594 = !DILocation(line: 71, column: 18, scope: !1593)
!1595 = !DILocalVariable(name: "offset", scope: !1593, file: !891, line: 72, type: !1053)
!1596 = !DILocation(line: 72, column: 13, scope: !1593)
!1597 = !DILocalVariable(name: "i", scope: !1593, file: !891, line: 73, type: !918)
!1598 = !DILocation(line: 73, column: 13, scope: !1593)
!1599 = !DILocation(line: 75, column: 13, scope: !1600)
!1600 = distinct !DILexicalBlock(scope: !1593, file: !891, line: 75, column: 13)
!1601 = !DILocation(line: 75, column: 18, scope: !1600)
!1602 = !DILocation(line: 75, column: 28, scope: !1600)
!1603 = !DILocation(line: 75, column: 49, scope: !1600)
!1604 = !DILocation(line: 75, column: 52, scope: !1605)
!1605 = !DILexicalBlockFile(scope: !1600, file: !891, discriminator: 1)
!1606 = !DILocation(line: 75, column: 62, scope: !1605)
!1607 = !DILocation(line: 76, column: 13, scope: !1600)
!1608 = !DILocation(line: 76, column: 20, scope: !1600)
!1609 = !DILocation(line: 76, column: 32, scope: !1600)
!1610 = !DILocation(line: 75, column: 13, scope: !1611)
!1611 = !DILexicalBlockFile(scope: !1593, file: !891, discriminator: 2)
!1612 = !DILocation(line: 77, column: 19, scope: !1600)
!1613 = !DILocation(line: 77, column: 17, scope: !1600)
!1614 = !DILocation(line: 77, column: 13, scope: !1600)
!1615 = !DILocation(line: 78, column: 18, scope: !1616)
!1616 = distinct !DILexicalBlock(scope: !1600, file: !891, line: 78, column: 18)
!1617 = !DILocation(line: 78, column: 18, scope: !1600)
!1618 = !DILocation(line: 79, column: 19, scope: !1616)
!1619 = !DILocation(line: 79, column: 17, scope: !1616)
!1620 = !DILocation(line: 79, column: 13, scope: !1616)
!1621 = !DILocation(line: 81, column: 13, scope: !1616)
!1622 = !DILocation(line: 83, column: 13, scope: !1623)
!1623 = distinct !DILexicalBlock(scope: !1593, file: !891, line: 83, column: 13)
!1624 = !DILocation(line: 83, column: 18, scope: !1623)
!1625 = !DILocation(line: 83, column: 28, scope: !1623)
!1626 = !DILocation(line: 83, column: 49, scope: !1623)
!1627 = !DILocation(line: 84, column: 13, scope: !1623)
!1628 = !DILocation(line: 84, column: 31, scope: !1623)
!1629 = !DILocation(line: 84, column: 36, scope: !1623)
!1630 = !DILocation(line: 85, column: 13, scope: !1623)
!1631 = !DILocation(line: 85, column: 20, scope: !1623)
!1632 = !DILocation(line: 85, column: 29, scope: !1623)
!1633 = !DILocation(line: 83, column: 13, scope: !1634)
!1634 = !DILexicalBlockFile(scope: !1593, file: !891, discriminator: 1)
!1635 = !DILocation(line: 86, column: 20, scope: !1636)
!1636 = distinct !DILexicalBlock(scope: !1637, file: !891, line: 86, column: 13)
!1637 = distinct !DILexicalBlock(scope: !1623, file: !891, line: 85, column: 50)
!1638 = !DILocation(line: 86, column: 18, scope: !1636)
!1639 = !DILocation(line: 86, column: 25, scope: !1640)
!1640 = !DILexicalBlockFile(scope: !1641, file: !891, discriminator: 1)
!1641 = distinct !DILexicalBlock(scope: !1636, file: !891, line: 86, column: 13)
!1642 = !DILocation(line: 86, column: 27, scope: !1640)
!1643 = !DILocation(line: 86, column: 13, scope: !1640)
!1644 = !DILocation(line: 87, column: 24, scope: !1641)
!1645 = !DILocation(line: 87, column: 17, scope: !1641)
!1646 = !DILocation(line: 87, column: 27, scope: !1641)
!1647 = !DILocation(line: 86, column: 33, scope: !1648)
!1648 = !DILexicalBlockFile(scope: !1641, file: !891, discriminator: 2)
!1649 = !DILocation(line: 86, column: 13, scope: !1648)
!1650 = distinct !{!1650, !1651}
!1651 = !DILocation(line: 86, column: 13, scope: !1637)
!1652 = !DILocation(line: 88, column: 9, scope: !1637)
!1653 = !DILocation(line: 89, column: 24, scope: !1654)
!1654 = distinct !DILexicalBlock(scope: !1623, file: !891, line: 88, column: 16)
!1655 = !DILocation(line: 89, column: 28, scope: !1654)
!1656 = !DILocation(line: 89, column: 33, scope: !1654)
!1657 = !DILocation(line: 89, column: 26, scope: !1654)
!1658 = !DILocation(line: 89, column: 13, scope: !1654)
!1659 = !DILocation(line: 89, column: 22, scope: !1654)
!1660 = !DILocation(line: 91, column: 25, scope: !1654)
!1661 = !DILocation(line: 91, column: 30, scope: !1654)
!1662 = !DILocation(line: 91, column: 27, scope: !1654)
!1663 = !DILocation(line: 91, column: 40, scope: !1654)
!1664 = !DILocation(line: 91, column: 45, scope: !1654)
!1665 = !DILocation(line: 91, column: 38, scope: !1654)
!1666 = !DILocation(line: 91, column: 13, scope: !1654)
!1667 = !DILocation(line: 91, column: 22, scope: !1654)
!1668 = !DILocation(line: 90, column: 13, scope: !1654)
!1669 = !DILocation(line: 90, column: 22, scope: !1654)
!1670 = !DILocation(line: 92, column: 20, scope: !1671)
!1671 = distinct !DILexicalBlock(scope: !1654, file: !891, line: 92, column: 13)
!1672 = !DILocation(line: 92, column: 18, scope: !1671)
!1673 = !DILocation(line: 92, column: 25, scope: !1674)
!1674 = !DILexicalBlockFile(scope: !1675, file: !891, discriminator: 1)
!1675 = distinct !DILexicalBlock(scope: !1671, file: !891, line: 92, column: 13)
!1676 = !DILocation(line: 92, column: 27, scope: !1674)
!1677 = !DILocation(line: 92, column: 13, scope: !1674)
!1678 = !DILocation(line: 93, column: 24, scope: !1675)
!1679 = !DILocation(line: 93, column: 17, scope: !1675)
!1680 = !DILocation(line: 93, column: 27, scope: !1675)
!1681 = !DILocation(line: 92, column: 33, scope: !1682)
!1682 = !DILexicalBlockFile(scope: !1675, file: !891, discriminator: 2)
!1683 = !DILocation(line: 92, column: 13, scope: !1682)
!1684 = distinct !{!1684, !1685}
!1685 = !DILocation(line: 92, column: 13, scope: !1654)
!1686 = !DILocation(line: 46, column: 9, scope: !1687, inlinedAt: !1691)
!1687 = distinct !DISubprogram(name: "emms_c", scope: !1688, file: !1688, line: 37, type: !1689, isLocal: true, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1495)
!1688 = !DIFile(filename: "./libavutil/x86/emms.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1689 = !DISubroutineType(types: !1690)
!1690 = !{null}
!1691 = distinct !DILocation(line: 96, column: 9, scope: !1593)
!1692 = !{i32 104993}
!1693 = !DILocation(line: 98, column: 9, scope: !1593)
!1694 = !DILocation(line: 98, column: 16, scope: !1593)
!1695 = !DILocation(line: 98, column: 32, scope: !1593)
!1696 = !DILocation(line: 98, column: 39, scope: !1593)
!1697 = !DILocation(line: 98, column: 44, scope: !1593)
!1698 = !DILocation(line: 99, column: 32, scope: !1593)
!1699 = !DILocation(line: 99, column: 35, scope: !1593)
!1700 = !DILocation(line: 99, column: 54, scope: !1593)
!1701 = !DILocation(line: 100, column: 5, scope: !1593)
!1702 = !DILocation(line: 101, column: 1, scope: !890)
!1703 = distinct !DISubprogram(name: "ff_print_debug_info2", scope: !891, file: !891, line: 103, type: !1704, isLocal: false, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1495)
!1704 = !DISubroutineType(types: !1705)
!1705 = !{null, !894, !1206, !1020, !1706, !1173, !1707, !1188, !918, !918, !918, !918}
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64, align: 64)
!1708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1709, size: 64, align: 64)
!1709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1710, size: 32, align: 16, elements: !1712)
!1710 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !978, line: 37, baseType: !1711)
!1711 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1712 = !{!1713}
!1713 = !DISubrange(count: 2)
!1714 = !DILocalVariable(name: "avctx", arg: 1, scope: !1703, file: !891, line: 103, type: !894)
!1715 = !DILocation(line: 103, column: 43, scope: !1703)
!1716 = !DILocalVariable(name: "pict", arg: 2, scope: !1703, file: !891, line: 103, type: !1206)
!1717 = !DILocation(line: 103, column: 59, scope: !1703)
!1718 = !DILocalVariable(name: "mbskip_table", arg: 3, scope: !1703, file: !891, line: 103, type: !1020)
!1719 = !DILocation(line: 103, column: 74, scope: !1703)
!1720 = !DILocalVariable(name: "mbtype_table", arg: 4, scope: !1703, file: !891, line: 104, type: !1706)
!1721 = !DILocation(line: 104, column: 36, scope: !1703)
!1722 = !DILocalVariable(name: "qscale_table", arg: 5, scope: !1703, file: !891, line: 104, type: !1173)
!1723 = !DILocation(line: 104, column: 58, scope: !1703)
!1724 = !DILocalVariable(name: "motion_val", arg: 6, scope: !1703, file: !891, line: 104, type: !1707)
!1725 = !DILocation(line: 104, column: 82, scope: !1703)
!1726 = !DILocalVariable(name: "low_delay", arg: 7, scope: !1703, file: !891, line: 105, type: !1188)
!1727 = !DILocation(line: 105, column: 31, scope: !1703)
!1728 = !DILocalVariable(name: "mb_width", arg: 8, scope: !1703, file: !891, line: 106, type: !918)
!1729 = !DILocation(line: 106, column: 30, scope: !1703)
!1730 = !DILocalVariable(name: "mb_height", arg: 9, scope: !1703, file: !891, line: 106, type: !918)
!1731 = !DILocation(line: 106, column: 44, scope: !1703)
!1732 = !DILocalVariable(name: "mb_stride", arg: 10, scope: !1703, file: !891, line: 106, type: !918)
!1733 = !DILocation(line: 106, column: 59, scope: !1703)
!1734 = !DILocalVariable(name: "quarter_sample", arg: 11, scope: !1703, file: !891, line: 106, type: !918)
!1735 = !DILocation(line: 106, column: 74, scope: !1703)
!1736 = !DILocation(line: 108, column: 10, scope: !1737)
!1737 = distinct !DILexicalBlock(scope: !1703, file: !891, line: 108, column: 9)
!1738 = !DILocation(line: 108, column: 17, scope: !1737)
!1739 = !DILocation(line: 108, column: 24, scope: !1737)
!1740 = !DILocation(line: 108, column: 37, scope: !1737)
!1741 = !DILocation(line: 108, column: 40, scope: !1742)
!1742 = !DILexicalBlockFile(scope: !1737, file: !891, discriminator: 1)
!1743 = !DILocation(line: 108, column: 53, scope: !1742)
!1744 = !DILocation(line: 108, column: 56, scope: !1745)
!1745 = !DILexicalBlockFile(scope: !1737, file: !891, discriminator: 2)
!1746 = !DILocation(line: 108, column: 9, scope: !1745)
!1747 = !DILocalVariable(name: "shift", scope: !1748, file: !891, line: 109, type: !970)
!1748 = distinct !DILexicalBlock(scope: !1737, file: !891, line: 108, column: 71)
!1749 = !DILocation(line: 109, column: 19, scope: !1748)
!1750 = !DILocation(line: 109, column: 31, scope: !1748)
!1751 = !DILocation(line: 109, column: 29, scope: !1748)
!1752 = !DILocalVariable(name: "scale", scope: !1748, file: !891, line: 110, type: !970)
!1753 = !DILocation(line: 110, column: 19, scope: !1748)
!1754 = !DILocation(line: 110, column: 32, scope: !1748)
!1755 = !DILocation(line: 110, column: 29, scope: !1748)
!1756 = !DILocalVariable(name: "mv_sample_log2", scope: !1748, file: !891, line: 111, type: !970)
!1757 = !DILocation(line: 111, column: 19, scope: !1748)
!1758 = !DILocation(line: 111, column: 36, scope: !1748)
!1759 = !DILocation(line: 111, column: 43, scope: !1748)
!1760 = !DILocation(line: 111, column: 52, scope: !1748)
!1761 = !DILocation(line: 111, column: 72, scope: !1748)
!1762 = !DILocation(line: 111, column: 75, scope: !1763)
!1763 = !DILexicalBlockFile(scope: !1748, file: !891, discriminator: 1)
!1764 = !DILocation(line: 111, column: 82, scope: !1763)
!1765 = !DILocation(line: 111, column: 91, scope: !1763)
!1766 = !DILocation(line: 111, column: 72, scope: !1763)
!1767 = !DILocation(line: 111, column: 36, scope: !1768)
!1768 = !DILexicalBlockFile(scope: !1748, file: !891, discriminator: 2)
!1769 = !DILocation(line: 111, column: 19, scope: !1768)
!1770 = !DILocalVariable(name: "mv_stride", scope: !1748, file: !891, line: 112, type: !970)
!1771 = !DILocation(line: 112, column: 19, scope: !1748)
!1772 = !DILocation(line: 112, column: 32, scope: !1748)
!1773 = !DILocation(line: 112, column: 44, scope: !1748)
!1774 = !DILocation(line: 112, column: 41, scope: !1748)
!1775 = !DILocation(line: 113, column: 37, scope: !1748)
!1776 = !DILocation(line: 113, column: 44, scope: !1748)
!1777 = !DILocation(line: 113, column: 51, scope: !1748)
!1778 = !DILocation(line: 113, column: 54, scope: !1748)
!1779 = !DILocation(line: 112, column: 60, scope: !1748)
!1780 = !DILocalVariable(name: "mb_x", scope: !1748, file: !891, line: 114, type: !918)
!1781 = !DILocation(line: 114, column: 13, scope: !1748)
!1782 = !DILocalVariable(name: "mb_y", scope: !1748, file: !891, line: 114, type: !918)
!1783 = !DILocation(line: 114, column: 19, scope: !1748)
!1784 = !DILocalVariable(name: "mbcount", scope: !1748, file: !891, line: 114, type: !918)
!1785 = !DILocation(line: 114, column: 25, scope: !1748)
!1786 = !DILocalVariable(name: "mvs", scope: !1748, file: !891, line: 118, type: !1787)
!1787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1788, size: 64, align: 64)
!1788 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVMotionVector", file: !1789, line: 55, baseType: !1790)
!1789 = !DIFile(filename: "./libavutil/motion_vector.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVMotionVector", file: !1789, line: 24, size: 320, align: 64, elements: !1791)
!1791 = !{!1792, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803}
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1790, file: !1789, line: 30, baseType: !1793, size: 32, align: 32)
!1793 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !978, line: 38, baseType: !918)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1790, file: !1789, line: 34, baseType: !981, size: 8, align: 8, offset: 32)
