; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--wmavoice.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--wmavoice.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fft_permutation_type", file: !888, line: 77, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/fft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!889 = !{!890, !891, !892}
!890 = !DIEnumerator(name: "FF_FFT_PERM_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "FF_FFT_PERM_SWAP_LSBS", value: 1)
!892 = !DIEnumerator(name: "FF_FFT_PERM_AVX", value: 2)
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mdct_permutation_type", file: !888, line: 83, size: 32, align: 32, elements: !894)
!894 = !{!895, !896}
!895 = !DIEnumerator(name: "FF_MDCT_PERM_NONE", value: 0)
!896 = !DIEnumerator(name: "FF_MDCT_PERM_INTERLEAVE", value: 1)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RDFTransformType", file: !898, line: 71, size: 32, align: 32, elements: !899)
!898 = !DIFile(filename: "libavcodec/avfft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!899 = !{!900, !901, !902, !903}
!900 = !DIEnumerator(name: "DFT_R2C", value: 0)
!901 = !DIEnumerator(name: "IDFT_C2R", value: 1)
!902 = !DIEnumerator(name: "IDFT_R2C", value: 2)
!903 = !DIEnumerator(name: "DFT_C2R", value: 3)
!904 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DCTTransformType", file: !898, line: 93, size: 32, align: 32, elements: !905)
!905 = !{!906, !907, !908, !909}
!906 = !DIEnumerator(name: "DCT_II", value: 0)
!907 = !DIEnumerator(name: "DCT_III", value: 1)
!908 = !DIEnumerator(name: "DCT_I", value: 2)
!909 = !DIEnumerator(name: "DST_I", value: 3)
!910 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !911, line: 68, size: 32, align: 32, elements: !912)
!911 = !DIFile(filename: "libavcodec/wmavoice.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "ACB_TYPE_NONE", value: 0)
!914 = !DIEnumerator(name: "ACB_TYPE_ASYMMETRIC", value: 1)
!915 = !DIEnumerator(name: "ACB_TYPE_HAMMING", value: 2)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !911, line: 83, size: 32, align: 32, elements: !917)
!917 = !{!918, !919, !920, !921}
!918 = !DIEnumerator(name: "FCB_TYPE_SILENCE", value: 0)
!919 = !DIEnumerator(name: "FCB_TYPE_HARDCODED", value: 1)
!920 = !DIEnumerator(name: "FCB_TYPE_AW_PULSES", value: 2)
!921 = !DIEnumerator(name: "FCB_TYPE_EXC_PULSES", value: 3)
!922 = !{!923, !924, !925, !933, !935, !936, !937, !939, !941, !943, !945}
!923 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!924 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !928, line: 221, size: 32, align: 8, elements: !929)
!928 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!929 = !{!930}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !927, file: !928, line: 221, baseType: !931, size: 32, align: 32)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !932, line: 51, baseType: !924)
!932 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !932, line: 48, baseType: !934)
!934 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!938 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !932, line: 49, baseType: !940)
!940 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !932, line: 40, baseType: !942)
!942 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !932, line: 55, baseType: !944)
!944 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!946 = !{!947, !1666, !1671, !1678, !1681, !1688, !1700, !1707, !1711, !1730, !1732, !1733, !1738, !1739, !1743, !1745, !1746, !1747, !1750, !1751, !1755, !1756, !1760, !1765, !1767, !1768, !1772, !1777, !1779, !1780, !1784, !1788, !1792, !1804, !1808, !1995, !2003, !2007, !2011, !2017, !2019, !2020, !2024, !2027, !2031}
!947 = distinct !DIGlobalVariable(name: "ff_wmavoice_decoder", scope: !0, file: !911, line: 1991, type: !948, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_wmavoice_decoder)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !950)
!950 = !{!951, !955, !956, !957, !958, !959, !968, !971, !974, !977, !980, !981, !1022, !1030, !1031, !1032, !1034, !1581, !1587, !1595, !1599, !1600, !1637, !1641, !1645, !1646, !1650, !1654, !1655, !1659, !1660, !1661}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !949, file: !14, line: 3475, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!954 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !949, file: !14, line: 3480, baseType: !952, size: 64, align: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !949, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !949, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !949, file: !14, line: 3487, baseType: !923, size: 32, align: 32, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !949, file: !14, line: 3488, baseType: !960, size: 64, align: 64, offset: 256)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !963, line: 61, baseType: !964)
!963 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !963, line: 58, size: 64, align: 32, elements: !965)
!965 = !{!966, !967}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !964, file: !963, line: 59, baseType: !923, size: 32, align: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !964, file: !963, line: 60, baseType: !923, size: 32, align: 32, offset: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !949, file: !14, line: 3489, baseType: !969, size: 64, align: 64, offset: 320)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !949, file: !14, line: 3490, baseType: !972, size: 64, align: 64, offset: 384)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !949, file: !14, line: 3491, baseType: !975, size: 64, align: 64, offset: 448)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !949, file: !14, line: 3492, baseType: !978, size: 64, align: 64, offset: 512)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !949, file: !14, line: 3493, baseType: !933, size: 8, align: 8, offset: 576)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !949, file: !14, line: 3494, baseType: !982, size: 64, align: 64, offset: 640)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !986)
!986 = !{!987, !988, !992, !996, !997, !998, !999, !1003, !1009, !1011, !1015}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !985, file: !691, line: 72, baseType: !952, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !985, file: !691, line: 78, baseType: !989, size: 64, align: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!952, !936}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !985, file: !691, line: 85, baseType: !993, size: 64, align: 64, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !985, file: !691, line: 93, baseType: !923, size: 32, align: 32, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !985, file: !691, line: 99, baseType: !923, size: 32, align: 32, offset: 224)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !985, file: !691, line: 108, baseType: !923, size: 32, align: 32, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !985, file: !691, line: 113, baseType: !1000, size: 64, align: 64, offset: 320)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!936, !936, !936}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !985, file: !691, line: 123, baseType: !1004, size: 64, align: 64, offset: 384)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!1007, !1007}
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !985, file: !691, line: 130, baseType: !1010, size: 32, align: 32, offset: 448)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !985, file: !691, line: 136, baseType: !1012, size: 64, align: 64, offset: 512)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!1010, !936}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !985, file: !691, line: 142, baseType: !1016, size: 64, align: 64, offset: 576)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!923, !1019, !936, !952, !923}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !949, file: !14, line: 3495, baseType: !1023, size: 64, align: 64, offset: 704)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1025)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1027)
!1027 = !{!1028, !1029}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1026, file: !14, line: 3402, baseType: !923, size: 32, align: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1026, file: !14, line: 3403, baseType: !952, size: 64, align: 64, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !949, file: !14, line: 3507, baseType: !952, size: 64, align: 64, offset: 768)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !949, file: !14, line: 3516, baseType: !923, size: 32, align: 32, offset: 832)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !949, file: !14, line: 3517, baseType: !1033, size: 64, align: 64, offset: 896)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !949, file: !14, line: 3527, baseType: !1035, size: 64, align: 64, offset: 960)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!923, !1038}
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1041)
!1041 = !{!1042, !1043, !1044, !1045, !1048, !1049, !1050, !1051, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1330, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1519, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1040, file: !14, line: 1561, baseType: !982, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1040, file: !14, line: 1562, baseType: !923, size: 32, align: 32, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1040, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1040, file: !14, line: 1565, baseType: !1046, size: 64, align: 64, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1040, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1040, file: !14, line: 1581, baseType: !924, size: 32, align: 32, offset: 224)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1040, file: !14, line: 1583, baseType: !936, size: 64, align: 64, offset: 256)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1040, file: !14, line: 1591, baseType: !1052, size: 64, align: 64, offset: 320)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1054, line: 129, size: 1664, align: 64, elements: !1055)
!1054 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1055 = !{!1056, !1057, !1058, !1059, !1156, !1177, !1178, !1207, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1053, file: !1054, line: 136, baseType: !923, size: 32, align: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1053, file: !1054, line: 151, baseType: !923, size: 32, align: 32, offset: 32)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1053, file: !1054, line: 157, baseType: !923, size: 32, align: 32, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1053, file: !1054, line: 159, baseType: !1060, size: 64, align: 64, offset: 128)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1063)
!1063 = !{!1064, !1068, !1070, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1108, !1110, !1111, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1144, !1145, !1146, !1147, !1148, !1149, !1152, !1153, !1154, !1155}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1062, file: !722, line: 282, baseType: !1065, size: 512, align: 64)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 512, align: 64, elements: !1066)
!1066 = !{!1067}
!1067 = !DISubrange(count: 8)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1062, file: !722, line: 299, baseType: !1069, size: 256, align: 32, offset: 512)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 256, align: 32, elements: !1066)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1062, file: !722, line: 315, baseType: !1071, size: 64, align: 64, offset: 768)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1062, file: !722, line: 326, baseType: !923, size: 32, align: 32, offset: 832)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1062, file: !722, line: 326, baseType: !923, size: 32, align: 32, offset: 864)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1062, file: !722, line: 334, baseType: !923, size: 32, align: 32, offset: 896)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1062, file: !722, line: 341, baseType: !923, size: 32, align: 32, offset: 928)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1062, file: !722, line: 346, baseType: !923, size: 32, align: 32, offset: 960)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1062, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1062, file: !722, line: 356, baseType: !962, size: 64, align: 32, offset: 1024)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1062, file: !722, line: 361, baseType: !941, size: 64, align: 64, offset: 1088)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1062, file: !722, line: 369, baseType: !941, size: 64, align: 64, offset: 1152)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1062, file: !722, line: 377, baseType: !941, size: 64, align: 64, offset: 1216)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1062, file: !722, line: 382, baseType: !923, size: 32, align: 32, offset: 1280)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1062, file: !722, line: 386, baseType: !923, size: 32, align: 32, offset: 1312)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1062, file: !722, line: 391, baseType: !923, size: 32, align: 32, offset: 1344)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1062, file: !722, line: 396, baseType: !936, size: 64, align: 64, offset: 1408)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1062, file: !722, line: 403, baseType: !1087, size: 512, align: 64, offset: 1472)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 512, align: 64, elements: !1066)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1062, file: !722, line: 410, baseType: !923, size: 32, align: 32, offset: 1984)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1062, file: !722, line: 415, baseType: !923, size: 32, align: 32, offset: 2016)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1062, file: !722, line: 420, baseType: !923, size: 32, align: 32, offset: 2048)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1062, file: !722, line: 425, baseType: !923, size: 32, align: 32, offset: 2080)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1062, file: !722, line: 435, baseType: !941, size: 64, align: 64, offset: 2112)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1062, file: !722, line: 440, baseType: !923, size: 32, align: 32, offset: 2176)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1062, file: !722, line: 445, baseType: !943, size: 64, align: 64, offset: 2240)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1062, file: !722, line: 459, baseType: !1096, size: 512, align: 64, offset: 2304)
!1096 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1097, size: 512, align: 64, elements: !1066)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1099, line: 94, baseType: !1100)
!1099 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1099, line: 81, size: 192, align: 64, elements: !1101)
!1101 = !{!1102, !1106, !1107}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1100, file: !1099, line: 82, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1099, line: 73, baseType: !1105)
!1105 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1099, line: 73, flags: DIFlagFwdDecl)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1100, file: !1099, line: 89, baseType: !945, size: 64, align: 64, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1100, file: !1099, line: 93, baseType: !923, size: 32, align: 32, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1062, file: !722, line: 473, baseType: !1109, size: 64, align: 64, offset: 2816)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1062, file: !722, line: 477, baseType: !923, size: 32, align: 32, offset: 2880)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1062, file: !722, line: 479, baseType: !1112, size: 64, align: 64, offset: 2944)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1115)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1116)
!1116 = !{!1117, !1118, !1119, !1120, !1125}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1115, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1115, file: !722, line: 203, baseType: !945, size: 64, align: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1115, file: !722, line: 204, baseType: !923, size: 32, align: 32, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1115, file: !722, line: 205, baseType: !1121, size: 64, align: 64, offset: 192)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1123, line: 86, baseType: !1124)
!1123 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1124 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1123, line: 86, flags: DIFlagFwdDecl)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1115, file: !722, line: 206, baseType: !1097, size: 64, align: 64, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1062, file: !722, line: 480, baseType: !923, size: 32, align: 32, offset: 3008)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1062, file: !722, line: 505, baseType: !923, size: 32, align: 32, offset: 3040)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1062, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1062, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1062, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1062, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1062, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1062, file: !722, line: 532, baseType: !941, size: 64, align: 64, offset: 3264)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1062, file: !722, line: 539, baseType: !941, size: 64, align: 64, offset: 3328)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1062, file: !722, line: 547, baseType: !941, size: 64, align: 64, offset: 3392)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1062, file: !722, line: 554, baseType: !1121, size: 64, align: 64, offset: 3456)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1062, file: !722, line: 563, baseType: !923, size: 32, align: 32, offset: 3520)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1062, file: !722, line: 572, baseType: !923, size: 32, align: 32, offset: 3552)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1062, file: !722, line: 581, baseType: !923, size: 32, align: 32, offset: 3584)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1062, file: !722, line: 588, baseType: !1141, size: 64, align: 64, offset: 3648)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !932, line: 36, baseType: !1143)
!1143 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1062, file: !722, line: 593, baseType: !923, size: 32, align: 32, offset: 3712)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1062, file: !722, line: 596, baseType: !923, size: 32, align: 32, offset: 3744)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1062, file: !722, line: 599, baseType: !1097, size: 64, align: 64, offset: 3776)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1062, file: !722, line: 605, baseType: !1097, size: 64, align: 64, offset: 3840)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1062, file: !722, line: 616, baseType: !1097, size: 64, align: 64, offset: 3904)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1062, file: !722, line: 626, baseType: !1150, size: 64, align: 64, offset: 3968)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1151, line: 216, baseType: !944)
!1151 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1062, file: !722, line: 627, baseType: !1150, size: 64, align: 64, offset: 4032)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1062, file: !722, line: 628, baseType: !1150, size: 64, align: 64, offset: 4096)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1062, file: !722, line: 629, baseType: !1150, size: 64, align: 64, offset: 4160)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1062, file: !722, line: 645, baseType: !1097, size: 64, align: 64, offset: 4224)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1053, file: !1054, line: 161, baseType: !1157, size: 64, align: 64, offset: 192)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1054, line: 117, baseType: !1159)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1054, line: 100, size: 832, align: 64, elements: !1160)
!1160 = !{!1161, !1168, !1169, !1170, !1171, !1172, !1174, !1175, !1176}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1159, file: !1054, line: 105, baseType: !1162, size: 256, align: 64)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1163, size: 256, align: 64, elements: !1166)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1099, line: 238, baseType: !1165)
!1165 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1099, line: 238, flags: DIFlagFwdDecl)
!1166 = !{!1167}
!1167 = !DISubrange(count: 4)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1159, file: !1054, line: 110, baseType: !923, size: 32, align: 32, offset: 256)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1159, file: !1054, line: 111, baseType: !923, size: 32, align: 32, offset: 288)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1159, file: !1054, line: 111, baseType: !923, size: 32, align: 32, offset: 320)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1159, file: !1054, line: 112, baseType: !1069, size: 256, align: 32, offset: 352)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1159, file: !1054, line: 113, baseType: !1173, size: 128, align: 32, offset: 608)
!1173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 128, align: 32, elements: !1166)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1159, file: !1054, line: 114, baseType: !923, size: 32, align: 32, offset: 736)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1159, file: !1054, line: 115, baseType: !923, size: 32, align: 32, offset: 768)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1159, file: !1054, line: 116, baseType: !923, size: 32, align: 32, offset: 800)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1053, file: !1054, line: 163, baseType: !936, size: 64, align: 64, offset: 256)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1053, file: !1054, line: 165, baseType: !1179, size: 128, align: 64, offset: 320)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1054, line: 122, baseType: !1180)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1054, line: 119, size: 128, align: 64, elements: !1181)
!1181 = !{!1182, !1206}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1180, file: !1054, line: 120, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1186)
!1186 = !{!1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1202, !1203, !1204, !1205}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1185, file: !14, line: 1451, baseType: !1097, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1185, file: !14, line: 1461, baseType: !941, size: 64, align: 64, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1185, file: !14, line: 1467, baseType: !941, size: 64, align: 64, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1185, file: !14, line: 1468, baseType: !945, size: 64, align: 64, offset: 192)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1185, file: !14, line: 1469, baseType: !923, size: 32, align: 32, offset: 256)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1185, file: !14, line: 1470, baseType: !923, size: 32, align: 32, offset: 288)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1185, file: !14, line: 1474, baseType: !923, size: 32, align: 32, offset: 320)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1185, file: !14, line: 1479, baseType: !1195, size: 64, align: 64, offset: 384)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1197)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1198)
!1198 = !{!1199, !1200, !1201}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1197, file: !14, line: 1412, baseType: !945, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1197, file: !14, line: 1413, baseType: !923, size: 32, align: 32, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1197, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1185, file: !14, line: 1480, baseType: !923, size: 32, align: 32, offset: 448)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1185, file: !14, line: 1486, baseType: !941, size: 64, align: 64, offset: 512)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1185, file: !14, line: 1488, baseType: !941, size: 64, align: 64, offset: 576)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1185, file: !14, line: 1497, baseType: !941, size: 64, align: 64, offset: 640)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1180, file: !1054, line: 121, baseType: !1060, size: 64, align: 64, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1053, file: !1054, line: 166, baseType: !1208, size: 128, align: 64, offset: 448)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1054, line: 127, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1054, line: 124, size: 128, align: 64, elements: !1210)
!1210 = !{!1211, !1284}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1209, file: !1054, line: 125, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1216)
!1216 = !{!1217, !1218, !1242, !1246, !1247, !1281, !1282, !1283}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1215, file: !14, line: 5751, baseType: !982, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1215, file: !14, line: 5756, baseType: !1219, size: 64, align: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1221)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1222)
!1222 = !{!1223, !1224, !1227, !1228, !1229, !1233, !1237, !1241}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1221, file: !14, line: 5797, baseType: !952, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1221, file: !14, line: 5804, baseType: !1225, size: 64, align: 64, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1221, file: !14, line: 5815, baseType: !982, size: 64, align: 64, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1221, file: !14, line: 5825, baseType: !923, size: 32, align: 32, offset: 192)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1221, file: !14, line: 5826, baseType: !1230, size: 64, align: 64, offset: 256)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!923, !1213}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1221, file: !14, line: 5827, baseType: !1234, size: 64, align: 64, offset: 320)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!923, !1213, !1183}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1221, file: !14, line: 5828, baseType: !1238, size: 64, align: 64, offset: 384)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{null, !1213}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1221, file: !14, line: 5829, baseType: !1238, size: 64, align: 64, offset: 448)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1215, file: !14, line: 5762, baseType: !1243, size: 64, align: 64, offset: 128)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1245)
!1245 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1215, file: !14, line: 5768, baseType: !936, size: 64, align: 64, offset: 192)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1215, file: !14, line: 5775, baseType: !1248, size: 64, align: 64, offset: 256)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1250)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1251)
!1251 = !{!1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1250, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1250, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1250, file: !14, line: 3948, baseType: !931, size: 32, align: 32, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1250, file: !14, line: 3958, baseType: !945, size: 64, align: 64, offset: 128)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1250, file: !14, line: 3962, baseType: !923, size: 32, align: 32, offset: 192)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1250, file: !14, line: 3968, baseType: !923, size: 32, align: 32, offset: 224)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1250, file: !14, line: 3973, baseType: !941, size: 64, align: 64, offset: 256)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1250, file: !14, line: 3986, baseType: !923, size: 32, align: 32, offset: 320)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1250, file: !14, line: 3999, baseType: !923, size: 32, align: 32, offset: 352)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1250, file: !14, line: 4004, baseType: !923, size: 32, align: 32, offset: 384)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1250, file: !14, line: 4005, baseType: !923, size: 32, align: 32, offset: 416)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1250, file: !14, line: 4010, baseType: !923, size: 32, align: 32, offset: 448)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1250, file: !14, line: 4011, baseType: !923, size: 32, align: 32, offset: 480)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1250, file: !14, line: 4020, baseType: !962, size: 64, align: 32, offset: 512)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1250, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1250, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1250, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1250, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1250, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1250, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1250, file: !14, line: 4039, baseType: !923, size: 32, align: 32, offset: 768)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1250, file: !14, line: 4046, baseType: !943, size: 64, align: 64, offset: 832)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1250, file: !14, line: 4050, baseType: !923, size: 32, align: 32, offset: 896)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1250, file: !14, line: 4054, baseType: !923, size: 32, align: 32, offset: 928)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1250, file: !14, line: 4061, baseType: !923, size: 32, align: 32, offset: 960)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1250, file: !14, line: 4065, baseType: !923, size: 32, align: 32, offset: 992)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1250, file: !14, line: 4073, baseType: !923, size: 32, align: 32, offset: 1024)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1250, file: !14, line: 4080, baseType: !923, size: 32, align: 32, offset: 1056)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1250, file: !14, line: 4084, baseType: !923, size: 32, align: 32, offset: 1088)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1215, file: !14, line: 5781, baseType: !1248, size: 64, align: 64, offset: 320)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1215, file: !14, line: 5787, baseType: !962, size: 64, align: 32, offset: 384)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1215, file: !14, line: 5793, baseType: !962, size: 64, align: 32, offset: 448)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1209, file: !1054, line: 126, baseType: !923, size: 32, align: 32, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1053, file: !1054, line: 172, baseType: !1183, size: 64, align: 64, offset: 576)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1053, file: !1054, line: 177, baseType: !945, size: 64, align: 64, offset: 640)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1053, file: !1054, line: 178, baseType: !924, size: 32, align: 32, offset: 704)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1053, file: !1054, line: 180, baseType: !936, size: 64, align: 64, offset: 768)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1053, file: !1054, line: 185, baseType: !923, size: 32, align: 32, offset: 832)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1053, file: !1054, line: 190, baseType: !936, size: 64, align: 64, offset: 896)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1053, file: !1054, line: 195, baseType: !923, size: 32, align: 32, offset: 960)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1053, file: !1054, line: 200, baseType: !1183, size: 64, align: 64, offset: 1024)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1053, file: !1054, line: 201, baseType: !923, size: 32, align: 32, offset: 1088)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1053, file: !1054, line: 202, baseType: !1060, size: 64, align: 64, offset: 1152)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1053, file: !1054, line: 203, baseType: !923, size: 32, align: 32, offset: 1216)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1053, file: !1054, line: 205, baseType: !923, size: 32, align: 32, offset: 1248)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1053, file: !1054, line: 206, baseType: !923, size: 32, align: 32, offset: 1280)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1053, file: !1054, line: 209, baseType: !1150, size: 64, align: 64, offset: 1344)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1053, file: !1054, line: 212, baseType: !1150, size: 64, align: 64, offset: 1408)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1053, file: !1054, line: 213, baseType: !1060, size: 64, align: 64, offset: 1472)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1053, file: !1054, line: 215, baseType: !923, size: 32, align: 32, offset: 1536)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1053, file: !1054, line: 217, baseType: !923, size: 32, align: 32, offset: 1568)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1053, file: !1054, line: 220, baseType: !923, size: 32, align: 32, offset: 1600)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1040, file: !14, line: 1598, baseType: !936, size: 64, align: 64, offset: 384)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1040, file: !14, line: 1606, baseType: !941, size: 64, align: 64, offset: 448)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1040, file: !14, line: 1614, baseType: !923, size: 32, align: 32, offset: 512)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1040, file: !14, line: 1622, baseType: !923, size: 32, align: 32, offset: 544)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1040, file: !14, line: 1628, baseType: !923, size: 32, align: 32, offset: 576)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1040, file: !14, line: 1636, baseType: !923, size: 32, align: 32, offset: 608)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1040, file: !14, line: 1643, baseType: !923, size: 32, align: 32, offset: 640)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1040, file: !14, line: 1657, baseType: !945, size: 64, align: 64, offset: 704)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1040, file: !14, line: 1658, baseType: !923, size: 32, align: 32, offset: 768)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1040, file: !14, line: 1679, baseType: !962, size: 64, align: 32, offset: 800)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1040, file: !14, line: 1688, baseType: !923, size: 32, align: 32, offset: 864)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1040, file: !14, line: 1712, baseType: !923, size: 32, align: 32, offset: 896)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1040, file: !14, line: 1729, baseType: !923, size: 32, align: 32, offset: 928)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1040, file: !14, line: 1729, baseType: !923, size: 32, align: 32, offset: 960)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1040, file: !14, line: 1744, baseType: !923, size: 32, align: 32, offset: 992)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1040, file: !14, line: 1744, baseType: !923, size: 32, align: 32, offset: 1024)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1040, file: !14, line: 1751, baseType: !923, size: 32, align: 32, offset: 1056)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1040, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1040, file: !14, line: 1791, baseType: !1323, size: 64, align: 64, offset: 1152)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{null, !1326, !1327, !1329, !923, !923, !923}
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1061)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1040, file: !14, line: 1808, baseType: !1331, size: 64, align: 64, offset: 1216)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!473, !1326, !969}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1040, file: !14, line: 1816, baseType: !923, size: 32, align: 32, offset: 1280)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1040, file: !14, line: 1825, baseType: !938, size: 32, align: 32, offset: 1312)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1040, file: !14, line: 1830, baseType: !923, size: 32, align: 32, offset: 1344)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1040, file: !14, line: 1838, baseType: !938, size: 32, align: 32, offset: 1376)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1040, file: !14, line: 1846, baseType: !923, size: 32, align: 32, offset: 1408)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1040, file: !14, line: 1851, baseType: !923, size: 32, align: 32, offset: 1440)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1040, file: !14, line: 1861, baseType: !938, size: 32, align: 32, offset: 1472)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1040, file: !14, line: 1868, baseType: !938, size: 32, align: 32, offset: 1504)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1040, file: !14, line: 1875, baseType: !938, size: 32, align: 32, offset: 1536)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1040, file: !14, line: 1882, baseType: !938, size: 32, align: 32, offset: 1568)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1040, file: !14, line: 1889, baseType: !938, size: 32, align: 32, offset: 1600)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1040, file: !14, line: 1896, baseType: !938, size: 32, align: 32, offset: 1632)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1040, file: !14, line: 1903, baseType: !938, size: 32, align: 32, offset: 1664)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1040, file: !14, line: 1910, baseType: !923, size: 32, align: 32, offset: 1696)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1040, file: !14, line: 1915, baseType: !923, size: 32, align: 32, offset: 1728)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1040, file: !14, line: 1926, baseType: !1329, size: 64, align: 64, offset: 1792)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1040, file: !14, line: 1935, baseType: !962, size: 64, align: 32, offset: 1856)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1040, file: !14, line: 1942, baseType: !923, size: 32, align: 32, offset: 1920)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1040, file: !14, line: 1948, baseType: !923, size: 32, align: 32, offset: 1952)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1040, file: !14, line: 1954, baseType: !923, size: 32, align: 32, offset: 1984)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1040, file: !14, line: 1960, baseType: !923, size: 32, align: 32, offset: 2016)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1040, file: !14, line: 1984, baseType: !923, size: 32, align: 32, offset: 2048)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1040, file: !14, line: 1991, baseType: !923, size: 32, align: 32, offset: 2080)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1040, file: !14, line: 1996, baseType: !923, size: 32, align: 32, offset: 2112)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1040, file: !14, line: 2004, baseType: !923, size: 32, align: 32, offset: 2144)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1040, file: !14, line: 2011, baseType: !923, size: 32, align: 32, offset: 2176)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1040, file: !14, line: 2018, baseType: !923, size: 32, align: 32, offset: 2208)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1040, file: !14, line: 2027, baseType: !923, size: 32, align: 32, offset: 2240)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1040, file: !14, line: 2034, baseType: !923, size: 32, align: 32, offset: 2272)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1040, file: !14, line: 2044, baseType: !923, size: 32, align: 32, offset: 2304)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1040, file: !14, line: 2054, baseType: !1365, size: 64, align: 64, offset: 2368)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1040, file: !14, line: 2061, baseType: !1365, size: 64, align: 64, offset: 2432)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1040, file: !14, line: 2066, baseType: !923, size: 32, align: 32, offset: 2496)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1040, file: !14, line: 2070, baseType: !923, size: 32, align: 32, offset: 2528)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1040, file: !14, line: 2078, baseType: !923, size: 32, align: 32, offset: 2560)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1040, file: !14, line: 2085, baseType: !923, size: 32, align: 32, offset: 2592)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1040, file: !14, line: 2092, baseType: !923, size: 32, align: 32, offset: 2624)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1040, file: !14, line: 2099, baseType: !923, size: 32, align: 32, offset: 2656)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1040, file: !14, line: 2106, baseType: !923, size: 32, align: 32, offset: 2688)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1040, file: !14, line: 2113, baseType: !923, size: 32, align: 32, offset: 2720)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1040, file: !14, line: 2120, baseType: !923, size: 32, align: 32, offset: 2752)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1040, file: !14, line: 2125, baseType: !923, size: 32, align: 32, offset: 2784)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1040, file: !14, line: 2133, baseType: !923, size: 32, align: 32, offset: 2816)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1040, file: !14, line: 2140, baseType: !923, size: 32, align: 32, offset: 2848)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1040, file: !14, line: 2145, baseType: !923, size: 32, align: 32, offset: 2880)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1040, file: !14, line: 2153, baseType: !923, size: 32, align: 32, offset: 2912)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1040, file: !14, line: 2158, baseType: !923, size: 32, align: 32, offset: 2944)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1040, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1040, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1040, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1040, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1040, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1040, file: !14, line: 2203, baseType: !923, size: 32, align: 32, offset: 3136)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1040, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1040, file: !14, line: 2212, baseType: !923, size: 32, align: 32, offset: 3200)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1040, file: !14, line: 2213, baseType: !923, size: 32, align: 32, offset: 3232)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1040, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1040, file: !14, line: 2232, baseType: !923, size: 32, align: 32, offset: 3296)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1040, file: !14, line: 2243, baseType: !923, size: 32, align: 32, offset: 3328)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1040, file: !14, line: 2249, baseType: !923, size: 32, align: 32, offset: 3360)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1040, file: !14, line: 2256, baseType: !923, size: 32, align: 32, offset: 3392)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1040, file: !14, line: 2263, baseType: !943, size: 64, align: 64, offset: 3456)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1040, file: !14, line: 2270, baseType: !943, size: 64, align: 64, offset: 3520)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1040, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1040, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1040, file: !14, line: 2367, baseType: !1401, size: 64, align: 64, offset: 3648)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DISubroutineType(types: !1403)
!1403 = !{!923, !1326, !1060, !923}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1040, file: !14, line: 2383, baseType: !923, size: 32, align: 32, offset: 3712)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1040, file: !14, line: 2386, baseType: !938, size: 32, align: 32, offset: 3744)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1040, file: !14, line: 2387, baseType: !938, size: 32, align: 32, offset: 3776)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1040, file: !14, line: 2394, baseType: !923, size: 32, align: 32, offset: 3808)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1040, file: !14, line: 2401, baseType: !923, size: 32, align: 32, offset: 3840)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1040, file: !14, line: 2408, baseType: !923, size: 32, align: 32, offset: 3872)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1040, file: !14, line: 2415, baseType: !923, size: 32, align: 32, offset: 3904)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1040, file: !14, line: 2422, baseType: !923, size: 32, align: 32, offset: 3936)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1040, file: !14, line: 2423, baseType: !1413, size: 64, align: 64, offset: 3968)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1415)
!1415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1416)
!1416 = !{!1417, !1418, !1419, !1420}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1415, file: !14, line: 827, baseType: !923, size: 32, align: 32)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1415, file: !14, line: 828, baseType: !923, size: 32, align: 32, offset: 32)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1415, file: !14, line: 829, baseType: !923, size: 32, align: 32, offset: 64)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1415, file: !14, line: 830, baseType: !938, size: 32, align: 32, offset: 96)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1040, file: !14, line: 2430, baseType: !941, size: 64, align: 64, offset: 4032)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1040, file: !14, line: 2437, baseType: !941, size: 64, align: 64, offset: 4096)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1040, file: !14, line: 2444, baseType: !938, size: 32, align: 32, offset: 4160)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1040, file: !14, line: 2451, baseType: !938, size: 32, align: 32, offset: 4192)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1040, file: !14, line: 2458, baseType: !923, size: 32, align: 32, offset: 4224)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1040, file: !14, line: 2469, baseType: !923, size: 32, align: 32, offset: 4256)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1040, file: !14, line: 2475, baseType: !923, size: 32, align: 32, offset: 4288)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1040, file: !14, line: 2481, baseType: !923, size: 32, align: 32, offset: 4320)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1040, file: !14, line: 2485, baseType: !923, size: 32, align: 32, offset: 4352)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1040, file: !14, line: 2489, baseType: !923, size: 32, align: 32, offset: 4384)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1040, file: !14, line: 2493, baseType: !923, size: 32, align: 32, offset: 4416)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1040, file: !14, line: 2501, baseType: !923, size: 32, align: 32, offset: 4448)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1040, file: !14, line: 2506, baseType: !923, size: 32, align: 32, offset: 4480)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1040, file: !14, line: 2510, baseType: !923, size: 32, align: 32, offset: 4512)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1040, file: !14, line: 2514, baseType: !941, size: 64, align: 64, offset: 4544)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1040, file: !14, line: 2528, baseType: !1437, size: 64, align: 64, offset: 4608)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DISubroutineType(types: !1439)
!1439 = !{null, !1326, !936, !923, !923}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1040, file: !14, line: 2534, baseType: !923, size: 32, align: 32, offset: 4672)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1040, file: !14, line: 2545, baseType: !923, size: 32, align: 32, offset: 4704)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1040, file: !14, line: 2547, baseType: !923, size: 32, align: 32, offset: 4736)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1040, file: !14, line: 2549, baseType: !923, size: 32, align: 32, offset: 4768)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1040, file: !14, line: 2551, baseType: !923, size: 32, align: 32, offset: 4800)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1040, file: !14, line: 2553, baseType: !923, size: 32, align: 32, offset: 4832)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1040, file: !14, line: 2555, baseType: !923, size: 32, align: 32, offset: 4864)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1040, file: !14, line: 2557, baseType: !923, size: 32, align: 32, offset: 4896)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1040, file: !14, line: 2559, baseType: !923, size: 32, align: 32, offset: 4928)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1040, file: !14, line: 2563, baseType: !923, size: 32, align: 32, offset: 4960)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1040, file: !14, line: 2571, baseType: !1451, size: 64, align: 64, offset: 4992)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1040, file: !14, line: 2579, baseType: !1451, size: 64, align: 64, offset: 5056)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1040, file: !14, line: 2586, baseType: !923, size: 32, align: 32, offset: 5120)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1040, file: !14, line: 2615, baseType: !923, size: 32, align: 32, offset: 5152)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1040, file: !14, line: 2627, baseType: !923, size: 32, align: 32, offset: 5184)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1040, file: !14, line: 2637, baseType: !923, size: 32, align: 32, offset: 5216)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1040, file: !14, line: 2681, baseType: !923, size: 32, align: 32, offset: 5248)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1040, file: !14, line: 2709, baseType: !941, size: 64, align: 64, offset: 5312)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1040, file: !14, line: 2716, baseType: !1460, size: 64, align: 64, offset: 5376)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1462)
!1462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1463)
!1463 = !{!1464, !1465, !1466, !1467, !1468, !1469, !1473, !1479, !1483, !1484, !1485, !1486, !1492, !1493, !1494, !1495, !1496}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1462, file: !14, line: 3642, baseType: !952, size: 64, align: 64)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1462, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1462, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1462, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1462, file: !14, line: 3669, baseType: !923, size: 32, align: 32, offset: 160)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1462, file: !14, line: 3682, baseType: !1470, size: 64, align: 64, offset: 192)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{!923, !1038, !1060}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1462, file: !14, line: 3698, baseType: !1474, size: 64, align: 64, offset: 256)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64, align: 64)
!1475 = !DISubroutineType(types: !1476)
!1476 = !{!923, !1038, !1477, !931}
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1462, file: !14, line: 3712, baseType: !1480, size: 64, align: 64, offset: 320)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DISubroutineType(types: !1482)
!1482 = !{!923, !1038, !923, !1477, !931}
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1462, file: !14, line: 3726, baseType: !1474, size: 64, align: 64, offset: 384)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1462, file: !14, line: 3737, baseType: !1035, size: 64, align: 64, offset: 448)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1462, file: !14, line: 3746, baseType: !923, size: 32, align: 32, offset: 512)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1462, file: !14, line: 3757, baseType: !1487, size: 64, align: 64, offset: 576)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DISubroutineType(types: !1489)
!1489 = !{null, !1490}
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1462, file: !14, line: 3766, baseType: !1035, size: 64, align: 64, offset: 640)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1462, file: !14, line: 3774, baseType: !1035, size: 64, align: 64, offset: 704)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1462, file: !14, line: 3780, baseType: !923, size: 32, align: 32, offset: 768)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1462, file: !14, line: 3785, baseType: !923, size: 32, align: 32, offset: 800)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1462, file: !14, line: 3795, baseType: !1497, size: 64, align: 64, offset: 832)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{!923, !1038, !1097}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1040, file: !14, line: 2728, baseType: !936, size: 64, align: 64, offset: 5440)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1040, file: !14, line: 2735, baseType: !1087, size: 512, align: 64, offset: 5504)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1040, file: !14, line: 2742, baseType: !923, size: 32, align: 32, offset: 6016)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1040, file: !14, line: 2755, baseType: !923, size: 32, align: 32, offset: 6048)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1040, file: !14, line: 2776, baseType: !923, size: 32, align: 32, offset: 6080)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1040, file: !14, line: 2783, baseType: !923, size: 32, align: 32, offset: 6112)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1040, file: !14, line: 2791, baseType: !923, size: 32, align: 32, offset: 6144)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1040, file: !14, line: 2802, baseType: !1060, size: 64, align: 64, offset: 6208)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1040, file: !14, line: 2811, baseType: !923, size: 32, align: 32, offset: 6272)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1040, file: !14, line: 2821, baseType: !923, size: 32, align: 32, offset: 6304)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1040, file: !14, line: 2830, baseType: !923, size: 32, align: 32, offset: 6336)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1040, file: !14, line: 2840, baseType: !923, size: 32, align: 32, offset: 6368)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1040, file: !14, line: 2851, baseType: !1513, size: 64, align: 64, offset: 6400)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DISubroutineType(types: !1515)
!1515 = !{!923, !1326, !1516, !936, !1329, !923, !923}
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DISubroutineType(types: !1518)
!1518 = !{!923, !1326, !936}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1040, file: !14, line: 2871, baseType: !1520, size: 64, align: 64, offset: 6464)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DISubroutineType(types: !1522)
!1522 = !{!923, !1326, !1523, !936, !1329, !923}
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DISubroutineType(types: !1525)
!1525 = !{!923, !1326, !936, !923, !923}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1040, file: !14, line: 2878, baseType: !923, size: 32, align: 32, offset: 6528)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1040, file: !14, line: 2885, baseType: !923, size: 32, align: 32, offset: 6560)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1040, file: !14, line: 3005, baseType: !923, size: 32, align: 32, offset: 6592)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1040, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1040, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1040, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1040, file: !14, line: 3037, baseType: !945, size: 64, align: 64, offset: 6720)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1040, file: !14, line: 3038, baseType: !923, size: 32, align: 32, offset: 6784)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1040, file: !14, line: 3050, baseType: !943, size: 64, align: 64, offset: 6848)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1040, file: !14, line: 3065, baseType: !923, size: 32, align: 32, offset: 6912)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1040, file: !14, line: 3083, baseType: !923, size: 32, align: 32, offset: 6944)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1040, file: !14, line: 3092, baseType: !962, size: 64, align: 32, offset: 6976)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1040, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1040, file: !14, line: 3106, baseType: !962, size: 64, align: 32, offset: 7072)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1040, file: !14, line: 3113, baseType: !1541, size: 64, align: 64, offset: 7168)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1543)
!1543 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1544)
!1544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1545)
!1545 = !{!1546, !1547, !1548, !1549, !1550, !1551, !1554}
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1544, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1544, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1544, file: !14, line: 720, baseType: !952, size: 64, align: 64, offset: 64)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1544, file: !14, line: 724, baseType: !952, size: 64, align: 64, offset: 128)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1544, file: !14, line: 728, baseType: !923, size: 32, align: 32, offset: 192)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1544, file: !14, line: 734, baseType: !1552, size: 64, align: 64, offset: 256)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1544, file: !14, line: 739, baseType: !1555, size: 64, align: 64, offset: 320)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1040, file: !14, line: 3129, baseType: !941, size: 64, align: 64, offset: 7232)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1040, file: !14, line: 3130, baseType: !941, size: 64, align: 64, offset: 7296)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1040, file: !14, line: 3131, baseType: !941, size: 64, align: 64, offset: 7360)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1040, file: !14, line: 3132, baseType: !941, size: 64, align: 64, offset: 7424)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1040, file: !14, line: 3139, baseType: !1451, size: 64, align: 64, offset: 7488)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1040, file: !14, line: 3147, baseType: !923, size: 32, align: 32, offset: 7552)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1040, file: !14, line: 3165, baseType: !923, size: 32, align: 32, offset: 7584)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1040, file: !14, line: 3172, baseType: !923, size: 32, align: 32, offset: 7616)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1040, file: !14, line: 3180, baseType: !923, size: 32, align: 32, offset: 7648)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1040, file: !14, line: 3191, baseType: !1365, size: 64, align: 64, offset: 7680)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1040, file: !14, line: 3199, baseType: !945, size: 64, align: 64, offset: 7744)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1040, file: !14, line: 3207, baseType: !1451, size: 64, align: 64, offset: 7808)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1040, file: !14, line: 3214, baseType: !924, size: 32, align: 32, offset: 7872)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1040, file: !14, line: 3224, baseType: !1195, size: 64, align: 64, offset: 7936)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1040, file: !14, line: 3225, baseType: !923, size: 32, align: 32, offset: 8000)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1040, file: !14, line: 3249, baseType: !1097, size: 64, align: 64, offset: 8064)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1040, file: !14, line: 3256, baseType: !923, size: 32, align: 32, offset: 8128)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1040, file: !14, line: 3271, baseType: !923, size: 32, align: 32, offset: 8160)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1040, file: !14, line: 3279, baseType: !941, size: 64, align: 64, offset: 8192)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1040, file: !14, line: 3301, baseType: !1097, size: 64, align: 64, offset: 8256)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1040, file: !14, line: 3310, baseType: !923, size: 32, align: 32, offset: 8320)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1040, file: !14, line: 3337, baseType: !923, size: 32, align: 32, offset: 8352)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1040, file: !14, line: 3351, baseType: !923, size: 32, align: 32, offset: 8384)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1040, file: !14, line: 3359, baseType: !923, size: 32, align: 32, offset: 8416)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !949, file: !14, line: 3535, baseType: !1582, size: 64, align: 64, offset: 1024)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DISubroutineType(types: !1584)
!1584 = !{!923, !1038, !1585}
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !949, file: !14, line: 3541, baseType: !1588, size: 64, align: 64, offset: 1088)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1590)
!1590 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1591)
!1591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1054, line: 223, size: 128, align: 64, elements: !1592)
!1592 = !{!1593, !1594}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1591, file: !1054, line: 224, baseType: !1477, size: 64, align: 64)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1591, file: !1054, line: 225, baseType: !1477, size: 64, align: 64, offset: 64)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !949, file: !14, line: 3549, baseType: !1596, size: 64, align: 64, offset: 1152)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{null, !1033}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !949, file: !14, line: 3551, baseType: !1035, size: 64, align: 64, offset: 1216)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !949, file: !14, line: 3552, baseType: !1601, size: 64, align: 64, offset: 1280)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DISubroutineType(types: !1603)
!1603 = !{!923, !1038, !945, !923, !1604}
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1606)
!1606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1607)
!1607 = !{!1608, !1609, !1610, !1611, !1612, !1636}
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1606, file: !14, line: 3921, baseType: !939, size: 16, align: 16)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1606, file: !14, line: 3922, baseType: !931, size: 32, align: 32, offset: 32)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1606, file: !14, line: 3923, baseType: !931, size: 32, align: 32, offset: 64)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1606, file: !14, line: 3924, baseType: !924, size: 32, align: 32, offset: 96)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1606, file: !14, line: 3925, baseType: !1613, size: 64, align: 64, offset: 128)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1615, size: 64, align: 64)
!1615 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1616)
!1616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1617)
!1617 = !{!1618, !1619, !1620, !1621, !1622, !1623, !1629, !1631, !1632, !1633, !1634, !1635}
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1616, file: !14, line: 3886, baseType: !923, size: 32, align: 32)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1616, file: !14, line: 3887, baseType: !923, size: 32, align: 32, offset: 32)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1616, file: !14, line: 3888, baseType: !923, size: 32, align: 32, offset: 64)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1616, file: !14, line: 3889, baseType: !923, size: 32, align: 32, offset: 96)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1616, file: !14, line: 3890, baseType: !923, size: 32, align: 32, offset: 128)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1616, file: !14, line: 3897, baseType: !1624, size: 768, align: 64, offset: 192)
!1624 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1625)
!1625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1626)
!1626 = !{!1627, !1628}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1625, file: !14, line: 3855, baseType: !1065, size: 512, align: 64)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1625, file: !14, line: 3857, baseType: !1069, size: 256, align: 32, offset: 512)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1616, file: !14, line: 3903, baseType: !1630, size: 256, align: 64, offset: 960)
!1630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 256, align: 64, elements: !1166)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1616, file: !14, line: 3904, baseType: !1173, size: 128, align: 32, offset: 1216)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1616, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1616, file: !14, line: 3908, baseType: !1451, size: 64, align: 64, offset: 1408)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1616, file: !14, line: 3915, baseType: !1451, size: 64, align: 64, offset: 1472)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1616, file: !14, line: 3917, baseType: !923, size: 32, align: 32, offset: 1536)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1606, file: !14, line: 3926, baseType: !941, size: 64, align: 64, offset: 192)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !949, file: !14, line: 3564, baseType: !1638, size: 64, align: 64, offset: 1344)
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64, align: 64)
!1639 = !DISubroutineType(types: !1640)
!1640 = !{!923, !1038, !1183, !1327, !1329}
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !949, file: !14, line: 3566, baseType: !1642, size: 64, align: 64, offset: 1408)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{!923, !1038, !936, !1329, !1183}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !949, file: !14, line: 3567, baseType: !1035, size: 64, align: 64, offset: 1472)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !949, file: !14, line: 3576, baseType: !1647, size: 64, align: 64, offset: 1536)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DISubroutineType(types: !1649)
!1649 = !{!923, !1038, !1327}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !949, file: !14, line: 3577, baseType: !1651, size: 64, align: 64, offset: 1600)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DISubroutineType(types: !1653)
!1653 = !{!923, !1038, !1183}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !949, file: !14, line: 3584, baseType: !1470, size: 64, align: 64, offset: 1664)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !949, file: !14, line: 3589, baseType: !1656, size: 64, align: 64, offset: 1728)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DISubroutineType(types: !1658)
!1658 = !{null, !1038}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !949, file: !14, line: 3594, baseType: !923, size: 32, align: 32, offset: 1792)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !949, file: !14, line: 3600, baseType: !952, size: 64, align: 64, offset: 1856)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !949, file: !14, line: 3609, baseType: !1662, size: 64, align: 64, offset: 1920)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1665)
!1665 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1666 = distinct !DIGlobalVariable(name: "init_static_once", scope: !1667, file: !911, line: 369, type: !1669, isLocal: true, isDefinition: true, variable: i32* @wmavoice_decode_init.init_static_once)
!1667 = distinct !DISubprogram(name: "wmavoice_decode_init", scope: !911, file: !911, line: 367, type: !1036, isLocal: true, isDefinition: true, scopeLine: 368, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1668)
!1668 = !{}
!1669 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_once_t", file: !1670, line: 168, baseType: !923)
!1670 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1671 = distinct !DIGlobalVariable(name: "bits", scope: !1672, file: !911, line: 316, type: !1675, isLocal: true, isDefinition: true, variable: [22 x i8]* @wmavoice_init_static_data.bits)
!1672 = distinct !DISubprogram(name: "wmavoice_init_static_data", scope: !911, file: !911, line: 314, type: !1673, isLocal: true, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1668)
!1673 = !DISubroutineType(types: !1674)
!1674 = !{null}
!1675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1478, size: 176, align: 8, elements: !1676)
!1676 = !{!1677}
!1677 = !DISubrange(count: 22)
!1678 = distinct !DIGlobalVariable(name: "codes", scope: !1672, file: !911, line: 322, type: !1679, isLocal: true, isDefinition: true, variable: [22 x i16]* @wmavoice_init_static_data.codes)
!1679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1680, size: 352, align: 16, elements: !1676)
!1680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!1681 = distinct !DIGlobalVariable(name: "table", scope: !1672, file: !911, line: 332, type: !1682, isLocal: true, isDefinition: true, variable: [132 x [2 x i16]]* @wmavoice_init_static_data.table)
!1682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1683, size: 4224, align: 16, elements: !1685)
!1683 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !932, line: 37, baseType: !1684)
!1684 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1685 = !{!1686, !1687}
!1686 = !DISubrange(count: 132)
!1687 = !DISubrange(count: 2)
