; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--ivi_dsp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--ivi_dsp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.IVIPlaneDesc = type { i16, i16, i8, %struct.IVIBandDesc* }
%struct.IVIBandDesc = type { i32, i32, i32, i32, i32, i8*, i32, i16*, i16*, i16*, [4 x i16*], i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i32, %struct.IVIHuffTab, i32, [122 x i8], i32, %struct.RVMapDesc*, i32, %struct.IVITile*, void (i32*, i16*, i64, i8*)*, i32, void (i32*, i16*, i64, i32)*, i32, i32, i32, i32, i16*, i16*, i8*, i8* }
%struct.IVIHuffTab = type { i32, %struct.VLC*, %struct.IVIHuffDesc, %struct.VLC }
%struct.IVIHuffDesc = type { i32, [16 x i8] }
%struct.VLC = type { i32, [2 x i16]*, i32, i32 }
%struct.RVMapDesc = type { i8, i8, [256 x i8], [256 x i8] }
%struct.IVITile = type { i32, i32, i32, i32, i32, i32, i32, i32, %struct.IVIMbInfo*, %struct.IVIMbInfo* }
%struct.IVIMbInfo = type { i16, i16, i32, i8, i8, i8, i8, i8, i8, i8 }

; Function Attrs: nounwind uwtable
define void @ff_ivi_recompose53(%struct.IVIPlaneDesc* %plane, i8* %dst, i64 %dst_pitch) #0 !dbg !6 {
entry:
  %retval.i225 = alloca i8, align 1
  %a.addr.i226 = alloca i32, align 4
  call void @llvm.dbg.declare(metadata i32* %a.addr.i226, metadata !172, metadata !177), !dbg !178
  %retval.i214 = alloca i8, align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--ivi_dsp.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{}
!3 = !{i32 2, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!6 = distinct !DISubprogram(name: "ff_ivi_recompose53", scope: !7, file: !7, line: 33, type: !8, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!7 = !DIFile(filename: "libavcodec/ivi_dsp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10, !170, !171}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVIPlaneDesc", file: !13, line: 199, baseType: !14)
!13 = !DIFile(filename: "libavcodec/ivi.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IVIPlaneDesc", file: !13, line: 194, size: 128, align: 64, elements: !15)
!15 = !{!16, !20, !21, !24}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !14, file: !13, line: 195, baseType: !17, size: 16, align: 16)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 49, baseType: !19)
!18 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!19 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !14, file: !13, line: 196, baseType: !17, size: 16, align: 16, offset: 16)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "num_bands", scope: !14, file: !13, line: 197, baseType: !22, size: 8, align: 8, offset: 32)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !18, line: 48, baseType: !23)
!23 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "bands", scope: !14, file: !13, line: 198, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVIBandDesc", file: !13, line: 188, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IVIBandDesc", file: !13, line: 144, size: 3648, align: 64, elements: !28)
!28 = !{!29, !31, !32, !33, !34, !35, !38, !39, !43, !44, !45, !49, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !94, !95, !99, !100, !115, !116, !147, !154, !155, !160, !161, !162, !163, !164, !167, !168, !169}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !27, file: !13, line: 145, baseType: !30, size: 32, align: 32)
!30 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "band_num", scope: !27, file: !13, line: 146, baseType: !30, size: 32, align: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !27, file: !13, line: 147, baseType: !30, size: 32, align: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !27, file: !13, line: 148, baseType: !30, size: 32, align: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "aheight", scope: !27, file: !13, line: 149, baseType: !30, size: 32, align: 32, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !27, file: !13, line: 150, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !27, file: !13, line: 151, baseType: !30, size: 32, align: 32, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !27, file: !13, line: 152, baseType: !40, size: 64, align: 64, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 37, baseType: !42)
!42 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ref_buf", scope: !27, file: !13, line: 153, baseType: !40, size: 64, align: 64, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_buf", scope: !27, file: !13, line: 154, baseType: !40, size: 64, align: 64, offset: 448)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !27, file: !13, line: 155, baseType: !46, size: 256, align: 64, offset: 512)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 256, align: 64, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 4)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !27, file: !13, line: 156, baseType: !50, size: 64, align: 64, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !51, line: 149, baseType: !52)
!51 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!52 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "is_empty", scope: !27, file: !13, line: 157, baseType: !30, size: 32, align: 32, offset: 832)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size", scope: !27, file: !13, line: 158, baseType: !30, size: 32, align: 32, offset: 864)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "blk_size", scope: !27, file: !13, line: 159, baseType: !30, size: 32, align: 32, offset: 896)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "is_halfpel", scope: !27, file: !13, line: 160, baseType: !30, size: 32, align: 32, offset: 928)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "inherit_mv", scope: !27, file: !13, line: 161, baseType: !30, size: 32, align: 32, offset: 960)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "inherit_qdelta", scope: !27, file: !13, line: 162, baseType: !30, size: 32, align: 32, offset: 992)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "qdelta_present", scope: !27, file: !13, line: 163, baseType: !30, size: 32, align: 32, offset: 1024)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "quant_mat", scope: !27, file: !13, line: 164, baseType: !30, size: 32, align: 32, offset: 1056)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "glob_quant", scope: !27, file: !13, line: 165, baseType: !30, size: 32, align: 32, offset: 1088)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "scan", scope: !27, file: !13, line: 166, baseType: !36, size: 64, align: 64, offset: 1152)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "scan_size", scope: !27, file: !13, line: 167, baseType: !30, size: 32, align: 32, offset: 1216)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "blk_vlc", scope: !27, file: !13, line: 169, baseType: !65, size: 512, align: 64, offset: 1280)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVIHuffTab", file: !13, line: 71, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IVIHuffTab", file: !13, line: 63, size: 512, align: 64, elements: !67)
!67 = !{!68, !70, !84, !93}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "tab_sel", scope: !66, file: !13, line: 64, baseType: !69, size: 32, align: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !18, line: 38, baseType: !30)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tab", scope: !66, file: !13, line: 66, baseType: !71, size: 64, align: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "VLC", file: !73, line: 30, baseType: !74)
!73 = !DIFile(filename: "libavcodec/vlc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VLC", file: !73, line: 26, size: 192, align: 64, elements: !75)
!75 = !{!76, !77, !82, !83}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !74, file: !73, line: 27, baseType: !30, size: 32, align: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !74, file: !73, line: 28, baseType: !78, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 32, align: 16, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 2)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !74, file: !73, line: 29, baseType: !30, size: 32, align: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "table_allocated", scope: !74, file: !73, line: 29, baseType: !30, size: 32, align: 32, offset: 160)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "cust_desc", scope: !66, file: !13, line: 69, baseType: !85, size: 160, align: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVIHuffDesc", file: !13, line: 58, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IVIHuffDesc", file: !13, line: 55, size: 160, align: 32, elements: !87)
!87 = !{!88, !89}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "num_rows", scope: !86, file: !13, line: 56, baseType: !69, size: 32, align: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "xbits", scope: !86, file: !13, line: 57, baseType: !90, size: 128, align: 8, offset: 32)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, align: 8, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 16)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "cust_tab", scope: !66, file: !13, line: 70, baseType: !72, size: 192, align: 64, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "num_corr", scope: !27, file: !13, line: 171, baseType: !30, size: 32, align: 32, offset: 1792)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "corr", scope: !27, file: !13, line: 172, baseType: !96, size: 976, align: 8, offset: 1824)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 976, align: 8, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 122)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "rvmap_sel", scope: !27, file: !13, line: 173, baseType: !30, size: 32, align: 32, offset: 2816)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "rv_map", scope: !27, file: !13, line: 174, baseType: !101, size: 64, align: 64, offset: 2880)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "RVMapDesc", file: !13, line: 102, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RVMapDesc", file: !13, line: 97, size: 4112, align: 8, elements: !104)
!104 = !{!105, !106, !107, !111}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "eob_sym", scope: !103, file: !13, line: 98, baseType: !22, size: 8, align: 8)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "esc_sym", scope: !103, file: !13, line: 99, baseType: !22, size: 8, align: 8, offset: 8)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "runtab", scope: !103, file: !13, line: 100, baseType: !108, size: 2048, align: 8, offset: 16)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2048, align: 8, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "valtab", scope: !103, file: !13, line: 101, baseType: !112, size: 2048, align: 8, offset: 2064)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 2048, align: 8, elements: !109)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !18, line: 36, baseType: !114)
!114 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "num_tiles", scope: !27, file: !13, line: 175, baseType: !30, size: 32, align: 32, offset: 2944)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !27, file: !13, line: 176, baseType: !117, size: 64, align: 64, offset: 3008)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVITile", file: !13, line: 138, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IVITile", file: !13, line: 127, size: 384, align: 64, elements: !120)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !146}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "xpos", scope: !119, file: !13, line: 128, baseType: !30, size: 32, align: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ypos", scope: !119, file: !13, line: 129, baseType: !30, size: 32, align: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !119, file: !13, line: 130, baseType: !30, size: 32, align: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !119, file: !13, line: 131, baseType: !30, size: 32, align: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size", scope: !119, file: !13, line: 132, baseType: !30, size: 32, align: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "is_empty", scope: !119, file: !13, line: 133, baseType: !30, size: 32, align: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !119, file: !13, line: 134, baseType: !30, size: 32, align: 32, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "num_MBs", scope: !119, file: !13, line: 135, baseType: !30, size: 32, align: 32, offset: 224)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "mbs", scope: !119, file: !13, line: 136, baseType: !130, size: 64, align: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVIMbInfo", file: !13, line: 121, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IVIMbInfo", file: !13, line: 110, size: 128, align: 32, elements: !133)
!133 = !{!134, !135, !136, !139, !140, !141, !142, !143, !144, !145}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "xpos", scope: !132, file: !13, line: 111, baseType: !41, size: 16, align: 16)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ypos", scope: !132, file: !13, line: 112, baseType: !41, size: 16, align: 16, offset: 16)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "buf_offs", scope: !132, file: !13, line: 113, baseType: !137, size: 32, align: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !18, line: 51, baseType: !138)
!138 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !13, line: 114, baseType: !22, size: 8, align: 8, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !132, file: !13, line: 115, baseType: !22, size: 8, align: 8, offset: 72)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "q_delta", scope: !132, file: !13, line: 116, baseType: !113, size: 8, align: 8, offset: 80)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !132, file: !13, line: 117, baseType: !113, size: 8, align: 8, offset: 88)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !132, file: !13, line: 118, baseType: !113, size: 8, align: 8, offset: 96)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "b_mv_x", scope: !132, file: !13, line: 119, baseType: !113, size: 8, align: 8, offset: 104)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "b_mv_y", scope: !132, file: !13, line: 120, baseType: !113, size: 8, align: 8, offset: 112)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ref_mbs", scope: !119, file: !13, line: 137, baseType: !130, size: 64, align: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "inv_transform", scope: !27, file: !13, line: 177, baseType: !148, size: 64, align: 64, offset: 3072)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "InvTransformPtr", file: !13, line: 90, baseType: !150)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !152, !40, !50, !36}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size", scope: !27, file: !13, line: 178, baseType: !30, size: 32, align: 32, offset: 3136)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "dc_transform", scope: !27, file: !13, line: 179, baseType: !156, size: 64, align: 64, offset: 3200)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "DCTransformPtr", file: !13, line: 91, baseType: !158)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !152, !40, !50, !30}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "is_2d_trans", scope: !27, file: !13, line: 180, baseType: !30, size: 32, align: 32, offset: 3264)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !27, file: !13, line: 181, baseType: !69, size: 32, align: 32, offset: 3296)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_present", scope: !27, file: !13, line: 182, baseType: !30, size: 32, align: 32, offset: 3328)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !27, file: !13, line: 183, baseType: !30, size: 32, align: 32, offset: 3360)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "intra_base", scope: !27, file: !13, line: 184, baseType: !165, size: 64, align: 64, offset: 3392)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "inter_base", scope: !27, file: !13, line: 185, baseType: !165, size: 64, align: 64, offset: 3456)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scale", scope: !27, file: !13, line: 186, baseType: !36, size: 64, align: 64, offset: 3520)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scale", scope: !27, file: !13, line: 187, baseType: !36, size: 64, align: 64, offset: 3584)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!172 = !DILocalVariable(name: "a", arg: 1, scope: !173, file: !174, line: 159, type: !30)
!173 = distinct !DISubprogram(name: "av_clip_uint8_c", scope: !174, file: !174, line: 159, type: !175, isLocal: true, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!174 = !DIFile(filename: "./libavutil/common.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!175 = !DISubroutineType(types: !176)
!176 = !{!22, !30}
!177 = !DIExpression()
!178 = !DILocation(line: 159, column: 97, scope: !173, inlinedAt: !179)
!179 = distinct !DILocation(line: 174, column: 24, scope: !180)
!180 = distinct !DILexicalBlock(scope: !181, file: !7, line: 88, column: 63)
!181 = distinct !DILexicalBlock(scope: !182, file: !7, line: 88, column: 9)
!182 = distinct !DILexicalBlock(scope: !183, file: !7, line: 88, column: 9)
!183 = distinct !DILexicalBlock(scope: !184, file: !7, line: 56, column: 44)
!184 = distinct !DILexicalBlock(scope: !185, file: !7, line: 56, column: 5)
!185 = distinct !DILexicalBlock(scope: !6, file: !7, line: 56, column: 5)
!186 = !DILocation(line: 159, column: 97, scope: !173, inlinedAt: !187)
!187 = distinct !DILocation(line: 175, column: 32, scope: !180)
!188 = !DILocation(line: 159, column: 97, scope: !173, inlinedAt: !189)
!189 = distinct !DILocation(line: 176, column: 34, scope: !180)
!190 = !DILocation(line: 159, column: 97, scope: !173, inlinedAt: !191)
!191 = distinct !DILocation(line: 173, column: 22, scope: !180)
!192 = !DILocalVariable(name: "plane", arg: 1, scope: !6, file: !7, line: 33, type: !10)
!193 = !DILocation(line: 33, column: 45, scope: !6)
!194 = !DILocalVariable(name: "dst", arg: 2, scope: !6, file: !7, line: 33, type: !170)
!195 = !DILocation(line: 33, column: 61, scope: !6)
!196 = !DILocalVariable(name: "dst_pitch", arg: 3, scope: !6, file: !7, line: 34, type: !171)
!197 = !DILocation(line: 34, column: 41, scope: !6)
!198 = !DILocalVariable(name: "x", scope: !6, file: !7, line: 36, type: !30)
!199 = !DILocation(line: 36, column: 9, scope: !6)
!200 = !DILocalVariable(name: "y", scope: !6, file: !7, line: 36, type: !30)
!201 = !DILocation(line: 36, column: 12, scope: !6)
!202 = !DILocalVariable(name: "indx", scope: !6, file: !7, line: 36, type: !30)
!203 = !DILocation(line: 36, column: 15, scope: !6)
!204 = !DILocalVariable(name: "p0", scope: !6, file: !7, line: 37, type: !69)
!205 = !DILocation(line: 37, column: 13, scope: !6)
!206 = !DILocalVariable(name: "p1", scope: !6, file: !7, line: 37, type: !69)
!207 = !DILocation(line: 37, column: 17, scope: !6)
!208 = !DILocalVariable(name: "p2", scope: !6, file: !7, line: 37, type: !69)
!209 = !DILocation(line: 37, column: 21, scope: !6)
!210 = !DILocalVariable(name: "p3", scope: !6, file: !7, line: 37, type: !69)
!211 = !DILocation(line: 37, column: 25, scope: !6)
!212 = !DILocalVariable(name: "tmp0", scope: !6, file: !7, line: 37, type: !69)
!213 = !DILocation(line: 37, column: 29, scope: !6)
!214 = !DILocalVariable(name: "tmp1", scope: !6, file: !7, line: 37, type: !69)
!215 = !DILocation(line: 37, column: 35, scope: !6)
!216 = !DILocalVariable(name: "tmp2", scope: !6, file: !7, line: 37, type: !69)
!217 = !DILocation(line: 37, column: 41, scope: !6)
!218 = !DILocalVariable(name: "b0_1", scope: !6, file: !7, line: 38, type: !69)
!219 = !DILocation(line: 38, column: 13, scope: !6)
!220 = !DILocalVariable(name: "b0_2", scope: !6, file: !7, line: 38, type: !69)
!221 = !DILocation(line: 38, column: 19, scope: !6)
!222 = !DILocalVariable(name: "b1_1", scope: !6, file: !7, line: 38, type: !69)
!223 = !DILocation(line: 38, column: 25, scope: !6)
!224 = !DILocalVariable(name: "b1_2", scope: !6, file: !7, line: 38, type: !69)
