; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--lagarith.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--lagarith.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!856 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!857 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!858 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!859 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!860 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!861 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!862 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!863 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!864 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!865 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!866 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!867 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!868 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!869 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!870 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!871 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!872 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!873 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!874 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!875 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!876 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!877 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!878 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!879 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!880 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "LagarithFrameType", file: !888, line: 37, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/lagarith.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900}
!890 = !DIEnumerator(name: "FRAME_RAW", value: 1)
!891 = !DIEnumerator(name: "FRAME_U_RGB24", value: 2)
!892 = !DIEnumerator(name: "FRAME_ARITH_YUY2", value: 3)
!893 = !DIEnumerator(name: "FRAME_ARITH_RGB24", value: 4)
!894 = !DIEnumerator(name: "FRAME_SOLID_GRAY", value: 5)
!895 = !DIEnumerator(name: "FRAME_SOLID_COLOR", value: 6)
!896 = !DIEnumerator(name: "FRAME_OLD_ARITH_RGB", value: 7)
!897 = !DIEnumerator(name: "FRAME_ARITH_RGBA", value: 8)
!898 = !DIEnumerator(name: "FRAME_SOLID_RGBA", value: 9)
!899 = !DIEnumerator(name: "FRAME_ARITH_YV12", value: 10)
!900 = !DIEnumerator(name: "FRAME_REDUCED_RES", value: 11)
!901 = !{!902, !911, !910, !912, !914, !916}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64, align: 64)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !905, line: 221, size: 32, align: 8, elements: !906)
!905 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!906 = !{!907}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !904, file: !905, line: 221, baseType: !908, size: 32, align: 32)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !909, line: 51, baseType: !910)
!909 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!910 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!911 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !909, line: 55, baseType: !913)
!913 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !909, line: 48, baseType: !915)
!915 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!917 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !905, line: 222, size: 16, align: 8, elements: !919)
!919 = !{!920}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !918, file: !905, line: 222, baseType: !921, size: 16, align: 16)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !909, line: 49, baseType: !922)
!922 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!923 = !{!924, !1517}
!924 = distinct !DIGlobalVariable(name: "ff_lagarith_decoder", scope: !0, file: !888, line: 722, type: !925, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_lagarith_decoder)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !927)
!927 = !{!928, !932, !933, !934, !935, !936, !945, !948, !951, !954, !957, !958, !1000, !1008, !1009, !1010, !1012, !1416, !1422, !1427, !1431, !1432, !1472, !1492, !1496, !1497, !1501, !1505, !1506, !1510, !1511, !1512}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !926, file: !14, line: 3475, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!931 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !926, file: !14, line: 3480, baseType: !929, size: 64, align: 64, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !926, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !926, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !926, file: !14, line: 3487, baseType: !911, size: 32, align: 32, offset: 192)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !926, file: !14, line: 3488, baseType: !937, size: 64, align: 64, offset: 256)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !940, line: 61, baseType: !941)
!940 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !940, line: 58, size: 64, align: 32, elements: !942)
!942 = !{!943, !944}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !941, file: !940, line: 59, baseType: !911, size: 32, align: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !941, file: !940, line: 60, baseType: !911, size: 32, align: 32, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !926, file: !14, line: 3489, baseType: !946, size: 64, align: 64, offset: 320)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !926, file: !14, line: 3490, baseType: !949, size: 64, align: 64, offset: 384)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !911)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !926, file: !14, line: 3491, baseType: !952, size: 64, align: 64, offset: 448)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !926, file: !14, line: 3492, baseType: !955, size: 64, align: 64, offset: 512)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !926, file: !14, line: 3493, baseType: !914, size: 8, align: 8, offset: 576)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !926, file: !14, line: 3494, baseType: !959, size: 64, align: 64, offset: 640)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !963)
!963 = !{!964, !965, !970, !974, !975, !976, !977, !981, !987, !989, !993}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !962, file: !691, line: 72, baseType: !929, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !962, file: !691, line: 78, baseType: !966, size: 64, align: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!929, !969}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !962, file: !691, line: 85, baseType: !971, size: 64, align: 64, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !962, file: !691, line: 93, baseType: !911, size: 32, align: 32, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !962, file: !691, line: 99, baseType: !911, size: 32, align: 32, offset: 224)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !962, file: !691, line: 108, baseType: !911, size: 32, align: 32, offset: 256)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !962, file: !691, line: 113, baseType: !978, size: 64, align: 64, offset: 320)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!969, !969, !969}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !962, file: !691, line: 123, baseType: !982, size: 64, align: 64, offset: 384)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!985, !985}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !962, file: !691, line: 130, baseType: !988, size: 32, align: 32, offset: 448)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !962, file: !691, line: 136, baseType: !990, size: 64, align: 64, offset: 512)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!988, !969}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !962, file: !691, line: 142, baseType: !994, size: 64, align: 64, offset: 576)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!911, !997, !969, !929, !911}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !926, file: !14, line: 3495, baseType: !1001, size: 64, align: 64, offset: 704)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1004)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1005)
!1005 = !{!1006, !1007}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1004, file: !14, line: 3402, baseType: !911, size: 32, align: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1004, file: !14, line: 3403, baseType: !929, size: 64, align: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !926, file: !14, line: 3507, baseType: !929, size: 64, align: 64, offset: 768)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !926, file: !14, line: 3516, baseType: !911, size: 32, align: 32, offset: 832)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !926, file: !14, line: 3517, baseType: !1011, size: 64, align: 64, offset: 896)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !926, file: !14, line: 3527, baseType: !1013, size: 64, align: 64, offset: 960)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!911, !1016}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1026, !1027, !1028, !1029, !1032, !1033, !1036, !1037, !1038, !1039, !1040, !1041, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1156, !1160, !1161, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1347, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1018, file: !14, line: 1561, baseType: !959, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1018, file: !14, line: 1562, baseType: !911, size: 32, align: 32, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1018, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1018, file: !14, line: 1565, baseType: !1024, size: 64, align: 64, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1018, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1018, file: !14, line: 1581, baseType: !910, size: 32, align: 32, offset: 224)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1018, file: !14, line: 1583, baseType: !969, size: 64, align: 64, offset: 256)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1018, file: !14, line: 1591, baseType: !1030, size: 64, align: 64, offset: 320)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !14, line: 1532, flags: DIFlagFwdDecl)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1018, file: !14, line: 1598, baseType: !969, size: 64, align: 64, offset: 384)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1018, file: !14, line: 1606, baseType: !1034, size: 64, align: 64, offset: 448)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !909, line: 40, baseType: !1035)
!1035 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1018, file: !14, line: 1614, baseType: !911, size: 32, align: 32, offset: 512)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1018, file: !14, line: 1622, baseType: !911, size: 32, align: 32, offset: 544)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1018, file: !14, line: 1628, baseType: !911, size: 32, align: 32, offset: 576)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1018, file: !14, line: 1636, baseType: !911, size: 32, align: 32, offset: 608)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1018, file: !14, line: 1643, baseType: !911, size: 32, align: 32, offset: 640)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1018, file: !14, line: 1657, baseType: !1042, size: 64, align: 64, offset: 704)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1018, file: !14, line: 1658, baseType: !911, size: 32, align: 32, offset: 768)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1018, file: !14, line: 1679, baseType: !939, size: 64, align: 32, offset: 800)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1018, file: !14, line: 1688, baseType: !911, size: 32, align: 32, offset: 864)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1018, file: !14, line: 1712, baseType: !911, size: 32, align: 32, offset: 896)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1018, file: !14, line: 1729, baseType: !911, size: 32, align: 32, offset: 928)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1018, file: !14, line: 1729, baseType: !911, size: 32, align: 32, offset: 960)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1018, file: !14, line: 1744, baseType: !911, size: 32, align: 32, offset: 992)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1018, file: !14, line: 1744, baseType: !911, size: 32, align: 32, offset: 1024)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1018, file: !14, line: 1751, baseType: !911, size: 32, align: 32, offset: 1056)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1018, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1018, file: !14, line: 1791, baseType: !1054, size: 64, align: 64, offset: 1152)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{null, !1057, !1058, !1155, !911, !911, !911}
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1060)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1062)
!1062 = !{!1063, !1067, !1069, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1107, !1109, !1110, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1143, !1144, !1145, !1146, !1147, !1148, !1151, !1152, !1153, !1154}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1061, file: !722, line: 282, baseType: !1064, size: 512, align: 64)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1042, size: 512, align: 64, elements: !1065)
!1065 = !{!1066}
!1066 = !DISubrange(count: 8)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1061, file: !722, line: 299, baseType: !1068, size: 256, align: 32, offset: 512)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !911, size: 256, align: 32, elements: !1065)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1061, file: !722, line: 315, baseType: !1070, size: 64, align: 64, offset: 768)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1061, file: !722, line: 326, baseType: !911, size: 32, align: 32, offset: 832)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1061, file: !722, line: 326, baseType: !911, size: 32, align: 32, offset: 864)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1061, file: !722, line: 334, baseType: !911, size: 32, align: 32, offset: 896)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1061, file: !722, line: 341, baseType: !911, size: 32, align: 32, offset: 928)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1061, file: !722, line: 346, baseType: !911, size: 32, align: 32, offset: 960)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1061, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1061, file: !722, line: 356, baseType: !939, size: 64, align: 32, offset: 1024)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1061, file: !722, line: 361, baseType: !1034, size: 64, align: 64, offset: 1088)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1061, file: !722, line: 369, baseType: !1034, size: 64, align: 64, offset: 1152)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1061, file: !722, line: 377, baseType: !1034, size: 64, align: 64, offset: 1216)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1061, file: !722, line: 382, baseType: !911, size: 32, align: 32, offset: 1280)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1061, file: !722, line: 386, baseType: !911, size: 32, align: 32, offset: 1312)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1061, file: !722, line: 391, baseType: !911, size: 32, align: 32, offset: 1344)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1061, file: !722, line: 396, baseType: !969, size: 64, align: 64, offset: 1408)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1061, file: !722, line: 403, baseType: !1086, size: 512, align: 64, offset: 1472)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 512, align: 64, elements: !1065)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1061, file: !722, line: 410, baseType: !911, size: 32, align: 32, offset: 1984)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1061, file: !722, line: 415, baseType: !911, size: 32, align: 32, offset: 2016)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1061, file: !722, line: 420, baseType: !911, size: 32, align: 32, offset: 2048)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1061, file: !722, line: 425, baseType: !911, size: 32, align: 32, offset: 2080)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1061, file: !722, line: 435, baseType: !1034, size: 64, align: 64, offset: 2112)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1061, file: !722, line: 440, baseType: !911, size: 32, align: 32, offset: 2176)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1061, file: !722, line: 445, baseType: !912, size: 64, align: 64, offset: 2240)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1061, file: !722, line: 459, baseType: !1095, size: 512, align: 64, offset: 2304)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1096, size: 512, align: 64, elements: !1065)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1098, line: 94, baseType: !1099)
!1098 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1098, line: 81, size: 192, align: 64, elements: !1100)
!1100 = !{!1101, !1105, !1106}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1099, file: !1098, line: 82, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1098, line: 73, baseType: !1104)
!1104 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1098, line: 73, flags: DIFlagFwdDecl)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1099, file: !1098, line: 89, baseType: !1042, size: 64, align: 64, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1099, file: !1098, line: 93, baseType: !911, size: 32, align: 32, offset: 128)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1061, file: !722, line: 473, baseType: !1108, size: 64, align: 64, offset: 2816)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1061, file: !722, line: 477, baseType: !911, size: 32, align: 32, offset: 2880)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1061, file: !722, line: 479, baseType: !1111, size: 64, align: 64, offset: 2944)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1115)
!1115 = !{!1116, !1117, !1118, !1119, !1124}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1114, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1114, file: !722, line: 203, baseType: !1042, size: 64, align: 64, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1114, file: !722, line: 204, baseType: !911, size: 32, align: 32, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1114, file: !722, line: 205, baseType: !1120, size: 64, align: 64, offset: 192)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1122, line: 86, baseType: !1123)
!1122 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1123 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1122, line: 86, flags: DIFlagFwdDecl)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1114, file: !722, line: 206, baseType: !1096, size: 64, align: 64, offset: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1061, file: !722, line: 480, baseType: !911, size: 32, align: 32, offset: 3008)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1061, file: !722, line: 505, baseType: !911, size: 32, align: 32, offset: 3040)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1061, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1061, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1061, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1061, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1061, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1061, file: !722, line: 532, baseType: !1034, size: 64, align: 64, offset: 3264)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1061, file: !722, line: 539, baseType: !1034, size: 64, align: 64, offset: 3328)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1061, file: !722, line: 547, baseType: !1034, size: 64, align: 64, offset: 3392)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1061, file: !722, line: 554, baseType: !1120, size: 64, align: 64, offset: 3456)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1061, file: !722, line: 563, baseType: !911, size: 32, align: 32, offset: 3520)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1061, file: !722, line: 572, baseType: !911, size: 32, align: 32, offset: 3552)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1061, file: !722, line: 581, baseType: !911, size: 32, align: 32, offset: 3584)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1061, file: !722, line: 588, baseType: !1140, size: 64, align: 64, offset: 3648)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !909, line: 36, baseType: !1142)
!1142 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1061, file: !722, line: 593, baseType: !911, size: 32, align: 32, offset: 3712)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1061, file: !722, line: 596, baseType: !911, size: 32, align: 32, offset: 3744)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1061, file: !722, line: 599, baseType: !1096, size: 64, align: 64, offset: 3776)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1061, file: !722, line: 605, baseType: !1096, size: 64, align: 64, offset: 3840)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1061, file: !722, line: 616, baseType: !1096, size: 64, align: 64, offset: 3904)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1061, file: !722, line: 626, baseType: !1149, size: 64, align: 64, offset: 3968)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1150, line: 216, baseType: !913)
!1150 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1061, file: !722, line: 627, baseType: !1149, size: 64, align: 64, offset: 4032)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1061, file: !722, line: 628, baseType: !1149, size: 64, align: 64, offset: 4096)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1061, file: !722, line: 629, baseType: !1149, size: 64, align: 64, offset: 4160)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1061, file: !722, line: 645, baseType: !1096, size: 64, align: 64, offset: 4224)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1018, file: !14, line: 1808, baseType: !1157, size: 64, align: 64, offset: 1216)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!473, !1057, !946}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1018, file: !14, line: 1816, baseType: !911, size: 32, align: 32, offset: 1280)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1018, file: !14, line: 1825, baseType: !1162, size: 32, align: 32, offset: 1312)
!1162 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1018, file: !14, line: 1830, baseType: !911, size: 32, align: 32, offset: 1344)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1018, file: !14, line: 1838, baseType: !1162, size: 32, align: 32, offset: 1376)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1018, file: !14, line: 1846, baseType: !911, size: 32, align: 32, offset: 1408)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1018, file: !14, line: 1851, baseType: !911, size: 32, align: 32, offset: 1440)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1018, file: !14, line: 1861, baseType: !1162, size: 32, align: 32, offset: 1472)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1018, file: !14, line: 1868, baseType: !1162, size: 32, align: 32, offset: 1504)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1018, file: !14, line: 1875, baseType: !1162, size: 32, align: 32, offset: 1536)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1018, file: !14, line: 1882, baseType: !1162, size: 32, align: 32, offset: 1568)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1018, file: !14, line: 1889, baseType: !1162, size: 32, align: 32, offset: 1600)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1018, file: !14, line: 1896, baseType: !1162, size: 32, align: 32, offset: 1632)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1018, file: !14, line: 1903, baseType: !1162, size: 32, align: 32, offset: 1664)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1018, file: !14, line: 1910, baseType: !911, size: 32, align: 32, offset: 1696)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1018, file: !14, line: 1915, baseType: !911, size: 32, align: 32, offset: 1728)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1018, file: !14, line: 1926, baseType: !1155, size: 64, align: 64, offset: 1792)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1018, file: !14, line: 1935, baseType: !939, size: 64, align: 32, offset: 1856)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1018, file: !14, line: 1942, baseType: !911, size: 32, align: 32, offset: 1920)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1018, file: !14, line: 1948, baseType: !911, size: 32, align: 32, offset: 1952)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1018, file: !14, line: 1954, baseType: !911, size: 32, align: 32, offset: 1984)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1018, file: !14, line: 1960, baseType: !911, size: 32, align: 32, offset: 2016)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1018, file: !14, line: 1984, baseType: !911, size: 32, align: 32, offset: 2048)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1018, file: !14, line: 1991, baseType: !911, size: 32, align: 32, offset: 2080)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1018, file: !14, line: 1996, baseType: !911, size: 32, align: 32, offset: 2112)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1018, file: !14, line: 2004, baseType: !911, size: 32, align: 32, offset: 2144)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1018, file: !14, line: 2011, baseType: !911, size: 32, align: 32, offset: 2176)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1018, file: !14, line: 2018, baseType: !911, size: 32, align: 32, offset: 2208)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1018, file: !14, line: 2027, baseType: !911, size: 32, align: 32, offset: 2240)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1018, file: !14, line: 2034, baseType: !911, size: 32, align: 32, offset: 2272)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1018, file: !14, line: 2044, baseType: !911, size: 32, align: 32, offset: 2304)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1018, file: !14, line: 2054, baseType: !1192, size: 64, align: 64, offset: 2368)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1018, file: !14, line: 2061, baseType: !1192, size: 64, align: 64, offset: 2432)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1018, file: !14, line: 2066, baseType: !911, size: 32, align: 32, offset: 2496)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1018, file: !14, line: 2070, baseType: !911, size: 32, align: 32, offset: 2528)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1018, file: !14, line: 2078, baseType: !911, size: 32, align: 32, offset: 2560)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1018, file: !14, line: 2085, baseType: !911, size: 32, align: 32, offset: 2592)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1018, file: !14, line: 2092, baseType: !911, size: 32, align: 32, offset: 2624)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1018, file: !14, line: 2099, baseType: !911, size: 32, align: 32, offset: 2656)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1018, file: !14, line: 2106, baseType: !911, size: 32, align: 32, offset: 2688)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1018, file: !14, line: 2113, baseType: !911, size: 32, align: 32, offset: 2720)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1018, file: !14, line: 2120, baseType: !911, size: 32, align: 32, offset: 2752)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1018, file: !14, line: 2125, baseType: !911, size: 32, align: 32, offset: 2784)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1018, file: !14, line: 2133, baseType: !911, size: 32, align: 32, offset: 2816)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1018, file: !14, line: 2140, baseType: !911, size: 32, align: 32, offset: 2848)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1018, file: !14, line: 2145, baseType: !911, size: 32, align: 32, offset: 2880)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1018, file: !14, line: 2153, baseType: !911, size: 32, align: 32, offset: 2912)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1018, file: !14, line: 2158, baseType: !911, size: 32, align: 32, offset: 2944)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1018, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1018, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1018, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1018, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1018, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1018, file: !14, line: 2203, baseType: !911, size: 32, align: 32, offset: 3136)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1018, file: !14, line: 2209, baseType: !822, size: 32, align: 32, offset: 3168)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1018, file: !14, line: 2212, baseType: !911, size: 32, align: 32, offset: 3200)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1018, file: !14, line: 2213, baseType: !911, size: 32, align: 32, offset: 3232)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1018, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1018, file: !14, line: 2232, baseType: !911, size: 32, align: 32, offset: 3296)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1018, file: !14, line: 2243, baseType: !911, size: 32, align: 32, offset: 3328)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1018, file: !14, line: 2249, baseType: !911, size: 32, align: 32, offset: 3360)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1018, file: !14, line: 2256, baseType: !911, size: 32, align: 32, offset: 3392)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1018, file: !14, line: 2263, baseType: !912, size: 64, align: 64, offset: 3456)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1018, file: !14, line: 2270, baseType: !912, size: 64, align: 64, offset: 3520)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1018, file: !14, line: 2277, baseType: !830, size: 32, align: 32, offset: 3584)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1018, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1018, file: !14, line: 2367, baseType: !1228, size: 64, align: 64, offset: 3648)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!911, !1057, !1231, !911}
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1018, file: !14, line: 2383, baseType: !911, size: 32, align: 32, offset: 3712)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1018, file: !14, line: 2386, baseType: !1162, size: 32, align: 32, offset: 3744)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1018, file: !14, line: 2387, baseType: !1162, size: 32, align: 32, offset: 3776)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1018, file: !14, line: 2394, baseType: !911, size: 32, align: 32, offset: 3808)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1018, file: !14, line: 2401, baseType: !911, size: 32, align: 32, offset: 3840)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1018, file: !14, line: 2408, baseType: !911, size: 32, align: 32, offset: 3872)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1018, file: !14, line: 2415, baseType: !911, size: 32, align: 32, offset: 3904)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1018, file: !14, line: 2422, baseType: !911, size: 32, align: 32, offset: 3936)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1018, file: !14, line: 2423, baseType: !1241, size: 64, align: 64, offset: 3968)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1243)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1244)
!1244 = !{!1245, !1246, !1247, !1248}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1243, file: !14, line: 827, baseType: !911, size: 32, align: 32)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1243, file: !14, line: 828, baseType: !911, size: 32, align: 32, offset: 32)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1243, file: !14, line: 829, baseType: !911, size: 32, align: 32, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1243, file: !14, line: 830, baseType: !1162, size: 32, align: 32, offset: 96)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1018, file: !14, line: 2430, baseType: !1034, size: 64, align: 64, offset: 4032)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1018, file: !14, line: 2437, baseType: !1034, size: 64, align: 64, offset: 4096)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1018, file: !14, line: 2444, baseType: !1162, size: 32, align: 32, offset: 4160)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1018, file: !14, line: 2451, baseType: !1162, size: 32, align: 32, offset: 4192)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1018, file: !14, line: 2458, baseType: !911, size: 32, align: 32, offset: 4224)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1018, file: !14, line: 2469, baseType: !911, size: 32, align: 32, offset: 4256)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1018, file: !14, line: 2475, baseType: !911, size: 32, align: 32, offset: 4288)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1018, file: !14, line: 2481, baseType: !911, size: 32, align: 32, offset: 4320)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1018, file: !14, line: 2485, baseType: !911, size: 32, align: 32, offset: 4352)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1018, file: !14, line: 2489, baseType: !911, size: 32, align: 32, offset: 4384)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1018, file: !14, line: 2493, baseType: !911, size: 32, align: 32, offset: 4416)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1018, file: !14, line: 2501, baseType: !911, size: 32, align: 32, offset: 4448)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1018, file: !14, line: 2506, baseType: !911, size: 32, align: 32, offset: 4480)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1018, file: !14, line: 2510, baseType: !911, size: 32, align: 32, offset: 4512)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1018, file: !14, line: 2514, baseType: !1034, size: 64, align: 64, offset: 4544)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1018, file: !14, line: 2528, baseType: !1265, size: 64, align: 64, offset: 4608)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{null, !1057, !969, !911, !911}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1018, file: !14, line: 2534, baseType: !911, size: 32, align: 32, offset: 4672)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1018, file: !14, line: 2545, baseType: !911, size: 32, align: 32, offset: 4704)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1018, file: !14, line: 2547, baseType: !911, size: 32, align: 32, offset: 4736)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1018, file: !14, line: 2549, baseType: !911, size: 32, align: 32, offset: 4768)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1018, file: !14, line: 2551, baseType: !911, size: 32, align: 32, offset: 4800)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1018, file: !14, line: 2553, baseType: !911, size: 32, align: 32, offset: 4832)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1018, file: !14, line: 2555, baseType: !911, size: 32, align: 32, offset: 4864)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1018, file: !14, line: 2557, baseType: !911, size: 32, align: 32, offset: 4896)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1018, file: !14, line: 2559, baseType: !911, size: 32, align: 32, offset: 4928)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1018, file: !14, line: 2563, baseType: !911, size: 32, align: 32, offset: 4960)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1018, file: !14, line: 2571, baseType: !1279, size: 64, align: 64, offset: 4992)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1018, file: !14, line: 2579, baseType: !1279, size: 64, align: 64, offset: 5056)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1018, file: !14, line: 2586, baseType: !911, size: 32, align: 32, offset: 5120)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1018, file: !14, line: 2615, baseType: !911, size: 32, align: 32, offset: 5152)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1018, file: !14, line: 2627, baseType: !911, size: 32, align: 32, offset: 5184)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1018, file: !14, line: 2637, baseType: !911, size: 32, align: 32, offset: 5216)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1018, file: !14, line: 2681, baseType: !911, size: 32, align: 32, offset: 5248)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1018, file: !14, line: 2709, baseType: !1034, size: 64, align: 64, offset: 5312)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1018, file: !14, line: 2716, baseType: !1288, size: 64, align: 64, offset: 5376)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1290)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1291)
!1291 = !{!1292, !1293, !1294, !1295, !1296, !1297, !1301, !1307, !1311, !1312, !1313, !1314, !1320, !1321, !1322, !1323, !1324}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1290, file: !14, line: 3642, baseType: !929, size: 64, align: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1290, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1290, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1290, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1290, file: !14, line: 3669, baseType: !911, size: 32, align: 32, offset: 160)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1290, file: !14, line: 3682, baseType: !1298, size: 64, align: 64, offset: 192)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!911, !1016, !1231}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1290, file: !14, line: 3698, baseType: !1302, size: 64, align: 64, offset: 256)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{!911, !1016, !1305, !908}
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !914)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1290, file: !14, line: 3712, baseType: !1308, size: 64, align: 64, offset: 320)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DISubroutineType(types: !1310)
!1310 = !{!911, !1016, !911, !1305, !908}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1290, file: !14, line: 3726, baseType: !1302, size: 64, align: 64, offset: 384)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1290, file: !14, line: 3737, baseType: !1013, size: 64, align: 64, offset: 448)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1290, file: !14, line: 3746, baseType: !911, size: 32, align: 32, offset: 512)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1290, file: !14, line: 3757, baseType: !1315, size: 64, align: 64, offset: 576)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{null, !1318}
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1290, file: !14, line: 3766, baseType: !1013, size: 64, align: 64, offset: 640)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1290, file: !14, line: 3774, baseType: !1013, size: 64, align: 64, offset: 704)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1290, file: !14, line: 3780, baseType: !911, size: 32, align: 32, offset: 768)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1290, file: !14, line: 3785, baseType: !911, size: 32, align: 32, offset: 800)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1290, file: !14, line: 3795, baseType: !1325, size: 64, align: 64, offset: 832)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DISubroutineType(types: !1327)
!1327 = !{!911, !1016, !1096}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1018, file: !14, line: 2728, baseType: !969, size: 64, align: 64, offset: 5440)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1018, file: !14, line: 2735, baseType: !1086, size: 512, align: 64, offset: 5504)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1018, file: !14, line: 2742, baseType: !911, size: 32, align: 32, offset: 6016)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1018, file: !14, line: 2755, baseType: !911, size: 32, align: 32, offset: 6048)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1018, file: !14, line: 2776, baseType: !911, size: 32, align: 32, offset: 6080)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1018, file: !14, line: 2783, baseType: !911, size: 32, align: 32, offset: 6112)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1018, file: !14, line: 2791, baseType: !911, size: 32, align: 32, offset: 6144)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1018, file: !14, line: 2802, baseType: !1231, size: 64, align: 64, offset: 6208)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1018, file: !14, line: 2811, baseType: !911, size: 32, align: 32, offset: 6272)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1018, file: !14, line: 2821, baseType: !911, size: 32, align: 32, offset: 6304)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1018, file: !14, line: 2830, baseType: !911, size: 32, align: 32, offset: 6336)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1018, file: !14, line: 2840, baseType: !911, size: 32, align: 32, offset: 6368)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1018, file: !14, line: 2851, baseType: !1341, size: 64, align: 64, offset: 6400)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DISubroutineType(types: !1343)
!1343 = !{!911, !1057, !1344, !969, !1155, !911, !911}
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DISubroutineType(types: !1346)
!1346 = !{!911, !1057, !969}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1018, file: !14, line: 2871, baseType: !1348, size: 64, align: 64, offset: 6464)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DISubroutineType(types: !1350)
!1350 = !{!911, !1057, !1351, !969, !1155, !911}
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{!911, !1057, !969, !911, !911}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1018, file: !14, line: 2878, baseType: !911, size: 32, align: 32, offset: 6528)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1018, file: !14, line: 2885, baseType: !911, size: 32, align: 32, offset: 6560)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1018, file: !14, line: 3005, baseType: !911, size: 32, align: 32, offset: 6592)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1018, file: !14, line: 3013, baseType: !842, size: 32, align: 32, offset: 6624)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1018, file: !14, line: 3020, baseType: !842, size: 32, align: 32, offset: 6656)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1018, file: !14, line: 3027, baseType: !842, size: 32, align: 32, offset: 6688)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1018, file: !14, line: 3037, baseType: !1042, size: 64, align: 64, offset: 6720)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1018, file: !14, line: 3038, baseType: !911, size: 32, align: 32, offset: 6784)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1018, file: !14, line: 3050, baseType: !912, size: 64, align: 64, offset: 6848)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1018, file: !14, line: 3065, baseType: !911, size: 32, align: 32, offset: 6912)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1018, file: !14, line: 3083, baseType: !911, size: 32, align: 32, offset: 6944)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1018, file: !14, line: 3092, baseType: !939, size: 64, align: 32, offset: 6976)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1018, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1018, file: !14, line: 3106, baseType: !939, size: 64, align: 32, offset: 7072)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1018, file: !14, line: 3113, baseType: !1369, size: 64, align: 64, offset: 7168)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1371)
!1371 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1372)
!1372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1373)
!1373 = !{!1374, !1375, !1376, !1377, !1378, !1379, !1382}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1372, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1372, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1372, file: !14, line: 720, baseType: !929, size: 64, align: 64, offset: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1372, file: !14, line: 724, baseType: !929, size: 64, align: 64, offset: 128)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1372, file: !14, line: 728, baseType: !911, size: 32, align: 32, offset: 192)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1372, file: !14, line: 734, baseType: !1380, size: 64, align: 64, offset: 256)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1372, file: !14, line: 739, baseType: !1383, size: 64, align: 64, offset: 320)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1018, file: !14, line: 3129, baseType: !1034, size: 64, align: 64, offset: 7232)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1018, file: !14, line: 3130, baseType: !1034, size: 64, align: 64, offset: 7296)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1018, file: !14, line: 3131, baseType: !1034, size: 64, align: 64, offset: 7360)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1018, file: !14, line: 3132, baseType: !1034, size: 64, align: 64, offset: 7424)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1018, file: !14, line: 3139, baseType: !1279, size: 64, align: 64, offset: 7488)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1018, file: !14, line: 3147, baseType: !911, size: 32, align: 32, offset: 7552)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1018, file: !14, line: 3165, baseType: !911, size: 32, align: 32, offset: 7584)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1018, file: !14, line: 3172, baseType: !911, size: 32, align: 32, offset: 7616)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1018, file: !14, line: 3180, baseType: !911, size: 32, align: 32, offset: 7648)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1018, file: !14, line: 3191, baseType: !1192, size: 64, align: 64, offset: 7680)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1018, file: !14, line: 3199, baseType: !1042, size: 64, align: 64, offset: 7744)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1018, file: !14, line: 3207, baseType: !1279, size: 64, align: 64, offset: 7808)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1018, file: !14, line: 3214, baseType: !910, size: 32, align: 32, offset: 7872)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1018, file: !14, line: 3224, baseType: !1399, size: 64, align: 64, offset: 7936)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1401)
!1401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1402)
!1402 = !{!1403, !1404, !1405}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1401, file: !14, line: 1412, baseType: !1042, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1401, file: !14, line: 1413, baseType: !911, size: 32, align: 32, offset: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1401, file: !14, line: 1414, baseType: !851, size: 32, align: 32, offset: 96)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1018, file: !14, line: 3225, baseType: !911, size: 32, align: 32, offset: 8000)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1018, file: !14, line: 3249, baseType: !1096, size: 64, align: 64, offset: 8064)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1018, file: !14, line: 3256, baseType: !911, size: 32, align: 32, offset: 8128)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1018, file: !14, line: 3271, baseType: !911, size: 32, align: 32, offset: 8160)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1018, file: !14, line: 3279, baseType: !1034, size: 64, align: 64, offset: 8192)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1018, file: !14, line: 3301, baseType: !1096, size: 64, align: 64, offset: 8256)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1018, file: !14, line: 3310, baseType: !911, size: 32, align: 32, offset: 8320)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1018, file: !14, line: 3337, baseType: !911, size: 32, align: 32, offset: 8352)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1018, file: !14, line: 3351, baseType: !911, size: 32, align: 32, offset: 8384)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1018, file: !14, line: 3359, baseType: !911, size: 32, align: 32, offset: 8416)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !926, file: !14, line: 3535, baseType: !1417, size: 64, align: 64, offset: 1024)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DISubroutineType(types: !1419)
!1419 = !{!911, !1016, !1420}
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1017)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !926, file: !14, line: 3541, baseType: !1423, size: 64, align: 64, offset: 1088)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1425)
!1425 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1426)
!1426 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !14, line: 3461, flags: DIFlagFwdDecl)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !926, file: !14, line: 3549, baseType: !1428, size: 64, align: 64, offset: 1152)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{null, !1011}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !926, file: !14, line: 3551, baseType: !1013, size: 64, align: 64, offset: 1216)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !926, file: !14, line: 3552, baseType: !1433, size: 64, align: 64, offset: 1280)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DISubroutineType(types: !1435)
!1435 = !{!911, !1016, !1042, !911, !1436}
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1438)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1439)
!1439 = !{!1440, !1441, !1442, !1443, !1444, !1471}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1438, file: !14, line: 3921, baseType: !921, size: 16, align: 16)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1438, file: !14, line: 3922, baseType: !908, size: 32, align: 32, offset: 32)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1438, file: !14, line: 3923, baseType: !908, size: 32, align: 32, offset: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1438, file: !14, line: 3924, baseType: !910, size: 32, align: 32, offset: 96)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1438, file: !14, line: 3925, baseType: !1445, size: 64, align: 64, offset: 128)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1448)
!1448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1449)
!1449 = !{!1450, !1451, !1452, !1453, !1454, !1455, !1461, !1465, !1467, !1468, !1469, !1470}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1448, file: !14, line: 3886, baseType: !911, size: 32, align: 32)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1448, file: !14, line: 3887, baseType: !911, size: 32, align: 32, offset: 32)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1448, file: !14, line: 3888, baseType: !911, size: 32, align: 32, offset: 64)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1448, file: !14, line: 3889, baseType: !911, size: 32, align: 32, offset: 96)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1448, file: !14, line: 3890, baseType: !911, size: 32, align: 32, offset: 128)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1448, file: !14, line: 3897, baseType: !1456, size: 768, align: 64, offset: 192)
!1456 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1457)
!1457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1458)
!1458 = !{!1459, !1460}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1457, file: !14, line: 3855, baseType: !1064, size: 512, align: 64)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1457, file: !14, line: 3857, baseType: !1068, size: 256, align: 32, offset: 512)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1448, file: !14, line: 3903, baseType: !1462, size: 256, align: 64, offset: 960)
!1462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1042, size: 256, align: 64, elements: !1463)
!1463 = !{!1464}
!1464 = !DISubrange(count: 4)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1448, file: !14, line: 3904, baseType: !1466, size: 128, align: 32, offset: 1216)
!1466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !911, size: 128, align: 32, elements: !1463)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1448, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1448, file: !14, line: 3908, baseType: !1279, size: 64, align: 64, offset: 1408)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1448, file: !14, line: 3915, baseType: !1279, size: 64, align: 64, offset: 1472)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1448, file: !14, line: 3917, baseType: !911, size: 32, align: 32, offset: 1536)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1438, file: !14, line: 3926, baseType: !1034, size: 64, align: 64, offset: 192)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !926, file: !14, line: 3564, baseType: !1473, size: 64, align: 64, offset: 1344)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DISubroutineType(types: !1475)
!1475 = !{!911, !1016, !1476, !1058, !1155}
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1478)
!1478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1479)
!1479 = !{!1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1478, file: !14, line: 1451, baseType: !1096, size: 64, align: 64)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1478, file: !14, line: 1461, baseType: !1034, size: 64, align: 64, offset: 64)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1478, file: !14, line: 1467, baseType: !1034, size: 64, align: 64, offset: 128)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1478, file: !14, line: 1468, baseType: !1042, size: 64, align: 64, offset: 192)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1478, file: !14, line: 1469, baseType: !911, size: 32, align: 32, offset: 256)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1478, file: !14, line: 1470, baseType: !911, size: 32, align: 32, offset: 288)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1478, file: !14, line: 1474, baseType: !911, size: 32, align: 32, offset: 320)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1478, file: !14, line: 1479, baseType: !1399, size: 64, align: 64, offset: 384)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1478, file: !14, line: 1480, baseType: !911, size: 32, align: 32, offset: 448)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1478, file: !14, line: 1486, baseType: !1034, size: 64, align: 64, offset: 512)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1478, file: !14, line: 1488, baseType: !1034, size: 64, align: 64, offset: 576)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1478, file: !14, line: 1497, baseType: !1034, size: 64, align: 64, offset: 640)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !926, file: !14, line: 3566, baseType: !1493, size: 64, align: 64, offset: 1408)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DISubroutineType(types: !1495)
!1495 = !{!911, !1016, !969, !1155, !1476}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !926, file: !14, line: 3567, baseType: !1013, size: 64, align: 64, offset: 1472)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !926, file: !14, line: 3576, baseType: !1498, size: 64, align: 64, offset: 1536)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DISubroutineType(types: !1500)
!1500 = !{!911, !1016, !1058}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !926, file: !14, line: 3577, baseType: !1502, size: 64, align: 64, offset: 1600)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{!911, !1016, !1476}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !926, file: !14, line: 3584, baseType: !1298, size: 64, align: 64, offset: 1664)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !926, file: !14, line: 3589, baseType: !1507, size: 64, align: 64, offset: 1728)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DISubroutineType(types: !1509)
!1509 = !{null, !1016}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !926, file: !14, line: 3594, baseType: !911, size: 32, align: 32, offset: 1792)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !926, file: !14, line: 3600, baseType: !929, size: 64, align: 64, offset: 1856)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !926, file: !14, line: 3609, baseType: !1513, size: 64, align: 64, offset: 1920)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1516)
!1516 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1517 = distinct !DIGlobalVariable(name: "series", scope: !1518, file: !888, line: 103, type: !1533, isLocal: true, isDefinition: true, variable: [7 x i8]* @lag_decode_prob.series)
!1518 = distinct !DISubprogram(name: "lag_decode_prob", scope: !888, file: !888, line: 101, type: !1519, isLocal: true, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1532)
!1519 = !DISubroutineType(types: !1520)
!1520 = !{!911, !1521, !1531}
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1523, line: 70, baseType: !1524)
!1523 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1523, line: 61, size: 256, align: 64, elements: !1525)
!1525 = !{!1526, !1527, !1528, !1529, !1530}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1524, file: !1523, line: 62, baseType: !1305, size: 64, align: 64)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1524, file: !1523, line: 62, baseType: !1305, size: 64, align: 64, offset: 64)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1524, file: !1523, line: 67, baseType: !911, size: 32, align: 32, offset: 128)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1524, file: !1523, line: 68, baseType: !911, size: 32, align: 32, offset: 160)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1524, file: !1523, line: 69, baseType: !911, size: 32, align: 32, offset: 192)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64, align: 64)
!1532 = !{}
!1533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1306, size: 56, align: 8, elements: !1534)
!1534 = !{!1535}
!1535 = !DISubrange(count: 7)
!1536 = !{i32 2, !"Dwarf Version", i32 4}
!1537 = !{i32 2, !"Debug Info Version", i32 3}
!1538 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1539 = distinct !DISubprogram(name: "lag_decode_init_thread_copy", scope: !888, file: !888, line: 713, type: !1014, isLocal: true, isDefinition: true, scopeLine: 714, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1532)
!1540 = !DILocalVariable(name: "avctx", arg: 1, scope: !1539, file: !888, line: 713, type: !1016)
!1541 = !DIExpression()
!1542 = !DILocation(line: 713, column: 78, scope: !1539)
!1543 = !DILocalVariable(name: "l", scope: !1539, file: !888, line: 715, type: !1544)
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DIDerivedType(tag: DW_TAG_typedef, name: "LagarithContext", file: !888, line: 56, baseType: !1546)
!1546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LagarithContext", file: !888, line: 51, size: 448, align: 64, elements: !1547)
!1547 = !{!1548, !1549, !1578, !1579}
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1546, file: !888, line: 52, baseType: !1016, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "llviddsp", scope: !1546, file: !888, line: 53, baseType: !1550, size: 320, align: 64, offset: 64)
!1550 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLVidDSPContext", file: !1551, line: 43, baseType: !1552)
!1551 = !DIFile(filename: "libavcodec/lossless_videodsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LLVidDSPContext", file: !1551, line: 31, size: 320, align: 64, elements: !1553)
!1553 = !{!1554, !1559, !1563, !1567, !1573}
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "add_bytes", scope: !1552, file: !1551, line: 32, baseType: !1555, size: 64, align: 64)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1556 = !DISubroutineType(types: !1557)
!1557 = !{null, !1042, !1042, !1558}
!1558 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1150, line: 149, baseType: !1035)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "add_median_pred", scope: !1552, file: !1551, line: 34, baseType: !1560, size: 64, align: 64, offset: 64)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DISubroutineType(types: !1562)
!1562 = !{null, !1042, !1305, !1305, !1558, !1155, !1155}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "add_left_pred", scope: !1552, file: !1551, line: 37, baseType: !1564, size: 64, align: 64, offset: 128)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DISubroutineType(types: !1566)
!1566 = !{!911, !1042, !1305, !1558, !911}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "add_left_pred_int16", scope: !1552, file: !1551, line: 40, baseType: !1568, size: 64, align: 64, offset: 192)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DISubroutineType(types: !1570)
!1570 = !{!911, !1192, !1571, !910, !1558, !910}
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "add_gradient_pred", scope: !1552, file: !1551, line: 42, baseType: !1574, size: 64, align: 64, offset: 256)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DISubroutineType(types: !1576)
!1576 = !{null, !1042, !1577, !1577}
!1577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1558)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "zeros", scope: !1546, file: !888, line: 54, baseType: !911, size: 32, align: 32, offset: 384)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "zeros_rem", scope: !1546, file: !888, line: 55, baseType: !911, size: 32, align: 32, offset: 416)
!1580 = !DILocation(line: 715, column: 22, scope: !1539)
!1581 = !DILocation(line: 715, column: 26, scope: !1539)
!1582 = !DILocation(line: 715, column: 33, scope: !1539)
!1583 = !DILocation(line: 716, column: 16, scope: !1539)
!1584 = !DILocation(line: 716, column: 5, scope: !1539)
!1585 = !DILocation(line: 716, column: 8, scope: !1539)
!1586 = !DILocation(line: 716, column: 14, scope: !1539)
!1587 = !DILocation(line: 718, column: 5, scope: !1539)
!1588 = distinct !DISubprogram(name: "lag_decode_init", scope: !888, file: !888, line: 702, type: !1014, isLocal: true, isDefinition: true, scopeLine: 703, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1532)
!1589 = !DILocalVariable(name: "avctx", arg: 1, scope: !1588, file: !888, line: 702, type: !1016)
!1590 = !DILocation(line: 702, column: 66, scope: !1588)
!1591 = !DILocalVariable(name: "l", scope: !1588, file: !888, line: 704, type: !1544)
!1592 = !DILocation(line: 704, column: 22, scope: !1588)
!1593 = !DILocation(line: 704, column: 26, scope: !1588)
!1594 = !DILocation(line: 704, column: 33, scope: !1588)
!1595 = !DILocation(line: 705, column: 16, scope: !1588)
!1596 = !DILocation(line: 705, column: 5, scope: !1588)
!1597 = !DILocation(line: 705, column: 8, scope: !1588)
!1598 = !DILocation(line: 705, column: 14, scope: !1588)
!1599 = !DILocation(line: 707, column: 23, scope: !1588)
!1600 = !DILocation(line: 707, column: 26, scope: !1588)
!1601 = !DILocation(line: 707, column: 5, scope: !1588)
!1602 = !DILocation(line: 709, column: 5, scope: !1588)
!1603 = distinct !DISubprogram(name: "lag_decode_frame", scope: !888, file: !888, line: 533, type: !1494, isLocal: true, isDefinition: true, scopeLine: 535, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1532)
!1604 = !DILocalVariable(name: "avctx", arg: 1, scope: !1603, file: !888, line: 533, type: !1016)
!1605 = !DILocation(line: 533, column: 45, scope: !1603)
!1606 = !DILocalVariable(name: "data", arg: 2, scope: !1603, file: !888, line: 534, type: !969)
!1607 = !DILocation(line: 534, column: 35, scope: !1603)
!1608 = !DILocalVariable(name: "got_frame", arg: 3, scope: !1603, file: !888, line: 534, type: !1155)
!1609 = !DILocation(line: 534, column: 46, scope: !1603)
!1610 = !DILocalVariable(name: "avpkt", arg: 4, scope: !1603, file: !888, line: 534, type: !1476)
!1611 = !DILocation(line: 534, column: 67, scope: !1603)
!1612 = !DILocalVariable(name: "buf", scope: !1603, file: !888, line: 536, type: !1305)
!1613 = !DILocation(line: 536, column: 20, scope: !1603)
!1614 = !DILocation(line: 536, column: 26, scope: !1603)
!1615 = !DILocation(line: 536, column: 33, scope: !1603)
!1616 = !DILocalVariable(name: "buf_size", scope: !1603, file: !888, line: 537, type: !910)
!1617 = !DILocation(line: 537, column: 18, scope: !1603)
!1618 = !DILocation(line: 537, column: 29, scope: !1603)
!1619 = !DILocation(line: 537, column: 36, scope: !1603)
!1620 = !DILocalVariable(name: "l", scope: !1603, file: !888, line: 538, type: !1544)
!1621 = !DILocation(line: 538, column: 22, scope: !1603)
!1622 = !DILocation(line: 538, column: 26, scope: !1603)
!1623 = !DILocation(line: 538, column: 33, scope: !1603)
!1624 = !DILocalVariable(name: "frame", scope: !1603, file: !888, line: 539, type: !1625)
!1625 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadFrame", file: !1626, line: 40, baseType: !1627)
!1626 = !DIFile(filename: "libavcodec/thread.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadFrame", file: !1626, line: 34, size: 256, align: 64, elements: !1628)
!1628 = !{!1629, !1630, !1634}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1627, file: !1626, line: 35, baseType: !1231, size: 64, align: 64)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1627, file: !1626, line: 36, baseType: !1631, size: 128, align: 64, offset: 64)
!1631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1016, size: 128, align: 64, elements: !1632)
!1632 = !{!1633}
!1633 = !DISubrange(count: 2)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1627, file: !1626, line: 39, baseType: !1096, size: 64, align: 64, offset: 192)
!1635 = !DILocation(line: 539, column: 17, scope: !1603)
!1636 = !DILocation(line: 539, column: 25, scope: !1603)
!1637 = !DILocation(line: 539, column: 32, scope: !1603)
!1638 = !DILocalVariable(name: "p", scope: !1603, file: !888, line: 540, type: !1639)
!1639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1231)
!1640 = !DILocation(line: 540, column: 20, scope: !1603)
!1641 = !DILocation(line: 540, column: 24, scope: !1603)
!1642 = !DILocalVariable(name: "frametype", scope: !1603, file: !888, line: 541, type: !914)
!1643 = !DILocation(line: 541, column: 13, scope: !1603)
!1644 = !DILocalVariable(name: "offset_gu", scope: !1603, file: !888, line: 542, type: !908)
!1645 = !DILocation(line: 542, column: 14, scope: !1603)
!1646 = !DILocalVariable(name: "offset_bv", scope: !1603, file: !888, line: 542, type: !908)
!1647 = !DILocation(line: 542, column: 29, scope: !1603)
!1648 = !DILocalVariable(name: "offset_ry", scope: !1603, file: !888, line: 542, type: !908)
!1649 = !DILocation(line: 542, column: 44, scope: !1603)
!1650 = !DILocalVariable(name: "offs", scope: !1603, file: !888, line: 543, type: !1651)
!1651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 128, align: 32, elements: !1463)
!1652 = !DILocation(line: 543, column: 14, scope: !1603)
!1653 = !DILocalVariable(name: "srcs", scope: !1603, file: !888, line: 544, type: !1462)
!1654 = !DILocation(line: 544, column: 14, scope: !1603)
!1655 = !DILocalVariable(name: "i", scope: !1603, file: !888, line: 545, type: !911)
!1656 = !DILocation(line: 545, column: 9, scope: !1603)
!1657 = !DILocalVariable(name: "j", scope: !1603, file: !888, line: 545, type: !911)
!1658 = !DILocation(line: 545, column: 12, scope: !1603)
!1659 = !DILocalVariable(name: "planes", scope: !1603, file: !888, line: 545, type: !911)
!1660 = !DILocation(line: 545, column: 15, scope: !1603)
!1661 = !DILocalVariable(name: "ret", scope: !1603, file: !888, line: 546, type: !911)
!1662 = !DILocation(line: 546, column: 9, scope: !1603)
!1663 = !DILocation(line: 548, column: 5, scope: !1603)
!1664 = !DILocation(line: 548, column: 8, scope: !1603)
!1665 = !DILocation(line: 548, column: 18, scope: !1603)
!1666 = !DILocation(line: 549, column: 5, scope: !1603)
!1667 = !DILocation(line: 549, column: 8, scope: !1603)
!1668 = !DILocation(line: 549, column: 18, scope: !1603)
!1669 = !DILocation(line: 551, column: 17, scope: !1603)
!1670 = !DILocation(line: 551, column: 15, scope: !1603)
!1671 = !DILocation(line: 553, column: 49, scope: !1603)
!1672 = !DILocation(line: 553, column: 53, scope: !1603)
!1673 = !DILocation(line: 553, column: 60, scope: !1603)
!1674 = !DILocation(line: 553, column: 15, scope: !1603)
!1675 = !DILocation(line: 554, column: 49, scope: !1603)
!1676 = !DILocation(line: 554, column: 53, scope: !1603)
!1677 = !DILocation(line: 554, column: 60, scope: !1603)
!1678 = !DILocation(line: 554, column: 15, scope: !1603)
!1679 = !DILocation(line: 556, column: 13, scope: !1603)
!1680 = !DILocation(line: 556, column: 5, scope: !1603)
!1681 = !DILocation(line: 558, column: 9, scope: !1682)
!1682 = distinct !DILexicalBlock(scope: !1603, file: !888, line: 556, column: 24)
!1683 = !DILocation(line: 558, column: 16, scope: !1682)
!1684 = !DILocation(line: 558, column: 24, scope: !1682)
!1685 = !DILocation(line: 560, column: 13, scope: !1686)
!1686 = distinct !DILexicalBlock(scope: !1682, file: !888, line: 560, column: 13)
!1687 = !DILocation(line: 560, column: 23, scope: !1686)
!1688 = !DILocation(line: 560, column: 13, scope: !1682)
!1689 = !DILocation(line: 561, column: 17, scope: !1690)
!1690 = distinct !DILexicalBlock(scope: !1686, file: !888, line: 561, column: 17)
!1691 = !DILocation(line: 561, column: 24, scope: !1690)
!1692 = !DILocation(line: 561, column: 46, scope: !1690)
!1693 = !DILocation(line: 561, column: 17, scope: !1686)
!1694 = !DILocation(line: 562, column: 17, scope: !1695)
!1695 = distinct !DILexicalBlock(scope: !1690, file: !888, line: 561, column: 53)
!1696 = !DILocation(line: 562, column: 24, scope: !1695)
!1697 = !DILocation(line: 562, column: 32, scope: !1695)
!1698 = !DILocation(line: 563, column: 13, scope: !1695)
!1699 = !DILocation(line: 564, column: 17, scope: !1700)
!1700 = distinct !DILexicalBlock(scope: !1690, file: !888, line: 563, column: 20)
!1701 = !DILocation(line: 564, column: 24, scope: !1700)
!1702 = !DILocation(line: 564, column: 32, scope: !1700)
!1703 = !DILocation(line: 565, column: 24, scope: !1700)
!1704 = !DILocation(line: 561, column: 49, scope: !1705)
!1705 = !DILexicalBlockFile(scope: !1690, file: !888, discriminator: 1)
!1706 = !DILocation(line: 568, column: 41, scope: !1707)
!1707 = distinct !DILexicalBlock(scope: !1682, file: !888, line: 568, column: 13)
!1708 = !DILocation(line: 568, column: 20, scope: !1707)
!1709 = !DILocation(line: 568, column: 18, scope: !1707)
!1710 = !DILocation(line: 568, column: 60, scope: !1707)
!1711 = !DILocation(line: 568, column: 13, scope: !1682)
!1712 = !DILocation(line: 569, column: 20, scope: !1707)
!1713 = !DILocation(line: 569, column: 13, scope: !1707)
!1714 = !DILocation(line: 571, column: 13, scope: !1715)
!1715 = distinct !DILexicalBlock(scope: !1682, file: !888, line: 571, column: 13)
!1716 = !DILocation(line: 571, column: 23, scope: !1715)
!1717 = !DILocation(line: 571, column: 13, scope: !1682)
!1718 = !DILocation(line: 572, column: 20, scope: !1719)
!1719 = distinct !DILexicalBlock(scope: !1720, file: !888, line: 572, column: 13)
!1720 = distinct !DILexicalBlock(scope: !1715, file: !888, line: 571, column: 44)
!1721 = !DILocation(line: 572, column: 18, scope: !1719)
!1722 = !DILocation(line: 572, column: 25, scope: !1723)
!1723 = !DILexicalBlockFile(scope: !1724, file: !888, discriminator: 1)
!1724 = distinct !DILexicalBlock(scope: !1719, file: !888, line: 572, column: 13)
!1725 = !DILocation(line: 572, column: 29, scope: !1723)
!1726 = !DILocation(line: 572, column: 36, scope: !1723)
!1727 = !DILocation(line: 572, column: 27, scope: !1723)
!1728 = !DILocation(line: 572, column: 13, scope: !1723)
!1729 = !DILocation(line: 573, column: 24, scope: !1730)
!1730 = distinct !DILexicalBlock(scope: !1724, file: !888, line: 572, column: 49)
!1731 = !DILocation(line: 573, column: 27, scope: !1730)
!1732 = !DILocation(line: 573, column: 37, scope: !1730)
!1733 = !DILocation(line: 573, column: 41, scope: !1730)
!1734 = !DILocation(line: 573, column: 44, scope: !1730)
!1735 = !DILocation(line: 573, column: 39, scope: !1730)
!1736 = !DILocation(line: 573, column: 35, scope: !1730)
!1737 = !DILocation(line: 573, column: 57, scope: !1730)
!1738 = !DILocation(line: 573, column: 17, scope: !1730)
!1739 = !DILocation(line: 573, column: 65, scope: !1730)
!1740 = !DILocation(line: 573, column: 72, scope: !1730)
!1741 = !DILocation(line: 574, column: 24, scope: !1730)
!1742 = !DILocation(line: 574, column: 27, scope: !1730)
!1743 = !DILocation(line: 574, column: 37, scope: !1730)
!1744 = !DILocation(line: 574, column: 41, scope: !1730)
!1745 = !DILocation(line: 574, column: 44, scope: !1730)
!1746 = !DILocation(line: 574, column: 39, scope: !1730)
!1747 = !DILocation(line: 574, column: 35, scope: !1730)
!1748 = !DILocation(line: 574, column: 57, scope: !1730)
!1749 = !DILocation(line: 574, column: 17, scope: !1730)
!1750 = !DILocation(line: 574, column: 65, scope: !1730)
!1751 = !DILocation(line: 574, column: 72, scope: !1730)
!1752 = !DILocation(line: 575, column: 24, scope: !1730)
!1753 = !DILocation(line: 575, column: 27, scope: !1730)
!1754 = !DILocation(line: 575, column: 37, scope: !1730)
!1755 = !DILocation(line: 575, column: 41, scope: !1730)
!1756 = !DILocation(line: 575, column: 44, scope: !1730)
!1757 = !DILocation(line: 575, column: 39, scope: !1730)
!1758 = !DILocation(line: 575, column: 35, scope: !1730)
!1759 = !DILocation(line: 575, column: 57, scope: !1730)
!1760 = !DILocation(line: 575, column: 17, scope: !1730)
!1761 = !DILocation(line: 575, column: 65, scope: !1730)
!1762 = !DILocation(line: 575, column: 72, scope: !1730)
!1763 = !DILocation(line: 576, column: 24, scope: !1730)
!1764 = !DILocation(line: 576, column: 27, scope: !1730)
!1765 = !DILocation(line: 576, column: 37, scope: !1730)
!1766 = !DILocation(line: 576, column: 41, scope: !1730)
!1767 = !DILocation(line: 576, column: 44, scope: !1730)
!1768 = !DILocation(line: 576, column: 39, scope: !1730)
!1769 = !DILocation(line: 576, column: 35, scope: !1730)
!1770 = !DILocation(line: 576, column: 57, scope: !1730)
!1771 = !DILocation(line: 576, column: 17, scope: !1730)
!1772 = !DILocation(line: 576, column: 65, scope: !1730)
!1773 = !DILocation(line: 576, column: 72, scope: !1730)
!1774 = !DILocation(line: 577, column: 13, scope: !1730)
!1775 = !DILocation(line: 572, column: 45, scope: !1776)
!1776 = !DILexicalBlockFile(scope: !1724, file: !888, discriminator: 2)
!1777 = !DILocation(line: 572, column: 13, scope: !1776)
