; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--adts_header.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--adts_header.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GetBitContext = type { i8*, i8*, i32, i32, i32 }
%struct.AACADTSHeaderInfo = type { i32, i32, i32, i8, i8, i8, i8, i8 }
%union.unaligned_32 = type { i32 }

@avpriv_mpeg4audio_sample_rates = external constant [16 x i32], align 16

; Function Attrs: nounwind uwtable
define i32 @ff_adts_header_parse(%struct.GetBitContext* %gbc, %struct.AACADTSHeaderInfo* %hdr) #0 !dbg !28 {
entry:
  %retval = alloca i32, align 4
  %gbc.addr = alloca %struct.GetBitContext*, align 8
  %hdr.addr = alloca %struct.AACADTSHeaderInfo*, align 8
  %size = alloca i32, align 4
  %rdb = alloca i32, align 4
  %ch = alloca i32, align 4
  %sr = alloca i32, align 4
  %aot = alloca i32, align 4
  %crc_abs = alloca i32, align 4
  store %struct.GetBitContext* %gbc, %struct.GetBitContext** %gbc.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.GetBitContext** %gbc.addr, metadata !59, metadata !60), !dbg !61
  store %struct.AACADTSHeaderInfo* %hdr, %struct.AACADTSHeaderInfo** %hdr.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.AACADTSHeaderInfo** %hdr.addr, metadata !62, metadata !60), !dbg !63
  call void @llvm.dbg.declare(metadata i32* %size, metadata !64, metadata !60), !dbg !65

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !13)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--adts_header.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 30, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavcodec/aac_ac3_parser.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10, !11, !12}
!6 = !DIEnumerator(name: "AAC_AC3_PARSE_ERROR_SYNC", value: -16976906)
!7 = !DIEnumerator(name: "AAC_AC3_PARSE_ERROR_BSID", value: -33754122)
!8 = !DIEnumerator(name: "AAC_AC3_PARSE_ERROR_SAMPLE_RATE", value: -50531338)
!9 = !DIEnumerator(name: "AAC_AC3_PARSE_ERROR_FRAME_SIZE", value: -67308554)
!10 = !DIEnumerator(name: "AAC_AC3_PARSE_ERROR_FRAME_TYPE", value: -84085770)
!11 = !DIEnumerator(name: "AAC_AC3_PARSE_ERROR_CRC", value: -100862986)
!12 = !DIEnumerator(name: "AAC_AC3_PARSE_ERROR_CHANNEL_CFG", value: -117640202)
!13 = !{!14, !23}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !17, line: 221, size: 32, align: 8, elements: !18)
!17 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !16, file: !17, line: 221, baseType: !20, size: 32, align: 32)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !21, line: 51, baseType: !22)
!21 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!22 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !21, line: 48, baseType: !24)
!24 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!25 = !{i32 2, !"Dwarf Version", i32 4}
!26 = !{i32 2, !"Debug Info Version", i32 3}
!27 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!28 = distinct !DISubprogram(name: "ff_adts_header_parse", scope: !29, file: !29, line: 30, type: !30, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !58)
!29 = !DIFile(filename: "libavcodec/adts_header.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !33, !45}
!32 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !35, line: 70, baseType: !36)
!35 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !35, line: 61, size: 256, align: 64, elements: !37)
!37 = !{!38, !41, !42, !43, !44}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !36, file: !35, line: 62, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !36, file: !35, line: 62, baseType: !39, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !36, file: !35, line: 67, baseType: !32, size: 32, align: 32, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !36, file: !35, line: 68, baseType: !32, size: 32, align: 32, offset: 160)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !36, file: !35, line: 69, baseType: !32, size: 32, align: 32, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACADTSHeaderInfo", file: !47, line: 37, baseType: !48)
!47 = !DIFile(filename: "libavcodec/adts_header.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACADTSHeaderInfo", file: !47, line: 28, size: 160, align: 32, elements: !49)
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !48, file: !47, line: 29, baseType: !20, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !48, file: !47, line: 30, baseType: !20, size: 32, align: 32, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !48, file: !47, line: 31, baseType: !20, size: 32, align: 32, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "crc_absent", scope: !48, file: !47, line: 32, baseType: !23, size: 8, align: 8, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !48, file: !47, line: 33, baseType: !23, size: 8, align: 8, offset: 104)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_index", scope: !48, file: !47, line: 34, baseType: !23, size: 8, align: 8, offset: 112)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "chan_config", scope: !48, file: !47, line: 35, baseType: !23, size: 8, align: 8, offset: 120)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "num_aac_frames", scope: !48, file: !47, line: 36, baseType: !23, size: 8, align: 8, offset: 128)
!58 = !{}
!59 = !DILocalVariable(name: "gbc", arg: 1, scope: !28, file: !29, line: 30, type: !33)
!60 = !DIExpression()
!61 = !DILocation(line: 30, column: 41, scope: !28)
!62 = !DILocalVariable(name: "hdr", arg: 2, scope: !28, file: !29, line: 30, type: !45)
!63 = !DILocation(line: 30, column: 65, scope: !28)
!64 = !DILocalVariable(name: "size", scope: !28, file: !29, line: 32, type: !32)
!65 = !DILocation(line: 32, column: 9, scope: !28)
!66 = !DILocalVariable(name: "rdb", scope: !28, file: !29, line: 32, type: !32)
!67 = !DILocation(line: 32, column: 15, scope: !28)
!68 = !DILocalVariable(name: "ch", scope: !28, file: !29, line: 32, type: !32)
!69 = !DILocation(line: 32, column: 20, scope: !28)
!70 = !DILocalVariable(name: "sr", scope: !28, file: !29, line: 32, type: !32)
!71 = !DILocation(line: 32, column: 24, scope: !28)
!72 = !DILocalVariable(name: "aot", scope: !28, file: !29, line: 33, type: !32)
!73 = !DILocation(line: 33, column: 9, scope: !28)
!74 = !DILocalVariable(name: "crc_abs", scope: !28, file: !29, line: 33, type: !32)
!75 = !DILocation(line: 33, column: 14, scope: !28)
!76 = !DILocation(line: 35, column: 18, scope: !77)
!77 = distinct !DILexicalBlock(scope: !28, file: !29, line: 35, column: 9)
!78 = !DILocation(line: 35, column: 9, scope: !77)
!79 = !DILocation(line: 35, column: 27, scope: !77)
!80 = !DILocation(line: 35, column: 9, scope: !28)
!81 = !DILocation(line: 36, column: 9, scope: !77)
!82 = !DILocation(line: 38, column: 16, scope: !28)
!83 = !DILocation(line: 38, column: 5, scope: !28)
!84 = !DILocation(line: 39, column: 15, scope: !28)
!85 = !DILocation(line: 39, column: 5, scope: !28)
!86 = !DILocation(line: 40, column: 25, scope: !28)
!87 = !DILocation(line: 40, column: 15, scope: !28)
!88 = !DILocation(line: 40, column: 13, scope: !28)
!89 = !DILocation(line: 41, column: 20, scope: !28)
!90 = !DILocation(line: 41, column: 11, scope: !28)
!91 = !DILocation(line: 41, column: 9, scope: !28)
!92 = !DILocation(line: 42, column: 19, scope: !28)
!93 = !DILocation(line: 42, column: 10, scope: !28)
!94 = !DILocation(line: 42, column: 8, scope: !28)
!95 = !DILocation(line: 43, column: 41, scope: !96)
!96 = distinct !DILexicalBlock(scope: !28, file: !29, line: 43, column: 9)
!97 = !DILocation(line: 43, column: 10, scope: !96)
!98 = !DILocation(line: 43, column: 9, scope: !28)
!99 = !DILocation(line: 44, column: 9, scope: !96)
!100 = !DILocation(line: 45, column: 16, scope: !28)
!101 = !DILocation(line: 45, column: 5, scope: !28)
!102 = !DILocation(line: 46, column: 19, scope: !28)
!103 = !DILocation(line: 46, column: 10, scope: !28)
!104 = !DILocation(line: 46, column: 8, scope: !28)
!105 = !DILocation(line: 48, column: 16, scope: !28)
!106 = !DILocation(line: 48, column: 5, scope: !28)
!107 = !DILocation(line: 49, column: 16, scope: !28)
!108 = !DILocation(line: 49, column: 5, scope: !28)
!109 = !DILocation(line: 52, column: 16, scope: !28)
!110 = !DILocation(line: 52, column: 5, scope: !28)
!111 = !DILocation(line: 53, column: 16, scope: !28)
!112 = !DILocation(line: 53, column: 5, scope: !28)
!113 = !DILocation(line: 54, column: 21, scope: !28)
!114 = !DILocation(line: 54, column: 12, scope: !28)
!115 = !DILocation(line: 54, column: 10, scope: !28)
!116 = !DILocation(line: 55, column: 9, scope: !117)
!117 = distinct !DILexicalBlock(scope: !28, file: !29, line: 55, column: 9)
!118 = !DILocation(line: 55, column: 14, scope: !117)
!119 = !DILocation(line: 55, column: 9, scope: !28)
!120 = !DILocation(line: 56, column: 9, scope: !117)
!121 = !DILocation(line: 58, column: 15, scope: !28)
!122 = !DILocation(line: 58, column: 5, scope: !28)
!123 = !DILocation(line: 59, column: 20, scope: !28)
!124 = !DILocation(line: 59, column: 11, scope: !28)
!125 = !DILocation(line: 59, column: 9, scope: !28)
!126 = !DILocation(line: 61, column: 24, scope: !28)
