; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--davs2.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--davs2.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type opaque

!881 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64P", value: 11)
!882 = !DIEnumerator(name: "AV_SAMPLE_FMT_NB", value: 12)
!883 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !47, line: 3865, size: 32, align: 32, elements: !884)
!884 = !{!885, !886, !887, !888}
!885 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!886 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!887 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!888 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !47, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !47, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !47, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !47, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !{!939}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !942, line: 221, size: 32, align: 8, elements: !943)
!942 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!943 = !{!944}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !941, file: !942, line: 221, baseType: !945, size: 32, align: 32)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !946, line: 51, baseType: !947)
!946 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!947 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!948 = !{!949, !2208}
!949 = distinct !DIGlobalVariable(name: "ff_avs2_demuxer", scope: !0, file: !950, line: 71, type: !951, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_avs2_demuxer)
!950 = !DIFile(filename: "libavformat/davs2.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !953)
!953 = !{!954, !958, !959, !961, !962, !968, !1050, !1051, !1053, !1054, !1055, !1069, !2189, !2190, !2191, !2195, !2199, !2200, !2201, !2205, !2206, !2207}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !952, file: !919, line: 638, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !952, file: !919, line: 645, baseType: !955, size: 64, align: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !952, file: !919, line: 652, baseType: !960, size: 32, align: 32, offset: 128)
!960 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !952, file: !919, line: 659, baseType: !955, size: 64, align: 64, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !952, file: !919, line: 661, baseType: !963, size: 64, align: 64, offset: 256)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !919, line: 443, flags: DIFlagFwdDecl)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !952, file: !919, line: 663, baseType: !969, size: 64, align: 64, offset: 320)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !973)
!973 = !{!974, !975, !980, !1009, !1010, !1011, !1012, !1016, !1022, !1024, !1028}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !972, file: !26, line: 72, baseType: !955, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !972, file: !26, line: 78, baseType: !976, size: 64, align: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!955, !979}
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !972, file: !26, line: 85, baseType: !981, size: 64, align: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !984)
!984 = !{!985, !986, !987, !988, !989, !1005, !1006, !1007, !1008}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !983, file: !4, line: 247, baseType: !955, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !983, file: !4, line: 253, baseType: !955, size: 64, align: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !983, file: !4, line: 259, baseType: !960, size: 32, align: 32, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !983, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !983, file: !4, line: 271, baseType: !990, size: 64, align: 64, offset: 192)
!990 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !983, file: !4, line: 265, size: 64, align: 64, elements: !991)
!991 = !{!992, !995, !997, !998}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !990, file: !4, line: 266, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !946, line: 40, baseType: !994)
!994 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !990, file: !4, line: 267, baseType: !996, size: 64, align: 64)
!996 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !990, file: !4, line: 268, baseType: !955, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !990, file: !4, line: 270, baseType: !999, size: 64, align: 32)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1000, line: 61, baseType: !1001)
!1000 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1000, line: 58, size: 64, align: 32, elements: !1002)
!1002 = !{!1003, !1004}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1001, file: !1000, line: 59, baseType: !960, size: 32, align: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1001, file: !1000, line: 60, baseType: !960, size: 32, align: 32, offset: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !983, file: !4, line: 272, baseType: !996, size: 64, align: 64, offset: 256)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !983, file: !4, line: 273, baseType: !996, size: 64, align: 64, offset: 320)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !983, file: !4, line: 275, baseType: !960, size: 32, align: 32, offset: 384)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !983, file: !4, line: 300, baseType: !955, size: 64, align: 64, offset: 448)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !972, file: !26, line: 93, baseType: !960, size: 32, align: 32, offset: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !972, file: !26, line: 99, baseType: !960, size: 32, align: 32, offset: 224)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !972, file: !26, line: 108, baseType: !960, size: 32, align: 32, offset: 256)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !972, file: !26, line: 113, baseType: !1013, size: 64, align: 64, offset: 320)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!979, !979, !979}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !972, file: !26, line: 123, baseType: !1017, size: 64, align: 64, offset: 384)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!1020, !1020}
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !972, file: !26, line: 130, baseType: !1023, size: 32, align: 32, offset: 448)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !972, file: !26, line: 136, baseType: !1025, size: 64, align: 64, offset: 512)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!1023, !979}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !972, file: !26, line: 142, baseType: !1029, size: 64, align: 64, offset: 576)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!960, !1032, !979, !955, !960}
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1035)
!1035 = !{!1036, !1048, !1049}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1034, file: !4, line: 360, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1041)
!1041 = !{!1042, !1043, !1044, !1045, !1046, !1047}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1040, file: !4, line: 307, baseType: !955, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1040, file: !4, line: 313, baseType: !996, size: 64, align: 64, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1040, file: !4, line: 313, baseType: !996, size: 64, align: 64, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1040, file: !4, line: 318, baseType: !996, size: 64, align: 64, offset: 192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1040, file: !4, line: 318, baseType: !996, size: 64, align: 64, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1040, file: !4, line: 323, baseType: !960, size: 32, align: 32, offset: 320)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1034, file: !4, line: 364, baseType: !960, size: 32, align: 32, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1034, file: !4, line: 368, baseType: !960, size: 32, align: 32, offset: 96)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !952, file: !919, line: 670, baseType: !955, size: 64, align: 64, offset: 384)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !952, file: !919, line: 679, baseType: !1052, size: 64, align: 64, offset: 448)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !952, file: !919, line: 684, baseType: !960, size: 32, align: 32, offset: 512)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !952, file: !919, line: 689, baseType: !960, size: 32, align: 32, offset: 544)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !952, file: !919, line: 696, baseType: !1056, size: 64, align: 64, offset: 576)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!960, !1059}
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1062)
!1062 = !{!1063, !1064, !1067, !1068}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1061, file: !919, line: 449, baseType: !955, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1061, file: !919, line: 450, baseType: !1065, size: 64, align: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1061, file: !919, line: 451, baseType: !960, size: 32, align: 32, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1061, file: !919, line: 452, baseType: !955, size: 64, align: 64, offset: 192)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !952, file: !919, line: 703, baseType: !1070, size: 64, align: 64, offset: 640)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!960, !1073}
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1075)
!1075 = !{!1076, !1077, !1078, !1270, !1271, !1336, !1337, !1338, !2066, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2120, !2121, !2122, !2123, !2124, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2155, !2156, !2159, !2160, !2161, !2162, !2163, !2164, !2166, !2167, !2168, !2169, !2177, !2178, !2182, !2186, !2187, !2188}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1074, file: !919, line: 1342, baseType: !969, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1074, file: !919, line: 1349, baseType: !1052, size: 64, align: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1074, file: !919, line: 1356, baseType: !1079, size: 64, align: 64, offset: 128)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1081)
!1081 = !{!1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1135, !1136, !1140, !1144, !1149, !1156, !1245, !1251, !1257, !1258, !1259, !1260, !1264}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1080, file: !919, line: 498, baseType: !955, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1080, file: !919, line: 504, baseType: !955, size: 64, align: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1080, file: !919, line: 505, baseType: !955, size: 64, align: 64, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1080, file: !919, line: 506, baseType: !955, size: 64, align: 64, offset: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1080, file: !919, line: 508, baseType: !46, size: 32, align: 32, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1080, file: !919, line: 509, baseType: !46, size: 32, align: 32, offset: 288)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1080, file: !919, line: 510, baseType: !46, size: 32, align: 32, offset: 320)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1080, file: !919, line: 517, baseType: !960, size: 32, align: 32, offset: 352)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1080, file: !919, line: 523, baseType: !963, size: 64, align: 64, offset: 384)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1080, file: !919, line: 526, baseType: !969, size: 64, align: 64, offset: 448)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1080, file: !919, line: 535, baseType: !1079, size: 64, align: 64, offset: 512)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1080, file: !919, line: 539, baseType: !960, size: 32, align: 32, offset: 576)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1080, file: !919, line: 541, baseType: !1070, size: 64, align: 64, offset: 640)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1080, file: !919, line: 549, baseType: !1096, size: 64, align: 64, offset: 704)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!960, !1073, !1099}
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !47, line: 1499, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !47, line: 1445, size: 704, align: 64, elements: !1102)
!1102 = !{!1103, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1131, !1132, !1133, !1134}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1101, file: !47, line: 1451, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1106, line: 94, baseType: !1107)
!1106 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1106, line: 81, size: 192, align: 64, elements: !1108)
!1108 = !{!1109, !1113, !1116}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1107, file: !1106, line: 82, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1106, line: 73, baseType: !1112)
!1112 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1106, line: 73, flags: DIFlagFwdDecl)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1107, file: !1106, line: 89, baseType: !1114, size: 64, align: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !946, line: 48, baseType: !1066)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1107, file: !1106, line: 93, baseType: !960, size: 32, align: 32, offset: 128)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1101, file: !47, line: 1461, baseType: !993, size: 64, align: 64, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1101, file: !47, line: 1467, baseType: !993, size: 64, align: 64, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1101, file: !47, line: 1468, baseType: !1114, size: 64, align: 64, offset: 192)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1101, file: !47, line: 1469, baseType: !960, size: 32, align: 32, offset: 256)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1101, file: !47, line: 1470, baseType: !960, size: 32, align: 32, offset: 288)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1101, file: !47, line: 1474, baseType: !960, size: 32, align: 32, offset: 320)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1101, file: !47, line: 1479, baseType: !1124, size: 64, align: 64, offset: 384)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !47, line: 1415, baseType: !1126)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !47, line: 1411, size: 128, align: 64, elements: !1127)
!1127 = !{!1128, !1129, !1130}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1126, file: !47, line: 1412, baseType: !1114, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1126, file: !47, line: 1413, baseType: !960, size: 32, align: 32, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1126, file: !47, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1101, file: !47, line: 1480, baseType: !960, size: 32, align: 32, offset: 448)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1101, file: !47, line: 1486, baseType: !993, size: 64, align: 64, offset: 512)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1101, file: !47, line: 1488, baseType: !993, size: 64, align: 64, offset: 576)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1101, file: !47, line: 1497, baseType: !993, size: 64, align: 64, offset: 640)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1080, file: !919, line: 550, baseType: !1070, size: 64, align: 64, offset: 768)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1080, file: !919, line: 554, baseType: !1137, size: 64, align: 64, offset: 832)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!960, !1073, !1099, !1099, !960}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1080, file: !919, line: 563, baseType: !1141, size: 64, align: 64, offset: 896)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!960, !46, !960}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1080, file: !919, line: 565, baseType: !1145, size: 64, align: 64, offset: 960)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{null, !1073, !960, !1148, !1148}
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1080, file: !919, line: 570, baseType: !1150, size: 64, align: 64, offset: 1024)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!960, !1073, !960, !979, !1153}
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1154, line: 216, baseType: !1155)
!1154 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1155 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1080, file: !919, line: 581, baseType: !1157, size: 64, align: 64, offset: 1088)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!960, !1073, !960, !1160, !947}
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1163)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1164)
!1164 = !{!1165, !1169, !1171, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1199, !1201, !1202, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1163, file: !548, line: 282, baseType: !1166, size: 512, align: 64)
!1166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1114, size: 512, align: 64, elements: !1167)
!1167 = !{!1168}
!1168 = !DISubrange(count: 8)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1163, file: !548, line: 299, baseType: !1170, size: 256, align: 32, offset: 512)
!1170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 256, align: 32, elements: !1167)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1163, file: !548, line: 315, baseType: !1172, size: 64, align: 64, offset: 768)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1163, file: !548, line: 326, baseType: !960, size: 32, align: 32, offset: 832)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1163, file: !548, line: 326, baseType: !960, size: 32, align: 32, offset: 864)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1163, file: !548, line: 334, baseType: !960, size: 32, align: 32, offset: 896)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1163, file: !548, line: 341, baseType: !960, size: 32, align: 32, offset: 928)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1163, file: !548, line: 346, baseType: !960, size: 32, align: 32, offset: 960)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1163, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1163, file: !548, line: 356, baseType: !999, size: 64, align: 32, offset: 1024)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1163, file: !548, line: 361, baseType: !993, size: 64, align: 64, offset: 1088)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1163, file: !548, line: 369, baseType: !993, size: 64, align: 64, offset: 1152)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1163, file: !548, line: 377, baseType: !993, size: 64, align: 64, offset: 1216)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1163, file: !548, line: 382, baseType: !960, size: 32, align: 32, offset: 1280)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1163, file: !548, line: 386, baseType: !960, size: 32, align: 32, offset: 1312)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1163, file: !548, line: 391, baseType: !960, size: 32, align: 32, offset: 1344)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1163, file: !548, line: 396, baseType: !979, size: 64, align: 64, offset: 1408)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1163, file: !548, line: 403, baseType: !1188, size: 512, align: 64, offset: 1472)
!1188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1189, size: 512, align: 64, elements: !1167)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !946, line: 55, baseType: !1155)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1163, file: !548, line: 410, baseType: !960, size: 32, align: 32, offset: 1984)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1163, file: !548, line: 415, baseType: !960, size: 32, align: 32, offset: 2016)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1163, file: !548, line: 420, baseType: !960, size: 32, align: 32, offset: 2048)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1163, file: !548, line: 425, baseType: !960, size: 32, align: 32, offset: 2080)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1163, file: !548, line: 435, baseType: !993, size: 64, align: 64, offset: 2112)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1163, file: !548, line: 440, baseType: !960, size: 32, align: 32, offset: 2176)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1163, file: !548, line: 445, baseType: !1189, size: 64, align: 64, offset: 2240)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1163, file: !548, line: 459, baseType: !1198, size: 512, align: 64, offset: 2304)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1104, size: 512, align: 64, elements: !1167)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1163, file: !548, line: 473, baseType: !1200, size: 64, align: 64, offset: 2816)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1163, file: !548, line: 477, baseType: !960, size: 32, align: 32, offset: 2880)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1163, file: !548, line: 479, baseType: !1203, size: 64, align: 64, offset: 2944)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1206)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1207)
!1207 = !{!1208, !1209, !1210, !1211, !1216}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1206, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1206, file: !548, line: 203, baseType: !1114, size: 64, align: 64, offset: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1206, file: !548, line: 204, baseType: !960, size: 32, align: 32, offset: 128)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1206, file: !548, line: 205, baseType: !1212, size: 64, align: 64, offset: 192)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1214, line: 86, baseType: !1215)
!1214 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1215 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1214, line: 86, flags: DIFlagFwdDecl)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1206, file: !548, line: 206, baseType: !1104, size: 64, align: 64, offset: 256)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1163, file: !548, line: 480, baseType: !960, size: 32, align: 32, offset: 3008)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1163, file: !548, line: 505, baseType: !960, size: 32, align: 32, offset: 3040)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1163, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1163, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1163, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1163, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1163, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1163, file: !548, line: 532, baseType: !993, size: 64, align: 64, offset: 3264)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1163, file: !548, line: 539, baseType: !993, size: 64, align: 64, offset: 3328)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1163, file: !548, line: 547, baseType: !993, size: 64, align: 64, offset: 3392)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1163, file: !548, line: 554, baseType: !1212, size: 64, align: 64, offset: 3456)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1163, file: !548, line: 563, baseType: !960, size: 32, align: 32, offset: 3520)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1163, file: !548, line: 572, baseType: !960, size: 32, align: 32, offset: 3552)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1163, file: !548, line: 581, baseType: !960, size: 32, align: 32, offset: 3584)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1163, file: !548, line: 588, baseType: !1232, size: 64, align: 64, offset: 3648)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !946, line: 36, baseType: !1234)
!1234 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1163, file: !548, line: 593, baseType: !960, size: 32, align: 32, offset: 3712)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1163, file: !548, line: 596, baseType: !960, size: 32, align: 32, offset: 3744)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1163, file: !548, line: 599, baseType: !1104, size: 64, align: 64, offset: 3776)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1163, file: !548, line: 605, baseType: !1104, size: 64, align: 64, offset: 3840)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1163, file: !548, line: 616, baseType: !1104, size: 64, align: 64, offset: 3904)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1163, file: !548, line: 626, baseType: !1153, size: 64, align: 64, offset: 3968)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1163, file: !548, line: 627, baseType: !1153, size: 64, align: 64, offset: 4032)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1163, file: !548, line: 628, baseType: !1153, size: 64, align: 64, offset: 4096)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1163, file: !548, line: 629, baseType: !1153, size: 64, align: 64, offset: 4160)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1163, file: !548, line: 645, baseType: !1104, size: 64, align: 64, offset: 4224)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1080, file: !919, line: 587, baseType: !1246, size: 64, align: 64, offset: 1152)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!960, !1073, !1249}
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1080, file: !919, line: 592, baseType: !1252, size: 64, align: 64, offset: 1216)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{!960, !1073, !1255}
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1080, file: !919, line: 597, baseType: !1252, size: 64, align: 64, offset: 1280)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1080, file: !919, line: 598, baseType: !46, size: 32, align: 32, offset: 1344)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1080, file: !919, line: 608, baseType: !1070, size: 64, align: 64, offset: 1408)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1080, file: !919, line: 617, baseType: !1261, size: 64, align: 64, offset: 1472)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DISubroutineType(types: !1263)
!1263 = !{null, !1073}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1080, file: !919, line: 623, baseType: !1265, size: 64, align: 64, offset: 1536)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!960, !1073, !1268}
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1100)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1074, file: !919, line: 1365, baseType: !979, size: 64, align: 64, offset: 192)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1074, file: !919, line: 1379, baseType: !1272, size: 64, align: 64, offset: 256)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1275)
!1275 = !{!1276, !1277, !1278, !1279, !1280, !1281, !1282, !1286, !1287, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1303, !1304, !1308, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1326, !1327, !1328, !1329, !1333, !1334, !1335}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1274, file: !650, line: 174, baseType: !969, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1274, file: !650, line: 226, baseType: !1065, size: 64, align: 64, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1274, file: !650, line: 227, baseType: !960, size: 32, align: 32, offset: 128)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1274, file: !650, line: 228, baseType: !1065, size: 64, align: 64, offset: 192)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1274, file: !650, line: 229, baseType: !1065, size: 64, align: 64, offset: 256)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1274, file: !650, line: 233, baseType: !979, size: 64, align: 64, offset: 320)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1274, file: !650, line: 235, baseType: !1283, size: 64, align: 64, offset: 384)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!960, !979, !1114, !960}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1274, file: !650, line: 236, baseType: !1283, size: 64, align: 64, offset: 448)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1274, file: !650, line: 237, baseType: !1288, size: 64, align: 64, offset: 512)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{!993, !979, !993, !960}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1274, file: !650, line: 238, baseType: !993, size: 64, align: 64, offset: 576)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1274, file: !650, line: 239, baseType: !960, size: 32, align: 32, offset: 640)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1274, file: !650, line: 240, baseType: !960, size: 32, align: 32, offset: 672)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1274, file: !650, line: 241, baseType: !960, size: 32, align: 32, offset: 704)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1274, file: !650, line: 242, baseType: !1155, size: 64, align: 64, offset: 768)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1274, file: !650, line: 243, baseType: !1065, size: 64, align: 64, offset: 832)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1274, file: !650, line: 244, baseType: !1298, size: 64, align: 64, offset: 896)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!1155, !1155, !1301, !947}
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1115)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1274, file: !650, line: 245, baseType: !960, size: 32, align: 32, offset: 960)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1274, file: !650, line: 249, baseType: !1305, size: 64, align: 64, offset: 1024)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DISubroutineType(types: !1307)
!1307 = !{!960, !979, !960}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1274, file: !650, line: 255, baseType: !1309, size: 64, align: 64, offset: 1088)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{!993, !979, !960, !993, !960}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1274, file: !650, line: 260, baseType: !960, size: 32, align: 32, offset: 1152)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1274, file: !650, line: 266, baseType: !993, size: 64, align: 64, offset: 1216)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1274, file: !650, line: 273, baseType: !960, size: 32, align: 32, offset: 1280)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1274, file: !650, line: 279, baseType: !993, size: 64, align: 64, offset: 1344)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1274, file: !650, line: 285, baseType: !960, size: 32, align: 32, offset: 1408)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1274, file: !650, line: 291, baseType: !960, size: 32, align: 32, offset: 1440)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1274, file: !650, line: 298, baseType: !960, size: 32, align: 32, offset: 1472)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1274, file: !650, line: 304, baseType: !960, size: 32, align: 32, offset: 1504)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1274, file: !650, line: 309, baseType: !955, size: 64, align: 64, offset: 1536)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1274, file: !650, line: 314, baseType: !955, size: 64, align: 64, offset: 1600)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1274, file: !650, line: 319, baseType: !1323, size: 64, align: 64, offset: 1664)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{!960, !979, !1114, !960, !649, !993}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1274, file: !650, line: 326, baseType: !960, size: 32, align: 32, offset: 1728)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1274, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1274, file: !650, line: 332, baseType: !993, size: 64, align: 64, offset: 1792)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1274, file: !650, line: 338, baseType: !1330, size: 64, align: 64, offset: 1856)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DISubroutineType(types: !1332)
!1332 = !{!960, !979}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1274, file: !650, line: 340, baseType: !993, size: 64, align: 64, offset: 1920)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1274, file: !650, line: 346, baseType: !1065, size: 64, align: 64, offset: 1984)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1274, file: !650, line: 351, baseType: !960, size: 32, align: 32, offset: 2048)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1074, file: !919, line: 1386, baseType: !960, size: 32, align: 32, offset: 320)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1074, file: !919, line: 1393, baseType: !947, size: 32, align: 32, offset: 352)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1074, file: !919, line: 1405, baseType: !1339, size: 64, align: 64, offset: 384)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1342)
!1342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1343)
!1343 = !{!1344, !1345, !1346, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !2014, !2020, !2021, !2025, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2057, !2058, !2059, !2060, !2061, !2062}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1342, file: !919, line: 866, baseType: !960, size: 32, align: 32)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1342, file: !919, line: 872, baseType: !960, size: 32, align: 32, offset: 32)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1342, file: !919, line: 878, baseType: !1347, size: 64, align: 64, offset: 64)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !47, line: 3360, baseType: !1349)
!1349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !47, line: 1556, size: 8448, align: 64, elements: !1350)
!1350 = !{!1351, !1352, !1353, !1354, !1495, !1496, !1497, !1498, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1651, !1655, !1656, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1835, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1349, file: !47, line: 1561, baseType: !969, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1349, file: !47, line: 1562, baseType: !960, size: 32, align: 32, offset: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1349, file: !47, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1349, file: !47, line: 1565, baseType: !1355, size: 64, align: 64, offset: 128)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1357)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !47, line: 3468, size: 1984, align: 64, elements: !1358)
!1358 = !{!1359, !1360, !1361, !1362, !1363, !1364, !1367, !1370, !1373, !1376, !1379, !1380, !1381, !1389, !1390, !1391, !1393, !1397, !1403, !1412, !1416, !1417, !1460, !1467, !1471, !1472, !1476, !1480, !1484, !1488, !1489, !1490}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1357, file: !47, line: 3475, baseType: !955, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1357, file: !47, line: 3480, baseType: !955, size: 64, align: 64, offset: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1357, file: !47, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1357, file: !47, line: 3482, baseType: !46, size: 32, align: 32, offset: 160)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1357, file: !47, line: 3487, baseType: !960, size: 32, align: 32, offset: 192)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1357, file: !47, line: 3488, baseType: !1365, size: 64, align: 64, offset: 256)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1357, file: !47, line: 3489, baseType: !1368, size: 64, align: 64, offset: 320)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1357, file: !47, line: 3490, baseType: !1371, size: 64, align: 64, offset: 384)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1357, file: !47, line: 3491, baseType: !1374, size: 64, align: 64, offset: 448)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1357, file: !47, line: 3492, baseType: !1377, size: 64, align: 64, offset: 512)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1189)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1357, file: !47, line: 3493, baseType: !1115, size: 8, align: 8, offset: 576)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1357, file: !47, line: 3494, baseType: !969, size: 64, align: 64, offset: 640)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1357, file: !47, line: 3495, baseType: !1382, size: 64, align: 64, offset: 704)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1384)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !47, line: 3404, baseType: !1385)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !47, line: 3401, size: 128, align: 64, elements: !1386)
!1386 = !{!1387, !1388}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1385, file: !47, line: 3402, baseType: !960, size: 32, align: 32)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1385, file: !47, line: 3403, baseType: !955, size: 64, align: 64, offset: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1357, file: !47, line: 3507, baseType: !955, size: 64, align: 64, offset: 768)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1357, file: !47, line: 3516, baseType: !960, size: 32, align: 32, offset: 832)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1357, file: !47, line: 3517, baseType: !1392, size: 64, align: 64, offset: 896)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1357, file: !47, line: 3527, baseType: !1394, size: 64, align: 64, offset: 960)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DISubroutineType(types: !1396)
!1396 = !{!960, !1347}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1357, file: !47, line: 3535, baseType: !1398, size: 64, align: 64, offset: 1024)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DISubroutineType(types: !1400)
!1400 = !{!960, !1347, !1401}
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1348)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1357, file: !47, line: 3541, baseType: !1404, size: 64, align: 64, offset: 1088)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1406)
!1406 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !47, line: 3461, baseType: !1407)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1408, line: 223, size: 128, align: 64, elements: !1409)
!1408 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1409 = !{!1410, !1411}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1407, file: !1408, line: 224, baseType: !1301, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1407, file: !1408, line: 225, baseType: !1301, size: 64, align: 64, offset: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1357, file: !47, line: 3549, baseType: !1413, size: 64, align: 64, offset: 1152)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DISubroutineType(types: !1415)
!1415 = !{null, !1392}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1357, file: !47, line: 3551, baseType: !1394, size: 64, align: 64, offset: 1216)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1357, file: !47, line: 3552, baseType: !1418, size: 64, align: 64, offset: 1280)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DISubroutineType(types: !1420)
!1420 = !{!960, !1347, !1114, !960, !1421}
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1423)
!1423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !47, line: 3920, size: 256, align: 64, elements: !1424)
!1424 = !{!1425, !1428, !1429, !1430, !1431, !1459}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1423, file: !47, line: 3921, baseType: !1426, size: 16, align: 16)
!1426 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !946, line: 49, baseType: !1427)
!1427 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1423, file: !47, line: 3922, baseType: !945, size: 32, align: 32, offset: 32)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1423, file: !47, line: 3923, baseType: !945, size: 32, align: 32, offset: 64)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1423, file: !47, line: 3924, baseType: !947, size: 32, align: 32, offset: 96)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1423, file: !47, line: 3925, baseType: !1432, size: 64, align: 64, offset: 128)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !47, line: 3918, baseType: !1435)
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !47, line: 3885, size: 1600, align: 64, elements: !1436)
!1436 = !{!1437, !1438, !1439, !1440, !1441, !1442, !1448, !1452, !1454, !1455, !1457, !1458}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1435, file: !47, line: 3886, baseType: !960, size: 32, align: 32)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1435, file: !47, line: 3887, baseType: !960, size: 32, align: 32, offset: 32)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1435, file: !47, line: 3888, baseType: !960, size: 32, align: 32, offset: 64)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1435, file: !47, line: 3889, baseType: !960, size: 32, align: 32, offset: 96)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1435, file: !47, line: 3890, baseType: !960, size: 32, align: 32, offset: 128)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1435, file: !47, line: 3897, baseType: !1443, size: 768, align: 64, offset: 192)
!1443 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !47, line: 3858, baseType: !1444)
!1444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !47, line: 3853, size: 768, align: 64, elements: !1445)
!1445 = !{!1446, !1447}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1444, file: !47, line: 3855, baseType: !1166, size: 512, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1444, file: !47, line: 3857, baseType: !1170, size: 256, align: 32, offset: 512)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1435, file: !47, line: 3903, baseType: !1449, size: 256, align: 64, offset: 960)
!1449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1114, size: 256, align: 64, elements: !1450)
!1450 = !{!1451}
!1451 = !DISubrange(count: 4)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1435, file: !47, line: 3904, baseType: !1453, size: 128, align: 32, offset: 1216)
!1453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 128, align: 32, elements: !1450)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1435, file: !47, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1435, file: !47, line: 3908, baseType: !1456, size: 64, align: 64, offset: 1408)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1435, file: !47, line: 3915, baseType: !1456, size: 64, align: 64, offset: 1472)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1435, file: !47, line: 3917, baseType: !960, size: 32, align: 32, offset: 1536)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1423, file: !47, line: 3926, baseType: !993, size: 64, align: 64, offset: 192)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1357, file: !47, line: 3564, baseType: !1461, size: 64, align: 64, offset: 1344)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!960, !1347, !1099, !1464, !1466}
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1162)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1357, file: !47, line: 3566, baseType: !1468, size: 64, align: 64, offset: 1408)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!960, !1347, !979, !1466, !1099}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1357, file: !47, line: 3567, baseType: !1394, size: 64, align: 64, offset: 1472)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1357, file: !47, line: 3576, baseType: !1473, size: 64, align: 64, offset: 1536)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DISubroutineType(types: !1475)
!1475 = !{!960, !1347, !1464}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1357, file: !47, line: 3577, baseType: !1477, size: 64, align: 64, offset: 1600)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DISubroutineType(types: !1479)
!1479 = !{!960, !1347, !1099}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1357, file: !47, line: 3584, baseType: !1481, size: 64, align: 64, offset: 1664)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{!960, !1347, !1161}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1357, file: !47, line: 3589, baseType: !1485, size: 64, align: 64, offset: 1728)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{null, !1347}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1357, file: !47, line: 3594, baseType: !960, size: 32, align: 32, offset: 1792)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1357, file: !47, line: 3600, baseType: !955, size: 64, align: 64, offset: 1856)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1357, file: !47, line: 3609, baseType: !1491, size: 64, align: 64, offset: 1920)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1494)
!1494 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !47, line: 3609, flags: DIFlagFwdDecl)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1349, file: !47, line: 1566, baseType: !46, size: 32, align: 32, offset: 192)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1349, file: !47, line: 1581, baseType: !947, size: 32, align: 32, offset: 224)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1349, file: !47, line: 1583, baseType: !979, size: 64, align: 64, offset: 256)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1349, file: !47, line: 1591, baseType: !1499, size: 64, align: 64, offset: 320)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1408, line: 129, size: 1664, align: 64, elements: !1501)
!1501 = !{!1502, !1503, !1504, !1505, !1506, !1524, !1525, !1531, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627}
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1500, file: !1408, line: 136, baseType: !960, size: 32, align: 32)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1500, file: !1408, line: 151, baseType: !960, size: 32, align: 32, offset: 32)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1500, file: !1408, line: 157, baseType: !960, size: 32, align: 32, offset: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1500, file: !1408, line: 159, baseType: !1161, size: 64, align: 64, offset: 128)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1500, file: !1408, line: 161, baseType: !1507, size: 64, align: 64, offset: 192)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1408, line: 117, baseType: !1509)
!1509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1408, line: 100, size: 832, align: 64, elements: !1510)
!1510 = !{!1511, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1509, file: !1408, line: 105, baseType: !1512, size: 256, align: 64)
!1512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1513, size: 256, align: 64, elements: !1450)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1106, line: 238, baseType: !1515)
!1515 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1106, line: 238, flags: DIFlagFwdDecl)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1509, file: !1408, line: 110, baseType: !960, size: 32, align: 32, offset: 256)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1509, file: !1408, line: 111, baseType: !960, size: 32, align: 32, offset: 288)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1509, file: !1408, line: 111, baseType: !960, size: 32, align: 32, offset: 320)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1509, file: !1408, line: 112, baseType: !1170, size: 256, align: 32, offset: 352)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1509, file: !1408, line: 113, baseType: !1453, size: 128, align: 32, offset: 608)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1509, file: !1408, line: 114, baseType: !960, size: 32, align: 32, offset: 736)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1509, file: !1408, line: 115, baseType: !960, size: 32, align: 32, offset: 768)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1509, file: !1408, line: 116, baseType: !960, size: 32, align: 32, offset: 800)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1500, file: !1408, line: 163, baseType: !979, size: 64, align: 64, offset: 256)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1500, file: !1408, line: 165, baseType: !1526, size: 128, align: 64, offset: 320)
!1526 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1408, line: 122, baseType: !1527)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1408, line: 119, size: 128, align: 64, elements: !1528)
!1528 = !{!1529, !1530}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1527, file: !1408, line: 120, baseType: !1099, size: 64, align: 64)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1527, file: !1408, line: 121, baseType: !1161, size: 64, align: 64, offset: 64)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1500, file: !1408, line: 166, baseType: !1532, size: 128, align: 64, offset: 448)
!1532 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1408, line: 127, baseType: !1533)
!1533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1408, line: 124, size: 128, align: 64, elements: !1534)
!1534 = !{!1535, !1608}
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1533, file: !1408, line: 125, baseType: !1536, size: 64, align: 64)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64, align: 64)
!1538 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !47, line: 5794, baseType: !1539)
!1539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !47, line: 5747, size: 512, align: 64, elements: !1540)
!1540 = !{!1541, !1542, !1566, !1570, !1571, !1605, !1606, !1607}
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1539, file: !47, line: 5751, baseType: !969, size: 64, align: 64)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1539, file: !47, line: 5756, baseType: !1543, size: 64, align: 64, offset: 64)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1545)
!1545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !47, line: 5796, size: 512, align: 64, elements: !1546)
!1546 = !{!1547, !1548, !1551, !1552, !1553, !1557, !1561, !1565}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1545, file: !47, line: 5797, baseType: !955, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1545, file: !47, line: 5804, baseType: !1549, size: 64, align: 64, offset: 64)
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64, align: 64)
!1550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1545, file: !47, line: 5815, baseType: !969, size: 64, align: 64, offset: 128)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1545, file: !47, line: 5825, baseType: !960, size: 32, align: 32, offset: 192)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1545, file: !47, line: 5826, baseType: !1554, size: 64, align: 64, offset: 256)
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1555, size: 64, align: 64)
!1555 = !DISubroutineType(types: !1556)
!1556 = !{!960, !1537}
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1545, file: !47, line: 5827, baseType: !1558, size: 64, align: 64, offset: 320)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DISubroutineType(types: !1560)
!1560 = !{!960, !1537, !1099}
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1545, file: !47, line: 5828, baseType: !1562, size: 64, align: 64, offset: 384)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DISubroutineType(types: !1564)
!1564 = !{null, !1537}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1545, file: !47, line: 5829, baseType: !1562, size: 64, align: 64, offset: 448)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1539, file: !47, line: 5762, baseType: !1567, size: 64, align: 64, offset: 128)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !47, line: 5735, baseType: !1569)
!1569 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !47, line: 5735, flags: DIFlagFwdDecl)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1539, file: !47, line: 5768, baseType: !979, size: 64, align: 64, offset: 192)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1539, file: !47, line: 5775, baseType: !1572, size: 64, align: 64, offset: 256)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !47, line: 4085, baseType: !1574)
!1574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !47, line: 3936, size: 1152, align: 64, elements: !1575)
!1575 = !{!1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1574, file: !47, line: 3940, baseType: !658, size: 32, align: 32)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1574, file: !47, line: 3944, baseType: !46, size: 32, align: 32, offset: 32)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1574, file: !47, line: 3948, baseType: !945, size: 32, align: 32, offset: 64)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1574, file: !47, line: 3958, baseType: !1114, size: 64, align: 64, offset: 128)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1574, file: !47, line: 3962, baseType: !960, size: 32, align: 32, offset: 192)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1574, file: !47, line: 3968, baseType: !960, size: 32, align: 32, offset: 224)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1574, file: !47, line: 3973, baseType: !993, size: 64, align: 64, offset: 256)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1574, file: !47, line: 3986, baseType: !960, size: 32, align: 32, offset: 320)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1574, file: !47, line: 3999, baseType: !960, size: 32, align: 32, offset: 352)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1574, file: !47, line: 4004, baseType: !960, size: 32, align: 32, offset: 384)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1574, file: !47, line: 4005, baseType: !960, size: 32, align: 32, offset: 416)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1574, file: !47, line: 4010, baseType: !960, size: 32, align: 32, offset: 448)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1574, file: !47, line: 4011, baseType: !960, size: 32, align: 32, offset: 480)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1574, file: !47, line: 4020, baseType: !999, size: 64, align: 32, offset: 512)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1574, file: !47, line: 4025, baseType: !889, size: 32, align: 32, offset: 576)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1574, file: !47, line: 4030, baseType: !571, size: 32, align: 32, offset: 608)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1574, file: !47, line: 4031, baseType: !578, size: 32, align: 32, offset: 640)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1574, file: !47, line: 4032, baseType: !596, size: 32, align: 32, offset: 672)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1574, file: !47, line: 4033, baseType: !620, size: 32, align: 32, offset: 704)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1574, file: !47, line: 4034, baseType: !639, size: 32, align: 32, offset: 736)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1574, file: !47, line: 4039, baseType: !960, size: 32, align: 32, offset: 768)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1574, file: !47, line: 4046, baseType: !1189, size: 64, align: 64, offset: 832)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1574, file: !47, line: 4050, baseType: !960, size: 32, align: 32, offset: 896)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1574, file: !47, line: 4054, baseType: !960, size: 32, align: 32, offset: 928)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1574, file: !47, line: 4061, baseType: !960, size: 32, align: 32, offset: 960)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1574, file: !47, line: 4065, baseType: !960, size: 32, align: 32, offset: 992)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1574, file: !47, line: 4073, baseType: !960, size: 32, align: 32, offset: 1024)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1574, file: !47, line: 4080, baseType: !960, size: 32, align: 32, offset: 1056)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1574, file: !47, line: 4084, baseType: !960, size: 32, align: 32, offset: 1088)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1539, file: !47, line: 5781, baseType: !1572, size: 64, align: 64, offset: 320)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1539, file: !47, line: 5787, baseType: !999, size: 64, align: 32, offset: 384)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1539, file: !47, line: 5793, baseType: !999, size: 64, align: 32, offset: 448)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1533, file: !1408, line: 126, baseType: !960, size: 32, align: 32, offset: 64)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1500, file: !1408, line: 172, baseType: !1099, size: 64, align: 64, offset: 576)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1500, file: !1408, line: 177, baseType: !1114, size: 64, align: 64, offset: 640)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1500, file: !1408, line: 178, baseType: !947, size: 32, align: 32, offset: 704)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1500, file: !1408, line: 180, baseType: !979, size: 64, align: 64, offset: 768)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1500, file: !1408, line: 185, baseType: !960, size: 32, align: 32, offset: 832)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1500, file: !1408, line: 190, baseType: !979, size: 64, align: 64, offset: 896)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1500, file: !1408, line: 195, baseType: !960, size: 32, align: 32, offset: 960)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1500, file: !1408, line: 200, baseType: !1099, size: 64, align: 64, offset: 1024)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1500, file: !1408, line: 201, baseType: !960, size: 32, align: 32, offset: 1088)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1500, file: !1408, line: 202, baseType: !1161, size: 64, align: 64, offset: 1152)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1500, file: !1408, line: 203, baseType: !960, size: 32, align: 32, offset: 1216)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1500, file: !1408, line: 205, baseType: !960, size: 32, align: 32, offset: 1248)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1500, file: !1408, line: 206, baseType: !960, size: 32, align: 32, offset: 1280)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1500, file: !1408, line: 209, baseType: !1153, size: 64, align: 64, offset: 1344)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1500, file: !1408, line: 212, baseType: !1153, size: 64, align: 64, offset: 1408)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1500, file: !1408, line: 213, baseType: !1161, size: 64, align: 64, offset: 1472)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1500, file: !1408, line: 215, baseType: !960, size: 32, align: 32, offset: 1536)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1500, file: !1408, line: 217, baseType: !960, size: 32, align: 32, offset: 1568)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1500, file: !1408, line: 220, baseType: !960, size: 32, align: 32, offset: 1600)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1349, file: !47, line: 1598, baseType: !979, size: 64, align: 64, offset: 384)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1349, file: !47, line: 1606, baseType: !993, size: 64, align: 64, offset: 448)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1349, file: !47, line: 1614, baseType: !960, size: 32, align: 32, offset: 512)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1349, file: !47, line: 1622, baseType: !960, size: 32, align: 32, offset: 544)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1349, file: !47, line: 1628, baseType: !960, size: 32, align: 32, offset: 576)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1349, file: !47, line: 1636, baseType: !960, size: 32, align: 32, offset: 608)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1349, file: !47, line: 1643, baseType: !960, size: 32, align: 32, offset: 640)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1349, file: !47, line: 1657, baseType: !1114, size: 64, align: 64, offset: 704)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1349, file: !47, line: 1658, baseType: !960, size: 32, align: 32, offset: 768)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1349, file: !47, line: 1679, baseType: !999, size: 64, align: 32, offset: 800)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1349, file: !47, line: 1688, baseType: !960, size: 32, align: 32, offset: 864)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1349, file: !47, line: 1712, baseType: !960, size: 32, align: 32, offset: 896)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1349, file: !47, line: 1729, baseType: !960, size: 32, align: 32, offset: 928)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1349, file: !47, line: 1729, baseType: !960, size: 32, align: 32, offset: 960)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1349, file: !47, line: 1744, baseType: !960, size: 32, align: 32, offset: 992)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1349, file: !47, line: 1744, baseType: !960, size: 32, align: 32, offset: 1024)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1349, file: !47, line: 1751, baseType: !960, size: 32, align: 32, offset: 1056)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1349, file: !47, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1349, file: !47, line: 1791, baseType: !1647, size: 64, align: 64, offset: 1152)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DISubroutineType(types: !1649)
!1649 = !{null, !1650, !1464, !1466, !960, !960, !960}
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1349, file: !47, line: 1808, baseType: !1652, size: 64, align: 64, offset: 1216)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{!667, !1650, !1368}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1349, file: !47, line: 1816, baseType: !960, size: 32, align: 32, offset: 1280)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1349, file: !47, line: 1825, baseType: !1657, size: 32, align: 32, offset: 1312)
!1657 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1349, file: !47, line: 1830, baseType: !960, size: 32, align: 32, offset: 1344)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1349, file: !47, line: 1838, baseType: !1657, size: 32, align: 32, offset: 1376)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1349, file: !47, line: 1846, baseType: !960, size: 32, align: 32, offset: 1408)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1349, file: !47, line: 1851, baseType: !960, size: 32, align: 32, offset: 1440)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1349, file: !47, line: 1861, baseType: !1657, size: 32, align: 32, offset: 1472)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1349, file: !47, line: 1868, baseType: !1657, size: 32, align: 32, offset: 1504)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1349, file: !47, line: 1875, baseType: !1657, size: 32, align: 32, offset: 1536)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1349, file: !47, line: 1882, baseType: !1657, size: 32, align: 32, offset: 1568)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1349, file: !47, line: 1889, baseType: !1657, size: 32, align: 32, offset: 1600)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1349, file: !47, line: 1896, baseType: !1657, size: 32, align: 32, offset: 1632)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1349, file: !47, line: 1903, baseType: !1657, size: 32, align: 32, offset: 1664)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1349, file: !47, line: 1910, baseType: !960, size: 32, align: 32, offset: 1696)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1349, file: !47, line: 1915, baseType: !960, size: 32, align: 32, offset: 1728)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1349, file: !47, line: 1926, baseType: !1466, size: 64, align: 64, offset: 1792)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1349, file: !47, line: 1935, baseType: !999, size: 64, align: 32, offset: 1856)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1349, file: !47, line: 1942, baseType: !960, size: 32, align: 32, offset: 1920)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1349, file: !47, line: 1948, baseType: !960, size: 32, align: 32, offset: 1952)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1349, file: !47, line: 1954, baseType: !960, size: 32, align: 32, offset: 1984)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1349, file: !47, line: 1960, baseType: !960, size: 32, align: 32, offset: 2016)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1349, file: !47, line: 1984, baseType: !960, size: 32, align: 32, offset: 2048)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1349, file: !47, line: 1991, baseType: !960, size: 32, align: 32, offset: 2080)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1349, file: !47, line: 1996, baseType: !960, size: 32, align: 32, offset: 2112)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1349, file: !47, line: 2004, baseType: !960, size: 32, align: 32, offset: 2144)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1349, file: !47, line: 2011, baseType: !960, size: 32, align: 32, offset: 2176)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1349, file: !47, line: 2018, baseType: !960, size: 32, align: 32, offset: 2208)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1349, file: !47, line: 2027, baseType: !960, size: 32, align: 32, offset: 2240)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1349, file: !47, line: 2034, baseType: !960, size: 32, align: 32, offset: 2272)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1349, file: !47, line: 2044, baseType: !960, size: 32, align: 32, offset: 2304)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1349, file: !47, line: 2054, baseType: !1687, size: 64, align: 64, offset: 2368)
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1349, file: !47, line: 2061, baseType: !1687, size: 64, align: 64, offset: 2432)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1349, file: !47, line: 2066, baseType: !960, size: 32, align: 32, offset: 2496)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1349, file: !47, line: 2070, baseType: !960, size: 32, align: 32, offset: 2528)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1349, file: !47, line: 2078, baseType: !960, size: 32, align: 32, offset: 2560)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1349, file: !47, line: 2085, baseType: !960, size: 32, align: 32, offset: 2592)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1349, file: !47, line: 2092, baseType: !960, size: 32, align: 32, offset: 2624)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1349, file: !47, line: 2099, baseType: !960, size: 32, align: 32, offset: 2656)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1349, file: !47, line: 2106, baseType: !960, size: 32, align: 32, offset: 2688)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1349, file: !47, line: 2113, baseType: !960, size: 32, align: 32, offset: 2720)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1349, file: !47, line: 2120, baseType: !960, size: 32, align: 32, offset: 2752)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1349, file: !47, line: 2125, baseType: !960, size: 32, align: 32, offset: 2784)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1349, file: !47, line: 2133, baseType: !960, size: 32, align: 32, offset: 2816)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1349, file: !47, line: 2140, baseType: !960, size: 32, align: 32, offset: 2848)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1349, file: !47, line: 2145, baseType: !960, size: 32, align: 32, offset: 2880)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1349, file: !47, line: 2153, baseType: !960, size: 32, align: 32, offset: 2912)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1349, file: !47, line: 2158, baseType: !960, size: 32, align: 32, offset: 2944)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1349, file: !47, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1349, file: !47, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1349, file: !47, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1349, file: !47, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1349, file: !47, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1349, file: !47, line: 2203, baseType: !960, size: 32, align: 32, offset: 3136)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1349, file: !47, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
