; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--bink.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--bink.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!879 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!880 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OldSources", file: !888, line: 45, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/bink.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900}
!890 = !DIEnumerator(name: "BINKB_SRC_BLOCK_TYPES", value: 0)
!891 = !DIEnumerator(name: "BINKB_SRC_COLORS", value: 1)
!892 = !DIEnumerator(name: "BINKB_SRC_PATTERN", value: 2)
!893 = !DIEnumerator(name: "BINKB_SRC_X_OFF", value: 3)
!894 = !DIEnumerator(name: "BINKB_SRC_Y_OFF", value: 4)
!895 = !DIEnumerator(name: "BINKB_SRC_INTRA_DC", value: 5)
!896 = !DIEnumerator(name: "BINKB_SRC_INTER_DC", value: 6)
!897 = !DIEnumerator(name: "BINKB_SRC_INTRA_Q", value: 7)
!898 = !DIEnumerator(name: "BINKB_SRC_INTER_Q", value: 8)
!899 = !DIEnumerator(name: "BINKB_SRC_INTER_COEFS", value: 9)
!900 = !DIEnumerator(name: "BINKB_NB_SRC", value: 10)
!901 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sources", file: !888, line: 74, size: 32, align: 32, elements: !902)
!902 = !{!903, !904, !905, !906, !907, !908, !909, !910, !911, !912}
!903 = !DIEnumerator(name: "BINK_SRC_BLOCK_TYPES", value: 0)
!904 = !DIEnumerator(name: "BINK_SRC_SUB_BLOCK_TYPES", value: 1)
!905 = !DIEnumerator(name: "BINK_SRC_COLORS", value: 2)
!906 = !DIEnumerator(name: "BINK_SRC_PATTERN", value: 3)
!907 = !DIEnumerator(name: "BINK_SRC_X_OFF", value: 4)
!908 = !DIEnumerator(name: "BINK_SRC_Y_OFF", value: 5)
!909 = !DIEnumerator(name: "BINK_SRC_INTRA_DC", value: 6)
!910 = !DIEnumerator(name: "BINK_SRC_INTER_DC", value: 7)
!911 = !DIEnumerator(name: "BINK_SRC_RUN", value: 8)
!912 = !DIEnumerator(name: "BINK_NB_SRC", value: 9)
!913 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BlockTypes", file: !888, line: 133, size: 32, align: 32, elements: !914)
!914 = !{!915, !916, !917, !918, !919, !920, !921, !922, !923, !924}
!915 = !DIEnumerator(name: "SKIP_BLOCK", value: 0)
!916 = !DIEnumerator(name: "SCALED_BLOCK", value: 1)
!917 = !DIEnumerator(name: "MOTION_BLOCK", value: 2)
!918 = !DIEnumerator(name: "RUN_BLOCK", value: 3)
!919 = !DIEnumerator(name: "RESIDUE_BLOCK", value: 4)
!920 = !DIEnumerator(name: "INTRA_BLOCK", value: 5)
!921 = !DIEnumerator(name: "FILL_BLOCK", value: 6)
!922 = !DIEnumerator(name: "INTER_BLOCK", value: 7)
!923 = !DIEnumerator(name: "PATTERN_BLOCK", value: 8)
!924 = !DIEnumerator(name: "RAW_BLOCK", value: 9)
!925 = !{!926, !927, !928, !936, !938, !940, !943}
!926 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!927 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !931, line: 221, size: 32, align: 8, elements: !932)
!931 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!932 = !{!933}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !930, file: !931, line: 221, baseType: !934, size: 32, align: 32)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !935, line: 51, baseType: !927)
!935 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !935, line: 40, baseType: !937)
!937 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !935, line: 36, baseType: !939)
!939 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !935, line: 37, baseType: !942)
!942 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !935, line: 48, baseType: !945)
!945 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!946 = !{!947, !1670, !1677, !1678, !1693, !1697, !1698, !1705, !1707, !1708, !1710, !1711, !1715, !1716, !1717, !1719, !1721, !1724, !1725, !1729, !1730}
!947 = distinct !DIGlobalVariable(name: "ff_bink_decoder", scope: !0, file: !888, line: 1384, type: !948, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_bink_decoder)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !950)
!950 = !{!951, !955, !956, !957, !958, !959, !968, !971, !974, !977, !982, !983, !1025, !1033, !1034, !1035, !1037, !1585, !1591, !1599, !1603, !1604, !1641, !1645, !1649, !1650, !1654, !1658, !1659, !1663, !1664, !1665}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !949, file: !14, line: 3475, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!954 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !949, file: !14, line: 3480, baseType: !952, size: 64, align: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !949, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !949, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !949, file: !14, line: 3487, baseType: !926, size: 32, align: 32, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !949, file: !14, line: 3488, baseType: !960, size: 64, align: 64, offset: 256)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !963, line: 61, baseType: !964)
!963 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !963, line: 58, size: 64, align: 32, elements: !965)
!965 = !{!966, !967}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !964, file: !963, line: 59, baseType: !926, size: 32, align: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !964, file: !963, line: 60, baseType: !926, size: 32, align: 32, offset: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !949, file: !14, line: 3489, baseType: !969, size: 64, align: 64, offset: 320)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !949, file: !14, line: 3490, baseType: !972, size: 64, align: 64, offset: 384)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !949, file: !14, line: 3491, baseType: !975, size: 64, align: 64, offset: 448)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !949, file: !14, line: 3492, baseType: !978, size: 64, align: 64, offset: 512)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !935, line: 55, baseType: !981)
!981 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !949, file: !14, line: 3493, baseType: !944, size: 8, align: 8, offset: 576)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !949, file: !14, line: 3494, baseType: !984, size: 64, align: 64, offset: 640)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !988)
!988 = !{!989, !990, !995, !999, !1000, !1001, !1002, !1006, !1012, !1014, !1018}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !987, file: !691, line: 72, baseType: !952, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !987, file: !691, line: 78, baseType: !991, size: 64, align: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!952, !994}
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !987, file: !691, line: 85, baseType: !996, size: 64, align: 64, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!998 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !987, file: !691, line: 93, baseType: !926, size: 32, align: 32, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !987, file: !691, line: 99, baseType: !926, size: 32, align: 32, offset: 224)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !987, file: !691, line: 108, baseType: !926, size: 32, align: 32, offset: 256)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !987, file: !691, line: 113, baseType: !1003, size: 64, align: 64, offset: 320)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!994, !994, !994}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !987, file: !691, line: 123, baseType: !1007, size: 64, align: 64, offset: 384)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!1010, !1010}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !987, file: !691, line: 130, baseType: !1013, size: 32, align: 32, offset: 448)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !987, file: !691, line: 136, baseType: !1015, size: 64, align: 64, offset: 512)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!1013, !994}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !987, file: !691, line: 142, baseType: !1019, size: 64, align: 64, offset: 576)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!926, !1022, !994, !952, !926}
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !949, file: !14, line: 3495, baseType: !1026, size: 64, align: 64, offset: 704)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1030)
!1030 = !{!1031, !1032}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1029, file: !14, line: 3402, baseType: !926, size: 32, align: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1029, file: !14, line: 3403, baseType: !952, size: 64, align: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !949, file: !14, line: 3507, baseType: !952, size: 64, align: 64, offset: 768)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !949, file: !14, line: 3516, baseType: !926, size: 32, align: 32, offset: 832)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !949, file: !14, line: 3517, baseType: !1036, size: 64, align: 64, offset: 896)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !949, file: !14, line: 3527, baseType: !1038, size: 64, align: 64, offset: 960)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!926, !1041}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1044)
!1044 = !{!1045, !1046, !1047, !1048, !1051, !1052, !1053, !1054, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1331, !1335, !1336, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1523, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1043, file: !14, line: 1561, baseType: !984, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1043, file: !14, line: 1562, baseType: !926, size: 32, align: 32, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1043, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1043, file: !14, line: 1565, baseType: !1049, size: 64, align: 64, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1043, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1043, file: !14, line: 1581, baseType: !927, size: 32, align: 32, offset: 224)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1043, file: !14, line: 1583, baseType: !994, size: 64, align: 64, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1043, file: !14, line: 1591, baseType: !1055, size: 64, align: 64, offset: 320)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1057, line: 129, size: 1664, align: 64, elements: !1058)
!1057 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1058 = !{!1059, !1060, !1061, !1062, !1157, !1178, !1179, !1208, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1056, file: !1057, line: 136, baseType: !926, size: 32, align: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1056, file: !1057, line: 151, baseType: !926, size: 32, align: 32, offset: 32)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1056, file: !1057, line: 157, baseType: !926, size: 32, align: 32, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1056, file: !1057, line: 159, baseType: !1063, size: 64, align: 64, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1066)
!1066 = !{!1067, !1071, !1073, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1111, !1113, !1114, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1145, !1146, !1147, !1148, !1149, !1150, !1153, !1154, !1155, !1156}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1065, file: !722, line: 282, baseType: !1068, size: 512, align: 64)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 512, align: 64, elements: !1069)
!1069 = !{!1070}
!1070 = !DISubrange(count: 8)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1065, file: !722, line: 299, baseType: !1072, size: 256, align: 32, offset: 512)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 256, align: 32, elements: !1069)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1065, file: !722, line: 315, baseType: !1074, size: 64, align: 64, offset: 768)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1065, file: !722, line: 326, baseType: !926, size: 32, align: 32, offset: 832)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1065, file: !722, line: 326, baseType: !926, size: 32, align: 32, offset: 864)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1065, file: !722, line: 334, baseType: !926, size: 32, align: 32, offset: 896)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1065, file: !722, line: 341, baseType: !926, size: 32, align: 32, offset: 928)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1065, file: !722, line: 346, baseType: !926, size: 32, align: 32, offset: 960)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1065, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1065, file: !722, line: 356, baseType: !962, size: 64, align: 32, offset: 1024)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1065, file: !722, line: 361, baseType: !936, size: 64, align: 64, offset: 1088)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1065, file: !722, line: 369, baseType: !936, size: 64, align: 64, offset: 1152)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1065, file: !722, line: 377, baseType: !936, size: 64, align: 64, offset: 1216)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1065, file: !722, line: 382, baseType: !926, size: 32, align: 32, offset: 1280)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1065, file: !722, line: 386, baseType: !926, size: 32, align: 32, offset: 1312)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1065, file: !722, line: 391, baseType: !926, size: 32, align: 32, offset: 1344)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1065, file: !722, line: 396, baseType: !994, size: 64, align: 64, offset: 1408)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1065, file: !722, line: 403, baseType: !1090, size: 512, align: 64, offset: 1472)
!1090 = !DICompositeType(tag: DW_TAG_array_type, baseType: !980, size: 512, align: 64, elements: !1069)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1065, file: !722, line: 410, baseType: !926, size: 32, align: 32, offset: 1984)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1065, file: !722, line: 415, baseType: !926, size: 32, align: 32, offset: 2016)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1065, file: !722, line: 420, baseType: !926, size: 32, align: 32, offset: 2048)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1065, file: !722, line: 425, baseType: !926, size: 32, align: 32, offset: 2080)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1065, file: !722, line: 435, baseType: !936, size: 64, align: 64, offset: 2112)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1065, file: !722, line: 440, baseType: !926, size: 32, align: 32, offset: 2176)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1065, file: !722, line: 445, baseType: !980, size: 64, align: 64, offset: 2240)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1065, file: !722, line: 459, baseType: !1099, size: 512, align: 64, offset: 2304)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1100, size: 512, align: 64, elements: !1069)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1102, line: 94, baseType: !1103)
!1102 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1102, line: 81, size: 192, align: 64, elements: !1104)
!1104 = !{!1105, !1109, !1110}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1103, file: !1102, line: 82, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1102, line: 73, baseType: !1108)
!1108 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1102, line: 73, flags: DIFlagFwdDecl)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1103, file: !1102, line: 89, baseType: !943, size: 64, align: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1103, file: !1102, line: 93, baseType: !926, size: 32, align: 32, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1065, file: !722, line: 473, baseType: !1112, size: 64, align: 64, offset: 2816)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1065, file: !722, line: 477, baseType: !926, size: 32, align: 32, offset: 2880)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1065, file: !722, line: 479, baseType: !1115, size: 64, align: 64, offset: 2944)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1118)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1119)
!1119 = !{!1120, !1121, !1122, !1123, !1128}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1118, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1118, file: !722, line: 203, baseType: !943, size: 64, align: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1118, file: !722, line: 204, baseType: !926, size: 32, align: 32, offset: 128)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1118, file: !722, line: 205, baseType: !1124, size: 64, align: 64, offset: 192)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1126, line: 86, baseType: !1127)
!1126 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1127 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1126, line: 86, flags: DIFlagFwdDecl)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1118, file: !722, line: 206, baseType: !1100, size: 64, align: 64, offset: 256)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1065, file: !722, line: 480, baseType: !926, size: 32, align: 32, offset: 3008)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1065, file: !722, line: 505, baseType: !926, size: 32, align: 32, offset: 3040)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1065, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1065, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1065, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1065, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1065, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1065, file: !722, line: 532, baseType: !936, size: 64, align: 64, offset: 3264)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1065, file: !722, line: 539, baseType: !936, size: 64, align: 64, offset: 3328)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1065, file: !722, line: 547, baseType: !936, size: 64, align: 64, offset: 3392)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1065, file: !722, line: 554, baseType: !1124, size: 64, align: 64, offset: 3456)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1065, file: !722, line: 563, baseType: !926, size: 32, align: 32, offset: 3520)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1065, file: !722, line: 572, baseType: !926, size: 32, align: 32, offset: 3552)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1065, file: !722, line: 581, baseType: !926, size: 32, align: 32, offset: 3584)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1065, file: !722, line: 588, baseType: !1144, size: 64, align: 64, offset: 3648)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1065, file: !722, line: 593, baseType: !926, size: 32, align: 32, offset: 3712)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1065, file: !722, line: 596, baseType: !926, size: 32, align: 32, offset: 3744)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1065, file: !722, line: 599, baseType: !1100, size: 64, align: 64, offset: 3776)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1065, file: !722, line: 605, baseType: !1100, size: 64, align: 64, offset: 3840)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1065, file: !722, line: 616, baseType: !1100, size: 64, align: 64, offset: 3904)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1065, file: !722, line: 626, baseType: !1151, size: 64, align: 64, offset: 3968)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1152, line: 216, baseType: !981)
!1152 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1065, file: !722, line: 627, baseType: !1151, size: 64, align: 64, offset: 4032)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1065, file: !722, line: 628, baseType: !1151, size: 64, align: 64, offset: 4096)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1065, file: !722, line: 629, baseType: !1151, size: 64, align: 64, offset: 4160)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1065, file: !722, line: 645, baseType: !1100, size: 64, align: 64, offset: 4224)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1056, file: !1057, line: 161, baseType: !1158, size: 64, align: 64, offset: 192)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1057, line: 117, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1057, line: 100, size: 832, align: 64, elements: !1161)
!1161 = !{!1162, !1169, !1170, !1171, !1172, !1173, !1175, !1176, !1177}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1160, file: !1057, line: 105, baseType: !1163, size: 256, align: 64)
!1163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1164, size: 256, align: 64, elements: !1167)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1102, line: 238, baseType: !1166)
!1166 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1102, line: 238, flags: DIFlagFwdDecl)
!1167 = !{!1168}
!1168 = !DISubrange(count: 4)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1160, file: !1057, line: 110, baseType: !926, size: 32, align: 32, offset: 256)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1160, file: !1057, line: 111, baseType: !926, size: 32, align: 32, offset: 288)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1160, file: !1057, line: 111, baseType: !926, size: 32, align: 32, offset: 320)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1160, file: !1057, line: 112, baseType: !1072, size: 256, align: 32, offset: 352)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1160, file: !1057, line: 113, baseType: !1174, size: 128, align: 32, offset: 608)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 128, align: 32, elements: !1167)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1160, file: !1057, line: 114, baseType: !926, size: 32, align: 32, offset: 736)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1160, file: !1057, line: 115, baseType: !926, size: 32, align: 32, offset: 768)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1160, file: !1057, line: 116, baseType: !926, size: 32, align: 32, offset: 800)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1056, file: !1057, line: 163, baseType: !994, size: 64, align: 64, offset: 256)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1056, file: !1057, line: 165, baseType: !1180, size: 128, align: 64, offset: 320)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1057, line: 122, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1057, line: 119, size: 128, align: 64, elements: !1182)
!1182 = !{!1183, !1207}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1181, file: !1057, line: 120, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1186)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1187)
!1187 = !{!1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1203, !1204, !1205, !1206}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1186, file: !14, line: 1451, baseType: !1100, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1186, file: !14, line: 1461, baseType: !936, size: 64, align: 64, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1186, file: !14, line: 1467, baseType: !936, size: 64, align: 64, offset: 128)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1186, file: !14, line: 1468, baseType: !943, size: 64, align: 64, offset: 192)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1186, file: !14, line: 1469, baseType: !926, size: 32, align: 32, offset: 256)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1186, file: !14, line: 1470, baseType: !926, size: 32, align: 32, offset: 288)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1186, file: !14, line: 1474, baseType: !926, size: 32, align: 32, offset: 320)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1186, file: !14, line: 1479, baseType: !1196, size: 64, align: 64, offset: 384)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1199)
!1199 = !{!1200, !1201, !1202}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1198, file: !14, line: 1412, baseType: !943, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1198, file: !14, line: 1413, baseType: !926, size: 32, align: 32, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1198, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1186, file: !14, line: 1480, baseType: !926, size: 32, align: 32, offset: 448)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1186, file: !14, line: 1486, baseType: !936, size: 64, align: 64, offset: 512)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1186, file: !14, line: 1488, baseType: !936, size: 64, align: 64, offset: 576)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1186, file: !14, line: 1497, baseType: !936, size: 64, align: 64, offset: 640)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1181, file: !1057, line: 121, baseType: !1063, size: 64, align: 64, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1056, file: !1057, line: 166, baseType: !1209, size: 128, align: 64, offset: 448)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1057, line: 127, baseType: !1210)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1057, line: 124, size: 128, align: 64, elements: !1211)
!1211 = !{!1212, !1285}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1210, file: !1057, line: 125, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1217)
!1217 = !{!1218, !1219, !1243, !1247, !1248, !1282, !1283, !1284}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1216, file: !14, line: 5751, baseType: !984, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1216, file: !14, line: 5756, baseType: !1220, size: 64, align: 64, offset: 64)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1222)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1223)
!1223 = !{!1224, !1225, !1228, !1229, !1230, !1234, !1238, !1242}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1222, file: !14, line: 5797, baseType: !952, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1222, file: !14, line: 5804, baseType: !1226, size: 64, align: 64, offset: 64)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1222, file: !14, line: 5815, baseType: !984, size: 64, align: 64, offset: 128)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1222, file: !14, line: 5825, baseType: !926, size: 32, align: 32, offset: 192)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1222, file: !14, line: 5826, baseType: !1231, size: 64, align: 64, offset: 256)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!926, !1214}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1222, file: !14, line: 5827, baseType: !1235, size: 64, align: 64, offset: 320)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!926, !1214, !1184}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1222, file: !14, line: 5828, baseType: !1239, size: 64, align: 64, offset: 384)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{null, !1214}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1222, file: !14, line: 5829, baseType: !1239, size: 64, align: 64, offset: 448)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1216, file: !14, line: 5762, baseType: !1244, size: 64, align: 64, offset: 128)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1246)
!1246 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1216, file: !14, line: 5768, baseType: !994, size: 64, align: 64, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1216, file: !14, line: 5775, baseType: !1249, size: 64, align: 64, offset: 256)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1252)
!1252 = !{!1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1251, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1251, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1251, file: !14, line: 3948, baseType: !934, size: 32, align: 32, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1251, file: !14, line: 3958, baseType: !943, size: 64, align: 64, offset: 128)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1251, file: !14, line: 3962, baseType: !926, size: 32, align: 32, offset: 192)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1251, file: !14, line: 3968, baseType: !926, size: 32, align: 32, offset: 224)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1251, file: !14, line: 3973, baseType: !936, size: 64, align: 64, offset: 256)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1251, file: !14, line: 3986, baseType: !926, size: 32, align: 32, offset: 320)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1251, file: !14, line: 3999, baseType: !926, size: 32, align: 32, offset: 352)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1251, file: !14, line: 4004, baseType: !926, size: 32, align: 32, offset: 384)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1251, file: !14, line: 4005, baseType: !926, size: 32, align: 32, offset: 416)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1251, file: !14, line: 4010, baseType: !926, size: 32, align: 32, offset: 448)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1251, file: !14, line: 4011, baseType: !926, size: 32, align: 32, offset: 480)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1251, file: !14, line: 4020, baseType: !962, size: 64, align: 32, offset: 512)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1251, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1251, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1251, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1251, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1251, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1251, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1251, file: !14, line: 4039, baseType: !926, size: 32, align: 32, offset: 768)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1251, file: !14, line: 4046, baseType: !980, size: 64, align: 64, offset: 832)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1251, file: !14, line: 4050, baseType: !926, size: 32, align: 32, offset: 896)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1251, file: !14, line: 4054, baseType: !926, size: 32, align: 32, offset: 928)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1251, file: !14, line: 4061, baseType: !926, size: 32, align: 32, offset: 960)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1251, file: !14, line: 4065, baseType: !926, size: 32, align: 32, offset: 992)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1251, file: !14, line: 4073, baseType: !926, size: 32, align: 32, offset: 1024)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1251, file: !14, line: 4080, baseType: !926, size: 32, align: 32, offset: 1056)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1251, file: !14, line: 4084, baseType: !926, size: 32, align: 32, offset: 1088)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1216, file: !14, line: 5781, baseType: !1249, size: 64, align: 64, offset: 320)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1216, file: !14, line: 5787, baseType: !962, size: 64, align: 32, offset: 384)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1216, file: !14, line: 5793, baseType: !962, size: 64, align: 32, offset: 448)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1210, file: !1057, line: 126, baseType: !926, size: 32, align: 32, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1056, file: !1057, line: 172, baseType: !1184, size: 64, align: 64, offset: 576)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1056, file: !1057, line: 177, baseType: !943, size: 64, align: 64, offset: 640)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1056, file: !1057, line: 178, baseType: !927, size: 32, align: 32, offset: 704)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1056, file: !1057, line: 180, baseType: !994, size: 64, align: 64, offset: 768)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1056, file: !1057, line: 185, baseType: !926, size: 32, align: 32, offset: 832)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1056, file: !1057, line: 190, baseType: !994, size: 64, align: 64, offset: 896)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1056, file: !1057, line: 195, baseType: !926, size: 32, align: 32, offset: 960)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1056, file: !1057, line: 200, baseType: !1184, size: 64, align: 64, offset: 1024)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1056, file: !1057, line: 201, baseType: !926, size: 32, align: 32, offset: 1088)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1056, file: !1057, line: 202, baseType: !1063, size: 64, align: 64, offset: 1152)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1056, file: !1057, line: 203, baseType: !926, size: 32, align: 32, offset: 1216)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1056, file: !1057, line: 205, baseType: !926, size: 32, align: 32, offset: 1248)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1056, file: !1057, line: 206, baseType: !926, size: 32, align: 32, offset: 1280)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1056, file: !1057, line: 209, baseType: !1151, size: 64, align: 64, offset: 1344)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1056, file: !1057, line: 212, baseType: !1151, size: 64, align: 64, offset: 1408)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1056, file: !1057, line: 213, baseType: !1063, size: 64, align: 64, offset: 1472)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1056, file: !1057, line: 215, baseType: !926, size: 32, align: 32, offset: 1536)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1056, file: !1057, line: 217, baseType: !926, size: 32, align: 32, offset: 1568)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1056, file: !1057, line: 220, baseType: !926, size: 32, align: 32, offset: 1600)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1043, file: !14, line: 1598, baseType: !994, size: 64, align: 64, offset: 384)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1043, file: !14, line: 1606, baseType: !936, size: 64, align: 64, offset: 448)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1043, file: !14, line: 1614, baseType: !926, size: 32, align: 32, offset: 512)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1043, file: !14, line: 1622, baseType: !926, size: 32, align: 32, offset: 544)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1043, file: !14, line: 1628, baseType: !926, size: 32, align: 32, offset: 576)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1043, file: !14, line: 1636, baseType: !926, size: 32, align: 32, offset: 608)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1043, file: !14, line: 1643, baseType: !926, size: 32, align: 32, offset: 640)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1043, file: !14, line: 1657, baseType: !943, size: 64, align: 64, offset: 704)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1043, file: !14, line: 1658, baseType: !926, size: 32, align: 32, offset: 768)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1043, file: !14, line: 1679, baseType: !962, size: 64, align: 32, offset: 800)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1043, file: !14, line: 1688, baseType: !926, size: 32, align: 32, offset: 864)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1043, file: !14, line: 1712, baseType: !926, size: 32, align: 32, offset: 896)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1043, file: !14, line: 1729, baseType: !926, size: 32, align: 32, offset: 928)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1043, file: !14, line: 1729, baseType: !926, size: 32, align: 32, offset: 960)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1043, file: !14, line: 1744, baseType: !926, size: 32, align: 32, offset: 992)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1043, file: !14, line: 1744, baseType: !926, size: 32, align: 32, offset: 1024)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1043, file: !14, line: 1751, baseType: !926, size: 32, align: 32, offset: 1056)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1043, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1043, file: !14, line: 1791, baseType: !1324, size: 64, align: 64, offset: 1152)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{null, !1327, !1328, !1330, !926, !926, !926}
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1064)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1043, file: !14, line: 1808, baseType: !1332, size: 64, align: 64, offset: 1216)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!473, !1327, !969}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1043, file: !14, line: 1816, baseType: !926, size: 32, align: 32, offset: 1280)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1043, file: !14, line: 1825, baseType: !1337, size: 32, align: 32, offset: 1312)
!1337 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1043, file: !14, line: 1830, baseType: !926, size: 32, align: 32, offset: 1344)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1043, file: !14, line: 1838, baseType: !1337, size: 32, align: 32, offset: 1376)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1043, file: !14, line: 1846, baseType: !926, size: 32, align: 32, offset: 1408)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1043, file: !14, line: 1851, baseType: !926, size: 32, align: 32, offset: 1440)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1043, file: !14, line: 1861, baseType: !1337, size: 32, align: 32, offset: 1472)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1043, file: !14, line: 1868, baseType: !1337, size: 32, align: 32, offset: 1504)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1043, file: !14, line: 1875, baseType: !1337, size: 32, align: 32, offset: 1536)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1043, file: !14, line: 1882, baseType: !1337, size: 32, align: 32, offset: 1568)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1043, file: !14, line: 1889, baseType: !1337, size: 32, align: 32, offset: 1600)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1043, file: !14, line: 1896, baseType: !1337, size: 32, align: 32, offset: 1632)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1043, file: !14, line: 1903, baseType: !1337, size: 32, align: 32, offset: 1664)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1043, file: !14, line: 1910, baseType: !926, size: 32, align: 32, offset: 1696)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1043, file: !14, line: 1915, baseType: !926, size: 32, align: 32, offset: 1728)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1043, file: !14, line: 1926, baseType: !1330, size: 64, align: 64, offset: 1792)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1043, file: !14, line: 1935, baseType: !962, size: 64, align: 32, offset: 1856)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1043, file: !14, line: 1942, baseType: !926, size: 32, align: 32, offset: 1920)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1043, file: !14, line: 1948, baseType: !926, size: 32, align: 32, offset: 1952)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1043, file: !14, line: 1954, baseType: !926, size: 32, align: 32, offset: 1984)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1043, file: !14, line: 1960, baseType: !926, size: 32, align: 32, offset: 2016)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1043, file: !14, line: 1984, baseType: !926, size: 32, align: 32, offset: 2048)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1043, file: !14, line: 1991, baseType: !926, size: 32, align: 32, offset: 2080)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1043, file: !14, line: 1996, baseType: !926, size: 32, align: 32, offset: 2112)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1043, file: !14, line: 2004, baseType: !926, size: 32, align: 32, offset: 2144)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1043, file: !14, line: 2011, baseType: !926, size: 32, align: 32, offset: 2176)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1043, file: !14, line: 2018, baseType: !926, size: 32, align: 32, offset: 2208)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1043, file: !14, line: 2027, baseType: !926, size: 32, align: 32, offset: 2240)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1043, file: !14, line: 2034, baseType: !926, size: 32, align: 32, offset: 2272)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1043, file: !14, line: 2044, baseType: !926, size: 32, align: 32, offset: 2304)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1043, file: !14, line: 2054, baseType: !1367, size: 64, align: 64, offset: 2368)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !935, line: 49, baseType: !1369)
!1369 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1043, file: !14, line: 2061, baseType: !1367, size: 64, align: 64, offset: 2432)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1043, file: !14, line: 2066, baseType: !926, size: 32, align: 32, offset: 2496)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1043, file: !14, line: 2070, baseType: !926, size: 32, align: 32, offset: 2528)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1043, file: !14, line: 2078, baseType: !926, size: 32, align: 32, offset: 2560)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1043, file: !14, line: 2085, baseType: !926, size: 32, align: 32, offset: 2592)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1043, file: !14, line: 2092, baseType: !926, size: 32, align: 32, offset: 2624)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1043, file: !14, line: 2099, baseType: !926, size: 32, align: 32, offset: 2656)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1043, file: !14, line: 2106, baseType: !926, size: 32, align: 32, offset: 2688)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1043, file: !14, line: 2113, baseType: !926, size: 32, align: 32, offset: 2720)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1043, file: !14, line: 2120, baseType: !926, size: 32, align: 32, offset: 2752)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1043, file: !14, line: 2125, baseType: !926, size: 32, align: 32, offset: 2784)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1043, file: !14, line: 2133, baseType: !926, size: 32, align: 32, offset: 2816)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1043, file: !14, line: 2140, baseType: !926, size: 32, align: 32, offset: 2848)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1043, file: !14, line: 2145, baseType: !926, size: 32, align: 32, offset: 2880)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1043, file: !14, line: 2153, baseType: !926, size: 32, align: 32, offset: 2912)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1043, file: !14, line: 2158, baseType: !926, size: 32, align: 32, offset: 2944)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1043, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1043, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1043, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1043, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1043, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1043, file: !14, line: 2203, baseType: !926, size: 32, align: 32, offset: 3136)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1043, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1043, file: !14, line: 2212, baseType: !926, size: 32, align: 32, offset: 3200)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1043, file: !14, line: 2213, baseType: !926, size: 32, align: 32, offset: 3232)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1043, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1043, file: !14, line: 2232, baseType: !926, size: 32, align: 32, offset: 3296)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1043, file: !14, line: 2243, baseType: !926, size: 32, align: 32, offset: 3328)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1043, file: !14, line: 2249, baseType: !926, size: 32, align: 32, offset: 3360)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1043, file: !14, line: 2256, baseType: !926, size: 32, align: 32, offset: 3392)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1043, file: !14, line: 2263, baseType: !980, size: 64, align: 64, offset: 3456)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1043, file: !14, line: 2270, baseType: !980, size: 64, align: 64, offset: 3520)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1043, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1043, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1043, file: !14, line: 2367, baseType: !1405, size: 64, align: 64, offset: 3648)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DISubroutineType(types: !1407)
!1407 = !{!926, !1327, !1063, !926}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1043, file: !14, line: 2383, baseType: !926, size: 32, align: 32, offset: 3712)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1043, file: !14, line: 2386, baseType: !1337, size: 32, align: 32, offset: 3744)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1043, file: !14, line: 2387, baseType: !1337, size: 32, align: 32, offset: 3776)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1043, file: !14, line: 2394, baseType: !926, size: 32, align: 32, offset: 3808)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1043, file: !14, line: 2401, baseType: !926, size: 32, align: 32, offset: 3840)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1043, file: !14, line: 2408, baseType: !926, size: 32, align: 32, offset: 3872)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1043, file: !14, line: 2415, baseType: !926, size: 32, align: 32, offset: 3904)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1043, file: !14, line: 2422, baseType: !926, size: 32, align: 32, offset: 3936)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1043, file: !14, line: 2423, baseType: !1417, size: 64, align: 64, offset: 3968)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1419)
!1419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1420)
!1420 = !{!1421, !1422, !1423, !1424}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1419, file: !14, line: 827, baseType: !926, size: 32, align: 32)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1419, file: !14, line: 828, baseType: !926, size: 32, align: 32, offset: 32)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1419, file: !14, line: 829, baseType: !926, size: 32, align: 32, offset: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1419, file: !14, line: 830, baseType: !1337, size: 32, align: 32, offset: 96)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1043, file: !14, line: 2430, baseType: !936, size: 64, align: 64, offset: 4032)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1043, file: !14, line: 2437, baseType: !936, size: 64, align: 64, offset: 4096)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1043, file: !14, line: 2444, baseType: !1337, size: 32, align: 32, offset: 4160)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1043, file: !14, line: 2451, baseType: !1337, size: 32, align: 32, offset: 4192)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1043, file: !14, line: 2458, baseType: !926, size: 32, align: 32, offset: 4224)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1043, file: !14, line: 2469, baseType: !926, size: 32, align: 32, offset: 4256)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1043, file: !14, line: 2475, baseType: !926, size: 32, align: 32, offset: 4288)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1043, file: !14, line: 2481, baseType: !926, size: 32, align: 32, offset: 4320)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1043, file: !14, line: 2485, baseType: !926, size: 32, align: 32, offset: 4352)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1043, file: !14, line: 2489, baseType: !926, size: 32, align: 32, offset: 4384)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1043, file: !14, line: 2493, baseType: !926, size: 32, align: 32, offset: 4416)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1043, file: !14, line: 2501, baseType: !926, size: 32, align: 32, offset: 4448)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1043, file: !14, line: 2506, baseType: !926, size: 32, align: 32, offset: 4480)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1043, file: !14, line: 2510, baseType: !926, size: 32, align: 32, offset: 4512)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1043, file: !14, line: 2514, baseType: !936, size: 64, align: 64, offset: 4544)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1043, file: !14, line: 2528, baseType: !1441, size: 64, align: 64, offset: 4608)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DISubroutineType(types: !1443)
!1443 = !{null, !1327, !994, !926, !926}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1043, file: !14, line: 2534, baseType: !926, size: 32, align: 32, offset: 4672)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1043, file: !14, line: 2545, baseType: !926, size: 32, align: 32, offset: 4704)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1043, file: !14, line: 2547, baseType: !926, size: 32, align: 32, offset: 4736)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1043, file: !14, line: 2549, baseType: !926, size: 32, align: 32, offset: 4768)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1043, file: !14, line: 2551, baseType: !926, size: 32, align: 32, offset: 4800)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1043, file: !14, line: 2553, baseType: !926, size: 32, align: 32, offset: 4832)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1043, file: !14, line: 2555, baseType: !926, size: 32, align: 32, offset: 4864)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1043, file: !14, line: 2557, baseType: !926, size: 32, align: 32, offset: 4896)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1043, file: !14, line: 2559, baseType: !926, size: 32, align: 32, offset: 4928)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1043, file: !14, line: 2563, baseType: !926, size: 32, align: 32, offset: 4960)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1043, file: !14, line: 2571, baseType: !1455, size: 64, align: 64, offset: 4992)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1043, file: !14, line: 2579, baseType: !1455, size: 64, align: 64, offset: 5056)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1043, file: !14, line: 2586, baseType: !926, size: 32, align: 32, offset: 5120)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1043, file: !14, line: 2615, baseType: !926, size: 32, align: 32, offset: 5152)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1043, file: !14, line: 2627, baseType: !926, size: 32, align: 32, offset: 5184)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1043, file: !14, line: 2637, baseType: !926, size: 32, align: 32, offset: 5216)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1043, file: !14, line: 2681, baseType: !926, size: 32, align: 32, offset: 5248)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1043, file: !14, line: 2709, baseType: !936, size: 64, align: 64, offset: 5312)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1043, file: !14, line: 2716, baseType: !1464, size: 64, align: 64, offset: 5376)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1466)
!1466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1467)
!1467 = !{!1468, !1469, !1470, !1471, !1472, !1473, !1477, !1483, !1487, !1488, !1489, !1490, !1496, !1497, !1498, !1499, !1500}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1466, file: !14, line: 3642, baseType: !952, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1466, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1466, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1466, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1466, file: !14, line: 3669, baseType: !926, size: 32, align: 32, offset: 160)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1466, file: !14, line: 3682, baseType: !1474, size: 64, align: 64, offset: 192)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64, align: 64)
!1475 = !DISubroutineType(types: !1476)
!1476 = !{!926, !1041, !1063}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1466, file: !14, line: 3698, baseType: !1478, size: 64, align: 64, offset: 256)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DISubroutineType(types: !1480)
!1480 = !{!926, !1041, !1481, !934}
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1466, file: !14, line: 3712, baseType: !1484, size: 64, align: 64, offset: 320)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{!926, !1041, !926, !1481, !934}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1466, file: !14, line: 3726, baseType: !1478, size: 64, align: 64, offset: 384)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1466, file: !14, line: 3737, baseType: !1038, size: 64, align: 64, offset: 448)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1466, file: !14, line: 3746, baseType: !926, size: 32, align: 32, offset: 512)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1466, file: !14, line: 3757, baseType: !1491, size: 64, align: 64, offset: 576)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{null, !1494}
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1466, file: !14, line: 3766, baseType: !1038, size: 64, align: 64, offset: 640)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1466, file: !14, line: 3774, baseType: !1038, size: 64, align: 64, offset: 704)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1466, file: !14, line: 3780, baseType: !926, size: 32, align: 32, offset: 768)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1466, file: !14, line: 3785, baseType: !926, size: 32, align: 32, offset: 800)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1466, file: !14, line: 3795, baseType: !1501, size: 64, align: 64, offset: 832)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{!926, !1041, !1100}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1043, file: !14, line: 2728, baseType: !994, size: 64, align: 64, offset: 5440)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1043, file: !14, line: 2735, baseType: !1090, size: 512, align: 64, offset: 5504)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1043, file: !14, line: 2742, baseType: !926, size: 32, align: 32, offset: 6016)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1043, file: !14, line: 2755, baseType: !926, size: 32, align: 32, offset: 6048)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1043, file: !14, line: 2776, baseType: !926, size: 32, align: 32, offset: 6080)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1043, file: !14, line: 2783, baseType: !926, size: 32, align: 32, offset: 6112)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1043, file: !14, line: 2791, baseType: !926, size: 32, align: 32, offset: 6144)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1043, file: !14, line: 2802, baseType: !1063, size: 64, align: 64, offset: 6208)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1043, file: !14, line: 2811, baseType: !926, size: 32, align: 32, offset: 6272)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1043, file: !14, line: 2821, baseType: !926, size: 32, align: 32, offset: 6304)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1043, file: !14, line: 2830, baseType: !926, size: 32, align: 32, offset: 6336)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1043, file: !14, line: 2840, baseType: !926, size: 32, align: 32, offset: 6368)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1043, file: !14, line: 2851, baseType: !1517, size: 64, align: 64, offset: 6400)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64, align: 64)
!1518 = !DISubroutineType(types: !1519)
!1519 = !{!926, !1327, !1520, !994, !1330, !926, !926}
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DISubroutineType(types: !1522)
!1522 = !{!926, !1327, !994}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1043, file: !14, line: 2871, baseType: !1524, size: 64, align: 64, offset: 6464)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DISubroutineType(types: !1526)
!1526 = !{!926, !1327, !1527, !994, !1330, !926}
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64, align: 64)
!1528 = !DISubroutineType(types: !1529)
!1529 = !{!926, !1327, !994, !926, !926}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1043, file: !14, line: 2878, baseType: !926, size: 32, align: 32, offset: 6528)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1043, file: !14, line: 2885, baseType: !926, size: 32, align: 32, offset: 6560)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1043, file: !14, line: 3005, baseType: !926, size: 32, align: 32, offset: 6592)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1043, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1043, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1043, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1043, file: !14, line: 3037, baseType: !943, size: 64, align: 64, offset: 6720)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1043, file: !14, line: 3038, baseType: !926, size: 32, align: 32, offset: 6784)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1043, file: !14, line: 3050, baseType: !980, size: 64, align: 64, offset: 6848)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1043, file: !14, line: 3065, baseType: !926, size: 32, align: 32, offset: 6912)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1043, file: !14, line: 3083, baseType: !926, size: 32, align: 32, offset: 6944)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1043, file: !14, line: 3092, baseType: !962, size: 64, align: 32, offset: 6976)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1043, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1043, file: !14, line: 3106, baseType: !962, size: 64, align: 32, offset: 7072)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1043, file: !14, line: 3113, baseType: !1545, size: 64, align: 64, offset: 7168)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64, align: 64)
!1546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1547)
!1547 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1548)
!1548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1549)
!1549 = !{!1550, !1551, !1552, !1553, !1554, !1555, !1558}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1548, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1548, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1548, file: !14, line: 720, baseType: !952, size: 64, align: 64, offset: 64)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1548, file: !14, line: 724, baseType: !952, size: 64, align: 64, offset: 128)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1548, file: !14, line: 728, baseType: !926, size: 32, align: 32, offset: 192)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1548, file: !14, line: 734, baseType: !1556, size: 64, align: 64, offset: 256)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64, align: 64)
!1557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1548, file: !14, line: 739, baseType: !1559, size: 64, align: 64, offset: 320)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64, align: 64)
!1560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1043, file: !14, line: 3129, baseType: !936, size: 64, align: 64, offset: 7232)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1043, file: !14, line: 3130, baseType: !936, size: 64, align: 64, offset: 7296)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1043, file: !14, line: 3131, baseType: !936, size: 64, align: 64, offset: 7360)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1043, file: !14, line: 3132, baseType: !936, size: 64, align: 64, offset: 7424)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1043, file: !14, line: 3139, baseType: !1455, size: 64, align: 64, offset: 7488)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1043, file: !14, line: 3147, baseType: !926, size: 32, align: 32, offset: 7552)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1043, file: !14, line: 3165, baseType: !926, size: 32, align: 32, offset: 7584)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1043, file: !14, line: 3172, baseType: !926, size: 32, align: 32, offset: 7616)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1043, file: !14, line: 3180, baseType: !926, size: 32, align: 32, offset: 7648)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1043, file: !14, line: 3191, baseType: !1367, size: 64, align: 64, offset: 7680)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1043, file: !14, line: 3199, baseType: !943, size: 64, align: 64, offset: 7744)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1043, file: !14, line: 3207, baseType: !1455, size: 64, align: 64, offset: 7808)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1043, file: !14, line: 3214, baseType: !927, size: 32, align: 32, offset: 7872)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1043, file: !14, line: 3224, baseType: !1196, size: 64, align: 64, offset: 7936)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1043, file: !14, line: 3225, baseType: !926, size: 32, align: 32, offset: 8000)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1043, file: !14, line: 3249, baseType: !1100, size: 64, align: 64, offset: 8064)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1043, file: !14, line: 3256, baseType: !926, size: 32, align: 32, offset: 8128)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1043, file: !14, line: 3271, baseType: !926, size: 32, align: 32, offset: 8160)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1043, file: !14, line: 3279, baseType: !936, size: 64, align: 64, offset: 8192)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1043, file: !14, line: 3301, baseType: !1100, size: 64, align: 64, offset: 8256)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1043, file: !14, line: 3310, baseType: !926, size: 32, align: 32, offset: 8320)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1043, file: !14, line: 3337, baseType: !926, size: 32, align: 32, offset: 8352)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1043, file: !14, line: 3351, baseType: !926, size: 32, align: 32, offset: 8384)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1043, file: !14, line: 3359, baseType: !926, size: 32, align: 32, offset: 8416)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !949, file: !14, line: 3535, baseType: !1586, size: 64, align: 64, offset: 1024)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DISubroutineType(types: !1588)
!1588 = !{!926, !1041, !1589}
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1042)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !949, file: !14, line: 3541, baseType: !1592, size: 64, align: 64, offset: 1088)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1594)
!1594 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1595)
!1595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1057, line: 223, size: 128, align: 64, elements: !1596)
!1596 = !{!1597, !1598}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1595, file: !1057, line: 224, baseType: !1481, size: 64, align: 64)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1595, file: !1057, line: 225, baseType: !1481, size: 64, align: 64, offset: 64)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !949, file: !14, line: 3549, baseType: !1600, size: 64, align: 64, offset: 1152)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DISubroutineType(types: !1602)
!1602 = !{null, !1036}
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !949, file: !14, line: 3551, baseType: !1038, size: 64, align: 64, offset: 1216)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !949, file: !14, line: 3552, baseType: !1605, size: 64, align: 64, offset: 1280)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DISubroutineType(types: !1607)
!1607 = !{!926, !1041, !943, !926, !1608}
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1610)
!1610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1611)
!1611 = !{!1612, !1613, !1614, !1615, !1616, !1640}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1610, file: !14, line: 3921, baseType: !1368, size: 16, align: 16)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1610, file: !14, line: 3922, baseType: !934, size: 32, align: 32, offset: 32)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1610, file: !14, line: 3923, baseType: !934, size: 32, align: 32, offset: 64)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1610, file: !14, line: 3924, baseType: !927, size: 32, align: 32, offset: 96)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1610, file: !14, line: 3925, baseType: !1617, size: 64, align: 64, offset: 128)
!1617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1618, size: 64, align: 64)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1620)
!1620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1621)
!1621 = !{!1622, !1623, !1624, !1625, !1626, !1627, !1633, !1635, !1636, !1637, !1638, !1639}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1620, file: !14, line: 3886, baseType: !926, size: 32, align: 32)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1620, file: !14, line: 3887, baseType: !926, size: 32, align: 32, offset: 32)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1620, file: !14, line: 3888, baseType: !926, size: 32, align: 32, offset: 64)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1620, file: !14, line: 3889, baseType: !926, size: 32, align: 32, offset: 96)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1620, file: !14, line: 3890, baseType: !926, size: 32, align: 32, offset: 128)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1620, file: !14, line: 3897, baseType: !1628, size: 768, align: 64, offset: 192)
!1628 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1629)
!1629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1630)
!1630 = !{!1631, !1632}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1629, file: !14, line: 3855, baseType: !1068, size: 512, align: 64)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1629, file: !14, line: 3857, baseType: !1072, size: 256, align: 32, offset: 512)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1620, file: !14, line: 3903, baseType: !1634, size: 256, align: 64, offset: 960)
!1634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 256, align: 64, elements: !1167)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1620, file: !14, line: 3904, baseType: !1174, size: 128, align: 32, offset: 1216)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1620, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1620, file: !14, line: 3908, baseType: !1455, size: 64, align: 64, offset: 1408)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1620, file: !14, line: 3915, baseType: !1455, size: 64, align: 64, offset: 1472)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1620, file: !14, line: 3917, baseType: !926, size: 32, align: 32, offset: 1536)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1610, file: !14, line: 3926, baseType: !936, size: 64, align: 64, offset: 192)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !949, file: !14, line: 3564, baseType: !1642, size: 64, align: 64, offset: 1344)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{!926, !1041, !1184, !1328, !1330}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !949, file: !14, line: 3566, baseType: !1646, size: 64, align: 64, offset: 1408)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DISubroutineType(types: !1648)
!1648 = !{!926, !1041, !994, !1330, !1184}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !949, file: !14, line: 3567, baseType: !1038, size: 64, align: 64, offset: 1472)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !949, file: !14, line: 3576, baseType: !1651, size: 64, align: 64, offset: 1536)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DISubroutineType(types: !1653)
!1653 = !{!926, !1041, !1328}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !949, file: !14, line: 3577, baseType: !1655, size: 64, align: 64, offset: 1600)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DISubroutineType(types: !1657)
!1657 = !{!926, !1041, !1184}
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !949, file: !14, line: 3584, baseType: !1474, size: 64, align: 64, offset: 1664)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !949, file: !14, line: 3589, baseType: !1660, size: 64, align: 64, offset: 1728)
!1660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1661, size: 64, align: 64)
!1661 = !DISubroutineType(types: !1662)
!1662 = !{null, !1041}
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !949, file: !14, line: 3594, baseType: !926, size: 32, align: 32, offset: 1792)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !949, file: !14, line: 3600, baseType: !952, size: 64, align: 64, offset: 1856)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !949, file: !14, line: 3609, baseType: !1666, size: 64, align: 64, offset: 1920)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1669)
!1669 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1670 = distinct !DIGlobalVariable(name: "table", scope: !1671, file: !888, line: 1313, type: !1673, isLocal: true, isDefinition: true, variable: [2048 x [2 x i16]]* @decode_init.table)
!1671 = distinct !DISubprogram(name: "decode_init", scope: !888, file: !888, line: 1310, type: !1039, isLocal: true, isDefinition: true, scopeLine: 1311, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1672)
!1672 = !{}
!1673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 65536, align: 16, elements: !1674)
!1674 = !{!1675, !1676}
!1675 = !DISubrange(count: 2048)
!1676 = !DISubrange(count: 2)
!1677 = distinct !DIGlobalVariable(name: "binkb_initialised", scope: !1671, file: !888, line: 1314, type: !926, isLocal: true, isDefinition: true, variable: i32* @decode_init.binkb_initialised)
!1678 = distinct !DIGlobalVariable(name: "bink_trees", scope: !0, file: !888, line: 40, type: !1679, isLocal: true, isDefinition: true, variable: [16 x %struct.VLC]* @bink_trees)
!1679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1680, size: 3072, align: 64, elements: !1691)
!1680 = !DIDerivedType(tag: DW_TAG_typedef, name: "VLC", file: !1681, line: 30, baseType: !1682)
!1681 = !DIFile(filename: "libavcodec/vlc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VLC", file: !1681, line: 26, size: 192, align: 64, elements: !1683)
!1683 = !{!1684, !1685, !1689, !1690}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1682, file: !1681, line: 27, baseType: !926, size: 32, align: 32)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !1682, file: !1681, line: 28, baseType: !1686, size: 64, align: 64, offset: 64)
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64, align: 64)
!1687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 32, align: 16, elements: !1688)
