; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--rasc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--rasc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!871 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!872 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!873 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!874 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !14, line: 1534, size: 32, align: 32, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881}
!876 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!877 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!878 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!879 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!880 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!881 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!882 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893}
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!887 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!888 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!889 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902}
!896 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!897 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!898 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!899 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!900 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!901 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!902 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !{!910, !911, !912, !913, !921, !922, !929, !930, !934}
!910 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!911 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64, align: 64)
!914 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !916, line: 221, size: 32, align: 8, elements: !917)
!916 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!917 = !{!918}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !915, file: !916, line: 221, baseType: !919, size: 32, align: 32)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !920, line: 51, baseType: !911)
!920 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !916, line: 222, size: 16, align: 8, elements: !925)
!925 = !{!926}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !924, file: !916, line: 222, baseType: !927, size: 16, align: 16)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !920, line: 49, baseType: !928)
!928 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !920, line: 48, baseType: !933)
!933 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!935 = !{!936, !1693, !1694}
!936 = distinct !DIGlobalVariable(name: "ff_rasc_decoder", scope: !0, file: !937, line: 803, type: !938, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_rasc_decoder)
!937 = !DIFile(filename: "libavcodec/rasc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !940)
!940 = !{!941, !945, !946, !947, !948, !949, !958, !961, !964, !967, !972, !973, !1049, !1057, !1058, !1059, !1061, !1608, !1614, !1622, !1626, !1627, !1664, !1668, !1672, !1673, !1677, !1681, !1682, !1686, !1687, !1688}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !939, file: !14, line: 3475, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !939, file: !14, line: 3480, baseType: !942, size: 64, align: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !939, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !939, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !939, file: !14, line: 3487, baseType: !910, size: 32, align: 32, offset: 192)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !939, file: !14, line: 3488, baseType: !950, size: 64, align: 64, offset: 256)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !953, line: 61, baseType: !954)
!953 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !953, line: 58, size: 64, align: 32, elements: !955)
!955 = !{!956, !957}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !954, file: !953, line: 59, baseType: !910, size: 32, align: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !954, file: !953, line: 60, baseType: !910, size: 32, align: 32, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !939, file: !14, line: 3489, baseType: !959, size: 64, align: 64, offset: 320)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !939, file: !14, line: 3490, baseType: !962, size: 64, align: 64, offset: 384)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !939, file: !14, line: 3491, baseType: !965, size: 64, align: 64, offset: 448)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !939, file: !14, line: 3492, baseType: !968, size: 64, align: 64, offset: 512)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !920, line: 55, baseType: !971)
!971 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !939, file: !14, line: 3493, baseType: !932, size: 8, align: 8, offset: 576)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !939, file: !14, line: 3494, baseType: !974, size: 64, align: 64, offset: 640)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !978)
!978 = !{!979, !980, !984, !1008, !1009, !1010, !1011, !1015, !1021, !1023, !1027}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !977, file: !713, line: 72, baseType: !942, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !977, file: !713, line: 78, baseType: !981, size: 64, align: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!942, !912}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !977, file: !713, line: 85, baseType: !985, size: 64, align: 64, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !988)
!988 = !{!989, !990, !991, !992, !993, !1004, !1005, !1006, !1007}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !987, file: !691, line: 247, baseType: !942, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !987, file: !691, line: 253, baseType: !942, size: 64, align: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !987, file: !691, line: 259, baseType: !910, size: 32, align: 32, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !987, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !987, file: !691, line: 271, baseType: !994, size: 64, align: 64, offset: 192)
!994 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !987, file: !691, line: 265, size: 64, align: 64, elements: !995)
!995 = !{!996, !1000, !1002, !1003}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !994, file: !691, line: 266, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !998, line: 197, baseType: !999)
!998 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!999 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !994, file: !691, line: 267, baseType: !1001, size: 64, align: 64)
!1001 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !994, file: !691, line: 268, baseType: !942, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !994, file: !691, line: 270, baseType: !952, size: 64, align: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !987, file: !691, line: 272, baseType: !1001, size: 64, align: 64, offset: 256)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !987, file: !691, line: 273, baseType: !1001, size: 64, align: 64, offset: 320)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !987, file: !691, line: 275, baseType: !910, size: 32, align: 32, offset: 384)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !987, file: !691, line: 300, baseType: !942, size: 64, align: 64, offset: 448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !977, file: !713, line: 93, baseType: !910, size: 32, align: 32, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !977, file: !713, line: 99, baseType: !910, size: 32, align: 32, offset: 224)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !977, file: !713, line: 108, baseType: !910, size: 32, align: 32, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !977, file: !713, line: 113, baseType: !1012, size: 64, align: 64, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!912, !912, !912}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !977, file: !713, line: 123, baseType: !1016, size: 64, align: 64, offset: 384)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!1019, !1019}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !977, file: !713, line: 130, baseType: !1022, size: 32, align: 32, offset: 448)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !977, file: !713, line: 136, baseType: !1024, size: 64, align: 64, offset: 512)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!1022, !912}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !977, file: !713, line: 142, baseType: !1028, size: 64, align: 64, offset: 576)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!910, !1031, !912, !942, !910}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1034)
!1034 = !{!1035, !1047, !1048}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1033, file: !691, line: 360, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1040)
!1040 = !{!1041, !1042, !1043, !1044, !1045, !1046}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1039, file: !691, line: 307, baseType: !942, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1039, file: !691, line: 313, baseType: !1001, size: 64, align: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1039, file: !691, line: 313, baseType: !1001, size: 64, align: 64, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1039, file: !691, line: 318, baseType: !1001, size: 64, align: 64, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1039, file: !691, line: 318, baseType: !1001, size: 64, align: 64, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1039, file: !691, line: 323, baseType: !910, size: 32, align: 32, offset: 320)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1033, file: !691, line: 364, baseType: !910, size: 32, align: 32, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1033, file: !691, line: 368, baseType: !910, size: 32, align: 32, offset: 96)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !939, file: !14, line: 3495, baseType: !1050, size: 64, align: 64, offset: 704)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1054)
!1054 = !{!1055, !1056}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1053, file: !14, line: 3402, baseType: !910, size: 32, align: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1053, file: !14, line: 3403, baseType: !942, size: 64, align: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !939, file: !14, line: 3507, baseType: !942, size: 64, align: 64, offset: 768)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !939, file: !14, line: 3516, baseType: !910, size: 32, align: 32, offset: 832)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !939, file: !14, line: 3517, baseType: !1060, size: 64, align: 64, offset: 896)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !939, file: !14, line: 3527, baseType: !1062, size: 64, align: 64, offset: 960)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!910, !1065}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1067)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1068)
!1068 = !{!1069, !1070, !1071, !1072, !1075, !1076, !1077, !1078, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1358, !1362, !1363, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1546, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1067, file: !14, line: 1561, baseType: !974, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1067, file: !14, line: 1562, baseType: !910, size: 32, align: 32, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1067, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1067, file: !14, line: 1565, baseType: !1073, size: 64, align: 64, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1067, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1067, file: !14, line: 1581, baseType: !911, size: 32, align: 32, offset: 224)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1067, file: !14, line: 1583, baseType: !912, size: 64, align: 64, offset: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1067, file: !14, line: 1591, baseType: !1079, size: 64, align: 64, offset: 320)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1081, line: 129, size: 1664, align: 64, elements: !1082)
!1081 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1082 = !{!1083, !1084, !1085, !1086, !1184, !1205, !1206, !1235, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1080, file: !1081, line: 136, baseType: !910, size: 32, align: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1080, file: !1081, line: 151, baseType: !910, size: 32, align: 32, offset: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1080, file: !1081, line: 157, baseType: !910, size: 32, align: 32, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1080, file: !1081, line: 159, baseType: !1087, size: 64, align: 64, offset: 128)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1090)
!1090 = !{!1091, !1096, !1098, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1136, !1138, !1139, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1172, !1173, !1174, !1175, !1176, !1177, !1180, !1181, !1182, !1183}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1089, file: !744, line: 282, baseType: !1092, size: 512, align: 64)
!1092 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1093, size: 512, align: 64, elements: !1094)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!1094 = !{!1095}
!1095 = !DISubrange(count: 8)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1089, file: !744, line: 299, baseType: !1097, size: 256, align: 32, offset: 512)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 256, align: 32, elements: !1094)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1089, file: !744, line: 315, baseType: !1099, size: 64, align: 64, offset: 768)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1089, file: !744, line: 326, baseType: !910, size: 32, align: 32, offset: 832)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1089, file: !744, line: 326, baseType: !910, size: 32, align: 32, offset: 864)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1089, file: !744, line: 334, baseType: !910, size: 32, align: 32, offset: 896)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1089, file: !744, line: 341, baseType: !910, size: 32, align: 32, offset: 928)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1089, file: !744, line: 346, baseType: !910, size: 32, align: 32, offset: 960)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1089, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1089, file: !744, line: 356, baseType: !952, size: 64, align: 32, offset: 1024)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1089, file: !744, line: 361, baseType: !997, size: 64, align: 64, offset: 1088)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1089, file: !744, line: 369, baseType: !997, size: 64, align: 64, offset: 1152)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1089, file: !744, line: 377, baseType: !997, size: 64, align: 64, offset: 1216)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1089, file: !744, line: 382, baseType: !910, size: 32, align: 32, offset: 1280)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1089, file: !744, line: 386, baseType: !910, size: 32, align: 32, offset: 1312)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1089, file: !744, line: 391, baseType: !910, size: 32, align: 32, offset: 1344)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1089, file: !744, line: 396, baseType: !912, size: 64, align: 64, offset: 1408)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1089, file: !744, line: 403, baseType: !1115, size: 512, align: 64, offset: 1472)
!1115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !970, size: 512, align: 64, elements: !1094)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1089, file: !744, line: 410, baseType: !910, size: 32, align: 32, offset: 1984)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1089, file: !744, line: 415, baseType: !910, size: 32, align: 32, offset: 2016)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1089, file: !744, line: 420, baseType: !910, size: 32, align: 32, offset: 2048)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1089, file: !744, line: 425, baseType: !910, size: 32, align: 32, offset: 2080)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1089, file: !744, line: 435, baseType: !997, size: 64, align: 64, offset: 2112)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1089, file: !744, line: 440, baseType: !910, size: 32, align: 32, offset: 2176)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1089, file: !744, line: 445, baseType: !970, size: 64, align: 64, offset: 2240)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1089, file: !744, line: 459, baseType: !1124, size: 512, align: 64, offset: 2304)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1125, size: 512, align: 64, elements: !1094)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1127, line: 94, baseType: !1128)
!1127 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1127, line: 81, size: 192, align: 64, elements: !1129)
!1129 = !{!1130, !1134, !1135}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1128, file: !1127, line: 82, baseType: !1131, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1127, line: 73, baseType: !1133)
!1133 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1127, line: 73, flags: DIFlagFwdDecl)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1128, file: !1127, line: 89, baseType: !1093, size: 64, align: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1128, file: !1127, line: 93, baseType: !910, size: 32, align: 32, offset: 128)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1089, file: !744, line: 473, baseType: !1137, size: 64, align: 64, offset: 2816)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1089, file: !744, line: 477, baseType: !910, size: 32, align: 32, offset: 2880)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1089, file: !744, line: 479, baseType: !1140, size: 64, align: 64, offset: 2944)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1143)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1144)
!1144 = !{!1145, !1146, !1147, !1148, !1153}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1143, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1143, file: !744, line: 203, baseType: !1093, size: 64, align: 64, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1143, file: !744, line: 204, baseType: !910, size: 32, align: 32, offset: 128)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1143, file: !744, line: 205, baseType: !1149, size: 64, align: 64, offset: 192)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1151, line: 86, baseType: !1152)
!1151 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1152 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1151, line: 86, flags: DIFlagFwdDecl)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1143, file: !744, line: 206, baseType: !1125, size: 64, align: 64, offset: 256)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1089, file: !744, line: 480, baseType: !910, size: 32, align: 32, offset: 3008)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1089, file: !744, line: 505, baseType: !910, size: 32, align: 32, offset: 3040)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1089, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1089, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1089, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1089, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1089, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1089, file: !744, line: 532, baseType: !997, size: 64, align: 64, offset: 3264)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1089, file: !744, line: 539, baseType: !997, size: 64, align: 64, offset: 3328)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1089, file: !744, line: 547, baseType: !997, size: 64, align: 64, offset: 3392)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1089, file: !744, line: 554, baseType: !1149, size: 64, align: 64, offset: 3456)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1089, file: !744, line: 563, baseType: !910, size: 32, align: 32, offset: 3520)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1089, file: !744, line: 572, baseType: !910, size: 32, align: 32, offset: 3552)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1089, file: !744, line: 581, baseType: !910, size: 32, align: 32, offset: 3584)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1089, file: !744, line: 588, baseType: !1169, size: 64, align: 64, offset: 3648)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !998, line: 194, baseType: !1171)
!1171 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1089, file: !744, line: 593, baseType: !910, size: 32, align: 32, offset: 3712)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1089, file: !744, line: 596, baseType: !910, size: 32, align: 32, offset: 3744)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1089, file: !744, line: 599, baseType: !1125, size: 64, align: 64, offset: 3776)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1089, file: !744, line: 605, baseType: !1125, size: 64, align: 64, offset: 3840)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1089, file: !744, line: 616, baseType: !1125, size: 64, align: 64, offset: 3904)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1089, file: !744, line: 626, baseType: !1178, size: 64, align: 64, offset: 3968)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1179, line: 216, baseType: !971)
!1179 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1089, file: !744, line: 627, baseType: !1178, size: 64, align: 64, offset: 4032)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1089, file: !744, line: 628, baseType: !1178, size: 64, align: 64, offset: 4096)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1089, file: !744, line: 629, baseType: !1178, size: 64, align: 64, offset: 4160)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1089, file: !744, line: 645, baseType: !1125, size: 64, align: 64, offset: 4224)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1080, file: !1081, line: 161, baseType: !1185, size: 64, align: 64, offset: 192)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1081, line: 117, baseType: !1187)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1081, line: 100, size: 832, align: 64, elements: !1188)
!1188 = !{!1189, !1196, !1197, !1198, !1199, !1200, !1202, !1203, !1204}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1187, file: !1081, line: 105, baseType: !1190, size: 256, align: 64)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1191, size: 256, align: 64, elements: !1194)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1127, line: 238, baseType: !1193)
!1193 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1127, line: 238, flags: DIFlagFwdDecl)
!1194 = !{!1195}
!1195 = !DISubrange(count: 4)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1187, file: !1081, line: 110, baseType: !910, size: 32, align: 32, offset: 256)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1187, file: !1081, line: 111, baseType: !910, size: 32, align: 32, offset: 288)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1187, file: !1081, line: 111, baseType: !910, size: 32, align: 32, offset: 320)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1187, file: !1081, line: 112, baseType: !1097, size: 256, align: 32, offset: 352)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1187, file: !1081, line: 113, baseType: !1201, size: 128, align: 32, offset: 608)
!1201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 128, align: 32, elements: !1194)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1187, file: !1081, line: 114, baseType: !910, size: 32, align: 32, offset: 736)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1187, file: !1081, line: 115, baseType: !910, size: 32, align: 32, offset: 768)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1187, file: !1081, line: 116, baseType: !910, size: 32, align: 32, offset: 800)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1080, file: !1081, line: 163, baseType: !912, size: 64, align: 64, offset: 256)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1080, file: !1081, line: 165, baseType: !1207, size: 128, align: 64, offset: 320)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1081, line: 122, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1081, line: 119, size: 128, align: 64, elements: !1209)
!1209 = !{!1210, !1234}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1208, file: !1081, line: 120, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1214)
!1214 = !{!1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1230, !1231, !1232, !1233}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1213, file: !14, line: 1451, baseType: !1125, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1213, file: !14, line: 1461, baseType: !997, size: 64, align: 64, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1213, file: !14, line: 1467, baseType: !997, size: 64, align: 64, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1213, file: !14, line: 1468, baseType: !1093, size: 64, align: 64, offset: 192)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1213, file: !14, line: 1469, baseType: !910, size: 32, align: 32, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1213, file: !14, line: 1470, baseType: !910, size: 32, align: 32, offset: 288)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1213, file: !14, line: 1474, baseType: !910, size: 32, align: 32, offset: 320)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1213, file: !14, line: 1479, baseType: !1223, size: 64, align: 64, offset: 384)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1225)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1226)
!1226 = !{!1227, !1228, !1229}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1225, file: !14, line: 1412, baseType: !1093, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1225, file: !14, line: 1413, baseType: !910, size: 32, align: 32, offset: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1225, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1213, file: !14, line: 1480, baseType: !910, size: 32, align: 32, offset: 448)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1213, file: !14, line: 1486, baseType: !997, size: 64, align: 64, offset: 512)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1213, file: !14, line: 1488, baseType: !997, size: 64, align: 64, offset: 576)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1213, file: !14, line: 1497, baseType: !997, size: 64, align: 64, offset: 640)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1208, file: !1081, line: 121, baseType: !1087, size: 64, align: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1080, file: !1081, line: 166, baseType: !1236, size: 128, align: 64, offset: 448)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1081, line: 127, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1081, line: 124, size: 128, align: 64, elements: !1238)
!1238 = !{!1239, !1312}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1237, file: !1081, line: 125, baseType: !1240, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1243)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1244)
!1244 = !{!1245, !1246, !1270, !1274, !1275, !1309, !1310, !1311}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1243, file: !14, line: 5751, baseType: !974, size: 64, align: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1243, file: !14, line: 5756, baseType: !1247, size: 64, align: 64, offset: 64)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1249)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1250)
!1250 = !{!1251, !1252, !1255, !1256, !1257, !1261, !1265, !1269}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1249, file: !14, line: 5797, baseType: !942, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1249, file: !14, line: 5804, baseType: !1253, size: 64, align: 64, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1249, file: !14, line: 5815, baseType: !974, size: 64, align: 64, offset: 128)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1249, file: !14, line: 5825, baseType: !910, size: 32, align: 32, offset: 192)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1249, file: !14, line: 5826, baseType: !1258, size: 64, align: 64, offset: 256)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!910, !1241}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1249, file: !14, line: 5827, baseType: !1262, size: 64, align: 64, offset: 320)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!910, !1241, !1211}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1249, file: !14, line: 5828, baseType: !1266, size: 64, align: 64, offset: 384)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{null, !1241}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1249, file: !14, line: 5829, baseType: !1266, size: 64, align: 64, offset: 448)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1243, file: !14, line: 5762, baseType: !1271, size: 64, align: 64, offset: 128)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1273)
!1273 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1243, file: !14, line: 5768, baseType: !912, size: 64, align: 64, offset: 192)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1243, file: !14, line: 5775, baseType: !1276, size: 64, align: 64, offset: 256)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1278)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1279)
!1279 = !{!1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1278, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1278, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1278, file: !14, line: 3948, baseType: !919, size: 32, align: 32, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1278, file: !14, line: 3958, baseType: !1093, size: 64, align: 64, offset: 128)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1278, file: !14, line: 3962, baseType: !910, size: 32, align: 32, offset: 192)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1278, file: !14, line: 3968, baseType: !910, size: 32, align: 32, offset: 224)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1278, file: !14, line: 3973, baseType: !997, size: 64, align: 64, offset: 256)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1278, file: !14, line: 3986, baseType: !910, size: 32, align: 32, offset: 320)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1278, file: !14, line: 3999, baseType: !910, size: 32, align: 32, offset: 352)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1278, file: !14, line: 4004, baseType: !910, size: 32, align: 32, offset: 384)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1278, file: !14, line: 4005, baseType: !910, size: 32, align: 32, offset: 416)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1278, file: !14, line: 4010, baseType: !910, size: 32, align: 32, offset: 448)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1278, file: !14, line: 4011, baseType: !910, size: 32, align: 32, offset: 480)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1278, file: !14, line: 4020, baseType: !952, size: 64, align: 32, offset: 512)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1278, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1278, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1278, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1278, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1278, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1278, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1278, file: !14, line: 4039, baseType: !910, size: 32, align: 32, offset: 768)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1278, file: !14, line: 4046, baseType: !970, size: 64, align: 64, offset: 832)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1278, file: !14, line: 4050, baseType: !910, size: 32, align: 32, offset: 896)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1278, file: !14, line: 4054, baseType: !910, size: 32, align: 32, offset: 928)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1278, file: !14, line: 4061, baseType: !910, size: 32, align: 32, offset: 960)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1278, file: !14, line: 4065, baseType: !910, size: 32, align: 32, offset: 992)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1278, file: !14, line: 4073, baseType: !910, size: 32, align: 32, offset: 1024)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1278, file: !14, line: 4080, baseType: !910, size: 32, align: 32, offset: 1056)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1278, file: !14, line: 4084, baseType: !910, size: 32, align: 32, offset: 1088)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1243, file: !14, line: 5781, baseType: !1276, size: 64, align: 64, offset: 320)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1243, file: !14, line: 5787, baseType: !952, size: 64, align: 32, offset: 384)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1243, file: !14, line: 5793, baseType: !952, size: 64, align: 32, offset: 448)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1237, file: !1081, line: 126, baseType: !910, size: 32, align: 32, offset: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1080, file: !1081, line: 172, baseType: !1211, size: 64, align: 64, offset: 576)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1080, file: !1081, line: 177, baseType: !1093, size: 64, align: 64, offset: 640)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1080, file: !1081, line: 178, baseType: !911, size: 32, align: 32, offset: 704)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1080, file: !1081, line: 180, baseType: !912, size: 64, align: 64, offset: 768)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1080, file: !1081, line: 185, baseType: !910, size: 32, align: 32, offset: 832)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1080, file: !1081, line: 190, baseType: !912, size: 64, align: 64, offset: 896)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1080, file: !1081, line: 195, baseType: !910, size: 32, align: 32, offset: 960)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1080, file: !1081, line: 200, baseType: !1211, size: 64, align: 64, offset: 1024)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1080, file: !1081, line: 201, baseType: !910, size: 32, align: 32, offset: 1088)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1080, file: !1081, line: 202, baseType: !1087, size: 64, align: 64, offset: 1152)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1080, file: !1081, line: 203, baseType: !910, size: 32, align: 32, offset: 1216)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1080, file: !1081, line: 205, baseType: !910, size: 32, align: 32, offset: 1248)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1080, file: !1081, line: 206, baseType: !910, size: 32, align: 32, offset: 1280)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1080, file: !1081, line: 209, baseType: !1178, size: 64, align: 64, offset: 1344)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1080, file: !1081, line: 212, baseType: !1178, size: 64, align: 64, offset: 1408)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1080, file: !1081, line: 213, baseType: !1087, size: 64, align: 64, offset: 1472)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1080, file: !1081, line: 215, baseType: !910, size: 32, align: 32, offset: 1536)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1080, file: !1081, line: 217, baseType: !910, size: 32, align: 32, offset: 1568)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1080, file: !1081, line: 220, baseType: !910, size: 32, align: 32, offset: 1600)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1067, file: !14, line: 1598, baseType: !912, size: 64, align: 64, offset: 384)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1067, file: !14, line: 1606, baseType: !997, size: 64, align: 64, offset: 448)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1067, file: !14, line: 1614, baseType: !910, size: 32, align: 32, offset: 512)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1067, file: !14, line: 1622, baseType: !910, size: 32, align: 32, offset: 544)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1067, file: !14, line: 1628, baseType: !910, size: 32, align: 32, offset: 576)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1067, file: !14, line: 1636, baseType: !910, size: 32, align: 32, offset: 608)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1067, file: !14, line: 1643, baseType: !910, size: 32, align: 32, offset: 640)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1067, file: !14, line: 1657, baseType: !1093, size: 64, align: 64, offset: 704)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1067, file: !14, line: 1658, baseType: !910, size: 32, align: 32, offset: 768)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1067, file: !14, line: 1679, baseType: !952, size: 64, align: 32, offset: 800)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1067, file: !14, line: 1688, baseType: !910, size: 32, align: 32, offset: 864)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1067, file: !14, line: 1712, baseType: !910, size: 32, align: 32, offset: 896)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1067, file: !14, line: 1729, baseType: !910, size: 32, align: 32, offset: 928)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1067, file: !14, line: 1729, baseType: !910, size: 32, align: 32, offset: 960)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1067, file: !14, line: 1744, baseType: !910, size: 32, align: 32, offset: 992)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1067, file: !14, line: 1744, baseType: !910, size: 32, align: 32, offset: 1024)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1067, file: !14, line: 1751, baseType: !910, size: 32, align: 32, offset: 1056)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1067, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1067, file: !14, line: 1791, baseType: !1351, size: 64, align: 64, offset: 1152)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{null, !1354, !1355, !1357, !910, !910, !910}
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1088)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1067, file: !14, line: 1808, baseType: !1359, size: 64, align: 64, offset: 1216)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DISubroutineType(types: !1361)
!1361 = !{!473, !1354, !959}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1067, file: !14, line: 1816, baseType: !910, size: 32, align: 32, offset: 1280)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1067, file: !14, line: 1825, baseType: !1364, size: 32, align: 32, offset: 1312)
!1364 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1067, file: !14, line: 1830, baseType: !910, size: 32, align: 32, offset: 1344)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1067, file: !14, line: 1838, baseType: !1364, size: 32, align: 32, offset: 1376)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1067, file: !14, line: 1846, baseType: !910, size: 32, align: 32, offset: 1408)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1067, file: !14, line: 1851, baseType: !910, size: 32, align: 32, offset: 1440)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1067, file: !14, line: 1861, baseType: !1364, size: 32, align: 32, offset: 1472)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1067, file: !14, line: 1868, baseType: !1364, size: 32, align: 32, offset: 1504)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1067, file: !14, line: 1875, baseType: !1364, size: 32, align: 32, offset: 1536)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1067, file: !14, line: 1882, baseType: !1364, size: 32, align: 32, offset: 1568)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1067, file: !14, line: 1889, baseType: !1364, size: 32, align: 32, offset: 1600)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1067, file: !14, line: 1896, baseType: !1364, size: 32, align: 32, offset: 1632)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1067, file: !14, line: 1903, baseType: !1364, size: 32, align: 32, offset: 1664)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1067, file: !14, line: 1910, baseType: !910, size: 32, align: 32, offset: 1696)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1067, file: !14, line: 1915, baseType: !910, size: 32, align: 32, offset: 1728)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1067, file: !14, line: 1926, baseType: !1357, size: 64, align: 64, offset: 1792)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1067, file: !14, line: 1935, baseType: !952, size: 64, align: 32, offset: 1856)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1067, file: !14, line: 1942, baseType: !910, size: 32, align: 32, offset: 1920)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1067, file: !14, line: 1948, baseType: !910, size: 32, align: 32, offset: 1952)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1067, file: !14, line: 1954, baseType: !910, size: 32, align: 32, offset: 1984)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1067, file: !14, line: 1960, baseType: !910, size: 32, align: 32, offset: 2016)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1067, file: !14, line: 1984, baseType: !910, size: 32, align: 32, offset: 2048)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1067, file: !14, line: 1991, baseType: !910, size: 32, align: 32, offset: 2080)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1067, file: !14, line: 1996, baseType: !910, size: 32, align: 32, offset: 2112)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1067, file: !14, line: 2004, baseType: !910, size: 32, align: 32, offset: 2144)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1067, file: !14, line: 2011, baseType: !910, size: 32, align: 32, offset: 2176)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1067, file: !14, line: 2018, baseType: !910, size: 32, align: 32, offset: 2208)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1067, file: !14, line: 2027, baseType: !910, size: 32, align: 32, offset: 2240)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1067, file: !14, line: 2034, baseType: !910, size: 32, align: 32, offset: 2272)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1067, file: !14, line: 2044, baseType: !910, size: 32, align: 32, offset: 2304)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1067, file: !14, line: 2054, baseType: !1394, size: 64, align: 64, offset: 2368)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1067, file: !14, line: 2061, baseType: !1394, size: 64, align: 64, offset: 2432)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1067, file: !14, line: 2066, baseType: !910, size: 32, align: 32, offset: 2496)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1067, file: !14, line: 2070, baseType: !910, size: 32, align: 32, offset: 2528)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1067, file: !14, line: 2078, baseType: !910, size: 32, align: 32, offset: 2560)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1067, file: !14, line: 2085, baseType: !910, size: 32, align: 32, offset: 2592)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1067, file: !14, line: 2092, baseType: !910, size: 32, align: 32, offset: 2624)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1067, file: !14, line: 2099, baseType: !910, size: 32, align: 32, offset: 2656)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1067, file: !14, line: 2106, baseType: !910, size: 32, align: 32, offset: 2688)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1067, file: !14, line: 2113, baseType: !910, size: 32, align: 32, offset: 2720)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1067, file: !14, line: 2120, baseType: !910, size: 32, align: 32, offset: 2752)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1067, file: !14, line: 2125, baseType: !910, size: 32, align: 32, offset: 2784)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1067, file: !14, line: 2133, baseType: !910, size: 32, align: 32, offset: 2816)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1067, file: !14, line: 2140, baseType: !910, size: 32, align: 32, offset: 2848)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1067, file: !14, line: 2145, baseType: !910, size: 32, align: 32, offset: 2880)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1067, file: !14, line: 2153, baseType: !910, size: 32, align: 32, offset: 2912)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1067, file: !14, line: 2158, baseType: !910, size: 32, align: 32, offset: 2944)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1067, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1067, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1067, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1067, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1067, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1067, file: !14, line: 2203, baseType: !910, size: 32, align: 32, offset: 3136)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1067, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1067, file: !14, line: 2212, baseType: !910, size: 32, align: 32, offset: 3200)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1067, file: !14, line: 2213, baseType: !910, size: 32, align: 32, offset: 3232)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1067, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1067, file: !14, line: 2232, baseType: !910, size: 32, align: 32, offset: 3296)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1067, file: !14, line: 2243, baseType: !910, size: 32, align: 32, offset: 3328)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1067, file: !14, line: 2249, baseType: !910, size: 32, align: 32, offset: 3360)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1067, file: !14, line: 2256, baseType: !910, size: 32, align: 32, offset: 3392)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1067, file: !14, line: 2263, baseType: !970, size: 64, align: 64, offset: 3456)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1067, file: !14, line: 2270, baseType: !970, size: 64, align: 64, offset: 3520)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1067, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1067, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1067, file: !14, line: 2367, baseType: !1430, size: 64, align: 64, offset: 3648)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DISubroutineType(types: !1432)
!1432 = !{!910, !1354, !1087, !910}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1067, file: !14, line: 2383, baseType: !910, size: 32, align: 32, offset: 3712)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1067, file: !14, line: 2386, baseType: !1364, size: 32, align: 32, offset: 3744)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1067, file: !14, line: 2387, baseType: !1364, size: 32, align: 32, offset: 3776)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1067, file: !14, line: 2394, baseType: !910, size: 32, align: 32, offset: 3808)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1067, file: !14, line: 2401, baseType: !910, size: 32, align: 32, offset: 3840)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1067, file: !14, line: 2408, baseType: !910, size: 32, align: 32, offset: 3872)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1067, file: !14, line: 2415, baseType: !910, size: 32, align: 32, offset: 3904)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1067, file: !14, line: 2422, baseType: !910, size: 32, align: 32, offset: 3936)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1067, file: !14, line: 2423, baseType: !1442, size: 64, align: 64, offset: 3968)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1444)
!1444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1445)
!1445 = !{!1446, !1447, !1448, !1449}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1444, file: !14, line: 827, baseType: !910, size: 32, align: 32)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1444, file: !14, line: 828, baseType: !910, size: 32, align: 32, offset: 32)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1444, file: !14, line: 829, baseType: !910, size: 32, align: 32, offset: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1444, file: !14, line: 830, baseType: !1364, size: 32, align: 32, offset: 96)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1067, file: !14, line: 2430, baseType: !997, size: 64, align: 64, offset: 4032)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1067, file: !14, line: 2437, baseType: !997, size: 64, align: 64, offset: 4096)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1067, file: !14, line: 2444, baseType: !1364, size: 32, align: 32, offset: 4160)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1067, file: !14, line: 2451, baseType: !1364, size: 32, align: 32, offset: 4192)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1067, file: !14, line: 2458, baseType: !910, size: 32, align: 32, offset: 4224)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1067, file: !14, line: 2469, baseType: !910, size: 32, align: 32, offset: 4256)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1067, file: !14, line: 2475, baseType: !910, size: 32, align: 32, offset: 4288)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1067, file: !14, line: 2481, baseType: !910, size: 32, align: 32, offset: 4320)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1067, file: !14, line: 2485, baseType: !910, size: 32, align: 32, offset: 4352)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1067, file: !14, line: 2489, baseType: !910, size: 32, align: 32, offset: 4384)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1067, file: !14, line: 2493, baseType: !910, size: 32, align: 32, offset: 4416)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1067, file: !14, line: 2501, baseType: !910, size: 32, align: 32, offset: 4448)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1067, file: !14, line: 2506, baseType: !910, size: 32, align: 32, offset: 4480)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1067, file: !14, line: 2510, baseType: !910, size: 32, align: 32, offset: 4512)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1067, file: !14, line: 2514, baseType: !997, size: 64, align: 64, offset: 4544)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1067, file: !14, line: 2528, baseType: !1466, size: 64, align: 64, offset: 4608)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DISubroutineType(types: !1468)
!1468 = !{null, !1354, !912, !910, !910}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1067, file: !14, line: 2534, baseType: !910, size: 32, align: 32, offset: 4672)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1067, file: !14, line: 2545, baseType: !910, size: 32, align: 32, offset: 4704)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1067, file: !14, line: 2547, baseType: !910, size: 32, align: 32, offset: 4736)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1067, file: !14, line: 2549, baseType: !910, size: 32, align: 32, offset: 4768)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1067, file: !14, line: 2551, baseType: !910, size: 32, align: 32, offset: 4800)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1067, file: !14, line: 2553, baseType: !910, size: 32, align: 32, offset: 4832)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1067, file: !14, line: 2555, baseType: !910, size: 32, align: 32, offset: 4864)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1067, file: !14, line: 2557, baseType: !910, size: 32, align: 32, offset: 4896)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1067, file: !14, line: 2559, baseType: !910, size: 32, align: 32, offset: 4928)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1067, file: !14, line: 2563, baseType: !910, size: 32, align: 32, offset: 4960)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1067, file: !14, line: 2571, baseType: !1480, size: 64, align: 64, offset: 4992)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1067, file: !14, line: 2579, baseType: !1480, size: 64, align: 64, offset: 5056)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1067, file: !14, line: 2586, baseType: !910, size: 32, align: 32, offset: 5120)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1067, file: !14, line: 2615, baseType: !910, size: 32, align: 32, offset: 5152)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1067, file: !14, line: 2627, baseType: !910, size: 32, align: 32, offset: 5184)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1067, file: !14, line: 2637, baseType: !910, size: 32, align: 32, offset: 5216)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1067, file: !14, line: 2681, baseType: !910, size: 32, align: 32, offset: 5248)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1067, file: !14, line: 2709, baseType: !997, size: 64, align: 64, offset: 5312)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1067, file: !14, line: 2716, baseType: !1489, size: 64, align: 64, offset: 5376)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1491)
!1491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1492)
!1492 = !{!1493, !1494, !1495, !1496, !1497, !1498, !1502, !1506, !1510, !1511, !1512, !1513, !1519, !1520, !1521, !1522, !1523}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1491, file: !14, line: 3642, baseType: !942, size: 64, align: 64)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1491, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1491, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1491, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1491, file: !14, line: 3669, baseType: !910, size: 32, align: 32, offset: 160)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1491, file: !14, line: 3682, baseType: !1499, size: 64, align: 64, offset: 192)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DISubroutineType(types: !1501)
!1501 = !{!910, !1065, !1087}
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1491, file: !14, line: 3698, baseType: !1503, size: 64, align: 64, offset: 256)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DISubroutineType(types: !1505)
!1505 = !{!910, !1065, !930, !919}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1491, file: !14, line: 3712, baseType: !1507, size: 64, align: 64, offset: 320)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DISubroutineType(types: !1509)
!1509 = !{!910, !1065, !910, !930, !919}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1491, file: !14, line: 3726, baseType: !1503, size: 64, align: 64, offset: 384)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1491, file: !14, line: 3737, baseType: !1062, size: 64, align: 64, offset: 448)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1491, file: !14, line: 3746, baseType: !910, size: 32, align: 32, offset: 512)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1491, file: !14, line: 3757, baseType: !1514, size: 64, align: 64, offset: 576)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DISubroutineType(types: !1516)
!1516 = !{null, !1517}
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64, align: 64)
!1518 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1491, file: !14, line: 3766, baseType: !1062, size: 64, align: 64, offset: 640)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1491, file: !14, line: 3774, baseType: !1062, size: 64, align: 64, offset: 704)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1491, file: !14, line: 3780, baseType: !910, size: 32, align: 32, offset: 768)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1491, file: !14, line: 3785, baseType: !910, size: 32, align: 32, offset: 800)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1491, file: !14, line: 3795, baseType: !1524, size: 64, align: 64, offset: 832)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DISubroutineType(types: !1526)
!1526 = !{!910, !1065, !1125}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1067, file: !14, line: 2728, baseType: !912, size: 64, align: 64, offset: 5440)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1067, file: !14, line: 2735, baseType: !1115, size: 512, align: 64, offset: 5504)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1067, file: !14, line: 2742, baseType: !910, size: 32, align: 32, offset: 6016)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1067, file: !14, line: 2755, baseType: !910, size: 32, align: 32, offset: 6048)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1067, file: !14, line: 2776, baseType: !910, size: 32, align: 32, offset: 6080)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1067, file: !14, line: 2783, baseType: !910, size: 32, align: 32, offset: 6112)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1067, file: !14, line: 2791, baseType: !910, size: 32, align: 32, offset: 6144)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1067, file: !14, line: 2802, baseType: !1087, size: 64, align: 64, offset: 6208)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1067, file: !14, line: 2811, baseType: !910, size: 32, align: 32, offset: 6272)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1067, file: !14, line: 2821, baseType: !910, size: 32, align: 32, offset: 6304)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1067, file: !14, line: 2830, baseType: !910, size: 32, align: 32, offset: 6336)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1067, file: !14, line: 2840, baseType: !910, size: 32, align: 32, offset: 6368)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1067, file: !14, line: 2851, baseType: !1540, size: 64, align: 64, offset: 6400)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DISubroutineType(types: !1542)
!1542 = !{!910, !1354, !1543, !912, !1357, !910, !910}
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DISubroutineType(types: !1545)
!1545 = !{!910, !1354, !912}
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1067, file: !14, line: 2871, baseType: !1547, size: 64, align: 64, offset: 6464)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DISubroutineType(types: !1549)
!1549 = !{!910, !1354, !1550, !912, !1357, !910}
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DISubroutineType(types: !1552)
!1552 = !{!910, !1354, !912, !910, !910}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1067, file: !14, line: 2878, baseType: !910, size: 32, align: 32, offset: 6528)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1067, file: !14, line: 2885, baseType: !910, size: 32, align: 32, offset: 6560)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1067, file: !14, line: 3005, baseType: !910, size: 32, align: 32, offset: 6592)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1067, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1067, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1067, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1067, file: !14, line: 3037, baseType: !1093, size: 64, align: 64, offset: 6720)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1067, file: !14, line: 3038, baseType: !910, size: 32, align: 32, offset: 6784)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1067, file: !14, line: 3050, baseType: !970, size: 64, align: 64, offset: 6848)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1067, file: !14, line: 3065, baseType: !910, size: 32, align: 32, offset: 6912)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1067, file: !14, line: 3083, baseType: !910, size: 32, align: 32, offset: 6944)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1067, file: !14, line: 3092, baseType: !952, size: 64, align: 32, offset: 6976)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1067, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1067, file: !14, line: 3106, baseType: !952, size: 64, align: 32, offset: 7072)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1067, file: !14, line: 3113, baseType: !1568, size: 64, align: 64, offset: 7168)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1570)
!1570 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1571)
!1571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1572)
!1572 = !{!1573, !1574, !1575, !1576, !1577, !1578, !1581}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1571, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1571, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1571, file: !14, line: 720, baseType: !942, size: 64, align: 64, offset: 64)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1571, file: !14, line: 724, baseType: !942, size: 64, align: 64, offset: 128)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1571, file: !14, line: 728, baseType: !910, size: 32, align: 32, offset: 192)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1571, file: !14, line: 734, baseType: !1579, size: 64, align: 64, offset: 256)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1571, file: !14, line: 739, baseType: !1582, size: 64, align: 64, offset: 320)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1053)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1067, file: !14, line: 3129, baseType: !997, size: 64, align: 64, offset: 7232)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1067, file: !14, line: 3130, baseType: !997, size: 64, align: 64, offset: 7296)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1067, file: !14, line: 3131, baseType: !997, size: 64, align: 64, offset: 7360)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1067, file: !14, line: 3132, baseType: !997, size: 64, align: 64, offset: 7424)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1067, file: !14, line: 3139, baseType: !1480, size: 64, align: 64, offset: 7488)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1067, file: !14, line: 3147, baseType: !910, size: 32, align: 32, offset: 7552)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1067, file: !14, line: 3165, baseType: !910, size: 32, align: 32, offset: 7584)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1067, file: !14, line: 3172, baseType: !910, size: 32, align: 32, offset: 7616)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1067, file: !14, line: 3180, baseType: !910, size: 32, align: 32, offset: 7648)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1067, file: !14, line: 3191, baseType: !1394, size: 64, align: 64, offset: 7680)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1067, file: !14, line: 3199, baseType: !1093, size: 64, align: 64, offset: 7744)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1067, file: !14, line: 3207, baseType: !1480, size: 64, align: 64, offset: 7808)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1067, file: !14, line: 3214, baseType: !911, size: 32, align: 32, offset: 7872)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1067, file: !14, line: 3224, baseType: !1223, size: 64, align: 64, offset: 7936)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1067, file: !14, line: 3225, baseType: !910, size: 32, align: 32, offset: 8000)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1067, file: !14, line: 3249, baseType: !1125, size: 64, align: 64, offset: 8064)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1067, file: !14, line: 3256, baseType: !910, size: 32, align: 32, offset: 8128)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1067, file: !14, line: 3271, baseType: !910, size: 32, align: 32, offset: 8160)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1067, file: !14, line: 3279, baseType: !997, size: 64, align: 64, offset: 8192)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1067, file: !14, line: 3301, baseType: !1125, size: 64, align: 64, offset: 8256)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1067, file: !14, line: 3310, baseType: !910, size: 32, align: 32, offset: 8320)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1067, file: !14, line: 3337, baseType: !910, size: 32, align: 32, offset: 8352)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1067, file: !14, line: 3351, baseType: !910, size: 32, align: 32, offset: 8384)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1067, file: !14, line: 3359, baseType: !910, size: 32, align: 32, offset: 8416)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !939, file: !14, line: 3535, baseType: !1609, size: 64, align: 64, offset: 1024)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DISubroutineType(types: !1611)
!1611 = !{!910, !1065, !1612}
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64, align: 64)
!1613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1066)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !939, file: !14, line: 3541, baseType: !1615, size: 64, align: 64, offset: 1088)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1617)
!1617 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1618)
!1618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1081, line: 223, size: 128, align: 64, elements: !1619)
!1619 = !{!1620, !1621}
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1618, file: !1081, line: 224, baseType: !930, size: 64, align: 64)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1618, file: !1081, line: 225, baseType: !930, size: 64, align: 64, offset: 64)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !939, file: !14, line: 3549, baseType: !1623, size: 64, align: 64, offset: 1152)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DISubroutineType(types: !1625)
!1625 = !{null, !1060}
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !939, file: !14, line: 3551, baseType: !1062, size: 64, align: 64, offset: 1216)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !939, file: !14, line: 3552, baseType: !1628, size: 64, align: 64, offset: 1280)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64, align: 64)
!1629 = !DISubroutineType(types: !1630)
!1630 = !{!910, !1065, !1093, !910, !1631}
!1631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1632, size: 64, align: 64)
!1632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1633)
!1633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1634)
!1634 = !{!1635, !1636, !1637, !1638, !1639, !1663}
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1633, file: !14, line: 3921, baseType: !927, size: 16, align: 16)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1633, file: !14, line: 3922, baseType: !919, size: 32, align: 32, offset: 32)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1633, file: !14, line: 3923, baseType: !919, size: 32, align: 32, offset: 64)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1633, file: !14, line: 3924, baseType: !911, size: 32, align: 32, offset: 96)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1633, file: !14, line: 3925, baseType: !1640, size: 64, align: 64, offset: 128)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1643)
!1643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1644)
!1644 = !{!1645, !1646, !1647, !1648, !1649, !1650, !1656, !1658, !1659, !1660, !1661, !1662}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1643, file: !14, line: 3886, baseType: !910, size: 32, align: 32)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1643, file: !14, line: 3887, baseType: !910, size: 32, align: 32, offset: 32)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1643, file: !14, line: 3888, baseType: !910, size: 32, align: 32, offset: 64)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1643, file: !14, line: 3889, baseType: !910, size: 32, align: 32, offset: 96)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1643, file: !14, line: 3890, baseType: !910, size: 32, align: 32, offset: 128)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1643, file: !14, line: 3897, baseType: !1651, size: 768, align: 64, offset: 192)
!1651 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1652)
!1652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1653)
!1653 = !{!1654, !1655}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1652, file: !14, line: 3855, baseType: !1092, size: 512, align: 64)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1652, file: !14, line: 3857, baseType: !1097, size: 256, align: 32, offset: 512)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1643, file: !14, line: 3903, baseType: !1657, size: 256, align: 64, offset: 960)
!1657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1093, size: 256, align: 64, elements: !1194)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1643, file: !14, line: 3904, baseType: !1201, size: 128, align: 32, offset: 1216)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1643, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1643, file: !14, line: 3908, baseType: !1480, size: 64, align: 64, offset: 1408)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1643, file: !14, line: 3915, baseType: !1480, size: 64, align: 64, offset: 1472)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1643, file: !14, line: 3917, baseType: !910, size: 32, align: 32, offset: 1536)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1633, file: !14, line: 3926, baseType: !997, size: 64, align: 64, offset: 192)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !939, file: !14, line: 3564, baseType: !1665, size: 64, align: 64, offset: 1344)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DISubroutineType(types: !1667)
!1667 = !{!910, !1065, !1211, !1355, !1357}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !939, file: !14, line: 3566, baseType: !1669, size: 64, align: 64, offset: 1408)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DISubroutineType(types: !1671)
!1671 = !{!910, !1065, !912, !1357, !1211}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !939, file: !14, line: 3567, baseType: !1062, size: 64, align: 64, offset: 1472)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !939, file: !14, line: 3576, baseType: !1674, size: 64, align: 64, offset: 1536)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DISubroutineType(types: !1676)
!1676 = !{!910, !1065, !1355}
