; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--x86--aacencdsp_init.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--x86--aacencdsp_init.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AACEncContext = type { %struct.AVClass*, %struct.AACEncOptions, %struct.PutBitContext, %struct.FFTContext, %struct.FFTContext, %struct.AVFloatDSPContext*, %struct.AACPCEInfo, [16 x float*], i32, i32, [8 x i8], %struct.LPCContext, i32, i32, i8*, i8*, %struct.ChannelElement*, %struct.FFPsyContext, %struct.FFPsyPreprocessContext*, %struct.AACCoefficientsEncoder*, i32, i32, float, i32, float, i32, i32, %struct.AudioFrameQueue, [96 x i32], [1024 x float], i16, [256 x [128 x %struct.AACQuantizeBandCostCacheEntry]], void (float*, float*, i32)*, void (i32*, float*, float*, i32, i32, i32, float, float)*, %struct.anon.0 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AACEncOptions = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.PutBitContext = type { i32, i32, i8*, i8*, i8*, i32 }

!886 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!887 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!888 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!889 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!890 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!891 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!892 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!893 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!894 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!895 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!896 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!897 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!898 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !545, line: 538, size: 32, align: 32, elements: !899)
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907}
!900 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!901 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!902 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!903 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!904 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!905 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!906 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!907 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!908 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !85, line: 1534, size: 32, align: 32, elements: !909)
!909 = !{!910, !911, !912, !913, !914, !915}
!910 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!911 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!912 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!913 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!914 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!915 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !85, line: 810, size: 32, align: 32, elements: !917)
!917 = !{!918, !919, !920, !921, !922, !923, !924, !925, !926, !927}
!918 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!919 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!920 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!921 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!922 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!923 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!924 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!925 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!926 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!927 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!928 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !85, line: 798, size: 32, align: 32, elements: !929)
!929 = !{!930, !931, !932, !933, !934, !935, !936}
!930 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!931 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!932 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!933 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!934 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!935 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!936 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!937 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OCStatus", file: !44, line: 115, size: 32, align: 32, elements: !938)
!938 = !{!939, !940, !941, !942, !943}
!939 = !DIEnumerator(name: "OC_NONE", value: 0)
!940 = !DIEnumerator(name: "OC_TRIAL_PCE", value: 1)
!941 = !DIEnumerator(name: "OC_TRIAL_FRAME", value: 2)
!942 = !DIEnumerator(name: "OC_GLOBAL_HDR", value: 3)
!943 = !DIEnumerator(name: "OC_LOCKED", value: 4)
!944 = !{i32 2, !"Dwarf Version", i32 4}
!945 = !{i32 2, !"Debug Info Version", i32 3}
!946 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!947 = distinct !DISubprogram(name: "ff_aac_dsp_init_x86", scope: !948, file: !948, line: 34, type: !949, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2726)
!948 = !DIFile(filename: "libavcodec/x86/aacencdsp_init.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!949 = !DISubroutineType(types: !950)
!950 = !{null, !951}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACEncContext", file: !953, line: 421, baseType: !954)
!953 = !DIFile(filename: "./libavcodec/aacenc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACEncContext", file: !953, line: 376, size: 4539904, align: 256, elements: !955)
!955 = !{!956, !1001, !1013, !1030, !1079, !1080, !1126, !1150, !1152, !1153, !1154, !1203, !1204, !1205, !1208, !1209, !2532, !2612, !2615, !2670, !2671, !2672, !2673, !2674, !2675, !2676, !2677, !2694, !2698, !2700, !2701, !2714, !2718, !2722}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !954, file: !953, line: 377, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !960)
!960 = !{!961, !965, !970, !974, !976, !977, !978, !982, !988, !990, !994}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !959, file: !4, line: 72, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!964 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !959, file: !4, line: 78, baseType: !966, size: 64, align: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!962, !969}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !959, file: !4, line: 85, baseType: !971, size: 64, align: 64, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !959, file: !4, line: 93, baseType: !975, size: 32, align: 32, offset: 192)
!975 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !959, file: !4, line: 99, baseType: !975, size: 32, align: 32, offset: 224)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !959, file: !4, line: 108, baseType: !975, size: 32, align: 32, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !959, file: !4, line: 113, baseType: !979, size: 64, align: 64, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!969, !969, !969}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !959, file: !4, line: 123, baseType: !983, size: 64, align: 64, offset: 384)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!986, !986}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !959, file: !4, line: 130, baseType: !989, size: 32, align: 32, offset: 448)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !959, file: !4, line: 136, baseType: !991, size: 64, align: 64, offset: 512)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!989, !969}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !959, file: !4, line: 142, baseType: !995, size: 64, align: 64, offset: 576)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!975, !998, !969, !962, !975}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !954, file: !953, line: 378, baseType: !1002, size: 256, align: 32, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACEncOptions", file: !953, line: 52, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACEncOptions", file: !953, line: 43, size: 256, align: 32, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !1003, file: !953, line: 44, baseType: !975, size: 32, align: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "pns", scope: !1003, file: !953, line: 45, baseType: !975, size: 32, align: 32, offset: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "tns", scope: !1003, file: !953, line: 46, baseType: !975, size: 32, align: 32, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ltp", scope: !1003, file: !953, line: 47, baseType: !975, size: 32, align: 32, offset: 96)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "pce", scope: !1003, file: !953, line: 48, baseType: !975, size: 32, align: 32, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !1003, file: !953, line: 49, baseType: !975, size: 32, align: 32, offset: 160)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "mid_side", scope: !1003, file: !953, line: 50, baseType: !975, size: 32, align: 32, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "intensity_stereo", scope: !1003, file: !953, line: 51, baseType: !975, size: 32, align: 32, offset: 224)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !954, file: !953, line: 379, baseType: !1014, size: 320, align: 64, offset: 320)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "PutBitContext", file: !1015, line: 40, baseType: !1016)
!1015 = !DIFile(filename: "./libavcodec/put_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PutBitContext", file: !1015, line: 35, size: 320, align: 64, elements: !1017)
!1017 = !{!1018, !1022, !1023, !1027, !1028, !1029}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "bit_buf", scope: !1016, file: !1015, line: 36, baseType: !1019, size: 32, align: 32)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1020, line: 51, baseType: !1021)
!1020 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1021 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "bit_left", scope: !1016, file: !1015, line: 37, baseType: !975, size: 32, align: 32, offset: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1016, file: !1015, line: 38, baseType: !1024, size: 64, align: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1020, line: 48, baseType: !1026)
!1026 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1016, file: !1015, line: 38, baseType: !1024, size: 64, align: 64, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1016, file: !1015, line: 38, baseType: !1024, size: 64, align: 64, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1016, file: !1015, line: 39, baseType: !975, size: 32, align: 32, offset: 256)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "mdct1024", scope: !954, file: !953, line: 380, baseType: !1031, size: 896, align: 64, offset: 640)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !1032, line: 41, baseType: !1033)
!1032 = !DIFile(filename: "./libavcodec/avfft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !25, line: 88, size: 896, align: 64, elements: !1034)
!1034 = !{!1035, !1036, !1037, !1041, !1050, !1051, !1052, !1054, !1055, !1060, !1061, !1067, !1068, !1069, !1075, !1076, !1077}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !1033, file: !25, line: 89, baseType: !975, size: 32, align: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !1033, file: !25, line: 90, baseType: !975, size: 32, align: 32, offset: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "revtab", scope: !1033, file: !25, line: 91, baseType: !1038, size: 64, align: 64, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1020, line: 49, baseType: !1040)
!1040 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !1033, file: !25, line: 92, baseType: !1042, size: 64, align: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !1032, line: 39, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !1032, line: 37, size: 64, align: 32, elements: !1045)
!1045 = !{!1046, !1049}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !1044, file: !1032, line: 38, baseType: !1047, size: 32, align: 32)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !1032, line: 35, baseType: !1048)
!1048 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !1044, file: !1032, line: 38, baseType: !1047, size: 32, align: 32, offset: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_size", scope: !1033, file: !25, line: 93, baseType: !975, size: 32, align: 32, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_bits", scope: !1033, file: !25, line: 94, baseType: !975, size: 32, align: 32, offset: 224)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !1033, file: !25, line: 96, baseType: !1053, size: 64, align: 64, offset: 256)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !1033, file: !25, line: 97, baseType: !1053, size: 64, align: 64, offset: 320)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permute", scope: !1033, file: !25, line: 101, baseType: !1056, size: 64, align: 64, offset: 384)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{null, !1059, !1042}
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "fft_calc", scope: !1033, file: !25, line: 106, baseType: !1056, size: 64, align: 64, offset: 448)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_calc", scope: !1033, file: !25, line: 107, baseType: !1062, size: 64, align: 64, offset: 512)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{null, !1059, !1053, !1065}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1047)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !1033, file: !25, line: 108, baseType: !1062, size: 64, align: 64, offset: 576)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calc", scope: !1033, file: !25, line: 109, baseType: !1062, size: 64, align: 64, offset: 640)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calcw", scope: !1033, file: !25, line: 110, baseType: !1070, size: 64, align: 64, offset: 704)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{null, !1059, !1073, !1065}
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTDouble", file: !25, line: 43, baseType: !1048)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permutation", scope: !1033, file: !25, line: 111, baseType: !24, size: 32, align: 32, offset: 768)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_permutation", scope: !1033, file: !25, line: 112, baseType: !30, size: 32, align: 32, offset: 800)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "revtab32", scope: !1033, file: !25, line: 113, baseType: !1078, size: 64, align: 64, offset: 832)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "mdct128", scope: !954, file: !953, line: 381, baseType: !1031, size: 896, align: 64, offset: 1536)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "fdsp", scope: !954, file: !953, line: 382, baseType: !1081, size: 64, align: 64, offset: 2432)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFloatDSPContext", file: !1083, line: 192, baseType: !1084)
!1083 = !DIFile(filename: "./libavutil/float_dsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFloatDSPContext", file: !1083, line: 24, size: 704, align: 64, elements: !1085)
!1085 = !{!1086, !1093, !1097, !1105, !1106, !1107, !1111, !1112, !1113, !1118, !1122}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul", scope: !1084, file: !1083, line: 38, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{null, !1090, !1091, !1091, !975}
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1048)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmac_scalar", scope: !1084, file: !1083, line: 54, baseType: !1094, size: 64, align: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{null, !1090, !1091, !1048, !975}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmac_scalar", scope: !1084, file: !1083, line: 70, baseType: !1098, size: 64, align: 64, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{null, !1101, !1103, !1102, !975}
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1102)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_scalar", scope: !1084, file: !1083, line: 85, baseType: !1094, size: 64, align: 64, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmul_scalar", scope: !1084, file: !1083, line: 100, baseType: !1098, size: 64, align: 64, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_window", scope: !1084, file: !1083, line: 119, baseType: !1108, size: 64, align: 64, offset: 320)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{null, !1090, !1091, !1091, !1091, !975}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_add", scope: !1084, file: !1083, line: 137, baseType: !1108, size: 64, align: 64, offset: 384)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_reverse", scope: !1084, file: !1083, line: 154, baseType: !1087, size: 64, align: 64, offset: 448)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "butterflies_float", scope: !1084, file: !1083, line: 164, baseType: !1114, size: 64, align: 64, offset: 512)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{null, !1117, !1117, !975}
!1117 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1090)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "scalarproduct_float", scope: !1084, file: !1083, line: 175, baseType: !1119, size: 64, align: 64, offset: 576)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!1048, !1091, !1091, !975}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmul", scope: !1084, file: !1083, line: 190, baseType: !1123, size: 64, align: 64, offset: 640)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{null, !1101, !1103, !1103, !975}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "pce", scope: !954, file: !953, line: 383, baseType: !1127, size: 2240, align: 64, offset: 2496)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACPCEInfo", file: !953, line: 100, baseType: !1128)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACPCEInfo", file: !953, line: 93, size: 2240, align: 64, elements: !1129)
!1129 = !{!1130, !1133, !1137, !1142, !1145, !1149}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !1128, file: !953, line: 94, baseType: !1131, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1020, line: 40, baseType: !1132)
!1132 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "num_ele", scope: !1128, file: !953, line: 95, baseType: !1134, size: 128, align: 32, offset: 64)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 128, align: 32, elements: !1135)
!1135 = !{!1136}
!1136 = !DISubrange(count: 4)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pairing", scope: !1128, file: !953, line: 96, baseType: !1138, size: 768, align: 32, offset: 192)
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 768, align: 32, elements: !1139)
!1139 = !{!1140, !1141}
!1140 = !DISubrange(count: 3)
!1141 = !DISubrange(count: 8)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1128, file: !953, line: 97, baseType: !1143, size: 1024, align: 32, offset: 960)
!1143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 1024, align: 32, elements: !1144)
!1144 = !{!1136, !1141}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "config_map", scope: !1128, file: !953, line: 98, baseType: !1146, size: 128, align: 8, offset: 1984)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 128, align: 8, elements: !1147)
!1147 = !{!1148}
!1148 = !DISubrange(count: 16)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "reorder_map", scope: !1128, file: !953, line: 99, baseType: !1146, size: 128, align: 8, offset: 2112)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "planar_samples", scope: !954, file: !953, line: 384, baseType: !1151, size: 1024, align: 64, offset: 4736)
!1151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1090, size: 1024, align: 64, elements: !1147)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !954, file: !953, line: 386, baseType: !975, size: 32, align: 32, offset: 5760)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "needs_pce", scope: !954, file: !953, line: 387, baseType: !975, size: 32, align: 32, offset: 5792)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "lpc", scope: !954, file: !953, line: 388, baseType: !1155, size: 302080, align: 256, offset: 5888)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "LPCContext", file: !35, line: 87, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LPCContext", file: !35, line: 52, size: 302080, align: 256, elements: !1157)
!1157 = !{!1158, !1159, !1160, !1161, !1162, !1163, !1170, !1174}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "blocksize", scope: !1156, file: !35, line: 53, baseType: !975, size: 32, align: 32)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "max_order", scope: !1156, file: !35, line: 54, baseType: !975, size: 32, align: 32, offset: 32)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "lpc_type", scope: !1156, file: !35, line: 55, baseType: !34, size: 32, align: 32, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "windowed_buffer", scope: !1156, file: !35, line: 56, baseType: !1101, size: 64, align: 64, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "windowed_samples", scope: !1156, file: !35, line: 57, baseType: !1101, size: 64, align: 64, offset: 192)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "lpc_apply_welch_window", scope: !1156, file: !35, line: 67, baseType: !1164, size: 64, align: 64, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{null, !1167, !975, !1101}
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1169)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !1020, line: 38, baseType: !975)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "lpc_compute_autocorr", scope: !1156, file: !35, line: 82, baseType: !1171, size: 64, align: 64, offset: 320)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{null, !1103, !975, !975, !1101}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "lls_models", scope: !1156, file: !35, line: 86, baseType: !1175, size: 301568, align: 256, offset: 512)
!1175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1176, size: 301568, align: 256, elements: !1201)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLSModel", file: !1177, line: 58, baseType: !1178)
!1177 = !DIFile(filename: "./libavutil/lls.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LLSModel", file: !1177, line: 38, size: 150784, align: 256, elements: !1179)
!1179 = !{!1180, !1184, !1188, !1191, !1192, !1197}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "covariance", scope: !1178, file: !1177, line: 39, baseType: !1181, size: 82944, align: 64)
!1181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1102, size: 82944, align: 64, elements: !1182)
!1182 = !{!1183, !1183}
!1183 = !DISubrange(count: 36)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "coeff", scope: !1178, file: !1177, line: 40, baseType: !1185, size: 65536, align: 64, offset: 82944)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1102, size: 65536, align: 64, elements: !1186)
!1186 = !{!1187, !1187}
!1187 = !DISubrange(count: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "variance", scope: !1178, file: !1177, line: 41, baseType: !1189, size: 2048, align: 64, offset: 148480)
!1189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1102, size: 2048, align: 64, elements: !1190)
!1190 = !{!1187}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "indep_count", scope: !1178, file: !1177, line: 42, baseType: !975, size: 32, align: 32, offset: 150528)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "update_lls", scope: !1178, file: !1177, line: 50, baseType: !1193, size: 64, align: 64, offset: 150592)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{null, !1196, !1103}
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "evaluate_lls", scope: !1178, file: !1177, line: 57, baseType: !1198, size: 64, align: 64, offset: 150656)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!1102, !1196, !1103, !975}
!1201 = !{!1202}
!1202 = !DISubrange(count: 2)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "samplerate_index", scope: !954, file: !953, line: 389, baseType: !975, size: 32, align: 32, offset: 307968)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !954, file: !953, line: 390, baseType: !975, size: 32, align: 32, offset: 308000)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "reorder_map", scope: !954, file: !953, line: 391, baseType: !1206, size: 64, align: 64, offset: 308032)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1025)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "chan_map", scope: !954, file: !953, line: 392, baseType: !1206, size: 64, align: 64, offset: 308096)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "cpe", scope: !954, file: !953, line: 394, baseType: !1210, size: 64, align: 64, offset: 308160)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelElement", file: !44, line: 288, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelElement", file: !44, line: 275, size: 4381952, align: 256, elements: !1213)
!1213 = !{!1214, !1215, !1216, !1217, !1218, !1222, !1223, !1359, !1372}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !1212, file: !44, line: 276, baseType: !975, size: 32, align: 32)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "common_window", scope: !1212, file: !44, line: 278, baseType: !975, size: 32, align: 32, offset: 32)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "ms_mode", scope: !1212, file: !44, line: 279, baseType: !975, size: 32, align: 32, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "is_mode", scope: !1212, file: !44, line: 280, baseType: !1025, size: 8, align: 8, offset: 96)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "ms_mask", scope: !1212, file: !44, line: 281, baseType: !1219, size: 1024, align: 8, offset: 104)
!1219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 1024, align: 8, elements: !1220)
!1220 = !{!1221}
!1221 = !DISubrange(count: 128)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "is_mask", scope: !1212, file: !44, line: 282, baseType: !1219, size: 1024, align: 8, offset: 1128)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !1212, file: !44, line: 284, baseType: !1224, size: 1187328, align: 256, offset: 2304)
!1224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1225, size: 1187328, align: 256, elements: !1201)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "SingleChannelElement", file: !44, line: 270, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SingleChannelElement", file: !44, line: 248, size: 593664, align: 256, elements: !1227)
!1227 = !{!1228, !1279, !1297, !1305, !1307, !1308, !1312, !1314, !1316, !1317, !1318, !1320, !1321, !1325, !1326, !1330, !1334, !1338, !1341, !1342, !1357}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "ics", scope: !1226, file: !44, line: 249, baseType: !1229, size: 2432, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndividualChannelStream", file: !44, line: 193, baseType: !1230)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IndividualChannelStream", file: !44, line: 174, size: 2432, align: 64, elements: !1231)
!1231 = !{!1232, !1233, !1235, !1237, !1238, !1241, !1259, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1273, !1277, !1278}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "max_sfb", scope: !1230, file: !44, line: 175, baseType: !1025, size: 8, align: 8)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "window_sequence", scope: !1230, file: !44, line: 176, baseType: !1234, size: 64, align: 32, offset: 32)
!1234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 64, align: 32, elements: !1201)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "use_kb_window", scope: !1230, file: !44, line: 177, baseType: !1236, size: 16, align: 8, offset: 96)
!1236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 16, align: 8, elements: !1201)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "num_window_groups", scope: !1230, file: !44, line: 178, baseType: !975, size: 32, align: 32, offset: 128)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "group_len", scope: !1230, file: !44, line: 179, baseType: !1239, size: 64, align: 8, offset: 160)
!1239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 64, align: 8, elements: !1240)
!1240 = !{!1141}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "ltp", scope: !1230, file: !44, line: 180, baseType: !1242, size: 416, align: 32, offset: 224)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "LongTermPrediction", file: !44, line: 169, baseType: !1243)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LongTermPrediction", file: !44, line: 163, size: 416, align: 32, elements: !1244)
!1244 = !{!1245, !1248, !1251, !1252, !1255}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !1243, file: !44, line: 164, baseType: !1246, size: 8, align: 8)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1020, line: 36, baseType: !1247)
!1247 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !1243, file: !44, line: 165, baseType: !1249, size: 16, align: 16, offset: 16)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !1020, line: 37, baseType: !1250)
!1250 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "coef_idx", scope: !1243, file: !44, line: 166, baseType: !975, size: 32, align: 32, offset: 32)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !1243, file: !44, line: 167, baseType: !1253, size: 32, align: 32, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTFLOAT", file: !1254, line: 86, baseType: !1048)
!1254 = !DIFile(filename: "./libavcodec/aac_defines.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1243, file: !44, line: 168, baseType: !1256, size: 320, align: 8, offset: 96)
!1256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1246, size: 320, align: 8, elements: !1257)
!1257 = !{!1258}
!1258 = !DISubrange(count: 40)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "swb_offset", scope: !1230, file: !44, line: 181, baseType: !1260, size: 64, align: 64, offset: 640)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "swb_sizes", scope: !1230, file: !44, line: 182, baseType: !1206, size: 64, align: 64, offset: 704)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "num_swb", scope: !1230, file: !44, line: 183, baseType: !975, size: 32, align: 32, offset: 768)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "num_windows", scope: !1230, file: !44, line: 184, baseType: !975, size: 32, align: 32, offset: 800)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "tns_max_bands", scope: !1230, file: !44, line: 185, baseType: !975, size: 32, align: 32, offset: 832)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_present", scope: !1230, file: !44, line: 186, baseType: !975, size: 32, align: 32, offset: 864)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_initialized", scope: !1230, file: !44, line: 187, baseType: !975, size: 32, align: 32, offset: 896)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_reset_group", scope: !1230, file: !44, line: 188, baseType: !975, size: 32, align: 32, offset: 928)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_reset_count", scope: !1230, file: !44, line: 189, baseType: !1270, size: 992, align: 32, offset: 960)
!1270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 992, align: 32, elements: !1271)
!1271 = !{!1272}
!1272 = !DISubrange(count: 31)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_used", scope: !1230, file: !44, line: 190, baseType: !1274, size: 328, align: 8, offset: 1952)
!1274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 328, align: 8, elements: !1275)
!1275 = !{!1276}
!1276 = !DISubrange(count: 41)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "window_clipping", scope: !1230, file: !44, line: 191, baseType: !1239, size: 64, align: 8, offset: 2280)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "clip_avoidance_factor", scope: !1230, file: !44, line: 192, baseType: !1048, size: 32, align: 32, offset: 2368)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "tns", scope: !1226, file: !44, line: 250, baseType: !1280, size: 44320, align: 32, offset: 2432)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "TemporalNoiseShaping", file: !44, line: 206, baseType: !1281)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TemporalNoiseShaping", file: !44, line: 198, size: 44320, align: 32, elements: !1282)
!1282 = !{!1283, !1284, !1286, !1289, !1290, !1291, !1295}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !1281, file: !44, line: 199, baseType: !975, size: 32, align: 32)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "n_filt", scope: !1281, file: !44, line: 200, baseType: !1285, size: 256, align: 32, offset: 32)
!1285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 256, align: 32, elements: !1240)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1281, file: !44, line: 201, baseType: !1287, size: 1024, align: 32, offset: 288)
!1287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 1024, align: 32, elements: !1288)
!1288 = !{!1141, !1136}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !1281, file: !44, line: 202, baseType: !1287, size: 1024, align: 32, offset: 1312)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !1281, file: !44, line: 203, baseType: !1287, size: 1024, align: 32, offset: 2336)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "coef_idx", scope: !1281, file: !44, line: 204, baseType: !1292, size: 20480, align: 32, offset: 3360)
!1292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 20480, align: 32, elements: !1293)
!1293 = !{!1141, !1136, !1294}
!1294 = !DISubrange(count: 20)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !1281, file: !44, line: 205, baseType: !1296, size: 20480, align: 32, offset: 23840)
!1296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 20480, align: 32, elements: !1293)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "pulse", scope: !1226, file: !44, line: 251, baseType: !1298, size: 320, align: 32, offset: 46752)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pulse", file: !44, line: 229, baseType: !1299)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Pulse", file: !44, line: 224, size: 320, align: 32, elements: !1300)
!1300 = !{!1301, !1302, !1303, !1304}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "num_pulse", scope: !1299, file: !44, line: 225, baseType: !975, size: 32, align: 32)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1299, file: !44, line: 226, baseType: !975, size: 32, align: 32, offset: 32)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1299, file: !44, line: 227, baseType: !1134, size: 128, align: 32, offset: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "amp", scope: !1299, file: !44, line: 228, baseType: !1134, size: 128, align: 32, offset: 192)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "band_type", scope: !1226, file: !44, line: 252, baseType: !1306, size: 4096, align: 32, offset: 47072)
!1306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 4096, align: 32, elements: !1220)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "band_alt", scope: !1226, file: !44, line: 253, baseType: !1306, size: 4096, align: 32, offset: 51168)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "band_type_run_end", scope: !1226, file: !44, line: 254, baseType: !1309, size: 3840, align: 32, offset: 55264)
!1309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 3840, align: 32, elements: !1310)
!1310 = !{!1311}
!1311 = !DISubrange(count: 120)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !1226, file: !44, line: 255, baseType: !1313, size: 3840, align: 32, offset: 59104)
!1313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 3840, align: 32, elements: !1310)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "sf_idx", scope: !1226, file: !44, line: 256, baseType: !1315, size: 4096, align: 32, offset: 62944)
!1315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 4096, align: 32, elements: !1220)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "zeroes", scope: !1226, file: !44, line: 257, baseType: !1219, size: 1024, align: 8, offset: 67040)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "can_pns", scope: !1226, file: !44, line: 258, baseType: !1219, size: 1024, align: 8, offset: 68064)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "is_ener", scope: !1226, file: !44, line: 259, baseType: !1319, size: 4096, align: 32, offset: 69088)
!1319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1048, size: 4096, align: 32, elements: !1220)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "pns_ener", scope: !1226, file: !44, line: 260, baseType: !1319, size: 4096, align: 32, offset: 73184)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "pcoeffs", scope: !1226, file: !44, line: 261, baseType: !1322, size: 32768, align: 32, offset: 77312)
!1322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 32768, align: 32, elements: !1323)
!1323 = !{!1324}
!1324 = !DISubrange(count: 1024)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "coeffs", scope: !1226, file: !44, line: 262, baseType: !1322, size: 32768, align: 32, offset: 110080)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1226, file: !44, line: 263, baseType: !1327, size: 49152, align: 32, offset: 142848)
!1327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 49152, align: 32, elements: !1328)
!1328 = !{!1329}
!1329 = !DISubrange(count: 1536)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "ret_buf", scope: !1226, file: !44, line: 264, baseType: !1331, size: 65536, align: 32, offset: 192000)
!1331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 65536, align: 32, elements: !1332)
!1332 = !{!1333}
!1333 = !DISubrange(count: 2048)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "ltp_state", scope: !1226, file: !44, line: 265, baseType: !1335, size: 98304, align: 32, offset: 257536)
!1335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 98304, align: 32, elements: !1336)
!1336 = !{!1337}
!1337 = !DISubrange(count: 3072)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "lcoeffs", scope: !1226, file: !44, line: 266, baseType: !1339, size: 32768, align: 32, offset: 355840)
!1339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1340, size: 32768, align: 32, elements: !1323)
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "AAC_FLOAT", file: !1254, line: 90, baseType: !1048)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "prcoeffs", scope: !1226, file: !44, line: 267, baseType: !1339, size: 32768, align: 32, offset: 388608)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_state", scope: !1226, file: !44, line: 268, baseType: !1343, size: 172032, align: 32, offset: 421376)
!1343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1344, size: 172032, align: 32, elements: !1355)
!1344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PredictorState", file: !44, line: 144, baseType: !1345)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PredictorState", file: !44, line: 135, size: 256, align: 32, elements: !1346)
!1346 = !{!1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "cor0", scope: !1345, file: !44, line: 136, baseType: !1340, size: 32, align: 32)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "cor1", scope: !1345, file: !44, line: 137, baseType: !1340, size: 32, align: 32, offset: 32)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "var0", scope: !1345, file: !44, line: 138, baseType: !1340, size: 32, align: 32, offset: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "var1", scope: !1345, file: !44, line: 139, baseType: !1340, size: 32, align: 32, offset: 96)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "r0", scope: !1345, file: !44, line: 140, baseType: !1340, size: 32, align: 32, offset: 128)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "r1", scope: !1345, file: !44, line: 141, baseType: !1340, size: 32, align: 32, offset: 160)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1345, file: !44, line: 142, baseType: !1340, size: 32, align: 32, offset: 192)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "x_est", scope: !1345, file: !44, line: 143, baseType: !1340, size: 32, align: 32, offset: 224)
!1355 = !{!1356}
!1356 = !DISubrange(count: 672)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "ret", scope: !1226, file: !44, line: 269, baseType: !1358, size: 64, align: 64, offset: 593408)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "coup", scope: !1212, file: !44, line: 286, baseType: !1360, size: 62272, align: 32, offset: 1189632)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelCoupling", file: !44, line: 243, baseType: !1361)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelCoupling", file: !44, line: 234, size: 62272, align: 32, elements: !1362)
!1362 = !{!1363, !1364, !1365, !1367, !1368, !1369}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "coupling_point", scope: !1361, file: !44, line: 235, baseType: !59, size: 32, align: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "num_coupled", scope: !1361, file: !44, line: 236, baseType: !975, size: 32, align: 32, offset: 32)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1361, file: !44, line: 237, baseType: !1366, size: 256, align: 32, offset: 64)
!1366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 256, align: 32, elements: !1240)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "id_select", scope: !1361, file: !44, line: 238, baseType: !1285, size: 256, align: 32, offset: 320)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "ch_select", scope: !1361, file: !44, line: 239, baseType: !1285, size: 256, align: 32, offset: 576)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1361, file: !44, line: 242, baseType: !1370, size: 61440, align: 32, offset: 832)
!1370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 61440, align: 32, elements: !1371)
!1371 = !{!1148, !1311}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "sbr", scope: !1212, file: !44, line: 287, baseType: !1373, size: 3129856, align: 256, offset: 1252096)
!1373 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpectralBandReplication", file: !1374, line: 115, baseType: !1375)
!1374 = !DIFile(filename: "./libavcodec/sbr.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpectralBandReplication", file: !1374, line: 139, size: 3129856, align: 256, elements: !1376)
!1376 = !{!1377, !1378, !1379, !1380, !1381, !1382, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1403, !1405, !1406, !1407, !1408, !1480, !1598, !1599, !1600, !1601, !1605, !1609, !1610, !1612, !1616, !1617, !1619, !1620, !1623, !1626, !1629, !1632, !1633, !1636, !1637, !1639, !1640, !1641, !1642, !1643, !1646, !1647, !1648, !1701}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1375, file: !1374, line: 140, baseType: !975, size: 32, align: 32)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1375, file: !1374, line: 141, baseType: !975, size: 32, align: 32, offset: 32)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "ready_for_dequant", scope: !1375, file: !1374, line: 142, baseType: !975, size: 32, align: 32, offset: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "id_aac", scope: !1375, file: !1374, line: 143, baseType: !975, size: 32, align: 32, offset: 96)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !1375, file: !1374, line: 144, baseType: !975, size: 32, align: 32, offset: 128)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "spectrum_params", scope: !1375, file: !1374, line: 145, baseType: !1383, size: 48, align: 8, offset: 160)
!1383 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpectrumParameters", file: !1374, line: 55, baseType: !1384)
!1384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpectrumParameters", file: !1374, line: 42, size: 48, align: 8, elements: !1385)
!1385 = !{!1386, !1387, !1388, !1389, !1390, !1391}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "bs_start_freq", scope: !1384, file: !1374, line: 43, baseType: !1025, size: 8, align: 8)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "bs_stop_freq", scope: !1384, file: !1374, line: 44, baseType: !1025, size: 8, align: 8, offset: 8)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "bs_xover_band", scope: !1384, file: !1374, line: 45, baseType: !1025, size: 8, align: 8, offset: 16)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "bs_freq_scale", scope: !1384, file: !1374, line: 51, baseType: !1025, size: 8, align: 8, offset: 24)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "bs_alter_scale", scope: !1384, file: !1374, line: 52, baseType: !1025, size: 8, align: 8, offset: 32)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "bs_noise_bands", scope: !1384, file: !1374, line: 53, baseType: !1025, size: 8, align: 8, offset: 40)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "bs_amp_res_header", scope: !1375, file: !1374, line: 146, baseType: !975, size: 32, align: 32, offset: 224)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "bs_limiter_bands", scope: !1375, file: !1374, line: 151, baseType: !1021, size: 32, align: 32, offset: 256)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "bs_limiter_gains", scope: !1375, file: !1374, line: 152, baseType: !1021, size: 32, align: 32, offset: 288)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "bs_interpol_freq", scope: !1375, file: !1374, line: 153, baseType: !1021, size: 32, align: 32, offset: 320)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "bs_smoothing_mode", scope: !1375, file: !1374, line: 154, baseType: !1021, size: 32, align: 32, offset: 352)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "bs_coupling", scope: !1375, file: !1374, line: 156, baseType: !1021, size: 32, align: 32, offset: 384)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !1375, file: !1374, line: 157, baseType: !1399, size: 160, align: 32, offset: 416)
!1399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1400, size: 160, align: 32, elements: !1401)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "AAC_SIGNE", file: !1254, line: 91, baseType: !1021)
!1401 = !{!1402}
!1402 = !DISubrange(count: 5)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !1375, file: !1374, line: 160, baseType: !1404, size: 64, align: 32, offset: 576)
!1404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1400, size: 64, align: 32, elements: !1201)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1375, file: !1374, line: 162, baseType: !1404, size: 64, align: 32, offset: 640)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "kx_and_m_pushed", scope: !1375, file: !1374, line: 163, baseType: !1021, size: 32, align: 32, offset: 704)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "n_master", scope: !1375, file: !1374, line: 165, baseType: !1400, size: 32, align: 32, offset: 736)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1375, file: !1374, line: 166, baseType: !1409, size: 1407488, align: 256, offset: 768)
!1409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1410, size: 1407488, align: 256, elements: !1201)
!1410 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBRData", file: !1374, line: 113, baseType: !1411)
!1411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SBRData", file: !1374, line: 62, size: 703744, align: 256, elements: !1412)
!1412 = !{!1413, !1414, !1415, !1416, !1420, !1421, !1423, !1424, !1427, !1431, !1432, !1436, !1440, !1441, !1443, !1445, !1448, !1449, !1454, !1458, !1459, !1462, !1466, !1468, !1471, !1473, !1474, !1475, !1478, !1479}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "bs_frame_class", scope: !1411, file: !1374, line: 67, baseType: !1021, size: 32, align: 32)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "bs_add_harmonic_flag", scope: !1411, file: !1374, line: 68, baseType: !1021, size: 32, align: 32, offset: 32)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "bs_num_env", scope: !1411, file: !1374, line: 69, baseType: !1400, size: 32, align: 32, offset: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "bs_freq_res", scope: !1411, file: !1374, line: 70, baseType: !1417, size: 56, align: 8, offset: 96)
!1417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 56, align: 8, elements: !1418)
!1418 = !{!1419}
!1419 = !DISubrange(count: 7)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "bs_num_noise", scope: !1411, file: !1374, line: 71, baseType: !1400, size: 32, align: 32, offset: 160)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "bs_df_env", scope: !1411, file: !1374, line: 72, baseType: !1422, size: 40, align: 8, offset: 192)
!1422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 40, align: 8, elements: !1401)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "bs_df_noise", scope: !1411, file: !1374, line: 73, baseType: !1236, size: 16, align: 8, offset: 232)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "bs_invf_mode", scope: !1411, file: !1374, line: 74, baseType: !1425, size: 80, align: 8, offset: 248)
!1425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 80, align: 8, elements: !1426)
!1426 = !{!1202, !1402}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "bs_add_harmonic", scope: !1411, file: !1374, line: 75, baseType: !1428, size: 384, align: 8, offset: 328)
!1428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 384, align: 8, elements: !1429)
!1429 = !{!1430}
!1430 = !DISubrange(count: 48)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "bs_amp_res", scope: !1411, file: !1374, line: 76, baseType: !1021, size: 32, align: 32, offset: 736)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "synthesis_filterbank_samples", scope: !1411, file: !1374, line: 83, baseType: !1433, size: 73728, align: 32, offset: 768)
!1433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 73728, align: 32, elements: !1434)
!1434 = !{!1435}
!1435 = !DISubrange(count: 2304)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "analysis_filterbank_samples", scope: !1411, file: !1374, line: 84, baseType: !1437, size: 41984, align: 32, offset: 74496)
!1437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 41984, align: 32, elements: !1438)
!1438 = !{!1439}
!1439 = !DISubrange(count: 1312)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "synthesis_filterbank_samples_offset", scope: !1411, file: !1374, line: 85, baseType: !975, size: 32, align: 32, offset: 116480)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "e_a", scope: !1411, file: !1374, line: 87, baseType: !1442, size: 64, align: 32, offset: 116512)
!1442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 64, align: 32, elements: !1201)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "bw_array", scope: !1411, file: !1374, line: 89, baseType: !1444, size: 160, align: 32, offset: 116576)
!1444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 160, align: 32, elements: !1401)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !1411, file: !1374, line: 91, baseType: !1446, size: 131072, align: 32, offset: 116736)
!1446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 131072, align: 32, elements: !1447)
!1447 = !{!1202, !1187, !1187, !1202}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "Ypos", scope: !1411, file: !1374, line: 93, baseType: !975, size: 32, align: 32, offset: 247808)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "Y", scope: !1411, file: !1374, line: 94, baseType: !1450, size: 311296, align: 32, offset: 247936)
!1450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 311296, align: 32, elements: !1451)
!1451 = !{!1202, !1452, !1453, !1202}
!1452 = !DISubrange(count: 38)
!1453 = !DISubrange(count: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "g_temp", scope: !1411, file: !1374, line: 95, baseType: !1455, size: 64512, align: 32, offset: 559232)
!1455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1340, size: 64512, align: 32, elements: !1456)
!1456 = !{!1457, !1430}
!1457 = !DISubrange(count: 42)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "q_temp", scope: !1411, file: !1374, line: 96, baseType: !1455, size: 64512, align: 32, offset: 623744)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "s_indexmapped", scope: !1411, file: !1374, line: 97, baseType: !1460, size: 3072, align: 8, offset: 688256)
!1460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 3072, align: 8, elements: !1461)
!1461 = !{!1141, !1430}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "env_facs_q", scope: !1411, file: !1374, line: 99, baseType: !1463, size: 2304, align: 8, offset: 691328)
!1463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 2304, align: 8, elements: !1464)
!1464 = !{!1465, !1430}
!1465 = !DISubrange(count: 6)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "env_facs", scope: !1411, file: !1374, line: 100, baseType: !1467, size: 9216, align: 32, offset: 693632)
!1467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1340, size: 9216, align: 32, elements: !1464)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "noise_facs_q", scope: !1411, file: !1374, line: 102, baseType: !1469, size: 120, align: 8, offset: 702848)
!1469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 120, align: 8, elements: !1470)
!1470 = !{!1140, !1402}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "noise_facs", scope: !1411, file: !1374, line: 103, baseType: !1472, size: 480, align: 32, offset: 702976)
!1472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1340, size: 480, align: 32, elements: !1470)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "t_env", scope: !1411, file: !1374, line: 105, baseType: !1239, size: 64, align: 8, offset: 703456)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "t_env_num_env_old", scope: !1411, file: !1374, line: 107, baseType: !1025, size: 8, align: 8, offset: 703520)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "t_q", scope: !1411, file: !1374, line: 109, baseType: !1476, size: 24, align: 8, offset: 703528)
!1476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 24, align: 8, elements: !1477)
!1477 = !{!1140}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "f_indexnoise", scope: !1411, file: !1374, line: 110, baseType: !1021, size: 32, align: 32, offset: 703552)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "f_indexsine", scope: !1411, file: !1374, line: 111, baseType: !1021, size: 32, align: 32, offset: 703584)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "ps", scope: !1375, file: !1374, line: 167, baseType: !1481, size: 1072896, align: 128, offset: 1408256)
!1481 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSContext", file: !1482, line: 79, baseType: !1483)
!1482 = !DIFile(filename: "./libavcodec/aacps.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PSContext", file: !1482, line: 41, size: 1072896, align: 128, elements: !1484)
!1484 = !{!1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1501, !1505, !1506, !1507, !1508, !1509, !1510, !1514, !1519, !1524, !1527, !1528, !1529, !1532, !1533, !1534, !1535, !1538, !1539, !1541, !1542}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1483, file: !1482, line: 42, baseType: !975, size: 32, align: 32)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "enable_iid", scope: !1483, file: !1482, line: 43, baseType: !975, size: 32, align: 32, offset: 32)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "iid_quant", scope: !1483, file: !1482, line: 44, baseType: !975, size: 32, align: 32, offset: 64)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "nr_iid_par", scope: !1483, file: !1482, line: 45, baseType: !975, size: 32, align: 32, offset: 96)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "nr_ipdopd_par", scope: !1483, file: !1482, line: 46, baseType: !975, size: 32, align: 32, offset: 128)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "enable_icc", scope: !1483, file: !1482, line: 47, baseType: !975, size: 32, align: 32, offset: 160)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "icc_mode", scope: !1483, file: !1482, line: 48, baseType: !975, size: 32, align: 32, offset: 192)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "nr_icc_par", scope: !1483, file: !1482, line: 49, baseType: !975, size: 32, align: 32, offset: 224)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "enable_ext", scope: !1483, file: !1482, line: 50, baseType: !975, size: 32, align: 32, offset: 256)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "frame_class", scope: !1483, file: !1482, line: 51, baseType: !975, size: 32, align: 32, offset: 288)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "num_env_old", scope: !1483, file: !1482, line: 52, baseType: !975, size: 32, align: 32, offset: 320)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "num_env", scope: !1483, file: !1482, line: 53, baseType: !975, size: 32, align: 32, offset: 352)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "enable_ipdopd", scope: !1483, file: !1482, line: 54, baseType: !975, size: 32, align: 32, offset: 384)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "border_position", scope: !1483, file: !1482, line: 55, baseType: !1499, size: 192, align: 32, offset: 416)
!1499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 192, align: 32, elements: !1500)
!1500 = !{!1465}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "iid_par", scope: !1483, file: !1482, line: 56, baseType: !1502, size: 1360, align: 8, offset: 608)
!1502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1246, size: 1360, align: 8, elements: !1503)
!1503 = !{!1402, !1504}
!1504 = !DISubrange(count: 34)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "icc_par", scope: !1483, file: !1482, line: 57, baseType: !1502, size: 1360, align: 8, offset: 1968)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "ipd_par", scope: !1483, file: !1482, line: 59, baseType: !1502, size: 1360, align: 8, offset: 3328)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "opd_par", scope: !1483, file: !1482, line: 60, baseType: !1502, size: 1360, align: 8, offset: 4688)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "is34bands", scope: !1483, file: !1482, line: 61, baseType: !975, size: 32, align: 32, offset: 6048)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "is34bands_old", scope: !1483, file: !1482, line: 62, baseType: !975, size: 32, align: 32, offset: 6080)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !1483, file: !1482, line: 64, baseType: !1511, size: 14080, align: 32, offset: 6144)
!1511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 14080, align: 32, elements: !1512)
!1512 = !{!1402, !1513, !1202}
!1513 = !DISubrange(count: 44)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1483, file: !1482, line: 65, baseType: !1515, size: 267904, align: 32, offset: 20224)
!1515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 267904, align: 32, elements: !1516)
!1516 = !{!1517, !1518, !1202}
!1517 = !DISubrange(count: 91)
!1518 = !DISubrange(count: 46)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "ap_delay", scope: !1483, file: !1482, line: 66, baseType: !1520, size: 355200, align: 32, offset: 288128)
!1520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 355200, align: 32, elements: !1521)
!1521 = !{!1522, !1140, !1523, !1202}
!1522 = !DISubrange(count: 50)
!1523 = !DISubrange(count: 37)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "peak_decay_nrg", scope: !1483, file: !1482, line: 67, baseType: !1525, size: 1088, align: 32, offset: 643328)
!1525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 1088, align: 32, elements: !1526)
!1526 = !{!1504}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "power_smooth", scope: !1483, file: !1482, line: 68, baseType: !1525, size: 1088, align: 32, offset: 644480)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "peak_decay_diff_smooth", scope: !1483, file: !1482, line: 69, baseType: !1525, size: 1088, align: 32, offset: 645632)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "H11", scope: !1483, file: !1482, line: 70, baseType: !1530, size: 13056, align: 32, offset: 646784)
!1530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 13056, align: 32, elements: !1531)
!1531 = !{!1202, !1465, !1504}
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "H12", scope: !1483, file: !1482, line: 71, baseType: !1530, size: 13056, align: 32, offset: 659840)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "H21", scope: !1483, file: !1482, line: 72, baseType: !1530, size: 13056, align: 32, offset: 672896)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "H22", scope: !1483, file: !1482, line: 73, baseType: !1530, size: 13056, align: 32, offset: 685952)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "Lbuf", scope: !1483, file: !1482, line: 74, baseType: !1536, size: 186368, align: 32, offset: 699008)
!1536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 186368, align: 32, elements: !1537)
!1537 = !{!1517, !1187, !1202}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "Rbuf", scope: !1483, file: !1482, line: 75, baseType: !1536, size: 186368, align: 32, offset: 885376)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "opd_hist", scope: !1483, file: !1482, line: 76, baseType: !1540, size: 272, align: 8, offset: 1071744)
!1540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1246, size: 272, align: 8, elements: !1526)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "ipd_hist", scope: !1483, file: !1482, line: 77, baseType: !1540, size: 272, align: 8, offset: 1072016)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "dsp", scope: !1483, file: !1482, line: 78, baseType: !1543, size: 512, align: 64, offset: 1072320)
!1543 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSDSPContext", file: !1544, line: 52, baseType: !1545)
!1544 = !DIFile(filename: "./libavcodec/aacpsdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PSDSPContext", file: !1544, line: 32, size: 512, align: 64, elements: !1546)
!1546 = !{!1547, !1554, !1560, !1569, !1579, !1583, !1591}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "add_squares", scope: !1545, file: !1544, line: 33, baseType: !1548, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DISubroutineType(types: !1550)
!1550 = !{null, !1358, !1551, !975}
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1552, size: 64, align: 64)
!1552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1553, size: 64, align: 32, elements: !1201)
!1553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1253)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "mul_pair_single", scope: !1545, file: !1544, line: 34, baseType: !1555, size: 64, align: 64, offset: 64)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1556 = !DISubroutineType(types: !1557)
!1557 = !{null, !1558, !1558, !1358, !975}
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 64, align: 32, elements: !1201)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "hybrid_analysis", scope: !1545, file: !1544, line: 36, baseType: !1561, size: 64, align: 64, offset: 128)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{null, !1558, !1558, !1564, !1567, !975}
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1553, size: 512, align: 32, elements: !1566)
!1566 = !{!1141, !1202}
!1567 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1568, line: 149, baseType: !1132)
!1568 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "hybrid_analysis_ileave", scope: !1545, file: !1544, line: 39, baseType: !1570, size: 64, align: 64, offset: 192)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DISubroutineType(types: !1572)
!1572 = !{null, !1573, !1576, !975, !975}
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 2048, align: 32, elements: !1575)
!1575 = !{!1187, !1202}
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 77824, align: 32, elements: !1578)
!1578 = !{!1452, !1453}
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "hybrid_synthesis_deint", scope: !1545, file: !1544, line: 41, baseType: !1580, size: 64, align: 64, offset: 256)
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1581, size: 64, align: 64)
!1581 = !DISubroutineType(types: !1582)
!1582 = !{null, !1576, !1573, !975, !975}
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "decorrelate", scope: !1545, file: !1544, line: 43, baseType: !1584, size: 64, align: 64, offset: 320)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = !DISubroutineType(types: !1586)
!1586 = !{null, !1558, !1558, !1587, !1590, !1551, !1590, !1253, !975}
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64, align: 64)
!1588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 2368, align: 32, elements: !1589)
!1589 = !{!1523, !1202}
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "stereo_interpolate", scope: !1545, file: !1544, line: 49, baseType: !1592, size: 128, align: 64, offset: 384)
!1592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1593, size: 128, align: 64, elements: !1201)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DISubroutineType(types: !1595)
!1595 = !{null, !1558, !1558, !1596, !1596, !975}
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 128, align: 32, elements: !1135)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1375, file: !1374, line: 169, baseType: !1404, size: 64, align: 32, offset: 2481152)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "n_q", scope: !1375, file: !1374, line: 171, baseType: !1400, size: 32, align: 32, offset: 2481216)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "n_lim", scope: !1375, file: !1374, line: 173, baseType: !1400, size: 32, align: 32, offset: 2481248)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "f_master", scope: !1375, file: !1374, line: 175, baseType: !1602, size: 784, align: 16, offset: 2481280)
!1602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 784, align: 16, elements: !1603)
!1603 = !{!1604}
!1604 = !DISubrange(count: 49)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablelow", scope: !1375, file: !1374, line: 177, baseType: !1606, size: 400, align: 16, offset: 2482064)
!1606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 400, align: 16, elements: !1607)
!1607 = !{!1608}
!1608 = !DISubrange(count: 25)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablehigh", scope: !1375, file: !1374, line: 179, baseType: !1602, size: 784, align: 16, offset: 2482464)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablenoise", scope: !1375, file: !1374, line: 181, baseType: !1611, size: 96, align: 16, offset: 2483248)
!1611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 96, align: 16, elements: !1500)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablelim", scope: !1375, file: !1374, line: 183, baseType: !1613, size: 480, align: 16, offset: 2483344)
!1613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 480, align: 16, elements: !1614)
!1614 = !{!1615}
!1615 = !DISubrange(count: 30)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "num_patches", scope: !1375, file: !1374, line: 184, baseType: !1400, size: 32, align: 32, offset: 2483840)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "patch_num_subbands", scope: !1375, file: !1374, line: 185, baseType: !1618, size: 48, align: 8, offset: 2483872)
!1618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 48, align: 8, elements: !1500)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "patch_start_subband", scope: !1375, file: !1374, line: 186, baseType: !1618, size: 48, align: 8, offset: 2483920)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "X_low", scope: !1375, file: !1374, line: 188, baseType: !1621, size: 81920, align: 32, offset: 2483968)
!1621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 81920, align: 32, elements: !1622)
!1622 = !{!1187, !1258, !1202}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "X_high", scope: !1375, file: !1374, line: 190, baseType: !1624, size: 163840, align: 32, offset: 2565888)
!1624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 163840, align: 32, elements: !1625)
!1625 = !{!1453, !1258, !1202}
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !1375, file: !1374, line: 192, baseType: !1627, size: 311296, align: 32, offset: 2729728)
!1627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 311296, align: 32, elements: !1628)
!1628 = !{!1202, !1202, !1452, !1453}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "alpha0", scope: !1375, file: !1374, line: 194, baseType: !1630, size: 4096, align: 32, offset: 3041024)
!1630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 4096, align: 32, elements: !1631)
!1631 = !{!1453, !1202}
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "alpha1", scope: !1375, file: !1374, line: 196, baseType: !1630, size: 4096, align: 32, offset: 3045120)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "e_origmapped", scope: !1375, file: !1374, line: 198, baseType: !1634, size: 10752, align: 32, offset: 3049216)
!1634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1340, size: 10752, align: 32, elements: !1635)
!1635 = !{!1419, !1430}
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "q_mapped", scope: !1375, file: !1374, line: 200, baseType: !1634, size: 10752, align: 32, offset: 3059968)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "s_mapped", scope: !1375, file: !1374, line: 202, baseType: !1638, size: 2688, align: 8, offset: 3070720)
!1638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 2688, align: 8, elements: !1635)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "e_curr", scope: !1375, file: !1374, line: 204, baseType: !1634, size: 10752, align: 32, offset: 3073408)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "q_m", scope: !1375, file: !1374, line: 206, baseType: !1634, size: 10752, align: 32, offset: 3084160)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "s_m", scope: !1375, file: !1374, line: 208, baseType: !1634, size: 10752, align: 32, offset: 3094912)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1375, file: !1374, line: 209, baseType: !1634, size: 10752, align: 32, offset: 3105664)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_filter_scratch", scope: !1375, file: !1374, line: 210, baseType: !1644, size: 10240, align: 32, offset: 3116544)
!1644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 10240, align: 32, elements: !1645)
!1645 = !{!1402, !1453}
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_ana", scope: !1375, file: !1374, line: 211, baseType: !1031, size: 896, align: 64, offset: 3126784)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "mdct", scope: !1375, file: !1374, line: 212, baseType: !1031, size: 896, align: 64, offset: 3127680)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "dsp", scope: !1375, file: !1374, line: 213, baseType: !1649, size: 896, align: 64, offset: 3128576)
!1649 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBRDSPContext", file: !1650, line: 45, baseType: !1651)
!1650 = !DIFile(filename: "./libavcodec/sbrdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SBRDSPContext", file: !1650, line: 28, size: 896, align: 64, elements: !1652)
!1652 = !{!1653, !1657, !1661, !1662, !1663, !1667, !1671, !1675, !1682, !1686, !1696}
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "sum64x5", scope: !1651, file: !1650, line: 29, baseType: !1654, size: 64, align: 64)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DISubroutineType(types: !1656)
!1656 = !{null, !1358}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "sum_square", scope: !1651, file: !1650, line: 30, baseType: !1658, size: 64, align: 64, offset: 64)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DISubroutineType(types: !1660)
!1660 = !{!1340, !1558, !975}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "neg_odd_64", scope: !1651, file: !1650, line: 31, baseType: !1654, size: 64, align: 64, offset: 128)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_pre_shuffle", scope: !1651, file: !1650, line: 32, baseType: !1654, size: 64, align: 64, offset: 192)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_post_shuffle", scope: !1651, file: !1650, line: 33, baseType: !1664, size: 64, align: 64, offset: 256)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64, align: 64)
!1665 = !DISubroutineType(types: !1666)
!1666 = !{null, !1558, !1590}
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_deint_neg", scope: !1651, file: !1650, line: 34, baseType: !1668, size: 64, align: 64, offset: 320)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DISubroutineType(types: !1670)
!1670 = !{null, !1358, !1590}
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_deint_bfly", scope: !1651, file: !1650, line: 35, baseType: !1672, size: 64, align: 64, offset: 384)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DISubroutineType(types: !1674)
!1674 = !{null, !1358, !1590, !1590}
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "autocorrelate", scope: !1651, file: !1650, line: 36, baseType: !1676, size: 64, align: 64, offset: 448)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DISubroutineType(types: !1678)
!1678 = !{null, !1551, !1679}
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1340, size: 128, align: 32, elements: !1681)
!1681 = !{!1202, !1202}
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "hf_gen", scope: !1651, file: !1650, line: 37, baseType: !1683, size: 64, align: 64, offset: 512)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64, align: 64)
!1684 = !DISubroutineType(types: !1685)
!1685 = !{null, !1558, !1551, !1590, !1590, !1253, !975, !975}
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "hf_g_filt", scope: !1651, file: !1650, line: 40, baseType: !1687, size: 64, align: 64, offset: 576)
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64, align: 64)
!1688 = !DISubroutineType(types: !1689)
!1689 = !{null, !1558, !1690, !1693, !975, !1695}
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1553, size: 2560, align: 32, elements: !1692)
!1692 = !{!1258, !1202}
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64, align: 64)
!1694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1340)
!1695 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !1020, line: 119, baseType: !1132)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "hf_apply_noise", scope: !1651, file: !1650, line: 42, baseType: !1697, size: 256, align: 64, offset: 640)
!1697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1698, size: 256, align: 64, elements: !1135)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
!1699 = !DISubroutineType(types: !1700)
!1700 = !{null, !1558, !1693, !1693, !975, !975, !975}
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1375, file: !1374, line: 214, baseType: !1702, size: 256, align: 64, offset: 3129472)
!1702 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACSBRContext", file: !1374, line: 134, baseType: !1703)
!1703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACSBRContext", file: !1374, line: 120, size: 256, align: 64, elements: !1704)
!1704 = !{!1705, !2515, !2521, !2527}
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "sbr_lf_gen", scope: !1703, file: !1374, line: 121, baseType: !1706, size: 64, align: 64)
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64, align: 64)
!1707 = !DISubroutineType(types: !1708)
!1708 = !{!975, !1709, !2509, !2510, !2512, !975}
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1710 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACContext", file: !1374, line: 37, baseType: !1711)
!1711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACContext", file: !44, line: 293, size: 62208, align: 256, elements: !1712)
!1712 = !{!1713, !1714, !2381, !2382, !2383, !2400, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2442, !2443, !2444, !2445, !2446, !2449, !2450, !2451, !2453, !2482, !2483, !2484, !2485, !2489, !2490, !2496, !2500, !2501, !2505}
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1711, file: !44, line: 294, baseType: !957, size: 64, align: 64)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1711, file: !44, line: 295, baseType: !1715, size: 64, align: 64, offset: 64)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64, align: 64)
!1716 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !85, line: 3360, baseType: !1717)
!1717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !85, line: 1556, size: 8448, align: 64, elements: !1718)
!1718 = !{!1719, !1722, !1723, !1724, !1981, !1982, !1983, !1984, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2137, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2246, !2247, !2248, !2249, !2250, !2251, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2319, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2335, !2336, !2337, !2338, !2339, !2340, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380}
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1717, file: !85, line: 1561, baseType: !1720, size: 64, align: 64)
!1720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1721, size: 64, align: 64)
!1721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1717, file: !85, line: 1562, baseType: !975, size: 32, align: 32, offset: 64)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1717, file: !85, line: 1564, baseType: !74, size: 32, align: 32, offset: 96)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1717, file: !85, line: 1565, baseType: !1725, size: 64, align: 64, offset: 128)
!1725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1726, size: 64, align: 64)
!1726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1727)
!1727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !85, line: 3468, size: 1984, align: 64, elements: !1728)
!1728 = !{!1729, !1730, !1731, !1732, !1733, !1734, !1743, !1746, !1749, !1752, !1757, !1758, !1759, !1767, !1768, !1769, !1771, !1775, !1781, !1790, !1794, !1795, !1834, !1952, !1956, !1957, !1961, !1965, !1970, !1974, !1975, !1976}
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1727, file: !85, line: 3475, baseType: !962, size: 64, align: 64)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1727, file: !85, line: 3480, baseType: !962, size: 64, align: 64, offset: 64)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1727, file: !85, line: 3481, baseType: !74, size: 32, align: 32, offset: 128)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1727, file: !85, line: 3482, baseType: !84, size: 32, align: 32, offset: 160)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1727, file: !85, line: 3487, baseType: !975, size: 32, align: 32, offset: 192)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1727, file: !85, line: 3488, baseType: !1735, size: 64, align: 64, offset: 256)
!1735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1736, size: 64, align: 64)
!1736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1737)
!1737 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1738, line: 61, baseType: !1739)
!1738 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1738, line: 58, size: 64, align: 32, elements: !1740)
!1740 = !{!1741, !1742}
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1739, file: !1738, line: 59, baseType: !975, size: 32, align: 32)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1739, file: !1738, line: 60, baseType: !975, size: 32, align: 32, offset: 32)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1727, file: !85, line: 3489, baseType: !1744, size: 64, align: 64, offset: 320)
!1744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1745, size: 64, align: 64)
!1745 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1727, file: !85, line: 3490, baseType: !1747, size: 64, align: 64, offset: 384)
!1747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1748, size: 64, align: 64)
!1748 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1727, file: !85, line: 3491, baseType: !1750, size: 64, align: 64, offset: 448)
!1750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1751, size: 64, align: 64)
!1751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !744)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1727, file: !85, line: 3492, baseType: !1753, size: 64, align: 64, offset: 512)
!1753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1754, size: 64, align: 64)
!1754 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1755)
!1755 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1020, line: 55, baseType: !1756)
!1756 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1727, file: !85, line: 3493, baseType: !1025, size: 8, align: 8, offset: 576)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1727, file: !85, line: 3494, baseType: !1720, size: 64, align: 64, offset: 640)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1727, file: !85, line: 3495, baseType: !1760, size: 64, align: 64, offset: 704)
!1760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1761, size: 64, align: 64)
!1761 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1762)
!1762 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !85, line: 3404, baseType: !1763)
!1763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !85, line: 3401, size: 128, align: 64, elements: !1764)
!1764 = !{!1765, !1766}
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1763, file: !85, line: 3402, baseType: !975, size: 32, align: 32)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1763, file: !85, line: 3403, baseType: !962, size: 64, align: 64, offset: 64)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1727, file: !85, line: 3507, baseType: !962, size: 64, align: 64, offset: 768)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1727, file: !85, line: 3516, baseType: !975, size: 32, align: 32, offset: 832)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1727, file: !85, line: 3517, baseType: !1770, size: 64, align: 64, offset: 896)
!1770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1727, size: 64, align: 64)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1727, file: !85, line: 3527, baseType: !1772, size: 64, align: 64, offset: 960)
!1772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1773, size: 64, align: 64)
!1773 = !DISubroutineType(types: !1774)
!1774 = !{!975, !1715}
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1727, file: !85, line: 3535, baseType: !1776, size: 64, align: 64, offset: 1024)
!1776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1777, size: 64, align: 64)
!1777 = !DISubroutineType(types: !1778)
!1778 = !{!975, !1715, !1779}
!1779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1780, size: 64, align: 64)
!1780 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1716)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1727, file: !85, line: 3541, baseType: !1782, size: 64, align: 64, offset: 1088)
!1782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1783, size: 64, align: 64)
!1783 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1784)
!1784 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !85, line: 3461, baseType: !1785)
!1785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1786, line: 223, size: 128, align: 64, elements: !1787)
!1786 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1787 = !{!1788, !1789}
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1785, file: !1786, line: 224, baseType: !1206, size: 64, align: 64)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1785, file: !1786, line: 225, baseType: !1206, size: 64, align: 64, offset: 64)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1727, file: !85, line: 3549, baseType: !1791, size: 64, align: 64, offset: 1152)
!1791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1792, size: 64, align: 64)
!1792 = !DISubroutineType(types: !1793)
!1793 = !{null, !1770}
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1727, file: !85, line: 3551, baseType: !1772, size: 64, align: 64, offset: 1216)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1727, file: !85, line: 3552, baseType: !1796, size: 64, align: 64, offset: 1280)
!1796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1797, size: 64, align: 64)
!1797 = !DISubroutineType(types: !1798)
!1798 = !{!975, !1715, !1024, !975, !1799}
!1799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1800, size: 64, align: 64)
!1800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1801)
!1801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !85, line: 3920, size: 256, align: 64, elements: !1802)
!1802 = !{!1803, !1804, !1805, !1806, !1807, !1833}
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1801, file: !85, line: 3921, baseType: !1039, size: 16, align: 16)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1801, file: !85, line: 3922, baseType: !1019, size: 32, align: 32, offset: 32)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1801, file: !85, line: 3923, baseType: !1019, size: 32, align: 32, offset: 64)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1801, file: !85, line: 3924, baseType: !1021, size: 32, align: 32, offset: 96)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1801, file: !85, line: 3925, baseType: !1808, size: 64, align: 64, offset: 128)
!1808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1809, size: 64, align: 64)
!1809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1810, size: 64, align: 64)
!1810 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !85, line: 3918, baseType: !1811)
!1811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !85, line: 3885, size: 1600, align: 64, elements: !1812)
!1812 = !{!1813, !1814, !1815, !1816, !1817, !1818, !1825, !1827, !1828, !1829, !1831, !1832}
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1811, file: !85, line: 3886, baseType: !975, size: 32, align: 32)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1811, file: !85, line: 3887, baseType: !975, size: 32, align: 32, offset: 32)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1811, file: !85, line: 3888, baseType: !975, size: 32, align: 32, offset: 64)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1811, file: !85, line: 3889, baseType: !975, size: 32, align: 32, offset: 96)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1811, file: !85, line: 3890, baseType: !975, size: 32, align: 32, offset: 128)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1811, file: !85, line: 3897, baseType: !1819, size: 768, align: 64, offset: 192)
!1819 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !85, line: 3858, baseType: !1820)
