; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--h263dec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--h263dec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type opaque

!867 = !DIFile(filename: "./libavutil/samplefmt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!868 = !{!869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882}
!869 = !DIEnumerator(name: "AV_SAMPLE_FMT_NONE", value: -1)
!870 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8", value: 0)
!871 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16", value: 1)
!872 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32", value: 2)
!873 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLT", value: 3)
!874 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBL", value: 4)
!875 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8P", value: 5)
!876 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16P", value: 6)
!877 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32P", value: 7)
!878 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLTP", value: 8)
!879 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBLP", value: 9)
!880 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64", value: 10)
!881 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64P", value: 11)
!882 = !DIEnumerator(name: "AV_SAMPLE_FMT_NB", value: 12)
!883 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !47, line: 3865, size: 32, align: 32, elements: !884)
!884 = !{!885, !886, !887, !888}
!885 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!886 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!887 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!888 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !47, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !47, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !47, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !47, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !{!939, !2103}
!939 = distinct !DIGlobalVariable(name: "ff_h263_demuxer", scope: !0, file: !940, line: 78, type: !941, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_h263_demuxer)
!940 = !DIFile(filename: "libavformat/h263dec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !943)
!943 = !{!944, !948, !949, !951, !952, !958, !1041, !1042, !1044, !1045, !1046, !1060, !2084, !2085, !2086, !2090, !2094, !2095, !2096, !2100, !2101, !2102}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !942, file: !919, line: 638, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !942, file: !919, line: 645, baseType: !945, size: 64, align: 64, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !942, file: !919, line: 652, baseType: !950, size: 32, align: 32, offset: 128)
!950 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !942, file: !919, line: 659, baseType: !945, size: 64, align: 64, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !942, file: !919, line: 661, baseType: !953, size: 64, align: 64, offset: 256)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !919, line: 443, flags: DIFlagFwdDecl)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !942, file: !919, line: 663, baseType: !959, size: 64, align: 64, offset: 320)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !963)
!963 = !{!964, !965, !970, !1000, !1001, !1002, !1003, !1007, !1013, !1015, !1019}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !962, file: !26, line: 72, baseType: !945, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !962, file: !26, line: 78, baseType: !966, size: 64, align: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!945, !969}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !962, file: !26, line: 85, baseType: !971, size: 64, align: 64, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !974)
!974 = !{!975, !976, !977, !978, !979, !996, !997, !998, !999}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !973, file: !4, line: 247, baseType: !945, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !973, file: !4, line: 253, baseType: !945, size: 64, align: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !973, file: !4, line: 259, baseType: !950, size: 32, align: 32, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !973, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !973, file: !4, line: 271, baseType: !980, size: 64, align: 64, offset: 192)
!980 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !973, file: !4, line: 265, size: 64, align: 64, elements: !981)
!981 = !{!982, !986, !988, !989}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !980, file: !4, line: 266, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !984, line: 40, baseType: !985)
!984 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!985 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !980, file: !4, line: 267, baseType: !987, size: 64, align: 64)
!987 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !980, file: !4, line: 268, baseType: !945, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !980, file: !4, line: 270, baseType: !990, size: 64, align: 32)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !991, line: 61, baseType: !992)
!991 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !991, line: 58, size: 64, align: 32, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !992, file: !991, line: 59, baseType: !950, size: 32, align: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !992, file: !991, line: 60, baseType: !950, size: 32, align: 32, offset: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !973, file: !4, line: 272, baseType: !987, size: 64, align: 64, offset: 256)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !973, file: !4, line: 273, baseType: !987, size: 64, align: 64, offset: 320)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !973, file: !4, line: 275, baseType: !950, size: 32, align: 32, offset: 384)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !973, file: !4, line: 300, baseType: !945, size: 64, align: 64, offset: 448)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !962, file: !26, line: 93, baseType: !950, size: 32, align: 32, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !962, file: !26, line: 99, baseType: !950, size: 32, align: 32, offset: 224)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !962, file: !26, line: 108, baseType: !950, size: 32, align: 32, offset: 256)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !962, file: !26, line: 113, baseType: !1004, size: 64, align: 64, offset: 320)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!969, !969, !969}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !962, file: !26, line: 123, baseType: !1008, size: 64, align: 64, offset: 384)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!1011, !1011}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !962, file: !26, line: 130, baseType: !1014, size: 32, align: 32, offset: 448)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !962, file: !26, line: 136, baseType: !1016, size: 64, align: 64, offset: 512)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!1014, !969}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !962, file: !26, line: 142, baseType: !1020, size: 64, align: 64, offset: 576)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!950, !1023, !969, !945, !950}
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1026)
!1026 = !{!1027, !1039, !1040}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1025, file: !4, line: 360, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1036, !1037, !1038}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1031, file: !4, line: 307, baseType: !945, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1031, file: !4, line: 313, baseType: !987, size: 64, align: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1031, file: !4, line: 313, baseType: !987, size: 64, align: 64, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1031, file: !4, line: 318, baseType: !987, size: 64, align: 64, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1031, file: !4, line: 318, baseType: !987, size: 64, align: 64, offset: 256)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1031, file: !4, line: 323, baseType: !950, size: 32, align: 32, offset: 320)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1025, file: !4, line: 364, baseType: !950, size: 32, align: 32, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1025, file: !4, line: 368, baseType: !950, size: 32, align: 32, offset: 96)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !942, file: !919, line: 670, baseType: !945, size: 64, align: 64, offset: 384)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !942, file: !919, line: 679, baseType: !1043, size: 64, align: 64, offset: 448)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !942, file: !919, line: 684, baseType: !950, size: 32, align: 32, offset: 512)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !942, file: !919, line: 689, baseType: !950, size: 32, align: 32, offset: 544)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !942, file: !919, line: 696, baseType: !1047, size: 64, align: 64, offset: 576)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!950, !1050}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1053)
!1053 = !{!1054, !1055, !1058, !1059}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1052, file: !919, line: 449, baseType: !945, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1052, file: !919, line: 450, baseType: !1056, size: 64, align: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1052, file: !919, line: 451, baseType: !950, size: 32, align: 32, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1052, file: !919, line: 452, baseType: !945, size: 64, align: 64, offset: 192)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !942, file: !919, line: 703, baseType: !1061, size: 64, align: 64, offset: 640)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!950, !1064}
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1066)
!1066 = !{!1067, !1068, !1069, !1262, !1263, !1328, !1329, !1330, !1961, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2015, !2016, !2017, !2018, !2019, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2050, !2051, !2054, !2055, !2056, !2057, !2058, !2059, !2061, !2062, !2063, !2064, !2072, !2073, !2077, !2081, !2082, !2083}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1065, file: !919, line: 1342, baseType: !959, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1065, file: !919, line: 1349, baseType: !1043, size: 64, align: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1065, file: !919, line: 1356, baseType: !1070, size: 64, align: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1126, !1127, !1131, !1135, !1140, !1147, !1237, !1243, !1249, !1250, !1251, !1252, !1256}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1071, file: !919, line: 498, baseType: !945, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1071, file: !919, line: 504, baseType: !945, size: 64, align: 64, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1071, file: !919, line: 505, baseType: !945, size: 64, align: 64, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1071, file: !919, line: 506, baseType: !945, size: 64, align: 64, offset: 192)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1071, file: !919, line: 508, baseType: !46, size: 32, align: 32, offset: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1071, file: !919, line: 509, baseType: !46, size: 32, align: 32, offset: 288)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1071, file: !919, line: 510, baseType: !46, size: 32, align: 32, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1071, file: !919, line: 517, baseType: !950, size: 32, align: 32, offset: 352)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1071, file: !919, line: 523, baseType: !953, size: 64, align: 64, offset: 384)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1071, file: !919, line: 526, baseType: !959, size: 64, align: 64, offset: 448)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1071, file: !919, line: 535, baseType: !1070, size: 64, align: 64, offset: 512)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1071, file: !919, line: 539, baseType: !950, size: 32, align: 32, offset: 576)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1071, file: !919, line: 541, baseType: !1061, size: 64, align: 64, offset: 640)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1071, file: !919, line: 549, baseType: !1087, size: 64, align: 64, offset: 704)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!950, !1064, !1090}
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !47, line: 1499, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !47, line: 1445, size: 704, align: 64, elements: !1093)
!1093 = !{!1094, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1122, !1123, !1124, !1125}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1092, file: !47, line: 1451, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1097, line: 94, baseType: !1098)
!1097 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1097, line: 81, size: 192, align: 64, elements: !1099)
!1099 = !{!1100, !1104, !1107}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1098, file: !1097, line: 82, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1097, line: 73, baseType: !1103)
!1103 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1097, line: 73, flags: DIFlagFwdDecl)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1098, file: !1097, line: 89, baseType: !1105, size: 64, align: 64, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !984, line: 48, baseType: !1057)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1098, file: !1097, line: 93, baseType: !950, size: 32, align: 32, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1092, file: !47, line: 1461, baseType: !983, size: 64, align: 64, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1092, file: !47, line: 1467, baseType: !983, size: 64, align: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1092, file: !47, line: 1468, baseType: !1105, size: 64, align: 64, offset: 192)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1092, file: !47, line: 1469, baseType: !950, size: 32, align: 32, offset: 256)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1092, file: !47, line: 1470, baseType: !950, size: 32, align: 32, offset: 288)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1092, file: !47, line: 1474, baseType: !950, size: 32, align: 32, offset: 320)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1092, file: !47, line: 1479, baseType: !1115, size: 64, align: 64, offset: 384)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !47, line: 1415, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !47, line: 1411, size: 128, align: 64, elements: !1118)
!1118 = !{!1119, !1120, !1121}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1117, file: !47, line: 1412, baseType: !1105, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1117, file: !47, line: 1413, baseType: !950, size: 32, align: 32, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1117, file: !47, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1092, file: !47, line: 1480, baseType: !950, size: 32, align: 32, offset: 448)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1092, file: !47, line: 1486, baseType: !983, size: 64, align: 64, offset: 512)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1092, file: !47, line: 1488, baseType: !983, size: 64, align: 64, offset: 576)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1092, file: !47, line: 1497, baseType: !983, size: 64, align: 64, offset: 640)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1071, file: !919, line: 550, baseType: !1061, size: 64, align: 64, offset: 768)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1071, file: !919, line: 554, baseType: !1128, size: 64, align: 64, offset: 832)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!950, !1064, !1090, !1090, !950}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1071, file: !919, line: 563, baseType: !1132, size: 64, align: 64, offset: 896)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!950, !46, !950}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1071, file: !919, line: 565, baseType: !1136, size: 64, align: 64, offset: 960)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{null, !1064, !950, !1139, !1139}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1071, file: !919, line: 570, baseType: !1141, size: 64, align: 64, offset: 1024)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!950, !1064, !950, !969, !1144}
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1145, line: 216, baseType: !1146)
!1145 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1146 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1071, file: !919, line: 581, baseType: !1148, size: 64, align: 64, offset: 1088)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!950, !1064, !950, !1151, !1236}
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1155)
!1155 = !{!1156, !1160, !1162, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1190, !1192, !1193, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1154, file: !548, line: 282, baseType: !1157, size: 512, align: 64)
!1157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1105, size: 512, align: 64, elements: !1158)
!1158 = !{!1159}
!1159 = !DISubrange(count: 8)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1154, file: !548, line: 299, baseType: !1161, size: 256, align: 32, offset: 512)
!1161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 256, align: 32, elements: !1158)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1154, file: !548, line: 315, baseType: !1163, size: 64, align: 64, offset: 768)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1154, file: !548, line: 326, baseType: !950, size: 32, align: 32, offset: 832)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1154, file: !548, line: 326, baseType: !950, size: 32, align: 32, offset: 864)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1154, file: !548, line: 334, baseType: !950, size: 32, align: 32, offset: 896)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1154, file: !548, line: 341, baseType: !950, size: 32, align: 32, offset: 928)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1154, file: !548, line: 346, baseType: !950, size: 32, align: 32, offset: 960)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1154, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1154, file: !548, line: 356, baseType: !990, size: 64, align: 32, offset: 1024)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1154, file: !548, line: 361, baseType: !983, size: 64, align: 64, offset: 1088)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1154, file: !548, line: 369, baseType: !983, size: 64, align: 64, offset: 1152)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1154, file: !548, line: 377, baseType: !983, size: 64, align: 64, offset: 1216)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1154, file: !548, line: 382, baseType: !950, size: 32, align: 32, offset: 1280)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1154, file: !548, line: 386, baseType: !950, size: 32, align: 32, offset: 1312)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1154, file: !548, line: 391, baseType: !950, size: 32, align: 32, offset: 1344)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1154, file: !548, line: 396, baseType: !969, size: 64, align: 64, offset: 1408)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1154, file: !548, line: 403, baseType: !1179, size: 512, align: 64, offset: 1472)
!1179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1180, size: 512, align: 64, elements: !1158)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !984, line: 55, baseType: !1146)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1154, file: !548, line: 410, baseType: !950, size: 32, align: 32, offset: 1984)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1154, file: !548, line: 415, baseType: !950, size: 32, align: 32, offset: 2016)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1154, file: !548, line: 420, baseType: !950, size: 32, align: 32, offset: 2048)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1154, file: !548, line: 425, baseType: !950, size: 32, align: 32, offset: 2080)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1154, file: !548, line: 435, baseType: !983, size: 64, align: 64, offset: 2112)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1154, file: !548, line: 440, baseType: !950, size: 32, align: 32, offset: 2176)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1154, file: !548, line: 445, baseType: !1180, size: 64, align: 64, offset: 2240)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1154, file: !548, line: 459, baseType: !1189, size: 512, align: 64, offset: 2304)
!1189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1095, size: 512, align: 64, elements: !1158)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1154, file: !548, line: 473, baseType: !1191, size: 64, align: 64, offset: 2816)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1154, file: !548, line: 477, baseType: !950, size: 32, align: 32, offset: 2880)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1154, file: !548, line: 479, baseType: !1194, size: 64, align: 64, offset: 2944)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1197)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1198)
!1198 = !{!1199, !1200, !1201, !1202, !1207}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1197, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1197, file: !548, line: 203, baseType: !1105, size: 64, align: 64, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1197, file: !548, line: 204, baseType: !950, size: 32, align: 32, offset: 128)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1197, file: !548, line: 205, baseType: !1203, size: 64, align: 64, offset: 192)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1205, line: 86, baseType: !1206)
!1205 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1206 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1205, line: 86, flags: DIFlagFwdDecl)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1197, file: !548, line: 206, baseType: !1095, size: 64, align: 64, offset: 256)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1154, file: !548, line: 480, baseType: !950, size: 32, align: 32, offset: 3008)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1154, file: !548, line: 505, baseType: !950, size: 32, align: 32, offset: 3040)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1154, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1154, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1154, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1154, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1154, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1154, file: !548, line: 532, baseType: !983, size: 64, align: 64, offset: 3264)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1154, file: !548, line: 539, baseType: !983, size: 64, align: 64, offset: 3328)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1154, file: !548, line: 547, baseType: !983, size: 64, align: 64, offset: 3392)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1154, file: !548, line: 554, baseType: !1203, size: 64, align: 64, offset: 3456)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1154, file: !548, line: 563, baseType: !950, size: 32, align: 32, offset: 3520)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1154, file: !548, line: 572, baseType: !950, size: 32, align: 32, offset: 3552)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1154, file: !548, line: 581, baseType: !950, size: 32, align: 32, offset: 3584)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1154, file: !548, line: 588, baseType: !1223, size: 64, align: 64, offset: 3648)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !984, line: 36, baseType: !1225)
!1225 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1154, file: !548, line: 593, baseType: !950, size: 32, align: 32, offset: 3712)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1154, file: !548, line: 596, baseType: !950, size: 32, align: 32, offset: 3744)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1154, file: !548, line: 599, baseType: !1095, size: 64, align: 64, offset: 3776)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1154, file: !548, line: 605, baseType: !1095, size: 64, align: 64, offset: 3840)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1154, file: !548, line: 616, baseType: !1095, size: 64, align: 64, offset: 3904)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1154, file: !548, line: 626, baseType: !1144, size: 64, align: 64, offset: 3968)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1154, file: !548, line: 627, baseType: !1144, size: 64, align: 64, offset: 4032)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1154, file: !548, line: 628, baseType: !1144, size: 64, align: 64, offset: 4096)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1154, file: !548, line: 629, baseType: !1144, size: 64, align: 64, offset: 4160)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1154, file: !548, line: 645, baseType: !1095, size: 64, align: 64, offset: 4224)
!1236 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1071, file: !919, line: 587, baseType: !1238, size: 64, align: 64, offset: 1152)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!950, !1064, !1241}
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1071, file: !919, line: 592, baseType: !1244, size: 64, align: 64, offset: 1216)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!950, !1064, !1247}
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1071, file: !919, line: 597, baseType: !1244, size: 64, align: 64, offset: 1280)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1071, file: !919, line: 598, baseType: !46, size: 32, align: 32, offset: 1344)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1071, file: !919, line: 608, baseType: !1061, size: 64, align: 64, offset: 1408)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1071, file: !919, line: 617, baseType: !1253, size: 64, align: 64, offset: 1472)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{null, !1064}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1071, file: !919, line: 623, baseType: !1257, size: 64, align: 64, offset: 1536)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{!950, !1064, !1260}
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1091)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1065, file: !919, line: 1365, baseType: !969, size: 64, align: 64, offset: 192)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1065, file: !919, line: 1379, baseType: !1264, size: 64, align: 64, offset: 256)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1266)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1267)
!1267 = !{!1268, !1269, !1270, !1271, !1272, !1273, !1274, !1278, !1279, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1295, !1296, !1300, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1318, !1319, !1320, !1321, !1325, !1326, !1327}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1266, file: !650, line: 174, baseType: !959, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1266, file: !650, line: 226, baseType: !1056, size: 64, align: 64, offset: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1266, file: !650, line: 227, baseType: !950, size: 32, align: 32, offset: 128)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1266, file: !650, line: 228, baseType: !1056, size: 64, align: 64, offset: 192)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1266, file: !650, line: 229, baseType: !1056, size: 64, align: 64, offset: 256)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1266, file: !650, line: 233, baseType: !969, size: 64, align: 64, offset: 320)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1266, file: !650, line: 235, baseType: !1275, size: 64, align: 64, offset: 384)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!950, !969, !1105, !950}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1266, file: !650, line: 236, baseType: !1275, size: 64, align: 64, offset: 448)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1266, file: !650, line: 237, baseType: !1280, size: 64, align: 64, offset: 512)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!983, !969, !983, !950}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1266, file: !650, line: 238, baseType: !983, size: 64, align: 64, offset: 576)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1266, file: !650, line: 239, baseType: !950, size: 32, align: 32, offset: 640)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1266, file: !650, line: 240, baseType: !950, size: 32, align: 32, offset: 672)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1266, file: !650, line: 241, baseType: !950, size: 32, align: 32, offset: 704)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1266, file: !650, line: 242, baseType: !1146, size: 64, align: 64, offset: 768)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1266, file: !650, line: 243, baseType: !1056, size: 64, align: 64, offset: 832)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1266, file: !650, line: 244, baseType: !1290, size: 64, align: 64, offset: 896)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!1146, !1146, !1293, !1236}
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1106)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1266, file: !650, line: 245, baseType: !950, size: 32, align: 32, offset: 960)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1266, file: !650, line: 249, baseType: !1297, size: 64, align: 64, offset: 1024)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{!950, !969, !950}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1266, file: !650, line: 255, baseType: !1301, size: 64, align: 64, offset: 1088)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!983, !969, !950, !983, !950}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1266, file: !650, line: 260, baseType: !950, size: 32, align: 32, offset: 1152)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1266, file: !650, line: 266, baseType: !983, size: 64, align: 64, offset: 1216)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1266, file: !650, line: 273, baseType: !950, size: 32, align: 32, offset: 1280)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1266, file: !650, line: 279, baseType: !983, size: 64, align: 64, offset: 1344)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1266, file: !650, line: 285, baseType: !950, size: 32, align: 32, offset: 1408)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1266, file: !650, line: 291, baseType: !950, size: 32, align: 32, offset: 1440)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1266, file: !650, line: 298, baseType: !950, size: 32, align: 32, offset: 1472)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1266, file: !650, line: 304, baseType: !950, size: 32, align: 32, offset: 1504)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1266, file: !650, line: 309, baseType: !945, size: 64, align: 64, offset: 1536)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1266, file: !650, line: 314, baseType: !945, size: 64, align: 64, offset: 1600)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1266, file: !650, line: 319, baseType: !1315, size: 64, align: 64, offset: 1664)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{!950, !969, !1105, !950, !649, !983}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1266, file: !650, line: 326, baseType: !950, size: 32, align: 32, offset: 1728)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1266, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1266, file: !650, line: 332, baseType: !983, size: 64, align: 64, offset: 1792)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1266, file: !650, line: 338, baseType: !1322, size: 64, align: 64, offset: 1856)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DISubroutineType(types: !1324)
!1324 = !{!950, !969}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1266, file: !650, line: 340, baseType: !983, size: 64, align: 64, offset: 1920)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1266, file: !650, line: 346, baseType: !1056, size: 64, align: 64, offset: 1984)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1266, file: !650, line: 351, baseType: !950, size: 32, align: 32, offset: 2048)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1065, file: !919, line: 1386, baseType: !950, size: 32, align: 32, offset: 320)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1065, file: !919, line: 1393, baseType: !1236, size: 32, align: 32, offset: 352)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1065, file: !919, line: 1405, baseType: !1331, size: 64, align: 64, offset: 384)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1334)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1335)
!1335 = !{!1336, !1337, !1338, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1809, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1909, !1915, !1916, !1920, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1952, !1953, !1954, !1955, !1956, !1957}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1334, file: !919, line: 866, baseType: !950, size: 32, align: 32)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1334, file: !919, line: 872, baseType: !950, size: 32, align: 32, offset: 32)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1334, file: !919, line: 878, baseType: !1339, size: 64, align: 64, offset: 64)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !47, line: 3360, baseType: !1341)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !47, line: 1556, size: 8448, align: 64, elements: !1342)
!1342 = !{!1343, !1344, !1345, !1346, !1484, !1485, !1486, !1487, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1513, !1517, !1518, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1697, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1341, file: !47, line: 1561, baseType: !959, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1341, file: !47, line: 1562, baseType: !950, size: 32, align: 32, offset: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1341, file: !47, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1341, file: !47, line: 1565, baseType: !1347, size: 64, align: 64, offset: 128)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1349)
!1349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !47, line: 3468, size: 1984, align: 64, elements: !1350)
!1350 = !{!1351, !1352, !1353, !1354, !1355, !1356, !1359, !1362, !1365, !1368, !1371, !1372, !1373, !1381, !1382, !1383, !1385, !1389, !1395, !1400, !1404, !1405, !1449, !1456, !1460, !1461, !1465, !1469, !1473, !1477, !1478, !1479}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1349, file: !47, line: 3475, baseType: !945, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1349, file: !47, line: 3480, baseType: !945, size: 64, align: 64, offset: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1349, file: !47, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1349, file: !47, line: 3482, baseType: !46, size: 32, align: 32, offset: 160)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1349, file: !47, line: 3487, baseType: !950, size: 32, align: 32, offset: 192)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1349, file: !47, line: 3488, baseType: !1357, size: 64, align: 64, offset: 256)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1349, file: !47, line: 3489, baseType: !1360, size: 64, align: 64, offset: 320)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1349, file: !47, line: 3490, baseType: !1363, size: 64, align: 64, offset: 384)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1349, file: !47, line: 3491, baseType: !1366, size: 64, align: 64, offset: 448)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1349, file: !47, line: 3492, baseType: !1369, size: 64, align: 64, offset: 512)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1180)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1349, file: !47, line: 3493, baseType: !1106, size: 8, align: 8, offset: 576)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1349, file: !47, line: 3494, baseType: !959, size: 64, align: 64, offset: 640)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1349, file: !47, line: 3495, baseType: !1374, size: 64, align: 64, offset: 704)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1376)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !47, line: 3404, baseType: !1377)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !47, line: 3401, size: 128, align: 64, elements: !1378)
!1378 = !{!1379, !1380}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1377, file: !47, line: 3402, baseType: !950, size: 32, align: 32)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1377, file: !47, line: 3403, baseType: !945, size: 64, align: 64, offset: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1349, file: !47, line: 3507, baseType: !945, size: 64, align: 64, offset: 768)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1349, file: !47, line: 3516, baseType: !950, size: 32, align: 32, offset: 832)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1349, file: !47, line: 3517, baseType: !1384, size: 64, align: 64, offset: 896)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1349, file: !47, line: 3527, baseType: !1386, size: 64, align: 64, offset: 960)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DISubroutineType(types: !1388)
!1388 = !{!950, !1339}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1349, file: !47, line: 3535, baseType: !1390, size: 64, align: 64, offset: 1024)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DISubroutineType(types: !1392)
!1392 = !{!950, !1339, !1393}
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1340)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1349, file: !47, line: 3541, baseType: !1396, size: 64, align: 64, offset: 1088)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1398)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !47, line: 3461, baseType: !1399)
!1399 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !47, line: 3461, flags: DIFlagFwdDecl)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1349, file: !47, line: 3549, baseType: !1401, size: 64, align: 64, offset: 1152)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DISubroutineType(types: !1403)
!1403 = !{null, !1384}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1349, file: !47, line: 3551, baseType: !1386, size: 64, align: 64, offset: 1216)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1349, file: !47, line: 3552, baseType: !1406, size: 64, align: 64, offset: 1280)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DISubroutineType(types: !1408)
!1408 = !{!950, !1339, !1105, !950, !1409}
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1411)
!1411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !47, line: 3920, size: 256, align: 64, elements: !1412)
!1412 = !{!1413, !1416, !1418, !1419, !1420, !1448}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1411, file: !47, line: 3921, baseType: !1414, size: 16, align: 16)
!1414 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !984, line: 49, baseType: !1415)
!1415 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1411, file: !47, line: 3922, baseType: !1417, size: 32, align: 32, offset: 32)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !984, line: 51, baseType: !1236)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1411, file: !47, line: 3923, baseType: !1417, size: 32, align: 32, offset: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1411, file: !47, line: 3924, baseType: !1236, size: 32, align: 32, offset: 96)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1411, file: !47, line: 3925, baseType: !1421, size: 64, align: 64, offset: 128)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !47, line: 3918, baseType: !1424)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !47, line: 3885, size: 1600, align: 64, elements: !1425)
!1425 = !{!1426, !1427, !1428, !1429, !1430, !1431, !1437, !1441, !1443, !1444, !1446, !1447}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1424, file: !47, line: 3886, baseType: !950, size: 32, align: 32)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1424, file: !47, line: 3887, baseType: !950, size: 32, align: 32, offset: 32)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1424, file: !47, line: 3888, baseType: !950, size: 32, align: 32, offset: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1424, file: !47, line: 3889, baseType: !950, size: 32, align: 32, offset: 96)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1424, file: !47, line: 3890, baseType: !950, size: 32, align: 32, offset: 128)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1424, file: !47, line: 3897, baseType: !1432, size: 768, align: 64, offset: 192)
!1432 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !47, line: 3858, baseType: !1433)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !47, line: 3853, size: 768, align: 64, elements: !1434)
!1434 = !{!1435, !1436}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1433, file: !47, line: 3855, baseType: !1157, size: 512, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1433, file: !47, line: 3857, baseType: !1161, size: 256, align: 32, offset: 512)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1424, file: !47, line: 3903, baseType: !1438, size: 256, align: 64, offset: 960)
!1438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1105, size: 256, align: 64, elements: !1439)
!1439 = !{!1440}
!1440 = !DISubrange(count: 4)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1424, file: !47, line: 3904, baseType: !1442, size: 128, align: 32, offset: 1216)
!1442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 128, align: 32, elements: !1439)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1424, file: !47, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1424, file: !47, line: 3908, baseType: !1445, size: 64, align: 64, offset: 1408)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1424, file: !47, line: 3915, baseType: !1445, size: 64, align: 64, offset: 1472)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1424, file: !47, line: 3917, baseType: !950, size: 32, align: 32, offset: 1536)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1411, file: !47, line: 3926, baseType: !983, size: 64, align: 64, offset: 192)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1349, file: !47, line: 3564, baseType: !1450, size: 64, align: 64, offset: 1344)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64, align: 64)
!1451 = !DISubroutineType(types: !1452)
!1452 = !{!950, !1339, !1090, !1453, !1455}
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1153)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1349, file: !47, line: 3566, baseType: !1457, size: 64, align: 64, offset: 1408)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!950, !1339, !969, !1455, !1090}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1349, file: !47, line: 3567, baseType: !1386, size: 64, align: 64, offset: 1472)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1349, file: !47, line: 3576, baseType: !1462, size: 64, align: 64, offset: 1536)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{!950, !1339, !1453}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1349, file: !47, line: 3577, baseType: !1466, size: 64, align: 64, offset: 1600)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DISubroutineType(types: !1468)
!1468 = !{!950, !1339, !1090}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1349, file: !47, line: 3584, baseType: !1470, size: 64, align: 64, offset: 1664)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{!950, !1339, !1152}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1349, file: !47, line: 3589, baseType: !1474, size: 64, align: 64, offset: 1728)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64, align: 64)
!1475 = !DISubroutineType(types: !1476)
!1476 = !{null, !1339}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1349, file: !47, line: 3594, baseType: !950, size: 32, align: 32, offset: 1792)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1349, file: !47, line: 3600, baseType: !945, size: 64, align: 64, offset: 1856)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1349, file: !47, line: 3609, baseType: !1480, size: 64, align: 64, offset: 1920)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1483)
!1483 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !47, line: 3609, flags: DIFlagFwdDecl)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1341, file: !47, line: 1566, baseType: !46, size: 32, align: 32, offset: 192)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1341, file: !47, line: 1581, baseType: !1236, size: 32, align: 32, offset: 224)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1341, file: !47, line: 1583, baseType: !969, size: 64, align: 64, offset: 256)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1341, file: !47, line: 1591, baseType: !1488, size: 64, align: 64, offset: 320)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !47, line: 1532, flags: DIFlagFwdDecl)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1341, file: !47, line: 1598, baseType: !969, size: 64, align: 64, offset: 384)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1341, file: !47, line: 1606, baseType: !983, size: 64, align: 64, offset: 448)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1341, file: !47, line: 1614, baseType: !950, size: 32, align: 32, offset: 512)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1341, file: !47, line: 1622, baseType: !950, size: 32, align: 32, offset: 544)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1341, file: !47, line: 1628, baseType: !950, size: 32, align: 32, offset: 576)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1341, file: !47, line: 1636, baseType: !950, size: 32, align: 32, offset: 608)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1341, file: !47, line: 1643, baseType: !950, size: 32, align: 32, offset: 640)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1341, file: !47, line: 1657, baseType: !1105, size: 64, align: 64, offset: 704)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1341, file: !47, line: 1658, baseType: !950, size: 32, align: 32, offset: 768)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1341, file: !47, line: 1679, baseType: !990, size: 64, align: 32, offset: 800)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1341, file: !47, line: 1688, baseType: !950, size: 32, align: 32, offset: 864)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1341, file: !47, line: 1712, baseType: !950, size: 32, align: 32, offset: 896)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1341, file: !47, line: 1729, baseType: !950, size: 32, align: 32, offset: 928)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1341, file: !47, line: 1729, baseType: !950, size: 32, align: 32, offset: 960)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1341, file: !47, line: 1744, baseType: !950, size: 32, align: 32, offset: 992)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1341, file: !47, line: 1744, baseType: !950, size: 32, align: 32, offset: 1024)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1341, file: !47, line: 1751, baseType: !950, size: 32, align: 32, offset: 1056)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1341, file: !47, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1341, file: !47, line: 1791, baseType: !1509, size: 64, align: 64, offset: 1152)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DISubroutineType(types: !1511)
!1511 = !{null, !1512, !1453, !1455, !950, !950, !950}
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1341, file: !47, line: 1808, baseType: !1514, size: 64, align: 64, offset: 1216)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DISubroutineType(types: !1516)
!1516 = !{!667, !1512, !1360}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1341, file: !47, line: 1816, baseType: !950, size: 32, align: 32, offset: 1280)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1341, file: !47, line: 1825, baseType: !1519, size: 32, align: 32, offset: 1312)
!1519 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1341, file: !47, line: 1830, baseType: !950, size: 32, align: 32, offset: 1344)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1341, file: !47, line: 1838, baseType: !1519, size: 32, align: 32, offset: 1376)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1341, file: !47, line: 1846, baseType: !950, size: 32, align: 32, offset: 1408)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1341, file: !47, line: 1851, baseType: !950, size: 32, align: 32, offset: 1440)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1341, file: !47, line: 1861, baseType: !1519, size: 32, align: 32, offset: 1472)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1341, file: !47, line: 1868, baseType: !1519, size: 32, align: 32, offset: 1504)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1341, file: !47, line: 1875, baseType: !1519, size: 32, align: 32, offset: 1536)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1341, file: !47, line: 1882, baseType: !1519, size: 32, align: 32, offset: 1568)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1341, file: !47, line: 1889, baseType: !1519, size: 32, align: 32, offset: 1600)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1341, file: !47, line: 1896, baseType: !1519, size: 32, align: 32, offset: 1632)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1341, file: !47, line: 1903, baseType: !1519, size: 32, align: 32, offset: 1664)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1341, file: !47, line: 1910, baseType: !950, size: 32, align: 32, offset: 1696)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1341, file: !47, line: 1915, baseType: !950, size: 32, align: 32, offset: 1728)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1341, file: !47, line: 1926, baseType: !1455, size: 64, align: 64, offset: 1792)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1341, file: !47, line: 1935, baseType: !990, size: 64, align: 32, offset: 1856)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1341, file: !47, line: 1942, baseType: !950, size: 32, align: 32, offset: 1920)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1341, file: !47, line: 1948, baseType: !950, size: 32, align: 32, offset: 1952)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1341, file: !47, line: 1954, baseType: !950, size: 32, align: 32, offset: 1984)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1341, file: !47, line: 1960, baseType: !950, size: 32, align: 32, offset: 2016)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1341, file: !47, line: 1984, baseType: !950, size: 32, align: 32, offset: 2048)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1341, file: !47, line: 1991, baseType: !950, size: 32, align: 32, offset: 2080)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1341, file: !47, line: 1996, baseType: !950, size: 32, align: 32, offset: 2112)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1341, file: !47, line: 2004, baseType: !950, size: 32, align: 32, offset: 2144)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1341, file: !47, line: 2011, baseType: !950, size: 32, align: 32, offset: 2176)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1341, file: !47, line: 2018, baseType: !950, size: 32, align: 32, offset: 2208)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1341, file: !47, line: 2027, baseType: !950, size: 32, align: 32, offset: 2240)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1341, file: !47, line: 2034, baseType: !950, size: 32, align: 32, offset: 2272)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1341, file: !47, line: 2044, baseType: !950, size: 32, align: 32, offset: 2304)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1341, file: !47, line: 2054, baseType: !1549, size: 64, align: 64, offset: 2368)
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1341, file: !47, line: 2061, baseType: !1549, size: 64, align: 64, offset: 2432)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1341, file: !47, line: 2066, baseType: !950, size: 32, align: 32, offset: 2496)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1341, file: !47, line: 2070, baseType: !950, size: 32, align: 32, offset: 2528)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1341, file: !47, line: 2078, baseType: !950, size: 32, align: 32, offset: 2560)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1341, file: !47, line: 2085, baseType: !950, size: 32, align: 32, offset: 2592)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1341, file: !47, line: 2092, baseType: !950, size: 32, align: 32, offset: 2624)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1341, file: !47, line: 2099, baseType: !950, size: 32, align: 32, offset: 2656)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1341, file: !47, line: 2106, baseType: !950, size: 32, align: 32, offset: 2688)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1341, file: !47, line: 2113, baseType: !950, size: 32, align: 32, offset: 2720)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1341, file: !47, line: 2120, baseType: !950, size: 32, align: 32, offset: 2752)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1341, file: !47, line: 2125, baseType: !950, size: 32, align: 32, offset: 2784)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1341, file: !47, line: 2133, baseType: !950, size: 32, align: 32, offset: 2816)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1341, file: !47, line: 2140, baseType: !950, size: 32, align: 32, offset: 2848)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1341, file: !47, line: 2145, baseType: !950, size: 32, align: 32, offset: 2880)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1341, file: !47, line: 2153, baseType: !950, size: 32, align: 32, offset: 2912)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1341, file: !47, line: 2158, baseType: !950, size: 32, align: 32, offset: 2944)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1341, file: !47, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1341, file: !47, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1341, file: !47, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1341, file: !47, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1341, file: !47, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1341, file: !47, line: 2203, baseType: !950, size: 32, align: 32, offset: 3136)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1341, file: !47, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1341, file: !47, line: 2212, baseType: !950, size: 32, align: 32, offset: 3200)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1341, file: !47, line: 2213, baseType: !950, size: 32, align: 32, offset: 3232)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1341, file: !47, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1341, file: !47, line: 2232, baseType: !950, size: 32, align: 32, offset: 3296)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1341, file: !47, line: 2243, baseType: !950, size: 32, align: 32, offset: 3328)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1341, file: !47, line: 2249, baseType: !950, size: 32, align: 32, offset: 3360)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1341, file: !47, line: 2256, baseType: !950, size: 32, align: 32, offset: 3392)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1341, file: !47, line: 2263, baseType: !1180, size: 64, align: 64, offset: 3456)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1341, file: !47, line: 2270, baseType: !1180, size: 64, align: 64, offset: 3520)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1341, file: !47, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1341, file: !47, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1341, file: !47, line: 2367, baseType: !1585, size: 64, align: 64, offset: 3648)
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1586 = !DISubroutineType(types: !1587)
!1587 = !{!950, !1512, !1152, !950}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1341, file: !47, line: 2383, baseType: !950, size: 32, align: 32, offset: 3712)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1341, file: !47, line: 2386, baseType: !1519, size: 32, align: 32, offset: 3744)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1341, file: !47, line: 2387, baseType: !1519, size: 32, align: 32, offset: 3776)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1341, file: !47, line: 2394, baseType: !950, size: 32, align: 32, offset: 3808)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1341, file: !47, line: 2401, baseType: !950, size: 32, align: 32, offset: 3840)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1341, file: !47, line: 2408, baseType: !950, size: 32, align: 32, offset: 3872)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1341, file: !47, line: 2415, baseType: !950, size: 32, align: 32, offset: 3904)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1341, file: !47, line: 2422, baseType: !950, size: 32, align: 32, offset: 3936)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1341, file: !47, line: 2423, baseType: !1597, size: 64, align: 64, offset: 3968)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !47, line: 831, baseType: !1599)
!1599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !47, line: 826, size: 128, align: 32, elements: !1600)
!1600 = !{!1601, !1602, !1603, !1604}
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1599, file: !47, line: 827, baseType: !950, size: 32, align: 32)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1599, file: !47, line: 828, baseType: !950, size: 32, align: 32, offset: 32)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1599, file: !47, line: 829, baseType: !950, size: 32, align: 32, offset: 64)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1599, file: !47, line: 830, baseType: !1519, size: 32, align: 32, offset: 96)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1341, file: !47, line: 2430, baseType: !983, size: 64, align: 64, offset: 4032)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1341, file: !47, line: 2437, baseType: !983, size: 64, align: 64, offset: 4096)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1341, file: !47, line: 2444, baseType: !1519, size: 32, align: 32, offset: 4160)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1341, file: !47, line: 2451, baseType: !1519, size: 32, align: 32, offset: 4192)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1341, file: !47, line: 2458, baseType: !950, size: 32, align: 32, offset: 4224)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1341, file: !47, line: 2469, baseType: !950, size: 32, align: 32, offset: 4256)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1341, file: !47, line: 2475, baseType: !950, size: 32, align: 32, offset: 4288)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1341, file: !47, line: 2481, baseType: !950, size: 32, align: 32, offset: 4320)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1341, file: !47, line: 2485, baseType: !950, size: 32, align: 32, offset: 4352)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1341, file: !47, line: 2489, baseType: !950, size: 32, align: 32, offset: 4384)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1341, file: !47, line: 2493, baseType: !950, size: 32, align: 32, offset: 4416)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1341, file: !47, line: 2501, baseType: !950, size: 32, align: 32, offset: 4448)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1341, file: !47, line: 2506, baseType: !950, size: 32, align: 32, offset: 4480)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1341, file: !47, line: 2510, baseType: !950, size: 32, align: 32, offset: 4512)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1341, file: !47, line: 2514, baseType: !983, size: 64, align: 64, offset: 4544)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1341, file: !47, line: 2528, baseType: !1621, size: 64, align: 64, offset: 4608)
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1622, size: 64, align: 64)
!1622 = !DISubroutineType(types: !1623)
!1623 = !{null, !1512, !969, !950, !950}
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1341, file: !47, line: 2534, baseType: !950, size: 32, align: 32, offset: 4672)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1341, file: !47, line: 2545, baseType: !950, size: 32, align: 32, offset: 4704)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1341, file: !47, line: 2547, baseType: !950, size: 32, align: 32, offset: 4736)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1341, file: !47, line: 2549, baseType: !950, size: 32, align: 32, offset: 4768)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1341, file: !47, line: 2551, baseType: !950, size: 32, align: 32, offset: 4800)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1341, file: !47, line: 2553, baseType: !950, size: 32, align: 32, offset: 4832)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1341, file: !47, line: 2555, baseType: !950, size: 32, align: 32, offset: 4864)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1341, file: !47, line: 2557, baseType: !950, size: 32, align: 32, offset: 4896)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1341, file: !47, line: 2559, baseType: !950, size: 32, align: 32, offset: 4928)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1341, file: !47, line: 2563, baseType: !950, size: 32, align: 32, offset: 4960)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1341, file: !47, line: 2571, baseType: !1445, size: 64, align: 64, offset: 4992)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1341, file: !47, line: 2579, baseType: !1445, size: 64, align: 64, offset: 5056)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1341, file: !47, line: 2586, baseType: !950, size: 32, align: 32, offset: 5120)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1341, file: !47, line: 2615, baseType: !950, size: 32, align: 32, offset: 5152)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1341, file: !47, line: 2627, baseType: !950, size: 32, align: 32, offset: 5184)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1341, file: !47, line: 2637, baseType: !950, size: 32, align: 32, offset: 5216)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1341, file: !47, line: 2681, baseType: !950, size: 32, align: 32, offset: 5248)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1341, file: !47, line: 2709, baseType: !983, size: 64, align: 64, offset: 5312)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1341, file: !47, line: 2716, baseType: !1643, size: 64, align: 64, offset: 5376)
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64, align: 64)
!1644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1645)
!1645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !47, line: 3636, size: 896, align: 64, elements: !1646)
!1646 = !{!1647, !1648, !1649, !1650, !1651, !1652, !1653, !1657, !1661, !1662, !1663, !1664, !1670, !1671, !1672, !1673, !1674}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1645, file: !47, line: 3642, baseType: !945, size: 64, align: 64)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1645, file: !47, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1645, file: !47, line: 3656, baseType: !46, size: 32, align: 32, offset: 96)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1645, file: !47, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1645, file: !47, line: 3669, baseType: !950, size: 32, align: 32, offset: 160)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1645, file: !47, line: 3682, baseType: !1470, size: 64, align: 64, offset: 192)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1645, file: !47, line: 3698, baseType: !1654, size: 64, align: 64, offset: 256)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DISubroutineType(types: !1656)
!1656 = !{!950, !1339, !1293, !1417}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1645, file: !47, line: 3712, baseType: !1658, size: 64, align: 64, offset: 320)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DISubroutineType(types: !1660)
!1660 = !{!950, !1339, !950, !1293, !1417}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1645, file: !47, line: 3726, baseType: !1654, size: 64, align: 64, offset: 384)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1645, file: !47, line: 3737, baseType: !1386, size: 64, align: 64, offset: 448)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1645, file: !47, line: 3746, baseType: !950, size: 32, align: 32, offset: 512)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1645, file: !47, line: 3757, baseType: !1665, size: 64, align: 64, offset: 576)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DISubroutineType(types: !1667)
!1667 = !{null, !1668}
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !47, line: 3617, flags: DIFlagFwdDecl)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1645, file: !47, line: 3766, baseType: !1386, size: 64, align: 64, offset: 640)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1645, file: !47, line: 3774, baseType: !1386, size: 64, align: 64, offset: 704)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1645, file: !47, line: 3780, baseType: !950, size: 32, align: 32, offset: 768)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1645, file: !47, line: 3785, baseType: !950, size: 32, align: 32, offset: 800)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1645, file: !47, line: 3795, baseType: !1675, size: 64, align: 64, offset: 832)
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64, align: 64)
!1676 = !DISubroutineType(types: !1677)
!1677 = !{!950, !1339, !1095}
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1341, file: !47, line: 2728, baseType: !969, size: 64, align: 64, offset: 5440)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1341, file: !47, line: 2735, baseType: !1179, size: 512, align: 64, offset: 5504)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1341, file: !47, line: 2742, baseType: !950, size: 32, align: 32, offset: 6016)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1341, file: !47, line: 2755, baseType: !950, size: 32, align: 32, offset: 6048)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1341, file: !47, line: 2776, baseType: !950, size: 32, align: 32, offset: 6080)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1341, file: !47, line: 2783, baseType: !950, size: 32, align: 32, offset: 6112)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1341, file: !47, line: 2791, baseType: !950, size: 32, align: 32, offset: 6144)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1341, file: !47, line: 2802, baseType: !1152, size: 64, align: 64, offset: 6208)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1341, file: !47, line: 2811, baseType: !950, size: 32, align: 32, offset: 6272)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1341, file: !47, line: 2821, baseType: !950, size: 32, align: 32, offset: 6304)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1341, file: !47, line: 2830, baseType: !950, size: 32, align: 32, offset: 6336)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1341, file: !47, line: 2840, baseType: !950, size: 32, align: 32, offset: 6368)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1341, file: !47, line: 2851, baseType: !1691, size: 64, align: 64, offset: 6400)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64, align: 64)
!1692 = !DISubroutineType(types: !1693)
!1693 = !{!950, !1512, !1694, !969, !1455, !950, !950}
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64, align: 64)
!1695 = !DISubroutineType(types: !1696)
!1696 = !{!950, !1512, !969}
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1341, file: !47, line: 2871, baseType: !1698, size: 64, align: 64, offset: 6464)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
!1699 = !DISubroutineType(types: !1700)
!1700 = !{!950, !1512, !1701, !969, !1455, !950}
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64, align: 64)
!1702 = !DISubroutineType(types: !1703)
!1703 = !{!950, !1512, !969, !950, !950}
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1341, file: !47, line: 2878, baseType: !950, size: 32, align: 32, offset: 6528)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1341, file: !47, line: 2885, baseType: !950, size: 32, align: 32, offset: 6560)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1341, file: !47, line: 3005, baseType: !950, size: 32, align: 32, offset: 6592)
