; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--x86--mpegvideoencdsp_init.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--x86--mpegvideoencdsp_init.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MpegvideoEncDSPContext = type { i32 (i16*, i16*, i16*, i32)*, void (i16*, i16*, i32)*, i32 (i8*, i32)*, i32 (i8*, i32)*, [4 x void (i8*, i32, i8*, i32, i32, i32)*], void (i8*, i32, i32, i32, i32, i32, i32)* }

!831 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!832 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!833 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!834 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!835 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!836 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!837 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!838 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!839 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!840 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!841 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!842 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!843 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!844 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!845 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!846 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!847 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!848 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !495, line: 538, size: 32, align: 32, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857}
!850 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!851 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!852 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!853 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!854 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!855 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!856 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!857 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !35, line: 1534, size: 32, align: 32, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865}
!860 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!861 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!862 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!863 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!864 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!865 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !35, line: 810, size: 32, align: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !{!888}
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "x86_reg", file: !889, line: 39, baseType: !890)
!889 = !DIFile(filename: "./libavutil/x86/asm.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !891, line: 197, baseType: !892)
!891 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!892 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!893 = !{i32 2, !"Dwarf Version", i32 4}
!894 = !{i32 2, !"Debug Info Version", i32 3}
!895 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!896 = distinct !DISubprogram(name: "ff_mpegvideoencdsp_init_x86", scope: !897, file: !897, line: 217, type: !898, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1529)
!897 = !DIFile(filename: "libavcodec/x86/mpegvideoencdsp_init.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !DISubroutineType(types: !899)
!899 = !{null, !900, !939}
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "MpegvideoEncDSPContext", file: !902, line: 45, baseType: !903)
!902 = !DIFile(filename: "./libavcodec/mpegvideoencdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegvideoEncDSPContext", file: !902, line: 32, size: 576, align: 64, elements: !904)
!904 = !{!905, !913, !917, !925, !926, !935}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "try_8x8basis", scope: !903, file: !902, line: 33, baseType: !906, size: 64, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64, align: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!909, !910, !910, !910, !909}
!909 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !891, line: 195, baseType: !912)
!912 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "add_8x8basis", scope: !903, file: !902, line: 35, baseType: !914, size: 64, align: 64, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{null, !910, !910, !909}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "pix_sum", scope: !903, file: !902, line: 37, baseType: !918, size: 64, align: 64, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!909, !921, !909}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !923, line: 48, baseType: !924)
!923 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!924 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "pix_norm1", scope: !903, file: !902, line: 38, baseType: !918, size: 64, align: 64, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "shrink", scope: !903, file: !902, line: 40, baseType: !927, size: 256, align: 64, offset: 256)
!927 = !DICompositeType(tag: DW_TAG_array_type, baseType: !928, size: 256, align: 64, elements: !933)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{null, !921, !909, !931, !909, !909, !909}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !922)
!933 = !{!934}
!934 = !DISubrange(count: 4)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "draw_edges", scope: !903, file: !902, line: 43, baseType: !936, size: 64, align: 64, offset: 512)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{null, !921, !909, !909, !909, !909, !909, !909}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !942)
!942 = !{!943, !988, !989, !990, !1254, !1255, !1256, !1257, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1283, !1287, !1288, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1467, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !941, file: !35, line: 1561, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !948)
!948 = !{!949, !953, !958, !962, !963, !964, !965, !969, !975, !977, !981}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !947, file: !4, line: 72, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!952 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !947, file: !4, line: 78, baseType: !954, size: 64, align: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!950, !957}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !947, file: !4, line: 85, baseType: !959, size: 64, align: 64, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !947, file: !4, line: 93, baseType: !909, size: 32, align: 32, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !947, file: !4, line: 99, baseType: !909, size: 32, align: 32, offset: 224)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !947, file: !4, line: 108, baseType: !909, size: 32, align: 32, offset: 256)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !947, file: !4, line: 113, baseType: !966, size: 64, align: 64, offset: 320)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!957, !957, !957}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !947, file: !4, line: 123, baseType: !970, size: 64, align: 64, offset: 384)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!973, !973}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !947, file: !4, line: 130, baseType: !976, size: 32, align: 32, offset: 448)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !947, file: !4, line: 136, baseType: !978, size: 64, align: 64, offset: 512)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!976, !957}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !947, file: !4, line: 142, baseType: !982, size: 64, align: 64, offset: 576)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!909, !985, !957, !950, !909}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !941, file: !35, line: 1562, baseType: !909, size: 32, align: 32, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !941, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !941, file: !35, line: 1565, baseType: !991, size: 64, align: 64, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !994)
!994 = !{!995, !996, !997, !998, !999, !1000, !1009, !1012, !1015, !1018, !1023, !1024, !1025, !1033, !1034, !1035, !1037, !1041, !1047, !1052, !1056, !1057, !1104, !1225, !1229, !1230, !1234, !1238, !1243, !1247, !1248, !1249}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !993, file: !35, line: 3475, baseType: !950, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !993, file: !35, line: 3480, baseType: !950, size: 64, align: 64, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !993, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !993, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !993, file: !35, line: 3487, baseType: !909, size: 32, align: 32, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !993, file: !35, line: 3488, baseType: !1001, size: 64, align: 64, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1004, line: 61, baseType: !1005)
!1004 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1004, line: 58, size: 64, align: 32, elements: !1006)
!1006 = !{!1007, !1008}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1005, file: !1004, line: 59, baseType: !909, size: 32, align: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1005, file: !1004, line: 60, baseType: !909, size: 32, align: 32, offset: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !993, file: !35, line: 3489, baseType: !1010, size: 64, align: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !993, file: !35, line: 3490, baseType: !1013, size: 64, align: 64, offset: 384)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !909)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !993, file: !35, line: 3491, baseType: !1016, size: 64, align: 64, offset: 448)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !993, file: !35, line: 3492, baseType: !1019, size: 64, align: 64, offset: 512)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1021)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !923, line: 55, baseType: !1022)
!1022 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !993, file: !35, line: 3493, baseType: !922, size: 8, align: 8, offset: 576)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !993, file: !35, line: 3494, baseType: !944, size: 64, align: 64, offset: 640)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !993, file: !35, line: 3495, baseType: !1026, size: 64, align: 64, offset: 704)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1030)
!1030 = !{!1031, !1032}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1029, file: !35, line: 3402, baseType: !909, size: 32, align: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1029, file: !35, line: 3403, baseType: !950, size: 64, align: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !993, file: !35, line: 3507, baseType: !950, size: 64, align: 64, offset: 768)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !993, file: !35, line: 3516, baseType: !909, size: 32, align: 32, offset: 832)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !993, file: !35, line: 3517, baseType: !1036, size: 64, align: 64, offset: 896)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !993, file: !35, line: 3527, baseType: !1038, size: 64, align: 64, offset: 960)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!909, !939}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !993, file: !35, line: 3535, baseType: !1042, size: 64, align: 64, offset: 1024)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!909, !939, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !993, file: !35, line: 3541, baseType: !1048, size: 64, align: 64, offset: 1088)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1051)
!1051 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !993, file: !35, line: 3549, baseType: !1053, size: 64, align: 64, offset: 1152)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{null, !1036}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !993, file: !35, line: 3551, baseType: !1038, size: 64, align: 64, offset: 1216)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !993, file: !35, line: 3552, baseType: !1058, size: 64, align: 64, offset: 1280)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!909, !939, !921, !909, !1061}
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1064)
!1064 = !{!1065, !1068, !1071, !1072, !1073, !1103}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1063, file: !35, line: 3921, baseType: !1066, size: 16, align: 16)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !923, line: 49, baseType: !1067)
!1067 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1063, file: !35, line: 3922, baseType: !1069, size: 32, align: 32, offset: 32)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !923, line: 51, baseType: !1070)
!1070 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1063, file: !35, line: 3923, baseType: !1069, size: 32, align: 32, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1063, file: !35, line: 3924, baseType: !1070, size: 32, align: 32, offset: 96)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1063, file: !35, line: 3925, baseType: !1074, size: 64, align: 64, offset: 128)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1077)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1078)
!1078 = !{!1079, !1080, !1081, !1082, !1083, !1084, !1094, !1096, !1098, !1099, !1101, !1102}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1077, file: !35, line: 3886, baseType: !909, size: 32, align: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1077, file: !35, line: 3887, baseType: !909, size: 32, align: 32, offset: 32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1077, file: !35, line: 3888, baseType: !909, size: 32, align: 32, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1077, file: !35, line: 3889, baseType: !909, size: 32, align: 32, offset: 96)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1077, file: !35, line: 3890, baseType: !909, size: 32, align: 32, offset: 128)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1077, file: !35, line: 3897, baseType: !1085, size: 768, align: 64, offset: 192)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1086)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1087)
!1087 = !{!1088, !1092}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1086, file: !35, line: 3855, baseType: !1089, size: 512, align: 64)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !921, size: 512, align: 64, elements: !1090)
!1090 = !{!1091}
!1091 = !DISubrange(count: 8)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1086, file: !35, line: 3857, baseType: !1093, size: 256, align: 32, offset: 512)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 256, align: 32, elements: !1090)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1077, file: !35, line: 3903, baseType: !1095, size: 256, align: 64, offset: 960)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !921, size: 256, align: 64, elements: !933)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1077, file: !35, line: 3904, baseType: !1097, size: 128, align: 32, offset: 1216)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 128, align: 32, elements: !933)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1077, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1077, file: !35, line: 3908, baseType: !1100, size: 64, align: 64, offset: 1408)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1077, file: !35, line: 3915, baseType: !1100, size: 64, align: 64, offset: 1472)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1077, file: !35, line: 3917, baseType: !909, size: 32, align: 32, offset: 1536)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1063, file: !35, line: 3926, baseType: !890, size: 64, align: 64, offset: 192)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !993, file: !35, line: 3564, baseType: !1105, size: 64, align: 64, offset: 1344)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!909, !939, !1108, !1142, !1224}
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1110)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1111)
!1111 = !{!1112, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1138, !1139, !1140, !1141}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1110, file: !35, line: 1451, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1115, line: 94, baseType: !1116)
!1115 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1115, line: 81, size: 192, align: 64, elements: !1117)
!1117 = !{!1118, !1122, !1123}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1116, file: !1115, line: 82, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1115, line: 73, baseType: !1121)
!1121 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1115, line: 73, flags: DIFlagFwdDecl)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1116, file: !1115, line: 89, baseType: !921, size: 64, align: 64, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1116, file: !1115, line: 93, baseType: !909, size: 32, align: 32, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1110, file: !35, line: 1461, baseType: !890, size: 64, align: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1110, file: !35, line: 1467, baseType: !890, size: 64, align: 64, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1110, file: !35, line: 1468, baseType: !921, size: 64, align: 64, offset: 192)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1110, file: !35, line: 1469, baseType: !909, size: 32, align: 32, offset: 256)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1110, file: !35, line: 1470, baseType: !909, size: 32, align: 32, offset: 288)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1110, file: !35, line: 1474, baseType: !909, size: 32, align: 32, offset: 320)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1110, file: !35, line: 1479, baseType: !1131, size: 64, align: 64, offset: 384)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1133)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1134)
!1134 = !{!1135, !1136, !1137}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1133, file: !35, line: 1412, baseType: !921, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1133, file: !35, line: 1413, baseType: !909, size: 32, align: 32, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1133, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1110, file: !35, line: 1480, baseType: !909, size: 32, align: 32, offset: 448)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1110, file: !35, line: 1486, baseType: !890, size: 64, align: 64, offset: 512)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1110, file: !35, line: 1488, baseType: !890, size: 64, align: 64, offset: 576)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1110, file: !35, line: 1497, baseType: !890, size: 64, align: 64, offset: 640)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1144)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1176, !1178, !1179, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1212, !1213, !1214, !1215, !1216, !1217, !1220, !1221, !1222, !1223}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1145, file: !758, line: 282, baseType: !1089, size: 512, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1145, file: !758, line: 299, baseType: !1093, size: 256, align: 32, offset: 512)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1145, file: !758, line: 315, baseType: !1150, size: 64, align: 64, offset: 768)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1145, file: !758, line: 326, baseType: !909, size: 32, align: 32, offset: 832)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1145, file: !758, line: 326, baseType: !909, size: 32, align: 32, offset: 864)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1145, file: !758, line: 334, baseType: !909, size: 32, align: 32, offset: 896)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1145, file: !758, line: 341, baseType: !909, size: 32, align: 32, offset: 928)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1145, file: !758, line: 346, baseType: !909, size: 32, align: 32, offset: 960)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1145, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1145, file: !758, line: 356, baseType: !1003, size: 64, align: 32, offset: 1024)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1145, file: !758, line: 361, baseType: !890, size: 64, align: 64, offset: 1088)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1145, file: !758, line: 369, baseType: !890, size: 64, align: 64, offset: 1152)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1145, file: !758, line: 377, baseType: !890, size: 64, align: 64, offset: 1216)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1145, file: !758, line: 382, baseType: !909, size: 32, align: 32, offset: 1280)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1145, file: !758, line: 386, baseType: !909, size: 32, align: 32, offset: 1312)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1145, file: !758, line: 391, baseType: !909, size: 32, align: 32, offset: 1344)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1145, file: !758, line: 396, baseType: !957, size: 64, align: 64, offset: 1408)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1145, file: !758, line: 403, baseType: !1166, size: 512, align: 64, offset: 1472)
!1166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 512, align: 64, elements: !1090)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1145, file: !758, line: 410, baseType: !909, size: 32, align: 32, offset: 1984)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1145, file: !758, line: 415, baseType: !909, size: 32, align: 32, offset: 2016)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1145, file: !758, line: 420, baseType: !909, size: 32, align: 32, offset: 2048)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1145, file: !758, line: 425, baseType: !909, size: 32, align: 32, offset: 2080)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1145, file: !758, line: 435, baseType: !890, size: 64, align: 64, offset: 2112)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1145, file: !758, line: 440, baseType: !909, size: 32, align: 32, offset: 2176)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1145, file: !758, line: 445, baseType: !1021, size: 64, align: 64, offset: 2240)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1145, file: !758, line: 459, baseType: !1175, size: 512, align: 64, offset: 2304)
!1175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1113, size: 512, align: 64, elements: !1090)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1145, file: !758, line: 473, baseType: !1177, size: 64, align: 64, offset: 2816)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1145, file: !758, line: 477, baseType: !909, size: 32, align: 32, offset: 2880)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1145, file: !758, line: 479, baseType: !1180, size: 64, align: 64, offset: 2944)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1183)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1184)
!1184 = !{!1185, !1186, !1187, !1188, !1193}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1183, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1183, file: !758, line: 203, baseType: !921, size: 64, align: 64, offset: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1183, file: !758, line: 204, baseType: !909, size: 32, align: 32, offset: 128)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1183, file: !758, line: 205, baseType: !1189, size: 64, align: 64, offset: 192)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1191, line: 86, baseType: !1192)
!1191 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1192 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1191, line: 86, flags: DIFlagFwdDecl)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1183, file: !758, line: 206, baseType: !1113, size: 64, align: 64, offset: 256)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1145, file: !758, line: 480, baseType: !909, size: 32, align: 32, offset: 3008)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1145, file: !758, line: 505, baseType: !909, size: 32, align: 32, offset: 3040)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1145, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1145, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1145, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1145, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1145, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1145, file: !758, line: 532, baseType: !890, size: 64, align: 64, offset: 3264)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1145, file: !758, line: 539, baseType: !890, size: 64, align: 64, offset: 3328)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1145, file: !758, line: 547, baseType: !890, size: 64, align: 64, offset: 3392)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1145, file: !758, line: 554, baseType: !1189, size: 64, align: 64, offset: 3456)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1145, file: !758, line: 563, baseType: !909, size: 32, align: 32, offset: 3520)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1145, file: !758, line: 572, baseType: !909, size: 32, align: 32, offset: 3552)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1145, file: !758, line: 581, baseType: !909, size: 32, align: 32, offset: 3584)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1145, file: !758, line: 588, baseType: !1209, size: 64, align: 64, offset: 3648)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !891, line: 194, baseType: !1211)
!1211 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1145, file: !758, line: 593, baseType: !909, size: 32, align: 32, offset: 3712)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1145, file: !758, line: 596, baseType: !909, size: 32, align: 32, offset: 3744)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1145, file: !758, line: 599, baseType: !1113, size: 64, align: 64, offset: 3776)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1145, file: !758, line: 605, baseType: !1113, size: 64, align: 64, offset: 3840)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1145, file: !758, line: 616, baseType: !1113, size: 64, align: 64, offset: 3904)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1145, file: !758, line: 626, baseType: !1218, size: 64, align: 64, offset: 3968)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1219, line: 216, baseType: !1022)
!1219 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1145, file: !758, line: 627, baseType: !1218, size: 64, align: 64, offset: 4032)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1145, file: !758, line: 628, baseType: !1218, size: 64, align: 64, offset: 4096)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1145, file: !758, line: 629, baseType: !1218, size: 64, align: 64, offset: 4160)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1145, file: !758, line: 645, baseType: !1113, size: 64, align: 64, offset: 4224)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !993, file: !35, line: 3566, baseType: !1226, size: 64, align: 64, offset: 1408)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!909, !939, !957, !1224, !1108}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !993, file: !35, line: 3567, baseType: !1038, size: 64, align: 64, offset: 1472)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !993, file: !35, line: 3576, baseType: !1231, size: 64, align: 64, offset: 1536)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!909, !939, !1142}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !993, file: !35, line: 3577, baseType: !1235, size: 64, align: 64, offset: 1600)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!909, !939, !1108}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !993, file: !35, line: 3584, baseType: !1239, size: 64, align: 64, offset: 1664)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!909, !939, !1242}
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !993, file: !35, line: 3589, baseType: !1244, size: 64, align: 64, offset: 1728)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{null, !939}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !993, file: !35, line: 3594, baseType: !909, size: 32, align: 32, offset: 1792)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !993, file: !35, line: 3600, baseType: !950, size: 64, align: 64, offset: 1856)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !993, file: !35, line: 3609, baseType: !1250, size: 64, align: 64, offset: 1920)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1253)
!1253 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !941, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !941, file: !35, line: 1581, baseType: !1070, size: 32, align: 32, offset: 224)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !941, file: !35, line: 1583, baseType: !957, size: 64, align: 64, offset: 256)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !941, file: !35, line: 1591, baseType: !1258, size: 64, align: 64, offset: 320)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !941, file: !35, line: 1598, baseType: !957, size: 64, align: 64, offset: 384)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !941, file: !35, line: 1606, baseType: !890, size: 64, align: 64, offset: 448)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !941, file: !35, line: 1614, baseType: !909, size: 32, align: 32, offset: 512)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !941, file: !35, line: 1622, baseType: !909, size: 32, align: 32, offset: 544)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !941, file: !35, line: 1628, baseType: !909, size: 32, align: 32, offset: 576)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !941, file: !35, line: 1636, baseType: !909, size: 32, align: 32, offset: 608)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !941, file: !35, line: 1643, baseType: !909, size: 32, align: 32, offset: 640)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !941, file: !35, line: 1657, baseType: !921, size: 64, align: 64, offset: 704)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !941, file: !35, line: 1658, baseType: !909, size: 32, align: 32, offset: 768)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !941, file: !35, line: 1679, baseType: !1003, size: 64, align: 32, offset: 800)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !941, file: !35, line: 1688, baseType: !909, size: 32, align: 32, offset: 864)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !941, file: !35, line: 1712, baseType: !909, size: 32, align: 32, offset: 896)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !941, file: !35, line: 1729, baseType: !909, size: 32, align: 32, offset: 928)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !941, file: !35, line: 1729, baseType: !909, size: 32, align: 32, offset: 960)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !941, file: !35, line: 1744, baseType: !909, size: 32, align: 32, offset: 992)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !941, file: !35, line: 1744, baseType: !909, size: 32, align: 32, offset: 1024)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !941, file: !35, line: 1751, baseType: !909, size: 32, align: 32, offset: 1056)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !941, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !941, file: !35, line: 1791, baseType: !1279, size: 64, align: 64, offset: 1152)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{null, !1282, !1142, !1224, !909, !909, !909}
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !941, file: !35, line: 1808, baseType: !1284, size: 64, align: 64, offset: 1216)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!494, !1282, !1010}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !941, file: !35, line: 1816, baseType: !909, size: 32, align: 32, offset: 1280)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !941, file: !35, line: 1825, baseType: !1289, size: 32, align: 32, offset: 1312)
!1289 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !941, file: !35, line: 1830, baseType: !909, size: 32, align: 32, offset: 1344)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !941, file: !35, line: 1838, baseType: !1289, size: 32, align: 32, offset: 1376)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !941, file: !35, line: 1846, baseType: !909, size: 32, align: 32, offset: 1408)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !941, file: !35, line: 1851, baseType: !909, size: 32, align: 32, offset: 1440)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !941, file: !35, line: 1861, baseType: !1289, size: 32, align: 32, offset: 1472)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !941, file: !35, line: 1868, baseType: !1289, size: 32, align: 32, offset: 1504)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !941, file: !35, line: 1875, baseType: !1289, size: 32, align: 32, offset: 1536)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !941, file: !35, line: 1882, baseType: !1289, size: 32, align: 32, offset: 1568)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !941, file: !35, line: 1889, baseType: !1289, size: 32, align: 32, offset: 1600)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !941, file: !35, line: 1896, baseType: !1289, size: 32, align: 32, offset: 1632)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !941, file: !35, line: 1903, baseType: !1289, size: 32, align: 32, offset: 1664)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !941, file: !35, line: 1910, baseType: !909, size: 32, align: 32, offset: 1696)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !941, file: !35, line: 1915, baseType: !909, size: 32, align: 32, offset: 1728)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !941, file: !35, line: 1926, baseType: !1224, size: 64, align: 64, offset: 1792)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !941, file: !35, line: 1935, baseType: !1003, size: 64, align: 32, offset: 1856)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !941, file: !35, line: 1942, baseType: !909, size: 32, align: 32, offset: 1920)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !941, file: !35, line: 1948, baseType: !909, size: 32, align: 32, offset: 1952)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !941, file: !35, line: 1954, baseType: !909, size: 32, align: 32, offset: 1984)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !941, file: !35, line: 1960, baseType: !909, size: 32, align: 32, offset: 2016)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !941, file: !35, line: 1984, baseType: !909, size: 32, align: 32, offset: 2048)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !941, file: !35, line: 1991, baseType: !909, size: 32, align: 32, offset: 2080)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !941, file: !35, line: 1996, baseType: !909, size: 32, align: 32, offset: 2112)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !941, file: !35, line: 2004, baseType: !909, size: 32, align: 32, offset: 2144)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !941, file: !35, line: 2011, baseType: !909, size: 32, align: 32, offset: 2176)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !941, file: !35, line: 2018, baseType: !909, size: 32, align: 32, offset: 2208)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !941, file: !35, line: 2027, baseType: !909, size: 32, align: 32, offset: 2240)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !941, file: !35, line: 2034, baseType: !909, size: 32, align: 32, offset: 2272)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !941, file: !35, line: 2044, baseType: !909, size: 32, align: 32, offset: 2304)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !941, file: !35, line: 2054, baseType: !1319, size: 64, align: 64, offset: 2368)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !941, file: !35, line: 2061, baseType: !1319, size: 64, align: 64, offset: 2432)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !941, file: !35, line: 2066, baseType: !909, size: 32, align: 32, offset: 2496)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !941, file: !35, line: 2070, baseType: !909, size: 32, align: 32, offset: 2528)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !941, file: !35, line: 2078, baseType: !909, size: 32, align: 32, offset: 2560)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !941, file: !35, line: 2085, baseType: !909, size: 32, align: 32, offset: 2592)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !941, file: !35, line: 2092, baseType: !909, size: 32, align: 32, offset: 2624)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !941, file: !35, line: 2099, baseType: !909, size: 32, align: 32, offset: 2656)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !941, file: !35, line: 2106, baseType: !909, size: 32, align: 32, offset: 2688)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !941, file: !35, line: 2113, baseType: !909, size: 32, align: 32, offset: 2720)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !941, file: !35, line: 2120, baseType: !909, size: 32, align: 32, offset: 2752)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !941, file: !35, line: 2125, baseType: !909, size: 32, align: 32, offset: 2784)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !941, file: !35, line: 2133, baseType: !909, size: 32, align: 32, offset: 2816)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !941, file: !35, line: 2140, baseType: !909, size: 32, align: 32, offset: 2848)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !941, file: !35, line: 2145, baseType: !909, size: 32, align: 32, offset: 2880)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !941, file: !35, line: 2153, baseType: !909, size: 32, align: 32, offset: 2912)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !941, file: !35, line: 2158, baseType: !909, size: 32, align: 32, offset: 2944)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !941, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !941, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !941, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !941, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !941, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !941, file: !35, line: 2203, baseType: !909, size: 32, align: 32, offset: 3136)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !941, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !941, file: !35, line: 2212, baseType: !909, size: 32, align: 32, offset: 3200)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !941, file: !35, line: 2213, baseType: !909, size: 32, align: 32, offset: 3232)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !941, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !941, file: !35, line: 2232, baseType: !909, size: 32, align: 32, offset: 3296)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !941, file: !35, line: 2243, baseType: !909, size: 32, align: 32, offset: 3328)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !941, file: !35, line: 2249, baseType: !909, size: 32, align: 32, offset: 3360)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !941, file: !35, line: 2256, baseType: !909, size: 32, align: 32, offset: 3392)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !941, file: !35, line: 2263, baseType: !1021, size: 64, align: 64, offset: 3456)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !941, file: !35, line: 2270, baseType: !1021, size: 64, align: 64, offset: 3520)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !941, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !941, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !941, file: !35, line: 2367, baseType: !1355, size: 64, align: 64, offset: 3648)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{!909, !1282, !1242, !909}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !941, file: !35, line: 2383, baseType: !909, size: 32, align: 32, offset: 3712)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !941, file: !35, line: 2386, baseType: !1289, size: 32, align: 32, offset: 3744)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !941, file: !35, line: 2387, baseType: !1289, size: 32, align: 32, offset: 3776)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !941, file: !35, line: 2394, baseType: !909, size: 32, align: 32, offset: 3808)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !941, file: !35, line: 2401, baseType: !909, size: 32, align: 32, offset: 3840)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !941, file: !35, line: 2408, baseType: !909, size: 32, align: 32, offset: 3872)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !941, file: !35, line: 2415, baseType: !909, size: 32, align: 32, offset: 3904)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !941, file: !35, line: 2422, baseType: !909, size: 32, align: 32, offset: 3936)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !941, file: !35, line: 2423, baseType: !1367, size: 64, align: 64, offset: 3968)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1369)
!1369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1370)
!1370 = !{!1371, !1372, !1373, !1374}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1369, file: !35, line: 827, baseType: !909, size: 32, align: 32)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1369, file: !35, line: 828, baseType: !909, size: 32, align: 32, offset: 32)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1369, file: !35, line: 829, baseType: !909, size: 32, align: 32, offset: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1369, file: !35, line: 830, baseType: !1289, size: 32, align: 32, offset: 96)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !941, file: !35, line: 2430, baseType: !890, size: 64, align: 64, offset: 4032)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !941, file: !35, line: 2437, baseType: !890, size: 64, align: 64, offset: 4096)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !941, file: !35, line: 2444, baseType: !1289, size: 32, align: 32, offset: 4160)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !941, file: !35, line: 2451, baseType: !1289, size: 32, align: 32, offset: 4192)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !941, file: !35, line: 2458, baseType: !909, size: 32, align: 32, offset: 4224)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !941, file: !35, line: 2469, baseType: !909, size: 32, align: 32, offset: 4256)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !941, file: !35, line: 2475, baseType: !909, size: 32, align: 32, offset: 4288)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !941, file: !35, line: 2481, baseType: !909, size: 32, align: 32, offset: 4320)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !941, file: !35, line: 2485, baseType: !909, size: 32, align: 32, offset: 4352)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !941, file: !35, line: 2489, baseType: !909, size: 32, align: 32, offset: 4384)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !941, file: !35, line: 2493, baseType: !909, size: 32, align: 32, offset: 4416)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !941, file: !35, line: 2501, baseType: !909, size: 32, align: 32, offset: 4448)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !941, file: !35, line: 2506, baseType: !909, size: 32, align: 32, offset: 4480)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !941, file: !35, line: 2510, baseType: !909, size: 32, align: 32, offset: 4512)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !941, file: !35, line: 2514, baseType: !890, size: 64, align: 64, offset: 4544)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !941, file: !35, line: 2528, baseType: !1391, size: 64, align: 64, offset: 4608)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DISubroutineType(types: !1393)
!1393 = !{null, !1282, !957, !909, !909}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !941, file: !35, line: 2534, baseType: !909, size: 32, align: 32, offset: 4672)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !941, file: !35, line: 2545, baseType: !909, size: 32, align: 32, offset: 4704)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !941, file: !35, line: 2547, baseType: !909, size: 32, align: 32, offset: 4736)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !941, file: !35, line: 2549, baseType: !909, size: 32, align: 32, offset: 4768)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !941, file: !35, line: 2551, baseType: !909, size: 32, align: 32, offset: 4800)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !941, file: !35, line: 2553, baseType: !909, size: 32, align: 32, offset: 4832)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !941, file: !35, line: 2555, baseType: !909, size: 32, align: 32, offset: 4864)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !941, file: !35, line: 2557, baseType: !909, size: 32, align: 32, offset: 4896)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !941, file: !35, line: 2559, baseType: !909, size: 32, align: 32, offset: 4928)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !941, file: !35, line: 2563, baseType: !909, size: 32, align: 32, offset: 4960)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !941, file: !35, line: 2571, baseType: !1100, size: 64, align: 64, offset: 4992)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !941, file: !35, line: 2579, baseType: !1100, size: 64, align: 64, offset: 5056)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !941, file: !35, line: 2586, baseType: !909, size: 32, align: 32, offset: 5120)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !941, file: !35, line: 2615, baseType: !909, size: 32, align: 32, offset: 5152)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !941, file: !35, line: 2627, baseType: !909, size: 32, align: 32, offset: 5184)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !941, file: !35, line: 2637, baseType: !909, size: 32, align: 32, offset: 5216)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !941, file: !35, line: 2681, baseType: !909, size: 32, align: 32, offset: 5248)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !941, file: !35, line: 2709, baseType: !890, size: 64, align: 64, offset: 5312)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !941, file: !35, line: 2716, baseType: !1413, size: 64, align: 64, offset: 5376)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1415)
!1415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1416)
!1416 = !{!1417, !1418, !1419, !1420, !1421, !1422, !1423, !1427, !1431, !1432, !1433, !1434, !1440, !1441, !1442, !1443, !1444}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1415, file: !35, line: 3642, baseType: !950, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1415, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1415, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1415, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1415, file: !35, line: 3669, baseType: !909, size: 32, align: 32, offset: 160)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1415, file: !35, line: 3682, baseType: !1239, size: 64, align: 64, offset: 192)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1415, file: !35, line: 3698, baseType: !1424, size: 64, align: 64, offset: 256)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DISubroutineType(types: !1426)
!1426 = !{!909, !939, !931, !1069}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1415, file: !35, line: 3712, baseType: !1428, size: 64, align: 64, offset: 320)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{!909, !939, !909, !931, !1069}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1415, file: !35, line: 3726, baseType: !1424, size: 64, align: 64, offset: 384)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1415, file: !35, line: 3737, baseType: !1038, size: 64, align: 64, offset: 448)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1415, file: !35, line: 3746, baseType: !909, size: 32, align: 32, offset: 512)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1415, file: !35, line: 3757, baseType: !1435, size: 64, align: 64, offset: 576)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DISubroutineType(types: !1437)
!1437 = !{null, !1438}
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1415, file: !35, line: 3766, baseType: !1038, size: 64, align: 64, offset: 640)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1415, file: !35, line: 3774, baseType: !1038, size: 64, align: 64, offset: 704)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1415, file: !35, line: 3780, baseType: !909, size: 32, align: 32, offset: 768)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1415, file: !35, line: 3785, baseType: !909, size: 32, align: 32, offset: 800)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1415, file: !35, line: 3795, baseType: !1445, size: 64, align: 64, offset: 832)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DISubroutineType(types: !1447)
!1447 = !{!909, !939, !1113}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !941, file: !35, line: 2728, baseType: !957, size: 64, align: 64, offset: 5440)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !941, file: !35, line: 2735, baseType: !1166, size: 512, align: 64, offset: 5504)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !941, file: !35, line: 2742, baseType: !909, size: 32, align: 32, offset: 6016)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !941, file: !35, line: 2755, baseType: !909, size: 32, align: 32, offset: 6048)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !941, file: !35, line: 2776, baseType: !909, size: 32, align: 32, offset: 6080)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !941, file: !35, line: 2783, baseType: !909, size: 32, align: 32, offset: 6112)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !941, file: !35, line: 2791, baseType: !909, size: 32, align: 32, offset: 6144)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !941, file: !35, line: 2802, baseType: !1242, size: 64, align: 64, offset: 6208)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !941, file: !35, line: 2811, baseType: !909, size: 32, align: 32, offset: 6272)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !941, file: !35, line: 2821, baseType: !909, size: 32, align: 32, offset: 6304)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !941, file: !35, line: 2830, baseType: !909, size: 32, align: 32, offset: 6336)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !941, file: !35, line: 2840, baseType: !909, size: 32, align: 32, offset: 6368)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !941, file: !35, line: 2851, baseType: !1461, size: 64, align: 64, offset: 6400)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!909, !1282, !1464, !957, !1224, !909, !909}
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DISubroutineType(types: !1466)
!1466 = !{!909, !1282, !957}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !941, file: !35, line: 2871, baseType: !1468, size: 64, align: 64, offset: 6464)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!909, !1282, !1471, !957, !1224, !909}
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DISubroutineType(types: !1473)
!1473 = !{!909, !1282, !957, !909, !909}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !941, file: !35, line: 2878, baseType: !909, size: 32, align: 32, offset: 6528)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !941, file: !35, line: 2885, baseType: !909, size: 32, align: 32, offset: 6560)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !941, file: !35, line: 3005, baseType: !909, size: 32, align: 32, offset: 6592)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !941, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !941, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !941, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !941, file: !35, line: 3037, baseType: !921, size: 64, align: 64, offset: 6720)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !941, file: !35, line: 3038, baseType: !909, size: 32, align: 32, offset: 6784)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !941, file: !35, line: 3050, baseType: !1021, size: 64, align: 64, offset: 6848)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !941, file: !35, line: 3065, baseType: !909, size: 32, align: 32, offset: 6912)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !941, file: !35, line: 3083, baseType: !909, size: 32, align: 32, offset: 6944)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !941, file: !35, line: 3092, baseType: !1003, size: 64, align: 32, offset: 6976)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !941, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !941, file: !35, line: 3106, baseType: !1003, size: 64, align: 32, offset: 7072)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !941, file: !35, line: 3113, baseType: !1489, size: 64, align: 64, offset: 7168)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1491)
!1491 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1492)
!1492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1493)
!1493 = !{!1494, !1495, !1496, !1497, !1498, !1499, !1502}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1492, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1492, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1492, file: !35, line: 720, baseType: !950, size: 64, align: 64, offset: 64)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1492, file: !35, line: 724, baseType: !950, size: 64, align: 64, offset: 128)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1492, file: !35, line: 728, baseType: !909, size: 32, align: 32, offset: 192)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1492, file: !35, line: 734, baseType: !1500, size: 64, align: 64, offset: 256)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1492, file: !35, line: 739, baseType: !1503, size: 64, align: 64, offset: 320)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !941, file: !35, line: 3129, baseType: !890, size: 64, align: 64, offset: 7232)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !941, file: !35, line: 3130, baseType: !890, size: 64, align: 64, offset: 7296)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !941, file: !35, line: 3131, baseType: !890, size: 64, align: 64, offset: 7360)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !941, file: !35, line: 3132, baseType: !890, size: 64, align: 64, offset: 7424)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !941, file: !35, line: 3139, baseType: !1100, size: 64, align: 64, offset: 7488)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !941, file: !35, line: 3147, baseType: !909, size: 32, align: 32, offset: 7552)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !941, file: !35, line: 3165, baseType: !909, size: 32, align: 32, offset: 7584)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !941, file: !35, line: 3172, baseType: !909, size: 32, align: 32, offset: 7616)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !941, file: !35, line: 3180, baseType: !909, size: 32, align: 32, offset: 7648)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !941, file: !35, line: 3191, baseType: !1319, size: 64, align: 64, offset: 7680)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !941, file: !35, line: 3199, baseType: !921, size: 64, align: 64, offset: 7744)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !941, file: !35, line: 3207, baseType: !1100, size: 64, align: 64, offset: 7808)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !941, file: !35, line: 3214, baseType: !1070, size: 32, align: 32, offset: 7872)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !941, file: !35, line: 3224, baseType: !1131, size: 64, align: 64, offset: 7936)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !941, file: !35, line: 3225, baseType: !909, size: 32, align: 32, offset: 8000)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !941, file: !35, line: 3249, baseType: !1113, size: 64, align: 64, offset: 8064)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !941, file: !35, line: 3256, baseType: !909, size: 32, align: 32, offset: 8128)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !941, file: !35, line: 3271, baseType: !909, size: 32, align: 32, offset: 8160)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !941, file: !35, line: 3279, baseType: !890, size: 64, align: 64, offset: 8192)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !941, file: !35, line: 3301, baseType: !1113, size: 64, align: 64, offset: 8256)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !941, file: !35, line: 3310, baseType: !909, size: 32, align: 32, offset: 8320)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !941, file: !35, line: 3337, baseType: !909, size: 32, align: 32, offset: 8352)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !941, file: !35, line: 3351, baseType: !909, size: 32, align: 32, offset: 8384)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !941, file: !35, line: 3359, baseType: !909, size: 32, align: 32, offset: 8416)
!1529 = !{}
!1530 = !DILocalVariable(name: "c", arg: 1, scope: !896, file: !897, line: 217, type: !900)
!1531 = !DIExpression()
!1532 = !DILocation(line: 217, column: 80, scope: !896)
!1533 = !DILocalVariable(name: "avctx", arg: 2, scope: !896, file: !897, line: 218, type: !939)
!1534 = !DILocation(line: 218, column: 58, scope: !896)
!1535 = !DILocalVariable(name: "cpu_flags", scope: !896, file: !897, line: 220, type: !909)
!1536 = !DILocation(line: 220, column: 9, scope: !896)
!1537 = !DILocation(line: 220, column: 21, scope: !896)
!1538 = !DILocation(line: 244, column: 17, scope: !1539)
!1539 = distinct !DILexicalBlock(scope: !896, file: !897, line: 244, column: 9)
!1540 = !DILocation(line: 244, column: 28, scope: !1539)
!1541 = !DILocation(line: 244, column: 9, scope: !896)
!1542 = !DILocation(line: 245, column: 15, scope: !1543)
!1543 = distinct !DILexicalBlock(scope: !1544, file: !897, line: 245, column: 13)
!1544 = distinct !DILexicalBlock(scope: !1539, file: !897, line: 244, column: 40)
!1545 = !DILocation(line: 245, column: 22, scope: !1543)
!1546 = !DILocation(line: 245, column: 28, scope: !1543)
!1547 = !DILocation(line: 245, column: 13, scope: !1544)
!1548 = !DILocation(line: 246, column: 13, scope: !1549)
!1549 = distinct !DILexicalBlock(scope: !1543, file: !897, line: 245, column: 42)
!1550 = !DILocation(line: 246, column: 16, scope: !1549)
!1551 = !DILocation(line: 246, column: 29, scope: !1549)
!1552 = !DILocation(line: 247, column: 9, scope: !1549)
!1553 = !DILocation(line: 248, column: 9, scope: !1544)
!1554 = !DILocation(line: 248, column: 12, scope: !1544)
!1555 = !DILocation(line: 248, column: 25, scope: !1544)
!1556 = !DILocation(line: 250, column: 13, scope: !1557)
!1557 = distinct !DILexicalBlock(scope: !1544, file: !897, line: 250, column: 13)
!1558 = !DILocation(line: 250, column: 20, scope: !1557)
!1559 = !DILocation(line: 250, column: 40, scope: !1557)
!1560 = !DILocation(line: 250, column: 13, scope: !1544)
!1561 = !DILocation(line: 251, column: 13, scope: !1562)
!1562 = distinct !DILexicalBlock(scope: !1557, file: !897, line: 250, column: 46)
!1563 = !DILocation(line: 251, column: 16, scope: !1562)
!1564 = !DILocation(line: 251, column: 27, scope: !1562)
!1565 = !DILocation(line: 252, column: 9, scope: !1562)
!1566 = !DILocation(line: 253, column: 5, scope: !1544)
!1567 = !DILocation(line: 255, column: 17, scope: !1568)
!1568 = distinct !DILexicalBlock(scope: !896, file: !897, line: 255, column: 9)
!1569 = !DILocation(line: 255, column: 28, scope: !1568)
!1570 = !DILocation(line: 255, column: 9, scope: !896)
!1571 = !DILocation(line: 256, column: 15, scope: !1572)
!1572 = distinct !DILexicalBlock(scope: !1573, file: !897, line: 256, column: 13)
!1573 = distinct !DILexicalBlock(scope: !1568, file: !897, line: 255, column: 40)
!1574 = !DILocation(line: 256, column: 22, scope: !1572)
!1575 = !DILocation(line: 256, column: 28, scope: !1572)
!1576 = !DILocation(line: 256, column: 13, scope: !1573)
!1577 = !DILocation(line: 257, column: 13, scope: !1578)
!1578 = distinct !DILexicalBlock(scope: !1572, file: !897, line: 256, column: 42)
!1579 = !DILocation(line: 257, column: 16, scope: !1578)
!1580 = !DILocation(line: 257, column: 29, scope: !1578)
!1581 = !DILocation(line: 258, column: 9, scope: !1578)
!1582 = !DILocation(line: 259, column: 9, scope: !1573)
!1583 = !DILocation(line: 259, column: 12, scope: !1573)
!1584 = !DILocation(line: 259, column: 25, scope: !1573)
!1585 = !DILocation(line: 260, column: 5, scope: !1573)
!1586 = !DILocation(line: 263, column: 17, scope: !1587)
!1587 = distinct !DILexicalBlock(scope: !896, file: !897, line: 263, column: 9)
!1588 = !DILocation(line: 263, column: 28, scope: !1587)
!1589 = !DILocation(line: 263, column: 9, scope: !896)
!1590 = !DILocation(line: 264, column: 15, scope: !1591)
