; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--shlibloadtest/[inter]test--shlibloadtest-bin-shlibloadtest.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--shlibloadtest/[inter]test--shlibloadtest-bin-shlibloadtest.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.ssl_ctx_st = type opaque
%union.anon = type { void ()* }
%struct.ssl_method_st = type opaque

@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [31 x i8] c"Incorrect number of arguments\0A\00", align 1
@.str.1 = private unnamed_addr constant [14 x i8] c"-crypto_first\00", align 1
@test_type = internal global i32 0, align 4
@.str.2 = private unnamed_addr constant [11 x i8] c"-ssl_first\00", align 1
@.str.3 = private unnamed_addr constant [13 x i8] c"-just_crypto\00", align 1
@.str.4 = private unnamed_addr constant [9 x i8] c"-dso_ref\00", align 1
@.str.5 = private unnamed_addr constant [11 x i8] c"-no_atexit\00", align 1
@.str.6 = private unnamed_addr constant [23 x i8] c"Unrecognised argument\0A\00", align 1
@path_crypto = internal global i8* null, align 8

!465 = !DILocation(line: 259, column: 24, scope: !466)
!466 = distinct !DILexicalBlock(scope: !462, file: !4, line: 258, column: 30)
!467 = !DILocation(line: 259, column: 17, scope: !466)
!468 = !DILocation(line: 260, column: 17, scope: !466)
!469 = !DILocation(line: 262, column: 13, scope: !455)
!470 = !DILocation(line: 262, column: 24, scope: !455)
!471 = !DILocation(line: 265, column: 5, scope: !425)
!472 = !DILocation(line: 267, column: 22, scope: !473)
!473 = distinct !DILexicalBlock(scope: !170, file: !4, line: 267, column: 9)
!474 = !DILocation(line: 267, column: 10, scope: !473)
!475 = !DILocation(line: 267, column: 9, scope: !170)
!476 = !DILocation(line: 268, column: 16, scope: !477)
!477 = distinct !DILexicalBlock(scope: !473, file: !4, line: 267, column: 34)
!478 = !DILocation(line: 268, column: 9, scope: !477)
!479 = !DILocation(line: 269, column: 9, scope: !477)
!480 = !DILocation(line: 272, column: 9, scope: !481)
!481 = distinct !DILexicalBlock(scope: !170, file: !4, line: 272, column: 9)
!482 = !DILocation(line: 272, column: 19, scope: !481)
!483 = !DILocation(line: 272, column: 35, scope: !481)
!484 = !DILocation(line: 272, column: 38, scope: !485)
!485 = !DILexicalBlockFile(scope: !481, file: !4, discriminator: 1)
!486 = !DILocation(line: 272, column: 48, scope: !485)
!487 = !DILocation(line: 272, column: 9, scope: !485)
!488 = !DILocation(line: 273, column: 26, scope: !489)
!489 = distinct !DILexicalBlock(scope: !490, file: !4, line: 273, column: 13)
!490 = distinct !DILexicalBlock(scope: !481, file: !4, line: 272, column: 62)
!491 = !DILocation(line: 273, column: 14, scope: !489)
!492 = !DILocation(line: 273, column: 13, scope: !490)
!493 = !DILocation(line: 274, column: 20, scope: !494)
!494 = distinct !DILexicalBlock(scope: !489, file: !4, line: 273, column: 35)
!495 = !DILocation(line: 274, column: 13, scope: !494)
!496 = !DILocation(line: 275, column: 13, scope: !494)
!497 = !DILocation(line: 277, column: 5, scope: !490)
!498 = !DILocation(line: 296, column: 12, scope: !170)
!499 = !DILocation(line: 296, column: 5, scope: !170)
!500 = !DILocation(line: 298, column: 12, scope: !170)
!501 = !DILocation(line: 298, column: 5, scope: !170)
!502 = distinct !DISubprogram(name: "shlib_load", scope: !4, file: !4, line: 54, type: !503, isLocal: true, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !84)
!503 = !DISubroutineType(types: !504)
!504 = !{!17, !70, !505}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!506 = !DILocalVariable(name: "filename", arg: 1, scope: !502, file: !4, line: 54, type: !70)
!507 = !DILocation(line: 54, column: 35, scope: !502)
!508 = !DILocalVariable(name: "lib", arg: 2, scope: !502, file: !4, line: 54, type: !505)
!509 = !DILocation(line: 54, column: 52, scope: !502)
!510 = !DILocalVariable(name: "dl_flags", scope: !502, file: !4, line: 56, type: !17)
!511 = !DILocation(line: 56, column: 9, scope: !502)
!512 = !DILocation(line: 61, column: 19, scope: !502)
!513 = !DILocation(line: 61, column: 29, scope: !502)
!514 = !DILocation(line: 61, column: 12, scope: !502)
!515 = !DILocation(line: 61, column: 6, scope: !502)
!516 = !DILocation(line: 61, column: 10, scope: !502)
!517 = !DILocation(line: 62, column: 13, scope: !502)
!518 = !DILocation(line: 62, column: 12, scope: !502)
!519 = !DILocation(line: 62, column: 17, scope: !502)
!520 = !DILocation(line: 62, column: 5, scope: !502)
!521 = distinct !DISubprogram(name: "shlib_sym", scope: !4, file: !4, line: 65, type: !522, isLocal: true, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !84)
!522 = !DISubroutineType(types: !523)
!523 = !{!17, !174, !70, !524}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!525 = !DILocalVariable(name: "lib", arg: 1, scope: !521, file: !4, line: 65, type: !174)
!526 = !DILocation(line: 65, column: 28, scope: !521)
!527 = !DILocalVariable(name: "symname", arg: 2, scope: !521, file: !4, line: 65, type: !70)
!528 = !DILocation(line: 65, column: 45, scope: !521)
!529 = !DILocalVariable(name: "sym", arg: 3, scope: !521, file: !4, line: 65, type: !524)
!530 = !DILocation(line: 65, column: 65, scope: !521)
!531 = !DILocation(line: 67, column: 18, scope: !521)
!532 = !DILocation(line: 67, column: 23, scope: !521)
!533 = !DILocation(line: 67, column: 12, scope: !521)
!534 = !DILocation(line: 67, column: 6, scope: !521)
!535 = !DILocation(line: 67, column: 10, scope: !521)
!536 = !DILocation(line: 68, column: 13, scope: !521)
!537 = !DILocation(line: 68, column: 12, scope: !521)
!538 = !DILocation(line: 68, column: 17, scope: !521)
!539 = !DILocation(line: 68, column: 5, scope: !521)
!540 = distinct !DISubprogram(name: "atexit_handler", scope: !4, file: !4, line: 109, type: !54, isLocal: true, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !84)
!541 = !DILocalVariable(name: "atexit_file", scope: !540, file: !4, line: 111, type: !542)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !544, line: 48, baseType: !545)
!544 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--shlibloadtest")
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !546, line: 241, size: 1728, align: 64, elements: !547)
!546 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--shlibloadtest")
!547 = !{!548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !568, !569, !570, !571, !575, !577, !579, !583, !586, !588, !589, !590, !591, !592, !595, !596}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !545, file: !546, line: 242, baseType: !17, size: 32, align: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !545, file: !546, line: 247, baseType: !83, size: 64, align: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !545, file: !546, line: 248, baseType: !83, size: 64, align: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !545, file: !546, line: 249, baseType: !83, size: 64, align: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !545, file: !546, line: 250, baseType: !83, size: 64, align: 64, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !545, file: !546, line: 251, baseType: !83, size: 64, align: 64, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !545, file: !546, line: 252, baseType: !83, size: 64, align: 64, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !545, file: !546, line: 253, baseType: !83, size: 64, align: 64, offset: 448)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !545, file: !546, line: 254, baseType: !83, size: 64, align: 64, offset: 512)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !545, file: !546, line: 256, baseType: !83, size: 64, align: 64, offset: 576)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !545, file: !546, line: 257, baseType: !83, size: 64, align: 64, offset: 640)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !545, file: !546, line: 258, baseType: !83, size: 64, align: 64, offset: 704)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !545, file: !546, line: 260, baseType: !561, size: 64, align: 64, offset: 768)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64, align: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !546, line: 156, size: 192, align: 64, elements: !563)
!563 = !{!564, !565, !567}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !562, file: !546, line: 157, baseType: !561, size: 64, align: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !562, file: !546, line: 158, baseType: !566, size: 64, align: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !562, file: !546, line: 162, baseType: !17, size: 32, align: 32, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !545, file: !546, line: 262, baseType: !566, size: 64, align: 64, offset: 832)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !545, file: !546, line: 264, baseType: !17, size: 32, align: 32, offset: 896)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !545, file: !546, line: 268, baseType: !17, size: 32, align: 32, offset: 928)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !545, file: !546, line: 270, baseType: !572, size: 64, align: 64, offset: 960)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !573, line: 131, baseType: !574)
!573 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--shlibloadtest")
!574 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !545, file: !546, line: 274, baseType: !576, size: 16, align: 16, offset: 1024)
!576 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !545, file: !546, line: 275, baseType: !578, size: 8, align: 8, offset: 1040)
!578 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !545, file: !546, line: 276, baseType: !580, size: 8, align: 8, offset: 1048)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 8, align: 8, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 1)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !545, file: !546, line: 280, baseType: !584, size: 64, align: 64, offset: 1088)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !546, line: 150, baseType: null)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !545, file: !546, line: 289, baseType: !587, size: 64, align: 64, offset: 1152)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !573, line: 132, baseType: !574)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !545, file: !546, line: 297, baseType: !12, size: 64, align: 64, offset: 1216)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !545, file: !546, line: 298, baseType: !12, size: 64, align: 64, offset: 1280)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !545, file: !546, line: 299, baseType: !12, size: 64, align: 64, offset: 1344)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !545, file: !546, line: 300, baseType: !12, size: 64, align: 64, offset: 1408)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !545, file: !546, line: 302, baseType: !593, size: 64, align: 64, offset: 1472)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !594, line: 216, baseType: !20)
!594 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--shlibloadtest")
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !545, file: !546, line: 303, baseType: !17, size: 32, align: 32, offset: 1536)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !545, file: !546, line: 305, baseType: !597, size: 160, align: 8, offset: 1568)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 160, align: 8, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 20)
!600 = !DILocation(line: 111, column: 11, scope: !540)
!601 = !DILocation(line: 111, column: 31, scope: !540)
!602 = !DILocation(line: 111, column: 25, scope: !540)
!603 = !DILocation(line: 113, column: 9, scope: !604)
!604 = distinct !DILexicalBlock(scope: !540, file: !4, line: 113, column: 9)
!605 = !DILocation(line: 113, column: 21, scope: !604)
!606 = !DILocation(line: 113, column: 9, scope: !540)
!607 = !DILocation(line: 114, column: 9, scope: !604)
!608 = !DILocation(line: 116, column: 13, scope: !540)
!609 = !DILocation(line: 116, column: 5, scope: !540)
!610 = !DILocation(line: 117, column: 12, scope: !540)
!611 = !DILocation(line: 117, column: 5, scope: !540)
!612 = !DILocation(line: 118, column: 24, scope: !540)
!613 = !DILocation(line: 119, column: 1, scope: !540)
!614 = !DILocation(line: 119, column: 1, scope: !615)
!615 = !DILexicalBlockFile(scope: !540, file: !4, discriminator: 1)
!616 = distinct !DISubprogram(name: "shlib_close", scope: !4, file: !4, line: 71, type: !617, isLocal: true, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !84)
!617 = !DISubroutineType(types: !618)
!618 = !{!17, !174}
!619 = !DILocalVariable(name: "lib", arg: 1, scope: !616, file: !4, line: 71, type: !174)
!620 = !DILocation(line: 71, column: 30, scope: !616)
!621 = !DILocation(line: 73, column: 20, scope: !616)
!622 = !DILocation(line: 73, column: 12, scope: !616)
!623 = !DILocation(line: 73, column: 25, scope: !616)
!624 = !DILocation(line: 73, column: 5, scope: !616)
