; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--vf_threshold.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--vf_threshold.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFilterPad = type { i8*, i32, %struct.AVFrame* (%struct.AVFilterLink*, i32, i32)*, %struct.AVFrame* (%struct.AVFilterLink*, i32)*, i32 (%struct.AVFilterLink*, %struct.AVFrame*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32, i32 }
%struct.AVFrame = type { [8 x i8*], [8 x i32], i8**, i32, i32, i32, i32, i32, i32, %struct.AVRational, i64, i64, i64, i32, i32, i32, i8*, [8 x i64], i32, i32, i32, i32, i64, i32, i64, [8 x %struct.AVBufferRef*], %struct.AVBufferRef**, i32, %struct.AVFrameSideData**, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, %struct.AVDictionary*, i32, i32, i32, i8*, i32, i32, %struct.AVBufferRef*, %struct.AVBufferRef*, %struct.AVBufferRef*, i64, i64, i64, i64, %struct.AVBufferRef* }
%struct.AVRational = type { i32, i32 }
%struct.AVFrameSideData = type { i32, i8*, i32, %struct.AVDictionary*, %struct.AVBufferRef* }
%struct.AVDictionary = type opaque
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

!109 = !DIEnumerator(name: "AVCOL_TRC_BT709", value: 1)
!110 = !DIEnumerator(name: "AVCOL_TRC_UNSPECIFIED", value: 2)
!111 = !DIEnumerator(name: "AVCOL_TRC_RESERVED", value: 3)
!112 = !DIEnumerator(name: "AVCOL_TRC_GAMMA22", value: 4)
!113 = !DIEnumerator(name: "AVCOL_TRC_GAMMA28", value: 5)
!114 = !DIEnumerator(name: "AVCOL_TRC_SMPTE170M", value: 6)
!115 = !DIEnumerator(name: "AVCOL_TRC_SMPTE240M", value: 7)
!116 = !DIEnumerator(name: "AVCOL_TRC_LINEAR", value: 8)
!117 = !DIEnumerator(name: "AVCOL_TRC_LOG", value: 9)
!118 = !DIEnumerator(name: "AVCOL_TRC_LOG_SQRT", value: 10)
!119 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_4", value: 11)
!120 = !DIEnumerator(name: "AVCOL_TRC_BT1361_ECG", value: 12)
!121 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_1", value: 13)
!122 = !DIEnumerator(name: "AVCOL_TRC_BT2020_10", value: 14)
!123 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!124 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!125 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!126 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!127 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!128 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!129 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !82, line: 493, size: 32, align: 32, elements: !131)
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148}
!132 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!133 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!134 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!135 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!136 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!137 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!138 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!139 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!140 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!141 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!142 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!143 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!144 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!145 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!146 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!147 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!148 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !82, line: 538, size: 32, align: 32, elements: !150)
!150 = !{!151, !152, !153, !154, !155, !156, !157, !158}
!151 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!152 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!153 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!154 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!155 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!156 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!157 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!158 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!159 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVMediaType", file: !47, line: 199, size: 32, align: 32, elements: !160)
!160 = !{!161, !162, !163, !164, !165, !166, !167}
!161 = !DIEnumerator(name: "AVMEDIA_TYPE_UNKNOWN", value: -1)
!162 = !DIEnumerator(name: "AVMEDIA_TYPE_VIDEO", value: 0)
!163 = !DIEnumerator(name: "AVMEDIA_TYPE_AUDIO", value: 1)
!164 = !DIEnumerator(name: "AVMEDIA_TYPE_DATA", value: 2)
!165 = !DIEnumerator(name: "AVMEDIA_TYPE_SUBTITLE", value: 3)
!166 = !DIEnumerator(name: "AVMEDIA_TYPE_ATTACHMENT", value: 4)
!167 = !DIEnumerator(name: "AVMEDIA_TYPE_NB", value: 5)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !170, file: !169, line: 503, size: 32, align: 32, elements: !575)
!169 = !DIFile(filename: "libavfilter/avfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterLink", file: !169, line: 439, size: 493504, align: 64, elements: !171)
!171 = !{!172, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !536, !537, !538, !539, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !170, file: !169, line: 440, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterContext", file: !169, line: 67, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterContext", file: !169, line: 338, size: 1344, align: 64, elements: !176)
!176 = !{!177, !264, !436, !437, !439, !441, !443, !444, !445, !446, !447, !487, !488, !494, !503, !504, !505, !507, !508, !509, !510, !511}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !175, file: !169, line: 339, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !182)
!182 = !{!183, !187, !192, !223, !224, !225, !226, !230, !236, !238, !242}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !181, file: !26, line: 72, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !181, file: !26, line: 78, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!184, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !181, file: !26, line: 85, baseType: !193, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !196)
!196 = !{!197, !198, !199, !201, !202, !219, !220, !221, !222}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !4, line: 247, baseType: !184, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !195, file: !4, line: 253, baseType: !184, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !195, file: !4, line: 259, baseType: !200, size: 32, align: 32, offset: 128)
!200 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !195, file: !4, line: 271, baseType: !203, size: 64, align: 64, offset: 192)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !195, file: !4, line: 265, size: 64, align: 64, elements: !204)
!204 = !{!205, !209, !211, !212}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !203, file: !4, line: 266, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !207, line: 40, baseType: !208)
!207 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!208 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !203, file: !4, line: 267, baseType: !210, size: 64, align: 64)
!210 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !203, file: !4, line: 268, baseType: !184, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !203, file: !4, line: 270, baseType: !213, size: 64, align: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !214, line: 61, baseType: !215)
!214 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !214, line: 58, size: 64, align: 32, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !215, file: !214, line: 59, baseType: !200, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !215, file: !214, line: 60, baseType: !200, size: 32, align: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !195, file: !4, line: 272, baseType: !210, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !195, file: !4, line: 273, baseType: !210, size: 64, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !195, file: !4, line: 275, baseType: !200, size: 32, align: 32, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !195, file: !4, line: 300, baseType: !184, size: 64, align: 64, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !181, file: !26, line: 93, baseType: !200, size: 32, align: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !181, file: !26, line: 99, baseType: !200, size: 32, align: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !181, file: !26, line: 108, baseType: !200, size: 32, align: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !181, file: !26, line: 113, baseType: !227, size: 64, align: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!191, !191, !191}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !181, file: !26, line: 123, baseType: !231, size: 64, align: 64, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!234, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !181, file: !26, line: 130, baseType: !237, size: 32, align: 32, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !181, file: !26, line: 136, baseType: !239, size: 64, align: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!237, !191}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !181, file: !26, line: 142, baseType: !243, size: 64, align: 64, offset: 576)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!200, !246, !191, !184, !200}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !249)
!249 = !{!250, !262, !263}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !248, file: !4, line: 360, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !254, file: !4, line: 307, baseType: !184, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !254, file: !4, line: 313, baseType: !210, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !254, file: !4, line: 313, baseType: !210, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !254, file: !4, line: 318, baseType: !210, size: 64, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !254, file: !4, line: 318, baseType: !210, size: 64, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !254, file: !4, line: 323, baseType: !200, size: 32, align: 32, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !248, file: !4, line: 364, baseType: !200, size: 32, align: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !248, file: !4, line: 368, baseType: !200, size: 32, align: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !175, file: !169, line: 341, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilter", file: !169, line: 328, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilter", file: !169, line: 144, size: 1024, align: 64, elements: !269)
!269 = !{!270, !271, !272, !404, !405, !406, !407, !411, !412, !417, !421, !422, !423, !424, !426, !431, !435}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !169, line: 148, baseType: !184, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !268, file: !169, line: 155, baseType: !184, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !268, file: !169, line: 164, baseType: !273, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterPad", file: !169, line: 69, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterPad", file: !277, line: 54, size: 576, align: 64, elements: !278)
!277 = !DIFile(filename: "libavfilter/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!278 = !{!279, !280, !281, !388, !392, !396, !400, !401, !402, !403}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !277, line: 60, baseType: !184, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !276, file: !277, line: 65, baseType: !159, size: 32, align: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "get_video_buffer", scope: !276, file: !277, line: 73, baseType: !282, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!285, !386, !200, !200}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !58, line: 646, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !58, line: 268, size: 4288, align: 64, elements: !288)
!288 = !{!289, !296, !298, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !318, !319, !320, !321, !322, !323, !324, !325, !338, !340, !341, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !374, !375, !376, !377, !378, !379, !382, !383, !384, !385}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !287, file: !58, line: 282, baseType: !290, size: 512, align: 64)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 512, align: 64, elements: !294)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !207, line: 48, baseType: !293)
!293 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!294 = !{!295}
!295 = !DISubrange(count: 8)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !287, file: !58, line: 299, baseType: !297, size: 256, align: 32, offset: 512)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 256, align: 32, elements: !294)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !287, file: !58, line: 315, baseType: !299, size: 64, align: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !287, file: !58, line: 326, baseType: !200, size: 32, align: 32, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !287, file: !58, line: 326, baseType: !200, size: 32, align: 32, offset: 864)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !287, file: !58, line: 334, baseType: !200, size: 32, align: 32, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !287, file: !58, line: 341, baseType: !200, size: 32, align: 32, offset: 928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !287, file: !58, line: 346, baseType: !200, size: 32, align: 32, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !287, file: !58, line: 351, baseType: !46, size: 32, align: 32, offset: 992)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !287, file: !58, line: 356, baseType: !213, size: 64, align: 32, offset: 1024)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !287, file: !58, line: 361, baseType: !206, size: 64, align: 64, offset: 1088)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !287, file: !58, line: 369, baseType: !206, size: 64, align: 64, offset: 1152)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !287, file: !58, line: 377, baseType: !206, size: 64, align: 64, offset: 1216)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !287, file: !58, line: 382, baseType: !200, size: 32, align: 32, offset: 1280)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !287, file: !58, line: 386, baseType: !200, size: 32, align: 32, offset: 1312)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !287, file: !58, line: 391, baseType: !200, size: 32, align: 32, offset: 1344)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !287, file: !58, line: 396, baseType: !191, size: 64, align: 64, offset: 1408)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !287, file: !58, line: 403, baseType: !315, size: 512, align: 64, offset: 1472)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 512, align: 64, elements: !294)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !207, line: 55, baseType: !317)
!317 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !287, file: !58, line: 410, baseType: !200, size: 32, align: 32, offset: 1984)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !287, file: !58, line: 415, baseType: !200, size: 32, align: 32, offset: 2016)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !287, file: !58, line: 420, baseType: !200, size: 32, align: 32, offset: 2048)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !287, file: !58, line: 425, baseType: !200, size: 32, align: 32, offset: 2080)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !287, file: !58, line: 435, baseType: !206, size: 64, align: 64, offset: 2112)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !287, file: !58, line: 440, baseType: !200, size: 32, align: 32, offset: 2176)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !287, file: !58, line: 445, baseType: !316, size: 64, align: 64, offset: 2240)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !287, file: !58, line: 459, baseType: !326, size: 512, align: 64, offset: 2304)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 512, align: 64, elements: !294)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !329, line: 94, baseType: !330)
!329 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !329, line: 81, size: 192, align: 64, elements: !331)
!331 = !{!332, !336, !337}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !330, file: !329, line: 82, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !329, line: 73, baseType: !335)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !329, line: 73, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !330, file: !329, line: 89, baseType: !291, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !330, file: !329, line: 93, baseType: !200, size: 32, align: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !287, file: !58, line: 473, baseType: !339, size: 64, align: 64, offset: 2816)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !287, file: !58, line: 477, baseType: !200, size: 32, align: 32, offset: 2880)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !287, file: !58, line: 479, baseType: !342, size: 64, align: 64, offset: 2944)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !58, line: 207, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !58, line: 201, size: 320, align: 64, elements: !346)
!346 = !{!347, !348, !349, !350, !355}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !345, file: !58, line: 202, baseType: !57, size: 32, align: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !345, file: !58, line: 203, baseType: !291, size: 64, align: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !345, file: !58, line: 204, baseType: !200, size: 32, align: 32, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !345, file: !58, line: 205, baseType: !351, size: 64, align: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !353, line: 86, baseType: !354)
!353 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !353, line: 86, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !345, file: !58, line: 206, baseType: !327, size: 64, align: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !287, file: !58, line: 480, baseType: !200, size: 32, align: 32, offset: 3008)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !58, line: 505, baseType: !200, size: 32, align: 32, offset: 3040)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !287, file: !58, line: 512, baseType: !81, size: 32, align: 32, offset: 3072)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !287, file: !58, line: 514, baseType: !88, size: 32, align: 32, offset: 3104)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !287, file: !58, line: 516, baseType: !106, size: 32, align: 32, offset: 3136)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !287, file: !58, line: 523, baseType: !130, size: 32, align: 32, offset: 3168)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !287, file: !58, line: 525, baseType: !149, size: 32, align: 32, offset: 3200)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !287, file: !58, line: 532, baseType: !206, size: 64, align: 64, offset: 3264)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !287, file: !58, line: 539, baseType: !206, size: 64, align: 64, offset: 3328)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !287, file: !58, line: 547, baseType: !206, size: 64, align: 64, offset: 3392)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !287, file: !58, line: 554, baseType: !351, size: 64, align: 64, offset: 3456)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !287, file: !58, line: 563, baseType: !200, size: 32, align: 32, offset: 3520)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !287, file: !58, line: 572, baseType: !200, size: 32, align: 32, offset: 3552)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !287, file: !58, line: 581, baseType: !200, size: 32, align: 32, offset: 3584)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !287, file: !58, line: 588, baseType: !371, size: 64, align: 64, offset: 3648)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !207, line: 36, baseType: !373)
!373 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !287, file: !58, line: 593, baseType: !200, size: 32, align: 32, offset: 3712)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !287, file: !58, line: 596, baseType: !200, size: 32, align: 32, offset: 3744)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !287, file: !58, line: 599, baseType: !327, size: 64, align: 64, offset: 3776)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !287, file: !58, line: 605, baseType: !327, size: 64, align: 64, offset: 3840)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !287, file: !58, line: 616, baseType: !327, size: 64, align: 64, offset: 3904)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !287, file: !58, line: 626, baseType: !380, size: 64, align: 64, offset: 3968)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !381, line: 216, baseType: !317)
!381 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!382 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !287, file: !58, line: 627, baseType: !380, size: 64, align: 64, offset: 4032)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !287, file: !58, line: 628, baseType: !380, size: 64, align: 64, offset: 4096)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !287, file: !58, line: 629, baseType: !380, size: 64, align: 64, offset: 4160)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !287, file: !58, line: 645, baseType: !327, size: 64, align: 64, offset: 4224)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterLink", file: !169, line: 68, baseType: !170)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "get_audio_buffer", scope: !276, file: !277, line: 81, baseType: !389, size: 64, align: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!285, !386, !200}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "filter_frame", scope: !276, file: !277, line: 93, baseType: !393, size: 64, align: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!200, !386, !285}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "poll_frame", scope: !276, file: !277, line: 104, baseType: !397, size: 64, align: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!200, !386}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "request_frame", scope: !276, file: !277, line: 113, baseType: !397, size: 64, align: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "config_props", scope: !276, file: !277, line: 129, baseType: !397, size: 64, align: 64, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "needs_fifo", scope: !276, file: !277, line: 137, baseType: !200, size: 32, align: 32, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "needs_writable", scope: !276, file: !277, line: 145, baseType: !200, size: 32, align: 32, offset: 544)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !268, file: !169, line: 172, baseType: !273, size: 64, align: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !268, file: !169, line: 182, baseType: !178, size: 64, align: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !268, file: !169, line: 187, baseType: !200, size: 32, align: 32, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "preinit", scope: !268, file: !169, line: 210, baseType: !408, size: 64, align: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!200, !173}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !268, file: !169, line: 233, baseType: !408, size: 64, align: 64, offset: 448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "init_dict", scope: !268, file: !169, line: 246, baseType: !413, size: 64, align: 64, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!200, !173, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !268, file: !169, line: 258, baseType: !418, size: 64, align: 64, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !173}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "query_formats", scope: !268, file: !169, line: 282, baseType: !408, size: 64, align: 64, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "priv_size", scope: !268, file: !169, line: 284, baseType: !200, size: 32, align: 32, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flags_internal", scope: !268, file: !169, line: 286, baseType: !200, size: 32, align: 32, offset: 736)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !169, line: 292, baseType: !425, size: 64, align: 64, offset: 768)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "process_command", scope: !268, file: !169, line: 306, baseType: !427, size: 64, align: 64, offset: 832)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!200, !173, !184, !184, !430, !200, !200}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "init_opaque", scope: !268, file: !169, line: 313, baseType: !432, size: 64, align: 64, offset: 896)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!200, !173, !191}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !268, file: !169, line: 327, baseType: !408, size: 64, align: 64, offset: 960)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !169, line: 343, baseType: !430, size: 64, align: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "input_pads", scope: !175, file: !169, line: 345, baseType: !438, size: 64, align: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !175, file: !169, line: 346, baseType: !440, size: 64, align: 64, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !175, file: !169, line: 347, baseType: !442, size: 32, align: 32, offset: 320)
!442 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "output_pads", scope: !175, file: !169, line: 349, baseType: !438, size: 64, align: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !175, file: !169, line: 350, baseType: !440, size: 64, align: 64, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "nb_outputs", scope: !175, file: !169, line: 351, baseType: !442, size: 32, align: 32, offset: 512)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !175, file: !169, line: 353, baseType: !191, size: 64, align: 64, offset: 576)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !175, file: !169, line: 355, baseType: !448, size: 64, align: 64, offset: 640)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraph", file: !169, line: 840, size: 768, align: 64, elements: !450)
!450 = !{!451, !452, !454, !455, !456, !457, !458, !459, !481, !482, !483, !484, !485, !486}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !449, file: !169, line: 841, baseType: !178, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !449, file: !169, line: 842, baseType: !453, size: 64, align: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "nb_filters", scope: !449, file: !169, line: 843, baseType: !442, size: 32, align: 32, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "scale_sws_opts", scope: !449, file: !169, line: 845, baseType: !430, size: 64, align: 64, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "resample_lavr_opts", scope: !449, file: !169, line: 847, baseType: !430, size: 64, align: 64, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !449, file: !169, line: 862, baseType: !200, size: 32, align: 32, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !449, file: !169, line: 869, baseType: !200, size: 32, align: 32, offset: 352)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !449, file: !169, line: 874, baseType: !460, size: 64, align: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterGraphInternal", file: !169, line: 809, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraphInternal", file: !277, line: 148, size: 192, align: 64, elements: !463)
!463 = !{!464, !465, !475}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !462, file: !277, line: 149, baseType: !191, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "thread_execute", scope: !462, file: !277, line: 150, baseType: !466, size: 64, align: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_execute_func", file: !169, line: 837, baseType: !468)
!468 = !DISubroutineType(types: !469)
!469 = !{!200, !173, !470, !191, !474, !200}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_action_func", file: !169, line: 823, baseType: !472)
!472 = !DISubroutineType(types: !473)
!473 = !{!200, !173, !191, !200, !200}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "frame_queues", scope: !462, file: !277, line: 151, baseType: !476, size: 8, align: 8, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameQueueGlobal", file: !477, line: 48, baseType: !478)
!477 = !DIFile(filename: "libavfilter/framequeue.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameQueueGlobal", file: !477, line: 46, size: 8, align: 8, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !478, file: !477, line: 47, baseType: !186, size: 8, align: 8)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !449, file: !169, line: 881, baseType: !191, size: 64, align: 64, offset: 448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !449, file: !169, line: 895, baseType: !466, size: 64, align: 64, offset: 512)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "aresample_swr_opts", scope: !449, file: !169, line: 897, baseType: !430, size: 64, align: 64, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links", scope: !449, file: !169, line: 906, baseType: !440, size: 64, align: 64, offset: 640)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links_count", scope: !449, file: !169, line: 907, baseType: !200, size: 32, align: 32, offset: 704)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "disable_auto_convert", scope: !449, file: !169, line: 909, baseType: !442, size: 32, align: 32, offset: 736)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !175, file: !169, line: 373, baseType: !200, size: 32, align: 32, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !175, file: !169, line: 378, baseType: !489, size: 64, align: 64, offset: 768)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterInternal", file: !169, line: 335, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterInternal", file: !277, line: 154, size: 64, align: 64, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !491, file: !277, line: 155, baseType: !466, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "command_queue", scope: !175, file: !169, line: 380, baseType: !495, size: 64, align: 64, offset: 832)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterCommand", file: !277, line: 38, size: 320, align: 64, elements: !497)
!497 = !{!498, !499, !500, !501, !502}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !496, file: !277, line: 39, baseType: !210, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !496, file: !277, line: 40, baseType: !430, size: 64, align: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !496, file: !277, line: 41, baseType: !430, size: 64, align: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !496, file: !277, line: 42, baseType: !200, size: 32, align: 32, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !277, line: 43, baseType: !495, size: 64, align: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "enable_str", scope: !175, file: !169, line: 382, baseType: !430, size: 64, align: 64, offset: 896)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !175, file: !169, line: 383, baseType: !191, size: 64, align: 64, offset: 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "var_values", scope: !175, file: !169, line: 384, baseType: !506, size: 64, align: 64, offset: 1024)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "is_disabled", scope: !175, file: !169, line: 385, baseType: !200, size: 32, align: 32, offset: 1088)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !175, file: !169, line: 394, baseType: !327, size: 64, align: 64, offset: 1152)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !175, file: !169, line: 401, baseType: !200, size: 32, align: 32, offset: 1216)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !175, file: !169, line: 408, baseType: !442, size: 32, align: 32, offset: 1248)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !175, file: !169, line: 424, baseType: !200, size: 32, align: 32, offset: 1280)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "srcpad", scope: !170, file: !169, line: 441, baseType: !438, size: 64, align: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !170, file: !169, line: 443, baseType: !173, size: 64, align: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dstpad", scope: !170, file: !169, line: 444, baseType: !438, size: 64, align: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !169, line: 446, baseType: !159, size: 32, align: 32, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !170, file: !169, line: 449, baseType: !200, size: 32, align: 32, offset: 288)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !170, file: !169, line: 450, baseType: !200, size: 32, align: 32, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !170, file: !169, line: 451, baseType: !213, size: 64, align: 32, offset: 352)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !170, file: !169, line: 453, baseType: !316, size: 64, align: 64, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !170, file: !169, line: 454, baseType: !200, size: 32, align: 32, offset: 512)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !170, file: !169, line: 456, baseType: !200, size: 32, align: 32, offset: 544)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !170, file: !169, line: 465, baseType: !213, size: 64, align: 32, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "in_formats", scope: !170, file: !169, line: 481, baseType: !524, size: 64, align: 64, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterFormats", file: !169, line: 70, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterFormats", file: !527, line: 64, size: 256, align: 64, elements: !528)
!527 = !DIFile(filename: "libavfilter/formats.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!528 = !{!529, !530, !531, !532}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nb_formats", scope: !526, file: !527, line: 65, baseType: !442, size: 32, align: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !526, file: !527, line: 66, baseType: !474, size: 64, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !526, file: !527, line: 68, baseType: !442, size: 32, align: 32, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !526, file: !527, line: 69, baseType: !533, size: 64, align: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "out_formats", scope: !170, file: !169, line: 482, baseType: !524, size: 64, align: 64, offset: 704)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "in_samplerates", scope: !170, file: !169, line: 488, baseType: !524, size: 64, align: 64, offset: 768)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "out_samplerates", scope: !170, file: !169, line: 489, baseType: !524, size: 64, align: 64, offset: 832)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "in_channel_layouts", scope: !170, file: !169, line: 490, baseType: !540, size: 64, align: 64, offset: 896)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterChannelLayouts", file: !527, line: 85, size: 256, align: 64, elements: !542)
!542 = !{!543, !545, !546, !547, !548, !549}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !541, file: !527, line: 86, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "nb_channel_layouts", scope: !541, file: !527, line: 87, baseType: !200, size: 32, align: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "all_layouts", scope: !541, file: !527, line: 88, baseType: !186, size: 8, align: 8, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "all_counts", scope: !541, file: !527, line: 89, baseType: !186, size: 8, align: 8, offset: 104)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !541, file: !527, line: 91, baseType: !442, size: 32, align: 32, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !541, file: !527, line: 92, baseType: !550, size: 64, align: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "out_channel_layouts", scope: !170, file: !169, line: 491, baseType: !540, size: 64, align: 64, offset: 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "request_samples", scope: !170, file: !169, line: 500, baseType: !200, size: 32, align: 32, offset: 1024)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !170, file: !169, line: 507, baseType: !168, size: 32, align: 32, offset: 1056)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !170, file: !169, line: 512, baseType: !448, size: 64, align: 64, offset: 1088)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts", scope: !170, file: !169, line: 518, baseType: !206, size: 64, align: 64, offset: 1152)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts_us", scope: !170, file: !169, line: 524, baseType: !206, size: 64, align: 64, offset: 1216)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "age_index", scope: !170, file: !169, line: 529, baseType: !200, size: 32, align: 32, offset: 1280)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !170, file: !169, line: 542, baseType: !213, size: 64, align: 32, offset: 1312)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf", scope: !170, file: !169, line: 547, baseType: !285, size: 64, align: 64, offset: 1408)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf_size", scope: !170, file: !169, line: 553, baseType: !200, size: 32, align: 32, offset: 1472)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "min_samples", scope: !170, file: !169, line: 562, baseType: !200, size: 32, align: 32, offset: 1504)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "max_samples", scope: !170, file: !169, line: 568, baseType: !200, size: 32, align: 32, offset: 1536)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !170, file: !169, line: 573, baseType: !200, size: 32, align: 32, offset: 1568)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !170, file: !169, line: 578, baseType: !442, size: 32, align: 32, offset: 1600)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_in", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1664)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_out", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1728)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pool", scope: !170, file: !169, line: 588, baseType: !191, size: 64, align: 64, offset: 1792)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "frame_wanted_out", scope: !170, file: !169, line: 595, baseType: !200, size: 32, align: 32, offset: 1856)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !170, file: !169, line: 601, baseType: !327, size: 64, align: 64, offset: 1920)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !170, file: !169, line: 610, baseType: !572, size: 491520, align: 8, offset: 1984)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 491520, align: 8, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 61440)
!575 = !{!576, !577, !578}
!576 = !DIEnumerator(name: "AVLINK_UNINIT", value: 0)
!577 = !DIEnumerator(name: "AVLINK_STARTINIT", value: 1)
!578 = !DIEnumerator(name: "AVLINK_INIT", value: 2)
!579 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FFFrameSyncExtMode", file: !580, line: 60, size: 32, align: 32, elements: !581)
!580 = !DIFile(filename: "libavfilter/framesync.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!581 = !{!582, !583, !584}
!582 = !DIEnumerator(name: "EXT_STOP", value: 0)
!583 = !DIEnumerator(name: "EXT_NULL", value: 1)
!584 = !DIEnumerator(name: "EXT_INFINITY", value: 2)
!585 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPixelFormat", file: !82, line: 64, size: 32, align: 32, elements: !586)
!586 = !{!587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783}
!587 = !DIEnumerator(name: "AV_PIX_FMT_NONE", value: -1)
!588 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P", value: 0)
!589 = !DIEnumerator(name: "AV_PIX_FMT_YUYV422", value: 1)
!590 = !DIEnumerator(name: "AV_PIX_FMT_RGB24", value: 2)
!591 = !DIEnumerator(name: "AV_PIX_FMT_BGR24", value: 3)
!592 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P", value: 4)
!593 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P", value: 5)
!594 = !DIEnumerator(name: "AV_PIX_FMT_YUV410P", value: 6)
!595 = !DIEnumerator(name: "AV_PIX_FMT_YUV411P", value: 7)
!596 = !DIEnumerator(name: "AV_PIX_FMT_GRAY8", value: 8)
!597 = !DIEnumerator(name: "AV_PIX_FMT_MONOWHITE", value: 9)
!598 = !DIEnumerator(name: "AV_PIX_FMT_MONOBLACK", value: 10)
!599 = !DIEnumerator(name: "AV_PIX_FMT_PAL8", value: 11)
!600 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ420P", value: 12)
!601 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ422P", value: 13)
!602 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ444P", value: 14)
!603 = !DIEnumerator(name: "AV_PIX_FMT_UYVY422", value: 15)
!604 = !DIEnumerator(name: "AV_PIX_FMT_UYYVYY411", value: 16)
!605 = !DIEnumerator(name: "AV_PIX_FMT_BGR8", value: 17)
!606 = !DIEnumerator(name: "AV_PIX_FMT_BGR4", value: 18)
!607 = !DIEnumerator(name: "AV_PIX_FMT_BGR4_BYTE", value: 19)
!608 = !DIEnumerator(name: "AV_PIX_FMT_RGB8", value: 20)
!609 = !DIEnumerator(name: "AV_PIX_FMT_RGB4", value: 21)
!610 = !DIEnumerator(name: "AV_PIX_FMT_RGB4_BYTE", value: 22)
!611 = !DIEnumerator(name: "AV_PIX_FMT_NV12", value: 23)
!612 = !DIEnumerator(name: "AV_PIX_FMT_NV21", value: 24)
!613 = !DIEnumerator(name: "AV_PIX_FMT_ARGB", value: 25)
!614 = !DIEnumerator(name: "AV_PIX_FMT_RGBA", value: 26)
!615 = !DIEnumerator(name: "AV_PIX_FMT_ABGR", value: 27)
!616 = !DIEnumerator(name: "AV_PIX_FMT_BGRA", value: 28)
!617 = !DIEnumerator(name: "AV_PIX_FMT_GRAY16BE", value: 29)
!618 = !DIEnumerator(name: "AV_PIX_FMT_GRAY16LE", value: 30)
!619 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P", value: 31)
!620 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ440P", value: 32)
!621 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P", value: 33)
!622 = !DIEnumerator(name: "AV_PIX_FMT_RGB48BE", value: 34)
!623 = !DIEnumerator(name: "AV_PIX_FMT_RGB48LE", value: 35)
!624 = !DIEnumerator(name: "AV_PIX_FMT_RGB565BE", value: 36)
!625 = !DIEnumerator(name: "AV_PIX_FMT_RGB565LE", value: 37)
!626 = !DIEnumerator(name: "AV_PIX_FMT_RGB555BE", value: 38)
!627 = !DIEnumerator(name: "AV_PIX_FMT_RGB555LE", value: 39)
!628 = !DIEnumerator(name: "AV_PIX_FMT_BGR565BE", value: 40)
!629 = !DIEnumerator(name: "AV_PIX_FMT_BGR565LE", value: 41)
!630 = !DIEnumerator(name: "AV_PIX_FMT_BGR555BE", value: 42)
!631 = !DIEnumerator(name: "AV_PIX_FMT_BGR555LE", value: 43)
!632 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_MOCO", value: 44)
!633 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_IDCT", value: 45)
!634 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_VLD", value: 46)
!635 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI", value: 46)
!636 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P16LE", value: 47)
!637 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P16BE", value: 48)
!638 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P16LE", value: 49)
!639 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P16BE", value: 50)
!640 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P16LE", value: 51)
!641 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P16BE", value: 52)
!642 = !DIEnumerator(name: "AV_PIX_FMT_DXVA2_VLD", value: 53)
!643 = !DIEnumerator(name: "AV_PIX_FMT_RGB444LE", value: 54)
!644 = !DIEnumerator(name: "AV_PIX_FMT_RGB444BE", value: 55)
!645 = !DIEnumerator(name: "AV_PIX_FMT_BGR444LE", value: 56)
!646 = !DIEnumerator(name: "AV_PIX_FMT_BGR444BE", value: 57)
!647 = !DIEnumerator(name: "AV_PIX_FMT_YA8", value: 58)
!648 = !DIEnumerator(name: "AV_PIX_FMT_Y400A", value: 58)
!649 = !DIEnumerator(name: "AV_PIX_FMT_GRAY8A", value: 58)
!650 = !DIEnumerator(name: "AV_PIX_FMT_BGR48BE", value: 59)
!651 = !DIEnumerator(name: "AV_PIX_FMT_BGR48LE", value: 60)
!652 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P9BE", value: 61)
!653 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P9LE", value: 62)
!654 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P10BE", value: 63)
!655 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P10LE", value: 64)
!656 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P10BE", value: 65)
!657 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P10LE", value: 66)
!658 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P9BE", value: 67)
!659 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P9LE", value: 68)
!660 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P10BE", value: 69)
!661 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P10LE", value: 70)
!662 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P9BE", value: 71)
!663 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P9LE", value: 72)
!664 = !DIEnumerator(name: "AV_PIX_FMT_GBRP", value: 73)
!665 = !DIEnumerator(name: "AV_PIX_FMT_GBR24P", value: 73)
!666 = !DIEnumerator(name: "AV_PIX_FMT_GBRP9BE", value: 74)
!667 = !DIEnumerator(name: "AV_PIX_FMT_GBRP9LE", value: 75)
!668 = !DIEnumerator(name: "AV_PIX_FMT_GBRP10BE", value: 76)
!669 = !DIEnumerator(name: "AV_PIX_FMT_GBRP10LE", value: 77)
!670 = !DIEnumerator(name: "AV_PIX_FMT_GBRP16BE", value: 78)
!671 = !DIEnumerator(name: "AV_PIX_FMT_GBRP16LE", value: 79)
!672 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P", value: 80)
!673 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P", value: 81)
!674 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P9BE", value: 82)
!675 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P9LE", value: 83)
!676 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P9BE", value: 84)
!677 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P9LE", value: 85)
!678 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P9BE", value: 86)
!679 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P9LE", value: 87)
!680 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P10BE", value: 88)
!681 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P10LE", value: 89)
!682 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P10BE", value: 90)
!683 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P10LE", value: 91)
!684 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P10BE", value: 92)
!685 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P10LE", value: 93)
!686 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P16BE", value: 94)
!687 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P16LE", value: 95)
!688 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P16BE", value: 96)
!689 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P16LE", value: 97)
!690 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P16BE", value: 98)
!691 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P16LE", value: 99)
!692 = !DIEnumerator(name: "AV_PIX_FMT_VDPAU", value: 100)
!693 = !DIEnumerator(name: "AV_PIX_FMT_XYZ12LE", value: 101)
!694 = !DIEnumerator(name: "AV_PIX_FMT_XYZ12BE", value: 102)
!695 = !DIEnumerator(name: "AV_PIX_FMT_NV16", value: 103)
!696 = !DIEnumerator(name: "AV_PIX_FMT_NV20LE", value: 104)
!697 = !DIEnumerator(name: "AV_PIX_FMT_NV20BE", value: 105)
!698 = !DIEnumerator(name: "AV_PIX_FMT_RGBA64BE", value: 106)
!699 = !DIEnumerator(name: "AV_PIX_FMT_RGBA64LE", value: 107)
!700 = !DIEnumerator(name: "AV_PIX_FMT_BGRA64BE", value: 108)
!701 = !DIEnumerator(name: "AV_PIX_FMT_BGRA64LE", value: 109)
!702 = !DIEnumerator(name: "AV_PIX_FMT_YVYU422", value: 110)
!703 = !DIEnumerator(name: "AV_PIX_FMT_YA16BE", value: 111)
!704 = !DIEnumerator(name: "AV_PIX_FMT_YA16LE", value: 112)
!705 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP", value: 113)
!706 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP16BE", value: 114)
!707 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP16LE", value: 115)
!708 = !DIEnumerator(name: "AV_PIX_FMT_QSV", value: 116)
!709 = !DIEnumerator(name: "AV_PIX_FMT_MMAL", value: 117)
!710 = !DIEnumerator(name: "AV_PIX_FMT_D3D11VA_VLD", value: 118)
!711 = !DIEnumerator(name: "AV_PIX_FMT_CUDA", value: 119)
!712 = !DIEnumerator(name: "AV_PIX_FMT_0RGB", value: 120)
!713 = !DIEnumerator(name: "AV_PIX_FMT_RGB0", value: 121)
!714 = !DIEnumerator(name: "AV_PIX_FMT_0BGR", value: 122)
!715 = !DIEnumerator(name: "AV_PIX_FMT_BGR0", value: 123)
!716 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P12BE", value: 124)
!717 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P12LE", value: 125)
!718 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P14BE", value: 126)
!719 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P14LE", value: 127)
!720 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P12BE", value: 128)
!721 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P12LE", value: 129)
!722 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P14BE", value: 130)
!723 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P14LE", value: 131)
!724 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P12BE", value: 132)
!725 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P12LE", value: 133)
!726 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P14BE", value: 134)
!727 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P14LE", value: 135)
!728 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12BE", value: 136)
!729 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12LE", value: 137)
!730 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14BE", value: 138)
!731 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14LE", value: 139)
!732 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ411P", value: 140)
!733 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR8", value: 141)
!734 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB8", value: 142)
!735 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG8", value: 143)
!736 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG8", value: 144)
!737 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16LE", value: 145)
!738 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16BE", value: 146)
!739 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16LE", value: 147)
!740 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16BE", value: 148)
!741 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16LE", value: 149)
!742 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16BE", value: 150)
!743 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16LE", value: 151)
!744 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16BE", value: 152)
!745 = !DIEnumerator(name: "AV_PIX_FMT_XVMC", value: 153)
!746 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10LE", value: 154)
!747 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10BE", value: 155)
!748 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12LE", value: 156)
!749 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12BE", value: 157)
!750 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64LE", value: 158)
!751 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64BE", value: 159)
!752 = !DIEnumerator(name: "AV_PIX_FMT_VIDEOTOOLBOX", value: 160)
!753 = !DIEnumerator(name: "AV_PIX_FMT_P010LE", value: 161)
!754 = !DIEnumerator(name: "AV_PIX_FMT_P010BE", value: 162)
!755 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12BE", value: 163)
!756 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12LE", value: 164)
!757 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10BE", value: 165)
!758 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10LE", value: 166)
!759 = !DIEnumerator(name: "AV_PIX_FMT_MEDIACODEC", value: 167)
!760 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12BE", value: 168)
!761 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12LE", value: 169)
!762 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10BE", value: 170)
!763 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10LE", value: 171)
!764 = !DIEnumerator(name: "AV_PIX_FMT_P016LE", value: 172)
!765 = !DIEnumerator(name: "AV_PIX_FMT_P016BE", value: 173)
!766 = !DIEnumerator(name: "AV_PIX_FMT_D3D11", value: 174)
!767 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9BE", value: 175)
!768 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9LE", value: 176)
!769 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32BE", value: 177)
!770 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32LE", value: 178)
!771 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32BE", value: 179)
!772 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32LE", value: 180)
!773 = !DIEnumerator(name: "AV_PIX_FMT_DRM_PRIME", value: 181)
!774 = !DIEnumerator(name: "AV_PIX_FMT_OPENCL", value: 182)
!775 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14BE", value: 183)
!776 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14LE", value: 184)
!777 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32BE", value: 185)
!778 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32LE", value: 186)
!779 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12BE", value: 187)
!780 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12LE", value: 188)
!781 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12BE", value: 189)
!782 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12LE", value: 190)
!783 = !DIEnumerator(name: "AV_PIX_FMT_NB", value: 191)
!784 = !{!785, !789}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64, align: 64)
!786 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !207, line: 49, baseType: !788)
!788 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64, align: 64)
!790 = !{!791, !793, !797, !801, !802, !806}
!791 = distinct !DIGlobalVariable(name: "ff_vf_threshold", scope: !0, file: !792, line: 353, type: !267, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_vf_threshold)
!792 = !DIFile(filename: "libavfilter/vf_threshold.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!793 = distinct !DIGlobalVariable(name: "inputs", scope: !0, file: !792, line: 323, type: !794, isLocal: true, isDefinition: true, variable: [5 x %struct.AVFilterPad]* @inputs)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 2880, align: 64, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 5)
!797 = distinct !DIGlobalVariable(name: "outputs", scope: !0, file: !792, line: 344, type: !798, isLocal: true, isDefinition: true, variable: [2 x %struct.AVFilterPad]* @outputs)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 1152, align: 64, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 2)
!801 = distinct !DIGlobalVariable(name: "threshold_class", scope: !0, file: !792, line: 44, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @threshold_class)
!802 = distinct !DIGlobalVariable(name: "threshold_options", scope: !0, file: !792, line: 39, type: !803, isLocal: true, isDefinition: true, variable: [2 x %struct.AVOption]* @threshold_options)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !804, size: 1024, align: 64, elements: !799)
!804 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !4, line: 301, baseType: !195)
!806 = distinct !DIGlobalVariable(name: "pix_fmts", scope: !807, file: !792, line: 48, type: !809, isLocal: true, isDefinition: true, variable: [49 x i32]* @query_formats.pix_fmts)
!807 = distinct !DISubprogram(name: "query_formats", scope: !792, file: !792, line: 46, type: !409, isLocal: true, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !808)
!808 = !{}
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !810, size: 1568, align: 32, elements: !811)
!810 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !585)
!811 = !{!812}
!812 = !DISubrange(count: 49)
!813 = !{i32 2, !"Dwarf Version", i32 4}
!814 = !{i32 2, !"Debug Info Version", i32 3}
!815 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!816 = distinct !DISubprogram(name: "ff_threshold_init", scope: !792, file: !792, line: 229, type: !817, isLocal: false, isDefinition: true, scopeLine: 230, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !808)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !819}
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64, align: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThresholdContext", file: !821, line: 47, baseType: !822)
!821 = !DIFile(filename: "libavfilter/threshold.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThresholdContext", file: !821, line: 27, size: 1536, align: 64, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829, !833, !834, !841, !843}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !822, file: !821, line: 28, baseType: !178, size: 64, align: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !822, file: !821, line: 30, baseType: !200, size: 32, align: 32, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !822, file: !821, line: 31, baseType: !200, size: 32, align: 32, offset: 96)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "bpc", scope: !822, file: !821, line: 32, baseType: !200, size: 32, align: 32, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "nb_planes", scope: !822, file: !821, line: 34, baseType: !200, size: 32, align: 32, offset: 160)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !822, file: !821, line: 35, baseType: !830, size: 128, align: 32, offset: 192)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 128, align: 32, elements: !831)
!831 = !{!832}
!832 = !DISubrange(count: 4)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !822, file: !821, line: 35, baseType: !830, size: 128, align: 32, offset: 320)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !822, file: !821, line: 37, baseType: !835, size: 64, align: 64, offset: 448)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64, align: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{null, !838, !838, !838, !838, !291, !840, !840, !840, !840, !840, !200, !200}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64, align: 64)
!839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !381, line: 149, baseType: !208)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !822, file: !821, line: 45, baseType: !842, size: 256, align: 64, offset: 512)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 256, align: 64, elements: !831)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !822, file: !821, line: 46, baseType: !844, size: 768, align: 64, offset: 768)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameSync", file: !580, line: 209, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameSync", file: !580, line: 146, size: 768, align: 64, elements: !846)
!846 = !{!847, !848, !849, !850, !851, !852, !857, !858, !859, !860, !861, !862, !877, !878, !879}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !845, file: !580, line: 147, baseType: !178, size: 64, align: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !845, file: !580, line: 152, baseType: !173, size: 64, align: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "nb_in", scope: !845, file: !580, line: 157, baseType: !442, size: 32, align: 32, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !845, file: !580, line: 162, baseType: !213, size: 64, align: 32, offset: 160)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !845, file: !580, line: 167, baseType: !206, size: 64, align: 64, offset: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "on_event", scope: !845, file: !580, line: 172, baseType: !853, size: 64, align: 64, offset: 320)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64, align: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!200, !856}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64, align: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !845, file: !580, line: 177, baseType: !191, size: 64, align: 64, offset: 384)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "in_request", scope: !845, file: !580, line: 182, baseType: !442, size: 32, align: 32, offset: 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !845, file: !580, line: 188, baseType: !442, size: 32, align: 32, offset: 480)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ready", scope: !845, file: !580, line: 193, baseType: !292, size: 8, align: 8, offset: 512)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !845, file: !580, line: 198, baseType: !292, size: 8, align: 8, offset: 520)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !845, file: !580, line: 203, baseType: !863, size: 64, align: 64, offset: 576)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64, align: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameSyncIn", file: !580, line: 141, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameSyncIn", file: !580, line: 81, size: 448, align: 64, elements: !866)
!866 = !{!867, !868, !869, !870, !871, !872, !873, !874, !875, !876}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !865, file: !580, line: 86, baseType: !579, size: 32, align: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !865, file: !580, line: 91, baseType: !579, size: 32, align: 32, offset: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !865, file: !580, line: 96, baseType: !213, size: 64, align: 32, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !865, file: !580, line: 101, baseType: !285, size: 64, align: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "frame_next", scope: !865, file: !580, line: 106, baseType: !285, size: 64, align: 64, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !865, file: !580, line: 111, baseType: !206, size: 64, align: 64, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "pts_next", scope: !865, file: !580, line: 116, baseType: !206, size: 64, align: 64, offset: 320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "have_next", scope: !865, file: !580, line: 121, baseType: !292, size: 8, align: 8, offset: 384)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !865, file: !580, line: 126, baseType: !292, size: 8, align: 8, offset: 392)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !865, file: !580, line: 139, baseType: !442, size: 32, align: 32, offset: 416)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "opt_repeatlast", scope: !845, file: !580, line: 205, baseType: !200, size: 32, align: 32, offset: 640)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "opt_shortest", scope: !845, file: !580, line: 206, baseType: !200, size: 32, align: 32, offset: 672)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "opt_eof_action", scope: !845, file: !580, line: 207, baseType: !200, size: 32, align: 32, offset: 704)
!880 = !DILocalVariable(name: "s", arg: 1, scope: !816, file: !792, line: 229, type: !819)
!881 = !DIExpression()
!882 = !DILocation(line: 229, column: 42, scope: !816)
!883 = !DILocation(line: 231, column: 9, scope: !884)
!884 = distinct !DILexicalBlock(scope: !816, file: !792, line: 231, column: 9)
!885 = !DILocation(line: 231, column: 12, scope: !884)
!886 = !DILocation(line: 231, column: 18, scope: !884)
!887 = !DILocation(line: 231, column: 9, scope: !816)
!888 = !DILocation(line: 232, column: 9, scope: !889)
!889 = distinct !DILexicalBlock(scope: !884, file: !792, line: 231, column: 24)
!890 = !DILocation(line: 232, column: 12, scope: !889)
!891 = !DILocation(line: 232, column: 22, scope: !889)
!892 = !DILocation(line: 233, column: 9, scope: !889)
!893 = !DILocation(line: 233, column: 12, scope: !889)
!894 = !DILocation(line: 233, column: 16, scope: !889)
!895 = !DILocation(line: 234, column: 5, scope: !889)
!896 = !DILocation(line: 235, column: 9, scope: !897)
!897 = distinct !DILexicalBlock(scope: !884, file: !792, line: 234, column: 12)
!898 = !DILocation(line: 235, column: 12, scope: !897)
!899 = !DILocation(line: 235, column: 22, scope: !897)
!900 = !DILocation(line: 236, column: 9, scope: !897)
!901 = !DILocation(line: 236, column: 12, scope: !897)
!902 = !DILocation(line: 236, column: 16, scope: !897)
!903 = !DILocation(line: 240, column: 31, scope: !904)
!904 = distinct !DILexicalBlock(scope: !816, file: !792, line: 239, column: 9)
!905 = !DILocation(line: 240, column: 9, scope: !904)
!906 = !DILocation(line: 241, column: 1, scope: !816)
!907 = distinct !DISubprogram(name: "threshold8", scope: !792, file: !792, line: 156, type: !836, isLocal: true, isDefinition: true, scopeLine: 163, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !808)
!908 = !DILocalVariable(name: "in", arg: 1, scope: !907, file: !792, line: 156, type: !838)
!909 = !DILocation(line: 156, column: 39, scope: !907)
!910 = !DILocalVariable(name: "threshold", arg: 2, scope: !907, file: !792, line: 156, type: !838)
!911 = !DILocation(line: 156, column: 58, scope: !907)
!912 = !DILocalVariable(name: "min", arg: 3, scope: !907, file: !792, line: 157, type: !838)
!913 = !DILocation(line: 157, column: 39, scope: !907)
!914 = !DILocalVariable(name: "max", arg: 4, scope: !907, file: !792, line: 157, type: !838)
!915 = !DILocation(line: 157, column: 59, scope: !907)
!916 = !DILocalVariable(name: "out", arg: 5, scope: !907, file: !792, line: 158, type: !291)
!917 = !DILocation(line: 158, column: 33, scope: !907)
!918 = !DILocalVariable(name: "ilinesize", arg: 6, scope: !907, file: !792, line: 159, type: !840)
!919 = !DILocation(line: 159, column: 34, scope: !907)
!920 = !DILocalVariable(name: "tlinesize", arg: 7, scope: !907, file: !792, line: 159, type: !840)
!921 = !DILocation(line: 159, column: 55, scope: !907)
!922 = !DILocalVariable(name: "flinesize", arg: 8, scope: !907, file: !792, line: 160, type: !840)
!923 = !DILocation(line: 160, column: 34, scope: !907)
!924 = !DILocalVariable(name: "slinesize", arg: 9, scope: !907, file: !792, line: 160, type: !840)
!925 = !DILocation(line: 160, column: 55, scope: !907)
!926 = !DILocalVariable(name: "olinesize", arg: 10, scope: !907, file: !792, line: 161, type: !840)
!927 = !DILocation(line: 161, column: 34, scope: !907)
!928 = !DILocalVariable(name: "w", arg: 11, scope: !907, file: !792, line: 162, type: !200)
!929 = !DILocation(line: 162, column: 28, scope: !907)
!930 = !DILocalVariable(name: "h", arg: 12, scope: !907, file: !792, line: 162, type: !200)
!931 = !DILocation(line: 162, column: 35, scope: !907)
!932 = !DILocalVariable(name: "x", scope: !907, file: !792, line: 164, type: !200)
!933 = !DILocation(line: 164, column: 9, scope: !907)
!934 = !DILocalVariable(name: "y", scope: !907, file: !792, line: 164, type: !200)
!935 = !DILocation(line: 164, column: 12, scope: !907)
!936 = !DILocation(line: 166, column: 12, scope: !937)
!937 = distinct !DILexicalBlock(scope: !907, file: !792, line: 166, column: 5)
!938 = !DILocation(line: 166, column: 10, scope: !937)
!939 = !DILocation(line: 166, column: 17, scope: !940)
!940 = !DILexicalBlockFile(scope: !941, file: !792, discriminator: 1)
!941 = distinct !DILexicalBlock(scope: !937, file: !792, line: 166, column: 5)
!942 = !DILocation(line: 166, column: 21, scope: !940)
!943 = !DILocation(line: 166, column: 19, scope: !940)
!944 = !DILocation(line: 166, column: 5, scope: !940)
!945 = !DILocation(line: 167, column: 16, scope: !946)
!946 = distinct !DILexicalBlock(scope: !947, file: !792, line: 167, column: 9)
!947 = distinct !DILexicalBlock(scope: !941, file: !792, line: 166, column: 29)
!948 = !DILocation(line: 167, column: 14, scope: !946)
!949 = !DILocation(line: 167, column: 21, scope: !950)
!950 = !DILexicalBlockFile(scope: !951, file: !792, discriminator: 1)
!951 = distinct !DILexicalBlock(scope: !946, file: !792, line: 167, column: 9)
!952 = !DILocation(line: 167, column: 25, scope: !950)
!953 = !DILocation(line: 167, column: 23, scope: !950)
!954 = !DILocation(line: 167, column: 9, scope: !950)
!955 = !DILocation(line: 168, column: 25, scope: !956)
!956 = distinct !DILexicalBlock(scope: !951, file: !792, line: 167, column: 33)
!957 = !DILocation(line: 168, column: 22, scope: !956)
!958 = !DILocation(line: 168, column: 40, scope: !956)
!959 = !DILocation(line: 168, column: 30, scope: !956)
!960 = !DILocation(line: 168, column: 28, scope: !956)
!961 = !DILocation(line: 168, column: 49, scope: !962)
!962 = !DILexicalBlockFile(scope: !956, file: !792, discriminator: 1)
!963 = !DILocation(line: 168, column: 45, scope: !962)
!964 = !DILocation(line: 168, column: 22, scope: !962)
!965 = !DILocation(line: 168, column: 58, scope: !966)
!966 = !DILexicalBlockFile(scope: !956, file: !792, discriminator: 2)
!967 = !DILocation(line: 168, column: 54, scope: !966)
!968 = !DILocation(line: 168, column: 22, scope: !966)
!969 = !DILocation(line: 168, column: 22, scope: !970)
!970 = !DILexicalBlockFile(scope: !956, file: !792, discriminator: 3)
!971 = !DILocation(line: 168, column: 17, scope: !970)
!972 = !DILocation(line: 168, column: 13, scope: !970)
!973 = !DILocation(line: 168, column: 20, scope: !970)
!974 = !DILocation(line: 169, column: 9, scope: !956)
!975 = !DILocation(line: 167, column: 29, scope: !976)
!976 = !DILexicalBlockFile(scope: !951, file: !792, discriminator: 2)
!977 = !DILocation(line: 167, column: 9, scope: !976)
!978 = distinct !{!978, !979}
!979 = !DILocation(line: 167, column: 9, scope: !947)
!980 = !DILocation(line: 171, column: 15, scope: !947)
!981 = !DILocation(line: 171, column: 12, scope: !947)
!982 = !DILocation(line: 172, column: 22, scope: !947)
!983 = !DILocation(line: 172, column: 19, scope: !947)
!984 = !DILocation(line: 173, column: 16, scope: !947)
!985 = !DILocation(line: 173, column: 13, scope: !947)
!986 = !DILocation(line: 174, column: 16, scope: !947)
!987 = !DILocation(line: 174, column: 13, scope: !947)
!988 = !DILocation(line: 175, column: 16, scope: !947)
!989 = !DILocation(line: 175, column: 13, scope: !947)
!990 = !DILocation(line: 176, column: 5, scope: !947)
!991 = !DILocation(line: 166, column: 25, scope: !992)
!992 = !DILexicalBlockFile(scope: !941, file: !792, discriminator: 2)
!993 = !DILocation(line: 166, column: 5, scope: !992)
!994 = distinct !{!994, !995}
!995 = !DILocation(line: 166, column: 5, scope: !907)
!996 = !DILocation(line: 177, column: 1, scope: !907)
!997 = distinct !DISubprogram(name: "threshold16", scope: !792, file: !792, line: 179, type: !836, isLocal: true, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !808)
!998 = !DILocalVariable(name: "iin", arg: 1, scope: !997, file: !792, line: 179, type: !838)
!999 = !DILocation(line: 179, column: 40, scope: !997)
!1000 = !DILocalVariable(name: "tthreshold", arg: 2, scope: !997, file: !792, line: 179, type: !838)
!1001 = !DILocation(line: 179, column: 60, scope: !997)
!1002 = !DILocalVariable(name: "ffirst", arg: 3, scope: !997, file: !792, line: 180, type: !838)
!1003 = !DILocation(line: 180, column: 40, scope: !997)
!1004 = !DILocalVariable(name: "ssecond", arg: 4, scope: !997, file: !792, line: 180, type: !838)
!1005 = !DILocation(line: 180, column: 63, scope: !997)
!1006 = !DILocalVariable(name: "oout", arg: 5, scope: !997, file: !792, line: 181, type: !291)
!1007 = !DILocation(line: 181, column: 34, scope: !997)
!1008 = !DILocalVariable(name: "ilinesize", arg: 6, scope: !997, file: !792, line: 182, type: !840)
!1009 = !DILocation(line: 182, column: 35, scope: !997)
!1010 = !DILocalVariable(name: "tlinesize", arg: 7, scope: !997, file: !792, line: 182, type: !840)
!1011 = !DILocation(line: 182, column: 56, scope: !997)
!1012 = !DILocalVariable(name: "flinesize", arg: 8, scope: !997, file: !792, line: 183, type: !840)
!1013 = !DILocation(line: 183, column: 35, scope: !997)
!1014 = !DILocalVariable(name: "slinesize", arg: 9, scope: !997, file: !792, line: 183, type: !840)
!1015 = !DILocation(line: 183, column: 56, scope: !997)
!1016 = !DILocalVariable(name: "olinesize", arg: 10, scope: !997, file: !792, line: 184, type: !840)
!1017 = !DILocation(line: 184, column: 35, scope: !997)
!1018 = !DILocalVariable(name: "w", arg: 11, scope: !997, file: !792, line: 185, type: !200)
!1019 = !DILocation(line: 185, column: 29, scope: !997)
!1020 = !DILocalVariable(name: "h", arg: 12, scope: !997, file: !792, line: 185, type: !200)
!1021 = !DILocation(line: 185, column: 36, scope: !997)
!1022 = !DILocalVariable(name: "in", scope: !997, file: !792, line: 187, type: !785)
!1023 = !DILocation(line: 187, column: 21, scope: !997)
!1024 = !DILocation(line: 187, column: 44, scope: !997)
!1025 = !DILocation(line: 187, column: 26, scope: !997)
!1026 = !DILocalVariable(name: "threshold", scope: !997, file: !792, line: 188, type: !785)
!1027 = !DILocation(line: 188, column: 21, scope: !997)
!1028 = !DILocation(line: 188, column: 51, scope: !997)
!1029 = !DILocation(line: 188, column: 33, scope: !997)
!1030 = !DILocalVariable(name: "min", scope: !997, file: !792, line: 189, type: !785)
!1031 = !DILocation(line: 189, column: 21, scope: !997)
!1032 = !DILocation(line: 189, column: 45, scope: !997)
!1033 = !DILocation(line: 189, column: 27, scope: !997)
!1034 = !DILocalVariable(name: "max", scope: !997, file: !792, line: 190, type: !785)
!1035 = !DILocation(line: 190, column: 21, scope: !997)
!1036 = !DILocation(line: 190, column: 45, scope: !997)
!1037 = !DILocation(line: 190, column: 27, scope: !997)
!1038 = !DILocalVariable(name: "out", scope: !997, file: !792, line: 191, type: !789)
!1039 = !DILocation(line: 191, column: 15, scope: !997)
!1040 = !DILocation(line: 191, column: 33, scope: !997)
!1041 = !DILocation(line: 191, column: 21, scope: !997)
!1042 = !DILocalVariable(name: "x", scope: !997, file: !792, line: 192, type: !200)
!1043 = !DILocation(line: 192, column: 9, scope: !997)
!1044 = !DILocalVariable(name: "y", scope: !997, file: !792, line: 192, type: !200)
!1045 = !DILocation(line: 192, column: 12, scope: !997)
!1046 = !DILocation(line: 194, column: 12, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !997, file: !792, line: 194, column: 5)
!1048 = !DILocation(line: 194, column: 10, scope: !1047)
!1049 = !DILocation(line: 194, column: 17, scope: !1050)
!1050 = !DILexicalBlockFile(scope: !1051, file: !792, discriminator: 1)
!1051 = distinct !DILexicalBlock(scope: !1047, file: !792, line: 194, column: 5)
!1052 = !DILocation(line: 194, column: 21, scope: !1050)
!1053 = !DILocation(line: 194, column: 19, scope: !1050)
!1054 = !DILocation(line: 194, column: 5, scope: !1050)
!1055 = !DILocation(line: 195, column: 16, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1057, file: !792, line: 195, column: 9)
!1057 = distinct !DILexicalBlock(scope: !1051, file: !792, line: 194, column: 29)
!1058 = !DILocation(line: 195, column: 14, scope: !1056)
!1059 = !DILocation(line: 195, column: 21, scope: !1060)
!1060 = !DILexicalBlockFile(scope: !1061, file: !792, discriminator: 1)
!1061 = distinct !DILexicalBlock(scope: !1056, file: !792, line: 195, column: 9)
!1062 = !DILocation(line: 195, column: 25, scope: !1060)
!1063 = !DILocation(line: 195, column: 23, scope: !1060)
!1064 = !DILocation(line: 195, column: 9, scope: !1060)
!1065 = !DILocation(line: 196, column: 25, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1061, file: !792, line: 195, column: 33)
!1067 = !DILocation(line: 196, column: 22, scope: !1066)
!1068 = !DILocation(line: 196, column: 40, scope: !1066)
!1069 = !DILocation(line: 196, column: 30, scope: !1066)
!1070 = !DILocation(line: 196, column: 28, scope: !1066)
!1071 = !DILocation(line: 196, column: 49, scope: !1072)
!1072 = !DILexicalBlockFile(scope: !1066, file: !792, discriminator: 1)
!1073 = !DILocation(line: 196, column: 45, scope: !1072)
!1074 = !DILocation(line: 196, column: 22, scope: !1072)
!1075 = !DILocation(line: 196, column: 58, scope: !1076)
!1076 = !DILexicalBlockFile(scope: !1066, file: !792, discriminator: 2)
!1077 = !DILocation(line: 196, column: 54, scope: !1076)
!1078 = !DILocation(line: 196, column: 22, scope: !1076)
!1079 = !DILocation(line: 196, column: 22, scope: !1080)
!1080 = !DILexicalBlockFile(scope: !1066, file: !792, discriminator: 3)
!1081 = !DILocation(line: 196, column: 17, scope: !1080)
!1082 = !DILocation(line: 196, column: 13, scope: !1080)
!1083 = !DILocation(line: 196, column: 20, scope: !1080)
!1084 = !DILocation(line: 197, column: 9, scope: !1066)
!1085 = !DILocation(line: 195, column: 29, scope: !1086)
!1086 = !DILexicalBlockFile(scope: !1061, file: !792, discriminator: 2)
!1087 = !DILocation(line: 195, column: 9, scope: !1086)
!1088 = distinct !{!1088, !1089}
!1089 = !DILocation(line: 195, column: 9, scope: !1057)
!1090 = !DILocation(line: 199, column: 15, scope: !1057)
!1091 = !DILocation(line: 199, column: 25, scope: !1057)
!1092 = !DILocation(line: 199, column: 12, scope: !1057)
!1093 = !DILocation(line: 200, column: 22, scope: !1057)
!1094 = !DILocation(line: 200, column: 32, scope: !1057)
!1095 = !DILocation(line: 200, column: 19, scope: !1057)
!1096 = !DILocation(line: 201, column: 16, scope: !1057)
!1097 = !DILocation(line: 201, column: 26, scope: !1057)
!1098 = !DILocation(line: 201, column: 13, scope: !1057)
!1099 = !DILocation(line: 202, column: 16, scope: !1057)
!1100 = !DILocation(line: 202, column: 26, scope: !1057)
!1101 = !DILocation(line: 202, column: 13, scope: !1057)
!1102 = !DILocation(line: 203, column: 16, scope: !1057)
!1103 = !DILocation(line: 203, column: 26, scope: !1057)
!1104 = !DILocation(line: 203, column: 13, scope: !1057)
!1105 = !DILocation(line: 204, column: 5, scope: !1057)
!1106 = !DILocation(line: 194, column: 25, scope: !1107)
!1107 = !DILexicalBlockFile(scope: !1051, file: !792, discriminator: 2)
!1108 = !DILocation(line: 194, column: 5, scope: !1107)
!1109 = distinct !{!1109, !1110}
!1110 = !DILocation(line: 194, column: 5, scope: !997)
!1111 = !DILocation(line: 205, column: 1, scope: !997)
!1112 = distinct !DISubprogram(name: "uninit", scope: !792, file: !792, line: 316, type: !419, isLocal: true, isDefinition: true, scopeLine: 317, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !808)
!1113 = !DILocalVariable(name: "ctx", arg: 1, scope: !1112, file: !792, line: 316, type: !173)
!1114 = !DILocation(line: 316, column: 59, scope: !1112)
!1115 = !DILocalVariable(name: "s", scope: !1112, file: !792, line: 318, type: !819)
!1116 = !DILocation(line: 318, column: 23, scope: !1112)
!1117 = !DILocation(line: 318, column: 27, scope: !1112)
!1118 = !DILocation(line: 318, column: 32, scope: !1112)
!1119 = !DILocation(line: 320, column: 26, scope: !1112)
!1120 = !DILocation(line: 320, column: 29, scope: !1112)
!1121 = !DILocation(line: 320, column: 5, scope: !1112)
!1122 = !DILocation(line: 321, column: 1, scope: !1112)
!1123 = !DILocalVariable(name: "ctx", arg: 1, scope: !807, file: !792, line: 46, type: !173)
!1124 = !DILocation(line: 46, column: 43, scope: !807)
!1125 = !DILocation(line: 68, column: 34, scope: !807)
!1126 = !DILocation(line: 68, column: 39, scope: !807)
!1127 = !DILocation(line: 68, column: 12, scope: !1128)
!1128 = !DILexicalBlockFile(scope: !807, file: !792, discriminator: 1)
!1129 = !DILocation(line: 68, column: 5, scope: !807)
!1130 = distinct !DISubprogram(name: "activate", scope: !792, file: !792, line: 310, type: !409, isLocal: true, isDefinition: true, scopeLine: 311, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !808)
!1131 = !DILocalVariable(name: "ctx", arg: 1, scope: !1130, file: !792, line: 310, type: !173)
!1132 = !DILocation(line: 310, column: 38, scope: !1130)
!1133 = !DILocalVariable(name: "s", scope: !1130, file: !792, line: 312, type: !819)
!1134 = !DILocation(line: 312, column: 23, scope: !1130)
!1135 = !DILocation(line: 312, column: 27, scope: !1130)
!1136 = !DILocation(line: 312, column: 32, scope: !1130)
!1137 = !DILocation(line: 313, column: 35, scope: !1130)
!1138 = !DILocation(line: 313, column: 38, scope: !1130)
!1139 = !DILocation(line: 313, column: 12, scope: !1130)
!1140 = !DILocation(line: 313, column: 5, scope: !1130)
!1141 = distinct !DISubprogram(name: "config_input", scope: !792, file: !792, line: 207, type: !398, isLocal: true, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !808)
!1142 = !DILocalVariable(name: "inlink", arg: 1, scope: !1141, file: !792, line: 207, type: !386)
!1143 = !DILocation(line: 207, column: 39, scope: !1141)
!1144 = !DILocalVariable(name: "ctx", scope: !1141, file: !792, line: 209, type: !173)
!1145 = !DILocation(line: 209, column: 22, scope: !1141)
!1146 = !DILocation(line: 209, column: 28, scope: !1141)
!1147 = !DILocation(line: 209, column: 36, scope: !1141)
!1148 = !DILocalVariable(name: "s", scope: !1141, file: !792, line: 210, type: !819)
!1149 = !DILocation(line: 210, column: 23, scope: !1141)
!1150 = !DILocation(line: 210, column: 27, scope: !1141)
!1151 = !DILocation(line: 210, column: 32, scope: !1141)
!1152 = !DILocalVariable(name: "desc", scope: !1141, file: !792, line: 211, type: !1153)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1155)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPixFmtDescriptor", file: !1156, line: 123, baseType: !1157)
!1156 = !DIFile(filename: "./libavutil/pixdesc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPixFmtDescriptor", file: !1156, line: 81, size: 1280, align: 64, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1162, !1163, !1164, !1177}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1157, file: !1156, line: 82, baseType: !184, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1157, file: !1156, line: 83, baseType: !292, size: 8, align: 8, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_w", scope: !1157, file: !1156, line: 92, baseType: !292, size: 8, align: 8, offset: 72)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_h", scope: !1157, file: !1156, line: 101, baseType: !292, size: 8, align: 8, offset: 80)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1157, file: !1156, line: 106, baseType: !316, size: 64, align: 64, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !1157, file: !1156, line: 117, baseType: !1165, size: 1024, align: 32, offset: 192)
!1165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1166, size: 1024, align: 32, elements: !831)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVComponentDescriptor", file: !1156, line: 70, baseType: !1167)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVComponentDescriptor", file: !1156, line: 31, size: 256, align: 32, elements: !1168)
!1168 = !{!1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !1167, file: !1156, line: 35, baseType: !200, size: 32, align: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !1167, file: !1156, line: 41, baseType: !200, size: 32, align: 32, offset: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1167, file: !1156, line: 47, baseType: !200, size: 32, align: 32, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !1167, file: !1156, line: 53, baseType: !200, size: 32, align: 32, offset: 96)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1167, file: !1156, line: 58, baseType: !200, size: 32, align: 32, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "step_minus1", scope: !1167, file: !1156, line: 62, baseType: !200, size: 32, align: 32, offset: 160)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "depth_minus1", scope: !1167, file: !1156, line: 65, baseType: !200, size: 32, align: 32, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "offset_plus1", scope: !1167, file: !1156, line: 68, baseType: !200, size: 32, align: 32, offset: 224)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1157, file: !1156, line: 122, baseType: !184, size: 64, align: 64, offset: 1216)
!1178 = !DILocation(line: 211, column: 31, scope: !1141)
!1179 = !DILocation(line: 211, column: 58, scope: !1141)
!1180 = !DILocation(line: 211, column: 66, scope: !1141)
!1181 = !DILocation(line: 211, column: 38, scope: !1141)
!1182 = !DILocalVariable(name: "vsub", scope: !1141, file: !792, line: 212, type: !200)
!1183 = !DILocation(line: 212, column: 9, scope: !1141)
!1184 = !DILocalVariable(name: "hsub", scope: !1141, file: !792, line: 212, type: !200)
!1185 = !DILocation(line: 212, column: 15, scope: !1141)
!1186 = !DILocation(line: 214, column: 44, scope: !1141)
!1187 = !DILocation(line: 214, column: 52, scope: !1141)
!1188 = !DILocation(line: 214, column: 20, scope: !1141)
!1189 = !DILocation(line: 214, column: 5, scope: !1141)
!1190 = !DILocation(line: 214, column: 8, scope: !1141)
!1191 = !DILocation(line: 214, column: 18, scope: !1141)
!1192 = !DILocation(line: 216, column: 12, scope: !1141)
