; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--vf_framerate.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--vf_framerate.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFilterPad = type { i8*, i32, %struct.AVFrame* (%struct.AVFilterLink*, i32, i32)*, %struct.AVFrame* (%struct.AVFilterLink*, i32)*, i32 (%struct.AVFilterLink*, %struct.AVFrame*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32, i32 }
%struct.AVFrame = type { [8 x i8*], [8 x i32], i8**, i32, i32, i32, i32, i32, i32, %struct.AVRational, i64, i64, i64, i32, i32, i32, i8*, [8 x i64], i32, i32, i32, i32, i64, i32, i64, [8 x %struct.AVBufferRef*], %struct.AVBufferRef**, i32, %struct.AVFrameSideData**, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, %struct.AVDictionary*, i32, i32, i32, i8*, i32, i32, %struct.AVBufferRef*, %struct.AVBufferRef*, %struct.AVBufferRef*, i64, i64, i64, i64, %struct.AVBufferRef* }
%struct.AVRational = type { i32, i32 }
%struct.AVFrameSideData = type { i32, i8*, i32, %struct.AVDictionary*, %struct.AVBufferRef* }
%struct.AVDictionary = type opaque
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

!109 = !DIEnumerator(name: "AVCOL_TRC_BT709", value: 1)
!110 = !DIEnumerator(name: "AVCOL_TRC_UNSPECIFIED", value: 2)
!111 = !DIEnumerator(name: "AVCOL_TRC_RESERVED", value: 3)
!112 = !DIEnumerator(name: "AVCOL_TRC_GAMMA22", value: 4)
!113 = !DIEnumerator(name: "AVCOL_TRC_GAMMA28", value: 5)
!114 = !DIEnumerator(name: "AVCOL_TRC_SMPTE170M", value: 6)
!115 = !DIEnumerator(name: "AVCOL_TRC_SMPTE240M", value: 7)
!116 = !DIEnumerator(name: "AVCOL_TRC_LINEAR", value: 8)
!117 = !DIEnumerator(name: "AVCOL_TRC_LOG", value: 9)
!118 = !DIEnumerator(name: "AVCOL_TRC_LOG_SQRT", value: 10)
!119 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_4", value: 11)
!120 = !DIEnumerator(name: "AVCOL_TRC_BT1361_ECG", value: 12)
!121 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_1", value: 13)
!122 = !DIEnumerator(name: "AVCOL_TRC_BT2020_10", value: 14)
!123 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!124 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!125 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!126 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!127 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!128 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!129 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !82, line: 493, size: 32, align: 32, elements: !131)
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148}
!132 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!133 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!134 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!135 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!136 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!137 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!138 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!139 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!140 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!141 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!142 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!143 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!144 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!145 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!146 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!147 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!148 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !82, line: 538, size: 32, align: 32, elements: !150)
!150 = !{!151, !152, !153, !154, !155, !156, !157, !158}
!151 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!152 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!153 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!154 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!155 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!156 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!157 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!158 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!159 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVMediaType", file: !47, line: 199, size: 32, align: 32, elements: !160)
!160 = !{!161, !162, !163, !164, !165, !166, !167}
!161 = !DIEnumerator(name: "AVMEDIA_TYPE_UNKNOWN", value: -1)
!162 = !DIEnumerator(name: "AVMEDIA_TYPE_VIDEO", value: 0)
!163 = !DIEnumerator(name: "AVMEDIA_TYPE_AUDIO", value: 1)
!164 = !DIEnumerator(name: "AVMEDIA_TYPE_DATA", value: 2)
!165 = !DIEnumerator(name: "AVMEDIA_TYPE_SUBTITLE", value: 3)
!166 = !DIEnumerator(name: "AVMEDIA_TYPE_ATTACHMENT", value: 4)
!167 = !DIEnumerator(name: "AVMEDIA_TYPE_NB", value: 5)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !170, file: !169, line: 503, size: 32, align: 32, elements: !576)
!169 = !DIFile(filename: "libavfilter/avfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterLink", file: !169, line: 439, size: 493504, align: 64, elements: !171)
!171 = !{!172, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !537, !538, !539, !540, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !170, file: !169, line: 440, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterContext", file: !169, line: 67, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterContext", file: !169, line: 338, size: 1344, align: 64, elements: !176)
!176 = !{!177, !264, !437, !438, !440, !442, !444, !445, !446, !447, !448, !488, !489, !495, !504, !505, !506, !508, !509, !510, !511, !512}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !175, file: !169, line: 339, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !182)
!182 = !{!183, !187, !192, !223, !224, !225, !226, !230, !236, !238, !242}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !181, file: !26, line: 72, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !181, file: !26, line: 78, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!184, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !181, file: !26, line: 85, baseType: !193, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !196)
!196 = !{!197, !198, !199, !201, !202, !219, !220, !221, !222}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !4, line: 247, baseType: !184, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !195, file: !4, line: 253, baseType: !184, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !195, file: !4, line: 259, baseType: !200, size: 32, align: 32, offset: 128)
!200 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !195, file: !4, line: 271, baseType: !203, size: 64, align: 64, offset: 192)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !195, file: !4, line: 265, size: 64, align: 64, elements: !204)
!204 = !{!205, !209, !211, !212}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !203, file: !4, line: 266, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !207, line: 197, baseType: !208)
!207 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!208 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !203, file: !4, line: 267, baseType: !210, size: 64, align: 64)
!210 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !203, file: !4, line: 268, baseType: !184, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !203, file: !4, line: 270, baseType: !213, size: 64, align: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !214, line: 61, baseType: !215)
!214 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !214, line: 58, size: 64, align: 32, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !215, file: !214, line: 59, baseType: !200, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !215, file: !214, line: 60, baseType: !200, size: 32, align: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !195, file: !4, line: 272, baseType: !210, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !195, file: !4, line: 273, baseType: !210, size: 64, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !195, file: !4, line: 275, baseType: !200, size: 32, align: 32, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !195, file: !4, line: 300, baseType: !184, size: 64, align: 64, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !181, file: !26, line: 93, baseType: !200, size: 32, align: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !181, file: !26, line: 99, baseType: !200, size: 32, align: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !181, file: !26, line: 108, baseType: !200, size: 32, align: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !181, file: !26, line: 113, baseType: !227, size: 64, align: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!191, !191, !191}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !181, file: !26, line: 123, baseType: !231, size: 64, align: 64, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!234, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !181, file: !26, line: 130, baseType: !237, size: 32, align: 32, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !181, file: !26, line: 136, baseType: !239, size: 64, align: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!237, !191}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !181, file: !26, line: 142, baseType: !243, size: 64, align: 64, offset: 576)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!200, !246, !191, !184, !200}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !249)
!249 = !{!250, !262, !263}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !248, file: !4, line: 360, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !254, file: !4, line: 307, baseType: !184, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !254, file: !4, line: 313, baseType: !210, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !254, file: !4, line: 313, baseType: !210, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !254, file: !4, line: 318, baseType: !210, size: 64, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !254, file: !4, line: 318, baseType: !210, size: 64, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !254, file: !4, line: 323, baseType: !200, size: 32, align: 32, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !248, file: !4, line: 364, baseType: !200, size: 32, align: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !248, file: !4, line: 368, baseType: !200, size: 32, align: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !175, file: !169, line: 341, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilter", file: !169, line: 328, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilter", file: !169, line: 144, size: 1024, align: 64, elements: !269)
!269 = !{!270, !271, !272, !405, !406, !407, !408, !412, !413, !418, !422, !423, !424, !425, !427, !432, !436}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !169, line: 148, baseType: !184, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !268, file: !169, line: 155, baseType: !184, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !268, file: !169, line: 164, baseType: !273, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterPad", file: !169, line: 69, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterPad", file: !277, line: 54, size: 576, align: 64, elements: !278)
!277 = !DIFile(filename: "libavfilter/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!278 = !{!279, !280, !281, !389, !393, !397, !401, !402, !403, !404}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !277, line: 60, baseType: !184, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !276, file: !277, line: 65, baseType: !159, size: 32, align: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "get_video_buffer", scope: !276, file: !277, line: 73, baseType: !282, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!285, !387, !200, !200}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !58, line: 646, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !58, line: 268, size: 4288, align: 64, elements: !288)
!288 = !{!289, !297, !299, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !319, !320, !321, !322, !323, !324, !325, !326, !339, !341, !342, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !375, !376, !377, !378, !379, !380, !383, !384, !385, !386}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !287, file: !58, line: 282, baseType: !290, size: 512, align: 64)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 512, align: 64, elements: !295)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !293, line: 48, baseType: !294)
!293 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!294 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!295 = !{!296}
!296 = !DISubrange(count: 8)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !287, file: !58, line: 299, baseType: !298, size: 256, align: 32, offset: 512)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 256, align: 32, elements: !295)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !287, file: !58, line: 315, baseType: !300, size: 64, align: 64, offset: 768)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !287, file: !58, line: 326, baseType: !200, size: 32, align: 32, offset: 832)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !287, file: !58, line: 326, baseType: !200, size: 32, align: 32, offset: 864)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !287, file: !58, line: 334, baseType: !200, size: 32, align: 32, offset: 896)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !287, file: !58, line: 341, baseType: !200, size: 32, align: 32, offset: 928)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !287, file: !58, line: 346, baseType: !200, size: 32, align: 32, offset: 960)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !287, file: !58, line: 351, baseType: !46, size: 32, align: 32, offset: 992)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !287, file: !58, line: 356, baseType: !213, size: 64, align: 32, offset: 1024)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !287, file: !58, line: 361, baseType: !206, size: 64, align: 64, offset: 1088)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !287, file: !58, line: 369, baseType: !206, size: 64, align: 64, offset: 1152)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !287, file: !58, line: 377, baseType: !206, size: 64, align: 64, offset: 1216)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !287, file: !58, line: 382, baseType: !200, size: 32, align: 32, offset: 1280)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !287, file: !58, line: 386, baseType: !200, size: 32, align: 32, offset: 1312)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !287, file: !58, line: 391, baseType: !200, size: 32, align: 32, offset: 1344)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !287, file: !58, line: 396, baseType: !191, size: 64, align: 64, offset: 1408)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !287, file: !58, line: 403, baseType: !316, size: 512, align: 64, offset: 1472)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 512, align: 64, elements: !295)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !293, line: 55, baseType: !318)
!318 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !287, file: !58, line: 410, baseType: !200, size: 32, align: 32, offset: 1984)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !287, file: !58, line: 415, baseType: !200, size: 32, align: 32, offset: 2016)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !287, file: !58, line: 420, baseType: !200, size: 32, align: 32, offset: 2048)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !287, file: !58, line: 425, baseType: !200, size: 32, align: 32, offset: 2080)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !287, file: !58, line: 435, baseType: !206, size: 64, align: 64, offset: 2112)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !287, file: !58, line: 440, baseType: !200, size: 32, align: 32, offset: 2176)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !287, file: !58, line: 445, baseType: !317, size: 64, align: 64, offset: 2240)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !287, file: !58, line: 459, baseType: !327, size: 512, align: 64, offset: 2304)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 512, align: 64, elements: !295)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !330, line: 94, baseType: !331)
!330 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !330, line: 81, size: 192, align: 64, elements: !332)
!332 = !{!333, !337, !338}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !331, file: !330, line: 82, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !330, line: 73, baseType: !336)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !330, line: 73, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !331, file: !330, line: 89, baseType: !291, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !331, file: !330, line: 93, baseType: !200, size: 32, align: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !287, file: !58, line: 473, baseType: !340, size: 64, align: 64, offset: 2816)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !287, file: !58, line: 477, baseType: !200, size: 32, align: 32, offset: 2880)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !287, file: !58, line: 479, baseType: !343, size: 64, align: 64, offset: 2944)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !58, line: 207, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !58, line: 201, size: 320, align: 64, elements: !347)
!347 = !{!348, !349, !350, !351, !356}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !346, file: !58, line: 202, baseType: !57, size: 32, align: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !346, file: !58, line: 203, baseType: !291, size: 64, align: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !346, file: !58, line: 204, baseType: !200, size: 32, align: 32, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !346, file: !58, line: 205, baseType: !352, size: 64, align: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !354, line: 86, baseType: !355)
!354 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !354, line: 86, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !346, file: !58, line: 206, baseType: !328, size: 64, align: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !287, file: !58, line: 480, baseType: !200, size: 32, align: 32, offset: 3008)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !58, line: 505, baseType: !200, size: 32, align: 32, offset: 3040)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !287, file: !58, line: 512, baseType: !81, size: 32, align: 32, offset: 3072)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !287, file: !58, line: 514, baseType: !88, size: 32, align: 32, offset: 3104)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !287, file: !58, line: 516, baseType: !106, size: 32, align: 32, offset: 3136)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !287, file: !58, line: 523, baseType: !130, size: 32, align: 32, offset: 3168)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !287, file: !58, line: 525, baseType: !149, size: 32, align: 32, offset: 3200)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !287, file: !58, line: 532, baseType: !206, size: 64, align: 64, offset: 3264)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !287, file: !58, line: 539, baseType: !206, size: 64, align: 64, offset: 3328)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !287, file: !58, line: 547, baseType: !206, size: 64, align: 64, offset: 3392)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !287, file: !58, line: 554, baseType: !352, size: 64, align: 64, offset: 3456)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !287, file: !58, line: 563, baseType: !200, size: 32, align: 32, offset: 3520)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !287, file: !58, line: 572, baseType: !200, size: 32, align: 32, offset: 3552)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !287, file: !58, line: 581, baseType: !200, size: 32, align: 32, offset: 3584)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !287, file: !58, line: 588, baseType: !372, size: 64, align: 64, offset: 3648)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !207, line: 194, baseType: !374)
!374 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !287, file: !58, line: 593, baseType: !200, size: 32, align: 32, offset: 3712)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !287, file: !58, line: 596, baseType: !200, size: 32, align: 32, offset: 3744)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !287, file: !58, line: 599, baseType: !328, size: 64, align: 64, offset: 3776)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !287, file: !58, line: 605, baseType: !328, size: 64, align: 64, offset: 3840)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !287, file: !58, line: 616, baseType: !328, size: 64, align: 64, offset: 3904)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !287, file: !58, line: 626, baseType: !381, size: 64, align: 64, offset: 3968)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !382, line: 216, baseType: !318)
!382 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!383 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !287, file: !58, line: 627, baseType: !381, size: 64, align: 64, offset: 4032)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !287, file: !58, line: 628, baseType: !381, size: 64, align: 64, offset: 4096)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !287, file: !58, line: 629, baseType: !381, size: 64, align: 64, offset: 4160)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !287, file: !58, line: 645, baseType: !328, size: 64, align: 64, offset: 4224)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterLink", file: !169, line: 68, baseType: !170)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "get_audio_buffer", scope: !276, file: !277, line: 81, baseType: !390, size: 64, align: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!285, !387, !200}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "filter_frame", scope: !276, file: !277, line: 93, baseType: !394, size: 64, align: 64, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!200, !387, !285}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "poll_frame", scope: !276, file: !277, line: 104, baseType: !398, size: 64, align: 64, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!200, !387}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "request_frame", scope: !276, file: !277, line: 113, baseType: !398, size: 64, align: 64, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "config_props", scope: !276, file: !277, line: 129, baseType: !398, size: 64, align: 64, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "needs_fifo", scope: !276, file: !277, line: 137, baseType: !200, size: 32, align: 32, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "needs_writable", scope: !276, file: !277, line: 145, baseType: !200, size: 32, align: 32, offset: 544)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !268, file: !169, line: 172, baseType: !273, size: 64, align: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !268, file: !169, line: 182, baseType: !178, size: 64, align: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !268, file: !169, line: 187, baseType: !200, size: 32, align: 32, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "preinit", scope: !268, file: !169, line: 210, baseType: !409, size: 64, align: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!200, !173}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !268, file: !169, line: 233, baseType: !409, size: 64, align: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "init_dict", scope: !268, file: !169, line: 246, baseType: !414, size: 64, align: 64, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!200, !173, !417}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !268, file: !169, line: 258, baseType: !419, size: 64, align: 64, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !173}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "query_formats", scope: !268, file: !169, line: 282, baseType: !409, size: 64, align: 64, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "priv_size", scope: !268, file: !169, line: 284, baseType: !200, size: 32, align: 32, offset: 704)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flags_internal", scope: !268, file: !169, line: 286, baseType: !200, size: 32, align: 32, offset: 736)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !169, line: 292, baseType: !426, size: 64, align: 64, offset: 768)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "process_command", scope: !268, file: !169, line: 306, baseType: !428, size: 64, align: 64, offset: 832)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!200, !173, !184, !184, !431, !200, !200}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "init_opaque", scope: !268, file: !169, line: 313, baseType: !433, size: 64, align: 64, offset: 896)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!200, !173, !191}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !268, file: !169, line: 327, baseType: !409, size: 64, align: 64, offset: 960)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !169, line: 343, baseType: !431, size: 64, align: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "input_pads", scope: !175, file: !169, line: 345, baseType: !439, size: 64, align: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !175, file: !169, line: 346, baseType: !441, size: 64, align: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !175, file: !169, line: 347, baseType: !443, size: 32, align: 32, offset: 320)
!443 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "output_pads", scope: !175, file: !169, line: 349, baseType: !439, size: 64, align: 64, offset: 384)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !175, file: !169, line: 350, baseType: !441, size: 64, align: 64, offset: 448)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "nb_outputs", scope: !175, file: !169, line: 351, baseType: !443, size: 32, align: 32, offset: 512)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !175, file: !169, line: 353, baseType: !191, size: 64, align: 64, offset: 576)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !175, file: !169, line: 355, baseType: !449, size: 64, align: 64, offset: 640)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraph", file: !169, line: 840, size: 768, align: 64, elements: !451)
!451 = !{!452, !453, !455, !456, !457, !458, !459, !460, !482, !483, !484, !485, !486, !487}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !450, file: !169, line: 841, baseType: !178, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !450, file: !169, line: 842, baseType: !454, size: 64, align: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "nb_filters", scope: !450, file: !169, line: 843, baseType: !443, size: 32, align: 32, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "scale_sws_opts", scope: !450, file: !169, line: 845, baseType: !431, size: 64, align: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "resample_lavr_opts", scope: !450, file: !169, line: 847, baseType: !431, size: 64, align: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !450, file: !169, line: 862, baseType: !200, size: 32, align: 32, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !450, file: !169, line: 869, baseType: !200, size: 32, align: 32, offset: 352)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !450, file: !169, line: 874, baseType: !461, size: 64, align: 64, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterGraphInternal", file: !169, line: 809, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraphInternal", file: !277, line: 148, size: 192, align: 64, elements: !464)
!464 = !{!465, !466, !476}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !463, file: !277, line: 149, baseType: !191, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "thread_execute", scope: !463, file: !277, line: 150, baseType: !467, size: 64, align: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_execute_func", file: !169, line: 837, baseType: !469)
!469 = !DISubroutineType(types: !470)
!470 = !{!200, !173, !471, !191, !475, !200}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_action_func", file: !169, line: 823, baseType: !473)
!473 = !DISubroutineType(types: !474)
!474 = !{!200, !173, !191, !200, !200}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "frame_queues", scope: !463, file: !277, line: 151, baseType: !477, size: 8, align: 8, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameQueueGlobal", file: !478, line: 48, baseType: !479)
!478 = !DIFile(filename: "libavfilter/framequeue.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameQueueGlobal", file: !478, line: 46, size: 8, align: 8, elements: !480)
!480 = !{!481}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !479, file: !478, line: 47, baseType: !186, size: 8, align: 8)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !450, file: !169, line: 881, baseType: !191, size: 64, align: 64, offset: 448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !450, file: !169, line: 895, baseType: !467, size: 64, align: 64, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "aresample_swr_opts", scope: !450, file: !169, line: 897, baseType: !431, size: 64, align: 64, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links", scope: !450, file: !169, line: 906, baseType: !441, size: 64, align: 64, offset: 640)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links_count", scope: !450, file: !169, line: 907, baseType: !200, size: 32, align: 32, offset: 704)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "disable_auto_convert", scope: !450, file: !169, line: 909, baseType: !443, size: 32, align: 32, offset: 736)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !175, file: !169, line: 373, baseType: !200, size: 32, align: 32, offset: 704)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !175, file: !169, line: 378, baseType: !490, size: 64, align: 64, offset: 768)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterInternal", file: !169, line: 335, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterInternal", file: !277, line: 154, size: 64, align: 64, elements: !493)
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !492, file: !277, line: 155, baseType: !467, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "command_queue", scope: !175, file: !169, line: 380, baseType: !496, size: 64, align: 64, offset: 832)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64, align: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterCommand", file: !277, line: 38, size: 320, align: 64, elements: !498)
!498 = !{!499, !500, !501, !502, !503}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !497, file: !277, line: 39, baseType: !210, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !497, file: !277, line: 40, baseType: !431, size: 64, align: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !497, file: !277, line: 41, baseType: !431, size: 64, align: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !497, file: !277, line: 42, baseType: !200, size: 32, align: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !497, file: !277, line: 43, baseType: !496, size: 64, align: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "enable_str", scope: !175, file: !169, line: 382, baseType: !431, size: 64, align: 64, offset: 896)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !175, file: !169, line: 383, baseType: !191, size: 64, align: 64, offset: 960)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "var_values", scope: !175, file: !169, line: 384, baseType: !507, size: 64, align: 64, offset: 1024)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "is_disabled", scope: !175, file: !169, line: 385, baseType: !200, size: 32, align: 32, offset: 1088)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !175, file: !169, line: 394, baseType: !328, size: 64, align: 64, offset: 1152)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !175, file: !169, line: 401, baseType: !200, size: 32, align: 32, offset: 1216)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !175, file: !169, line: 408, baseType: !443, size: 32, align: 32, offset: 1248)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !175, file: !169, line: 424, baseType: !200, size: 32, align: 32, offset: 1280)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "srcpad", scope: !170, file: !169, line: 441, baseType: !439, size: 64, align: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !170, file: !169, line: 443, baseType: !173, size: 64, align: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "dstpad", scope: !170, file: !169, line: 444, baseType: !439, size: 64, align: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !169, line: 446, baseType: !159, size: 32, align: 32, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !170, file: !169, line: 449, baseType: !200, size: 32, align: 32, offset: 288)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !170, file: !169, line: 450, baseType: !200, size: 32, align: 32, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !170, file: !169, line: 451, baseType: !213, size: 64, align: 32, offset: 352)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !170, file: !169, line: 453, baseType: !317, size: 64, align: 64, offset: 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !170, file: !169, line: 454, baseType: !200, size: 32, align: 32, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !170, file: !169, line: 456, baseType: !200, size: 32, align: 32, offset: 544)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !170, file: !169, line: 465, baseType: !213, size: 64, align: 32, offset: 576)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "in_formats", scope: !170, file: !169, line: 481, baseType: !525, size: 64, align: 64, offset: 640)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterFormats", file: !169, line: 70, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterFormats", file: !528, line: 64, size: 256, align: 64, elements: !529)
!528 = !DIFile(filename: "libavfilter/formats.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!529 = !{!530, !531, !532, !533}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "nb_formats", scope: !527, file: !528, line: 65, baseType: !443, size: 32, align: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !527, file: !528, line: 66, baseType: !475, size: 64, align: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !527, file: !528, line: 68, baseType: !443, size: 32, align: 32, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !527, file: !528, line: 69, baseType: !534, size: 64, align: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "out_formats", scope: !170, file: !169, line: 482, baseType: !525, size: 64, align: 64, offset: 704)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "in_samplerates", scope: !170, file: !169, line: 488, baseType: !525, size: 64, align: 64, offset: 768)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "out_samplerates", scope: !170, file: !169, line: 489, baseType: !525, size: 64, align: 64, offset: 832)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "in_channel_layouts", scope: !170, file: !169, line: 490, baseType: !541, size: 64, align: 64, offset: 896)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterChannelLayouts", file: !528, line: 85, size: 256, align: 64, elements: !543)
!543 = !{!544, !546, !547, !548, !549, !550}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !542, file: !528, line: 86, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "nb_channel_layouts", scope: !542, file: !528, line: 87, baseType: !200, size: 32, align: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "all_layouts", scope: !542, file: !528, line: 88, baseType: !186, size: 8, align: 8, offset: 96)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "all_counts", scope: !542, file: !528, line: 89, baseType: !186, size: 8, align: 8, offset: 104)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !542, file: !528, line: 91, baseType: !443, size: 32, align: 32, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !542, file: !528, line: 92, baseType: !551, size: 64, align: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "out_channel_layouts", scope: !170, file: !169, line: 491, baseType: !541, size: 64, align: 64, offset: 960)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "request_samples", scope: !170, file: !169, line: 500, baseType: !200, size: 32, align: 32, offset: 1024)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !170, file: !169, line: 507, baseType: !168, size: 32, align: 32, offset: 1056)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !170, file: !169, line: 512, baseType: !449, size: 64, align: 64, offset: 1088)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts", scope: !170, file: !169, line: 518, baseType: !206, size: 64, align: 64, offset: 1152)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts_us", scope: !170, file: !169, line: 524, baseType: !206, size: 64, align: 64, offset: 1216)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "age_index", scope: !170, file: !169, line: 529, baseType: !200, size: 32, align: 32, offset: 1280)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !170, file: !169, line: 542, baseType: !213, size: 64, align: 32, offset: 1312)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf", scope: !170, file: !169, line: 547, baseType: !285, size: 64, align: 64, offset: 1408)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf_size", scope: !170, file: !169, line: 553, baseType: !200, size: 32, align: 32, offset: 1472)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "min_samples", scope: !170, file: !169, line: 562, baseType: !200, size: 32, align: 32, offset: 1504)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "max_samples", scope: !170, file: !169, line: 568, baseType: !200, size: 32, align: 32, offset: 1536)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !170, file: !169, line: 573, baseType: !200, size: 32, align: 32, offset: 1568)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !170, file: !169, line: 578, baseType: !443, size: 32, align: 32, offset: 1600)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_in", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1664)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_out", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1728)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pool", scope: !170, file: !169, line: 588, baseType: !191, size: 64, align: 64, offset: 1792)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "frame_wanted_out", scope: !170, file: !169, line: 595, baseType: !200, size: 32, align: 32, offset: 1856)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !170, file: !169, line: 601, baseType: !328, size: 64, align: 64, offset: 1920)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !170, file: !169, line: 610, baseType: !573, size: 491520, align: 8, offset: 1984)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 491520, align: 8, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 61440)
!576 = !{!577, !578, !579}
!577 = !DIEnumerator(name: "AVLINK_UNINIT", value: 0)
!578 = !DIEnumerator(name: "AVLINK_STARTINIT", value: 1)
!579 = !DIEnumerator(name: "AVLINK_INIT", value: 2)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPixelFormat", file: !82, line: 64, size: 32, align: 32, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778}
!582 = !DIEnumerator(name: "AV_PIX_FMT_NONE", value: -1)
!583 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P", value: 0)
!584 = !DIEnumerator(name: "AV_PIX_FMT_YUYV422", value: 1)
!585 = !DIEnumerator(name: "AV_PIX_FMT_RGB24", value: 2)
!586 = !DIEnumerator(name: "AV_PIX_FMT_BGR24", value: 3)
!587 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P", value: 4)
!588 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P", value: 5)
!589 = !DIEnumerator(name: "AV_PIX_FMT_YUV410P", value: 6)
!590 = !DIEnumerator(name: "AV_PIX_FMT_YUV411P", value: 7)
!591 = !DIEnumerator(name: "AV_PIX_FMT_GRAY8", value: 8)
!592 = !DIEnumerator(name: "AV_PIX_FMT_MONOWHITE", value: 9)
!593 = !DIEnumerator(name: "AV_PIX_FMT_MONOBLACK", value: 10)
!594 = !DIEnumerator(name: "AV_PIX_FMT_PAL8", value: 11)
!595 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ420P", value: 12)
!596 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ422P", value: 13)
!597 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ444P", value: 14)
!598 = !DIEnumerator(name: "AV_PIX_FMT_UYVY422", value: 15)
!599 = !DIEnumerator(name: "AV_PIX_FMT_UYYVYY411", value: 16)
!600 = !DIEnumerator(name: "AV_PIX_FMT_BGR8", value: 17)
!601 = !DIEnumerator(name: "AV_PIX_FMT_BGR4", value: 18)
!602 = !DIEnumerator(name: "AV_PIX_FMT_BGR4_BYTE", value: 19)
!603 = !DIEnumerator(name: "AV_PIX_FMT_RGB8", value: 20)
!604 = !DIEnumerator(name: "AV_PIX_FMT_RGB4", value: 21)
!605 = !DIEnumerator(name: "AV_PIX_FMT_RGB4_BYTE", value: 22)
!606 = !DIEnumerator(name: "AV_PIX_FMT_NV12", value: 23)
!607 = !DIEnumerator(name: "AV_PIX_FMT_NV21", value: 24)
!608 = !DIEnumerator(name: "AV_PIX_FMT_ARGB", value: 25)
!609 = !DIEnumerator(name: "AV_PIX_FMT_RGBA", value: 26)
!610 = !DIEnumerator(name: "AV_PIX_FMT_ABGR", value: 27)
!611 = !DIEnumerator(name: "AV_PIX_FMT_BGRA", value: 28)
!612 = !DIEnumerator(name: "AV_PIX_FMT_GRAY16BE", value: 29)
!613 = !DIEnumerator(name: "AV_PIX_FMT_GRAY16LE", value: 30)
!614 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P", value: 31)
!615 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ440P", value: 32)
!616 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P", value: 33)
!617 = !DIEnumerator(name: "AV_PIX_FMT_RGB48BE", value: 34)
!618 = !DIEnumerator(name: "AV_PIX_FMT_RGB48LE", value: 35)
!619 = !DIEnumerator(name: "AV_PIX_FMT_RGB565BE", value: 36)
!620 = !DIEnumerator(name: "AV_PIX_FMT_RGB565LE", value: 37)
!621 = !DIEnumerator(name: "AV_PIX_FMT_RGB555BE", value: 38)
!622 = !DIEnumerator(name: "AV_PIX_FMT_RGB555LE", value: 39)
!623 = !DIEnumerator(name: "AV_PIX_FMT_BGR565BE", value: 40)
!624 = !DIEnumerator(name: "AV_PIX_FMT_BGR565LE", value: 41)
!625 = !DIEnumerator(name: "AV_PIX_FMT_BGR555BE", value: 42)
!626 = !DIEnumerator(name: "AV_PIX_FMT_BGR555LE", value: 43)
!627 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_MOCO", value: 44)
!628 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_IDCT", value: 45)
!629 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_VLD", value: 46)
!630 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI", value: 46)
!631 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P16LE", value: 47)
!632 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P16BE", value: 48)
!633 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P16LE", value: 49)
!634 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P16BE", value: 50)
!635 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P16LE", value: 51)
!636 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P16BE", value: 52)
!637 = !DIEnumerator(name: "AV_PIX_FMT_DXVA2_VLD", value: 53)
!638 = !DIEnumerator(name: "AV_PIX_FMT_RGB444LE", value: 54)
!639 = !DIEnumerator(name: "AV_PIX_FMT_RGB444BE", value: 55)
!640 = !DIEnumerator(name: "AV_PIX_FMT_BGR444LE", value: 56)
!641 = !DIEnumerator(name: "AV_PIX_FMT_BGR444BE", value: 57)
!642 = !DIEnumerator(name: "AV_PIX_FMT_YA8", value: 58)
!643 = !DIEnumerator(name: "AV_PIX_FMT_Y400A", value: 58)
!644 = !DIEnumerator(name: "AV_PIX_FMT_GRAY8A", value: 58)
!645 = !DIEnumerator(name: "AV_PIX_FMT_BGR48BE", value: 59)
!646 = !DIEnumerator(name: "AV_PIX_FMT_BGR48LE", value: 60)
!647 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P9BE", value: 61)
!648 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P9LE", value: 62)
!649 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P10BE", value: 63)
!650 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P10LE", value: 64)
!651 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P10BE", value: 65)
!652 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P10LE", value: 66)
!653 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P9BE", value: 67)
!654 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P9LE", value: 68)
!655 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P10BE", value: 69)
!656 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P10LE", value: 70)
!657 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P9BE", value: 71)
!658 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P9LE", value: 72)
!659 = !DIEnumerator(name: "AV_PIX_FMT_GBRP", value: 73)
!660 = !DIEnumerator(name: "AV_PIX_FMT_GBR24P", value: 73)
!661 = !DIEnumerator(name: "AV_PIX_FMT_GBRP9BE", value: 74)
!662 = !DIEnumerator(name: "AV_PIX_FMT_GBRP9LE", value: 75)
!663 = !DIEnumerator(name: "AV_PIX_FMT_GBRP10BE", value: 76)
!664 = !DIEnumerator(name: "AV_PIX_FMT_GBRP10LE", value: 77)
!665 = !DIEnumerator(name: "AV_PIX_FMT_GBRP16BE", value: 78)
!666 = !DIEnumerator(name: "AV_PIX_FMT_GBRP16LE", value: 79)
!667 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P", value: 80)
!668 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P", value: 81)
!669 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P9BE", value: 82)
!670 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P9LE", value: 83)
!671 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P9BE", value: 84)
!672 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P9LE", value: 85)
!673 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P9BE", value: 86)
!674 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P9LE", value: 87)
!675 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P10BE", value: 88)
!676 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P10LE", value: 89)
!677 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P10BE", value: 90)
!678 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P10LE", value: 91)
!679 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P10BE", value: 92)
!680 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P10LE", value: 93)
!681 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P16BE", value: 94)
!682 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P16LE", value: 95)
!683 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P16BE", value: 96)
!684 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P16LE", value: 97)
!685 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P16BE", value: 98)
!686 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P16LE", value: 99)
!687 = !DIEnumerator(name: "AV_PIX_FMT_VDPAU", value: 100)
!688 = !DIEnumerator(name: "AV_PIX_FMT_XYZ12LE", value: 101)
!689 = !DIEnumerator(name: "AV_PIX_FMT_XYZ12BE", value: 102)
!690 = !DIEnumerator(name: "AV_PIX_FMT_NV16", value: 103)
!691 = !DIEnumerator(name: "AV_PIX_FMT_NV20LE", value: 104)
!692 = !DIEnumerator(name: "AV_PIX_FMT_NV20BE", value: 105)
!693 = !DIEnumerator(name: "AV_PIX_FMT_RGBA64BE", value: 106)
!694 = !DIEnumerator(name: "AV_PIX_FMT_RGBA64LE", value: 107)
!695 = !DIEnumerator(name: "AV_PIX_FMT_BGRA64BE", value: 108)
!696 = !DIEnumerator(name: "AV_PIX_FMT_BGRA64LE", value: 109)
!697 = !DIEnumerator(name: "AV_PIX_FMT_YVYU422", value: 110)
!698 = !DIEnumerator(name: "AV_PIX_FMT_YA16BE", value: 111)
!699 = !DIEnumerator(name: "AV_PIX_FMT_YA16LE", value: 112)
!700 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP", value: 113)
!701 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP16BE", value: 114)
!702 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP16LE", value: 115)
!703 = !DIEnumerator(name: "AV_PIX_FMT_QSV", value: 116)
!704 = !DIEnumerator(name: "AV_PIX_FMT_MMAL", value: 117)
!705 = !DIEnumerator(name: "AV_PIX_FMT_D3D11VA_VLD", value: 118)
!706 = !DIEnumerator(name: "AV_PIX_FMT_CUDA", value: 119)
!707 = !DIEnumerator(name: "AV_PIX_FMT_0RGB", value: 120)
!708 = !DIEnumerator(name: "AV_PIX_FMT_RGB0", value: 121)
!709 = !DIEnumerator(name: "AV_PIX_FMT_0BGR", value: 122)
!710 = !DIEnumerator(name: "AV_PIX_FMT_BGR0", value: 123)
!711 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P12BE", value: 124)
!712 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P12LE", value: 125)
!713 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P14BE", value: 126)
!714 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P14LE", value: 127)
!715 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P12BE", value: 128)
!716 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P12LE", value: 129)
!717 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P14BE", value: 130)
!718 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P14LE", value: 131)
!719 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P12BE", value: 132)
!720 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P12LE", value: 133)
!721 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P14BE", value: 134)
!722 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P14LE", value: 135)
!723 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12BE", value: 136)
!724 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12LE", value: 137)
!725 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14BE", value: 138)
!726 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14LE", value: 139)
!727 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ411P", value: 140)
!728 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR8", value: 141)
!729 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB8", value: 142)
!730 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG8", value: 143)
!731 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG8", value: 144)
!732 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16LE", value: 145)
!733 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16BE", value: 146)
!734 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16LE", value: 147)
!735 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16BE", value: 148)
!736 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16LE", value: 149)
!737 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16BE", value: 150)
!738 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16LE", value: 151)
!739 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16BE", value: 152)
!740 = !DIEnumerator(name: "AV_PIX_FMT_XVMC", value: 153)
!741 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10LE", value: 154)
!742 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10BE", value: 155)
!743 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12LE", value: 156)
!744 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12BE", value: 157)
!745 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64LE", value: 158)
!746 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64BE", value: 159)
!747 = !DIEnumerator(name: "AV_PIX_FMT_VIDEOTOOLBOX", value: 160)
!748 = !DIEnumerator(name: "AV_PIX_FMT_P010LE", value: 161)
!749 = !DIEnumerator(name: "AV_PIX_FMT_P010BE", value: 162)
!750 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12BE", value: 163)
!751 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12LE", value: 164)
!752 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10BE", value: 165)
!753 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10LE", value: 166)
!754 = !DIEnumerator(name: "AV_PIX_FMT_MEDIACODEC", value: 167)
!755 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12BE", value: 168)
!756 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12LE", value: 169)
!757 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10BE", value: 170)
!758 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10LE", value: 171)
!759 = !DIEnumerator(name: "AV_PIX_FMT_P016LE", value: 172)
!760 = !DIEnumerator(name: "AV_PIX_FMT_P016BE", value: 173)
!761 = !DIEnumerator(name: "AV_PIX_FMT_D3D11", value: 174)
!762 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9BE", value: 175)
!763 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9LE", value: 176)
!764 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32BE", value: 177)
!765 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32LE", value: 178)
!766 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32BE", value: 179)
!767 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32LE", value: 180)
!768 = !DIEnumerator(name: "AV_PIX_FMT_DRM_PRIME", value: 181)
!769 = !DIEnumerator(name: "AV_PIX_FMT_OPENCL", value: 182)
!770 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14BE", value: 183)
!771 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14LE", value: 184)
!772 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32BE", value: 185)
!773 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32LE", value: 186)
!774 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12BE", value: 187)
!775 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12LE", value: 188)
!776 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12BE", value: 189)
!777 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12LE", value: 190)
!778 = !DIEnumerator(name: "AV_PIX_FMT_NB", value: 191)
!779 = !{!780, !206, !210, !200, !443}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64, align: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !293, line: 49, baseType: !782)
!782 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!783 = !{!784, !786, !790, !791, !792, !796}
!784 = distinct !DIGlobalVariable(name: "ff_vf_framerate", scope: !0, file: !785, line: 455, type: !267, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_vf_framerate)
!785 = !DIFile(filename: "libavfilter/vf_framerate.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!786 = distinct !DIGlobalVariable(name: "framerate_inputs", scope: !0, file: !785, line: 437, type: !787, isLocal: true, isDefinition: true, variable: [2 x %struct.AVFilterPad]* @framerate_inputs)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 1152, align: 64, elements: !788)
!788 = !{!789}
!789 = !DISubrange(count: 2)
!790 = distinct !DIGlobalVariable(name: "framerate_outputs", scope: !0, file: !785, line: 446, type: !787, isLocal: true, isDefinition: true, variable: [2 x %struct.AVFilterPad]* @framerate_outputs)
!791 = distinct !DIGlobalVariable(name: "framerate_class", scope: !0, file: !785, line: 63, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @framerate_class)
!792 = distinct !DIGlobalVariable(name: "framerate_options", scope: !0, file: !785, line: 49, type: !793, isLocal: true, isDefinition: true, variable: <{ { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption }>* @framerate_options)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 4096, align: 64, elements: !295)
!794 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !4, line: 301, baseType: !195)
!796 = distinct !DIGlobalVariable(name: "pix_fmts", scope: !797, file: !785, line: 226, type: !799, isLocal: true, isDefinition: true, variable: [21 x i32]* @query_formats.pix_fmts)
!797 = distinct !DISubprogram(name: "query_formats", scope: !785, file: !785, line: 224, type: !410, isLocal: true, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !798)
!798 = !{}
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 672, align: 32, elements: !801)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !580)
!801 = !{!802}
!802 = !DISubrange(count: 21)
!803 = !{i32 2, !"Dwarf Version", i32 4}
!804 = !{i32 2, !"Debug Info Version", i32 3}
!805 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!806 = distinct !DISubprogram(name: "ff_framerate_init", scope: !785, file: !785, line: 276, type: !807, isLocal: false, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !798)
!807 = !DISubroutineType(types: !808)
!808 = !{null, !809}
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameRateContext", file: !811, line: 69, baseType: !812)
!811 = !DIFile(filename: "libavfilter/framerate.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FrameRateContext", file: !811, line: 36, size: 1536, align: 64, elements: !813)
!813 = !{!814, !815, !816, !817, !818, !819, !820, !824, !825, !826, !827, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !812, file: !811, line: 37, baseType: !178, size: 64, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "dest_frame_rate", scope: !812, file: !811, line: 39, baseType: !213, size: 64, align: 32, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !812, file: !811, line: 40, baseType: !200, size: 32, align: 32, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "scene_score", scope: !812, file: !811, line: 41, baseType: !210, size: 64, align: 64, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "interp_start", scope: !812, file: !811, line: 42, baseType: !200, size: 32, align: 32, offset: 256)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "interp_end", scope: !812, file: !811, line: 43, baseType: !200, size: 32, align: 32, offset: 288)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "line_size", scope: !812, file: !811, line: 45, baseType: !821, size: 128, align: 32, offset: 320)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 128, align: 32, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 4)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "vsub", scope: !812, file: !811, line: 46, baseType: !200, size: 32, align: 32, offset: 448)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "srce_time_base", scope: !812, file: !811, line: 48, baseType: !213, size: 64, align: 32, offset: 480)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "dest_time_base", scope: !812, file: !811, line: 49, baseType: !213, size: 64, align: 32, offset: 544)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "sad", scope: !812, file: !811, line: 51, baseType: !828, size: 64, align: 64, offset: 640)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "ff_scene_sad_fn", file: !829, line: 34, baseType: !830)
!829 = !DIFile(filename: "libavfilter/scene_sad.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64, align: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !833, !835, !833, !835, !835, !835, !545}
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64, align: 64)
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !382, line: 149, baseType: !208)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "prev_mafd", scope: !812, file: !811, line: 52, baseType: !210, size: 64, align: 64, offset: 704)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "blend_factor_max", scope: !812, file: !811, line: 54, baseType: !200, size: 32, align: 32, offset: 768)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth", scope: !812, file: !811, line: 55, baseType: !200, size: 32, align: 32, offset: 800)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !812, file: !811, line: 56, baseType: !285, size: 64, align: 64, offset: 832)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "f0", scope: !812, file: !811, line: 58, baseType: !285, size: 64, align: 64, offset: 896)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !812, file: !811, line: 59, baseType: !285, size: 64, align: 64, offset: 960)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "pts0", scope: !812, file: !811, line: 60, baseType: !206, size: 64, align: 64, offset: 1024)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "pts1", scope: !812, file: !811, line: 61, baseType: !206, size: 64, align: 64, offset: 1088)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !812, file: !811, line: 62, baseType: !206, size: 64, align: 64, offset: 1152)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !812, file: !811, line: 63, baseType: !210, size: 64, align: 64, offset: 1216)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !812, file: !811, line: 64, baseType: !200, size: 32, align: 32, offset: 1280)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "start_pts", scope: !812, file: !811, line: 65, baseType: !206, size: 64, align: 64, offset: 1344)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !812, file: !811, line: 66, baseType: !206, size: 64, align: 64, offset: 1408)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "blend", scope: !812, file: !811, line: 68, baseType: !850, size: 64, align: 64, offset: 1472)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "blend_func", file: !811, line: 34, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64, align: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{null, !833, !835, !833, !835, !291, !835, !835, !835, !200, !200, !200}
!854 = !DILocalVariable(name: "s", arg: 1, scope: !806, file: !785, line: 276, type: !809)
!855 = !DIExpression()
!856 = !DILocation(line: 276, column: 42, scope: !806)
!857 = !DILocation(line: 278, column: 9, scope: !858)
!858 = distinct !DILexicalBlock(scope: !806, file: !785, line: 278, column: 9)
!859 = !DILocation(line: 278, column: 12, scope: !858)
!860 = !DILocation(line: 278, column: 21, scope: !858)
!861 = !DILocation(line: 278, column: 9, scope: !806)
!862 = !DILocation(line: 279, column: 9, scope: !863)
!863 = distinct !DILexicalBlock(scope: !858, file: !785, line: 278, column: 27)
!864 = !DILocation(line: 279, column: 12, scope: !863)
!865 = !DILocation(line: 279, column: 29, scope: !863)
!866 = !DILocation(line: 280, column: 9, scope: !863)
!867 = !DILocation(line: 280, column: 12, scope: !863)
!868 = !DILocation(line: 280, column: 18, scope: !863)
!869 = !DILocation(line: 281, column: 5, scope: !863)
!870 = !DILocation(line: 282, column: 9, scope: !871)
!871 = distinct !DILexicalBlock(scope: !858, file: !785, line: 281, column: 12)
!872 = !DILocation(line: 282, column: 12, scope: !871)
!873 = !DILocation(line: 282, column: 29, scope: !871)
!874 = !DILocation(line: 283, column: 9, scope: !871)
!875 = !DILocation(line: 283, column: 12, scope: !871)
!876 = !DILocation(line: 283, column: 18, scope: !871)
!877 = !DILocation(line: 286, column: 31, scope: !878)
!878 = distinct !DILexicalBlock(scope: !806, file: !785, line: 285, column: 9)
!879 = !DILocation(line: 286, column: 9, scope: !878)
!880 = !DILocation(line: 287, column: 1, scope: !806)
!881 = distinct !DISubprogram(name: "blend_frames_c", scope: !785, file: !785, line: 245, type: !852, isLocal: true, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !798)
!882 = !DILocalVariable(name: "src1", arg: 1, scope: !881, file: !785, line: 245, type: !833)
!883 = !DILocation(line: 245, column: 43, scope: !881)
!884 = !DILocalVariable(name: "src1_linesize", arg: 2, scope: !881, file: !785, line: 245, type: !835)
!885 = !DILocation(line: 245, column: 59, scope: !881)
!886 = !DILocalVariable(name: "src2", arg: 3, scope: !881, file: !785, line: 245, type: !833)
!887 = !DILocation(line: 245, column: 89, scope: !881)
!888 = !DILocalVariable(name: "src2_linesize", arg: 4, scope: !881, file: !785, line: 245, type: !835)
!889 = !DILocation(line: 245, column: 105, scope: !881)
!890 = !DILocalVariable(name: "dst", arg: 5, scope: !881, file: !785, line: 245, type: !291)
!891 = !DILocation(line: 245, column: 129, scope: !881)
!892 = !DILocalVariable(name: "dst_linesize", arg: 6, scope: !881, file: !785, line: 245, type: !835)
!893 = !DILocation(line: 245, column: 144, scope: !881)
!894 = !DILocalVariable(name: "width", arg: 7, scope: !881, file: !785, line: 245, type: !835)
!895 = !DILocation(line: 245, column: 168, scope: !881)
!896 = !DILocalVariable(name: "height", arg: 8, scope: !881, file: !785, line: 245, type: !835)
!897 = !DILocation(line: 245, column: 185, scope: !881)
!898 = !DILocalVariable(name: "factor1", arg: 9, scope: !881, file: !785, line: 245, type: !200)
!899 = !DILocation(line: 245, column: 197, scope: !881)
!900 = !DILocalVariable(name: "factor2", arg: 10, scope: !881, file: !785, line: 245, type: !200)
!901 = !DILocation(line: 245, column: 210, scope: !881)
!902 = !DILocalVariable(name: "half", arg: 11, scope: !881, file: !785, line: 245, type: !200)
!903 = !DILocation(line: 245, column: 223, scope: !881)
!904 = !DILocalVariable(name: "line", scope: !881, file: !785, line: 247, type: !200)
!905 = !DILocation(line: 247, column: 9, scope: !881)
!906 = !DILocalVariable(name: "pixel", scope: !881, file: !785, line: 247, type: !200)
!907 = !DILocation(line: 247, column: 15, scope: !881)
!908 = !DILocation(line: 248, column: 15, scope: !909)
!909 = distinct !DILexicalBlock(scope: !881, file: !785, line: 248, column: 5)
!910 = !DILocation(line: 248, column: 10, scope: !909)
!911 = !DILocation(line: 248, column: 20, scope: !912)
!912 = !DILexicalBlockFile(scope: !913, file: !785, discriminator: 1)
!913 = distinct !DILexicalBlock(scope: !909, file: !785, line: 248, column: 5)
!914 = !DILocation(line: 248, column: 27, scope: !912)
!915 = !DILocation(line: 248, column: 25, scope: !912)
!916 = !DILocation(line: 248, column: 5, scope: !912)
!917 = !DILocation(line: 249, column: 20, scope: !918)
!918 = distinct !DILexicalBlock(scope: !919, file: !785, line: 249, column: 9)
!919 = distinct !DILexicalBlock(scope: !913, file: !785, line: 248, column: 43)
!920 = !DILocation(line: 249, column: 14, scope: !918)
!921 = !DILocation(line: 249, column: 25, scope: !922)
!922 = !DILexicalBlockFile(scope: !923, file: !785, discriminator: 1)
!923 = distinct !DILexicalBlock(scope: !918, file: !785, line: 249, column: 9)
!924 = !DILocation(line: 249, column: 33, scope: !922)
!925 = !DILocation(line: 249, column: 31, scope: !922)
!926 = !DILocation(line: 249, column: 9, scope: !922)
!927 = !DILocation(line: 250, column: 33, scope: !923)
!928 = !DILocation(line: 250, column: 28, scope: !923)
!929 = !DILocation(line: 250, column: 42, scope: !923)
!930 = !DILocation(line: 250, column: 40, scope: !923)
!931 = !DILocation(line: 250, column: 59, scope: !923)
!932 = !DILocation(line: 250, column: 54, scope: !923)
!933 = !DILocation(line: 250, column: 68, scope: !923)
!934 = !DILocation(line: 250, column: 66, scope: !923)
!935 = !DILocation(line: 250, column: 51, scope: !923)
!936 = !DILocation(line: 250, column: 79, scope: !923)
!937 = !DILocation(line: 250, column: 77, scope: !923)
!938 = !DILocation(line: 250, column: 85, scope: !923)
!939 = !DILocation(line: 250, column: 26, scope: !923)
!940 = !DILocation(line: 250, column: 17, scope: !923)
!941 = !DILocation(line: 250, column: 13, scope: !923)
!942 = !DILocation(line: 250, column: 24, scope: !923)
!943 = !DILocation(line: 249, column: 45, scope: !944)
!944 = !DILexicalBlockFile(scope: !923, file: !785, discriminator: 2)
!945 = !DILocation(line: 249, column: 9, scope: !944)
!946 = distinct !{!946, !947}
!947 = !DILocation(line: 249, column: 9, scope: !919)
!948 = !DILocation(line: 251, column: 17, scope: !919)
!949 = !DILocation(line: 251, column: 14, scope: !919)
!950 = !DILocation(line: 252, column: 17, scope: !919)
!951 = !DILocation(line: 252, column: 14, scope: !919)
!952 = !DILocation(line: 253, column: 16, scope: !919)
!953 = !DILocation(line: 253, column: 13, scope: !919)
!954 = !DILocation(line: 254, column: 5, scope: !919)
!955 = !DILocation(line: 248, column: 39, scope: !956)
!956 = !DILexicalBlockFile(scope: !913, file: !785, discriminator: 2)
!957 = !DILocation(line: 248, column: 5, scope: !956)
!958 = distinct !{!958, !959}
!959 = !DILocation(line: 248, column: 5, scope: !881)
!960 = !DILocation(line: 255, column: 1, scope: !881)
!961 = distinct !DISubprogram(name: "blend_frames16_c", scope: !785, file: !785, line: 257, type: !852, isLocal: true, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !798)
!962 = !DILocalVariable(name: "src1", arg: 1, scope: !961, file: !785, line: 257, type: !833)
!963 = !DILocation(line: 257, column: 45, scope: !961)
!964 = !DILocalVariable(name: "src1_linesize", arg: 2, scope: !961, file: !785, line: 257, type: !835)
!965 = !DILocation(line: 257, column: 61, scope: !961)
!966 = !DILocalVariable(name: "src2", arg: 3, scope: !961, file: !785, line: 257, type: !833)
!967 = !DILocation(line: 257, column: 91, scope: !961)
!968 = !DILocalVariable(name: "src2_linesize", arg: 4, scope: !961, file: !785, line: 257, type: !835)
!969 = !DILocation(line: 257, column: 107, scope: !961)
!970 = !DILocalVariable(name: "dst", arg: 5, scope: !961, file: !785, line: 257, type: !291)
!971 = !DILocation(line: 257, column: 131, scope: !961)
!972 = !DILocalVariable(name: "dst_linesize", arg: 6, scope: !961, file: !785, line: 257, type: !835)
!973 = !DILocation(line: 257, column: 146, scope: !961)
!974 = !DILocalVariable(name: "width", arg: 7, scope: !961, file: !785, line: 257, type: !835)
!975 = !DILocation(line: 257, column: 170, scope: !961)
!976 = !DILocalVariable(name: "height", arg: 8, scope: !961, file: !785, line: 257, type: !835)
!977 = !DILocation(line: 257, column: 187, scope: !961)
!978 = !DILocalVariable(name: "factor1", arg: 9, scope: !961, file: !785, line: 257, type: !200)
!979 = !DILocation(line: 257, column: 199, scope: !961)
!980 = !DILocalVariable(name: "factor2", arg: 10, scope: !961, file: !785, line: 257, type: !200)
!981 = !DILocation(line: 257, column: 212, scope: !961)
!982 = !DILocalVariable(name: "half", arg: 11, scope: !961, file: !785, line: 257, type: !200)
!983 = !DILocation(line: 257, column: 225, scope: !961)
!984 = !DILocalVariable(name: "line", scope: !961, file: !785, line: 259, type: !200)
!985 = !DILocation(line: 259, column: 9, scope: !961)
!986 = !DILocalVariable(name: "pixel", scope: !961, file: !785, line: 259, type: !200)
!987 = !DILocation(line: 259, column: 15, scope: !961)
!988 = !DILocalVariable(name: "dstw", scope: !961, file: !785, line: 260, type: !780)
!989 = !DILocation(line: 260, column: 15, scope: !961)
!990 = !DILocation(line: 260, column: 34, scope: !961)
!991 = !DILocation(line: 260, column: 22, scope: !961)
!992 = !DILocalVariable(name: "src1w", scope: !961, file: !785, line: 261, type: !780)
!993 = !DILocation(line: 261, column: 15, scope: !961)
!994 = !DILocation(line: 261, column: 35, scope: !961)
!995 = !DILocation(line: 261, column: 23, scope: !961)
!996 = !DILocalVariable(name: "src2w", scope: !961, file: !785, line: 262, type: !780)
!997 = !DILocation(line: 262, column: 15, scope: !961)
!998 = !DILocation(line: 262, column: 35, scope: !961)
!999 = !DILocation(line: 262, column: 23, scope: !961)
!1000 = !DILocation(line: 263, column: 11, scope: !961)
!1001 = !DILocation(line: 264, column: 19, scope: !961)
!1002 = !DILocation(line: 265, column: 19, scope: !961)
!1003 = !DILocation(line: 266, column: 18, scope: !961)
!1004 = !DILocation(line: 267, column: 15, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !961, file: !785, line: 267, column: 5)
!1006 = !DILocation(line: 267, column: 10, scope: !1005)
!1007 = !DILocation(line: 267, column: 20, scope: !1008)
!1008 = !DILexicalBlockFile(scope: !1009, file: !785, discriminator: 1)
!1009 = distinct !DILexicalBlock(scope: !1005, file: !785, line: 267, column: 5)
!1010 = !DILocation(line: 267, column: 27, scope: !1008)
!1011 = !DILocation(line: 267, column: 25, scope: !1008)
!1012 = !DILocation(line: 267, column: 5, scope: !1008)
!1013 = !DILocation(line: 268, column: 20, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1015, file: !785, line: 268, column: 9)
!1015 = distinct !DILexicalBlock(scope: !1009, file: !785, line: 267, column: 43)
!1016 = !DILocation(line: 268, column: 14, scope: !1014)
!1017 = !DILocation(line: 268, column: 25, scope: !1018)
!1018 = !DILexicalBlockFile(scope: !1019, file: !785, discriminator: 1)
!1019 = distinct !DILexicalBlock(scope: !1014, file: !785, line: 268, column: 9)
!1020 = !DILocation(line: 268, column: 33, scope: !1018)
!1021 = !DILocation(line: 268, column: 31, scope: !1018)
!1022 = !DILocation(line: 268, column: 9, scope: !1018)
!1023 = !DILocation(line: 269, column: 35, scope: !1019)
!1024 = !DILocation(line: 269, column: 29, scope: !1019)
!1025 = !DILocation(line: 269, column: 44, scope: !1019)
!1026 = !DILocation(line: 269, column: 42, scope: !1019)
!1027 = !DILocation(line: 269, column: 62, scope: !1019)
!1028 = !DILocation(line: 269, column: 56, scope: !1019)
!1029 = !DILocation(line: 269, column: 71, scope: !1019)
!1030 = !DILocation(line: 269, column: 69, scope: !1019)
!1031 = !DILocation(line: 269, column: 53, scope: !1019)
!1032 = !DILocation(line: 269, column: 82, scope: !1019)
!1033 = !DILocation(line: 269, column: 80, scope: !1019)
!1034 = !DILocation(line: 269, column: 88, scope: !1019)
!1035 = !DILocation(line: 269, column: 27, scope: !1019)
!1036 = !DILocation(line: 269, column: 18, scope: !1019)
!1037 = !DILocation(line: 269, column: 13, scope: !1019)
!1038 = !DILocation(line: 269, column: 25, scope: !1019)
!1039 = !DILocation(line: 268, column: 45, scope: !1040)
!1040 = !DILexicalBlockFile(scope: !1019, file: !785, discriminator: 2)
!1041 = !DILocation(line: 268, column: 9, scope: !1040)
!1042 = distinct !{!1042, !1043}
!1043 = !DILocation(line: 268, column: 9, scope: !1015)
!1044 = !DILocation(line: 270, column: 18, scope: !1015)
!1045 = !DILocation(line: 270, column: 15, scope: !1015)
!1046 = !DILocation(line: 271, column: 18, scope: !1015)
!1047 = !DILocation(line: 271, column: 15, scope: !1015)
!1048 = !DILocation(line: 272, column: 17, scope: !1015)
!1049 = !DILocation(line: 272, column: 14, scope: !1015)
!1050 = !DILocation(line: 273, column: 5, scope: !1015)
!1051 = !DILocation(line: 267, column: 39, scope: !1052)
!1052 = !DILexicalBlockFile(scope: !1009, file: !785, discriminator: 2)
!1053 = !DILocation(line: 267, column: 5, scope: !1052)
!1054 = distinct !{!1054, !1055}
!1055 = !DILocation(line: 267, column: 5, scope: !961)
!1056 = !DILocation(line: 274, column: 1, scope: !961)
!1057 = distinct !DISubprogram(name: "init", scope: !785, file: !785, line: 210, type: !410, isLocal: true, isDefinition: true, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !798)
!1058 = !DILocalVariable(name: "ctx", arg: 1, scope: !1057, file: !785, line: 210, type: !173)
!1059 = !DILocation(line: 210, column: 56, scope: !1057)
!1060 = !DILocalVariable(name: "s", scope: !1057, file: !785, line: 212, type: !809)
!1061 = !DILocation(line: 212, column: 23, scope: !1057)
!1062 = !DILocation(line: 212, column: 27, scope: !1057)
!1063 = !DILocation(line: 212, column: 32, scope: !1057)
!1064 = !DILocation(line: 213, column: 5, scope: !1057)
!1065 = !DILocation(line: 213, column: 8, scope: !1057)
!1066 = !DILocation(line: 213, column: 18, scope: !1057)
!1067 = !DILocation(line: 214, column: 5, scope: !1057)
!1068 = distinct !DISubprogram(name: "uninit", scope: !785, file: !785, line: 217, type: !420, isLocal: true, isDefinition: true, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !798)
!1069 = !DILocalVariable(name: "ctx", arg: 1, scope: !1068, file: !785, line: 217, type: !173)
!1070 = !DILocation(line: 217, column: 59, scope: !1068)
!1071 = !DILocalVariable(name: "s", scope: !1068, file: !785, line: 219, type: !809)
!1072 = !DILocation(line: 219, column: 23, scope: !1068)
!1073 = !DILocation(line: 219, column: 27, scope: !1068)
!1074 = !DILocation(line: 219, column: 32, scope: !1068)
!1075 = !DILocation(line: 220, column: 20, scope: !1068)
!1076 = !DILocation(line: 220, column: 23, scope: !1068)
!1077 = !DILocation(line: 220, column: 5, scope: !1068)
!1078 = !DILocation(line: 221, column: 20, scope: !1068)
!1079 = !DILocation(line: 221, column: 23, scope: !1068)
!1080 = !DILocation(line: 221, column: 5, scope: !1068)
!1081 = !DILocation(line: 222, column: 1, scope: !1068)
!1082 = !DILocalVariable(name: "ctx", arg: 1, scope: !797, file: !785, line: 224, type: !173)
!1083 = !DILocation(line: 224, column: 43, scope: !797)
!1084 = !DILocalVariable(name: "fmts_list", scope: !797, file: !785, line: 239, type: !525)
!1085 = !DILocation(line: 239, column: 22, scope: !797)
!1086 = !DILocation(line: 239, column: 34, scope: !797)
!1087 = !DILocation(line: 240, column: 10, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !797, file: !785, line: 240, column: 9)
!1089 = !DILocation(line: 240, column: 9, scope: !797)
!1090 = !DILocation(line: 241, column: 9, scope: !1088)
!1091 = !DILocation(line: 242, column: 34, scope: !797)
!1092 = !DILocation(line: 242, column: 39, scope: !797)
!1093 = !DILocation(line: 242, column: 12, scope: !797)
!1094 = !DILocation(line: 242, column: 5, scope: !797)
!1095 = !DILocation(line: 243, column: 1, scope: !797)
!1096 = distinct !DISubprogram(name: "activate", scope: !785, file: !785, line: 315, type: !410, isLocal: true, isDefinition: true, scopeLine: 316, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !798)
!1097 = !DILocalVariable(name: "ctx", arg: 1, scope: !1096, file: !785, line: 315, type: !173)
!1098 = !DILocation(line: 315, column: 38, scope: !1096)
!1099 = !DILocalVariable(name: "ret", scope: !1096, file: !785, line: 317, type: !200)
!1100 = !DILocation(line: 317, column: 9, scope: !1096)
!1101 = !DILocalVariable(name: "status", scope: !1096, file: !785, line: 317, type: !200)
!1102 = !DILocation(line: 317, column: 14, scope: !1096)
!1103 = !DILocalVariable(name: "inlink", scope: !1096, file: !785, line: 318, type: !387)
!1104 = !DILocation(line: 318, column: 19, scope: !1096)
!1105 = !DILocation(line: 318, column: 28, scope: !1096)
!1106 = !DILocation(line: 318, column: 33, scope: !1096)
!1107 = !DILocalVariable(name: "outlink", scope: !1096, file: !785, line: 319, type: !387)
!1108 = !DILocation(line: 319, column: 19, scope: !1096)
!1109 = !DILocation(line: 319, column: 29, scope: !1096)
!1110 = !DILocation(line: 319, column: 34, scope: !1096)
!1111 = !DILocalVariable(name: "s", scope: !1096, file: !785, line: 320, type: !809)
!1112 = !DILocation(line: 320, column: 23, scope: !1096)
!1113 = !DILocation(line: 320, column: 27, scope: !1096)
!1114 = !DILocation(line: 320, column: 32, scope: !1096)
!1115 = !DILocalVariable(name: "inpicref", scope: !1096, file: !785, line: 321, type: !285)
!1116 = !DILocation(line: 321, column: 14, scope: !1096)
!1117 = !DILocalVariable(name: "pts", scope: !1096, file: !785, line: 322, type: !206)
!1118 = !DILocation(line: 322, column: 13, scope: !1096)
!1119 = !DILocation(line: 324, column: 5, scope: !1096)
!1120 = distinct !{!1120, !1119}
!1121 = !DILocalVariable(name: "ret", scope: !1122, file: !785, line: 324, type: !200)
!1122 = distinct !DILexicalBlock(scope: !1096, file: !785, line: 324, column: 8)
!1123 = !DILocation(line: 324, column: 14, scope: !1122)
!1124 = !DILocation(line: 324, column: 42, scope: !1125)
!1125 = !DILexicalBlockFile(scope: !1122, file: !785, discriminator: 1)
!1126 = !DILocation(line: 324, column: 20, scope: !1125)
!1127 = !DILocation(line: 324, column: 14, scope: !1125)
!1128 = !DILocation(line: 324, column: 56, scope: !1125)
!1129 = !DILocation(line: 324, column: 84, scope: !1130)
!1130 = !DILexicalBlockFile(scope: !1131, file: !785, discriminator: 2)
!1131 = distinct !DILexicalBlock(scope: !1132, file: !785, line: 324, column: 61)
!1132 = distinct !DILexicalBlock(scope: !1122, file: !785, line: 324, column: 56)
!1133 = !DILocation(line: 324, column: 92, scope: !1130)
!1134 = !DILocation(line: 324, column: 63, scope: !1130)
!1135 = !DILocation(line: 324, column: 98, scope: !1130)
!1136 = !DILocation(line: 324, column: 110, scope: !1137)
!1137 = !DILexicalBlockFile(scope: !1122, file: !785, discriminator: 3)
!1138 = !DILocation(line: 324, column: 110, scope: !1139)
!1139 = !DILexicalBlockFile(scope: !1122, file: !785, discriminator: 4)
!1140 = !DILocation(line: 327, column: 30, scope: !1096)
!1141 = !DILocation(line: 327, column: 11, scope: !1096)
!1142 = !DILocation(line: 327, column: 9, scope: !1096)
!1143 = !DILocation(line: 328, column: 9, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1096, file: !785, line: 328, column: 9)
!1145 = !DILocation(line: 328, column: 13, scope: !1144)
!1146 = !DILocation(line: 328, column: 9, scope: !1096)
!1147 = !DILocation(line: 329, column: 16, scope: !1144)
!1148 = !DILocation(line: 329, column: 9, scope: !1144)
!1149 = !DILocation(line: 330, column: 14, scope: !1150)
!1150 = distinct !DILexicalBlock(scope: !1144, file: !785, line: 330, column: 14)
!1151 = !DILocation(line: 330, column: 18, scope: !1150)
!1152 = !DILocation(line: 330, column: 14, scope: !1144)
!1153 = !DILocation(line: 331, column: 32, scope: !1150)
!1154 = !DILocation(line: 331, column: 41, scope: !1150)
!1155 = !DILocation(line: 331, column: 44, scope: !1150)
!1156 = !DILocation(line: 331, column: 16, scope: !1150)
!1157 = !DILocation(line: 331, column: 9, scope: !1150)
!1158 = !DILocation(line: 333, column: 35, scope: !1096)
!1159 = !DILocation(line: 333, column: 11, scope: !1096)
!1160 = !DILocation(line: 333, column: 9, scope: !1096)
!1161 = !DILocation(line: 334, column: 9, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1096, file: !785, line: 334, column: 9)
!1163 = !DILocation(line: 334, column: 13, scope: !1162)
!1164 = !DILocation(line: 334, column: 9, scope: !1096)
!1165 = !DILocation(line: 335, column: 16, scope: !1162)
!1166 = !DILocation(line: 335, column: 9, scope: !1162)
!1167 = !DILocation(line: 337, column: 9, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1096, file: !785, line: 337, column: 9)
!1169 = !DILocation(line: 337, column: 9, scope: !1096)
!1170 = !DILocation(line: 338, column: 13, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1172, file: !785, line: 338, column: 13)
!1172 = distinct !DILexicalBlock(scope: !1168, file: !785, line: 337, column: 19)
!1173 = !DILocation(line: 338, column: 23, scope: !1171)
!1174 = !DILocation(line: 338, column: 13, scope: !1172)
!1175 = !DILocation(line: 339, column: 20, scope: !1171)
!1176 = !DILocation(line: 339, column: 13, scope: !1171)
!1177 = !DILocation(line: 341, column: 13, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1172, file: !785, line: 341, column: 13)
!1179 = !DILocation(line: 341, column: 23, scope: !1178)
!1180 = !DILocation(line: 341, column: 27, scope: !1178)
!1181 = !DILocation(line: 341, column: 13, scope: !1172)
!1182 = !DILocation(line: 342, column: 20, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1178, file: !785, line: 341, column: 63)
!1184 = !DILocation(line: 342, column: 13, scope: !1183)
!1185 = !DILocation(line: 343, column: 13, scope: !1183)
!1186 = !DILocation(line: 344, column: 9, scope: !1183)
!1187 = !DILocation(line: 345, column: 5, scope: !1172)
!1188 = !DILocation(line: 347, column: 9, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1096, file: !785, line: 347, column: 9)
!1190 = !DILocation(line: 347, column: 9, scope: !1096)
!1191 = !DILocation(line: 348, column: 28, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1189, file: !785, line: 347, column: 19)
!1193 = !DILocation(line: 348, column: 38, scope: !1192)
!1194 = !DILocation(line: 348, column: 43, scope: !1192)
!1195 = !DILocation(line: 348, column: 46, scope: !1192)
!1196 = !DILocation(line: 348, column: 62, scope: !1192)
!1197 = !DILocation(line: 348, column: 65, scope: !1192)
!1198 = !DILocation(line: 348, column: 15, scope: !1192)
!1199 = !DILocation(line: 348, column: 13, scope: !1192)
!1200 = !DILocation(line: 350, column: 13, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1192, file: !785, line: 350, column: 13)
!1202 = !DILocation(line: 350, column: 16, scope: !1201)
!1203 = !DILocation(line: 350, column: 19, scope: !1201)
!1204 = !DILocation(line: 350, column: 22, scope: !1205)
!1205 = !DILexicalBlockFile(scope: !1201, file: !785, discriminator: 1)
!1206 = !DILocation(line: 350, column: 29, scope: !1205)
!1207 = !DILocation(line: 350, column: 32, scope: !1205)
!1208 = !DILocation(line: 350, column: 26, scope: !1205)
!1209 = !DILocation(line: 350, column: 13, scope: !1205)
!1210 = !DILocation(line: 351, column: 20, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1201, file: !785, line: 350, column: 38)
!1212 = !DILocation(line: 351, column: 13, scope: !1211)
!1213 = !DILocation(line: 352, column: 13, scope: !1211)
!1214 = !DILocation(line: 353, column: 9, scope: !1211)
!1215 = !DILocation(line: 354, column: 5, scope: !1192)
!1216 = !DILocation(line: 356, column: 9, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !1096, file: !785, line: 356, column: 9)
!1218 = !DILocation(line: 356, column: 9, scope: !1096)
!1219 = !DILocation(line: 357, column: 24, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1217, file: !785, line: 356, column: 19)
!1221 = !DILocation(line: 357, column: 27, scope: !1220)
!1222 = !DILocation(line: 357, column: 9, scope: !1220)
!1223 = !DILocation(line: 358, column: 17, scope: !1220)
!1224 = !DILocation(line: 358, column: 20, scope: !1220)
!1225 = !DILocation(line: 358, column: 9, scope: !1220)
!1226 = !DILocation(line: 358, column: 12, scope: !1220)
!1227 = !DILocation(line: 358, column: 15, scope: !1220)
!1228 = !DILocation(line: 359, column: 19, scope: !1220)
!1229 = !DILocation(line: 359, column: 22, scope: !1220)
!1230 = !DILocation(line: 359, column: 9, scope: !1220)
