; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--vf_noise.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--vf_noise.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFilterPad = type { i8*, i32, %struct.AVFrame* (%struct.AVFilterLink*, i32, i32)*, %struct.AVFrame* (%struct.AVFilterLink*, i32)*, i32 (%struct.AVFilterLink*, %struct.AVFrame*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32, i32 }
%struct.AVFrame = type { [8 x i8*], [8 x i32], i8**, i32, i32, i32, i32, i32, i32, %struct.AVRational, i64, i64, i64, i32, i32, i32, i8*, [8 x i64], i32, i32, i32, i32, i64, i32, i64, [8 x %struct.AVBufferRef*], %struct.AVBufferRef**, i32, %struct.AVFrameSideData**, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, %struct.AVDictionary*, i32, i32, i32, i8*, i32, i32, %struct.AVBufferRef*, %struct.AVBufferRef*, %struct.AVBufferRef*, i64, i64, i64, i64, %struct.AVBufferRef* }
%struct.AVRational = type { i32, i32 }
%struct.AVFrameSideData = type { i32, i8*, i32, %struct.AVDictionary*, %struct.AVBufferRef* }
%struct.AVDictionary = type opaque
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !48, line: 538, size: 32, align: 32, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!118 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!119 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!120 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!121 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!122 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!123 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!124 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVOptionType", file: !126, line: 221, size: 32, align: 32, elements: !127)
!126 = !DIFile(filename: "./libavutil/opt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146}
!128 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!129 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!130 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!131 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!132 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!133 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!134 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!135 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!136 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!137 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!138 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!139 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!140 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!141 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!142 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!143 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!144 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!145 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!146 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !148, line: 29, size: 32, align: 32, elements: !149)
!148 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167}
!150 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!151 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!152 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!153 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!154 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!155 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!156 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!157 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!158 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!159 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!160 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!161 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!162 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!163 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!164 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!165 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!166 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!167 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !170, file: !169, line: 503, size: 32, align: 32, elements: !575)
!169 = !DIFile(filename: "libavfilter/avfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterLink", file: !169, line: 439, size: 493504, align: 64, elements: !171)
!171 = !{!172, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !536, !537, !538, !539, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !170, file: !169, line: 440, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterContext", file: !169, line: 67, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterContext", file: !169, line: 338, size: 1344, align: 64, elements: !176)
!176 = !{!177, !264, !436, !437, !439, !441, !443, !444, !445, !446, !447, !487, !488, !494, !503, !504, !505, !507, !508, !509, !510, !511}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !175, file: !169, line: 339, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !148, line: 143, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !148, line: 67, size: 640, align: 64, elements: !182)
!182 = !{!183, !187, !192, !223, !224, !225, !226, !230, !236, !238, !242}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !181, file: !148, line: 72, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !181, file: !148, line: 78, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!184, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !181, file: !148, line: 85, baseType: !193, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !126, line: 246, size: 512, align: 64, elements: !196)
!196 = !{!197, !198, !199, !201, !202, !219, !220, !221, !222}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !126, line: 247, baseType: !184, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !195, file: !126, line: 253, baseType: !184, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !195, file: !126, line: 259, baseType: !200, size: 32, align: 32, offset: 128)
!200 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !126, line: 260, baseType: !125, size: 32, align: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !195, file: !126, line: 271, baseType: !203, size: 64, align: 64, offset: 192)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !195, file: !126, line: 265, size: 64, align: 64, elements: !204)
!204 = !{!205, !209, !211, !212}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !203, file: !126, line: 266, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !207, line: 40, baseType: !208)
!207 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!208 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !203, file: !126, line: 267, baseType: !210, size: 64, align: 64)
!210 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !203, file: !126, line: 268, baseType: !184, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !203, file: !126, line: 270, baseType: !213, size: 64, align: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !214, line: 61, baseType: !215)
!214 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !214, line: 58, size: 64, align: 32, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !215, file: !214, line: 59, baseType: !200, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !215, file: !214, line: 60, baseType: !200, size: 32, align: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !195, file: !126, line: 272, baseType: !210, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !195, file: !126, line: 273, baseType: !210, size: 64, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !195, file: !126, line: 275, baseType: !200, size: 32, align: 32, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !195, file: !126, line: 300, baseType: !184, size: 64, align: 64, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !181, file: !148, line: 93, baseType: !200, size: 32, align: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !181, file: !148, line: 99, baseType: !200, size: 32, align: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !181, file: !148, line: 108, baseType: !200, size: 32, align: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !181, file: !148, line: 113, baseType: !227, size: 64, align: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!191, !191, !191}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !181, file: !148, line: 123, baseType: !231, size: 64, align: 64, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!234, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !181, file: !148, line: 130, baseType: !237, size: 32, align: 32, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !148, line: 48, baseType: !147)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !181, file: !148, line: 136, baseType: !239, size: 64, align: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!237, !191}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !181, file: !148, line: 142, baseType: !243, size: 64, align: 64, offset: 576)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!200, !246, !191, !184, !200}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !126, line: 329, size: 128, align: 64, elements: !249)
!249 = !{!250, !262, !263}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !248, file: !126, line: 360, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !126, line: 324, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !126, line: 306, size: 384, align: 64, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !254, file: !126, line: 307, baseType: !184, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !254, file: !126, line: 313, baseType: !210, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !254, file: !126, line: 313, baseType: !210, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !254, file: !126, line: 318, baseType: !210, size: 64, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !254, file: !126, line: 318, baseType: !210, size: 64, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !254, file: !126, line: 323, baseType: !200, size: 32, align: 32, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !248, file: !126, line: 364, baseType: !200, size: 32, align: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !248, file: !126, line: 368, baseType: !200, size: 32, align: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !175, file: !169, line: 341, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilter", file: !169, line: 328, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilter", file: !169, line: 144, size: 1024, align: 64, elements: !269)
!269 = !{!270, !271, !272, !404, !405, !406, !407, !411, !412, !417, !421, !422, !423, !424, !426, !431, !435}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !169, line: 148, baseType: !184, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !268, file: !169, line: 155, baseType: !184, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !268, file: !169, line: 164, baseType: !273, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterPad", file: !169, line: 69, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterPad", file: !277, line: 54, size: 576, align: 64, elements: !278)
!277 = !DIFile(filename: "libavfilter/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!278 = !{!279, !280, !281, !388, !392, !396, !400, !401, !402, !403}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !277, line: 60, baseType: !184, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !276, file: !277, line: 65, baseType: !3, size: 32, align: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "get_video_buffer", scope: !276, file: !277, line: 73, baseType: !282, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!285, !386, !200, !200}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !24, line: 646, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !24, line: 268, size: 4288, align: 64, elements: !288)
!288 = !{!289, !296, !298, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !318, !319, !320, !321, !322, !323, !324, !325, !338, !340, !341, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !374, !375, !376, !377, !378, !379, !382, !383, !384, !385}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !287, file: !24, line: 282, baseType: !290, size: 512, align: 64)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 512, align: 64, elements: !294)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !207, line: 48, baseType: !293)
!293 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!294 = !{!295}
!295 = !DISubrange(count: 8)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !287, file: !24, line: 299, baseType: !297, size: 256, align: 32, offset: 512)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 256, align: 32, elements: !294)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !287, file: !24, line: 315, baseType: !299, size: 64, align: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !287, file: !24, line: 326, baseType: !200, size: 32, align: 32, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !287, file: !24, line: 326, baseType: !200, size: 32, align: 32, offset: 864)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !287, file: !24, line: 334, baseType: !200, size: 32, align: 32, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !287, file: !24, line: 341, baseType: !200, size: 32, align: 32, offset: 928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !287, file: !24, line: 346, baseType: !200, size: 32, align: 32, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !287, file: !24, line: 351, baseType: !13, size: 32, align: 32, offset: 992)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !287, file: !24, line: 356, baseType: !213, size: 64, align: 32, offset: 1024)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !287, file: !24, line: 361, baseType: !206, size: 64, align: 64, offset: 1088)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !287, file: !24, line: 369, baseType: !206, size: 64, align: 64, offset: 1152)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !287, file: !24, line: 377, baseType: !206, size: 64, align: 64, offset: 1216)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !287, file: !24, line: 382, baseType: !200, size: 32, align: 32, offset: 1280)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !287, file: !24, line: 386, baseType: !200, size: 32, align: 32, offset: 1312)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !287, file: !24, line: 391, baseType: !200, size: 32, align: 32, offset: 1344)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !287, file: !24, line: 396, baseType: !191, size: 64, align: 64, offset: 1408)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !287, file: !24, line: 403, baseType: !315, size: 512, align: 64, offset: 1472)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 512, align: 64, elements: !294)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !207, line: 55, baseType: !317)
!317 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !287, file: !24, line: 410, baseType: !200, size: 32, align: 32, offset: 1984)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !287, file: !24, line: 415, baseType: !200, size: 32, align: 32, offset: 2016)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !287, file: !24, line: 420, baseType: !200, size: 32, align: 32, offset: 2048)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !287, file: !24, line: 425, baseType: !200, size: 32, align: 32, offset: 2080)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !287, file: !24, line: 435, baseType: !206, size: 64, align: 64, offset: 2112)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !287, file: !24, line: 440, baseType: !200, size: 32, align: 32, offset: 2176)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !287, file: !24, line: 445, baseType: !316, size: 64, align: 64, offset: 2240)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !287, file: !24, line: 459, baseType: !326, size: 512, align: 64, offset: 2304)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 512, align: 64, elements: !294)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !329, line: 94, baseType: !330)
!329 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !329, line: 81, size: 192, align: 64, elements: !331)
!331 = !{!332, !336, !337}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !330, file: !329, line: 82, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !329, line: 73, baseType: !335)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !329, line: 73, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !330, file: !329, line: 89, baseType: !291, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !330, file: !329, line: 93, baseType: !200, size: 32, align: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !287, file: !24, line: 473, baseType: !339, size: 64, align: 64, offset: 2816)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !287, file: !24, line: 477, baseType: !200, size: 32, align: 32, offset: 2880)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !287, file: !24, line: 479, baseType: !342, size: 64, align: 64, offset: 2944)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !24, line: 207, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !24, line: 201, size: 320, align: 64, elements: !346)
!346 = !{!347, !348, !349, !350, !355}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !345, file: !24, line: 202, baseType: !23, size: 32, align: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !345, file: !24, line: 203, baseType: !291, size: 64, align: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !345, file: !24, line: 204, baseType: !200, size: 32, align: 32, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !345, file: !24, line: 205, baseType: !351, size: 64, align: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !353, line: 86, baseType: !354)
!353 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !353, line: 86, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !345, file: !24, line: 206, baseType: !327, size: 64, align: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !287, file: !24, line: 480, baseType: !200, size: 32, align: 32, offset: 3008)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !24, line: 505, baseType: !200, size: 32, align: 32, offset: 3040)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !287, file: !24, line: 512, baseType: !47, size: 32, align: 32, offset: 3072)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !287, file: !24, line: 514, baseType: !54, size: 32, align: 32, offset: 3104)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !287, file: !24, line: 516, baseType: !72, size: 32, align: 32, offset: 3136)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !287, file: !24, line: 523, baseType: !96, size: 32, align: 32, offset: 3168)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !287, file: !24, line: 525, baseType: !115, size: 32, align: 32, offset: 3200)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !287, file: !24, line: 532, baseType: !206, size: 64, align: 64, offset: 3264)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !287, file: !24, line: 539, baseType: !206, size: 64, align: 64, offset: 3328)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !287, file: !24, line: 547, baseType: !206, size: 64, align: 64, offset: 3392)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !287, file: !24, line: 554, baseType: !351, size: 64, align: 64, offset: 3456)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !287, file: !24, line: 563, baseType: !200, size: 32, align: 32, offset: 3520)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !287, file: !24, line: 572, baseType: !200, size: 32, align: 32, offset: 3552)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !287, file: !24, line: 581, baseType: !200, size: 32, align: 32, offset: 3584)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !287, file: !24, line: 588, baseType: !371, size: 64, align: 64, offset: 3648)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !207, line: 36, baseType: !373)
!373 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !287, file: !24, line: 593, baseType: !200, size: 32, align: 32, offset: 3712)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !287, file: !24, line: 596, baseType: !200, size: 32, align: 32, offset: 3744)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !287, file: !24, line: 599, baseType: !327, size: 64, align: 64, offset: 3776)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !287, file: !24, line: 605, baseType: !327, size: 64, align: 64, offset: 3840)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !287, file: !24, line: 616, baseType: !327, size: 64, align: 64, offset: 3904)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !287, file: !24, line: 626, baseType: !380, size: 64, align: 64, offset: 3968)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !381, line: 216, baseType: !317)
!381 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!382 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !287, file: !24, line: 627, baseType: !380, size: 64, align: 64, offset: 4032)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !287, file: !24, line: 628, baseType: !380, size: 64, align: 64, offset: 4096)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !287, file: !24, line: 629, baseType: !380, size: 64, align: 64, offset: 4160)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !287, file: !24, line: 645, baseType: !327, size: 64, align: 64, offset: 4224)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterLink", file: !169, line: 68, baseType: !170)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "get_audio_buffer", scope: !276, file: !277, line: 81, baseType: !389, size: 64, align: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!285, !386, !200}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "filter_frame", scope: !276, file: !277, line: 93, baseType: !393, size: 64, align: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!200, !386, !285}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "poll_frame", scope: !276, file: !277, line: 104, baseType: !397, size: 64, align: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!200, !386}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "request_frame", scope: !276, file: !277, line: 113, baseType: !397, size: 64, align: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "config_props", scope: !276, file: !277, line: 129, baseType: !397, size: 64, align: 64, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "needs_fifo", scope: !276, file: !277, line: 137, baseType: !200, size: 32, align: 32, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "needs_writable", scope: !276, file: !277, line: 145, baseType: !200, size: 32, align: 32, offset: 544)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !268, file: !169, line: 172, baseType: !273, size: 64, align: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !268, file: !169, line: 182, baseType: !178, size: 64, align: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !268, file: !169, line: 187, baseType: !200, size: 32, align: 32, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "preinit", scope: !268, file: !169, line: 210, baseType: !408, size: 64, align: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!200, !173}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !268, file: !169, line: 233, baseType: !408, size: 64, align: 64, offset: 448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "init_dict", scope: !268, file: !169, line: 246, baseType: !413, size: 64, align: 64, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!200, !173, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !268, file: !169, line: 258, baseType: !418, size: 64, align: 64, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !173}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "query_formats", scope: !268, file: !169, line: 282, baseType: !408, size: 64, align: 64, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "priv_size", scope: !268, file: !169, line: 284, baseType: !200, size: 32, align: 32, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flags_internal", scope: !268, file: !169, line: 286, baseType: !200, size: 32, align: 32, offset: 736)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !169, line: 292, baseType: !425, size: 64, align: 64, offset: 768)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "process_command", scope: !268, file: !169, line: 306, baseType: !427, size: 64, align: 64, offset: 832)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!200, !173, !184, !184, !430, !200, !200}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "init_opaque", scope: !268, file: !169, line: 313, baseType: !432, size: 64, align: 64, offset: 896)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!200, !173, !191}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !268, file: !169, line: 327, baseType: !408, size: 64, align: 64, offset: 960)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !169, line: 343, baseType: !430, size: 64, align: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "input_pads", scope: !175, file: !169, line: 345, baseType: !438, size: 64, align: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !175, file: !169, line: 346, baseType: !440, size: 64, align: 64, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !175, file: !169, line: 347, baseType: !442, size: 32, align: 32, offset: 320)
!442 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "output_pads", scope: !175, file: !169, line: 349, baseType: !438, size: 64, align: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !175, file: !169, line: 350, baseType: !440, size: 64, align: 64, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "nb_outputs", scope: !175, file: !169, line: 351, baseType: !442, size: 32, align: 32, offset: 512)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !175, file: !169, line: 353, baseType: !191, size: 64, align: 64, offset: 576)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !175, file: !169, line: 355, baseType: !448, size: 64, align: 64, offset: 640)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraph", file: !169, line: 840, size: 768, align: 64, elements: !450)
!450 = !{!451, !452, !454, !455, !456, !457, !458, !459, !481, !482, !483, !484, !485, !486}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !449, file: !169, line: 841, baseType: !178, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !449, file: !169, line: 842, baseType: !453, size: 64, align: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "nb_filters", scope: !449, file: !169, line: 843, baseType: !442, size: 32, align: 32, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "scale_sws_opts", scope: !449, file: !169, line: 845, baseType: !430, size: 64, align: 64, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "resample_lavr_opts", scope: !449, file: !169, line: 847, baseType: !430, size: 64, align: 64, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !449, file: !169, line: 862, baseType: !200, size: 32, align: 32, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !449, file: !169, line: 869, baseType: !200, size: 32, align: 32, offset: 352)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !449, file: !169, line: 874, baseType: !460, size: 64, align: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterGraphInternal", file: !169, line: 809, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraphInternal", file: !277, line: 148, size: 192, align: 64, elements: !463)
!463 = !{!464, !465, !475}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !462, file: !277, line: 149, baseType: !191, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "thread_execute", scope: !462, file: !277, line: 150, baseType: !466, size: 64, align: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_execute_func", file: !169, line: 837, baseType: !468)
!468 = !DISubroutineType(types: !469)
!469 = !{!200, !173, !470, !191, !474, !200}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_action_func", file: !169, line: 823, baseType: !472)
!472 = !DISubroutineType(types: !473)
!473 = !{!200, !173, !191, !200, !200}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "frame_queues", scope: !462, file: !277, line: 151, baseType: !476, size: 8, align: 8, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameQueueGlobal", file: !477, line: 48, baseType: !478)
!477 = !DIFile(filename: "libavfilter/framequeue.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameQueueGlobal", file: !477, line: 46, size: 8, align: 8, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !478, file: !477, line: 47, baseType: !186, size: 8, align: 8)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !449, file: !169, line: 881, baseType: !191, size: 64, align: 64, offset: 448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !449, file: !169, line: 895, baseType: !466, size: 64, align: 64, offset: 512)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "aresample_swr_opts", scope: !449, file: !169, line: 897, baseType: !430, size: 64, align: 64, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links", scope: !449, file: !169, line: 906, baseType: !440, size: 64, align: 64, offset: 640)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links_count", scope: !449, file: !169, line: 907, baseType: !200, size: 32, align: 32, offset: 704)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "disable_auto_convert", scope: !449, file: !169, line: 909, baseType: !442, size: 32, align: 32, offset: 736)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !175, file: !169, line: 373, baseType: !200, size: 32, align: 32, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !175, file: !169, line: 378, baseType: !489, size: 64, align: 64, offset: 768)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterInternal", file: !169, line: 335, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterInternal", file: !277, line: 154, size: 64, align: 64, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !491, file: !277, line: 155, baseType: !466, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "command_queue", scope: !175, file: !169, line: 380, baseType: !495, size: 64, align: 64, offset: 832)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterCommand", file: !277, line: 38, size: 320, align: 64, elements: !497)
!497 = !{!498, !499, !500, !501, !502}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !496, file: !277, line: 39, baseType: !210, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !496, file: !277, line: 40, baseType: !430, size: 64, align: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !496, file: !277, line: 41, baseType: !430, size: 64, align: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !496, file: !277, line: 42, baseType: !200, size: 32, align: 32, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !277, line: 43, baseType: !495, size: 64, align: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "enable_str", scope: !175, file: !169, line: 382, baseType: !430, size: 64, align: 64, offset: 896)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !175, file: !169, line: 383, baseType: !191, size: 64, align: 64, offset: 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "var_values", scope: !175, file: !169, line: 384, baseType: !506, size: 64, align: 64, offset: 1024)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "is_disabled", scope: !175, file: !169, line: 385, baseType: !200, size: 32, align: 32, offset: 1088)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !175, file: !169, line: 394, baseType: !327, size: 64, align: 64, offset: 1152)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !175, file: !169, line: 401, baseType: !200, size: 32, align: 32, offset: 1216)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !175, file: !169, line: 408, baseType: !442, size: 32, align: 32, offset: 1248)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !175, file: !169, line: 424, baseType: !200, size: 32, align: 32, offset: 1280)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "srcpad", scope: !170, file: !169, line: 441, baseType: !438, size: 64, align: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !170, file: !169, line: 443, baseType: !173, size: 64, align: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dstpad", scope: !170, file: !169, line: 444, baseType: !438, size: 64, align: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !169, line: 446, baseType: !3, size: 32, align: 32, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !170, file: !169, line: 449, baseType: !200, size: 32, align: 32, offset: 288)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !170, file: !169, line: 450, baseType: !200, size: 32, align: 32, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !170, file: !169, line: 451, baseType: !213, size: 64, align: 32, offset: 352)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !170, file: !169, line: 453, baseType: !316, size: 64, align: 64, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !170, file: !169, line: 454, baseType: !200, size: 32, align: 32, offset: 512)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !170, file: !169, line: 456, baseType: !200, size: 32, align: 32, offset: 544)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !170, file: !169, line: 465, baseType: !213, size: 64, align: 32, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "in_formats", scope: !170, file: !169, line: 481, baseType: !524, size: 64, align: 64, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterFormats", file: !169, line: 70, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterFormats", file: !527, line: 64, size: 256, align: 64, elements: !528)
!527 = !DIFile(filename: "libavfilter/formats.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!528 = !{!529, !530, !531, !532}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nb_formats", scope: !526, file: !527, line: 65, baseType: !442, size: 32, align: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !526, file: !527, line: 66, baseType: !474, size: 64, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !526, file: !527, line: 68, baseType: !442, size: 32, align: 32, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !526, file: !527, line: 69, baseType: !533, size: 64, align: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "out_formats", scope: !170, file: !169, line: 482, baseType: !524, size: 64, align: 64, offset: 704)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "in_samplerates", scope: !170, file: !169, line: 488, baseType: !524, size: 64, align: 64, offset: 768)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "out_samplerates", scope: !170, file: !169, line: 489, baseType: !524, size: 64, align: 64, offset: 832)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "in_channel_layouts", scope: !170, file: !169, line: 490, baseType: !540, size: 64, align: 64, offset: 896)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterChannelLayouts", file: !527, line: 85, size: 256, align: 64, elements: !542)
!542 = !{!543, !545, !546, !547, !548, !549}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !541, file: !527, line: 86, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "nb_channel_layouts", scope: !541, file: !527, line: 87, baseType: !200, size: 32, align: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "all_layouts", scope: !541, file: !527, line: 88, baseType: !186, size: 8, align: 8, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "all_counts", scope: !541, file: !527, line: 89, baseType: !186, size: 8, align: 8, offset: 104)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !541, file: !527, line: 91, baseType: !442, size: 32, align: 32, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !541, file: !527, line: 92, baseType: !550, size: 64, align: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "out_channel_layouts", scope: !170, file: !169, line: 491, baseType: !540, size: 64, align: 64, offset: 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "request_samples", scope: !170, file: !169, line: 500, baseType: !200, size: 32, align: 32, offset: 1024)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !170, file: !169, line: 507, baseType: !168, size: 32, align: 32, offset: 1056)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !170, file: !169, line: 512, baseType: !448, size: 64, align: 64, offset: 1088)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts", scope: !170, file: !169, line: 518, baseType: !206, size: 64, align: 64, offset: 1152)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts_us", scope: !170, file: !169, line: 524, baseType: !206, size: 64, align: 64, offset: 1216)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "age_index", scope: !170, file: !169, line: 529, baseType: !200, size: 32, align: 32, offset: 1280)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !170, file: !169, line: 542, baseType: !213, size: 64, align: 32, offset: 1312)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf", scope: !170, file: !169, line: 547, baseType: !285, size: 64, align: 64, offset: 1408)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf_size", scope: !170, file: !169, line: 553, baseType: !200, size: 32, align: 32, offset: 1472)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "min_samples", scope: !170, file: !169, line: 562, baseType: !200, size: 32, align: 32, offset: 1504)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "max_samples", scope: !170, file: !169, line: 568, baseType: !200, size: 32, align: 32, offset: 1536)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !170, file: !169, line: 573, baseType: !200, size: 32, align: 32, offset: 1568)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !170, file: !169, line: 578, baseType: !442, size: 32, align: 32, offset: 1600)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_in", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1664)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_out", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1728)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pool", scope: !170, file: !169, line: 588, baseType: !191, size: 64, align: 64, offset: 1792)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "frame_wanted_out", scope: !170, file: !169, line: 595, baseType: !200, size: 32, align: 32, offset: 1856)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !170, file: !169, line: 601, baseType: !327, size: 64, align: 64, offset: 1920)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !170, file: !169, line: 610, baseType: !572, size: 491520, align: 8, offset: 1984)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 491520, align: 8, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 61440)
!575 = !{!576, !577, !578}
!576 = !DIEnumerator(name: "AVLINK_UNINIT", value: 0)
!577 = !DIEnumerator(name: "AVLINK_STARTINIT", value: 1)
!578 = !DIEnumerator(name: "AVLINK_INIT", value: 2)
!579 = !{!580, !582, !200, !210, !583}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64, align: 64)
!583 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!584 = !{!585, !587, !591, !592, !593, !599}
!585 = distinct !DIGlobalVariable(name: "ff_vf_noise", scope: !0, file: !586, line: 340, type: !267, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_vf_noise)
!586 = !DIFile(filename: "libavfilter/vf_noise.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!587 = distinct !DIGlobalVariable(name: "noise_inputs", scope: !0, file: !586, line: 322, type: !588, isLocal: true, isDefinition: true, variable: [2 x %struct.AVFilterPad]* @noise_inputs)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 1152, align: 64, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 2)
!591 = distinct !DIGlobalVariable(name: "noise_outputs", scope: !0, file: !586, line: 332, type: !588, isLocal: true, isDefinition: true, variable: [2 x %struct.AVFilterPad]* @noise_outputs)
!592 = distinct !DIGlobalVariable(name: "noise_class", scope: !0, file: !586, line: 65, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @noise_class)
!593 = distinct !DIGlobalVariable(name: "noise_options", scope: !0, file: !586, line: 56, type: !594, isLocal: true, isDefinition: true, variable: [46 x %struct.AVOption]* @noise_options)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 23552, align: 64, elements: !597)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !126, line: 301, baseType: !195)
!597 = !{!598}
!598 = !DISubrange(count: 46)
!599 = distinct !DIGlobalVariable(name: "patt", scope: !0, file: !586, line: 67, type: !600, isLocal: true, isDefinition: true, variable: [4 x i8]* @patt)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 32, align: 8, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 4)
!603 = !{i32 2, !"Dwarf Version", i32 4}
!604 = !{i32 2, !"Debug Info Version", i32 3}
!605 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!606 = distinct !DISubprogram(name: "ff_line_noise_c", scope: !586, file: !586, line: 165, type: !607, isLocal: false, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !611)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !291, !609, !580, !200, !200}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64, align: 64)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!611 = !{}
!612 = !DILocalVariable(name: "a", arg: 1, scope: !613, file: !614, line: 159, type: !200)
!613 = distinct !DISubprogram(name: "av_clip_uint8_c", scope: !614, file: !614, line: 159, type: !615, isLocal: true, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !611)
!614 = !DIFile(filename: "./libavutil/common.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!615 = !DISubroutineType(types: !616)
!616 = !{!292, !200}
!617 = !DIExpression()
!618 = !DILocation(line: 159, column: 97, scope: !613, inlinedAt: !619)
!619 = distinct !DILocation(line: 174, column: 18, scope: !620)
!620 = distinct !DILexicalBlock(scope: !621, file: !586, line: 171, column: 31)
!621 = distinct !DILexicalBlock(scope: !622, file: !586, line: 171, column: 5)
!622 = distinct !DILexicalBlock(scope: !606, file: !586, line: 171, column: 5)
!623 = !DILocalVariable(name: "dst", arg: 1, scope: !606, file: !586, line: 165, type: !291)
!624 = !DILocation(line: 165, column: 31, scope: !606)
!625 = !DILocalVariable(name: "src", arg: 2, scope: !606, file: !586, line: 165, type: !609)
!626 = !DILocation(line: 165, column: 51, scope: !606)
!627 = !DILocalVariable(name: "noise", arg: 3, scope: !606, file: !586, line: 165, type: !580)
!628 = !DILocation(line: 165, column: 70, scope: !606)
!629 = !DILocalVariable(name: "len", arg: 4, scope: !606, file: !586, line: 166, type: !200)
!630 = !DILocation(line: 166, column: 26, scope: !606)
!631 = !DILocalVariable(name: "shift", arg: 5, scope: !606, file: !586, line: 166, type: !200)
!632 = !DILocation(line: 166, column: 35, scope: !606)
!633 = !DILocalVariable(name: "i", scope: !606, file: !586, line: 168, type: !200)
!634 = !DILocation(line: 168, column: 9, scope: !606)
!635 = !DILocation(line: 170, column: 14, scope: !606)
!636 = !DILocation(line: 170, column: 11, scope: !606)
!637 = !DILocation(line: 171, column: 12, scope: !622)
!638 = !DILocation(line: 171, column: 10, scope: !622)
!639 = !DILocation(line: 171, column: 17, scope: !640)
!640 = !DILexicalBlockFile(scope: !621, file: !586, discriminator: 1)
!641 = !DILocation(line: 171, column: 21, scope: !640)
!642 = !DILocation(line: 171, column: 19, scope: !640)
!643 = !DILocation(line: 171, column: 5, scope: !640)
!644 = !DILocalVariable(name: "v", scope: !620, file: !586, line: 172, type: !200)
!645 = !DILocation(line: 172, column: 13, scope: !620)
!646 = !DILocation(line: 172, column: 21, scope: !620)
!647 = !DILocation(line: 172, column: 17, scope: !620)
!648 = !DILocation(line: 172, column: 32, scope: !620)
!649 = !DILocation(line: 172, column: 26, scope: !620)
!650 = !DILocation(line: 172, column: 24, scope: !620)
!651 = !DILocation(line: 174, column: 34, scope: !620)
!652 = !DILocation(line: 174, column: 18, scope: !620)
!653 = !DILocation(line: 161, column: 9, scope: !654, inlinedAt: !619)
!654 = distinct !DILexicalBlock(scope: !613, file: !614, line: 161, column: 9)
!655 = !DILocation(line: 161, column: 10, scope: !654, inlinedAt: !619)
!656 = !DILocation(line: 161, column: 9, scope: !613, inlinedAt: !619)
!657 = !DILocation(line: 161, column: 29, scope: !658, inlinedAt: !619)
!658 = !DILexicalBlockFile(scope: !654, file: !614, discriminator: 1)
!659 = !DILocation(line: 161, column: 28, scope: !658, inlinedAt: !619)
!660 = !DILocation(line: 161, column: 31, scope: !658, inlinedAt: !619)
!661 = !DILocation(line: 161, column: 27, scope: !658, inlinedAt: !619)
!662 = !DILocation(line: 161, column: 20, scope: !658, inlinedAt: !619)
!663 = !DILocation(line: 162, column: 17, scope: !654, inlinedAt: !619)
!664 = !DILocation(line: 162, column: 10, scope: !654, inlinedAt: !619)
!665 = !DILocation(line: 163, column: 1, scope: !613, inlinedAt: !619)
!666 = !DILocation(line: 174, column: 13, scope: !620)
!667 = !DILocation(line: 174, column: 9, scope: !620)
!668 = !DILocation(line: 174, column: 16, scope: !620)
!669 = !DILocation(line: 175, column: 5, scope: !620)
!670 = !DILocation(line: 171, column: 27, scope: !671)
!671 = !DILexicalBlockFile(scope: !621, file: !586, discriminator: 2)
!672 = !DILocation(line: 171, column: 5, scope: !671)
!673 = distinct !{!673, !674}
!674 = !DILocation(line: 171, column: 5, scope: !606)
!675 = !DILocation(line: 176, column: 1, scope: !606)
!676 = distinct !DISubprogram(name: "ff_line_noise_avg_c", scope: !586, file: !586, line: 178, type: !677, isLocal: false, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !611)
!677 = !DISubroutineType(types: !678)
!678 = !{null, !291, !609, !200, !679}
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64, align: 64)
!680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !580)
!681 = !DILocalVariable(name: "dst", arg: 1, scope: !676, file: !586, line: 178, type: !291)
!682 = !DILocation(line: 178, column: 35, scope: !676)
!683 = !DILocalVariable(name: "src", arg: 2, scope: !676, file: !586, line: 178, type: !609)
!684 = !DILocation(line: 178, column: 55, scope: !676)
!685 = !DILocalVariable(name: "len", arg: 3, scope: !676, file: !586, line: 179, type: !200)
!686 = !DILocation(line: 179, column: 30, scope: !676)
!687 = !DILocalVariable(name: "shift", arg: 4, scope: !676, file: !586, line: 179, type: !679)
!688 = !DILocation(line: 179, column: 57, scope: !676)
!689 = !DILocalVariable(name: "i", scope: !676, file: !586, line: 181, type: !200)
!690 = !DILocation(line: 181, column: 9, scope: !676)
!691 = !DILocalVariable(name: "src2", scope: !676, file: !586, line: 182, type: !580)
!692 = !DILocation(line: 182, column: 19, scope: !676)
!693 = !DILocation(line: 182, column: 41, scope: !676)
!694 = !DILocation(line: 184, column: 12, scope: !695)
!695 = distinct !DILexicalBlock(scope: !676, file: !586, line: 184, column: 5)
!696 = !DILocation(line: 184, column: 10, scope: !695)
!697 = !DILocation(line: 184, column: 17, scope: !698)
!698 = !DILexicalBlockFile(scope: !699, file: !586, discriminator: 1)
!699 = distinct !DILexicalBlock(scope: !695, file: !586, line: 184, column: 5)
!700 = !DILocation(line: 184, column: 21, scope: !698)
!701 = !DILocation(line: 184, column: 19, scope: !698)
!702 = !DILocation(line: 184, column: 5, scope: !698)
!703 = !DILocalVariable(name: "n", scope: !704, file: !586, line: 185, type: !705)
!704 = distinct !DILexicalBlock(scope: !699, file: !586, line: 184, column: 31)
!705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!706 = !DILocation(line: 185, column: 19, scope: !704)
!707 = !DILocation(line: 185, column: 32, scope: !704)
!708 = !DILocation(line: 185, column: 23, scope: !704)
!709 = !DILocation(line: 185, column: 46, scope: !704)
!710 = !DILocation(line: 185, column: 37, scope: !704)
!711 = !DILocation(line: 185, column: 35, scope: !704)
!712 = !DILocation(line: 185, column: 60, scope: !704)
!713 = !DILocation(line: 185, column: 51, scope: !704)
!714 = !DILocation(line: 185, column: 49, scope: !704)
!715 = !DILocation(line: 186, column: 23, scope: !704)
!716 = !DILocation(line: 186, column: 18, scope: !704)
!717 = !DILocation(line: 186, column: 30, scope: !704)
!718 = !DILocation(line: 186, column: 39, scope: !704)
!719 = !DILocation(line: 186, column: 34, scope: !704)
!720 = !DILocation(line: 186, column: 32, scope: !704)
!721 = !DILocation(line: 186, column: 43, scope: !704)
!722 = !DILocation(line: 186, column: 26, scope: !704)
!723 = !DILocation(line: 186, column: 13, scope: !704)
!724 = !DILocation(line: 186, column: 9, scope: !704)
!725 = !DILocation(line: 186, column: 16, scope: !704)
!726 = !DILocation(line: 187, column: 5, scope: !704)
!727 = !DILocation(line: 184, column: 27, scope: !728)
!728 = !DILexicalBlockFile(scope: !699, file: !586, discriminator: 2)
!729 = !DILocation(line: 184, column: 5, scope: !728)
!730 = distinct !{!730, !731}
!731 = !DILocation(line: 184, column: 5, scope: !676)
!732 = !DILocation(line: 188, column: 1, scope: !676)
!733 = distinct !DISubprogram(name: "init", scope: !586, file: !586, line: 283, type: !409, isLocal: true, isDefinition: true, scopeLine: 284, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !611)
!734 = !DILocalVariable(name: "ctx", arg: 1, scope: !733, file: !586, line: 283, type: !173)
!735 = !DILocation(line: 283, column: 56, scope: !733)
!736 = !DILocalVariable(name: "n", scope: !733, file: !586, line: 285, type: !737)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64, align: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "NoiseContext", file: !739, line: 57, baseType: !740)
!739 = !DIFile(filename: "libavfilter/vf_noise.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NoiseContext", file: !739, line: 48, size: 4599552, align: 64, elements: !741)
!741 = !{!742, !743, !744, !746, !747, !774, !776, !778}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !740, file: !739, line: 49, baseType: !178, size: 64, align: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "nb_planes", scope: !740, file: !739, line: 50, baseType: !200, size: 32, align: 32, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "bytewidth", scope: !740, file: !739, line: 51, baseType: !745, size: 128, align: 32, offset: 96)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 128, align: 32, elements: !601)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !740, file: !739, line: 52, baseType: !745, size: 128, align: 32, offset: 224)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "all", scope: !740, file: !739, line: 53, baseType: !748, size: 919808, align: 64, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterParams", file: !739, line: 46, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FilterParams", file: !739, line: 37, size: 919808, align: 64, elements: !750)
!750 = !{!751, !752, !753, !763, !764, !765, !770, !773}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !749, file: !739, line: 38, baseType: !200, size: 32, align: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !749, file: !739, line: 39, baseType: !442, size: 32, align: 32, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "lfg", scope: !749, file: !739, line: 40, baseType: !754, size: 2080, align: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVLFG", file: !755, line: 30, baseType: !756)
!755 = !DIFile(filename: "./libavutil/lfg.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVLFG", file: !755, line: 27, size: 2080, align: 32, elements: !757)
!757 = !{!758, !762}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !756, file: !755, line: 28, baseType: !759, size: 2048, align: 32)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 2048, align: 32, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !756, file: !755, line: 29, baseType: !200, size: 32, align: 32, offset: 2048)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !749, file: !739, line: 41, baseType: !200, size: 32, align: 32, offset: 2144)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "noise", scope: !749, file: !739, line: 42, baseType: !371, size: 64, align: 64, offset: 2176)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "prev_shift", scope: !749, file: !739, line: 43, baseType: !766, size: 786432, align: 64, offset: 2240)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 786432, align: 64, elements: !767)
!767 = !{!768, !769}
!768 = !DISubrange(count: 4096)
!769 = !DISubrange(count: 3)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "rand_shift", scope: !749, file: !739, line: 44, baseType: !771, size: 131072, align: 32, offset: 788672)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 131072, align: 32, elements: !772)
!772 = !{!768}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "rand_shift_init", scope: !749, file: !739, line: 45, baseType: !200, size: 32, align: 32, offset: 919744)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !740, file: !739, line: 54, baseType: !775, size: 3679232, align: 64, offset: 920192)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 3679232, align: 64, elements: !601)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "line_noise", scope: !740, file: !739, line: 55, baseType: !777, size: 64, align: 64, offset: 4599424)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64, align: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "line_noise_avg", scope: !740, file: !739, line: 56, baseType: !779, size: 64, align: 64, offset: 4599488)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64, align: 64)
!780 = !DILocation(line: 285, column: 19, scope: !733)
!781 = !DILocation(line: 285, column: 23, scope: !733)
!782 = !DILocation(line: 285, column: 28, scope: !733)
!783 = !DILocalVariable(name: "ret", scope: !733, file: !586, line: 286, type: !200)
!784 = !DILocation(line: 286, column: 9, scope: !733)
!785 = !DILocalVariable(name: "i", scope: !733, file: !586, line: 286, type: !200)
!786 = !DILocation(line: 286, column: 14, scope: !733)
!787 = !DILocation(line: 288, column: 12, scope: !788)
!788 = distinct !DILexicalBlock(scope: !733, file: !586, line: 288, column: 5)
!789 = !DILocation(line: 288, column: 10, scope: !788)
!790 = !DILocation(line: 288, column: 17, scope: !791)
!791 = !DILexicalBlockFile(scope: !792, file: !586, discriminator: 1)
!792 = distinct !DILexicalBlock(scope: !788, file: !586, line: 288, column: 5)
!793 = !DILocation(line: 288, column: 19, scope: !791)
!794 = !DILocation(line: 288, column: 5, scope: !791)
!795 = !DILocation(line: 289, column: 13, scope: !796)
!796 = distinct !DILexicalBlock(scope: !797, file: !586, line: 289, column: 13)
!797 = distinct !DILexicalBlock(scope: !792, file: !586, line: 288, column: 29)
!798 = !DILocation(line: 289, column: 16, scope: !796)
!799 = !DILocation(line: 289, column: 20, scope: !796)
!800 = !DILocation(line: 289, column: 25, scope: !796)
!801 = !DILocation(line: 289, column: 13, scope: !797)
!802 = !DILocation(line: 290, column: 32, scope: !796)
!803 = !DILocation(line: 290, column: 35, scope: !796)
!804 = !DILocation(line: 290, column: 39, scope: !796)
!805 = !DILocation(line: 290, column: 22, scope: !796)
!806 = !DILocation(line: 290, column: 13, scope: !796)
!807 = !DILocation(line: 290, column: 16, scope: !796)
!808 = !DILocation(line: 290, column: 25, scope: !796)
!809 = !DILocation(line: 290, column: 30, scope: !796)
!810 = !DILocation(line: 292, column: 22, scope: !796)
!811 = !DILocation(line: 292, column: 13, scope: !796)
!812 = !DILocation(line: 292, column: 16, scope: !796)
!813 = !DILocation(line: 292, column: 25, scope: !796)
!814 = !DILocation(line: 292, column: 30, scope: !796)
!815 = !DILocation(line: 293, column: 13, scope: !816)
!816 = distinct !DILexicalBlock(scope: !797, file: !586, line: 293, column: 13)
!817 = !DILocation(line: 293, column: 16, scope: !816)
!818 = !DILocation(line: 293, column: 20, scope: !816)
!819 = !DILocation(line: 293, column: 13, scope: !797)
!820 = !DILocation(line: 294, column: 36, scope: !816)
!821 = !DILocation(line: 294, column: 39, scope: !816)
!822 = !DILocation(line: 294, column: 43, scope: !816)
!823 = !DILocation(line: 294, column: 22, scope: !816)
!824 = !DILocation(line: 294, column: 13, scope: !816)
!825 = !DILocation(line: 294, column: 16, scope: !816)
!826 = !DILocation(line: 294, column: 25, scope: !816)
!827 = !DILocation(line: 294, column: 34, scope: !816)
!828 = !DILocation(line: 295, column: 13, scope: !829)
!829 = distinct !DILexicalBlock(scope: !797, file: !586, line: 295, column: 13)
!830 = !DILocation(line: 295, column: 16, scope: !829)
!831 = !DILocation(line: 295, column: 20, scope: !829)
!832 = !DILocation(line: 295, column: 13, scope: !797)
!833 = !DILocation(line: 296, column: 33, scope: !829)
!834 = !DILocation(line: 296, column: 36, scope: !829)
!835 = !DILocation(line: 296, column: 40, scope: !829)
!836 = !DILocation(line: 296, column: 22, scope: !829)
!837 = !DILocation(line: 296, column: 13, scope: !829)
!838 = !DILocation(line: 296, column: 16, scope: !829)
!839 = !DILocation(line: 296, column: 25, scope: !829)
!840 = !DILocation(line: 296, column: 31, scope: !829)
!841 = !DILocation(line: 297, column: 5, scope: !797)
!842 = !DILocation(line: 288, column: 25, scope: !843)
!843 = !DILexicalBlockFile(scope: !792, file: !586, discriminator: 2)
!844 = !DILocation(line: 288, column: 5, scope: !843)
!845 = distinct !{!845, !846}
!846 = !DILocation(line: 288, column: 5, scope: !733)
!847 = !DILocation(line: 299, column: 12, scope: !848)
!848 = distinct !DILexicalBlock(scope: !733, file: !586, line: 299, column: 5)
!849 = !DILocation(line: 299, column: 10, scope: !848)
!850 = !DILocation(line: 299, column: 17, scope: !851)
!851 = !DILexicalBlockFile(scope: !852, file: !586, discriminator: 1)
!852 = distinct !DILexicalBlock(scope: !848, file: !586, line: 299, column: 5)
!853 = !DILocation(line: 299, column: 19, scope: !851)
!854 = !DILocation(line: 299, column: 5, scope: !851)
!855 = !DILocation(line: 300, column: 22, scope: !856)
!856 = distinct !DILexicalBlock(scope: !857, file: !586, line: 300, column: 13)
!857 = distinct !DILexicalBlock(scope: !852, file: !586, line: 299, column: 29)
!858 = !DILocation(line: 300, column: 13, scope: !856)
!859 = !DILocation(line: 300, column: 16, scope: !856)
!860 = !DILocation(line: 300, column: 25, scope: !856)
!861 = !DILocation(line: 300, column: 34, scope: !856)
!862 = !DILocation(line: 300, column: 56, scope: !863)
!863 = !DILexicalBlockFile(scope: !856, file: !586, discriminator: 1)
!864 = !DILocation(line: 300, column: 59, scope: !863)
!865 = !DILocation(line: 300, column: 45, scope: !863)
!866 = !DILocation(line: 300, column: 43, scope: !863)
!867 = !DILocation(line: 300, column: 63, scope: !863)
!868 = !DILocation(line: 300, column: 13, scope: !863)
!869 = !DILocation(line: 301, column: 20, scope: !856)
!870 = !DILocation(line: 301, column: 13, scope: !856)
!871 = !DILocation(line: 302, column: 5, scope: !857)
!872 = !DILocation(line: 299, column: 25, scope: !873)
!873 = !DILexicalBlockFile(scope: !852, file: !586, discriminator: 2)
!874 = !DILocation(line: 299, column: 5, scope: !873)
!875 = distinct !{!875, !876}
!876 = !DILocation(line: 299, column: 5, scope: !733)
!877 = !DILocation(line: 304, column: 5, scope: !733)
!878 = !DILocation(line: 304, column: 8, scope: !733)
!879 = !DILocation(line: 304, column: 19, scope: !733)
!880 = !DILocation(line: 305, column: 5, scope: !733)
!881 = !DILocation(line: 305, column: 8, scope: !733)
!882 = !DILocation(line: 305, column: 23, scope: !733)
!883 = !DILocation(line: 308, column: 27, scope: !884)
!884 = distinct !DILexicalBlock(scope: !733, file: !586, line: 307, column: 9)
!885 = !DILocation(line: 308, column: 9, scope: !884)
!886 = !DILocation(line: 310, column: 5, scope: !733)
!887 = !DILocation(line: 311, column: 1, scope: !733)
!888 = distinct !DISubprogram(name: "uninit", scope: !586, file: !586, line: 313, type: !419, isLocal: true, isDefinition: true, scopeLine: 314, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !611)
!889 = !DILocalVariable(name: "ctx", arg: 1, scope: !888, file: !586, line: 313, type: !173)
!890 = !DILocation(line: 313, column: 59, scope: !888)
!891 = !DILocalVariable(name: "n", scope: !888, file: !586, line: 315, type: !737)
!892 = !DILocation(line: 315, column: 19, scope: !888)
!893 = !DILocation(line: 315, column: 23, scope: !888)
!894 = !DILocation(line: 315, column: 28, scope: !888)
!895 = !DILocalVariable(name: "i", scope: !888, file: !586, line: 316, type: !200)
!896 = !DILocation(line: 316, column: 9, scope: !888)
!897 = !DILocation(line: 318, column: 12, scope: !898)
!898 = distinct !DILexicalBlock(scope: !888, file: !586, line: 318, column: 5)
!899 = !DILocation(line: 318, column: 10, scope: !898)
!900 = !DILocation(line: 318, column: 17, scope: !901)
!901 = !DILexicalBlockFile(scope: !902, file: !586, discriminator: 1)
!902 = distinct !DILexicalBlock(scope: !898, file: !586, line: 318, column: 5)
!903 = !DILocation(line: 318, column: 19, scope: !901)
!904 = !DILocation(line: 318, column: 5, scope: !901)
!905 = !DILocation(line: 319, column: 28, scope: !902)
!906 = !DILocation(line: 319, column: 19, scope: !902)
!907 = !DILocation(line: 319, column: 22, scope: !902)
!908 = !DILocation(line: 319, column: 31, scope: !902)
!909 = !DILocation(line: 319, column: 18, scope: !902)
!910 = !DILocation(line: 319, column: 9, scope: !902)
!911 = !DILocation(line: 318, column: 25, scope: !912)
!912 = !DILexicalBlockFile(scope: !902, file: !586, discriminator: 2)
!913 = !DILocation(line: 318, column: 5, scope: !912)
!914 = distinct !{!914, !915}
!915 = !DILocation(line: 318, column: 5, scope: !888)
!916 = !DILocation(line: 320, column: 1, scope: !888)
!917 = distinct !DISubprogram(name: "query_formats", scope: !586, file: !586, line: 133, type: !409, isLocal: true, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !611)
!918 = !DILocalVariable(name: "ctx", arg: 1, scope: !917, file: !586, line: 133, type: !173)
!919 = !DILocation(line: 133, column: 43, scope: !917)
!920 = !DILocalVariable(name: "formats", scope: !917, file: !586, line: 135, type: !524)
!921 = !DILocation(line: 135, column: 22, scope: !917)
!922 = !DILocalVariable(name: "fmt", scope: !917, file: !586, line: 136, type: !200)
!923 = !DILocation(line: 136, column: 9, scope: !917)
!924 = !DILocalVariable(name: "ret", scope: !917, file: !586, line: 136, type: !200)
!925 = !DILocation(line: 136, column: 14, scope: !917)
!926 = !DILocation(line: 138, column: 14, scope: !927)
!927 = distinct !DILexicalBlock(scope: !917, file: !586, line: 138, column: 5)
!928 = !DILocation(line: 138, column: 10, scope: !927)
!929 = !DILocation(line: 138, column: 39, scope: !930)
!930 = !DILexicalBlockFile(scope: !931, file: !586, discriminator: 1)
!931 = distinct !DILexicalBlock(scope: !927, file: !586, line: 138, column: 5)
!932 = !DILocation(line: 138, column: 19, scope: !930)
!933 = !DILocation(line: 138, column: 5, scope: !930)
!934 = !DILocalVariable(name: "desc", scope: !935, file: !586, line: 139, type: !936)
!935 = distinct !DILexicalBlock(scope: !931, file: !586, line: 138, column: 52)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPixFmtDescriptor", file: !939, line: 123, baseType: !940)
!939 = !DIFile(filename: "./libavutil/pixdesc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPixFmtDescriptor", file: !939, line: 81, size: 1280, align: 64, elements: !941)
!941 = !{!942, !943, !944, !945, !946, !947, !960}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !940, file: !939, line: 82, baseType: !184, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !940, file: !939, line: 83, baseType: !292, size: 8, align: 8, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_w", scope: !940, file: !939, line: 92, baseType: !292, size: 8, align: 8, offset: 72)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_h", scope: !940, file: !939, line: 101, baseType: !292, size: 8, align: 8, offset: 80)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !940, file: !939, line: 106, baseType: !316, size: 64, align: 64, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !940, file: !939, line: 117, baseType: !948, size: 1024, align: 32, offset: 192)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 1024, align: 32, elements: !601)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVComponentDescriptor", file: !939, line: 70, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVComponentDescriptor", file: !939, line: 31, size: 256, align: 32, elements: !951)
!951 = !{!952, !953, !954, !955, !956, !957, !958, !959}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !950, file: !939, line: 35, baseType: !200, size: 32, align: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !950, file: !939, line: 41, baseType: !200, size: 32, align: 32, offset: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !950, file: !939, line: 47, baseType: !200, size: 32, align: 32, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !950, file: !939, line: 53, baseType: !200, size: 32, align: 32, offset: 96)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !950, file: !939, line: 58, baseType: !200, size: 32, align: 32, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "step_minus1", scope: !950, file: !939, line: 62, baseType: !200, size: 32, align: 32, offset: 160)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "depth_minus1", scope: !950, file: !939, line: 65, baseType: !200, size: 32, align: 32, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "offset_plus1", scope: !950, file: !939, line: 68, baseType: !200, size: 32, align: 32, offset: 224)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !940, file: !939, line: 122, baseType: !184, size: 64, align: 64, offset: 1216)
!961 = !DILocation(line: 139, column: 35, scope: !935)
!962 = !DILocation(line: 139, column: 62, scope: !935)
!963 = !DILocation(line: 139, column: 42, scope: !935)
!964 = !DILocation(line: 140, column: 13, scope: !965)
!965 = distinct !DILexicalBlock(scope: !935, file: !586, line: 140, column: 13)
!966 = !DILocation(line: 140, column: 19, scope: !965)
!967 = !DILocation(line: 140, column: 25, scope: !965)
!968 = !DILocation(line: 140, column: 36, scope: !965)
!969 = !DILocation(line: 140, column: 41, scope: !970)
!970 = !DILexicalBlockFile(scope: !965, file: !586, discriminator: 1)
!971 = !DILocation(line: 140, column: 47, scope: !970)
!972 = !DILocation(line: 140, column: 55, scope: !970)
!973 = !DILocation(line: 140, column: 61, scope: !970)
!974 = !DILocation(line: 141, column: 13, scope: !965)
!975 = !DILocation(line: 141, column: 47, scope: !970)
!976 = !DILocation(line: 141, column: 23, scope: !970)
!977 = !DILocation(line: 141, column: 21, scope: !970)
!978 = !DILocation(line: 141, column: 53, scope: !970)
!979 = !DILocation(line: 140, column: 13, scope: !980)
!980 = !DILexicalBlockFile(scope: !935, file: !586, discriminator: 2)
!981 = !DILocation(line: 142, column: 24, scope: !965)
!982 = !DILocation(line: 142, column: 17, scope: !965)
!983 = !DILocation(line: 143, column: 5, scope: !935)
!984 = !DILocation(line: 138, column: 48, scope: !985)
!985 = !DILexicalBlockFile(scope: !931, file: !586, discriminator: 2)
!986 = !DILocation(line: 138, column: 5, scope: !985)
!987 = distinct !{!987, !988}
!988 = !DILocation(line: 138, column: 5, scope: !917)
!989 = !DILocation(line: 145, column: 34, scope: !917)
!990 = !DILocation(line: 145, column: 39, scope: !917)
!991 = !DILocation(line: 145, column: 12, scope: !917)
!992 = !DILocation(line: 145, column: 5, scope: !917)
!993 = !DILocation(line: 146, column: 1, scope: !917)
!994 = distinct !DISubprogram(name: "filter_frame", scope: !586, file: !586, line: 242, type: !394, isLocal: true, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !611)
!995 = !DILocalVariable(name: "inlink", arg: 1, scope: !994, file: !586, line: 242, type: !386)
!996 = !DILocation(line: 242, column: 39, scope: !994)
!997 = !DILocalVariable(name: "inpicref", arg: 2, scope: !994, file: !586, line: 242, type: !285)
!998 = !DILocation(line: 242, column: 56, scope: !994)
!999 = !DILocalVariable(name: "ctx", scope: !994, file: !586, line: 244, type: !173)
!1000 = !DILocation(line: 244, column: 22, scope: !994)
!1001 = !DILocation(line: 244, column: 28, scope: !994)
!1002 = !DILocation(line: 244, column: 36, scope: !994)
!1003 = !DILocalVariable(name: "outlink", scope: !994, file: !586, line: 245, type: !386)
!1004 = !DILocation(line: 245, column: 19, scope: !994)
!1005 = !DILocation(line: 245, column: 29, scope: !994)
!1006 = !DILocation(line: 245, column: 34, scope: !994)
!1007 = !DILocalVariable(name: "n", scope: !994, file: !586, line: 246, type: !737)
!1008 = !DILocation(line: 246, column: 19, scope: !994)
!1009 = !DILocation(line: 246, column: 23, scope: !994)
!1010 = !DILocation(line: 246, column: 28, scope: !994)
!1011 = !DILocalVariable(name: "td", scope: !994, file: !586, line: 247, type: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadData", file: !586, line: 40, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadData", file: !586, line: 38, size: 128, align: 64, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !1013, file: !586, line: 39, baseType: !285, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !1013, file: !586, line: 39, baseType: !285, size: 64, align: 64, offset: 64)
!1017 = !DILocation(line: 247, column: 16, scope: !994)
!1018 = !DILocalVariable(name: "out", scope: !994, file: !586, line: 248, type: !285)
!1019 = !DILocation(line: 248, column: 14, scope: !994)
!1020 = !DILocalVariable(name: "comp", scope: !994, file: !586, line: 249, type: !200)
!1021 = !DILocation(line: 249, column: 9, scope: !994)
!1022 = !DILocalVariable(name: "i", scope: !994, file: !586, line: 249, type: !200)
!1023 = !DILocation(line: 249, column: 15, scope: !994)
!1024 = !DILocation(line: 251, column: 30, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !994, file: !586, line: 251, column: 9)
!1026 = !DILocation(line: 251, column: 9, scope: !1025)
!1027 = !DILocation(line: 251, column: 9, scope: !994)
!1028 = !DILocation(line: 252, column: 15, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1025, file: !586, line: 251, column: 41)
!1030 = !DILocation(line: 252, column: 13, scope: !1029)
!1031 = !DILocation(line: 253, column: 5, scope: !1029)
!1032 = !DILocation(line: 254, column: 35, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1025, file: !586, line: 253, column: 12)
!1034 = !DILocation(line: 254, column: 44, scope: !1033)
!1035 = !DILocation(line: 254, column: 53, scope: !1033)
!1036 = !DILocation(line: 254, column: 56, scope: !1033)
!1037 = !DILocation(line: 254, column: 65, scope: !1033)
!1038 = !DILocation(line: 254, column: 15, scope: !1033)
!1039 = !DILocation(line: 254, column: 13, scope: !1033)
!1040 = !DILocation(line: 255, column: 14, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1033, file: !586, line: 255, column: 13)
!1042 = !DILocation(line: 255, column: 13, scope: !1033)
!1043 = !DILocation(line: 256, column: 13, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1041, file: !586, line: 255, column: 19)
!1045 = !DILocation(line: 257, column: 13, scope: !1044)
!1046 = !DILocation(line: 259, column: 29, scope: !1033)
!1047 = !DILocation(line: 259, column: 34, scope: !1033)
!1048 = !DILocation(line: 259, column: 9, scope: !1033)
!1049 = !DILocation(line: 262, column: 15, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !994, file: !586, line: 262, column: 5)
!1051 = !DILocation(line: 262, column: 10, scope: !1050)
!1052 = !DILocation(line: 262, column: 20, scope: !1053)
!1053 = !DILexicalBlockFile(scope: !1054, file: !586, discriminator: 1)
!1054 = distinct !DILexicalBlock(scope: !1050, file: !586, line: 262, column: 5)
!1055 = !DILocation(line: 262, column: 25, scope: !1053)
!1056 = !DILocation(line: 262, column: 5, scope: !1053)
!1057 = !DILocalVariable(name: "fp", scope: !1058, file: !586, line: 263, type: !1059)
!1058 = distinct !DILexicalBlock(scope: !1054, file: !586, line: 262, column: 38)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64, align: 64)
!1060 = !DILocation(line: 263, column: 23, scope: !1058)
!1061 = !DILocation(line: 263, column: 38, scope: !1058)
!1062 = !DILocation(line: 263, column: 29, scope: !1058)
!1063 = !DILocation(line: 263, column: 32, scope: !1058)
!1064 = !DILocation(line: 265, column: 15, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1058, file: !586, line: 265, column: 13)
!1066 = !DILocation(line: 265, column: 19, scope: !1065)
!1067 = !DILocation(line: 265, column: 35, scope: !1065)
!1068 = !DILocation(line: 265, column: 39, scope: !1069)
!1069 = !DILexicalBlockFile(scope: !1065, file: !586, discriminator: 1)
!1070 = !DILocation(line: 265, column: 43, scope: !1069)
!1071 = !DILocation(line: 265, column: 49, scope: !1069)
!1072 = !DILocation(line: 265, column: 55, scope: !1069)
!1073 = !DILocation(line: 265, column: 58, scope: !1074)
!1074 = !DILexicalBlockFile(scope: !1065, file: !586, discriminator: 2)
!1075 = !DILocation(line: 265, column: 62, scope: !1074)
!1076 = !DILocation(line: 265, column: 13, scope: !1074)
!1077 = !DILocation(line: 267, column: 20, scope: !1078)
