; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--colorspace.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--colorspace.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PrimaryCoefficients = type { double, double, double, double, double, double }
%struct.WhitepointCoefficients = type { double, double }
%struct.AVFrame = type { [8 x i8*], [8 x i32], i8**, i32, i32, i32, i32, i32, i32, %struct.AVRational, i64, i64, i64, i32, i32, i32, i8*, [8 x i64], i32, i32, i32, i32, i64, i32, i64, [8 x %struct.AVBufferRef*], %struct.AVBufferRef**, i32, %struct.AVFrameSideData**, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, %struct.AVDictionary*, i32, i32, i32, i8*, i32, i32, %struct.AVBufferRef*, %struct.AVBufferRef*, %struct.AVBufferRef*, i64, i64, i64, i64, %struct.AVBufferRef* }
%struct.AVRational = type { i32, i32 }
%struct.AVFrameSideData = type { i32, i8*, i32, %struct.AVDictionary*, %struct.AVBufferRef* }
%struct.AVDictionary = type opaque
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque
%struct.AVContentLightMetadata = type { i32, i32 }
%struct.AVMasteringDisplayMetadata = type { [3 x [2 x %struct.AVRational]], [2 x %struct.AVRational], %struct.AVRational, %struct.AVRational, i32, i32 }

; Function Attrs: nounwind uwtable

!37 = !DIEnumerator(name: "AV_FRAME_DATA_REGIONS_OF_INTEREST", value: 20)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorRange", file: !39, line: 516, size: 32, align: 32, elements: !40)
!39 = !DIFile(filename: "./libavutil/pixfmt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!40 = !{!41, !42, !43, !44}
!41 = !DIEnumerator(name: "AVCOL_RANGE_UNSPECIFIED", value: 0)
!42 = !DIEnumerator(name: "AVCOL_RANGE_MPEG", value: 1)
!43 = !DIEnumerator(name: "AVCOL_RANGE_JPEG", value: 2)
!44 = !DIEnumerator(name: "AVCOL_RANGE_NB", value: 3)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorPrimaries", file: !39, line: 440, size: 32, align: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62}
!47 = !DIEnumerator(name: "AVCOL_PRI_RESERVED0", value: 0)
!48 = !DIEnumerator(name: "AVCOL_PRI_BT709", value: 1)
!49 = !DIEnumerator(name: "AVCOL_PRI_UNSPECIFIED", value: 2)
!50 = !DIEnumerator(name: "AVCOL_PRI_RESERVED", value: 3)
!51 = !DIEnumerator(name: "AVCOL_PRI_BT470M", value: 4)
!52 = !DIEnumerator(name: "AVCOL_PRI_BT470BG", value: 5)
!53 = !DIEnumerator(name: "AVCOL_PRI_SMPTE170M", value: 6)
!54 = !DIEnumerator(name: "AVCOL_PRI_SMPTE240M", value: 7)
!55 = !DIEnumerator(name: "AVCOL_PRI_FILM", value: 8)
!56 = !DIEnumerator(name: "AVCOL_PRI_BT2020", value: 9)
!57 = !DIEnumerator(name: "AVCOL_PRI_SMPTE428", value: 10)
!58 = !DIEnumerator(name: "AVCOL_PRI_SMPTEST428_1", value: 10)
!59 = !DIEnumerator(name: "AVCOL_PRI_SMPTE431", value: 11)
!60 = !DIEnumerator(name: "AVCOL_PRI_SMPTE432", value: 12)
!61 = !DIEnumerator(name: "AVCOL_PRI_JEDEC_P22", value: 22)
!62 = !DIEnumerator(name: "AVCOL_PRI_NB", value: 23)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorTransferCharacteristic", file: !39, line: 464, size: 32, align: 32, elements: !64)
!64 = !{!65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86}
!65 = !DIEnumerator(name: "AVCOL_TRC_RESERVED0", value: 0)
!66 = !DIEnumerator(name: "AVCOL_TRC_BT709", value: 1)
!67 = !DIEnumerator(name: "AVCOL_TRC_UNSPECIFIED", value: 2)
!68 = !DIEnumerator(name: "AVCOL_TRC_RESERVED", value: 3)
!69 = !DIEnumerator(name: "AVCOL_TRC_GAMMA22", value: 4)
!70 = !DIEnumerator(name: "AVCOL_TRC_GAMMA28", value: 5)
!71 = !DIEnumerator(name: "AVCOL_TRC_SMPTE170M", value: 6)
!72 = !DIEnumerator(name: "AVCOL_TRC_SMPTE240M", value: 7)
!73 = !DIEnumerator(name: "AVCOL_TRC_LINEAR", value: 8)
!74 = !DIEnumerator(name: "AVCOL_TRC_LOG", value: 9)
!75 = !DIEnumerator(name: "AVCOL_TRC_LOG_SQRT", value: 10)
!76 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_4", value: 11)
!77 = !DIEnumerator(name: "AVCOL_TRC_BT1361_ECG", value: 12)
!78 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_1", value: 13)
!79 = !DIEnumerator(name: "AVCOL_TRC_BT2020_10", value: 14)
!80 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!81 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!82 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!83 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!84 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!85 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!86 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !39, line: 493, size: 32, align: 32, elements: !88)
!88 = !{!89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105}
!89 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!90 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!91 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!92 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!93 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!94 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!95 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!96 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!97 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!98 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!99 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!100 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!101 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!102 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!103 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!104 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!105 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !39, line: 538, size: 32, align: 32, elements: !107)
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115}
!108 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!109 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!110 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!111 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!112 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!113 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!114 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!115 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!116 = !{!117, !125, !123, !148}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVContentLightMetadata", file: !119, line: 108, baseType: !120)
!119 = !DIFile(filename: "./libavutil/mastering_display_metadata.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVContentLightMetadata", file: !119, line: 98, size: 64, align: 32, elements: !121)
!121 = !{!122, !124}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "MaxCLL", scope: !120, file: !119, line: 102, baseType: !123, size: 32, align: 32)
!123 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "MaxFALL", scope: !120, file: !119, line: 107, baseType: !123, size: 32, align: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVMasteringDisplayMetadata", file: !119, line: 69, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVMasteringDisplayMetadata", file: !119, line: 38, size: 704, align: 32, elements: !128)
!128 = !{!129, !141, !144, !145, !146, !147}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "display_primaries", scope: !127, file: !119, line: 42, baseType: !130, size: 384, align: 32)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 384, align: 32, elements: !138)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !132, line: 61, baseType: !133)
!132 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !132, line: 58, size: 64, align: 32, elements: !134)
!134 = !{!135, !137}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !133, file: !132, line: 59, baseType: !136, size: 32, align: 32)
!136 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !133, file: !132, line: 60, baseType: !136, size: 32, align: 32, offset: 32)
!138 = !{!139, !140}
!139 = !DISubrange(count: 3)
!140 = !DISubrange(count: 2)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !127, file: !119, line: 47, baseType: !142, size: 128, align: 32, offset: 384)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 128, align: 32, elements: !143)
!143 = !{!140}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "min_luminance", scope: !127, file: !119, line: 52, baseType: !131, size: 64, align: 32, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "max_luminance", scope: !127, file: !119, line: 57, baseType: !131, size: 64, align: 32, offset: 576)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "has_primaries", scope: !127, file: !119, line: 62, baseType: !136, size: 32, align: 32, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "has_luminance", scope: !127, file: !119, line: 67, baseType: !136, size: 32, align: 32, offset: 672)
!148 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!149 = !{i32 2, !"Dwarf Version", i32 4}
!150 = !{i32 2, !"Debug Info Version", i32 3}
!151 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!152 = distinct !DISubprogram(name: "ff_matrix_invert_3x3", scope: !153, file: !153, line: 27, type: !154, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !162)
!153 = !DIFile(filename: "libavfilter/colorspace.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!154 = !DISubroutineType(types: !155)
!155 = !{null, !156, !160}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 192, align: 64, elements: !159)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!159 = !{!139}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 192, align: 64, elements: !159)
!162 = !{}
!163 = !DILocalVariable(name: "in", arg: 1, scope: !152, file: !153, line: 27, type: !156)
!164 = !DIExpression()
!165 = !DILocation(line: 27, column: 40, scope: !152)
!166 = !DILocalVariable(name: "out", arg: 2, scope: !152, file: !153, line: 27, type: !160)
!167 = !DILocation(line: 27, column: 57, scope: !152)
!168 = !DILocalVariable(name: "m00", scope: !152, file: !153, line: 29, type: !148)
!169 = !DILocation(line: 29, column: 12, scope: !152)
!170 = !DILocation(line: 29, column: 18, scope: !152)
!171 = !DILocalVariable(name: "m01", scope: !152, file: !153, line: 29, type: !148)
!172 = !DILocation(line: 29, column: 28, scope: !152)
!173 = !DILocation(line: 29, column: 34, scope: !152)
!174 = !DILocalVariable(name: "m02", scope: !152, file: !153, line: 29, type: !148)
!175 = !DILocation(line: 29, column: 44, scope: !152)
!176 = !DILocation(line: 29, column: 50, scope: !152)
!177 = !DILocalVariable(name: "m10", scope: !152, file: !153, line: 30, type: !148)
!178 = !DILocation(line: 30, column: 12, scope: !152)
!179 = !DILocation(line: 30, column: 18, scope: !152)
!180 = !DILocalVariable(name: "m11", scope: !152, file: !153, line: 30, type: !148)
!181 = !DILocation(line: 30, column: 28, scope: !152)
!182 = !DILocation(line: 30, column: 34, scope: !152)
!183 = !DILocalVariable(name: "m12", scope: !152, file: !153, line: 30, type: !148)
!184 = !DILocation(line: 30, column: 44, scope: !152)
!185 = !DILocation(line: 30, column: 50, scope: !152)
!186 = !DILocalVariable(name: "m20", scope: !152, file: !153, line: 31, type: !148)
!187 = !DILocation(line: 31, column: 12, scope: !152)
!188 = !DILocation(line: 31, column: 18, scope: !152)
!189 = !DILocalVariable(name: "m21", scope: !152, file: !153, line: 31, type: !148)
!190 = !DILocation(line: 31, column: 28, scope: !152)
!191 = !DILocation(line: 31, column: 34, scope: !152)
!192 = !DILocalVariable(name: "m22", scope: !152, file: !153, line: 31, type: !148)
!193 = !DILocation(line: 31, column: 44, scope: !152)
!194 = !DILocation(line: 31, column: 50, scope: !152)
!195 = !DILocalVariable(name: "i", scope: !152, file: !153, line: 32, type: !136)
!196 = !DILocation(line: 32, column: 9, scope: !152)
!197 = !DILocalVariable(name: "j", scope: !152, file: !153, line: 32, type: !136)
!198 = !DILocation(line: 32, column: 12, scope: !152)
!199 = !DILocalVariable(name: "det", scope: !152, file: !153, line: 33, type: !148)
!200 = !DILocation(line: 33, column: 12, scope: !152)
!201 = !DILocation(line: 35, column: 18, scope: !152)
!202 = !DILocation(line: 35, column: 24, scope: !152)
!203 = !DILocation(line: 35, column: 22, scope: !152)
!204 = !DILocation(line: 35, column: 30, scope: !152)
!205 = !DILocation(line: 35, column: 36, scope: !152)
!206 = !DILocation(line: 35, column: 34, scope: !152)
!207 = !DILocation(line: 35, column: 28, scope: !152)
!208 = !DILocation(line: 35, column: 5, scope: !152)
!209 = !DILocation(line: 35, column: 15, scope: !152)
!210 = !DILocation(line: 36, column: 19, scope: !152)
!211 = !DILocation(line: 36, column: 25, scope: !152)
!212 = !DILocation(line: 36, column: 23, scope: !152)
!213 = !DILocation(line: 36, column: 31, scope: !152)
!214 = !DILocation(line: 36, column: 37, scope: !152)
!215 = !DILocation(line: 36, column: 35, scope: !152)
!216 = !DILocation(line: 36, column: 29, scope: !152)
!217 = !DILocation(line: 36, column: 17, scope: !152)
!218 = !DILocation(line: 36, column: 5, scope: !152)
!219 = !DILocation(line: 36, column: 15, scope: !152)
!220 = !DILocation(line: 37, column: 18, scope: !152)
!221 = !DILocation(line: 37, column: 24, scope: !152)
!222 = !DILocation(line: 37, column: 22, scope: !152)
!223 = !DILocation(line: 37, column: 30, scope: !152)
!224 = !DILocation(line: 37, column: 36, scope: !152)
!225 = !DILocation(line: 37, column: 34, scope: !152)
!226 = !DILocation(line: 37, column: 28, scope: !152)
!227 = !DILocation(line: 37, column: 5, scope: !152)
!228 = !DILocation(line: 37, column: 15, scope: !152)
!229 = !DILocation(line: 38, column: 19, scope: !152)
!230 = !DILocation(line: 38, column: 25, scope: !152)
!231 = !DILocation(line: 38, column: 23, scope: !152)
!232 = !DILocation(line: 38, column: 31, scope: !152)
!233 = !DILocation(line: 38, column: 37, scope: !152)
!234 = !DILocation(line: 38, column: 35, scope: !152)
!235 = !DILocation(line: 38, column: 29, scope: !152)
!236 = !DILocation(line: 38, column: 17, scope: !152)
!237 = !DILocation(line: 38, column: 5, scope: !152)
!238 = !DILocation(line: 38, column: 15, scope: !152)
!239 = !DILocation(line: 39, column: 18, scope: !152)
!240 = !DILocation(line: 39, column: 24, scope: !152)
!241 = !DILocation(line: 39, column: 22, scope: !152)
!242 = !DILocation(line: 39, column: 30, scope: !152)
!243 = !DILocation(line: 39, column: 36, scope: !152)
!244 = !DILocation(line: 39, column: 34, scope: !152)
!245 = !DILocation(line: 39, column: 28, scope: !152)
!246 = !DILocation(line: 39, column: 5, scope: !152)
!247 = !DILocation(line: 39, column: 15, scope: !152)
!248 = !DILocation(line: 40, column: 19, scope: !152)
!249 = !DILocation(line: 40, column: 25, scope: !152)
!250 = !DILocation(line: 40, column: 23, scope: !152)
!251 = !DILocation(line: 40, column: 31, scope: !152)
!252 = !DILocation(line: 40, column: 37, scope: !152)
!253 = !DILocation(line: 40, column: 35, scope: !152)
!254 = !DILocation(line: 40, column: 29, scope: !152)
!255 = !DILocation(line: 40, column: 17, scope: !152)
!256 = !DILocation(line: 40, column: 5, scope: !152)
!257 = !DILocation(line: 40, column: 15, scope: !152)
!258 = !DILocation(line: 41, column: 18, scope: !152)
!259 = !DILocation(line: 41, column: 24, scope: !152)
!260 = !DILocation(line: 41, column: 22, scope: !152)
!261 = !DILocation(line: 41, column: 30, scope: !152)
!262 = !DILocation(line: 41, column: 36, scope: !152)
!263 = !DILocation(line: 41, column: 34, scope: !152)
!264 = !DILocation(line: 41, column: 28, scope: !152)
!265 = !DILocation(line: 41, column: 5, scope: !152)
!266 = !DILocation(line: 41, column: 15, scope: !152)
!267 = !DILocation(line: 42, column: 19, scope: !152)
!268 = !DILocation(line: 42, column: 25, scope: !152)
!269 = !DILocation(line: 42, column: 23, scope: !152)
!270 = !DILocation(line: 42, column: 31, scope: !152)
!271 = !DILocation(line: 42, column: 37, scope: !152)
!272 = !DILocation(line: 42, column: 35, scope: !152)
!273 = !DILocation(line: 42, column: 29, scope: !152)
!274 = !DILocation(line: 42, column: 17, scope: !152)
!275 = !DILocation(line: 42, column: 5, scope: !152)
!276 = !DILocation(line: 42, column: 15, scope: !152)
!277 = !DILocation(line: 43, column: 18, scope: !152)
!278 = !DILocation(line: 43, column: 24, scope: !152)
!279 = !DILocation(line: 43, column: 22, scope: !152)
!280 = !DILocation(line: 43, column: 30, scope: !152)
!281 = !DILocation(line: 43, column: 36, scope: !152)
!282 = !DILocation(line: 43, column: 34, scope: !152)
!283 = !DILocation(line: 43, column: 28, scope: !152)
!284 = !DILocation(line: 43, column: 5, scope: !152)
!285 = !DILocation(line: 43, column: 15, scope: !152)
!286 = !DILocation(line: 45, column: 11, scope: !152)
!287 = !DILocation(line: 45, column: 17, scope: !152)
!288 = !DILocation(line: 45, column: 15, scope: !152)
!289 = !DILocation(line: 45, column: 29, scope: !152)
!290 = !DILocation(line: 45, column: 35, scope: !152)
!291 = !DILocation(line: 45, column: 33, scope: !152)
!292 = !DILocation(line: 45, column: 27, scope: !152)
!293 = !DILocation(line: 45, column: 47, scope: !152)
!294 = !DILocation(line: 45, column: 53, scope: !152)
!295 = !DILocation(line: 45, column: 51, scope: !152)
!296 = !DILocation(line: 45, column: 45, scope: !152)
!297 = !DILocation(line: 45, column: 9, scope: !152)
!298 = !DILocation(line: 46, column: 17, scope: !152)
!299 = !DILocation(line: 46, column: 15, scope: !152)
!300 = !DILocation(line: 46, column: 9, scope: !152)
!301 = !DILocation(line: 48, column: 12, scope: !302)
!302 = distinct !DILexicalBlock(scope: !152, file: !153, line: 48, column: 5)
!303 = !DILocation(line: 48, column: 10, scope: !302)
!304 = !DILocation(line: 48, column: 17, scope: !305)
!305 = !DILexicalBlockFile(scope: !306, file: !153, discriminator: 1)
!306 = distinct !DILexicalBlock(scope: !302, file: !153, line: 48, column: 5)
!307 = !DILocation(line: 48, column: 19, scope: !305)
!308 = !DILocation(line: 48, column: 5, scope: !305)
!309 = !DILocation(line: 49, column: 16, scope: !310)
!310 = distinct !DILexicalBlock(scope: !311, file: !153, line: 49, column: 9)
!311 = distinct !DILexicalBlock(scope: !306, file: !153, line: 48, column: 29)
!312 = !DILocation(line: 49, column: 14, scope: !310)
!313 = !DILocation(line: 49, column: 21, scope: !314)
!314 = !DILexicalBlockFile(scope: !315, file: !153, discriminator: 1)
!315 = distinct !DILexicalBlock(scope: !310, file: !153, line: 49, column: 9)
!316 = !DILocation(line: 49, column: 23, scope: !314)
!317 = !DILocation(line: 49, column: 9, scope: !314)
!318 = !DILocation(line: 50, column: 26, scope: !315)
!319 = !DILocation(line: 50, column: 20, scope: !315)
!320 = !DILocation(line: 50, column: 13, scope: !315)
!321 = !DILocation(line: 50, column: 17, scope: !315)
!322 = !DILocation(line: 50, column: 23, scope: !315)
!323 = !DILocation(line: 49, column: 29, scope: !324)
!324 = !DILexicalBlockFile(scope: !315, file: !153, discriminator: 2)
!325 = !DILocation(line: 49, column: 9, scope: !324)
!326 = distinct !{!326, !327}
!327 = !DILocation(line: 49, column: 9, scope: !311)
!328 = !DILocation(line: 51, column: 5, scope: !311)
!329 = !DILocation(line: 48, column: 25, scope: !330)
!330 = !DILexicalBlockFile(scope: !306, file: !153, discriminator: 2)
!331 = !DILocation(line: 48, column: 5, scope: !330)
!332 = distinct !{!332, !333}
!333 = !DILocation(line: 48, column: 5, scope: !152)
!334 = !DILocation(line: 52, column: 1, scope: !152)
!335 = distinct !DISubprogram(name: "ff_matrix_mul_3x3", scope: !153, file: !153, line: 54, type: !336, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !162)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !160, !156, !156}
!338 = !DILocalVariable(name: "dst", arg: 1, scope: !335, file: !153, line: 54, type: !160)
!339 = !DILocation(line: 54, column: 31, scope: !335)
!340 = !DILocalVariable(name: "src1", arg: 2, scope: !335, file: !153, line: 55, type: !156)
!341 = !DILocation(line: 55, column: 29, scope: !335)
!342 = !DILocalVariable(name: "src2", arg: 3, scope: !335, file: !153, line: 55, type: !156)
!343 = !DILocation(line: 55, column: 54, scope: !335)
!344 = !DILocalVariable(name: "m", scope: !335, file: !153, line: 57, type: !136)
!345 = !DILocation(line: 57, column: 9, scope: !335)
!346 = !DILocalVariable(name: "n", scope: !335, file: !153, line: 57, type: !136)
!347 = !DILocation(line: 57, column: 12, scope: !335)
!348 = !DILocation(line: 59, column: 12, scope: !349)
!349 = distinct !DILexicalBlock(scope: !335, file: !153, line: 59, column: 5)
!350 = !DILocation(line: 59, column: 10, scope: !349)
!351 = !DILocation(line: 59, column: 17, scope: !352)
!352 = !DILexicalBlockFile(scope: !353, file: !153, discriminator: 1)
!353 = distinct !DILexicalBlock(scope: !349, file: !153, line: 59, column: 5)
!354 = !DILocation(line: 59, column: 19, scope: !352)
!355 = !DILocation(line: 59, column: 5, scope: !352)
!356 = !DILocation(line: 60, column: 16, scope: !357)
!357 = distinct !DILexicalBlock(scope: !353, file: !153, line: 60, column: 9)
!358 = !DILocation(line: 60, column: 14, scope: !357)
!359 = !DILocation(line: 60, column: 21, scope: !360)
!360 = !DILexicalBlockFile(scope: !361, file: !153, discriminator: 1)
!361 = distinct !DILexicalBlock(scope: !357, file: !153, line: 60, column: 9)
!362 = !DILocation(line: 60, column: 23, scope: !360)
!363 = !DILocation(line: 60, column: 9, scope: !360)
!364 = !DILocation(line: 61, column: 30, scope: !361)
!365 = !DILocation(line: 61, column: 25, scope: !361)
!366 = !DILocation(line: 61, column: 46, scope: !361)
!367 = !DILocation(line: 61, column: 38, scope: !361)
!368 = !DILocation(line: 61, column: 36, scope: !361)
!369 = !DILocation(line: 62, column: 30, scope: !361)
!370 = !DILocation(line: 62, column: 25, scope: !361)
!371 = !DILocation(line: 62, column: 46, scope: !361)
!372 = !DILocation(line: 62, column: 38, scope: !361)
!373 = !DILocation(line: 62, column: 36, scope: !361)
!374 = !DILocation(line: 61, column: 49, scope: !361)
!375 = !DILocation(line: 63, column: 30, scope: !361)
!376 = !DILocation(line: 63, column: 25, scope: !361)
!377 = !DILocation(line: 63, column: 46, scope: !361)
!378 = !DILocation(line: 63, column: 38, scope: !361)
!379 = !DILocation(line: 63, column: 36, scope: !361)
!380 = !DILocation(line: 62, column: 49, scope: !361)
!381 = !DILocation(line: 61, column: 20, scope: !361)
!382 = !DILocation(line: 61, column: 13, scope: !361)
!383 = !DILocation(line: 61, column: 17, scope: !361)
!384 = !DILocation(line: 61, column: 23, scope: !361)
!385 = !DILocation(line: 60, column: 29, scope: !386)
!386 = !DILexicalBlockFile(scope: !361, file: !153, discriminator: 2)
!387 = !DILocation(line: 60, column: 9, scope: !386)
!388 = distinct !{!388, !389}
!389 = !DILocation(line: 60, column: 9, scope: !353)
!390 = !DILocation(line: 63, column: 47, scope: !391)
!391 = !DILexicalBlockFile(scope: !357, file: !153, discriminator: 1)
!392 = !DILocation(line: 59, column: 25, scope: !393)
!393 = !DILexicalBlockFile(scope: !353, file: !153, discriminator: 2)
!394 = !DILocation(line: 59, column: 5, scope: !393)
!395 = distinct !{!395, !396}
!396 = !DILocation(line: 59, column: 5, scope: !335)
!397 = !DILocation(line: 64, column: 1, scope: !335)
!398 = distinct !DISubprogram(name: "ff_fill_rgb2xyz_table", scope: !153, file: !153, line: 68, type: !399, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !162)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !401, !412, !160}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PrimaryCoefficients", file: !404, line: 32, size: 384, align: 64, elements: !405)
!404 = !DIFile(filename: "libavfilter/colorspace.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!405 = !{!406, !407, !408, !409, !410, !411}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "xr", scope: !403, file: !404, line: 33, baseType: !148, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "yr", scope: !403, file: !404, line: 33, baseType: !148, size: 64, align: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "xg", scope: !403, file: !404, line: 33, baseType: !148, size: 64, align: 64, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "yg", scope: !403, file: !404, line: 33, baseType: !148, size: 64, align: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "xb", scope: !403, file: !404, line: 33, baseType: !148, size: 64, align: 64, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "yb", scope: !403, file: !404, line: 33, baseType: !148, size: 64, align: 64, offset: 320)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WhitepointCoefficients", file: !404, line: 36, size: 128, align: 64, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "xw", scope: !414, file: !404, line: 37, baseType: !148, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "yw", scope: !414, file: !404, line: 37, baseType: !148, size: 64, align: 64, offset: 64)
!418 = !DILocalVariable(name: "coeffs", arg: 1, scope: !398, file: !153, line: 68, type: !401)
!419 = !DILocation(line: 68, column: 62, scope: !398)
!420 = !DILocalVariable(name: "wp", arg: 2, scope: !398, file: !153, line: 69, type: !412)
!421 = !DILocation(line: 69, column: 65, scope: !398)
!422 = !DILocalVariable(name: "rgb2xyz", arg: 3, scope: !398, file: !153, line: 70, type: !160)
!423 = !DILocation(line: 70, column: 35, scope: !398)
!424 = !DILocalVariable(name: "i", scope: !398, file: !153, line: 72, type: !425)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 576, align: 64, elements: !426)
!426 = !{!139, !139}
!427 = !DILocation(line: 72, column: 12, scope: !398)
!428 = !DILocalVariable(name: "sr", scope: !398, file: !153, line: 72, type: !148)
!429 = !DILocation(line: 72, column: 21, scope: !398)
!430 = !DILocalVariable(name: "sg", scope: !398, file: !153, line: 72, type: !148)
!431 = !DILocation(line: 72, column: 25, scope: !398)
!432 = !DILocalVariable(name: "sb", scope: !398, file: !153, line: 72, type: !148)
!433 = !DILocation(line: 72, column: 29, scope: !398)
!434 = !DILocalVariable(name: "zw", scope: !398, file: !153, line: 72, type: !148)
!435 = !DILocation(line: 72, column: 33, scope: !398)
!436 = !DILocation(line: 74, column: 21, scope: !398)
!437 = !DILocation(line: 74, column: 29, scope: !398)
!438 = !DILocation(line: 74, column: 34, scope: !398)
!439 = !DILocation(line: 74, column: 42, scope: !398)
!440 = !DILocation(line: 74, column: 32, scope: !398)
!441 = !DILocation(line: 74, column: 5, scope: !398)
!442 = !DILocation(line: 74, column: 19, scope: !398)
!443 = !DILocation(line: 75, column: 21, scope: !398)
!444 = !DILocation(line: 75, column: 29, scope: !398)
!445 = !DILocation(line: 75, column: 34, scope: !398)
!446 = !DILocation(line: 75, column: 42, scope: !398)
!447 = !DILocation(line: 75, column: 32, scope: !398)
!448 = !DILocation(line: 75, column: 5, scope: !398)
!449 = !DILocation(line: 75, column: 19, scope: !398)
!450 = !DILocation(line: 76, column: 21, scope: !398)
!451 = !DILocation(line: 76, column: 29, scope: !398)
!452 = !DILocation(line: 76, column: 34, scope: !398)
!453 = !DILocation(line: 76, column: 42, scope: !398)
!454 = !DILocation(line: 76, column: 32, scope: !398)
!455 = !DILocation(line: 76, column: 5, scope: !398)
!456 = !DILocation(line: 76, column: 19, scope: !398)
!457 = !DILocation(line: 77, column: 37, scope: !398)
!458 = !DILocation(line: 77, column: 51, scope: !398)
!459 = !DILocation(line: 77, column: 21, scope: !398)
!460 = !DILocation(line: 77, column: 35, scope: !398)
!461 = !DILocation(line: 77, column: 5, scope: !398)
!462 = !DILocation(line: 77, column: 19, scope: !398)
!463 = !DILocation(line: 78, column: 28, scope: !398)
!464 = !DILocation(line: 78, column: 36, scope: !398)
!465 = !DILocation(line: 78, column: 26, scope: !398)
!466 = !DILocation(line: 78, column: 41, scope: !398)
!467 = !DILocation(line: 78, column: 49, scope: !398)
!468 = !DILocation(line: 78, column: 39, scope: !398)
!469 = !DILocation(line: 78, column: 55, scope: !398)
!470 = !DILocation(line: 78, column: 63, scope: !398)
!471 = !DILocation(line: 78, column: 53, scope: !398)
!472 = !DILocation(line: 78, column: 5, scope: !398)
!473 = !DILocation(line: 78, column: 19, scope: !398)
!474 = !DILocation(line: 79, column: 28, scope: !398)
!475 = !DILocation(line: 79, column: 36, scope: !398)
!476 = !DILocation(line: 79, column: 26, scope: !398)
!477 = !DILocation(line: 79, column: 41, scope: !398)
!478 = !DILocation(line: 79, column: 49, scope: !398)
!479 = !DILocation(line: 79, column: 39, scope: !398)
!480 = !DILocation(line: 79, column: 55, scope: !398)
!481 = !DILocation(line: 79, column: 63, scope: !398)
!482 = !DILocation(line: 79, column: 53, scope: !398)
!483 = !DILocation(line: 79, column: 5, scope: !398)
!484 = !DILocation(line: 79, column: 19, scope: !398)
!485 = !DILocation(line: 80, column: 28, scope: !398)
!486 = !DILocation(line: 80, column: 36, scope: !398)
!487 = !DILocation(line: 80, column: 26, scope: !398)
!488 = !DILocation(line: 80, column: 41, scope: !398)
!489 = !DILocation(line: 80, column: 49, scope: !398)
!490 = !DILocation(line: 80, column: 39, scope: !398)
!491 = !DILocation(line: 80, column: 55, scope: !398)
!492 = !DILocation(line: 80, column: 63, scope: !398)
!493 = !DILocation(line: 80, column: 53, scope: !398)
!494 = !DILocation(line: 80, column: 5, scope: !398)
!495 = !DILocation(line: 80, column: 19, scope: !398)
!496 = !DILocation(line: 81, column: 26, scope: !398)
!497 = !DILocation(line: 81, column: 35, scope: !398)
!498 = !DILocation(line: 81, column: 5, scope: !398)
!499 = !DILocation(line: 82, column: 16, scope: !398)
!500 = !DILocation(line: 82, column: 20, scope: !398)
!501 = !DILocation(line: 82, column: 14, scope: !398)
!502 = !DILocation(line: 82, column: 25, scope: !398)
!503 = !DILocation(line: 82, column: 29, scope: !398)
!504 = !DILocation(line: 82, column: 23, scope: !398)
!505 = !DILocation(line: 82, column: 8, scope: !398)
!506 = !DILocation(line: 83, column: 10, scope: !398)
!507 = !DILocation(line: 83, column: 20, scope: !398)
!508 = !DILocation(line: 83, column: 24, scope: !398)
!509 = !DILocation(line: 83, column: 18, scope: !398)
!510 = !DILocation(line: 83, column: 29, scope: !398)
!511 = !DILocation(line: 83, column: 39, scope: !398)
!512 = !DILocation(line: 83, column: 43, scope: !398)
!513 = !DILocation(line: 83, column: 37, scope: !398)
!514 = !DILocation(line: 83, column: 27, scope: !398)
!515 = !DILocation(line: 83, column: 48, scope: !398)
!516 = !DILocation(line: 83, column: 58, scope: !398)
!517 = !DILocation(line: 83, column: 56, scope: !398)
!518 = !DILocation(line: 83, column: 46, scope: !398)
!519 = !DILocation(line: 83, column: 8, scope: !398)
!520 = !DILocation(line: 84, column: 10, scope: !398)
!521 = !DILocation(line: 84, column: 20, scope: !398)
!522 = !DILocation(line: 84, column: 24, scope: !398)
!523 = !DILocation(line: 84, column: 18, scope: !398)
!524 = !DILocation(line: 84, column: 29, scope: !398)
!525 = !DILocation(line: 84, column: 39, scope: !398)
!526 = !DILocation(line: 84, column: 43, scope: !398)
!527 = !DILocation(line: 84, column: 37, scope: !398)
!528 = !DILocation(line: 84, column: 27, scope: !398)
!529 = !DILocation(line: 84, column: 48, scope: !398)
!530 = !DILocation(line: 84, column: 58, scope: !398)
!531 = !DILocation(line: 84, column: 56, scope: !398)
!532 = !DILocation(line: 84, column: 46, scope: !398)
!533 = !DILocation(line: 84, column: 8, scope: !398)
!534 = !DILocation(line: 85, column: 10, scope: !398)
!535 = !DILocation(line: 85, column: 20, scope: !398)
!536 = !DILocation(line: 85, column: 24, scope: !398)
!537 = !DILocation(line: 85, column: 18, scope: !398)
!538 = !DILocation(line: 85, column: 29, scope: !398)
!539 = !DILocation(line: 85, column: 39, scope: !398)
!540 = !DILocation(line: 85, column: 43, scope: !398)
!541 = !DILocation(line: 85, column: 37, scope: !398)
!542 = !DILocation(line: 85, column: 27, scope: !398)
!543 = !DILocation(line: 85, column: 48, scope: !398)
!544 = !DILocation(line: 85, column: 58, scope: !398)
!545 = !DILocation(line: 85, column: 56, scope: !398)
!546 = !DILocation(line: 85, column: 46, scope: !398)
!547 = !DILocation(line: 85, column: 8, scope: !398)
!548 = !DILocation(line: 86, column: 22, scope: !398)
!549 = !DILocation(line: 86, column: 5, scope: !398)
!550 = !DILocation(line: 86, column: 19, scope: !398)
!551 = !DILocation(line: 87, column: 22, scope: !398)
!552 = !DILocation(line: 87, column: 5, scope: !398)
!553 = !DILocation(line: 87, column: 19, scope: !398)
!554 = !DILocation(line: 88, column: 22, scope: !398)
!555 = !DILocation(line: 88, column: 5, scope: !398)
!556 = !DILocation(line: 88, column: 19, scope: !398)
!557 = !DILocation(line: 89, column: 22, scope: !398)
!558 = !DILocation(line: 89, column: 5, scope: !398)
!559 = !DILocation(line: 89, column: 19, scope: !398)
!560 = !DILocation(line: 90, column: 22, scope: !398)
!561 = !DILocation(line: 90, column: 5, scope: !398)
!562 = !DILocation(line: 90, column: 19, scope: !398)
!563 = !DILocation(line: 91, column: 22, scope: !398)
!564 = !DILocation(line: 91, column: 5, scope: !398)
!565 = !DILocation(line: 91, column: 19, scope: !398)
!566 = !DILocation(line: 92, column: 22, scope: !398)
!567 = !DILocation(line: 92, column: 5, scope: !398)
!568 = !DILocation(line: 92, column: 19, scope: !398)
!569 = !DILocation(line: 93, column: 22, scope: !398)
!570 = !DILocation(line: 93, column: 5, scope: !398)
!571 = !DILocation(line: 93, column: 19, scope: !398)
!572 = !DILocation(line: 94, column: 22, scope: !398)
!573 = !DILocation(line: 94, column: 5, scope: !398)
!574 = !DILocation(line: 94, column: 19, scope: !398)
!575 = !DILocation(line: 95, column: 1, scope: !398)
!576 = distinct !DISubprogram(name: "ff_determine_signal_peak", scope: !153, file: !153, line: 97, type: !577, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !162)
!577 = !DISubroutineType(types: !578)
!578 = !{!148, !579}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !15, line: 646, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !15, line: 268, size: 4288, align: 64, elements: !582)
!582 = !{!583, !591, !593, !595, !596, !597, !598, !599, !600, !601, !602, !605, !606, !607, !608, !609, !610, !612, !616, !617, !618, !619, !620, !621, !622, !623, !636, !638, !639, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !672, !673, !674, !675, !676, !677, !680, !681, !682, !683}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !581, file: !15, line: 282, baseType: !584, size: 512, align: 64)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 512, align: 64, elements: !589)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !587, line: 48, baseType: !588)
!587 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!588 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!589 = !{!590}
!590 = !DISubrange(count: 8)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !581, file: !15, line: 299, baseType: !592, size: 256, align: 32, offset: 512)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 256, align: 32, elements: !589)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !581, file: !15, line: 315, baseType: !594, size: 64, align: 64, offset: 768)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !581, file: !15, line: 326, baseType: !136, size: 32, align: 32, offset: 832)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !581, file: !15, line: 326, baseType: !136, size: 32, align: 32, offset: 864)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !581, file: !15, line: 334, baseType: !136, size: 32, align: 32, offset: 896)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !581, file: !15, line: 341, baseType: !136, size: 32, align: 32, offset: 928)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !581, file: !15, line: 346, baseType: !136, size: 32, align: 32, offset: 960)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !581, file: !15, line: 351, baseType: !3, size: 32, align: 32, offset: 992)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !581, file: !15, line: 356, baseType: !131, size: 64, align: 32, offset: 1024)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !581, file: !15, line: 361, baseType: !603, size: 64, align: 64, offset: 1088)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !587, line: 40, baseType: !604)
!604 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !581, file: !15, line: 369, baseType: !603, size: 64, align: 64, offset: 1152)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !581, file: !15, line: 377, baseType: !603, size: 64, align: 64, offset: 1216)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !581, file: !15, line: 382, baseType: !136, size: 32, align: 32, offset: 1280)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !581, file: !15, line: 386, baseType: !136, size: 32, align: 32, offset: 1312)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !581, file: !15, line: 391, baseType: !136, size: 32, align: 32, offset: 1344)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !581, file: !15, line: 396, baseType: !611, size: 64, align: 64, offset: 1408)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !581, file: !15, line: 403, baseType: !613, size: 512, align: 64, offset: 1472)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 512, align: 64, elements: !589)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !587, line: 55, baseType: !615)
!615 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !581, file: !15, line: 410, baseType: !136, size: 32, align: 32, offset: 1984)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !581, file: !15, line: 415, baseType: !136, size: 32, align: 32, offset: 2016)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !581, file: !15, line: 420, baseType: !136, size: 32, align: 32, offset: 2048)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !581, file: !15, line: 425, baseType: !136, size: 32, align: 32, offset: 2080)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !581, file: !15, line: 435, baseType: !603, size: 64, align: 64, offset: 2112)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !581, file: !15, line: 440, baseType: !136, size: 32, align: 32, offset: 2176)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !581, file: !15, line: 445, baseType: !614, size: 64, align: 64, offset: 2240)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !581, file: !15, line: 459, baseType: !624, size: 512, align: 64, offset: 2304)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 512, align: 64, elements: !589)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !627, line: 94, baseType: !628)
!627 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !627, line: 81, size: 192, align: 64, elements: !629)
!629 = !{!630, !634, !635}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !628, file: !627, line: 82, baseType: !631, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !627, line: 73, baseType: !633)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !627, line: 73, flags: DIFlagFwdDecl)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !628, file: !627, line: 89, baseType: !585, size: 64, align: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !628, file: !627, line: 93, baseType: !136, size: 32, align: 32, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !581, file: !15, line: 473, baseType: !637, size: 64, align: 64, offset: 2816)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !581, file: !15, line: 477, baseType: !136, size: 32, align: 32, offset: 2880)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !581, file: !15, line: 479, baseType: !640, size: 64, align: 64, offset: 2944)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !15, line: 207, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !15, line: 201, size: 320, align: 64, elements: !644)
!644 = !{!645, !646, !647, !648, !653}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !643, file: !15, line: 202, baseType: !14, size: 32, align: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !643, file: !15, line: 203, baseType: !585, size: 64, align: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !643, file: !15, line: 204, baseType: !136, size: 32, align: 32, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !643, file: !15, line: 205, baseType: !649, size: 64, align: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !651, line: 86, baseType: !652)
!651 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !651, line: 86, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !643, file: !15, line: 206, baseType: !625, size: 64, align: 64, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !581, file: !15, line: 480, baseType: !136, size: 32, align: 32, offset: 3008)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !581, file: !15, line: 505, baseType: !136, size: 32, align: 32, offset: 3040)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !581, file: !15, line: 512, baseType: !38, size: 32, align: 32, offset: 3072)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !581, file: !15, line: 514, baseType: !45, size: 32, align: 32, offset: 3104)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !581, file: !15, line: 516, baseType: !63, size: 32, align: 32, offset: 3136)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !581, file: !15, line: 523, baseType: !87, size: 32, align: 32, offset: 3168)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !581, file: !15, line: 525, baseType: !106, size: 32, align: 32, offset: 3200)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !581, file: !15, line: 532, baseType: !603, size: 64, align: 64, offset: 3264)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !581, file: !15, line: 539, baseType: !603, size: 64, align: 64, offset: 3328)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !581, file: !15, line: 547, baseType: !603, size: 64, align: 64, offset: 3392)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !581, file: !15, line: 554, baseType: !649, size: 64, align: 64, offset: 3456)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !581, file: !15, line: 563, baseType: !136, size: 32, align: 32, offset: 3520)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !581, file: !15, line: 572, baseType: !136, size: 32, align: 32, offset: 3552)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !581, file: !15, line: 581, baseType: !136, size: 32, align: 32, offset: 3584)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !581, file: !15, line: 588, baseType: !669, size: 64, align: 64, offset: 3648)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !587, line: 36, baseType: !671)
!671 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !581, file: !15, line: 593, baseType: !136, size: 32, align: 32, offset: 3712)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !581, file: !15, line: 596, baseType: !136, size: 32, align: 32, offset: 3744)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !581, file: !15, line: 599, baseType: !625, size: 64, align: 64, offset: 3776)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !581, file: !15, line: 605, baseType: !625, size: 64, align: 64, offset: 3840)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !581, file: !15, line: 616, baseType: !625, size: 64, align: 64, offset: 3904)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !581, file: !15, line: 626, baseType: !678, size: 64, align: 64, offset: 3968)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !679, line: 216, baseType: !615)
!679 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!680 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !581, file: !15, line: 627, baseType: !678, size: 64, align: 64, offset: 4032)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !581, file: !15, line: 628, baseType: !678, size: 64, align: 64, offset: 4096)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !581, file: !15, line: 629, baseType: !678, size: 64, align: 64, offset: 4160)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !581, file: !15, line: 645, baseType: !625, size: 64, align: 64, offset: 4224)
!684 = !DILocalVariable(name: "in", arg: 1, scope: !576, file: !153, line: 97, type: !579)
!685 = !DILocation(line: 97, column: 42, scope: !576)
!686 = !DILocalVariable(name: "sd", scope: !576, file: !153, line: 99, type: !641)
!687 = !DILocation(line: 99, column: 22, scope: !576)
!688 = !DILocation(line: 99, column: 50, scope: !576)
!689 = !DILocation(line: 99, column: 27, scope: !576)
!690 = !DILocalVariable(name: "peak", scope: !576, file: !153, line: 100, type: !148)
!691 = !DILocation(line: 100, column: 12, scope: !576)
!692 = !DILocation(line: 102, column: 9, scope: !693)
!693 = distinct !DILexicalBlock(scope: !576, file: !153, line: 102, column: 9)
!694 = !DILocation(line: 102, column: 9, scope: !576)
!695 = !DILocalVariable(name: "clm", scope: !696, file: !153, line: 103, type: !117)
!696 = distinct !DILexicalBlock(scope: !693, file: !153, line: 102, column: 13)
!697 = !DILocation(line: 103, column: 33, scope: !696)
!698 = !DILocation(line: 103, column: 65, scope: !696)
!699 = !DILocation(line: 103, column: 69, scope: !696)
!700 = !DILocation(line: 103, column: 39, scope: !696)
!701 = !DILocation(line: 104, column: 16, scope: !696)
!702 = !DILocation(line: 104, column: 21, scope: !696)
!703 = !DILocation(line: 104, column: 28, scope: !696)
!704 = !DILocation(line: 104, column: 14, scope: !696)
!705 = !DILocation(line: 105, column: 5, scope: !696)
!706 = !DILocation(line: 107, column: 33, scope: !576)
!707 = !DILocation(line: 107, column: 10, scope: !576)
!708 = !DILocation(line: 107, column: 8, scope: !576)
!709 = !DILocation(line: 108, column: 10, scope: !710)
!710 = distinct !DILexicalBlock(scope: !576, file: !153, line: 108, column: 9)
!711 = !DILocation(line: 108, column: 15, scope: !710)
!712 = !DILocation(line: 108, column: 18, scope: !713)
!713 = !DILexicalBlockFile(scope: !710, file: !153, discriminator: 1)
!714 = !DILocation(line: 108, column: 9, scope: !713)
!715 = !DILocalVariable(name: "metadata", scope: !716, file: !153, line: 109, type: !125)
!716 = distinct !DILexicalBlock(scope: !710, file: !153, line: 108, column: 22)
!717 = !DILocation(line: 109, column: 37, scope: !716)
!718 = !DILocation(line: 109, column: 78, scope: !716)
!719 = !DILocation(line: 109, column: 82, scope: !716)
!720 = !DILocation(line: 109, column: 48, scope: !716)
!721 = !DILocation(line: 110, column: 13, scope: !722)
!722 = distinct !DILexicalBlock(scope: !716, file: !153, line: 110, column: 13)
!723 = !DILocation(line: 110, column: 23, scope: !722)
!724 = !DILocation(line: 110, column: 13, scope: !716)
!725 = !DILocation(line: 111, column: 27, scope: !722)
!726 = !DILocation(line: 111, column: 37, scope: !722)
!727 = !DILocation(line: 111, column: 20, scope: !722)
!728 = !DILocation(line: 111, column: 52, scope: !722)
!729 = !DILocation(line: 111, column: 18, scope: !722)
!730 = !DILocation(line: 111, column: 13, scope: !722)
!731 = !DILocation(line: 112, column: 5, scope: !716)
!732 = !DILocation(line: 116, column: 10, scope: !733)
!733 = distinct !DILexicalBlock(scope: !576, file: !153, line: 116, column: 9)
!734 = !DILocation(line: 116, column: 9, scope: !576)
!735 = !DILocation(line: 117, column: 16, scope: !733)
!736 = !DILocation(line: 117, column: 20, scope: !733)
!737 = !DILocation(line: 117, column: 30, scope: !733)
!738 = !DILocation(line: 117, column: 14, scope: !733)
!739 = !DILocation(line: 117, column: 9, scope: !733)
!740 = !DILocation(line: 119, column: 12, scope: !576)
!741 = !DILocation(line: 119, column: 5, scope: !576)
!742 = distinct !DISubprogram(name: "av_q2d", scope: !132, file: !132, line: 104, type: !743, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !162)
!743 = !DISubroutineType(types: !744)
!744 = !{!148, !131}
!745 = !DILocalVariable(name: "a", arg: 1, scope: !742, file: !132, line: 104, type: !131)
