; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--af_biquads.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--af_biquads.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFilterPad = type { i8*, i32, %struct.AVFrame* (%struct.AVFilterLink*, i32, i32)*, %struct.AVFrame* (%struct.AVFilterLink*, i32)*, i32 (%struct.AVFilterLink*, %struct.AVFrame*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32, i32 }
%struct.AVFrame = type { [8 x i8*], [8 x i32], i8**, i32, i32, i32, i32, i32, i32, %struct.AVRational, i64, i64, i64, i32, i32, i32, i8*, [8 x i64], i32, i32, i32, i32, i64, i32, i64, [8 x %struct.AVBufferRef*], %struct.AVBufferRef**, i32, %struct.AVFrameSideData**, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, %struct.AVDictionary*, i32, i32, i32, i8*, i32, i32, %struct.AVBufferRef*, %struct.AVBufferRef*, %struct.AVBufferRef*, i64, i64, i64, i64, %struct.AVBufferRef* }
%struct.AVRational = type { i32, i32 }
%struct.AVFrameSideData = type { i32, i8*, i32, %struct.AVDictionary*, %struct.AVBufferRef* }
%struct.AVDictionary = type opaque
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !48, line: 538, size: 32, align: 32, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!118 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!119 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!120 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!121 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!122 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!123 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!124 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVOptionType", file: !126, line: 221, size: 32, align: 32, elements: !127)
!126 = !DIFile(filename: "./libavutil/opt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146}
!128 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!129 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!130 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!131 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!132 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!133 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!134 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!135 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!136 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!137 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!138 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!139 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!140 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!141 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!142 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!143 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!144 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!145 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!146 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !148, line: 29, size: 32, align: 32, elements: !149)
!148 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167}
!150 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!151 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!152 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!153 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!154 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!155 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!156 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!157 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!158 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!159 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!160 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!161 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!162 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!163 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!164 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!165 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!166 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!167 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !170, file: !169, line: 503, size: 32, align: 32, elements: !576)
!169 = !DIFile(filename: "libavfilter/avfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterLink", file: !169, line: 439, size: 493504, align: 64, elements: !171)
!171 = !{!172, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !537, !538, !539, !540, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !170, file: !169, line: 440, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterContext", file: !169, line: 67, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterContext", file: !169, line: 338, size: 1344, align: 64, elements: !176)
!176 = !{!177, !264, !437, !438, !440, !442, !444, !445, !446, !447, !448, !488, !489, !495, !504, !505, !506, !508, !509, !510, !511, !512}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !175, file: !169, line: 339, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !148, line: 143, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !148, line: 67, size: 640, align: 64, elements: !182)
!182 = !{!183, !187, !192, !223, !224, !225, !226, !230, !236, !238, !242}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !181, file: !148, line: 72, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !181, file: !148, line: 78, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!184, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !181, file: !148, line: 85, baseType: !193, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !126, line: 246, size: 512, align: 64, elements: !196)
!196 = !{!197, !198, !199, !201, !202, !219, !220, !221, !222}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !126, line: 247, baseType: !184, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !195, file: !126, line: 253, baseType: !184, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !195, file: !126, line: 259, baseType: !200, size: 32, align: 32, offset: 128)
!200 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !126, line: 260, baseType: !125, size: 32, align: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !195, file: !126, line: 271, baseType: !203, size: 64, align: 64, offset: 192)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !195, file: !126, line: 265, size: 64, align: 64, elements: !204)
!204 = !{!205, !209, !211, !212}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !203, file: !126, line: 266, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !207, line: 197, baseType: !208)
!207 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!208 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !203, file: !126, line: 267, baseType: !210, size: 64, align: 64)
!210 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !203, file: !126, line: 268, baseType: !184, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !203, file: !126, line: 270, baseType: !213, size: 64, align: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !214, line: 61, baseType: !215)
!214 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !214, line: 58, size: 64, align: 32, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !215, file: !214, line: 59, baseType: !200, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !215, file: !214, line: 60, baseType: !200, size: 32, align: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !195, file: !126, line: 272, baseType: !210, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !195, file: !126, line: 273, baseType: !210, size: 64, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !195, file: !126, line: 275, baseType: !200, size: 32, align: 32, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !195, file: !126, line: 300, baseType: !184, size: 64, align: 64, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !181, file: !148, line: 93, baseType: !200, size: 32, align: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !181, file: !148, line: 99, baseType: !200, size: 32, align: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !181, file: !148, line: 108, baseType: !200, size: 32, align: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !181, file: !148, line: 113, baseType: !227, size: 64, align: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!191, !191, !191}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !181, file: !148, line: 123, baseType: !231, size: 64, align: 64, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!234, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !181, file: !148, line: 130, baseType: !237, size: 32, align: 32, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !148, line: 48, baseType: !147)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !181, file: !148, line: 136, baseType: !239, size: 64, align: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!237, !191}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !181, file: !148, line: 142, baseType: !243, size: 64, align: 64, offset: 576)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!200, !246, !191, !184, !200}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !126, line: 329, size: 128, align: 64, elements: !249)
!249 = !{!250, !262, !263}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !248, file: !126, line: 360, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !126, line: 324, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !126, line: 306, size: 384, align: 64, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !254, file: !126, line: 307, baseType: !184, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !254, file: !126, line: 313, baseType: !210, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !254, file: !126, line: 313, baseType: !210, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !254, file: !126, line: 318, baseType: !210, size: 64, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !254, file: !126, line: 318, baseType: !210, size: 64, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !254, file: !126, line: 323, baseType: !200, size: 32, align: 32, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !248, file: !126, line: 364, baseType: !200, size: 32, align: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !248, file: !126, line: 368, baseType: !200, size: 32, align: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !175, file: !169, line: 341, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilter", file: !169, line: 328, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilter", file: !169, line: 144, size: 1024, align: 64, elements: !269)
!269 = !{!270, !271, !272, !405, !406, !407, !408, !412, !413, !418, !422, !423, !424, !425, !427, !432, !436}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !169, line: 148, baseType: !184, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !268, file: !169, line: 155, baseType: !184, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !268, file: !169, line: 164, baseType: !273, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterPad", file: !169, line: 69, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterPad", file: !277, line: 54, size: 576, align: 64, elements: !278)
!277 = !DIFile(filename: "libavfilter/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!278 = !{!279, !280, !281, !389, !393, !397, !401, !402, !403, !404}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !277, line: 60, baseType: !184, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !276, file: !277, line: 65, baseType: !3, size: 32, align: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "get_video_buffer", scope: !276, file: !277, line: 73, baseType: !282, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!285, !387, !200, !200}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !24, line: 646, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !24, line: 268, size: 4288, align: 64, elements: !288)
!288 = !{!289, !297, !299, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !319, !320, !321, !322, !323, !324, !325, !326, !339, !341, !342, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !375, !376, !377, !378, !379, !380, !383, !384, !385, !386}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !287, file: !24, line: 282, baseType: !290, size: 512, align: 64)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 512, align: 64, elements: !295)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !293, line: 48, baseType: !294)
!293 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!294 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!295 = !{!296}
!296 = !DISubrange(count: 8)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !287, file: !24, line: 299, baseType: !298, size: 256, align: 32, offset: 512)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 256, align: 32, elements: !295)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !287, file: !24, line: 315, baseType: !300, size: 64, align: 64, offset: 768)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !287, file: !24, line: 326, baseType: !200, size: 32, align: 32, offset: 832)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !287, file: !24, line: 326, baseType: !200, size: 32, align: 32, offset: 864)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !287, file: !24, line: 334, baseType: !200, size: 32, align: 32, offset: 896)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !287, file: !24, line: 341, baseType: !200, size: 32, align: 32, offset: 928)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !287, file: !24, line: 346, baseType: !200, size: 32, align: 32, offset: 960)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !287, file: !24, line: 351, baseType: !13, size: 32, align: 32, offset: 992)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !287, file: !24, line: 356, baseType: !213, size: 64, align: 32, offset: 1024)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !287, file: !24, line: 361, baseType: !206, size: 64, align: 64, offset: 1088)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !287, file: !24, line: 369, baseType: !206, size: 64, align: 64, offset: 1152)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !287, file: !24, line: 377, baseType: !206, size: 64, align: 64, offset: 1216)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !287, file: !24, line: 382, baseType: !200, size: 32, align: 32, offset: 1280)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !287, file: !24, line: 386, baseType: !200, size: 32, align: 32, offset: 1312)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !287, file: !24, line: 391, baseType: !200, size: 32, align: 32, offset: 1344)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !287, file: !24, line: 396, baseType: !191, size: 64, align: 64, offset: 1408)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !287, file: !24, line: 403, baseType: !316, size: 512, align: 64, offset: 1472)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 512, align: 64, elements: !295)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !293, line: 55, baseType: !318)
!318 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !287, file: !24, line: 410, baseType: !200, size: 32, align: 32, offset: 1984)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !287, file: !24, line: 415, baseType: !200, size: 32, align: 32, offset: 2016)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !287, file: !24, line: 420, baseType: !200, size: 32, align: 32, offset: 2048)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !287, file: !24, line: 425, baseType: !200, size: 32, align: 32, offset: 2080)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !287, file: !24, line: 435, baseType: !206, size: 64, align: 64, offset: 2112)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !287, file: !24, line: 440, baseType: !200, size: 32, align: 32, offset: 2176)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !287, file: !24, line: 445, baseType: !317, size: 64, align: 64, offset: 2240)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !287, file: !24, line: 459, baseType: !327, size: 512, align: 64, offset: 2304)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 512, align: 64, elements: !295)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !330, line: 94, baseType: !331)
!330 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !330, line: 81, size: 192, align: 64, elements: !332)
!332 = !{!333, !337, !338}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !331, file: !330, line: 82, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !330, line: 73, baseType: !336)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !330, line: 73, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !331, file: !330, line: 89, baseType: !291, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !331, file: !330, line: 93, baseType: !200, size: 32, align: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !287, file: !24, line: 473, baseType: !340, size: 64, align: 64, offset: 2816)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !287, file: !24, line: 477, baseType: !200, size: 32, align: 32, offset: 2880)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !287, file: !24, line: 479, baseType: !343, size: 64, align: 64, offset: 2944)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !24, line: 207, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !24, line: 201, size: 320, align: 64, elements: !347)
!347 = !{!348, !349, !350, !351, !356}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !346, file: !24, line: 202, baseType: !23, size: 32, align: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !346, file: !24, line: 203, baseType: !291, size: 64, align: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !346, file: !24, line: 204, baseType: !200, size: 32, align: 32, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !346, file: !24, line: 205, baseType: !352, size: 64, align: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !354, line: 86, baseType: !355)
!354 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !354, line: 86, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !346, file: !24, line: 206, baseType: !328, size: 64, align: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !287, file: !24, line: 480, baseType: !200, size: 32, align: 32, offset: 3008)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !24, line: 505, baseType: !200, size: 32, align: 32, offset: 3040)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !287, file: !24, line: 512, baseType: !47, size: 32, align: 32, offset: 3072)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !287, file: !24, line: 514, baseType: !54, size: 32, align: 32, offset: 3104)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !287, file: !24, line: 516, baseType: !72, size: 32, align: 32, offset: 3136)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !287, file: !24, line: 523, baseType: !96, size: 32, align: 32, offset: 3168)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !287, file: !24, line: 525, baseType: !115, size: 32, align: 32, offset: 3200)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !287, file: !24, line: 532, baseType: !206, size: 64, align: 64, offset: 3264)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !287, file: !24, line: 539, baseType: !206, size: 64, align: 64, offset: 3328)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !287, file: !24, line: 547, baseType: !206, size: 64, align: 64, offset: 3392)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !287, file: !24, line: 554, baseType: !352, size: 64, align: 64, offset: 3456)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !287, file: !24, line: 563, baseType: !200, size: 32, align: 32, offset: 3520)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !287, file: !24, line: 572, baseType: !200, size: 32, align: 32, offset: 3552)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !287, file: !24, line: 581, baseType: !200, size: 32, align: 32, offset: 3584)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !287, file: !24, line: 588, baseType: !372, size: 64, align: 64, offset: 3648)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !207, line: 194, baseType: !374)
!374 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !287, file: !24, line: 593, baseType: !200, size: 32, align: 32, offset: 3712)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !287, file: !24, line: 596, baseType: !200, size: 32, align: 32, offset: 3744)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !287, file: !24, line: 599, baseType: !328, size: 64, align: 64, offset: 3776)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !287, file: !24, line: 605, baseType: !328, size: 64, align: 64, offset: 3840)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !287, file: !24, line: 616, baseType: !328, size: 64, align: 64, offset: 3904)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !287, file: !24, line: 626, baseType: !381, size: 64, align: 64, offset: 3968)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !382, line: 216, baseType: !318)
!382 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!383 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !287, file: !24, line: 627, baseType: !381, size: 64, align: 64, offset: 4032)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !287, file: !24, line: 628, baseType: !381, size: 64, align: 64, offset: 4096)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !287, file: !24, line: 629, baseType: !381, size: 64, align: 64, offset: 4160)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !287, file: !24, line: 645, baseType: !328, size: 64, align: 64, offset: 4224)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterLink", file: !169, line: 68, baseType: !170)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "get_audio_buffer", scope: !276, file: !277, line: 81, baseType: !390, size: 64, align: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!285, !387, !200}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "filter_frame", scope: !276, file: !277, line: 93, baseType: !394, size: 64, align: 64, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!200, !387, !285}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "poll_frame", scope: !276, file: !277, line: 104, baseType: !398, size: 64, align: 64, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!200, !387}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "request_frame", scope: !276, file: !277, line: 113, baseType: !398, size: 64, align: 64, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "config_props", scope: !276, file: !277, line: 129, baseType: !398, size: 64, align: 64, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "needs_fifo", scope: !276, file: !277, line: 137, baseType: !200, size: 32, align: 32, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "needs_writable", scope: !276, file: !277, line: 145, baseType: !200, size: 32, align: 32, offset: 544)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !268, file: !169, line: 172, baseType: !273, size: 64, align: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !268, file: !169, line: 182, baseType: !178, size: 64, align: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !268, file: !169, line: 187, baseType: !200, size: 32, align: 32, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "preinit", scope: !268, file: !169, line: 210, baseType: !409, size: 64, align: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!200, !173}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !268, file: !169, line: 233, baseType: !409, size: 64, align: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "init_dict", scope: !268, file: !169, line: 246, baseType: !414, size: 64, align: 64, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!200, !173, !417}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !268, file: !169, line: 258, baseType: !419, size: 64, align: 64, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !173}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "query_formats", scope: !268, file: !169, line: 282, baseType: !409, size: 64, align: 64, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "priv_size", scope: !268, file: !169, line: 284, baseType: !200, size: 32, align: 32, offset: 704)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flags_internal", scope: !268, file: !169, line: 286, baseType: !200, size: 32, align: 32, offset: 736)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !169, line: 292, baseType: !426, size: 64, align: 64, offset: 768)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "process_command", scope: !268, file: !169, line: 306, baseType: !428, size: 64, align: 64, offset: 832)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!200, !173, !184, !184, !431, !200, !200}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "init_opaque", scope: !268, file: !169, line: 313, baseType: !433, size: 64, align: 64, offset: 896)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!200, !173, !191}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !268, file: !169, line: 327, baseType: !409, size: 64, align: 64, offset: 960)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !169, line: 343, baseType: !431, size: 64, align: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "input_pads", scope: !175, file: !169, line: 345, baseType: !439, size: 64, align: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !175, file: !169, line: 346, baseType: !441, size: 64, align: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !175, file: !169, line: 347, baseType: !443, size: 32, align: 32, offset: 320)
!443 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "output_pads", scope: !175, file: !169, line: 349, baseType: !439, size: 64, align: 64, offset: 384)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !175, file: !169, line: 350, baseType: !441, size: 64, align: 64, offset: 448)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "nb_outputs", scope: !175, file: !169, line: 351, baseType: !443, size: 32, align: 32, offset: 512)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !175, file: !169, line: 353, baseType: !191, size: 64, align: 64, offset: 576)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !175, file: !169, line: 355, baseType: !449, size: 64, align: 64, offset: 640)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraph", file: !169, line: 840, size: 768, align: 64, elements: !451)
!451 = !{!452, !453, !455, !456, !457, !458, !459, !460, !482, !483, !484, !485, !486, !487}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !450, file: !169, line: 841, baseType: !178, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !450, file: !169, line: 842, baseType: !454, size: 64, align: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "nb_filters", scope: !450, file: !169, line: 843, baseType: !443, size: 32, align: 32, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "scale_sws_opts", scope: !450, file: !169, line: 845, baseType: !431, size: 64, align: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "resample_lavr_opts", scope: !450, file: !169, line: 847, baseType: !431, size: 64, align: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !450, file: !169, line: 862, baseType: !200, size: 32, align: 32, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !450, file: !169, line: 869, baseType: !200, size: 32, align: 32, offset: 352)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !450, file: !169, line: 874, baseType: !461, size: 64, align: 64, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterGraphInternal", file: !169, line: 809, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraphInternal", file: !277, line: 148, size: 192, align: 64, elements: !464)
!464 = !{!465, !466, !476}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !463, file: !277, line: 149, baseType: !191, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "thread_execute", scope: !463, file: !277, line: 150, baseType: !467, size: 64, align: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_execute_func", file: !169, line: 837, baseType: !469)
!469 = !DISubroutineType(types: !470)
!470 = !{!200, !173, !471, !191, !475, !200}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_action_func", file: !169, line: 823, baseType: !473)
!473 = !DISubroutineType(types: !474)
!474 = !{!200, !173, !191, !200, !200}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "frame_queues", scope: !463, file: !277, line: 151, baseType: !477, size: 8, align: 8, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameQueueGlobal", file: !478, line: 48, baseType: !479)
!478 = !DIFile(filename: "libavfilter/framequeue.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameQueueGlobal", file: !478, line: 46, size: 8, align: 8, elements: !480)
!480 = !{!481}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !479, file: !478, line: 47, baseType: !186, size: 8, align: 8)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !450, file: !169, line: 881, baseType: !191, size: 64, align: 64, offset: 448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !450, file: !169, line: 895, baseType: !467, size: 64, align: 64, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "aresample_swr_opts", scope: !450, file: !169, line: 897, baseType: !431, size: 64, align: 64, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links", scope: !450, file: !169, line: 906, baseType: !441, size: 64, align: 64, offset: 640)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links_count", scope: !450, file: !169, line: 907, baseType: !200, size: 32, align: 32, offset: 704)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "disable_auto_convert", scope: !450, file: !169, line: 909, baseType: !443, size: 32, align: 32, offset: 736)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !175, file: !169, line: 373, baseType: !200, size: 32, align: 32, offset: 704)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !175, file: !169, line: 378, baseType: !490, size: 64, align: 64, offset: 768)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterInternal", file: !169, line: 335, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterInternal", file: !277, line: 154, size: 64, align: 64, elements: !493)
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !492, file: !277, line: 155, baseType: !467, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "command_queue", scope: !175, file: !169, line: 380, baseType: !496, size: 64, align: 64, offset: 832)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64, align: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterCommand", file: !277, line: 38, size: 320, align: 64, elements: !498)
!498 = !{!499, !500, !501, !502, !503}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !497, file: !277, line: 39, baseType: !210, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !497, file: !277, line: 40, baseType: !431, size: 64, align: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !497, file: !277, line: 41, baseType: !431, size: 64, align: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !497, file: !277, line: 42, baseType: !200, size: 32, align: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !497, file: !277, line: 43, baseType: !496, size: 64, align: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "enable_str", scope: !175, file: !169, line: 382, baseType: !431, size: 64, align: 64, offset: 896)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !175, file: !169, line: 383, baseType: !191, size: 64, align: 64, offset: 960)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "var_values", scope: !175, file: !169, line: 384, baseType: !507, size: 64, align: 64, offset: 1024)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "is_disabled", scope: !175, file: !169, line: 385, baseType: !200, size: 32, align: 32, offset: 1088)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !175, file: !169, line: 394, baseType: !328, size: 64, align: 64, offset: 1152)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !175, file: !169, line: 401, baseType: !200, size: 32, align: 32, offset: 1216)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !175, file: !169, line: 408, baseType: !443, size: 32, align: 32, offset: 1248)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !175, file: !169, line: 424, baseType: !200, size: 32, align: 32, offset: 1280)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "srcpad", scope: !170, file: !169, line: 441, baseType: !439, size: 64, align: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !170, file: !169, line: 443, baseType: !173, size: 64, align: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "dstpad", scope: !170, file: !169, line: 444, baseType: !439, size: 64, align: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !169, line: 446, baseType: !3, size: 32, align: 32, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !170, file: !169, line: 449, baseType: !200, size: 32, align: 32, offset: 288)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !170, file: !169, line: 450, baseType: !200, size: 32, align: 32, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !170, file: !169, line: 451, baseType: !213, size: 64, align: 32, offset: 352)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !170, file: !169, line: 453, baseType: !317, size: 64, align: 64, offset: 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !170, file: !169, line: 454, baseType: !200, size: 32, align: 32, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !170, file: !169, line: 456, baseType: !200, size: 32, align: 32, offset: 544)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !170, file: !169, line: 465, baseType: !213, size: 64, align: 32, offset: 576)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "in_formats", scope: !170, file: !169, line: 481, baseType: !525, size: 64, align: 64, offset: 640)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterFormats", file: !169, line: 70, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterFormats", file: !528, line: 64, size: 256, align: 64, elements: !529)
!528 = !DIFile(filename: "libavfilter/formats.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!529 = !{!530, !531, !532, !533}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "nb_formats", scope: !527, file: !528, line: 65, baseType: !443, size: 32, align: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !527, file: !528, line: 66, baseType: !475, size: 64, align: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !527, file: !528, line: 68, baseType: !443, size: 32, align: 32, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !527, file: !528, line: 69, baseType: !534, size: 64, align: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "out_formats", scope: !170, file: !169, line: 482, baseType: !525, size: 64, align: 64, offset: 704)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "in_samplerates", scope: !170, file: !169, line: 488, baseType: !525, size: 64, align: 64, offset: 768)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "out_samplerates", scope: !170, file: !169, line: 489, baseType: !525, size: 64, align: 64, offset: 832)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "in_channel_layouts", scope: !170, file: !169, line: 490, baseType: !541, size: 64, align: 64, offset: 896)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterChannelLayouts", file: !528, line: 85, size: 256, align: 64, elements: !543)
!543 = !{!544, !546, !547, !548, !549, !550}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !542, file: !528, line: 86, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "nb_channel_layouts", scope: !542, file: !528, line: 87, baseType: !200, size: 32, align: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "all_layouts", scope: !542, file: !528, line: 88, baseType: !186, size: 8, align: 8, offset: 96)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "all_counts", scope: !542, file: !528, line: 89, baseType: !186, size: 8, align: 8, offset: 104)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !542, file: !528, line: 91, baseType: !443, size: 32, align: 32, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !542, file: !528, line: 92, baseType: !551, size: 64, align: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "out_channel_layouts", scope: !170, file: !169, line: 491, baseType: !541, size: 64, align: 64, offset: 960)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "request_samples", scope: !170, file: !169, line: 500, baseType: !200, size: 32, align: 32, offset: 1024)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !170, file: !169, line: 507, baseType: !168, size: 32, align: 32, offset: 1056)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !170, file: !169, line: 512, baseType: !449, size: 64, align: 64, offset: 1088)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts", scope: !170, file: !169, line: 518, baseType: !206, size: 64, align: 64, offset: 1152)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts_us", scope: !170, file: !169, line: 524, baseType: !206, size: 64, align: 64, offset: 1216)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "age_index", scope: !170, file: !169, line: 529, baseType: !200, size: 32, align: 32, offset: 1280)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !170, file: !169, line: 542, baseType: !213, size: 64, align: 32, offset: 1312)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf", scope: !170, file: !169, line: 547, baseType: !285, size: 64, align: 64, offset: 1408)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf_size", scope: !170, file: !169, line: 553, baseType: !200, size: 32, align: 32, offset: 1472)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "min_samples", scope: !170, file: !169, line: 562, baseType: !200, size: 32, align: 32, offset: 1504)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "max_samples", scope: !170, file: !169, line: 568, baseType: !200, size: 32, align: 32, offset: 1536)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !170, file: !169, line: 573, baseType: !200, size: 32, align: 32, offset: 1568)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !170, file: !169, line: 578, baseType: !443, size: 32, align: 32, offset: 1600)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_in", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1664)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_out", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1728)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pool", scope: !170, file: !169, line: 588, baseType: !191, size: 64, align: 64, offset: 1792)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "frame_wanted_out", scope: !170, file: !169, line: 595, baseType: !200, size: 32, align: 32, offset: 1856)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !170, file: !169, line: 601, baseType: !328, size: 64, align: 64, offset: 1920)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !170, file: !169, line: 610, baseType: !573, size: 491520, align: 8, offset: 1984)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 491520, align: 8, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 61440)
!576 = !{!577, !578, !579}
!577 = !DIEnumerator(name: "AVLINK_UNINIT", value: 0)
!578 = !DIEnumerator(name: "AVLINK_STARTINIT", value: 1)
!579 = !DIEnumerator(name: "AVLINK_INIT", value: 2)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FilterType", file: !581, line: 72, size: 32, align: 32, elements: !582)
!581 = !DIFile(filename: "libavfilter/af_biquads.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!582 = !{!583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593}
!583 = !DIEnumerator(name: "biquad", value: 0)
!584 = !DIEnumerator(name: "equalizer", value: 1)
!585 = !DIEnumerator(name: "bass", value: 2)
!586 = !DIEnumerator(name: "treble", value: 3)
!587 = !DIEnumerator(name: "bandpass", value: 4)
!588 = !DIEnumerator(name: "bandreject", value: 5)
!589 = !DIEnumerator(name: "allpass", value: 6)
!590 = !DIEnumerator(name: "highpass", value: 7)
!591 = !DIEnumerator(name: "lowpass", value: 8)
!592 = !DIEnumerator(name: "lowshelf", value: 9)
!593 = !DIEnumerator(name: "highshelf", value: 10)
!594 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSampleFormat", file: !595, line: 58, size: 32, align: 32, elements: !596)
!595 = !DIFile(filename: "./libavutil/samplefmt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!596 = !{!597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610}
!597 = !DIEnumerator(name: "AV_SAMPLE_FMT_NONE", value: -1)
!598 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8", value: 0)
!599 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16", value: 1)
!600 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32", value: 2)
!601 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLT", value: 3)
!602 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBL", value: 4)
!603 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8P", value: 5)
!604 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16P", value: 6)
!605 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32P", value: 7)
!606 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLTP", value: 8)
!607 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBLP", value: 9)
!608 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64", value: 10)
!609 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64P", value: 11)
!610 = !DIEnumerator(name: "AV_SAMPLE_FMT_NB", value: 12)
!611 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "WidthType", file: !581, line: 86, size: 32, align: 32, elements: !612)
!612 = !{!613, !614, !615, !616, !617, !618, !619}
!613 = !DIEnumerator(name: "NONE", value: 0)
!614 = !DIEnumerator(name: "HERTZ", value: 1)
!615 = !DIEnumerator(name: "OCTAVE", value: 2)
!616 = !DIEnumerator(name: "QFACTOR", value: 3)
!617 = !DIEnumerator(name: "SLOPE", value: 4)
!618 = !DIEnumerator(name: "KHERTZ", value: 5)
!619 = !DIEnumerator(name: "NB_WTYPE", value: 6)
!620 = !{!191}
!621 = !{!622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !637, !638, !639, !645, !652, !653, !654, !655, !656, !657, !661, !662, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677}
!622 = distinct !DIGlobalVariable(name: "ff_af_equalizer", scope: !0, file: !581, line: 679, type: !267, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_af_equalizer)
!623 = distinct !DIGlobalVariable(name: "ff_af_bass", scope: !0, file: !581, line: 701, type: !267, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_af_bass)
!624 = distinct !DIGlobalVariable(name: "ff_af_treble", scope: !0, file: !581, line: 723, type: !267, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_af_treble)
!625 = distinct !DIGlobalVariable(name: "ff_af_bandpass", scope: !0, file: !581, line: 744, type: !267, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_af_bandpass)
!626 = distinct !DIGlobalVariable(name: "ff_af_bandreject", scope: !0, file: !581, line: 764, type: !267, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_af_bandreject)
!627 = distinct !DIGlobalVariable(name: "ff_af_lowpass", scope: !0, file: !581, line: 786, type: !267, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_af_lowpass)
!628 = distinct !DIGlobalVariable(name: "ff_af_highpass", scope: !0, file: !581, line: 808, type: !267, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_af_highpass)
!629 = distinct !DIGlobalVariable(name: "ff_af_allpass", scope: !0, file: !581, line: 828, type: !267, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_af_allpass)
!630 = distinct !DIGlobalVariable(name: "ff_af_lowshelf", scope: !0, file: !581, line: 850, type: !267, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_af_lowshelf)
!631 = distinct !DIGlobalVariable(name: "ff_af_highshelf", scope: !0, file: !581, line: 872, type: !267, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_af_highshelf)
!632 = distinct !DIGlobalVariable(name: "ff_af_biquad", scope: !0, file: !581, line: 887, type: !267, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_af_biquad)
!633 = distinct !DIGlobalVariable(name: "inputs", scope: !0, file: !581, line: 614, type: !634, isLocal: true, isDefinition: true, variable: [2 x %struct.AVFilterPad]* @inputs)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 1152, align: 64, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 2)
!637 = distinct !DIGlobalVariable(name: "outputs", scope: !0, file: !581, line: 623, type: !634, isLocal: true, isDefinition: true, variable: [2 x %struct.AVFilterPad]* @outputs)
!638 = distinct !DIGlobalVariable(name: "equalizer_class", scope: !0, file: !581, line: 679, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @equalizer_class)
!639 = distinct !DIGlobalVariable(name: "equalizer_options", scope: !0, file: !581, line: 660, type: !640, isLocal: true, isDefinition: true, variable: <{ { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption }>* @equalizer_options)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !641, size: 8192, align: 64, elements: !643)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !126, line: 301, baseType: !195)
!643 = !{!644}
!644 = !DISubrange(count: 16)
!645 = distinct !DIGlobalVariable(name: "sample_fmts", scope: !646, file: !581, line: 145, type: !648, isLocal: true, isDefinition: true, variable: [5 x i32]* @query_formats.sample_fmts)
!646 = distinct !DISubprogram(name: "query_formats", scope: !581, file: !581, line: 141, type: !410, isLocal: true, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !647)
!647 = !{}
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 160, align: 32, elements: !650)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!650 = !{!651}
!651 = !DISubrange(count: 5)
!652 = distinct !DIGlobalVariable(name: "bass_class", scope: !0, file: !581, line: 701, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @bass_class)
!653 = distinct !DIGlobalVariable(name: "bass_options", scope: !0, file: !581, line: 682, type: !640, isLocal: true, isDefinition: true, variable: <{ { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption }>* @bass_options)
!654 = distinct !DIGlobalVariable(name: "treble_class", scope: !0, file: !581, line: 723, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @treble_class)
!655 = distinct !DIGlobalVariable(name: "treble_options", scope: !0, file: !581, line: 704, type: !640, isLocal: true, isDefinition: true, variable: <{ { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption }>* @treble_options)
!656 = distinct !DIGlobalVariable(name: "bandpass_class", scope: !0, file: !581, line: 744, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @bandpass_class)
!657 = distinct !DIGlobalVariable(name: "bandpass_options", scope: !0, file: !581, line: 726, type: !658, isLocal: true, isDefinition: true, variable: <{ { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption }>* @bandpass_options)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !641, size: 7680, align: 64, elements: !659)
!659 = !{!660}
!660 = !DISubrange(count: 15)
!661 = distinct !DIGlobalVariable(name: "bandreject_class", scope: !0, file: !581, line: 764, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @bandreject_class)
!662 = distinct !DIGlobalVariable(name: "bandreject_options", scope: !0, file: !581, line: 747, type: !663, isLocal: true, isDefinition: true, variable: <{ { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption }>* @bandreject_options)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !641, size: 7168, align: 64, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 14)
!666 = distinct !DIGlobalVariable(name: "lowpass_class", scope: !0, file: !581, line: 786, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @lowpass_class)
!667 = distinct !DIGlobalVariable(name: "lowpass_options", scope: !0, file: !581, line: 767, type: !640, isLocal: true, isDefinition: true, variable: <{ { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption }>* @lowpass_options)
!668 = distinct !DIGlobalVariable(name: "highpass_class", scope: !0, file: !581, line: 808, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @highpass_class)
!669 = distinct !DIGlobalVariable(name: "highpass_options", scope: !0, file: !581, line: 789, type: !640, isLocal: true, isDefinition: true, variable: <{ { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption }>* @highpass_options)
!670 = distinct !DIGlobalVariable(name: "allpass_class", scope: !0, file: !581, line: 828, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @allpass_class)
!671 = distinct !DIGlobalVariable(name: "allpass_options", scope: !0, file: !581, line: 811, type: !663, isLocal: true, isDefinition: true, variable: <{ { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption }>* @allpass_options)
!672 = distinct !DIGlobalVariable(name: "lowshelf_class", scope: !0, file: !581, line: 850, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @lowshelf_class)
!673 = distinct !DIGlobalVariable(name: "lowshelf_options", scope: !0, file: !581, line: 831, type: !640, isLocal: true, isDefinition: true, variable: <{ { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption }>* @lowshelf_options)
!674 = distinct !DIGlobalVariable(name: "highshelf_class", scope: !0, file: !581, line: 872, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @highshelf_class)
!675 = distinct !DIGlobalVariable(name: "highshelf_options", scope: !0, file: !581, line: 853, type: !640, isLocal: true, isDefinition: true, variable: <{ { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption }>* @highshelf_options)
!676 = distinct !DIGlobalVariable(name: "biquad_class", scope: !0, file: !581, line: 887, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @biquad_class)
!677 = distinct !DIGlobalVariable(name: "biquad_options", scope: !0, file: !581, line: 875, type: !678, isLocal: true, isDefinition: true, variable: <{ { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption }>* @biquad_options)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !641, size: 4608, align: 64, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 9)
!681 = !{i32 2, !"Dwarf Version", i32 4}
!682 = !{i32 2, !"Debug Info Version", i32 3}
!683 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!684 = distinct !DISubprogram(name: "equalizer_init", scope: !581, file: !581, line: 679, type: !410, isLocal: true, isDefinition: true, scopeLine: 679, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !647)
!685 = !DILocalVariable(name: "ctx", arg: 1, scope: !684, file: !581, line: 679, type: !173)
!686 = !DIExpression()
!687 = !DILocation(line: 679, column: 280, scope: !684)
!688 = !DILocalVariable(name: "s", scope: !684, file: !581, line: 679, type: !689)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64, align: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiquadsContext", file: !581, line: 124, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BiquadsContext", file: !581, line: 102, size: 1024, align: 64, elements: !692)
!692 = !{!693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !718, !719}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !691, file: !581, line: 103, baseType: !178, size: 64, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !691, file: !581, line: 105, baseType: !580, size: 32, align: 32, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "width_type", scope: !691, file: !581, line: 106, baseType: !200, size: 32, align: 32, offset: 96)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "poles", scope: !691, file: !581, line: 107, baseType: !200, size: 32, align: 32, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "csg", scope: !691, file: !581, line: 108, baseType: !200, size: 32, align: 32, offset: 160)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !691, file: !581, line: 110, baseType: !210, size: 64, align: 64, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !691, file: !581, line: 111, baseType: !210, size: 64, align: 64, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !691, file: !581, line: 112, baseType: !210, size: 64, align: 64, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !691, file: !581, line: 113, baseType: !317, size: 64, align: 64, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "a0", scope: !691, file: !581, line: 115, baseType: !210, size: 64, align: 64, offset: 448)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !691, file: !581, line: 115, baseType: !210, size: 64, align: 64, offset: 512)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "a2", scope: !691, file: !581, line: 115, baseType: !210, size: 64, align: 64, offset: 576)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !691, file: !581, line: 116, baseType: !210, size: 64, align: 64, offset: 640)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "b1", scope: !691, file: !581, line: 116, baseType: !210, size: 64, align: 64, offset: 704)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "b2", scope: !691, file: !581, line: 116, baseType: !210, size: 64, align: 64, offset: 768)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !691, file: !581, line: 118, baseType: !709, size: 64, align: 64, offset: 832)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64, align: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChanCache", file: !581, line: 100, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChanCache", file: !581, line: 96, size: 320, align: 64, elements: !712)
!712 = !{!713, !714, !715, !716, !717}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !711, file: !581, line: 97, baseType: !210, size: 64, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !711, file: !581, line: 97, baseType: !210, size: 64, align: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "o1", scope: !711, file: !581, line: 98, baseType: !210, size: 64, align: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "o2", scope: !711, file: !581, line: 98, baseType: !210, size: 64, align: 64, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "clippings", scope: !711, file: !581, line: 99, baseType: !200, size: 32, align: 32, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !691, file: !581, line: 119, baseType: !200, size: 32, align: 32, offset: 896)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !691, file: !581, line: 121, baseType: !720, size: 64, align: 64, offset: 960)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64, align: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !723, !724, !191, !200, !507, !507, !507, !507, !210, !210, !210, !210, !210, !475}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!726 = !DILocation(line: 679, column: 303, scope: !684)
!727 = !DILocation(line: 679, column: 307, scope: !684)
!728 = !DILocation(line: 679, column: 312, scope: !684)
!729 = !DILocation(line: 679, column: 318, scope: !684)
!730 = !DILocation(line: 679, column: 321, scope: !684)
!731 = !DILocation(line: 679, column: 327, scope: !684)
!732 = !DILocation(line: 679, column: 347, scope: !684)
!733 = !DILocation(line: 679, column: 350, scope: !684)
!734 = !DILocation(line: 679, column: 362, scope: !684)
!735 = !DILocation(line: 679, column: 387, scope: !684)
!736 = !DILocation(line: 679, column: 382, scope: !684)
!737 = !DILocation(line: 679, column: 375, scope: !684)
!738 = distinct !DISubprogram(name: "uninit", scope: !581, file: !581, line: 607, type: !420, isLocal: true, isDefinition: true, scopeLine: 608, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !647)
!739 = !DILocalVariable(name: "ctx", arg: 1, scope: !738, file: !581, line: 607, type: !173)
!740 = !DILocation(line: 607, column: 59, scope: !738)
!741 = !DILocalVariable(name: "s", scope: !738, file: !581, line: 609, type: !689)
!742 = !DILocation(line: 609, column: 21, scope: !738)
!743 = !DILocation(line: 609, column: 25, scope: !738)
!744 = !DILocation(line: 609, column: 30, scope: !738)
!745 = !DILocation(line: 611, column: 15, scope: !738)
!746 = !DILocation(line: 611, column: 18, scope: !738)
!747 = !DILocation(line: 611, column: 14, scope: !738)
!748 = !DILocation(line: 611, column: 5, scope: !738)
!749 = !DILocation(line: 612, column: 1, scope: !738)
!750 = !DILocalVariable(name: "ctx", arg: 1, scope: !646, file: !581, line: 141, type: !173)
!751 = !DILocation(line: 141, column: 43, scope: !646)
!752 = !DILocalVariable(name: "formats", scope: !646, file: !581, line: 143, type: !525)
!753 = !DILocation(line: 143, column: 22, scope: !646)
!754 = !DILocalVariable(name: "layouts", scope: !646, file: !581, line: 144, type: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterChannelLayouts", file: !528, line: 93, baseType: !542)
!757 = !DILocation(line: 144, column: 29, scope: !646)
!758 = !DILocalVariable(name: "ret", scope: !646, file: !581, line: 152, type: !200)
!759 = !DILocation(line: 152, column: 9, scope: !646)
!760 = !DILocation(line: 154, column: 15, scope: !646)
!761 = !DILocation(line: 154, column: 13, scope: !646)
!762 = !DILocation(line: 155, column: 10, scope: !763)
!763 = distinct !DILexicalBlock(scope: !646, file: !581, line: 155, column: 9)
!764 = !DILocation(line: 155, column: 9, scope: !646)
!765 = !DILocation(line: 156, column: 9, scope: !763)
!766 = !DILocation(line: 157, column: 41, scope: !646)
!767 = !DILocation(line: 157, column: 46, scope: !646)
!768 = !DILocation(line: 157, column: 11, scope: !646)
!769 = !DILocation(line: 157, column: 9, scope: !646)
!770 = !DILocation(line: 158, column: 9, scope: !771)
!771 = distinct !DILexicalBlock(scope: !646, file: !581, line: 158, column: 9)
!772 = !DILocation(line: 158, column: 13, scope: !771)
!773 = !DILocation(line: 158, column: 9, scope: !646)
!774 = !DILocation(line: 159, column: 16, scope: !771)
!775 = !DILocation(line: 159, column: 9, scope: !771)
!776 = !DILocation(line: 161, column: 15, scope: !646)
!777 = !DILocation(line: 161, column: 13, scope: !646)
!778 = !DILocation(line: 162, column: 10, scope: !779)
!779 = distinct !DILexicalBlock(scope: !646, file: !581, line: 162, column: 9)
!780 = !DILocation(line: 162, column: 9, scope: !646)
!781 = !DILocation(line: 163, column: 9, scope: !779)
!782 = !DILocation(line: 164, column: 33, scope: !646)
!783 = !DILocation(line: 164, column: 38, scope: !646)
!784 = !DILocation(line: 164, column: 11, scope: !646)
!785 = !DILocation(line: 164, column: 9, scope: !646)
!786 = !DILocation(line: 165, column: 9, scope: !787)
!787 = distinct !DILexicalBlock(scope: !646, file: !581, line: 165, column: 9)
!788 = !DILocation(line: 165, column: 13, scope: !787)
!789 = !DILocation(line: 165, column: 9, scope: !646)
!790 = !DILocation(line: 166, column: 16, scope: !787)
!791 = !DILocation(line: 166, column: 9, scope: !787)
!792 = !DILocation(line: 168, column: 15, scope: !646)
!793 = !DILocation(line: 168, column: 13, scope: !646)
!794 = !DILocation(line: 169, column: 10, scope: !795)
!795 = distinct !DILexicalBlock(scope: !646, file: !581, line: 169, column: 9)
!796 = !DILocation(line: 169, column: 9, scope: !646)
!797 = !DILocation(line: 170, column: 9, scope: !795)
!798 = !DILocation(line: 171, column: 38, scope: !646)
!799 = !DILocation(line: 171, column: 43, scope: !646)
!800 = !DILocation(line: 171, column: 12, scope: !646)
!801 = !DILocation(line: 171, column: 5, scope: !646)
!802 = !DILocation(line: 172, column: 1, scope: !646)
!803 = distinct !DISubprogram(name: "process_command", scope: !581, file: !581, line: 488, type: !429, isLocal: true, isDefinition: true, scopeLine: 490, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !647)
!804 = !DILocalVariable(name: "ctx", arg: 1, scope: !803, file: !581, line: 488, type: !173)
!805 = !DILocation(line: 488, column: 45, scope: !803)
!806 = !DILocalVariable(name: "cmd", arg: 2, scope: !803, file: !581, line: 488, type: !184)
!807 = !DILocation(line: 488, column: 62, scope: !803)
!808 = !DILocalVariable(name: "args", arg: 3, scope: !803, file: !581, line: 488, type: !184)
!809 = !DILocation(line: 488, column: 79, scope: !803)
!810 = !DILocalVariable(name: "res", arg: 4, scope: !803, file: !581, line: 489, type: !431)
!811 = !DILocation(line: 489, column: 34, scope: !803)
!812 = !DILocalVariable(name: "res_len", arg: 5, scope: !803, file: !581, line: 489, type: !200)
!813 = !DILocation(line: 489, column: 43, scope: !803)
!814 = !DILocalVariable(name: "flags", arg: 6, scope: !803, file: !581, line: 489, type: !200)
!815 = !DILocation(line: 489, column: 56, scope: !803)
!816 = !DILocalVariable(name: "s", scope: !803, file: !581, line: 491, type: !689)
!817 = !DILocation(line: 491, column: 21, scope: !803)
!818 = !DILocation(line: 491, column: 25, scope: !803)
!819 = !DILocation(line: 491, column: 30, scope: !803)
!820 = !DILocalVariable(name: "outlink", scope: !803, file: !581, line: 492, type: !387)
!821 = !DILocation(line: 492, column: 19, scope: !803)
!822 = !DILocation(line: 492, column: 29, scope: !803)
!823 = !DILocation(line: 492, column: 34, scope: !803)
!824 = !DILocation(line: 494, column: 18, scope: !825)
!825 = distinct !DILexicalBlock(scope: !803, file: !581, line: 494, column: 9)
!826 = !DILocation(line: 494, column: 11, scope: !825)
!827 = !DILocation(line: 494, column: 36, scope: !825)
!828 = !DILocation(line: 494, column: 47, scope: !829)
!829 = !DILexicalBlockFile(scope: !825, file: !581, discriminator: 1)
!830 = !DILocation(line: 494, column: 40, scope: !829)
!831 = !DILocation(line: 494, column: 58, scope: !829)
!832 = !DILocation(line: 495, column: 10, scope: !825)
!833 = !DILocation(line: 495, column: 13, scope: !825)
!834 = !DILocation(line: 495, column: 25, scope: !825)
!835 = !DILocation(line: 495, column: 38, scope: !825)
!836 = !DILocation(line: 496, column: 10, scope: !825)
!837 = !DILocation(line: 496, column: 13, scope: !825)
!838 = !DILocation(line: 496, column: 25, scope: !825)
!839 = !DILocation(line: 496, column: 37, scope: !825)
!840 = !DILocation(line: 497, column: 10, scope: !825)
!841 = !DILocation(line: 497, column: 13, scope: !825)
!842 = !DILocation(line: 497, column: 25, scope: !825)
!843 = !DILocation(line: 497, column: 38, scope: !825)
!844 = !DILocation(line: 498, column: 10, scope: !825)
!845 = !DILocation(line: 498, column: 13, scope: !825)
!846 = !DILocation(line: 498, column: 25, scope: !825)
!847 = !DILocation(line: 498, column: 33, scope: !825)
!848 = !DILocation(line: 499, column: 10, scope: !825)
!849 = !DILocation(line: 499, column: 13, scope: !825)
!850 = !DILocation(line: 499, column: 25, scope: !825)
!851 = !DILocation(line: 499, column: 35, scope: !825)
!852 = !DILocation(line: 500, column: 10, scope: !825)
!853 = !DILocation(line: 500, column: 13, scope: !825)
!854 = !DILocation(line: 500, column: 25, scope: !825)
!855 = !DILocation(line: 500, column: 37, scope: !825)
!856 = !DILocation(line: 501, column: 10, scope: !825)
!857 = !DILocation(line: 501, column: 13, scope: !825)
!858 = !DILocation(line: 501, column: 25, scope: !825)
!859 = !DILocation(line: 501, column: 38, scope: !825)
!860 = !DILocation(line: 502, column: 10, scope: !825)
!861 = !DILocation(line: 502, column: 13, scope: !825)
!862 = !DILocation(line: 502, column: 25, scope: !825)
!863 = !DILocation(line: 502, column: 36, scope: !825)
!864 = !DILocation(line: 503, column: 10, scope: !825)
!865 = !DILocation(line: 503, column: 13, scope: !825)
!866 = !DILocation(line: 503, column: 25, scope: !825)
!867 = !DILocation(line: 503, column: 37, scope: !825)
!868 = !DILocation(line: 504, column: 10, scope: !825)
!869 = !DILocation(line: 504, column: 13, scope: !825)
!870 = !DILocation(line: 504, column: 25, scope: !825)
!871 = !DILocation(line: 494, column: 9, scope: !872)
!872 = !DILexicalBlockFile(scope: !803, file: !581, discriminator: 2)
!873 = !DILocalVariable(name: "freq", scope: !874, file: !581, line: 505, type: !210)
!874 = distinct !DILexicalBlock(scope: !825, file: !581, line: 504, column: 38)
!875 = !DILocation(line: 505, column: 16, scope: !874)
!876 = !DILocation(line: 507, column: 20, scope: !877)
!877 = distinct !DILexicalBlock(scope: !874, file: !581, line: 507, column: 13)
!878 = !DILocation(line: 507, column: 13, scope: !877)
!879 = !DILocation(line: 507, column: 40, scope: !877)
!880 = !DILocation(line: 507, column: 13, scope: !874)
!881 = !DILocation(line: 508, column: 20, scope: !882)
!882 = distinct !DILexicalBlock(scope: !877, file: !581, line: 507, column: 46)
!883 = !DILocation(line: 508, column: 13, scope: !882)
!884 = !DILocation(line: 509, column: 13, scope: !882)
!885 = !DILocation(line: 512, column: 24, scope: !874)
!886 = !DILocation(line: 512, column: 9, scope: !874)
!887 = !DILocation(line: 512, column: 12, scope: !874)
!888 = !DILocation(line: 512, column: 22, scope: !874)
!889 = !DILocation(line: 513, column: 5, scope: !874)
!890 = !DILocation(line: 513, column: 25, scope: !891)
!891 = !DILexicalBlockFile(scope: !892, file: !581, discriminator: 1)
!892 = distinct !DILexicalBlock(scope: !825, file: !581, line: 513, column: 16)
!893 = !DILocation(line: 513, column: 18, scope: !891)
!894 = !DILocation(line: 513, column: 38, scope: !891)
!895 = !DILocation(line: 513, column: 49, scope: !896)
!896 = !DILexicalBlockFile(scope: !892, file: !581, discriminator: 2)
!897 = !DILocation(line: 513, column: 42, scope: !896)
!898 = !DILocation(line: 513, column: 60, scope: !896)
!899 = !DILocation(line: 514, column: 10, scope: !892)
!900 = !DILocation(line: 514, column: 13, scope: !892)
!901 = !DILocation(line: 514, column: 25, scope: !892)
!902 = !DILocation(line: 514, column: 38, scope: !892)
!903 = !DILocation(line: 515, column: 10, scope: !892)
!904 = !DILocation(line: 515, column: 13, scope: !892)
!905 = !DILocation(line: 515, column: 25, scope: !892)
!906 = !DILocation(line: 515, column: 37, scope: !892)
!907 = !DILocation(line: 516, column: 10, scope: !892)
!908 = !DILocation(line: 516, column: 13, scope: !892)
!909 = !DILocation(line: 516, column: 25, scope: !892)
!910 = !DILocation(line: 516, column: 38, scope: !892)
!911 = !DILocation(line: 517, column: 10, scope: !892)
!912 = !DILocation(line: 517, column: 13, scope: !892)
!913 = !DILocation(line: 517, column: 25, scope: !892)
!914 = !DILocation(line: 517, column: 33, scope: !892)
!915 = !DILocation(line: 518, column: 10, scope: !892)
!916 = !DILocation(line: 518, column: 13, scope: !892)
!917 = !DILocation(line: 518, column: 25, scope: !892)
!918 = !DILocation(line: 513, column: 16, scope: !919)
!919 = !DILexicalBlockFile(scope: !825, file: !581, discriminator: 3)
!920 = !DILocalVariable(name: "gain", scope: !921, file: !581, line: 519, type: !210)
!921 = distinct !DILexicalBlock(scope: !892, file: !581, line: 518, column: 37)
!922 = !DILocation(line: 519, column: 16, scope: !921)
!923 = !DILocation(line: 521, column: 20, scope: !924)
!924 = distinct !DILexicalBlock(scope: !921, file: !581, line: 521, column: 13)
!925 = !DILocation(line: 521, column: 13, scope: !924)
!926 = !DILocation(line: 521, column: 40, scope: !924)
!927 = !DILocation(line: 521, column: 13, scope: !921)
!928 = !DILocation(line: 522, column: 20, scope: !929)
!929 = distinct !DILexicalBlock(scope: !924, file: !581, line: 521, column: 46)
!930 = !DILocation(line: 522, column: 13, scope: !929)
!931 = !DILocation(line: 523, column: 13, scope: !929)
!932 = !DILocation(line: 526, column: 19, scope: !921)
!933 = !DILocation(line: 526, column: 9, scope: !921)
!934 = !DILocation(line: 526, column: 12, scope: !921)
!935 = !DILocation(line: 526, column: 17, scope: !921)
!936 = !DILocation(line: 527, column: 5, scope: !921)
!937 = !DILocation(line: 527, column: 25, scope: !938)
!938 = !DILexicalBlockFile(scope: !939, file: !581, discriminator: 1)
!939 = distinct !DILexicalBlock(scope: !892, file: !581, line: 527, column: 16)
!940 = !DILocation(line: 527, column: 18, scope: !938)
!941 = !DILocation(line: 527, column: 39, scope: !938)
!942 = !DILocation(line: 527, column: 50, scope: !943)
!943 = !DILexicalBlockFile(scope: !939, file: !581, discriminator: 2)
!944 = !DILocation(line: 527, column: 43, scope: !943)
!945 = !DILocation(line: 527, column: 61, scope: !943)
!946 = !DILocation(line: 528, column: 10, scope: !939)
!947 = !DILocation(line: 528, column: 13, scope: !939)
!948 = !DILocation(line: 528, column: 25, scope: !939)
!949 = !DILocation(line: 528, column: 38, scope: !939)
!950 = !DILocation(line: 529, column: 10, scope: !939)
!951 = !DILocation(line: 529, column: 13, scope: !939)
!952 = !DILocation(line: 529, column: 25, scope: !939)
!953 = !DILocation(line: 529, column: 37, scope: !939)
!954 = !DILocation(line: 530, column: 10, scope: !939)
!955 = !DILocation(line: 530, column: 13, scope: !939)
!956 = !DILocation(line: 530, column: 25, scope: !939)
!957 = !DILocation(line: 530, column: 38, scope: !939)
!958 = !DILocation(line: 531, column: 10, scope: !939)
!959 = !DILocation(line: 531, column: 13, scope: !939)
!960 = !DILocation(line: 531, column: 25, scope: !939)
!961 = !DILocation(line: 531, column: 33, scope: !939)
!962 = !DILocation(line: 532, column: 10, scope: !939)
!963 = !DILocation(line: 532, column: 13, scope: !939)
!964 = !DILocation(line: 532, column: 25, scope: !939)
!965 = !DILocation(line: 532, column: 35, scope: !939)
!966 = !DILocation(line: 533, column: 10, scope: !939)
!967 = !DILocation(line: 533, column: 13, scope: !939)
!968 = !DILocation(line: 533, column: 25, scope: !939)
!969 = !DILocation(line: 533, column: 37, scope: !939)
!970 = !DILocation(line: 534, column: 10, scope: !939)
!971 = !DILocation(line: 534, column: 13, scope: !939)
!972 = !DILocation(line: 534, column: 25, scope: !939)
!973 = !DILocation(line: 534, column: 38, scope: !939)
!974 = !DILocation(line: 535, column: 10, scope: !939)
!975 = !DILocation(line: 535, column: 13, scope: !939)
!976 = !DILocation(line: 535, column: 25, scope: !939)
!977 = !DILocation(line: 535, column: 36, scope: !939)
!978 = !DILocation(line: 536, column: 10, scope: !939)
!979 = !DILocation(line: 536, column: 13, scope: !939)
!980 = !DILocation(line: 536, column: 25, scope: !939)
!981 = !DILocation(line: 536, column: 37, scope: !939)
!982 = !DILocation(line: 537, column: 10, scope: !939)
!983 = !DILocation(line: 537, column: 13, scope: !939)
!984 = !DILocation(line: 537, column: 25, scope: !939)
!985 = !DILocation(line: 527, column: 16, scope: !986)
!986 = !DILexicalBlockFile(scope: !892, file: !581, discriminator: 3)
!987 = !DILocalVariable(name: "width", scope: !988, file: !581, line: 538, type: !210)
!988 = distinct !DILexicalBlock(scope: !939, file: !581, line: 537, column: 38)
!989 = !DILocation(line: 538, column: 16, scope: !988)
!990 = !DILocation(line: 540, column: 20, scope: !991)
!991 = distinct !DILexicalBlock(scope: !988, file: !581, line: 540, column: 13)
!992 = !DILocation(line: 540, column: 13, scope: !991)
!993 = !DILocation(line: 540, column: 41, scope: !991)
!994 = !DILocation(line: 540, column: 13, scope: !988)
!995 = !DILocation(line: 541, column: 20, scope: !996)
!996 = distinct !DILexicalBlock(scope: !991, file: !581, line: 540, column: 47)
!997 = !DILocation(line: 541, column: 13, scope: !996)
!998 = !DILocation(line: 542, column: 13, scope: !996)
!999 = !DILocation(line: 545, column: 20, scope: !988)
!1000 = !DILocation(line: 545, column: 9, scope: !988)
!1001 = !DILocation(line: 545, column: 12, scope: !988)
!1002 = !DILocation(line: 545, column: 18, scope: !988)
!1003 = !DILocation(line: 546, column: 5, scope: !988)
!1004 = !DILocation(line: 546, column: 25, scope: !1005)
!1005 = !DILexicalBlockFile(scope: !1006, file: !581, discriminator: 1)
!1006 = distinct !DILexicalBlock(scope: !939, file: !581, line: 546, column: 16)
!1007 = !DILocation(line: 546, column: 18, scope: !1005)
!1008 = !DILocation(line: 546, column: 44, scope: !1005)
!1009 = !DILocation(line: 546, column: 55, scope: !1010)
!1010 = !DILexicalBlockFile(scope: !1006, file: !581, discriminator: 2)
!1011 = !DILocation(line: 546, column: 48, scope: !1010)
!1012 = !DILocation(line: 546, column: 66, scope: !1010)
!1013 = !DILocation(line: 547, column: 10, scope: !1006)
!1014 = !DILocation(line: 547, column: 13, scope: !1006)
!1015 = !DILocation(line: 547, column: 25, scope: !1006)
!1016 = !DILocation(line: 547, column: 38, scope: !1006)
!1017 = !DILocation(line: 548, column: 10, scope: !1006)
!1018 = !DILocation(line: 548, column: 13, scope: !1006)
!1019 = !DILocation(line: 548, column: 25, scope: !1006)
!1020 = !DILocation(line: 548, column: 37, scope: !1006)
!1021 = !DILocation(line: 549, column: 10, scope: !1006)
!1022 = !DILocation(line: 549, column: 13, scope: !1006)
!1023 = !DILocation(line: 549, column: 25, scope: !1006)
!1024 = !DILocation(line: 549, column: 38, scope: !1006)
!1025 = !DILocation(line: 550, column: 10, scope: !1006)
!1026 = !DILocation(line: 550, column: 13, scope: !1006)
!1027 = !DILocation(line: 550, column: 25, scope: !1006)
!1028 = !DILocation(line: 550, column: 33, scope: !1006)
!1029 = !DILocation(line: 551, column: 10, scope: !1006)
!1030 = !DILocation(line: 551, column: 13, scope: !1006)
!1031 = !DILocation(line: 551, column: 25, scope: !1006)
!1032 = !DILocation(line: 551, column: 35, scope: !1006)
!1033 = !DILocation(line: 552, column: 10, scope: !1006)
!1034 = !DILocation(line: 552, column: 13, scope: !1006)
!1035 = !DILocation(line: 552, column: 25, scope: !1006)
!1036 = !DILocation(line: 552, column: 37, scope: !1006)
!1037 = !DILocation(line: 553, column: 10, scope: !1006)
!1038 = !DILocation(line: 553, column: 13, scope: !1006)
!1039 = !DILocation(line: 553, column: 25, scope: !1006)
!1040 = !DILocation(line: 553, column: 38, scope: !1006)
!1041 = !DILocation(line: 554, column: 10, scope: !1006)
!1042 = !DILocation(line: 554, column: 13, scope: !1006)
!1043 = !DILocation(line: 554, column: 25, scope: !1006)
!1044 = !DILocation(line: 554, column: 36, scope: !1006)
!1045 = !DILocation(line: 555, column: 10, scope: !1006)
!1046 = !DILocation(line: 555, column: 13, scope: !1006)
!1047 = !DILocation(line: 555, column: 25, scope: !1006)
!1048 = !DILocation(line: 555, column: 37, scope: !1006)
!1049 = !DILocation(line: 556, column: 10, scope: !1006)
!1050 = !DILocation(line: 556, column: 13, scope: !1006)
!1051 = !DILocation(line: 556, column: 25, scope: !1006)
!1052 = !DILocation(line: 546, column: 16, scope: !1053)
!1053 = !DILexicalBlockFile(scope: !939, file: !581, discriminator: 3)
!1054 = !DILocalVariable(name: "width_type", scope: !1055, file: !581, line: 557, type: !186)
!1055 = distinct !DILexicalBlock(scope: !1006, file: !581, line: 556, column: 38)
!1056 = !DILocation(line: 557, column: 14, scope: !1055)
!1057 = !DILocation(line: 559, column: 20, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1055, file: !581, line: 559, column: 13)
!1059 = !DILocation(line: 559, column: 13, scope: !1058)
!1060 = !DILocation(line: 559, column: 45, scope: !1058)
!1061 = !DILocation(line: 559, column: 13, scope: !1055)
!1062 = !DILocation(line: 560, column: 20, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1058, file: !581, line: 559, column: 51)
!1064 = !DILocation(line: 560, column: 13, scope: !1063)
!1065 = !DILocation(line: 561, column: 13, scope: !1063)
!1066 = !DILocation(line: 564, column: 17, scope: !1055)
!1067 = !DILocation(line: 564, column: 9, scope: !1055)
!1068 = !DILocation(line: 565, column: 30, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1055, file: !581, line: 564, column: 29)
!1070 = !DILocation(line: 565, column: 39, scope: !1069)
!1071 = !DILocation(line: 566, column: 30, scope: !1069)
!1072 = !DILocation(line: 566, column: 41, scope: !1069)
!1073 = !DILocation(line: 567, column: 30, scope: !1069)
!1074 = !DILocation(line: 567, column: 40, scope: !1069)
!1075 = !DILocation(line: 568, column: 30, scope: !1069)
!1076 = !DILocation(line: 568, column: 39, scope: !1069)
!1077 = !DILocation(line: 569, column: 30, scope: !1069)
!1078 = !DILocation(line: 569, column: 40, scope: !1069)
!1079 = !DILocation(line: 571, column: 20, scope: !1069)
!1080 = !DILocation(line: 571, column: 63, scope: !1069)
!1081 = !DILocation(line: 571, column: 13, scope: !1069)
!1082 = !DILocation(line: 572, column: 13, scope: !1069)
!1083 = !DILocation(line: 575, column: 25, scope: !1055)
!1084 = !DILocation(line: 575, column: 9, scope: !1055)
!1085 = !DILocation(line: 575, column: 12, scope: !1055)
!1086 = !DILocation(line: 575, column: 23, scope: !1055)
!1087 = !DILocation(line: 576, column: 5, scope: !1055)
!1088 = !DILocation(line: 576, column: 25, scope: !1089)
!1089 = !DILexicalBlockFile(scope: !1090, file: !581, discriminator: 1)
!1090 = distinct !DILexicalBlock(scope: !1006, file: !581, line: 576, column: 16)
!1091 = !DILocation(line: 576, column: 18, scope: !1089)
!1092 = !DILocation(line: 576, column: 36, scope: !1089)
!1093 = !DILocation(line: 577, column: 25, scope: !1090)
!1094 = !DILocation(line: 577, column: 18, scope: !1090)
!1095 = !DILocation(line: 577, column: 36, scope: !1090)
!1096 = !DILocation(line: 578, column: 25, scope: !1090)
!1097 = !DILocation(line: 578, column: 18, scope: !1090)
!1098 = !DILocation(line: 578, column: 36, scope: !1090)
!1099 = !DILocation(line: 579, column: 25, scope: !1090)
!1100 = !DILocation(line: 579, column: 18, scope: !1090)
!1101 = !DILocation(line: 579, column: 36, scope: !1090)
!1102 = !DILocation(line: 580, column: 25, scope: !1090)
!1103 = !DILocation(line: 580, column: 18, scope: !1090)
!1104 = !DILocation(line: 580, column: 36, scope: !1090)
!1105 = !DILocation(line: 581, column: 25, scope: !1090)
!1106 = !DILocation(line: 581, column: 18, scope: !1090)
!1107 = !DILocation(line: 581, column: 37, scope: !1090)
!1108 = !DILocation(line: 582, column: 16, scope: !1090)
!1109 = !DILocation(line: 582, column: 19, scope: !1090)
!1110 = !DILocation(line: 582, column: 31, scope: !1090)
!1111 = !DILocation(line: 576, column: 16, scope: !1010)
!1112 = !DILocalVariable(name: "value", scope: !1113, file: !581, line: 583, type: !210)
!1113 = distinct !DILexicalBlock(scope: !1090, file: !581, line: 582, column: 42)
!1114 = !DILocation(line: 583, column: 16, scope: !1113)
!1115 = !DILocation(line: 585, column: 20, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1113, file: !581, line: 585, column: 13)
!1117 = !DILocation(line: 585, column: 13, scope: !1116)
!1118 = !DILocation(line: 585, column: 41, scope: !1116)
!1119 = !DILocation(line: 585, column: 13, scope: !1113)
!1120 = !DILocation(line: 586, column: 20, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1116, file: !581, line: 585, column: 47)
!1122 = !DILocation(line: 586, column: 13, scope: !1121)
!1123 = !DILocation(line: 587, column: 13, scope: !1121)
!1124 = !DILocation(line: 590, column: 21, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1113, file: !581, line: 590, column: 13)
!1126 = !DILocation(line: 590, column: 14, scope: !1125)
!1127 = !DILocation(line: 590, column: 13, scope: !1113)
!1128 = !DILocation(line: 591, column: 21, scope: !1125)
!1129 = !DILocation(line: 591, column: 13, scope: !1125)
!1130 = !DILocation(line: 591, column: 16, scope: !1125)
!1131 = !DILocation(line: 591, column: 19, scope: !1125)
!1132 = !DILocation(line: 592, column: 26, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1125, file: !581, line: 592, column: 18)
!1134 = !DILocation(line: 592, column: 19, scope: !1133)
!1135 = !DILocation(line: 592, column: 18, scope: !1125)
!1136 = !DILocation(line: 593, column: 21, scope: !1133)
!1137 = !DILocation(line: 593, column: 13, scope: !1133)
!1138 = !DILocation(line: 593, column: 16, scope: !1133)
!1139 = !DILocation(line: 593, column: 19, scope: !1133)
!1140 = !DILocation(line: 594, column: 26, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1133, file: !581, line: 594, column: 18)
!1142 = !DILocation(line: 594, column: 19, scope: !1141)
