; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--vf_signalstats.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--vf_signalstats.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFilterPad = type { i8*, i32, %struct.AVFrame* (%struct.AVFilterLink*, i32, i32)*, %struct.AVFrame* (%struct.AVFilterLink*, i32)*, i32 (%struct.AVFilterLink*, %struct.AVFrame*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32, i32 }
%struct.AVFrame = type { [8 x i8*], [8 x i32], i8**, i32, i32, i32, i32, i32, i32, %struct.AVRational, i64, i64, i64, i32, i32, i32, i8*, [8 x i64], i32, i32, i32, i32, i64, i32, i64, [8 x %struct.AVBufferRef*], %struct.AVBufferRef**, i32, %struct.AVFrameSideData**, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, %struct.AVDictionary*, i32, i32, i32, i8*, i32, i32, %struct.AVBufferRef*, %struct.AVBufferRef*, %struct.AVBufferRef*, i64, i64, i64, i64, %struct.AVBufferRef* }
%struct.AVRational = type { i32, i32 }
%struct.AVFrameSideData = type { i32, i8*, i32, %struct.AVDictionary*, %struct.AVBufferRef* }
%struct.AVDictionary = type opaque
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !48, line: 538, size: 32, align: 32, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!118 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!119 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!120 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!121 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!122 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!123 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!124 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVOptionType", file: !126, line: 221, size: 32, align: 32, elements: !127)
!126 = !DIFile(filename: "./libavutil/opt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146}
!128 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!129 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!130 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!131 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!132 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!133 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!134 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!135 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!136 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!137 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!138 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!139 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!140 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!141 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!142 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!143 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!144 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!145 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!146 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !148, line: 29, size: 32, align: 32, elements: !149)
!148 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167}
!150 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!151 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!152 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!153 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!154 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!155 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!156 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!157 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!158 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!159 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!160 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!161 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!162 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!163 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!164 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!165 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!166 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!167 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !170, file: !169, line: 503, size: 32, align: 32, elements: !575)
!169 = !DIFile(filename: "libavfilter/avfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterLink", file: !169, line: 439, size: 493504, align: 64, elements: !171)
!171 = !{!172, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !536, !537, !538, !539, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !170, file: !169, line: 440, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterContext", file: !169, line: 67, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterContext", file: !169, line: 338, size: 1344, align: 64, elements: !176)
!176 = !{!177, !264, !436, !437, !439, !441, !443, !444, !445, !446, !447, !487, !488, !494, !503, !504, !505, !507, !508, !509, !510, !511}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !175, file: !169, line: 339, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !148, line: 143, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !148, line: 67, size: 640, align: 64, elements: !182)
!182 = !{!183, !187, !192, !223, !224, !225, !226, !230, !236, !238, !242}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !181, file: !148, line: 72, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !181, file: !148, line: 78, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!184, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !181, file: !148, line: 85, baseType: !193, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !126, line: 246, size: 512, align: 64, elements: !196)
!196 = !{!197, !198, !199, !201, !202, !219, !220, !221, !222}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !126, line: 247, baseType: !184, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !195, file: !126, line: 253, baseType: !184, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !195, file: !126, line: 259, baseType: !200, size: 32, align: 32, offset: 128)
!200 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !126, line: 260, baseType: !125, size: 32, align: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !195, file: !126, line: 271, baseType: !203, size: 64, align: 64, offset: 192)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !195, file: !126, line: 265, size: 64, align: 64, elements: !204)
!204 = !{!205, !209, !211, !212}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !203, file: !126, line: 266, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !207, line: 40, baseType: !208)
!207 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!208 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !203, file: !126, line: 267, baseType: !210, size: 64, align: 64)
!210 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !203, file: !126, line: 268, baseType: !184, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !203, file: !126, line: 270, baseType: !213, size: 64, align: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !214, line: 61, baseType: !215)
!214 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !214, line: 58, size: 64, align: 32, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !215, file: !214, line: 59, baseType: !200, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !215, file: !214, line: 60, baseType: !200, size: 32, align: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !195, file: !126, line: 272, baseType: !210, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !195, file: !126, line: 273, baseType: !210, size: 64, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !195, file: !126, line: 275, baseType: !200, size: 32, align: 32, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !195, file: !126, line: 300, baseType: !184, size: 64, align: 64, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !181, file: !148, line: 93, baseType: !200, size: 32, align: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !181, file: !148, line: 99, baseType: !200, size: 32, align: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !181, file: !148, line: 108, baseType: !200, size: 32, align: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !181, file: !148, line: 113, baseType: !227, size: 64, align: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!191, !191, !191}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !181, file: !148, line: 123, baseType: !231, size: 64, align: 64, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!234, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !181, file: !148, line: 130, baseType: !237, size: 32, align: 32, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !148, line: 48, baseType: !147)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !181, file: !148, line: 136, baseType: !239, size: 64, align: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!237, !191}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !181, file: !148, line: 142, baseType: !243, size: 64, align: 64, offset: 576)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!200, !246, !191, !184, !200}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !126, line: 329, size: 128, align: 64, elements: !249)
!249 = !{!250, !262, !263}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !248, file: !126, line: 360, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !126, line: 324, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !126, line: 306, size: 384, align: 64, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !254, file: !126, line: 307, baseType: !184, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !254, file: !126, line: 313, baseType: !210, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !254, file: !126, line: 313, baseType: !210, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !254, file: !126, line: 318, baseType: !210, size: 64, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !254, file: !126, line: 318, baseType: !210, size: 64, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !254, file: !126, line: 323, baseType: !200, size: 32, align: 32, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !248, file: !126, line: 364, baseType: !200, size: 32, align: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !248, file: !126, line: 368, baseType: !200, size: 32, align: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !175, file: !169, line: 341, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilter", file: !169, line: 328, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilter", file: !169, line: 144, size: 1024, align: 64, elements: !269)
!269 = !{!270, !271, !272, !404, !405, !406, !407, !411, !412, !417, !421, !422, !423, !424, !426, !431, !435}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !169, line: 148, baseType: !184, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !268, file: !169, line: 155, baseType: !184, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !268, file: !169, line: 164, baseType: !273, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterPad", file: !169, line: 69, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterPad", file: !277, line: 54, size: 576, align: 64, elements: !278)
!277 = !DIFile(filename: "libavfilter/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!278 = !{!279, !280, !281, !388, !392, !396, !400, !401, !402, !403}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !277, line: 60, baseType: !184, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !276, file: !277, line: 65, baseType: !3, size: 32, align: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "get_video_buffer", scope: !276, file: !277, line: 73, baseType: !282, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!285, !386, !200, !200}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !24, line: 646, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !24, line: 268, size: 4288, align: 64, elements: !288)
!288 = !{!289, !296, !298, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !318, !319, !320, !321, !322, !323, !324, !325, !338, !340, !341, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !374, !375, !376, !377, !378, !379, !382, !383, !384, !385}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !287, file: !24, line: 282, baseType: !290, size: 512, align: 64)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 512, align: 64, elements: !294)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !207, line: 48, baseType: !293)
!293 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!294 = !{!295}
!295 = !DISubrange(count: 8)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !287, file: !24, line: 299, baseType: !297, size: 256, align: 32, offset: 512)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 256, align: 32, elements: !294)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !287, file: !24, line: 315, baseType: !299, size: 64, align: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !287, file: !24, line: 326, baseType: !200, size: 32, align: 32, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !287, file: !24, line: 326, baseType: !200, size: 32, align: 32, offset: 864)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !287, file: !24, line: 334, baseType: !200, size: 32, align: 32, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !287, file: !24, line: 341, baseType: !200, size: 32, align: 32, offset: 928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !287, file: !24, line: 346, baseType: !200, size: 32, align: 32, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !287, file: !24, line: 351, baseType: !13, size: 32, align: 32, offset: 992)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !287, file: !24, line: 356, baseType: !213, size: 64, align: 32, offset: 1024)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !287, file: !24, line: 361, baseType: !206, size: 64, align: 64, offset: 1088)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !287, file: !24, line: 369, baseType: !206, size: 64, align: 64, offset: 1152)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !287, file: !24, line: 377, baseType: !206, size: 64, align: 64, offset: 1216)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !287, file: !24, line: 382, baseType: !200, size: 32, align: 32, offset: 1280)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !287, file: !24, line: 386, baseType: !200, size: 32, align: 32, offset: 1312)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !287, file: !24, line: 391, baseType: !200, size: 32, align: 32, offset: 1344)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !287, file: !24, line: 396, baseType: !191, size: 64, align: 64, offset: 1408)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !287, file: !24, line: 403, baseType: !315, size: 512, align: 64, offset: 1472)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 512, align: 64, elements: !294)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !207, line: 55, baseType: !317)
!317 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !287, file: !24, line: 410, baseType: !200, size: 32, align: 32, offset: 1984)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !287, file: !24, line: 415, baseType: !200, size: 32, align: 32, offset: 2016)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !287, file: !24, line: 420, baseType: !200, size: 32, align: 32, offset: 2048)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !287, file: !24, line: 425, baseType: !200, size: 32, align: 32, offset: 2080)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !287, file: !24, line: 435, baseType: !206, size: 64, align: 64, offset: 2112)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !287, file: !24, line: 440, baseType: !200, size: 32, align: 32, offset: 2176)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !287, file: !24, line: 445, baseType: !316, size: 64, align: 64, offset: 2240)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !287, file: !24, line: 459, baseType: !326, size: 512, align: 64, offset: 2304)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 512, align: 64, elements: !294)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !329, line: 94, baseType: !330)
!329 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !329, line: 81, size: 192, align: 64, elements: !331)
!331 = !{!332, !336, !337}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !330, file: !329, line: 82, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !329, line: 73, baseType: !335)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !329, line: 73, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !330, file: !329, line: 89, baseType: !291, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !330, file: !329, line: 93, baseType: !200, size: 32, align: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !287, file: !24, line: 473, baseType: !339, size: 64, align: 64, offset: 2816)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !287, file: !24, line: 477, baseType: !200, size: 32, align: 32, offset: 2880)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !287, file: !24, line: 479, baseType: !342, size: 64, align: 64, offset: 2944)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !24, line: 207, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !24, line: 201, size: 320, align: 64, elements: !346)
!346 = !{!347, !348, !349, !350, !355}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !345, file: !24, line: 202, baseType: !23, size: 32, align: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !345, file: !24, line: 203, baseType: !291, size: 64, align: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !345, file: !24, line: 204, baseType: !200, size: 32, align: 32, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !345, file: !24, line: 205, baseType: !351, size: 64, align: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !353, line: 86, baseType: !354)
!353 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !353, line: 86, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !345, file: !24, line: 206, baseType: !327, size: 64, align: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !287, file: !24, line: 480, baseType: !200, size: 32, align: 32, offset: 3008)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !24, line: 505, baseType: !200, size: 32, align: 32, offset: 3040)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !287, file: !24, line: 512, baseType: !47, size: 32, align: 32, offset: 3072)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !287, file: !24, line: 514, baseType: !54, size: 32, align: 32, offset: 3104)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !287, file: !24, line: 516, baseType: !72, size: 32, align: 32, offset: 3136)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !287, file: !24, line: 523, baseType: !96, size: 32, align: 32, offset: 3168)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !287, file: !24, line: 525, baseType: !115, size: 32, align: 32, offset: 3200)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !287, file: !24, line: 532, baseType: !206, size: 64, align: 64, offset: 3264)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !287, file: !24, line: 539, baseType: !206, size: 64, align: 64, offset: 3328)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !287, file: !24, line: 547, baseType: !206, size: 64, align: 64, offset: 3392)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !287, file: !24, line: 554, baseType: !351, size: 64, align: 64, offset: 3456)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !287, file: !24, line: 563, baseType: !200, size: 32, align: 32, offset: 3520)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !287, file: !24, line: 572, baseType: !200, size: 32, align: 32, offset: 3552)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !287, file: !24, line: 581, baseType: !200, size: 32, align: 32, offset: 3584)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !287, file: !24, line: 588, baseType: !371, size: 64, align: 64, offset: 3648)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !207, line: 36, baseType: !373)
!373 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !287, file: !24, line: 593, baseType: !200, size: 32, align: 32, offset: 3712)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !287, file: !24, line: 596, baseType: !200, size: 32, align: 32, offset: 3744)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !287, file: !24, line: 599, baseType: !327, size: 64, align: 64, offset: 3776)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !287, file: !24, line: 605, baseType: !327, size: 64, align: 64, offset: 3840)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !287, file: !24, line: 616, baseType: !327, size: 64, align: 64, offset: 3904)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !287, file: !24, line: 626, baseType: !380, size: 64, align: 64, offset: 3968)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !381, line: 216, baseType: !317)
!381 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!382 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !287, file: !24, line: 627, baseType: !380, size: 64, align: 64, offset: 4032)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !287, file: !24, line: 628, baseType: !380, size: 64, align: 64, offset: 4096)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !287, file: !24, line: 629, baseType: !380, size: 64, align: 64, offset: 4160)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !287, file: !24, line: 645, baseType: !327, size: 64, align: 64, offset: 4224)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterLink", file: !169, line: 68, baseType: !170)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "get_audio_buffer", scope: !276, file: !277, line: 81, baseType: !389, size: 64, align: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!285, !386, !200}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "filter_frame", scope: !276, file: !277, line: 93, baseType: !393, size: 64, align: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!200, !386, !285}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "poll_frame", scope: !276, file: !277, line: 104, baseType: !397, size: 64, align: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!200, !386}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "request_frame", scope: !276, file: !277, line: 113, baseType: !397, size: 64, align: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "config_props", scope: !276, file: !277, line: 129, baseType: !397, size: 64, align: 64, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "needs_fifo", scope: !276, file: !277, line: 137, baseType: !200, size: 32, align: 32, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "needs_writable", scope: !276, file: !277, line: 145, baseType: !200, size: 32, align: 32, offset: 544)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !268, file: !169, line: 172, baseType: !273, size: 64, align: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !268, file: !169, line: 182, baseType: !178, size: 64, align: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !268, file: !169, line: 187, baseType: !200, size: 32, align: 32, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "preinit", scope: !268, file: !169, line: 210, baseType: !408, size: 64, align: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!200, !173}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !268, file: !169, line: 233, baseType: !408, size: 64, align: 64, offset: 448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "init_dict", scope: !268, file: !169, line: 246, baseType: !413, size: 64, align: 64, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!200, !173, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !268, file: !169, line: 258, baseType: !418, size: 64, align: 64, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !173}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "query_formats", scope: !268, file: !169, line: 282, baseType: !408, size: 64, align: 64, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "priv_size", scope: !268, file: !169, line: 284, baseType: !200, size: 32, align: 32, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flags_internal", scope: !268, file: !169, line: 286, baseType: !200, size: 32, align: 32, offset: 736)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !169, line: 292, baseType: !425, size: 64, align: 64, offset: 768)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "process_command", scope: !268, file: !169, line: 306, baseType: !427, size: 64, align: 64, offset: 832)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!200, !173, !184, !184, !430, !200, !200}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "init_opaque", scope: !268, file: !169, line: 313, baseType: !432, size: 64, align: 64, offset: 896)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!200, !173, !191}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !268, file: !169, line: 327, baseType: !408, size: 64, align: 64, offset: 960)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !169, line: 343, baseType: !430, size: 64, align: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "input_pads", scope: !175, file: !169, line: 345, baseType: !438, size: 64, align: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !175, file: !169, line: 346, baseType: !440, size: 64, align: 64, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !175, file: !169, line: 347, baseType: !442, size: 32, align: 32, offset: 320)
!442 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "output_pads", scope: !175, file: !169, line: 349, baseType: !438, size: 64, align: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !175, file: !169, line: 350, baseType: !440, size: 64, align: 64, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "nb_outputs", scope: !175, file: !169, line: 351, baseType: !442, size: 32, align: 32, offset: 512)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !175, file: !169, line: 353, baseType: !191, size: 64, align: 64, offset: 576)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !175, file: !169, line: 355, baseType: !448, size: 64, align: 64, offset: 640)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraph", file: !169, line: 840, size: 768, align: 64, elements: !450)
!450 = !{!451, !452, !454, !455, !456, !457, !458, !459, !481, !482, !483, !484, !485, !486}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !449, file: !169, line: 841, baseType: !178, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !449, file: !169, line: 842, baseType: !453, size: 64, align: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "nb_filters", scope: !449, file: !169, line: 843, baseType: !442, size: 32, align: 32, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "scale_sws_opts", scope: !449, file: !169, line: 845, baseType: !430, size: 64, align: 64, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "resample_lavr_opts", scope: !449, file: !169, line: 847, baseType: !430, size: 64, align: 64, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !449, file: !169, line: 862, baseType: !200, size: 32, align: 32, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !449, file: !169, line: 869, baseType: !200, size: 32, align: 32, offset: 352)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !449, file: !169, line: 874, baseType: !460, size: 64, align: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterGraphInternal", file: !169, line: 809, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraphInternal", file: !277, line: 148, size: 192, align: 64, elements: !463)
!463 = !{!464, !465, !475}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !462, file: !277, line: 149, baseType: !191, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "thread_execute", scope: !462, file: !277, line: 150, baseType: !466, size: 64, align: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_execute_func", file: !169, line: 837, baseType: !468)
!468 = !DISubroutineType(types: !469)
!469 = !{!200, !173, !470, !191, !474, !200}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_action_func", file: !169, line: 823, baseType: !472)
!472 = !DISubroutineType(types: !473)
!473 = !{!200, !173, !191, !200, !200}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "frame_queues", scope: !462, file: !277, line: 151, baseType: !476, size: 8, align: 8, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameQueueGlobal", file: !477, line: 48, baseType: !478)
!477 = !DIFile(filename: "libavfilter/framequeue.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameQueueGlobal", file: !477, line: 46, size: 8, align: 8, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !478, file: !477, line: 47, baseType: !186, size: 8, align: 8)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !449, file: !169, line: 881, baseType: !191, size: 64, align: 64, offset: 448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !449, file: !169, line: 895, baseType: !466, size: 64, align: 64, offset: 512)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "aresample_swr_opts", scope: !449, file: !169, line: 897, baseType: !430, size: 64, align: 64, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links", scope: !449, file: !169, line: 906, baseType: !440, size: 64, align: 64, offset: 640)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links_count", scope: !449, file: !169, line: 907, baseType: !200, size: 32, align: 32, offset: 704)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "disable_auto_convert", scope: !449, file: !169, line: 909, baseType: !442, size: 32, align: 32, offset: 736)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !175, file: !169, line: 373, baseType: !200, size: 32, align: 32, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !175, file: !169, line: 378, baseType: !489, size: 64, align: 64, offset: 768)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterInternal", file: !169, line: 335, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterInternal", file: !277, line: 154, size: 64, align: 64, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !491, file: !277, line: 155, baseType: !466, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "command_queue", scope: !175, file: !169, line: 380, baseType: !495, size: 64, align: 64, offset: 832)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterCommand", file: !277, line: 38, size: 320, align: 64, elements: !497)
!497 = !{!498, !499, !500, !501, !502}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !496, file: !277, line: 39, baseType: !210, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !496, file: !277, line: 40, baseType: !430, size: 64, align: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !496, file: !277, line: 41, baseType: !430, size: 64, align: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !496, file: !277, line: 42, baseType: !200, size: 32, align: 32, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !277, line: 43, baseType: !495, size: 64, align: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "enable_str", scope: !175, file: !169, line: 382, baseType: !430, size: 64, align: 64, offset: 896)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !175, file: !169, line: 383, baseType: !191, size: 64, align: 64, offset: 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "var_values", scope: !175, file: !169, line: 384, baseType: !506, size: 64, align: 64, offset: 1024)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "is_disabled", scope: !175, file: !169, line: 385, baseType: !200, size: 32, align: 32, offset: 1088)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !175, file: !169, line: 394, baseType: !327, size: 64, align: 64, offset: 1152)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !175, file: !169, line: 401, baseType: !200, size: 32, align: 32, offset: 1216)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !175, file: !169, line: 408, baseType: !442, size: 32, align: 32, offset: 1248)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !175, file: !169, line: 424, baseType: !200, size: 32, align: 32, offset: 1280)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "srcpad", scope: !170, file: !169, line: 441, baseType: !438, size: 64, align: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !170, file: !169, line: 443, baseType: !173, size: 64, align: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dstpad", scope: !170, file: !169, line: 444, baseType: !438, size: 64, align: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !169, line: 446, baseType: !3, size: 32, align: 32, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !170, file: !169, line: 449, baseType: !200, size: 32, align: 32, offset: 288)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !170, file: !169, line: 450, baseType: !200, size: 32, align: 32, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !170, file: !169, line: 451, baseType: !213, size: 64, align: 32, offset: 352)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !170, file: !169, line: 453, baseType: !316, size: 64, align: 64, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !170, file: !169, line: 454, baseType: !200, size: 32, align: 32, offset: 512)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !170, file: !169, line: 456, baseType: !200, size: 32, align: 32, offset: 544)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !170, file: !169, line: 465, baseType: !213, size: 64, align: 32, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "in_formats", scope: !170, file: !169, line: 481, baseType: !524, size: 64, align: 64, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterFormats", file: !169, line: 70, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterFormats", file: !527, line: 64, size: 256, align: 64, elements: !528)
!527 = !DIFile(filename: "libavfilter/formats.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!528 = !{!529, !530, !531, !532}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nb_formats", scope: !526, file: !527, line: 65, baseType: !442, size: 32, align: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !526, file: !527, line: 66, baseType: !474, size: 64, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !526, file: !527, line: 68, baseType: !442, size: 32, align: 32, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !526, file: !527, line: 69, baseType: !533, size: 64, align: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "out_formats", scope: !170, file: !169, line: 482, baseType: !524, size: 64, align: 64, offset: 704)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "in_samplerates", scope: !170, file: !169, line: 488, baseType: !524, size: 64, align: 64, offset: 768)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "out_samplerates", scope: !170, file: !169, line: 489, baseType: !524, size: 64, align: 64, offset: 832)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "in_channel_layouts", scope: !170, file: !169, line: 490, baseType: !540, size: 64, align: 64, offset: 896)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterChannelLayouts", file: !527, line: 85, size: 256, align: 64, elements: !542)
!542 = !{!543, !545, !546, !547, !548, !549}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !541, file: !527, line: 86, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "nb_channel_layouts", scope: !541, file: !527, line: 87, baseType: !200, size: 32, align: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "all_layouts", scope: !541, file: !527, line: 88, baseType: !186, size: 8, align: 8, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "all_counts", scope: !541, file: !527, line: 89, baseType: !186, size: 8, align: 8, offset: 104)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !541, file: !527, line: 91, baseType: !442, size: 32, align: 32, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !541, file: !527, line: 92, baseType: !550, size: 64, align: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "out_channel_layouts", scope: !170, file: !169, line: 491, baseType: !540, size: 64, align: 64, offset: 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "request_samples", scope: !170, file: !169, line: 500, baseType: !200, size: 32, align: 32, offset: 1024)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !170, file: !169, line: 507, baseType: !168, size: 32, align: 32, offset: 1056)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !170, file: !169, line: 512, baseType: !448, size: 64, align: 64, offset: 1088)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts", scope: !170, file: !169, line: 518, baseType: !206, size: 64, align: 64, offset: 1152)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts_us", scope: !170, file: !169, line: 524, baseType: !206, size: 64, align: 64, offset: 1216)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "age_index", scope: !170, file: !169, line: 529, baseType: !200, size: 32, align: 32, offset: 1280)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !170, file: !169, line: 542, baseType: !213, size: 64, align: 32, offset: 1312)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf", scope: !170, file: !169, line: 547, baseType: !285, size: 64, align: 64, offset: 1408)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf_size", scope: !170, file: !169, line: 553, baseType: !200, size: 32, align: 32, offset: 1472)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "min_samples", scope: !170, file: !169, line: 562, baseType: !200, size: 32, align: 32, offset: 1504)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "max_samples", scope: !170, file: !169, line: 568, baseType: !200, size: 32, align: 32, offset: 1536)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !170, file: !169, line: 573, baseType: !200, size: 32, align: 32, offset: 1568)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !170, file: !169, line: 578, baseType: !442, size: 32, align: 32, offset: 1600)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_in", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1664)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_out", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1728)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pool", scope: !170, file: !169, line: 588, baseType: !191, size: 64, align: 64, offset: 1792)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "frame_wanted_out", scope: !170, file: !169, line: 595, baseType: !200, size: 32, align: 32, offset: 1856)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !170, file: !169, line: 601, baseType: !327, size: 64, align: 64, offset: 1920)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !170, file: !169, line: 610, baseType: !572, size: 491520, align: 8, offset: 1984)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 491520, align: 8, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 61440)
!575 = !{!576, !577, !578}
!576 = !DIEnumerator(name: "AVLINK_UNINIT", value: 0)
!577 = !DIEnumerator(name: "AVLINK_STARTINIT", value: 1)
!578 = !DIEnumerator(name: "AVLINK_INIT", value: 2)
!579 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FilterMode", file: !580, line: 28, size: 32, align: 32, elements: !581)
!580 = !DIFile(filename: "libavfilter/vf_signalstats.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!581 = !{!582, !583, !584, !585, !586}
!582 = !DIEnumerator(name: "FILTER_NONE", value: -1)
!583 = !DIEnumerator(name: "FILTER_TOUT", value: 0)
!584 = !DIEnumerator(name: "FILTER_VREP", value: 1)
!585 = !DIEnumerator(name: "FILTER_BRNG", value: 2)
!586 = !DIEnumerator(name: "FILT_NUMB", value: 3)
!587 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPixelFormat", file: !48, line: 64, size: 32, align: 32, elements: !588)
!588 = !{!589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785}
!589 = !DIEnumerator(name: "AV_PIX_FMT_NONE", value: -1)
!590 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P", value: 0)
!591 = !DIEnumerator(name: "AV_PIX_FMT_YUYV422", value: 1)
!592 = !DIEnumerator(name: "AV_PIX_FMT_RGB24", value: 2)
!593 = !DIEnumerator(name: "AV_PIX_FMT_BGR24", value: 3)
!594 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P", value: 4)
!595 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P", value: 5)
!596 = !DIEnumerator(name: "AV_PIX_FMT_YUV410P", value: 6)
!597 = !DIEnumerator(name: "AV_PIX_FMT_YUV411P", value: 7)
!598 = !DIEnumerator(name: "AV_PIX_FMT_GRAY8", value: 8)
!599 = !DIEnumerator(name: "AV_PIX_FMT_MONOWHITE", value: 9)
!600 = !DIEnumerator(name: "AV_PIX_FMT_MONOBLACK", value: 10)
!601 = !DIEnumerator(name: "AV_PIX_FMT_PAL8", value: 11)
!602 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ420P", value: 12)
!603 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ422P", value: 13)
!604 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ444P", value: 14)
!605 = !DIEnumerator(name: "AV_PIX_FMT_UYVY422", value: 15)
!606 = !DIEnumerator(name: "AV_PIX_FMT_UYYVYY411", value: 16)
!607 = !DIEnumerator(name: "AV_PIX_FMT_BGR8", value: 17)
!608 = !DIEnumerator(name: "AV_PIX_FMT_BGR4", value: 18)
!609 = !DIEnumerator(name: "AV_PIX_FMT_BGR4_BYTE", value: 19)
!610 = !DIEnumerator(name: "AV_PIX_FMT_RGB8", value: 20)
!611 = !DIEnumerator(name: "AV_PIX_FMT_RGB4", value: 21)
!612 = !DIEnumerator(name: "AV_PIX_FMT_RGB4_BYTE", value: 22)
!613 = !DIEnumerator(name: "AV_PIX_FMT_NV12", value: 23)
!614 = !DIEnumerator(name: "AV_PIX_FMT_NV21", value: 24)
!615 = !DIEnumerator(name: "AV_PIX_FMT_ARGB", value: 25)
!616 = !DIEnumerator(name: "AV_PIX_FMT_RGBA", value: 26)
!617 = !DIEnumerator(name: "AV_PIX_FMT_ABGR", value: 27)
!618 = !DIEnumerator(name: "AV_PIX_FMT_BGRA", value: 28)
!619 = !DIEnumerator(name: "AV_PIX_FMT_GRAY16BE", value: 29)
!620 = !DIEnumerator(name: "AV_PIX_FMT_GRAY16LE", value: 30)
!621 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P", value: 31)
!622 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ440P", value: 32)
!623 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P", value: 33)
!624 = !DIEnumerator(name: "AV_PIX_FMT_RGB48BE", value: 34)
!625 = !DIEnumerator(name: "AV_PIX_FMT_RGB48LE", value: 35)
!626 = !DIEnumerator(name: "AV_PIX_FMT_RGB565BE", value: 36)
!627 = !DIEnumerator(name: "AV_PIX_FMT_RGB565LE", value: 37)
!628 = !DIEnumerator(name: "AV_PIX_FMT_RGB555BE", value: 38)
!629 = !DIEnumerator(name: "AV_PIX_FMT_RGB555LE", value: 39)
!630 = !DIEnumerator(name: "AV_PIX_FMT_BGR565BE", value: 40)
!631 = !DIEnumerator(name: "AV_PIX_FMT_BGR565LE", value: 41)
!632 = !DIEnumerator(name: "AV_PIX_FMT_BGR555BE", value: 42)
!633 = !DIEnumerator(name: "AV_PIX_FMT_BGR555LE", value: 43)
!634 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_MOCO", value: 44)
!635 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_IDCT", value: 45)
!636 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_VLD", value: 46)
!637 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI", value: 46)
!638 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P16LE", value: 47)
!639 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P16BE", value: 48)
!640 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P16LE", value: 49)
!641 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P16BE", value: 50)
!642 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P16LE", value: 51)
!643 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P16BE", value: 52)
!644 = !DIEnumerator(name: "AV_PIX_FMT_DXVA2_VLD", value: 53)
!645 = !DIEnumerator(name: "AV_PIX_FMT_RGB444LE", value: 54)
!646 = !DIEnumerator(name: "AV_PIX_FMT_RGB444BE", value: 55)
!647 = !DIEnumerator(name: "AV_PIX_FMT_BGR444LE", value: 56)
!648 = !DIEnumerator(name: "AV_PIX_FMT_BGR444BE", value: 57)
!649 = !DIEnumerator(name: "AV_PIX_FMT_YA8", value: 58)
!650 = !DIEnumerator(name: "AV_PIX_FMT_Y400A", value: 58)
!651 = !DIEnumerator(name: "AV_PIX_FMT_GRAY8A", value: 58)
!652 = !DIEnumerator(name: "AV_PIX_FMT_BGR48BE", value: 59)
!653 = !DIEnumerator(name: "AV_PIX_FMT_BGR48LE", value: 60)
!654 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P9BE", value: 61)
!655 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P9LE", value: 62)
!656 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P10BE", value: 63)
!657 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P10LE", value: 64)
!658 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P10BE", value: 65)
!659 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P10LE", value: 66)
!660 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P9BE", value: 67)
!661 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P9LE", value: 68)
!662 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P10BE", value: 69)
!663 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P10LE", value: 70)
!664 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P9BE", value: 71)
!665 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P9LE", value: 72)
!666 = !DIEnumerator(name: "AV_PIX_FMT_GBRP", value: 73)
!667 = !DIEnumerator(name: "AV_PIX_FMT_GBR24P", value: 73)
!668 = !DIEnumerator(name: "AV_PIX_FMT_GBRP9BE", value: 74)
!669 = !DIEnumerator(name: "AV_PIX_FMT_GBRP9LE", value: 75)
!670 = !DIEnumerator(name: "AV_PIX_FMT_GBRP10BE", value: 76)
!671 = !DIEnumerator(name: "AV_PIX_FMT_GBRP10LE", value: 77)
!672 = !DIEnumerator(name: "AV_PIX_FMT_GBRP16BE", value: 78)
!673 = !DIEnumerator(name: "AV_PIX_FMT_GBRP16LE", value: 79)
!674 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P", value: 80)
!675 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P", value: 81)
!676 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P9BE", value: 82)
!677 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P9LE", value: 83)
!678 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P9BE", value: 84)
!679 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P9LE", value: 85)
!680 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P9BE", value: 86)
!681 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P9LE", value: 87)
!682 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P10BE", value: 88)
!683 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P10LE", value: 89)
!684 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P10BE", value: 90)
!685 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P10LE", value: 91)
!686 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P10BE", value: 92)
!687 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P10LE", value: 93)
!688 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P16BE", value: 94)
!689 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P16LE", value: 95)
!690 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P16BE", value: 96)
!691 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P16LE", value: 97)
!692 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P16BE", value: 98)
!693 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P16LE", value: 99)
!694 = !DIEnumerator(name: "AV_PIX_FMT_VDPAU", value: 100)
!695 = !DIEnumerator(name: "AV_PIX_FMT_XYZ12LE", value: 101)
!696 = !DIEnumerator(name: "AV_PIX_FMT_XYZ12BE", value: 102)
!697 = !DIEnumerator(name: "AV_PIX_FMT_NV16", value: 103)
!698 = !DIEnumerator(name: "AV_PIX_FMT_NV20LE", value: 104)
!699 = !DIEnumerator(name: "AV_PIX_FMT_NV20BE", value: 105)
!700 = !DIEnumerator(name: "AV_PIX_FMT_RGBA64BE", value: 106)
!701 = !DIEnumerator(name: "AV_PIX_FMT_RGBA64LE", value: 107)
!702 = !DIEnumerator(name: "AV_PIX_FMT_BGRA64BE", value: 108)
!703 = !DIEnumerator(name: "AV_PIX_FMT_BGRA64LE", value: 109)
!704 = !DIEnumerator(name: "AV_PIX_FMT_YVYU422", value: 110)
!705 = !DIEnumerator(name: "AV_PIX_FMT_YA16BE", value: 111)
!706 = !DIEnumerator(name: "AV_PIX_FMT_YA16LE", value: 112)
!707 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP", value: 113)
!708 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP16BE", value: 114)
!709 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP16LE", value: 115)
!710 = !DIEnumerator(name: "AV_PIX_FMT_QSV", value: 116)
!711 = !DIEnumerator(name: "AV_PIX_FMT_MMAL", value: 117)
!712 = !DIEnumerator(name: "AV_PIX_FMT_D3D11VA_VLD", value: 118)
!713 = !DIEnumerator(name: "AV_PIX_FMT_CUDA", value: 119)
!714 = !DIEnumerator(name: "AV_PIX_FMT_0RGB", value: 120)
!715 = !DIEnumerator(name: "AV_PIX_FMT_RGB0", value: 121)
!716 = !DIEnumerator(name: "AV_PIX_FMT_0BGR", value: 122)
!717 = !DIEnumerator(name: "AV_PIX_FMT_BGR0", value: 123)
!718 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P12BE", value: 124)
!719 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P12LE", value: 125)
!720 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P14BE", value: 126)
!721 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P14LE", value: 127)
!722 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P12BE", value: 128)
!723 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P12LE", value: 129)
!724 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P14BE", value: 130)
!725 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P14LE", value: 131)
!726 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P12BE", value: 132)
!727 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P12LE", value: 133)
!728 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P14BE", value: 134)
!729 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P14LE", value: 135)
!730 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12BE", value: 136)
!731 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12LE", value: 137)
!732 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14BE", value: 138)
!733 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14LE", value: 139)
!734 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ411P", value: 140)
!735 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR8", value: 141)
!736 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB8", value: 142)
!737 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG8", value: 143)
!738 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG8", value: 144)
!739 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16LE", value: 145)
!740 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16BE", value: 146)
!741 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16LE", value: 147)
!742 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16BE", value: 148)
!743 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16LE", value: 149)
!744 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16BE", value: 150)
!745 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16LE", value: 151)
!746 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16BE", value: 152)
!747 = !DIEnumerator(name: "AV_PIX_FMT_XVMC", value: 153)
!748 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10LE", value: 154)
!749 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10BE", value: 155)
!750 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12LE", value: 156)
!751 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12BE", value: 157)
!752 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64LE", value: 158)
!753 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64BE", value: 159)
!754 = !DIEnumerator(name: "AV_PIX_FMT_VIDEOTOOLBOX", value: 160)
!755 = !DIEnumerator(name: "AV_PIX_FMT_P010LE", value: 161)
!756 = !DIEnumerator(name: "AV_PIX_FMT_P010BE", value: 162)
!757 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12BE", value: 163)
!758 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12LE", value: 164)
!759 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10BE", value: 165)
!760 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10LE", value: 166)
!761 = !DIEnumerator(name: "AV_PIX_FMT_MEDIACODEC", value: 167)
!762 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12BE", value: 168)
!763 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12LE", value: 169)
!764 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10BE", value: 170)
!765 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10LE", value: 171)
!766 = !DIEnumerator(name: "AV_PIX_FMT_P016LE", value: 172)
!767 = !DIEnumerator(name: "AV_PIX_FMT_P016BE", value: 173)
!768 = !DIEnumerator(name: "AV_PIX_FMT_D3D11", value: 174)
!769 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9BE", value: 175)
!770 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9LE", value: 176)
!771 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32BE", value: 177)
!772 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32LE", value: 178)
!773 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32BE", value: 179)
!774 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32LE", value: 180)
!775 = !DIEnumerator(name: "AV_PIX_FMT_DRM_PRIME", value: 181)
!776 = !DIEnumerator(name: "AV_PIX_FMT_OPENCL", value: 182)
!777 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14BE", value: 183)
!778 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14LE", value: 184)
!779 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32BE", value: 185)
!780 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32LE", value: 186)
!781 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12BE", value: 187)
!782 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12LE", value: 188)
!783 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12BE", value: 189)
!784 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12LE", value: 190)
!785 = !DIEnumerator(name: "AV_PIX_FMT_NB", value: 191)
!786 = !{!787, !790, !200, !796, !799}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64, align: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !207, line: 49, baseType: !789)
!789 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !793, line: 222, size: 16, align: 8, elements: !794)
!793 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!794 = !{!795}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !792, file: !793, line: 222, baseType: !788, size: 16, align: 16)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64, align: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !207, line: 37, baseType: !798)
!798 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64, align: 64)
!800 = !{!801, !802, !806, !817, !818, !819, !825}
!801 = distinct !DIGlobalVariable(name: "ff_vf_signalstats", scope: !0, file: !580, line: 1013, type: !267, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_vf_signalstats)
!802 = distinct !DIGlobalVariable(name: "signalstats_inputs", scope: !0, file: !580, line: 995, type: !803, isLocal: true, isDefinition: true, variable: [2 x %struct.AVFilterPad]* @signalstats_inputs)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 1152, align: 64, elements: !804)
!804 = !{!805}
!805 = !DISubrange(count: 2)
!806 = distinct !DIGlobalVariable(name: "filters_def", scope: !0, file: !580, line: 458, type: !807, isLocal: true, isDefinition: true, variable: [4 x %struct.anon]* @filters_def)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !808, size: 768, align: 64, elements: !815)
!808 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !580, line: 454, size: 192, align: 64, elements: !810)
!810 = !{!811, !812, !814}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !809, file: !580, line: 455, baseType: !184, size: 64, align: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "process8", scope: !809, file: !580, line: 456, baseType: !813, size: 64, align: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "process16", scope: !809, file: !580, line: 457, baseType: !813, size: 64, align: 64, offset: 128)
!815 = !{!816}
!816 = !DISubrange(count: 4)
!817 = distinct !DIGlobalVariable(name: "signalstats_outputs", scope: !0, file: !580, line: 1004, type: !803, isLocal: true, isDefinition: true, variable: [2 x %struct.AVFilterPad]* @signalstats_outputs)
!818 = distinct !DIGlobalVariable(name: "signalstats_class", scope: !0, file: !580, line: 86, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @signalstats_class)
!819 = distinct !DIGlobalVariable(name: "signalstats_options", scope: !0, file: !580, line: 72, type: !820, isLocal: true, isDefinition: true, variable: <{ %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption }>* @signalstats_options)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !821, size: 5632, align: 64, elements: !823)
!821 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !126, line: 301, baseType: !195)
!823 = !{!824}
!824 = !DISubrange(count: 11)
!825 = distinct !DIGlobalVariable(name: "pix_fmts", scope: !826, file: !580, line: 121, type: !828, isLocal: true, isDefinition: true, variable: [28 x i32]* @query_formats.pix_fmts)
!826 = distinct !DISubprogram(name: "query_formats", scope: !580, file: !580, line: 118, type: !409, isLocal: true, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !827)
!827 = !{}
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !829, size: 896, align: 32, elements: !830)
!829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!830 = !{!831}
!831 = !DISubrange(count: 28)
!832 = !{i32 2, !"Dwarf Version", i32 4}
!833 = !{i32 2, !"Debug Info Version", i32 3}
!834 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!835 = distinct !DISubprogram(name: "init", scope: !580, file: !580, line: 88, type: !409, isLocal: true, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !827)
!836 = !DILocalVariable(name: "ctx", arg: 1, scope: !835, file: !580, line: 88, type: !173)
!837 = !DIExpression()
!838 = !DILocation(line: 88, column: 56, scope: !835)
!839 = !DILocalVariable(name: "r", scope: !835, file: !580, line: 90, type: !292)
!840 = !DILocation(line: 90, column: 13, scope: !835)
!841 = !DILocalVariable(name: "g", scope: !835, file: !580, line: 90, type: !292)
!842 = !DILocation(line: 90, column: 16, scope: !835)
!843 = !DILocalVariable(name: "b", scope: !835, file: !580, line: 90, type: !292)
!844 = !DILocation(line: 90, column: 19, scope: !835)
!845 = !DILocalVariable(name: "s", scope: !835, file: !580, line: 91, type: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64, align: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "SignalstatsContext", file: !580, line: 57, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SignalstatsContext", file: !580, line: 36, size: 1088, align: 64, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !863, !867, !868, !869, !870, !871, !872, !873, !874}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !848, file: !580, line: 37, baseType: !178, size: 64, align: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "chromah", scope: !848, file: !580, line: 38, baseType: !200, size: 32, align: 32, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "chromaw", scope: !848, file: !580, line: 39, baseType: !200, size: 32, align: 32, offset: 96)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "hsub", scope: !848, file: !580, line: 40, baseType: !200, size: 32, align: 32, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "vsub", scope: !848, file: !580, line: 41, baseType: !200, size: 32, align: 32, offset: 160)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !848, file: !580, line: 42, baseType: !200, size: 32, align: 32, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !848, file: !580, line: 43, baseType: !200, size: 32, align: 32, offset: 224)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "cfs", scope: !848, file: !580, line: 44, baseType: !200, size: 32, align: 32, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "outfilter", scope: !848, file: !580, line: 45, baseType: !200, size: 32, align: 32, offset: 288)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !848, file: !580, line: 46, baseType: !200, size: 32, align: 32, offset: 320)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "frame_prev", scope: !848, file: !580, line: 47, baseType: !285, size: 64, align: 64, offset: 384)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "rgba_color", scope: !848, file: !580, line: 48, baseType: !862, size: 32, align: 8, offset: 448)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 32, align: 8, elements: !815)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_color", scope: !848, file: !580, line: 49, baseType: !864, size: 96, align: 32, offset: 480)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 96, align: 32, elements: !865)
!865 = !{!866}
!866 = !DISubrange(count: 3)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "nb_jobs", scope: !848, file: !580, line: 50, baseType: !200, size: 32, align: 32, offset: 576)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "jobs_rets", scope: !848, file: !580, line: 51, baseType: !474, size: 64, align: 64, offset: 640)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "histy", scope: !848, file: !580, line: 53, baseType: !474, size: 64, align: 64, offset: 704)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "histu", scope: !848, file: !580, line: 53, baseType: !474, size: 64, align: 64, offset: 768)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "histv", scope: !848, file: !580, line: 53, baseType: !474, size: 64, align: 64, offset: 832)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "histsat", scope: !848, file: !580, line: 53, baseType: !474, size: 64, align: 64, offset: 896)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "frame_sat", scope: !848, file: !580, line: 55, baseType: !285, size: 64, align: 64, offset: 960)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "frame_hue", scope: !848, file: !580, line: 56, baseType: !285, size: 64, align: 64, offset: 1024)
!875 = !DILocation(line: 91, column: 25, scope: !835)
!876 = !DILocation(line: 91, column: 29, scope: !835)
!877 = !DILocation(line: 91, column: 34, scope: !835)
!878 = !DILocation(line: 93, column: 9, scope: !879)
!879 = distinct !DILexicalBlock(scope: !835, file: !580, line: 93, column: 9)
!880 = !DILocation(line: 93, column: 12, scope: !879)
!881 = !DILocation(line: 93, column: 22, scope: !879)
!882 = !DILocation(line: 93, column: 9, scope: !835)
!883 = !DILocation(line: 94, column: 28, scope: !879)
!884 = !DILocation(line: 94, column: 31, scope: !879)
!885 = !DILocation(line: 94, column: 25, scope: !879)
!886 = !DILocation(line: 94, column: 9, scope: !879)
!887 = !DILocation(line: 94, column: 12, scope: !879)
!888 = !DILocation(line: 94, column: 20, scope: !879)
!889 = !DILocation(line: 96, column: 9, scope: !835)
!890 = !DILocation(line: 96, column: 12, scope: !835)
!891 = !DILocation(line: 96, column: 7, scope: !835)
!892 = !DILocation(line: 97, column: 9, scope: !835)
!893 = !DILocation(line: 97, column: 12, scope: !835)
!894 = !DILocation(line: 97, column: 7, scope: !835)
!895 = !DILocation(line: 98, column: 9, scope: !835)
!896 = !DILocation(line: 98, column: 12, scope: !835)
!897 = !DILocation(line: 98, column: 7, scope: !835)
!898 = !DILocation(line: 99, column: 29, scope: !835)
!899 = !DILocation(line: 99, column: 28, scope: !835)
!900 = !DILocation(line: 99, column: 37, scope: !835)
!901 = !DILocation(line: 99, column: 36, scope: !835)
!902 = !DILocation(line: 99, column: 31, scope: !835)
!903 = !DILocation(line: 99, column: 44, scope: !835)
!904 = !DILocation(line: 99, column: 43, scope: !835)
!905 = !DILocation(line: 99, column: 39, scope: !835)
!906 = !DILocation(line: 99, column: 46, scope: !835)
!907 = !DILocation(line: 99, column: 56, scope: !835)
!908 = !DILocation(line: 99, column: 62, scope: !835)
!909 = !DILocation(line: 99, column: 5, scope: !835)
!910 = !DILocation(line: 99, column: 8, scope: !835)
!911 = !DILocation(line: 99, column: 21, scope: !835)
!912 = !DILocation(line: 100, column: 29, scope: !835)
!913 = !DILocation(line: 100, column: 28, scope: !835)
!914 = !DILocation(line: 100, column: 37, scope: !835)
!915 = !DILocation(line: 100, column: 36, scope: !835)
!916 = !DILocation(line: 100, column: 31, scope: !835)
!917 = !DILocation(line: 100, column: 45, scope: !835)
!918 = !DILocation(line: 100, column: 44, scope: !835)
!919 = !DILocation(line: 100, column: 39, scope: !835)
!920 = !DILocation(line: 100, column: 47, scope: !835)
!921 = !DILocation(line: 100, column: 57, scope: !835)
!922 = !DILocation(line: 100, column: 63, scope: !835)
!923 = !DILocation(line: 100, column: 5, scope: !835)
!924 = !DILocation(line: 100, column: 8, scope: !835)
!925 = !DILocation(line: 100, column: 21, scope: !835)
!926 = !DILocation(line: 101, column: 29, scope: !835)
!927 = !DILocation(line: 101, column: 28, scope: !835)
!928 = !DILocation(line: 101, column: 37, scope: !835)
!929 = !DILocation(line: 101, column: 36, scope: !835)
!930 = !DILocation(line: 101, column: 31, scope: !835)
!931 = !DILocation(line: 101, column: 45, scope: !835)
!932 = !DILocation(line: 101, column: 44, scope: !835)
!933 = !DILocation(line: 101, column: 39, scope: !835)
!934 = !DILocation(line: 101, column: 47, scope: !835)
!935 = !DILocation(line: 101, column: 57, scope: !835)
!936 = !DILocation(line: 101, column: 63, scope: !835)
!937 = !DILocation(line: 101, column: 5, scope: !835)
!938 = !DILocation(line: 101, column: 8, scope: !835)
!939 = !DILocation(line: 101, column: 21, scope: !835)
!940 = !DILocation(line: 102, column: 5, scope: !835)
!941 = distinct !DISubprogram(name: "uninit", scope: !580, file: !580, line: 105, type: !419, isLocal: true, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !827)
!942 = !DILocalVariable(name: "ctx", arg: 1, scope: !941, file: !580, line: 105, type: !173)
!943 = !DILocation(line: 105, column: 59, scope: !941)
!944 = !DILocalVariable(name: "s", scope: !941, file: !580, line: 107, type: !846)
!945 = !DILocation(line: 107, column: 25, scope: !941)
!946 = !DILocation(line: 107, column: 29, scope: !941)
!947 = !DILocation(line: 107, column: 34, scope: !941)
!948 = !DILocation(line: 108, column: 20, scope: !941)
!949 = !DILocation(line: 108, column: 23, scope: !941)
!950 = !DILocation(line: 108, column: 5, scope: !941)
!951 = !DILocation(line: 109, column: 20, scope: !941)
!952 = !DILocation(line: 109, column: 23, scope: !941)
!953 = !DILocation(line: 109, column: 5, scope: !941)
!954 = !DILocation(line: 110, column: 20, scope: !941)
!955 = !DILocation(line: 110, column: 23, scope: !941)
!956 = !DILocation(line: 110, column: 5, scope: !941)
!957 = !DILocation(line: 111, column: 15, scope: !941)
!958 = !DILocation(line: 111, column: 18, scope: !941)
!959 = !DILocation(line: 111, column: 14, scope: !941)
!960 = !DILocation(line: 111, column: 5, scope: !941)
!961 = !DILocation(line: 112, column: 15, scope: !941)
!962 = !DILocation(line: 112, column: 18, scope: !941)
!963 = !DILocation(line: 112, column: 14, scope: !941)
!964 = !DILocation(line: 112, column: 5, scope: !941)
!965 = !DILocation(line: 113, column: 15, scope: !941)
!966 = !DILocation(line: 113, column: 18, scope: !941)
!967 = !DILocation(line: 113, column: 14, scope: !941)
!968 = !DILocation(line: 113, column: 5, scope: !941)
!969 = !DILocation(line: 114, column: 15, scope: !941)
!970 = !DILocation(line: 114, column: 18, scope: !941)
!971 = !DILocation(line: 114, column: 14, scope: !941)
!972 = !DILocation(line: 114, column: 5, scope: !941)
!973 = !DILocation(line: 115, column: 15, scope: !941)
!974 = !DILocation(line: 115, column: 18, scope: !941)
!975 = !DILocation(line: 115, column: 14, scope: !941)
!976 = !DILocation(line: 115, column: 5, scope: !941)
!977 = !DILocation(line: 116, column: 1, scope: !941)
!978 = !DILocalVariable(name: "ctx", arg: 1, scope: !826, file: !580, line: 118, type: !173)
!979 = !DILocation(line: 118, column: 43, scope: !826)
!980 = !DILocalVariable(name: "fmts_list", scope: !826, file: !580, line: 136, type: !524)
!981 = !DILocation(line: 136, column: 22, scope: !826)
!982 = !DILocation(line: 136, column: 34, scope: !826)
!983 = !DILocation(line: 137, column: 10, scope: !984)
!984 = distinct !DILexicalBlock(scope: !826, file: !580, line: 137, column: 9)
!985 = !DILocation(line: 137, column: 9, scope: !826)
!986 = !DILocation(line: 138, column: 9, scope: !984)
!987 = !DILocation(line: 139, column: 34, scope: !826)
!988 = !DILocation(line: 139, column: 39, scope: !826)
!989 = !DILocation(line: 139, column: 12, scope: !826)
!990 = !DILocation(line: 139, column: 5, scope: !826)
!991 = !DILocation(line: 140, column: 1, scope: !826)
!992 = distinct !DISubprogram(name: "filter_frame", scope: !580, file: !580, line: 984, type: !394, isLocal: true, isDefinition: true, scopeLine: 985, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !827)
!993 = !DILocalVariable(name: "link", arg: 1, scope: !992, file: !580, line: 984, type: !386)
!994 = !DILocation(line: 984, column: 39, scope: !992)
!995 = !DILocalVariable(name: "in", arg: 2, scope: !992, file: !580, line: 984, type: !285)
!996 = !DILocation(line: 984, column: 54, scope: !992)
!997 = !DILocalVariable(name: "ctx", scope: !992, file: !580, line: 986, type: !173)
!998 = !DILocation(line: 986, column: 22, scope: !992)
!999 = !DILocation(line: 986, column: 28, scope: !992)
!1000 = !DILocation(line: 986, column: 34, scope: !992)
!1001 = !DILocalVariable(name: "s", scope: !992, file: !580, line: 987, type: !846)
!1002 = !DILocation(line: 987, column: 25, scope: !992)
!1003 = !DILocation(line: 987, column: 29, scope: !992)
!1004 = !DILocation(line: 987, column: 34, scope: !992)
!1005 = !DILocation(line: 989, column: 9, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !992, file: !580, line: 989, column: 9)
!1007 = !DILocation(line: 989, column: 12, scope: !1006)
!1008 = !DILocation(line: 989, column: 18, scope: !1006)
!1009 = !DILocation(line: 989, column: 9, scope: !992)
!1010 = !DILocation(line: 990, column: 31, scope: !1006)
!1011 = !DILocation(line: 990, column: 37, scope: !1006)
!1012 = !DILocation(line: 990, column: 16, scope: !1006)
!1013 = !DILocation(line: 990, column: 9, scope: !1006)
!1014 = !DILocation(line: 992, column: 30, scope: !1006)
!1015 = !DILocation(line: 992, column: 36, scope: !1006)
!1016 = !DILocation(line: 992, column: 16, scope: !1006)
!1017 = !DILocation(line: 992, column: 9, scope: !1006)
!1018 = !DILocation(line: 993, column: 1, scope: !992)
!1019 = distinct !DISubprogram(name: "filter_frame16", scope: !580, file: !580, line: 767, type: !394, isLocal: true, isDefinition: true, scopeLine: 768, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !827)
!1020 = !DILocalVariable(name: "link", arg: 1, scope: !1019, file: !580, line: 767, type: !386)
!1021 = !DILocation(line: 767, column: 41, scope: !1019)
!1022 = !DILocalVariable(name: "in", arg: 2, scope: !1019, file: !580, line: 767, type: !285)
!1023 = !DILocation(line: 767, column: 56, scope: !1019)
!1024 = !DILocalVariable(name: "ctx", scope: !1019, file: !580, line: 769, type: !173)
!1025 = !DILocation(line: 769, column: 22, scope: !1019)
!1026 = !DILocation(line: 769, column: 28, scope: !1019)
!1027 = !DILocation(line: 769, column: 34, scope: !1019)
!1028 = !DILocalVariable(name: "s", scope: !1019, file: !580, line: 770, type: !846)
!1029 = !DILocation(line: 770, column: 25, scope: !1019)
!1030 = !DILocation(line: 770, column: 29, scope: !1019)
!1031 = !DILocation(line: 770, column: 34, scope: !1019)
!1032 = !DILocalVariable(name: "outlink", scope: !1019, file: !580, line: 771, type: !386)
!1033 = !DILocation(line: 771, column: 19, scope: !1019)
!1034 = !DILocation(line: 771, column: 29, scope: !1019)
!1035 = !DILocation(line: 771, column: 34, scope: !1019)
!1036 = !DILocalVariable(name: "out", scope: !1019, file: !580, line: 772, type: !285)
!1037 = !DILocation(line: 772, column: 14, scope: !1019)
!1038 = !DILocation(line: 772, column: 20, scope: !1019)
!1039 = !DILocalVariable(name: "i", scope: !1019, file: !580, line: 773, type: !200)
!1040 = !DILocation(line: 773, column: 9, scope: !1019)
!1041 = !DILocalVariable(name: "j", scope: !1019, file: !580, line: 773, type: !200)
!1042 = !DILocation(line: 773, column: 12, scope: !1019)
!1043 = !DILocalVariable(name: "w", scope: !1019, file: !580, line: 774, type: !200)
!1044 = !DILocation(line: 774, column: 9, scope: !1019)
!1045 = !DILocalVariable(name: "cw", scope: !1019, file: !580, line: 774, type: !200)
!1046 = !DILocation(line: 774, column: 16, scope: !1019)
!1047 = !DILocalVariable(name: "pw", scope: !1019, file: !580, line: 775, type: !200)
!1048 = !DILocation(line: 775, column: 9, scope: !1019)
!1049 = !DILocalVariable(name: "cpw", scope: !1019, file: !580, line: 775, type: !200)
!1050 = !DILocation(line: 775, column: 17, scope: !1019)
!1051 = !DILocalVariable(name: "fil", scope: !1019, file: !580, line: 776, type: !200)
!1052 = !DILocation(line: 776, column: 9, scope: !1019)
!1053 = !DILocalVariable(name: "metabuf", scope: !1019, file: !580, line: 777, type: !1054)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 1024, align: 8, elements: !1055)
!1055 = !{!1056}
!1056 = !DISubrange(count: 128)
!1057 = !DILocation(line: 777, column: 10, scope: !1019)
!1058 = !DILocalVariable(name: "histy", scope: !1019, file: !580, line: 778, type: !1059)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!1060 = !DILocation(line: 778, column: 19, scope: !1019)
!1061 = !DILocation(line: 778, column: 27, scope: !1019)
!1062 = !DILocation(line: 778, column: 30, scope: !1019)
!1063 = !DILocalVariable(name: "histu", scope: !1019, file: !580, line: 779, type: !1059)
!1064 = !DILocation(line: 779, column: 19, scope: !1019)
!1065 = !DILocation(line: 779, column: 27, scope: !1019)
!1066 = !DILocation(line: 779, column: 30, scope: !1019)
!1067 = !DILocalVariable(name: "histv", scope: !1019, file: !580, line: 780, type: !1059)
!1068 = !DILocation(line: 780, column: 19, scope: !1019)
!1069 = !DILocation(line: 780, column: 27, scope: !1019)
!1070 = !DILocation(line: 780, column: 30, scope: !1019)
!1071 = !DILocalVariable(name: "histhue", scope: !1019, file: !580, line: 781, type: !1072)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 11520, align: 32, elements: !1073)
!1073 = !{!1074}
!1074 = !DISubrange(count: 360)
!1075 = !DILocation(line: 781, column: 18, scope: !1019)
!1076 = !DILocalVariable(name: "histsat", scope: !1019, file: !580, line: 782, type: !1059)
!1077 = !DILocation(line: 782, column: 19, scope: !1019)
!1078 = !DILocation(line: 782, column: 29, scope: !1019)
!1079 = !DILocation(line: 782, column: 32, scope: !1019)
!1080 = !DILocalVariable(name: "miny", scope: !1019, file: !580, line: 783, type: !200)
!1081 = !DILocation(line: 783, column: 9, scope: !1019)
!1082 = !DILocalVariable(name: "minu", scope: !1019, file: !580, line: 783, type: !200)
!1083 = !DILocation(line: 783, column: 20, scope: !1019)
!1084 = !DILocalVariable(name: "minv", scope: !1019, file: !580, line: 783, type: !200)
!1085 = !DILocation(line: 783, column: 31, scope: !1019)
!1086 = !DILocalVariable(name: "maxy", scope: !1019, file: !580, line: 784, type: !200)
!1087 = !DILocation(line: 784, column: 9, scope: !1019)
!1088 = !DILocalVariable(name: "maxu", scope: !1019, file: !580, line: 784, type: !200)
!1089 = !DILocation(line: 784, column: 20, scope: !1019)
!1090 = !DILocalVariable(name: "maxv", scope: !1019, file: !580, line: 784, type: !200)
!1091 = !DILocation(line: 784, column: 31, scope: !1019)
!1092 = !DILocalVariable(name: "lowy", scope: !1019, file: !580, line: 785, type: !200)
!1093 = !DILocation(line: 785, column: 9, scope: !1019)
!1094 = !DILocalVariable(name: "lowu", scope: !1019, file: !580, line: 785, type: !200)
!1095 = !DILocation(line: 785, column: 20, scope: !1019)
!1096 = !DILocalVariable(name: "lowv", scope: !1019, file: !580, line: 785, type: !200)
!1097 = !DILocation(line: 785, column: 31, scope: !1019)
!1098 = !DILocalVariable(name: "highy", scope: !1019, file: !580, line: 786, type: !200)
!1099 = !DILocation(line: 786, column: 9, scope: !1019)
!1100 = !DILocalVariable(name: "highu", scope: !1019, file: !580, line: 786, type: !200)
!1101 = !DILocation(line: 786, column: 21, scope: !1019)
!1102 = !DILocalVariable(name: "highv", scope: !1019, file: !580, line: 786, type: !200)
!1103 = !DILocation(line: 786, column: 33, scope: !1019)
!1104 = !DILocalVariable(name: "minsat", scope: !1019, file: !580, line: 787, type: !200)
!1105 = !DILocation(line: 787, column: 9, scope: !1019)
!1106 = !DILocalVariable(name: "maxsat", scope: !1019, file: !580, line: 787, type: !200)
!1107 = !DILocation(line: 787, column: 22, scope: !1019)
!1108 = !DILocalVariable(name: "lowsat", scope: !1019, file: !580, line: 787, type: !200)
!1109 = !DILocation(line: 787, column: 35, scope: !1019)
!1110 = !DILocalVariable(name: "highsat", scope: !1019, file: !580, line: 787, type: !200)
!1111 = !DILocation(line: 787, column: 48, scope: !1019)
!1112 = !DILocalVariable(name: "lowp", scope: !1019, file: !580, line: 788, type: !200)
!1113 = !DILocation(line: 788, column: 9, scope: !1019)
!1114 = !DILocalVariable(name: "highp", scope: !1019, file: !580, line: 788, type: !200)
!1115 = !DILocation(line: 788, column: 15, scope: !1019)
!1116 = !DILocalVariable(name: "clowp", scope: !1019, file: !580, line: 788, type: !200)
!1117 = !DILocation(line: 788, column: 22, scope: !1019)
!1118 = !DILocalVariable(name: "chighp", scope: !1019, file: !580, line: 788, type: !200)
!1119 = !DILocation(line: 788, column: 29, scope: !1019)
!1120 = !DILocalVariable(name: "accy", scope: !1019, file: !580, line: 789, type: !200)
!1121 = !DILocation(line: 789, column: 9, scope: !1019)
!1122 = !DILocalVariable(name: "accu", scope: !1019, file: !580, line: 789, type: !200)
!1123 = !DILocation(line: 789, column: 15, scope: !1019)
!1124 = !DILocalVariable(name: "accv", scope: !1019, file: !580, line: 789, type: !200)
!1125 = !DILocation(line: 789, column: 21, scope: !1019)
!1126 = !DILocalVariable(name: "accsat", scope: !1019, file: !580, line: 790, type: !200)
!1127 = !DILocation(line: 790, column: 9, scope: !1019)
!1128 = !DILocalVariable(name: "acchue", scope: !1019, file: !580, line: 790, type: !200)
!1129 = !DILocation(line: 790, column: 17, scope: !1019)
!1130 = !DILocalVariable(name: "medhue", scope: !1019, file: !580, line: 791, type: !200)
!1131 = !DILocation(line: 791, column: 9, scope: !1019)
!1132 = !DILocalVariable(name: "maxhue", scope: !1019, file: !580, line: 791, type: !200)
!1133 = !DILocation(line: 791, column: 17, scope: !1019)
!1134 = !DILocalVariable(name: "toty", scope: !1019, file: !580, line: 792, type: !206)
!1135 = !DILocation(line: 792, column: 13, scope: !1019)
!1136 = !DILocalVariable(name: "totu", scope: !1019, file: !580, line: 792, type: !206)
!1137 = !DILocation(line: 792, column: 23, scope: !1019)
!1138 = !DILocalVariable(name: "totv", scope: !1019, file: !580, line: 792, type: !206)
!1139 = !DILocation(line: 792, column: 33, scope: !1019)
!1140 = !DILocalVariable(name: "totsat", scope: !1019, file: !580, line: 792, type: !206)
!1141 = !DILocation(line: 792, column: 43, scope: !1019)
!1142 = !DILocalVariable(name: "tothue", scope: !1019, file: !580, line: 793, type: !206)
!1143 = !DILocation(line: 793, column: 13, scope: !1019)
!1144 = !DILocalVariable(name: "dify", scope: !1019, file: !580, line: 794, type: !206)
!1145 = !DILocation(line: 794, column: 13, scope: !1019)
!1146 = !DILocalVariable(name: "difu", scope: !1019, file: !580, line: 794, type: !206)
!1147 = !DILocation(line: 794, column: 23, scope: !1019)
!1148 = !DILocalVariable(name: "difv", scope: !1019, file: !580, line: 794, type: !206)
!1149 = !DILocation(line: 794, column: 33, scope: !1019)
!1150 = !DILocalVariable(name: "masky", scope: !1019, file: !580, line: 795, type: !788)
!1151 = !DILocation(line: 795, column: 14, scope: !1019)
!1152 = !DILocalVariable(name: "masku", scope: !1019, file: !580, line: 795, type: !788)
!1153 = !DILocation(line: 795, column: 25, scope: !1019)
!1154 = !DILocalVariable(name: "maskv", scope: !1019, file: !580, line: 795, type: !788)
!1155 = !DILocation(line: 795, column: 36, scope: !1019)
!1156 = !DILocalVariable(name: "filtot", scope: !1019, file: !580, line: 797, type: !864)
!1157 = !DILocation(line: 797, column: 9, scope: !1019)
!1158 = !DILocalVariable(name: "prev", scope: !1019, file: !580, line: 798, type: !285)
!1159 = !DILocation(line: 798, column: 14, scope: !1019)
!1160 = !DILocalVariable(name: "sat", scope: !1019, file: !580, line: 800, type: !285)
!1161 = !DILocation(line: 800, column: 14, scope: !1019)
!1162 = !DILocation(line: 800, column: 20, scope: !1019)
!1163 = !DILocation(line: 800, column: 23, scope: !1019)
!1164 = !DILocalVariable(name: "hue", scope: !1019, file: !580, line: 801, type: !285)
!1165 = !DILocation(line: 801, column: 14, scope: !1019)
!1166 = !DILocation(line: 801, column: 20, scope: !1019)
!1167 = !DILocation(line: 801, column: 23, scope: !1019)
!1168 = !DILocalVariable(name: "p_sat", scope: !1019, file: !580, line: 802, type: !1169)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !788)
!1171 = !DILocation(line: 802, column: 21, scope: !1019)
!1172 = !DILocation(line: 802, column: 41, scope: !1019)
!1173 = !DILocation(line: 802, column: 46, scope: !1019)
!1174 = !DILocation(line: 802, column: 29, scope: !1019)
!1175 = !DILocalVariable(name: "p_hue", scope: !1019, file: !580, line: 803, type: !1169)
!1176 = !DILocation(line: 803, column: 21, scope: !1019)
!1177 = !DILocation(line: 803, column: 41, scope: !1019)
!1178 = !DILocation(line: 803, column: 46, scope: !1019)
!1179 = !DILocation(line: 803, column: 29, scope: !1019)
!1180 = !DILocalVariable(name: "lsz_sat", scope: !1019, file: !580, line: 804, type: !1181)
!1181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!1182 = !DILocation(line: 804, column: 15, scope: !1019)
!1183 = !DILocation(line: 804, column: 25, scope: !1019)
!1184 = !DILocation(line: 804, column: 30, scope: !1019)
!1185 = !DILocation(line: 804, column: 42, scope: !1019)
!1186 = !DILocalVariable(name: "lsz_hue", scope: !1019, file: !580, line: 805, type: !1181)
!1187 = !DILocation(line: 805, column: 15, scope: !1019)
!1188 = !DILocation(line: 805, column: 25, scope: !1019)
!1189 = !DILocation(line: 805, column: 30, scope: !1019)
!1190 = !DILocation(line: 805, column: 42, scope: !1019)
!1191 = !DILocalVariable(name: "td_huesat", scope: !1019, file: !580, line: 806, type: !1192)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadDataHueSatMetrics", file: !580, line: 67, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadDataHueSatMetrics", file: !580, line: 64, size: 192, align: 64, elements: !1194)
!1194 = !{!1195, !1198, !1199}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1193, file: !580, line: 65, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "dst_sat", scope: !1193, file: !580, line: 66, baseType: !285, size: 64, align: 64, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "dst_hue", scope: !1193, file: !580, line: 66, baseType: !285, size: 64, align: 64, offset: 128)
!1200 = !DILocation(line: 806, column: 29, scope: !1019)
!1201 = !DILocation(line: 806, column: 41, scope: !1019)
!1202 = !DILocation(line: 807, column: 16, scope: !1019)
!1203 = !DILocation(line: 808, column: 20, scope: !1019)
!1204 = !DILocation(line: 809, column: 20, scope: !1019)
!1205 = !DILocation(line: 812, column: 10, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1019, file: !580, line: 812, column: 9)
!1207 = !DILocation(line: 812, column: 13, scope: !1206)
!1208 = !DILocation(line: 812, column: 9, scope: !1019)
!1209 = !DILocation(line: 813, column: 40, scope: !1206)
!1210 = !DILocation(line: 813, column: 25, scope: !1206)
!1211 = !DILocation(line: 813, column: 9, scope: !1206)
!1212 = !DILocation(line: 813, column: 12, scope: !1206)
!1213 = !DILocation(line: 813, column: 23, scope: !1206)
!1214 = !DILocation(line: 815, column: 12, scope: !1019)
!1215 = !DILocation(line: 815, column: 15, scope: !1019)
!1216 = !DILocation(line: 815, column: 10, scope: !1019)
!1217 = !DILocation(line: 817, column: 9, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1019, file: !580, line: 817, column: 9)
!1219 = !DILocation(line: 817, column: 12, scope: !1218)
!1220 = !DILocation(line: 817, column: 22, scope: !1218)
!1221 = !DILocation(line: 817, column: 9, scope: !1019)
!1222 = !DILocation(line: 818, column: 30, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1218, file: !580, line: 817, column: 38)
!1224 = !DILocation(line: 818, column: 15, scope: !1223)
