; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--framepool.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--framepool.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.FFFramePool = type { i32, i32, i32, i32, i32, i32, i32, i32, [4 x i32], [4 x %struct.AVBufferPool*] }
%struct.AVBufferPool = type opaque
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque
%struct.AVPixFmtDescriptor = type { i8*, i8, i8, i8, i64, [4 x %struct.AVComponentDescriptor], i8* }
%struct.AVComponentDescriptor = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVFrame = type { [8 x i8*], [8 x i32], i8**, i32, i32, i32, i32, i32, i32, %struct.AVRational, i64, i64, i64, i32, i32, i32, i8*, [8 x i64], i32, i32, i32, i32, i64, i32, i64, [8 x %struct.AVBufferRef*], %struct.AVBufferRef**, i32, %struct.AVFrameSideData**, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, %struct.AVDictionary*, i32, i32, i32, i8*, i32, i32, %struct.AVBufferRef*, %struct.AVBufferRef*, %struct.AVBufferRef*, i64, i64, i64, i64, %struct.AVBufferRef* }
%struct.AVRational = type { i32, i32 }
%struct.AVFrameSideData = type { i32, i8*, i32, %struct.AVDictionary*, %struct.AVBufferRef* }
%struct.AVDictionary = type opaque


!277 = !DIEnumerator(name: "AVCOL_PRI_BT470BG", value: 5)
!278 = !DIEnumerator(name: "AVCOL_PRI_SMPTE170M", value: 6)
!279 = !DIEnumerator(name: "AVCOL_PRI_SMPTE240M", value: 7)
!280 = !DIEnumerator(name: "AVCOL_PRI_FILM", value: 8)
!281 = !DIEnumerator(name: "AVCOL_PRI_BT2020", value: 9)
!282 = !DIEnumerator(name: "AVCOL_PRI_SMPTE428", value: 10)
!283 = !DIEnumerator(name: "AVCOL_PRI_SMPTEST428_1", value: 10)
!284 = !DIEnumerator(name: "AVCOL_PRI_SMPTE431", value: 11)
!285 = !DIEnumerator(name: "AVCOL_PRI_SMPTE432", value: 12)
!286 = !DIEnumerator(name: "AVCOL_PRI_JEDEC_P22", value: 22)
!287 = !DIEnumerator(name: "AVCOL_PRI_NB", value: 23)
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorTransferCharacteristic", file: !14, line: 464, size: 32, align: 32, elements: !289)
!289 = !{!290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311}
!290 = !DIEnumerator(name: "AVCOL_TRC_RESERVED0", value: 0)
!291 = !DIEnumerator(name: "AVCOL_TRC_BT709", value: 1)
!292 = !DIEnumerator(name: "AVCOL_TRC_UNSPECIFIED", value: 2)
!293 = !DIEnumerator(name: "AVCOL_TRC_RESERVED", value: 3)
!294 = !DIEnumerator(name: "AVCOL_TRC_GAMMA22", value: 4)
!295 = !DIEnumerator(name: "AVCOL_TRC_GAMMA28", value: 5)
!296 = !DIEnumerator(name: "AVCOL_TRC_SMPTE170M", value: 6)
!297 = !DIEnumerator(name: "AVCOL_TRC_SMPTE240M", value: 7)
!298 = !DIEnumerator(name: "AVCOL_TRC_LINEAR", value: 8)
!299 = !DIEnumerator(name: "AVCOL_TRC_LOG", value: 9)
!300 = !DIEnumerator(name: "AVCOL_TRC_LOG_SQRT", value: 10)
!301 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_4", value: 11)
!302 = !DIEnumerator(name: "AVCOL_TRC_BT1361_ECG", value: 12)
!303 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_1", value: 13)
!304 = !DIEnumerator(name: "AVCOL_TRC_BT2020_10", value: 14)
!305 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!306 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!307 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!308 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!309 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!310 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!311 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!312 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !14, line: 493, size: 32, align: 32, elements: !313)
!313 = !{!314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330}
!314 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!315 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!316 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!317 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!318 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!319 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!320 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!321 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!322 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!323 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!324 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!325 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!326 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!327 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!328 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!329 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!330 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!331 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !14, line: 538, size: 32, align: 32, elements: !332)
!332 = !{!333, !334, !335, !336, !337, !338, !339, !340}
!333 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!334 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!335 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!336 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!337 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!338 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!339 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!340 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!341 = !{!342, !343}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !345, line: 51, baseType: !346)
!345 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!346 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!347 = !{i32 2, !"Dwarf Version", i32 4}
!348 = !{i32 2, !"Debug Info Version", i32 3}
!349 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!350 = distinct !DISubprogram(name: "ff_frame_pool_video_init", scope: !351, file: !351, line: 51, type: !352, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !394)
!351 = !DIFile(filename: "libavfilter/framepool.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!352 = !DISubroutineType(types: !353)
!353 = !{!354, !378, !361, !361, !13, !361}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFramePool", file: !356, line: 32, baseType: !357)
!356 = !DIFile(filename: "libavfilter/framepool.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFramePool", file: !351, line: 30, size: 640, align: 64, elements: !358)
!358 = !{!359, !360, !362, !363, !364, !365, !366, !367, !368, !372}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !357, file: !351, line: 32, baseType: !3, size: 32, align: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !357, file: !351, line: 35, baseType: !361, size: 32, align: 32, offset: 32)
!361 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !357, file: !351, line: 36, baseType: !361, size: 32, align: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !357, file: !351, line: 39, baseType: !361, size: 32, align: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !357, file: !351, line: 40, baseType: !361, size: 32, align: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !357, file: !351, line: 41, baseType: !361, size: 32, align: 32, offset: 160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !357, file: !351, line: 44, baseType: !361, size: 32, align: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !357, file: !351, line: 45, baseType: !361, size: 32, align: 32, offset: 224)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !357, file: !351, line: 46, baseType: !369, size: 128, align: 32, offset: 256)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 128, align: 32, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 4)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !357, file: !351, line: 47, baseType: !373, size: 256, align: 64, offset: 384)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 256, align: 64, elements: !370)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !376, line: 238, baseType: !377)
!376 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !376, line: 238, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!381, !361}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !376, line: 94, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !376, line: 81, size: 192, align: 64, elements: !384)
!384 = !{!385, !389, !393}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !383, file: !376, line: 82, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !376, line: 73, baseType: !388)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !376, line: 73, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !383, file: !376, line: 89, baseType: !390, size: 64, align: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !345, line: 48, baseType: !392)
!392 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !383, file: !376, line: 93, baseType: !361, size: 32, align: 32, offset: 128)
!394 = !{}
!395 = !DILocalVariable(name: "alloc", arg: 1, scope: !350, file: !351, line: 51, type: !378)
!396 = !DIExpression()
!397 = !DILocation(line: 51, column: 54, scope: !350)
!398 = !DILocalVariable(name: "width", arg: 2, scope: !350, file: !351, line: 52, type: !361)
!399 = !DILocation(line: 52, column: 43, scope: !350)
!400 = !DILocalVariable(name: "height", arg: 3, scope: !350, file: !351, line: 53, type: !361)
!401 = !DILocation(line: 53, column: 43, scope: !350)
!402 = !DILocalVariable(name: "format", arg: 4, scope: !350, file: !351, line: 54, type: !13)
!403 = !DILocation(line: 54, column: 58, scope: !350)
!404 = !DILocalVariable(name: "align", arg: 5, scope: !350, file: !351, line: 55, type: !361)
!405 = !DILocation(line: 55, column: 43, scope: !350)
!406 = !DILocalVariable(name: "i", scope: !350, file: !351, line: 57, type: !361)
!407 = !DILocation(line: 57, column: 9, scope: !350)
!408 = !DILocalVariable(name: "ret", scope: !350, file: !351, line: 57, type: !361)
!409 = !DILocation(line: 57, column: 12, scope: !350)
!410 = !DILocalVariable(name: "pool", scope: !350, file: !351, line: 58, type: !354)
!411 = !DILocation(line: 58, column: 18, scope: !350)
!412 = !DILocalVariable(name: "desc", scope: !350, file: !351, line: 59, type: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPixFmtDescriptor", file: !416, line: 123, baseType: !417)
!416 = !DIFile(filename: "./libavutil/pixdesc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPixFmtDescriptor", file: !416, line: 81, size: 1280, align: 64, elements: !418)
!418 = !{!419, !423, !424, !425, !426, !429, !442}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !417, file: !416, line: 82, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!422 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !417, file: !416, line: 83, baseType: !391, size: 8, align: 8, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_w", scope: !417, file: !416, line: 92, baseType: !391, size: 8, align: 8, offset: 72)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_h", scope: !417, file: !416, line: 101, baseType: !391, size: 8, align: 8, offset: 80)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !417, file: !416, line: 106, baseType: !427, size: 64, align: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !345, line: 55, baseType: !428)
!428 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !417, file: !416, line: 117, baseType: !430, size: 1024, align: 32, offset: 192)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 1024, align: 32, elements: !370)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVComponentDescriptor", file: !416, line: 70, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVComponentDescriptor", file: !416, line: 31, size: 256, align: 32, elements: !433)
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !432, file: !416, line: 35, baseType: !361, size: 32, align: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !432, file: !416, line: 41, baseType: !361, size: 32, align: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !432, file: !416, line: 47, baseType: !361, size: 32, align: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !432, file: !416, line: 53, baseType: !361, size: 32, align: 32, offset: 96)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !432, file: !416, line: 58, baseType: !361, size: 32, align: 32, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "step_minus1", scope: !432, file: !416, line: 62, baseType: !361, size: 32, align: 32, offset: 160)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "depth_minus1", scope: !432, file: !416, line: 65, baseType: !361, size: 32, align: 32, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "offset_plus1", scope: !432, file: !416, line: 68, baseType: !361, size: 32, align: 32, offset: 224)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !417, file: !416, line: 122, baseType: !420, size: 64, align: 64, offset: 1216)
!443 = !DILocation(line: 59, column: 31, scope: !350)
!444 = !DILocation(line: 59, column: 58, scope: !350)
!445 = !DILocation(line: 59, column: 38, scope: !350)
!446 = !DILocation(line: 61, column: 10, scope: !447)
!447 = distinct !DILexicalBlock(scope: !350, file: !351, line: 61, column: 9)
!448 = !DILocation(line: 61, column: 9, scope: !350)
!449 = !DILocation(line: 62, column: 9, scope: !447)
!450 = !DILocation(line: 64, column: 12, scope: !350)
!451 = !DILocation(line: 64, column: 10, scope: !350)
!452 = !DILocation(line: 65, column: 10, scope: !453)
!453 = distinct !DILexicalBlock(scope: !350, file: !351, line: 65, column: 9)
!454 = !DILocation(line: 65, column: 9, scope: !350)
!455 = !DILocation(line: 66, column: 9, scope: !453)
!456 = !DILocation(line: 68, column: 5, scope: !350)
!457 = !DILocation(line: 68, column: 11, scope: !350)
!458 = !DILocation(line: 68, column: 16, scope: !350)
!459 = !DILocation(line: 69, column: 19, scope: !350)
!460 = !DILocation(line: 69, column: 5, scope: !350)
!461 = !DILocation(line: 69, column: 11, scope: !350)
!462 = !DILocation(line: 69, column: 17, scope: !350)
!463 = !DILocation(line: 70, column: 20, scope: !350)
!464 = !DILocation(line: 70, column: 5, scope: !350)
!465 = !DILocation(line: 70, column: 11, scope: !350)
!466 = !DILocation(line: 70, column: 18, scope: !350)
!467 = !DILocation(line: 71, column: 20, scope: !350)
!468 = !DILocation(line: 71, column: 5, scope: !350)
!469 = !DILocation(line: 71, column: 11, scope: !350)
!470 = !DILocation(line: 71, column: 18, scope: !350)
!471 = !DILocation(line: 72, column: 19, scope: !350)
!472 = !DILocation(line: 72, column: 5, scope: !350)
!473 = !DILocation(line: 72, column: 11, scope: !350)
!474 = !DILocation(line: 72, column: 17, scope: !350)
!475 = !DILocation(line: 74, column: 37, scope: !476)
!476 = distinct !DILexicalBlock(scope: !350, file: !351, line: 74, column: 9)
!477 = !DILocation(line: 74, column: 44, scope: !476)
!478 = !DILocation(line: 74, column: 62, scope: !476)
!479 = !DILocation(line: 74, column: 16, scope: !476)
!480 = !DILocation(line: 74, column: 14, scope: !476)
!481 = !DILocation(line: 74, column: 80, scope: !476)
!482 = !DILocation(line: 74, column: 9, scope: !350)
!483 = !DILocation(line: 75, column: 9, scope: !484)
!484 = distinct !DILexicalBlock(scope: !476, file: !351, line: 74, column: 85)
!485 = !DILocation(line: 78, column: 10, scope: !486)
!486 = distinct !DILexicalBlock(scope: !350, file: !351, line: 78, column: 9)
!487 = !DILocation(line: 78, column: 16, scope: !486)
!488 = !DILocation(line: 78, column: 9, scope: !350)
!489 = !DILocation(line: 79, column: 15, scope: !490)
!490 = distinct !DILexicalBlock(scope: !491, file: !351, line: 79, column: 9)
!491 = distinct !DILexicalBlock(scope: !486, file: !351, line: 78, column: 29)
!492 = !DILocation(line: 79, column: 13, scope: !490)
!493 = !DILocation(line: 79, column: 20, scope: !494)
!494 = !DILexicalBlockFile(scope: !495, file: !351, discriminator: 1)
!495 = distinct !DILexicalBlock(scope: !490, file: !351, line: 79, column: 9)
!496 = !DILocation(line: 79, column: 25, scope: !494)
!497 = !DILocation(line: 79, column: 22, scope: !494)
!498 = !DILocation(line: 79, column: 9, scope: !494)
!499 = !DILocation(line: 80, column: 43, scope: !500)
!500 = distinct !DILexicalBlock(scope: !495, file: !351, line: 79, column: 40)
!501 = !DILocation(line: 80, column: 49, scope: !500)
!502 = !DILocation(line: 80, column: 59, scope: !500)
!503 = !DILocation(line: 80, column: 65, scope: !500)
!504 = !DILocation(line: 81, column: 46, scope: !500)
!505 = !DILocation(line: 81, column: 52, scope: !500)
!506 = !DILocation(line: 81, column: 60, scope: !500)
!507 = !DILocation(line: 81, column: 58, scope: !500)
!508 = !DILocation(line: 81, column: 62, scope: !500)
!509 = !DILocation(line: 81, column: 69, scope: !500)
!510 = !DILocation(line: 81, column: 71, scope: !500)
!511 = !DILocation(line: 81, column: 66, scope: !500)
!512 = !DILocation(line: 81, column: 65, scope: !500)
!513 = !DILocation(line: 80, column: 19, scope: !500)
!514 = !DILocation(line: 80, column: 17, scope: !500)
!515 = !DILocation(line: 82, column: 17, scope: !516)
!516 = distinct !DILexicalBlock(scope: !500, file: !351, line: 82, column: 17)
!517 = !DILocation(line: 82, column: 21, scope: !516)
!518 = !DILocation(line: 82, column: 17, scope: !500)
!519 = !DILocation(line: 83, column: 17, scope: !520)
!520 = distinct !DILexicalBlock(scope: !516, file: !351, line: 82, column: 26)
!521 = !DILocation(line: 85, column: 19, scope: !522)
!522 = distinct !DILexicalBlock(scope: !500, file: !351, line: 85, column: 17)
!523 = !DILocation(line: 85, column: 25, scope: !522)
!524 = !DILocation(line: 85, column: 40, scope: !522)
!525 = !DILocation(line: 85, column: 46, scope: !522)
!526 = !DILocation(line: 85, column: 52, scope: !522)
!527 = !DILocation(line: 85, column: 37, scope: !522)
!528 = !DILocation(line: 85, column: 17, scope: !500)
!529 = !DILocation(line: 86, column: 17, scope: !522)
!530 = !DILocation(line: 87, column: 9, scope: !500)
!531 = !DILocation(line: 79, column: 37, scope: !532)
!532 = !DILexicalBlockFile(scope: !495, file: !351, discriminator: 2)
!533 = !DILocation(line: 79, column: 34, scope: !532)
!534 = !DILocation(line: 79, column: 9, scope: !532)
!535 = distinct !{!535, !536}
!536 = !DILocation(line: 79, column: 9, scope: !491)
!537 = !DILocation(line: 89, column: 16, scope: !538)
!538 = distinct !DILexicalBlock(scope: !491, file: !351, line: 89, column: 9)
!539 = !DILocation(line: 89, column: 14, scope: !538)
!540 = !DILocation(line: 89, column: 21, scope: !541)
!541 = !DILexicalBlockFile(scope: !542, file: !351, discriminator: 1)
!542 = distinct !DILexicalBlock(scope: !538, file: !351, line: 89, column: 9)
!543 = !DILocation(line: 89, column: 23, scope: !541)
!544 = !DILocation(line: 89, column: 27, scope: !541)
!545 = !DILocation(line: 89, column: 45, scope: !546)
!546 = !DILexicalBlockFile(scope: !542, file: !351, discriminator: 2)
!547 = !DILocation(line: 89, column: 30, scope: !546)
!548 = !DILocation(line: 89, column: 36, scope: !546)
!549 = !DILocation(line: 89, column: 27, scope: !546)
!550 = !DILocation(line: 89, column: 9, scope: !551)
!551 = !DILexicalBlockFile(scope: !538, file: !351, discriminator: 3)
!552 = !DILocation(line: 90, column: 51, scope: !553)
!553 = distinct !DILexicalBlock(scope: !542, file: !351, line: 89, column: 54)
!554 = !DILocation(line: 90, column: 36, scope: !553)
!555 = !DILocation(line: 90, column: 42, scope: !553)
!556 = !DILocation(line: 90, column: 56, scope: !553)
!557 = !DILocation(line: 90, column: 62, scope: !553)
!558 = !DILocation(line: 90, column: 54, scope: !553)
!559 = !DILocation(line: 90, column: 68, scope: !553)
!560 = !DILocation(line: 90, column: 75, scope: !553)
!561 = !DILocation(line: 90, column: 81, scope: !553)
!562 = !DILocation(line: 90, column: 87, scope: !553)
!563 = !DILocation(line: 90, column: 72, scope: !553)
!564 = !DILocation(line: 90, column: 71, scope: !553)
!565 = !DILocation(line: 90, column: 28, scope: !553)
!566 = !DILocation(line: 90, column: 13, scope: !553)
!567 = !DILocation(line: 90, column: 19, scope: !553)
!568 = !DILocation(line: 90, column: 31, scope: !553)
!569 = !DILocation(line: 91, column: 9, scope: !553)
!570 = !DILocation(line: 89, column: 50, scope: !571)
!571 = !DILexicalBlockFile(scope: !542, file: !351, discriminator: 4)
!572 = !DILocation(line: 89, column: 9, scope: !571)
!573 = distinct !{!573, !574}
!574 = !DILocation(line: 89, column: 9, scope: !491)
!575 = !DILocation(line: 92, column: 5, scope: !491)
!576 = !DILocation(line: 94, column: 12, scope: !577)
!577 = distinct !DILexicalBlock(scope: !350, file: !351, line: 94, column: 5)
!578 = !DILocation(line: 94, column: 10, scope: !577)
!579 = !DILocation(line: 94, column: 17, scope: !580)
!580 = !DILexicalBlockFile(scope: !581, file: !351, discriminator: 1)
!581 = distinct !DILexicalBlock(scope: !577, file: !351, line: 94, column: 5)
!582 = !DILocation(line: 94, column: 19, scope: !580)
!583 = !DILocation(line: 94, column: 23, scope: !580)
!584 = !DILocation(line: 94, column: 41, scope: !585)
!585 = !DILexicalBlockFile(scope: !581, file: !351, discriminator: 2)
!586 = !DILocation(line: 94, column: 26, scope: !585)
!587 = !DILocation(line: 94, column: 32, scope: !585)
!588 = !DILocation(line: 94, column: 23, scope: !585)
!589 = !DILocation(line: 94, column: 5, scope: !590)
!590 = !DILexicalBlockFile(scope: !577, file: !351, discriminator: 3)
!591 = !DILocalVariable(name: "h", scope: !592, file: !351, line: 95, type: !361)
!592 = distinct !DILexicalBlock(scope: !581, file: !351, line: 94, column: 50)
!593 = !DILocation(line: 95, column: 13, scope: !592)
!594 = !DILocation(line: 95, column: 20, scope: !592)
!595 = !DILocation(line: 95, column: 26, scope: !592)
!596 = !DILocation(line: 95, column: 33, scope: !592)
!597 = !DILocation(line: 95, column: 38, scope: !592)
!598 = !DILocation(line: 95, column: 41, scope: !592)
!599 = !DILocation(line: 96, column: 13, scope: !600)
!600 = distinct !DILexicalBlock(scope: !592, file: !351, line: 96, column: 13)
!601 = !DILocation(line: 96, column: 15, scope: !600)
!602 = !DILocation(line: 96, column: 20, scope: !600)
!603 = !DILocation(line: 96, column: 23, scope: !604)
!604 = !DILexicalBlockFile(scope: !600, file: !351, discriminator: 1)
!605 = !DILocation(line: 96, column: 25, scope: !604)
!606 = !DILocation(line: 96, column: 13, scope: !604)
!607 = !DILocation(line: 97, column: 68, scope: !600)
!608 = !DILocation(line: 97, column: 66, scope: !600)
!609 = !DILocation(line: 97, column: 76, scope: !600)
!610 = !DILocation(line: 97, column: 82, scope: !600)
!611 = !DILocation(line: 97, column: 75, scope: !600)
!612 = !DILocation(line: 97, column: 72, scope: !600)
!613 = !DILocation(line: 97, column: 63, scope: !600)
!614 = !DILocation(line: 97, column: 15, scope: !600)
!615 = !DILocation(line: 97, column: 13, scope: !600)
!616 = !DILocation(line: 99, column: 61, scope: !592)
!617 = !DILocation(line: 99, column: 46, scope: !592)
!618 = !DILocation(line: 99, column: 52, scope: !592)
!619 = !DILocation(line: 99, column: 66, scope: !592)
!620 = !DILocation(line: 99, column: 64, scope: !592)
!621 = !DILocation(line: 99, column: 68, scope: !592)
!622 = !DILocation(line: 99, column: 73, scope: !592)
!623 = !DILocation(line: 99, column: 78, scope: !592)
!624 = !DILocation(line: 100, column: 46, scope: !592)
!625 = !DILocation(line: 99, column: 26, scope: !592)
!626 = !DILocation(line: 99, column: 21, scope: !592)
!627 = !DILocation(line: 99, column: 9, scope: !592)
!628 = !DILocation(line: 99, column: 15, scope: !592)
!629 = !DILocation(line: 99, column: 24, scope: !592)
!630 = !DILocation(line: 101, column: 26, scope: !631)
!631 = distinct !DILexicalBlock(scope: !592, file: !351, line: 101, column: 13)
!632 = !DILocation(line: 101, column: 14, scope: !631)
!633 = !DILocation(line: 101, column: 20, scope: !631)
!634 = !DILocation(line: 101, column: 13, scope: !592)
!635 = !DILocation(line: 102, column: 13, scope: !631)
!636 = !DILocation(line: 103, column: 5, scope: !592)
!637 = !DILocation(line: 94, column: 46, scope: !638)
!638 = !DILexicalBlockFile(scope: !581, file: !351, discriminator: 4)
!639 = !DILocation(line: 94, column: 5, scope: !638)
!640 = distinct !{!640, !641}
!641 = !DILocation(line: 94, column: 5, scope: !350)
!642 = !DILocation(line: 105, column: 9, scope: !643)
!643 = distinct !DILexicalBlock(scope: !350, file: !351, line: 105, column: 9)
!644 = !DILocation(line: 105, column: 15, scope: !643)
!645 = !DILocation(line: 105, column: 21, scope: !643)
!646 = !DILocation(line: 105, column: 32, scope: !643)
!647 = !DILocation(line: 106, column: 9, scope: !643)
!648 = !DILocation(line: 106, column: 15, scope: !643)
!649 = !DILocation(line: 106, column: 21, scope: !643)
!650 = !DILocation(line: 105, column: 9, scope: !651)
!651 = !DILexicalBlockFile(scope: !350, file: !351, discriminator: 1)
!652 = !DILocation(line: 107, column: 52, scope: !653)
!653 = distinct !DILexicalBlock(scope: !643, file: !351, line: 106, column: 33)
!654 = !DILocation(line: 107, column: 26, scope: !653)
!655 = !DILocation(line: 107, column: 9, scope: !653)
!656 = !DILocation(line: 107, column: 15, scope: !653)
!657 = !DILocation(line: 107, column: 24, scope: !653)
!658 = !DILocation(line: 108, column: 14, scope: !659)
!659 = distinct !DILexicalBlock(scope: !653, file: !351, line: 108, column: 13)
!660 = !DILocation(line: 108, column: 20, scope: !659)
!661 = !DILocation(line: 108, column: 13, scope: !653)
!662 = !DILocation(line: 109, column: 13, scope: !659)
!663 = !DILocation(line: 110, column: 5, scope: !653)
!664 = !DILocation(line: 112, column: 12, scope: !350)
!665 = !DILocation(line: 112, column: 5, scope: !350)
!666 = !DILocation(line: 115, column: 5, scope: !350)
!667 = !DILocation(line: 116, column: 5, scope: !350)
!668 = !DILocation(line: 117, column: 1, scope: !350)
!669 = distinct !DISubprogram(name: "ff_frame_pool_uninit", scope: !351, file: !351, line: 284, type: !670, isLocal: false, isDefinition: true, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !394)
!670 = !DISubroutineType(types: !671)
!671 = !{null, !672}
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!673 = !DILocalVariable(name: "pool", arg: 1, scope: !669, file: !351, line: 284, type: !672)
!674 = !DILocation(line: 284, column: 41, scope: !669)
!675 = !DILocalVariable(name: "i", scope: !669, file: !351, line: 286, type: !361)
!676 = !DILocation(line: 286, column: 9, scope: !669)
!677 = !DILocation(line: 288, column: 10, scope: !678)
!678 = distinct !DILexicalBlock(scope: !669, file: !351, line: 288, column: 9)
!679 = !DILocation(line: 288, column: 15, scope: !678)
!680 = !DILocation(line: 288, column: 20, scope: !681)
!681 = !DILexicalBlockFile(scope: !678, file: !351, discriminator: 1)
!682 = !DILocation(line: 288, column: 19, scope: !681)
!683 = !DILocation(line: 288, column: 9, scope: !681)
!684 = !DILocation(line: 289, column: 9, scope: !678)
!685 = !DILocation(line: 291, column: 12, scope: !686)
!686 = distinct !DILexicalBlock(scope: !669, file: !351, line: 291, column: 5)
!687 = !DILocation(line: 291, column: 10, scope: !686)
!688 = !DILocation(line: 291, column: 17, scope: !689)
!689 = !DILexicalBlockFile(scope: !690, file: !351, discriminator: 1)
!690 = distinct !DILexicalBlock(scope: !686, file: !351, line: 291, column: 5)
!691 = !DILocation(line: 291, column: 19, scope: !689)
!692 = !DILocation(line: 291, column: 5, scope: !689)
!693 = !DILocation(line: 292, column: 47, scope: !694)
!694 = distinct !DILexicalBlock(scope: !690, file: !351, line: 291, column: 29)
!695 = !DILocation(line: 292, column: 32, scope: !694)
!696 = !DILocation(line: 292, column: 34, scope: !694)
!697 = !DILocation(line: 292, column: 33, scope: !694)
!698 = !DILocation(line: 292, column: 41, scope: !694)
!699 = !DILocation(line: 292, column: 9, scope: !694)
!700 = !DILocation(line: 293, column: 5, scope: !694)
!701 = !DILocation(line: 291, column: 25, scope: !702)
!702 = !DILexicalBlockFile(scope: !690, file: !351, discriminator: 2)
!703 = !DILocation(line: 291, column: 5, scope: !702)
!704 = distinct !{!704, !705}
!705 = !DILocation(line: 291, column: 5, scope: !669)
!706 = !DILocation(line: 295, column: 14, scope: !669)
!707 = !DILocation(line: 295, column: 5, scope: !669)
!708 = !DILocation(line: 296, column: 1, scope: !669)
!709 = !DILocation(line: 296, column: 1, scope: !710)
!710 = !DILexicalBlockFile(scope: !669, file: !351, discriminator: 1)
!711 = distinct !DISubprogram(name: "ff_frame_pool_audio_init", scope: !351, file: !351, line: 119, type: !712, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !394)
!712 = !DISubroutineType(types: !713)
!713 = !{!354, !378, !361, !361, !213, !361}
!714 = !DILocalVariable(name: "alloc", arg: 1, scope: !711, file: !351, line: 119, type: !378)
!715 = !DILocation(line: 119, column: 54, scope: !711)
!716 = !DILocalVariable(name: "channels", arg: 2, scope: !711, file: !351, line: 120, type: !361)
!717 = !DILocation(line: 120, column: 43, scope: !711)
!718 = !DILocalVariable(name: "nb_samples", arg: 3, scope: !711, file: !351, line: 121, type: !361)
!719 = !DILocation(line: 121, column: 43, scope: !711)
!720 = !DILocalVariable(name: "format", arg: 4, scope: !711, file: !351, line: 122, type: !213)
!721 = !DILocation(line: 122, column: 59, scope: !711)
!722 = !DILocalVariable(name: "align", arg: 5, scope: !711, file: !351, line: 123, type: !361)
!723 = !DILocation(line: 123, column: 43, scope: !711)
!724 = !DILocalVariable(name: "ret", scope: !711, file: !351, line: 125, type: !361)
!725 = !DILocation(line: 125, column: 9, scope: !711)
!726 = !DILocalVariable(name: "planar", scope: !711, file: !351, line: 125, type: !361)
!727 = !DILocation(line: 125, column: 14, scope: !711)
!728 = !DILocalVariable(name: "pool", scope: !711, file: !351, line: 126, type: !354)
!729 = !DILocation(line: 126, column: 18, scope: !711)
!730 = !DILocation(line: 128, column: 12, scope: !711)
!731 = !DILocation(line: 128, column: 10, scope: !711)
!732 = !DILocation(line: 129, column: 10, scope: !733)
!733 = distinct !DILexicalBlock(scope: !711, file: !351, line: 129, column: 9)
!734 = !DILocation(line: 129, column: 9, scope: !711)
!735 = !DILocation(line: 130, column: 9, scope: !733)
!736 = !DILocation(line: 132, column: 38, scope: !711)
!737 = !DILocation(line: 132, column: 14, scope: !711)
!738 = !DILocation(line: 132, column: 12, scope: !711)
!739 = !DILocation(line: 134, column: 5, scope: !711)
!740 = !DILocation(line: 134, column: 11, scope: !711)
!741 = !DILocation(line: 134, column: 16, scope: !711)
!742 = !DILocation(line: 135, column: 20, scope: !711)
!743 = !DILocation(line: 135, column: 29, scope: !744)
!744 = !DILexicalBlockFile(scope: !711, file: !351, discriminator: 1)
!745 = !DILocation(line: 135, column: 20, scope: !744)
!746 = !DILocation(line: 135, column: 20, scope: !747)
!747 = !DILexicalBlockFile(scope: !711, file: !351, discriminator: 2)
!748 = !DILocation(line: 135, column: 20, scope: !749)
!749 = !DILexicalBlockFile(scope: !711, file: !351, discriminator: 3)
!750 = !DILocation(line: 135, column: 5, scope: !749)
!751 = !DILocation(line: 135, column: 11, scope: !749)
!752 = !DILocation(line: 135, column: 18, scope: !749)
!753 = !DILocation(line: 136, column: 22, scope: !711)
!754 = !DILocation(line: 136, column: 5, scope: !711)
!755 = !DILocation(line: 136, column: 11, scope: !711)
!756 = !DILocation(line: 136, column: 20, scope: !711)
!757 = !DILocation(line: 137, column: 24, scope: !711)
!758 = !DILocation(line: 137, column: 5, scope: !711)
!759 = !DILocation(line: 137, column: 11, scope: !711)
!760 = !DILocation(line: 137, column: 22, scope: !711)
!761 = !DILocation(line: 138, column: 20, scope: !711)
!762 = !DILocation(line: 138, column: 5, scope: !711)
!763 = !DILocation(line: 138, column: 11, scope: !711)
!764 = !DILocation(line: 138, column: 18, scope: !711)
!765 = !DILocation(line: 139, column: 19, scope: !711)
!766 = !DILocation(line: 139, column: 5, scope: !711)
!767 = !DILocation(line: 139, column: 11, scope: !711)
!768 = !DILocation(line: 139, column: 17, scope: !711)
!769 = !DILocation(line: 141, column: 39, scope: !711)
!770 = !DILocation(line: 141, column: 45, scope: !711)
!771 = !DILocation(line: 141, column: 58, scope: !711)
!772 = !DILocation(line: 142, column: 38, scope: !711)
!773 = !DILocation(line: 142, column: 50, scope: !711)
!774 = !DILocation(line: 141, column: 11, scope: !711)
!775 = !DILocation(line: 141, column: 9, scope: !711)
!776 = !DILocation(line: 143, column: 9, scope: !777)
!777 = distinct !DILexicalBlock(scope: !711, file: !351, line: 143, column: 9)
!778 = !DILocation(line: 143, column: 13, scope: !777)
!779 = !DILocation(line: 143, column: 9, scope: !711)
!780 = !DILocation(line: 144, column: 9, scope: !777)
!781 = !DILocation(line: 146, column: 42, scope: !711)
!782 = !DILocation(line: 146, column: 48, scope: !711)
!783 = !DILocation(line: 146, column: 22, scope: !711)
!784 = !DILocation(line: 146, column: 5, scope: !711)
!785 = !DILocation(line: 146, column: 11, scope: !711)
!786 = !DILocation(line: 146, column: 20, scope: !711)
!787 = !DILocation(line: 147, column: 10, scope: !788)
!788 = distinct !DILexicalBlock(scope: !711, file: !351, line: 147, column: 9)
!789 = !DILocation(line: 147, column: 16, scope: !788)
!790 = !DILocation(line: 147, column: 9, scope: !711)
!791 = !DILocation(line: 148, column: 9, scope: !788)
!792 = !DILocation(line: 150, column: 12, scope: !711)
!793 = !DILocation(line: 150, column: 5, scope: !711)
!794 = !DILocation(line: 153, column: 5, scope: !711)
!795 = !DILocation(line: 154, column: 5, scope: !711)
!796 = !DILocation(line: 155, column: 1, scope: !711)
!797 = distinct !DISubprogram(name: "ff_frame_pool_get_video_config", scope: !351, file: !351, line: 157, type: !798, isLocal: false, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !394)
!798 = !DISubroutineType(types: !799)
!799 = !{!361, !354, !800, !800, !801, !800}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!802 = !DILocalVariable(name: "pool", arg: 1, scope: !797, file: !351, line: 157, type: !354)
!803 = !DILocation(line: 157, column: 49, scope: !797)
!804 = !DILocalVariable(name: "width", arg: 2, scope: !797, file: !351, line: 158, type: !800)
!805 = !DILocation(line: 158, column: 41, scope: !797)
!806 = !DILocalVariable(name: "height", arg: 3, scope: !797, file: !351, line: 159, type: !800)
!807 = !DILocation(line: 159, column: 41, scope: !797)
!808 = !DILocalVariable(name: "format", arg: 4, scope: !797, file: !351, line: 160, type: !801)
!809 = !DILocation(line: 160, column: 56, scope: !797)
!810 = !DILocalVariable(name: "align", arg: 5, scope: !797, file: !351, line: 161, type: !800)
!811 = !DILocation(line: 161, column: 41, scope: !797)
!812 = !DILocation(line: 163, column: 10, scope: !813)
!813 = distinct !DILexicalBlock(scope: !797, file: !351, line: 163, column: 9)
!814 = !DILocation(line: 163, column: 9, scope: !797)
!815 = !DILocation(line: 164, column: 9, scope: !813)
!816 = !DILocation(line: 166, column: 5, scope: !797)
!817 = distinct !{!817, !816}
!818 = !DILocation(line: 166, column: 16, scope: !819)
!819 = !DILexicalBlockFile(scope: !820, file: !351, discriminator: 1)
!820 = distinct !DILexicalBlock(scope: !821, file: !351, line: 166, column: 14)
!821 = distinct !DILexicalBlock(scope: !797, file: !351, line: 166, column: 8)
!822 = !DILocation(line: 166, column: 22, scope: !819)
!823 = !DILocation(line: 166, column: 27, scope: !819)
!824 = !DILocation(line: 166, column: 14, scope: !819)
!825 = !DILocation(line: 166, column: 53, scope: !826)
!826 = !DILexicalBlockFile(scope: !827, file: !351, discriminator: 2)
!827 = distinct !DILexicalBlock(scope: !820, file: !351, line: 166, column: 51)
!828 = !DILocation(line: 166, column: 112, scope: !829)
!829 = !DILexicalBlockFile(scope: !826, file: !351, discriminator: 4)
!830 = !DILocation(line: 166, column: 112, scope: !826)
!831 = !DILocation(line: 166, column: 123, scope: !832)
!832 = !DILexicalBlockFile(scope: !821, file: !351, discriminator: 3)
!833 = !DILocation(line: 168, column: 14, scope: !797)
!834 = !DILocation(line: 168, column: 20, scope: !797)
!835 = !DILocation(line: 168, column: 6, scope: !797)
!836 = !DILocation(line: 168, column: 12, scope: !797)
!837 = !DILocation(line: 169, column: 15, scope: !797)
!838 = !DILocation(line: 169, column: 21, scope: !797)
!839 = !DILocation(line: 169, column: 6, scope: !797)
!840 = !DILocation(line: 169, column: 13, scope: !797)
!841 = !DILocation(line: 170, column: 15, scope: !797)
!842 = !DILocation(line: 170, column: 21, scope: !797)
!843 = !DILocation(line: 170, column: 6, scope: !797)
!844 = !DILocation(line: 170, column: 13, scope: !797)
!845 = !DILocation(line: 171, column: 14, scope: !797)
!846 = !DILocation(line: 171, column: 20, scope: !797)
!847 = !DILocation(line: 171, column: 6, scope: !797)
!848 = !DILocation(line: 171, column: 12, scope: !797)
!849 = !DILocation(line: 173, column: 5, scope: !797)
!850 = !DILocation(line: 174, column: 1, scope: !797)
!851 = distinct !DISubprogram(name: "ff_frame_pool_get_audio_config", scope: !351, file: !351, line: 176, type: !852, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !394)
!852 = !DISubroutineType(types: !853)
!853 = !{!361, !354, !800, !800, !854, !800}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!855 = !DILocalVariable(name: "pool", arg: 1, scope: !851, file: !351, line: 176, type: !354)
!856 = !DILocation(line: 176, column: 49, scope: !851)
!857 = !DILocalVariable(name: "channels", arg: 2, scope: !851, file: !351, line: 177, type: !800)
!858 = !DILocation(line: 177, column: 41, scope: !851)
!859 = !DILocalVariable(name: "nb_samples", arg: 3, scope: !851, file: !351, line: 178, type: !800)
!860 = !DILocation(line: 178, column: 41, scope: !851)
!861 = !DILocalVariable(name: "format", arg: 4, scope: !851, file: !351, line: 179, type: !854)
!862 = !DILocation(line: 179, column: 57, scope: !851)
!863 = !DILocalVariable(name: "align", arg: 5, scope: !851, file: !351, line: 180, type: !800)
!864 = !DILocation(line: 180, column: 41, scope: !851)
!865 = !DILocation(line: 182, column: 10, scope: !866)
!866 = distinct !DILexicalBlock(scope: !851, file: !351, line: 182, column: 9)
!867 = !DILocation(line: 182, column: 9, scope: !851)
!868 = !DILocation(line: 183, column: 9, scope: !866)
!869 = !DILocation(line: 185, column: 5, scope: !851)
!870 = distinct !{!870, !869}
!871 = !DILocation(line: 185, column: 16, scope: !872)
!872 = !DILexicalBlockFile(scope: !873, file: !351, discriminator: 1)
!873 = distinct !DILexicalBlock(scope: !874, file: !351, line: 185, column: 14)
!874 = distinct !DILexicalBlock(scope: !851, file: !351, line: 185, column: 8)
!875 = !DILocation(line: 185, column: 22, scope: !872)
!876 = !DILocation(line: 185, column: 27, scope: !872)
!877 = !DILocation(line: 185, column: 14, scope: !872)
!878 = !DILocation(line: 185, column: 53, scope: !879)
!879 = !DILexicalBlockFile(scope: !880, file: !351, discriminator: 2)
!880 = distinct !DILexicalBlock(scope: !873, file: !351, line: 185, column: 51)
!881 = !DILocation(line: 185, column: 112, scope: !882)
!882 = !DILexicalBlockFile(scope: !879, file: !351, discriminator: 4)
!883 = !DILocation(line: 185, column: 112, scope: !879)
!884 = !DILocation(line: 185, column: 123, scope: !885)
!885 = !DILexicalBlockFile(scope: !874, file: !351, discriminator: 3)
!886 = !DILocation(line: 187, column: 17, scope: !851)
!887 = !DILocation(line: 187, column: 23, scope: !851)
!888 = !DILocation(line: 187, column: 6, scope: !851)
!889 = !DILocation(line: 187, column: 15, scope: !851)
!890 = !DILocation(line: 188, column: 19, scope: !851)
!891 = !DILocation(line: 188, column: 25, scope: !851)
!892 = !DILocation(line: 188, column: 6, scope: !851)
!893 = !DILocation(line: 188, column: 17, scope: !851)
!894 = !DILocation(line: 189, column: 15, scope: !851)
!895 = !DILocation(line: 189, column: 21, scope: !851)
!896 = !DILocation(line: 189, column: 6, scope: !851)
!897 = !DILocation(line: 189, column: 13, scope: !851)
!898 = !DILocation(line: 190, column: 14, scope: !851)
!899 = !DILocation(line: 190, column: 20, scope: !851)
!900 = !DILocation(line: 190, column: 6, scope: !851)
!901 = !DILocation(line: 190, column: 12, scope: !851)
!902 = !DILocation(line: 192, column: 5, scope: !851)
!903 = !DILocation(line: 193, column: 1, scope: !851)
!904 = distinct !DISubprogram(name: "ff_frame_pool_get", scope: !351, file: !351, line: 195, type: !905, isLocal: false, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !394)
!905 = !DISubroutineType(types: !906)
!906 = !{!907, !354}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64, align: 64)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !241, line: 646, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !241, line: 268, size: 4288, align: 64, elements: !910)
!910 = !{!911, !915, !917, !919, !920, !921, !922, !923, !924, !925, !932, !935, !936, !937, !938, !939, !940, !941, !943, !944, !945, !946, !947, !948, !949, !950, !952, !954, !955, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !988, !989, !990, !991, !992, !993, !996, !997, !998, !999}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !909, file: !241, line: 282, baseType: !912, size: 512, align: 64)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 512, align: 64, elements: !913)
!913 = !{!914}
!914 = !DISubrange(count: 8)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !909, file: !241, line: 299, baseType: !916, size: 256, align: 32, offset: 512)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 256, align: 32, elements: !913)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !909, file: !241, line: 315, baseType: !918, size: 64, align: 64, offset: 768)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !909, file: !241, line: 326, baseType: !361, size: 32, align: 32, offset: 832)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !909, file: !241, line: 326, baseType: !361, size: 32, align: 32, offset: 864)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !909, file: !241, line: 334, baseType: !361, size: 32, align: 32, offset: 896)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !909, file: !241, line: 341, baseType: !361, size: 32, align: 32, offset: 928)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !909, file: !241, line: 346, baseType: !361, size: 32, align: 32, offset: 960)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !909, file: !241, line: 351, baseType: !230, size: 32, align: 32, offset: 992)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !909, file: !241, line: 356, baseType: !926, size: 64, align: 32, offset: 1024)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !927, line: 61, baseType: !928)
!927 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !927, line: 58, size: 64, align: 32, elements: !929)
!929 = !{!930, !931}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !928, file: !927, line: 59, baseType: !361, size: 32, align: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !928, file: !927, line: 60, baseType: !361, size: 32, align: 32, offset: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !909, file: !241, line: 361, baseType: !933, size: 64, align: 64, offset: 1088)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !345, line: 40, baseType: !934)
!934 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !909, file: !241, line: 369, baseType: !933, size: 64, align: 64, offset: 1152)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !909, file: !241, line: 377, baseType: !933, size: 64, align: 64, offset: 1216)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !909, file: !241, line: 382, baseType: !361, size: 32, align: 32, offset: 1280)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !909, file: !241, line: 386, baseType: !361, size: 32, align: 32, offset: 1312)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !909, file: !241, line: 391, baseType: !361, size: 32, align: 32, offset: 1344)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !909, file: !241, line: 396, baseType: !342, size: 64, align: 64, offset: 1408)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !909, file: !241, line: 403, baseType: !942, size: 512, align: 64, offset: 1472)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 512, align: 64, elements: !913)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !909, file: !241, line: 410, baseType: !361, size: 32, align: 32, offset: 1984)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !909, file: !241, line: 415, baseType: !361, size: 32, align: 32, offset: 2016)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !909, file: !241, line: 420, baseType: !361, size: 32, align: 32, offset: 2048)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !909, file: !241, line: 425, baseType: !361, size: 32, align: 32, offset: 2080)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !909, file: !241, line: 435, baseType: !933, size: 64, align: 64, offset: 2112)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !909, file: !241, line: 440, baseType: !361, size: 32, align: 32, offset: 2176)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !909, file: !241, line: 445, baseType: !427, size: 64, align: 64, offset: 2240)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !909, file: !241, line: 459, baseType: !951, size: 512, align: 64, offset: 2304)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 512, align: 64, elements: !913)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !909, file: !241, line: 473, baseType: !953, size: 64, align: 64, offset: 2816)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !909, file: !241, line: 477, baseType: !361, size: 32, align: 32, offset: 2880)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !909, file: !241, line: 479, baseType: !956, size: 64, align: 64, offset: 2944)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !241, line: 207, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !241, line: 201, size: 320, align: 64, elements: !960)
!960 = !{!961, !962, !963, !964, !969}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !959, file: !241, line: 202, baseType: !240, size: 32, align: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !959, file: !241, line: 203, baseType: !390, size: 64, align: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !959, file: !241, line: 204, baseType: !361, size: 32, align: 32, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !959, file: !241, line: 205, baseType: !965, size: 64, align: 64, offset: 192)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !967, line: 86, baseType: !968)
!967 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!968 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !967, line: 86, flags: DIFlagFwdDecl)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !959, file: !241, line: 206, baseType: !381, size: 64, align: 64, offset: 256)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !909, file: !241, line: 480, baseType: !361, size: 32, align: 32, offset: 3008)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !909, file: !241, line: 505, baseType: !361, size: 32, align: 32, offset: 3040)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !909, file: !241, line: 512, baseType: !264, size: 32, align: 32, offset: 3072)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !909, file: !241, line: 514, baseType: !270, size: 32, align: 32, offset: 3104)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !909, file: !241, line: 516, baseType: !288, size: 32, align: 32, offset: 3136)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !909, file: !241, line: 523, baseType: !312, size: 32, align: 32, offset: 3168)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !909, file: !241, line: 525, baseType: !331, size: 32, align: 32, offset: 3200)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !909, file: !241, line: 532, baseType: !933, size: 64, align: 64, offset: 3264)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !909, file: !241, line: 539, baseType: !933, size: 64, align: 64, offset: 3328)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !909, file: !241, line: 547, baseType: !933, size: 64, align: 64, offset: 3392)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !909, file: !241, line: 554, baseType: !965, size: 64, align: 64, offset: 3456)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !909, file: !241, line: 563, baseType: !361, size: 32, align: 32, offset: 3520)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !909, file: !241, line: 572, baseType: !361, size: 32, align: 32, offset: 3552)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !909, file: !241, line: 581, baseType: !361, size: 32, align: 32, offset: 3584)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !909, file: !241, line: 588, baseType: !985, size: 64, align: 64, offset: 3648)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !345, line: 36, baseType: !987)
!987 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !909, file: !241, line: 593, baseType: !361, size: 32, align: 32, offset: 3712)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !909, file: !241, line: 596, baseType: !361, size: 32, align: 32, offset: 3744)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !909, file: !241, line: 599, baseType: !381, size: 64, align: 64, offset: 3776)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !909, file: !241, line: 605, baseType: !381, size: 64, align: 64, offset: 3840)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !909, file: !241, line: 616, baseType: !381, size: 64, align: 64, offset: 3904)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !909, file: !241, line: 626, baseType: !994, size: 64, align: 64, offset: 3968)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !995, line: 216, baseType: !428)
!995 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!996 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !909, file: !241, line: 627, baseType: !994, size: 64, align: 64, offset: 4032)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !909, file: !241, line: 628, baseType: !994, size: 64, align: 64, offset: 4096)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !909, file: !241, line: 629, baseType: !994, size: 64, align: 64, offset: 4160)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !909, file: !241, line: 645, baseType: !381, size: 64, align: 64, offset: 4224)
!1000 = !DILocalVariable(name: "pool", arg: 1, scope: !904, file: !351, line: 195, type: !354)
!1001 = !DILocation(line: 195, column: 41, scope: !904)
!1002 = !DILocalVariable(name: "i", scope: !904, file: !351, line: 197, type: !361)
!1003 = !DILocation(line: 197, column: 9, scope: !904)
!1004 = !DILocalVariable(name: "frame", scope: !904, file: !351, line: 198, type: !907)
!1005 = !DILocation(line: 198, column: 14, scope: !904)
!1006 = !DILocalVariable(name: "desc", scope: !904, file: !351, line: 199, type: !413)
!1007 = !DILocation(line: 199, column: 31, scope: !904)
!1008 = !DILocation(line: 201, column: 13, scope: !904)
!1009 = !DILocation(line: 201, column: 11, scope: !904)
!1010 = !DILocation(line: 202, column: 10, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !904, file: !351, line: 202, column: 9)
!1012 = !DILocation(line: 202, column: 9, scope: !904)
!1013 = !DILocation(line: 203, column: 9, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1011, file: !351, line: 202, column: 17)
!1015 = !DILocation(line: 206, column: 12, scope: !904)
!1016 = !DILocation(line: 206, column: 18, scope: !904)
!1017 = !DILocation(line: 206, column: 5, scope: !904)
!1018 = !DILocation(line: 208, column: 36, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !904, file: !351, line: 206, column: 24)
!1020 = !DILocation(line: 208, column: 42, scope: !1019)
!1021 = !DILocation(line: 208, column: 16, scope: !1019)
!1022 = !DILocation(line: 208, column: 14, scope: !1019)
!1023 = !DILocation(line: 209, column: 14, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1019, file: !351, line: 209, column: 13)
!1025 = !DILocation(line: 209, column: 13, scope: !1019)
!1026 = !DILocation(line: 210, column: 13, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1024, file: !351, line: 209, column: 20)
!1028 = !DILocation(line: 213, column: 24, scope: !1019)
!1029 = !DILocation(line: 213, column: 30, scope: !1019)
!1030 = !DILocation(line: 213, column: 9, scope: !1019)
!1031 = !DILocation(line: 213, column: 16, scope: !1019)
!1032 = !DILocation(line: 213, column: 22, scope: !1019)
!1033 = !DILocation(line: 214, column: 25, scope: !1019)
!1034 = !DILocation(line: 214, column: 31, scope: !1019)
!1035 = !DILocation(line: 214, column: 9, scope: !1019)
!1036 = !DILocation(line: 214, column: 16, scope: !1019)
!1037 = !DILocation(line: 214, column: 23, scope: !1019)
!1038 = !DILocation(line: 215, column: 25, scope: !1019)
!1039 = !DILocation(line: 215, column: 31, scope: !1019)
!1040 = !DILocation(line: 215, column: 9, scope: !1019)
!1041 = !DILocation(line: 215, column: 16, scope: !1019)
!1042 = !DILocation(line: 215, column: 23, scope: !1019)
!1043 = !DILocation(line: 217, column: 16, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1019, file: !351, line: 217, column: 9)
!1045 = !DILocation(line: 217, column: 14, scope: !1044)
!1046 = !DILocation(line: 217, column: 21, scope: !1047)
!1047 = !DILexicalBlockFile(scope: !1048, file: !351, discriminator: 1)
!1048 = distinct !DILexicalBlock(scope: !1044, file: !351, line: 217, column: 9)
!1049 = !DILocation(line: 217, column: 23, scope: !1047)
!1050 = !DILocation(line: 217, column: 9, scope: !1047)
!1051 = !DILocation(line: 218, column: 49, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1048, file: !351, line: 217, column: 33)
!1053 = !DILocation(line: 218, column: 34, scope: !1052)
!1054 = !DILocation(line: 218, column: 40, scope: !1052)
!1055 = !DILocation(line: 218, column: 29, scope: !1052)
!1056 = !DILocation(line: 218, column: 13, scope: !1052)
!1057 = !DILocation(line: 218, column: 20, scope: !1052)
!1058 = !DILocation(line: 218, column: 32, scope: !1052)
!1059 = !DILocation(line: 219, column: 30, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1052, file: !351, line: 219, column: 17)
!1061 = !DILocation(line: 219, column: 18, scope: !1060)
