; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--vf_fade.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--vf_fade.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFilterPad = type { i8*, i32, %struct.AVFrame* (%struct.AVFilterLink*, i32, i32)*, %struct.AVFrame* (%struct.AVFilterLink*, i32)*, i32 (%struct.AVFilterLink*, %struct.AVFrame*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32, i32 }
%struct.AVFrame = type { [8 x i8*], [8 x i32], i8**, i32, i32, i32, i32, i32, i32, %struct.AVRational, i64, i64, i64, i32, i32, i32, i8*, [8 x i64], i32, i32, i32, i32, i64, i32, i64, [8 x %struct.AVBufferRef*], %struct.AVBufferRef**, i32, %struct.AVFrameSideData**, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, %struct.AVDictionary*, i32, i32, i32, i8*, i32, i32, %struct.AVBufferRef*, %struct.AVBufferRef*, %struct.AVBufferRef*, i64, i64, i64, i64, %struct.AVBufferRef* }
%struct.AVRational = type { i32, i32 }
%struct.AVFrameSideData = type { i32, i8*, i32, %struct.AVDictionary*, %struct.AVBufferRef* }
%struct.AVDictionary = type opaque
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !48, line: 538, size: 32, align: 32, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!118 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!119 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!120 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!121 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!122 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!123 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!124 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVOptionType", file: !126, line: 221, size: 32, align: 32, elements: !127)
!126 = !DIFile(filename: "./libavutil/opt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146}
!128 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!129 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!130 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!131 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!132 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!133 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!134 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!135 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!136 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!137 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!138 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!139 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!140 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!141 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!142 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!143 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!144 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!145 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!146 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !148, line: 29, size: 32, align: 32, elements: !149)
!148 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167}
!150 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!151 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!152 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!153 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!154 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!155 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!156 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!157 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!158 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!159 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!160 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!161 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!162 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!163 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!164 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!165 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!166 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!167 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !170, file: !169, line: 503, size: 32, align: 32, elements: !576)
!169 = !DIFile(filename: "libavfilter/avfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterLink", file: !169, line: 439, size: 493504, align: 64, elements: !171)
!171 = !{!172, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !537, !538, !539, !540, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !170, file: !169, line: 440, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterContext", file: !169, line: 67, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterContext", file: !169, line: 338, size: 1344, align: 64, elements: !176)
!176 = !{!177, !264, !437, !438, !440, !442, !444, !445, !446, !447, !448, !488, !489, !495, !504, !505, !506, !508, !509, !510, !511, !512}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !175, file: !169, line: 339, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !148, line: 143, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !148, line: 67, size: 640, align: 64, elements: !182)
!182 = !{!183, !187, !192, !223, !224, !225, !226, !230, !236, !238, !242}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !181, file: !148, line: 72, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !181, file: !148, line: 78, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!184, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !181, file: !148, line: 85, baseType: !193, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !126, line: 246, size: 512, align: 64, elements: !196)
!196 = !{!197, !198, !199, !201, !202, !219, !220, !221, !222}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !126, line: 247, baseType: !184, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !195, file: !126, line: 253, baseType: !184, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !195, file: !126, line: 259, baseType: !200, size: 32, align: 32, offset: 128)
!200 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !126, line: 260, baseType: !125, size: 32, align: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !195, file: !126, line: 271, baseType: !203, size: 64, align: 64, offset: 192)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !195, file: !126, line: 265, size: 64, align: 64, elements: !204)
!204 = !{!205, !209, !211, !212}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !203, file: !126, line: 266, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !207, line: 197, baseType: !208)
!207 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!208 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !203, file: !126, line: 267, baseType: !210, size: 64, align: 64)
!210 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !203, file: !126, line: 268, baseType: !184, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !203, file: !126, line: 270, baseType: !213, size: 64, align: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !214, line: 61, baseType: !215)
!214 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !214, line: 58, size: 64, align: 32, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !215, file: !214, line: 59, baseType: !200, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !215, file: !214, line: 60, baseType: !200, size: 32, align: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !195, file: !126, line: 272, baseType: !210, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !195, file: !126, line: 273, baseType: !210, size: 64, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !195, file: !126, line: 275, baseType: !200, size: 32, align: 32, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !195, file: !126, line: 300, baseType: !184, size: 64, align: 64, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !181, file: !148, line: 93, baseType: !200, size: 32, align: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !181, file: !148, line: 99, baseType: !200, size: 32, align: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !181, file: !148, line: 108, baseType: !200, size: 32, align: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !181, file: !148, line: 113, baseType: !227, size: 64, align: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!191, !191, !191}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !181, file: !148, line: 123, baseType: !231, size: 64, align: 64, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!234, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !181, file: !148, line: 130, baseType: !237, size: 32, align: 32, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !148, line: 48, baseType: !147)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !181, file: !148, line: 136, baseType: !239, size: 64, align: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!237, !191}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !181, file: !148, line: 142, baseType: !243, size: 64, align: 64, offset: 576)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!200, !246, !191, !184, !200}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !126, line: 329, size: 128, align: 64, elements: !249)
!249 = !{!250, !262, !263}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !248, file: !126, line: 360, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !126, line: 324, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !126, line: 306, size: 384, align: 64, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !254, file: !126, line: 307, baseType: !184, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !254, file: !126, line: 313, baseType: !210, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !254, file: !126, line: 313, baseType: !210, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !254, file: !126, line: 318, baseType: !210, size: 64, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !254, file: !126, line: 318, baseType: !210, size: 64, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !254, file: !126, line: 323, baseType: !200, size: 32, align: 32, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !248, file: !126, line: 364, baseType: !200, size: 32, align: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !248, file: !126, line: 368, baseType: !200, size: 32, align: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !175, file: !169, line: 341, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilter", file: !169, line: 328, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilter", file: !169, line: 144, size: 1024, align: 64, elements: !269)
!269 = !{!270, !271, !272, !405, !406, !407, !408, !412, !413, !418, !422, !423, !424, !425, !427, !432, !436}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !169, line: 148, baseType: !184, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !268, file: !169, line: 155, baseType: !184, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !268, file: !169, line: 164, baseType: !273, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterPad", file: !169, line: 69, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterPad", file: !277, line: 54, size: 576, align: 64, elements: !278)
!277 = !DIFile(filename: "libavfilter/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!278 = !{!279, !280, !281, !389, !393, !397, !401, !402, !403, !404}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !277, line: 60, baseType: !184, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !276, file: !277, line: 65, baseType: !3, size: 32, align: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "get_video_buffer", scope: !276, file: !277, line: 73, baseType: !282, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!285, !387, !200, !200}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !24, line: 646, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !24, line: 268, size: 4288, align: 64, elements: !288)
!288 = !{!289, !297, !299, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !319, !320, !321, !322, !323, !324, !325, !326, !339, !341, !342, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !375, !376, !377, !378, !379, !380, !383, !384, !385, !386}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !287, file: !24, line: 282, baseType: !290, size: 512, align: 64)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 512, align: 64, elements: !295)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !293, line: 48, baseType: !294)
!293 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!294 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!295 = !{!296}
!296 = !DISubrange(count: 8)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !287, file: !24, line: 299, baseType: !298, size: 256, align: 32, offset: 512)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 256, align: 32, elements: !295)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !287, file: !24, line: 315, baseType: !300, size: 64, align: 64, offset: 768)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !287, file: !24, line: 326, baseType: !200, size: 32, align: 32, offset: 832)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !287, file: !24, line: 326, baseType: !200, size: 32, align: 32, offset: 864)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !287, file: !24, line: 334, baseType: !200, size: 32, align: 32, offset: 896)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !287, file: !24, line: 341, baseType: !200, size: 32, align: 32, offset: 928)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !287, file: !24, line: 346, baseType: !200, size: 32, align: 32, offset: 960)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !287, file: !24, line: 351, baseType: !13, size: 32, align: 32, offset: 992)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !287, file: !24, line: 356, baseType: !213, size: 64, align: 32, offset: 1024)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !287, file: !24, line: 361, baseType: !206, size: 64, align: 64, offset: 1088)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !287, file: !24, line: 369, baseType: !206, size: 64, align: 64, offset: 1152)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !287, file: !24, line: 377, baseType: !206, size: 64, align: 64, offset: 1216)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !287, file: !24, line: 382, baseType: !200, size: 32, align: 32, offset: 1280)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !287, file: !24, line: 386, baseType: !200, size: 32, align: 32, offset: 1312)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !287, file: !24, line: 391, baseType: !200, size: 32, align: 32, offset: 1344)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !287, file: !24, line: 396, baseType: !191, size: 64, align: 64, offset: 1408)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !287, file: !24, line: 403, baseType: !316, size: 512, align: 64, offset: 1472)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 512, align: 64, elements: !295)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !293, line: 55, baseType: !318)
!318 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !287, file: !24, line: 410, baseType: !200, size: 32, align: 32, offset: 1984)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !287, file: !24, line: 415, baseType: !200, size: 32, align: 32, offset: 2016)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !287, file: !24, line: 420, baseType: !200, size: 32, align: 32, offset: 2048)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !287, file: !24, line: 425, baseType: !200, size: 32, align: 32, offset: 2080)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !287, file: !24, line: 435, baseType: !206, size: 64, align: 64, offset: 2112)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !287, file: !24, line: 440, baseType: !200, size: 32, align: 32, offset: 2176)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !287, file: !24, line: 445, baseType: !317, size: 64, align: 64, offset: 2240)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !287, file: !24, line: 459, baseType: !327, size: 512, align: 64, offset: 2304)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 512, align: 64, elements: !295)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !330, line: 94, baseType: !331)
!330 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !330, line: 81, size: 192, align: 64, elements: !332)
!332 = !{!333, !337, !338}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !331, file: !330, line: 82, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !330, line: 73, baseType: !336)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !330, line: 73, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !331, file: !330, line: 89, baseType: !291, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !331, file: !330, line: 93, baseType: !200, size: 32, align: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !287, file: !24, line: 473, baseType: !340, size: 64, align: 64, offset: 2816)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !287, file: !24, line: 477, baseType: !200, size: 32, align: 32, offset: 2880)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !287, file: !24, line: 479, baseType: !343, size: 64, align: 64, offset: 2944)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !24, line: 207, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !24, line: 201, size: 320, align: 64, elements: !347)
!347 = !{!348, !349, !350, !351, !356}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !346, file: !24, line: 202, baseType: !23, size: 32, align: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !346, file: !24, line: 203, baseType: !291, size: 64, align: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !346, file: !24, line: 204, baseType: !200, size: 32, align: 32, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !346, file: !24, line: 205, baseType: !352, size: 64, align: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !354, line: 86, baseType: !355)
!354 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !354, line: 86, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !346, file: !24, line: 206, baseType: !328, size: 64, align: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !287, file: !24, line: 480, baseType: !200, size: 32, align: 32, offset: 3008)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !24, line: 505, baseType: !200, size: 32, align: 32, offset: 3040)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !287, file: !24, line: 512, baseType: !47, size: 32, align: 32, offset: 3072)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !287, file: !24, line: 514, baseType: !54, size: 32, align: 32, offset: 3104)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !287, file: !24, line: 516, baseType: !72, size: 32, align: 32, offset: 3136)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !287, file: !24, line: 523, baseType: !96, size: 32, align: 32, offset: 3168)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !287, file: !24, line: 525, baseType: !115, size: 32, align: 32, offset: 3200)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !287, file: !24, line: 532, baseType: !206, size: 64, align: 64, offset: 3264)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !287, file: !24, line: 539, baseType: !206, size: 64, align: 64, offset: 3328)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !287, file: !24, line: 547, baseType: !206, size: 64, align: 64, offset: 3392)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !287, file: !24, line: 554, baseType: !352, size: 64, align: 64, offset: 3456)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !287, file: !24, line: 563, baseType: !200, size: 32, align: 32, offset: 3520)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !287, file: !24, line: 572, baseType: !200, size: 32, align: 32, offset: 3552)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !287, file: !24, line: 581, baseType: !200, size: 32, align: 32, offset: 3584)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !287, file: !24, line: 588, baseType: !372, size: 64, align: 64, offset: 3648)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !207, line: 194, baseType: !374)
!374 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !287, file: !24, line: 593, baseType: !200, size: 32, align: 32, offset: 3712)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !287, file: !24, line: 596, baseType: !200, size: 32, align: 32, offset: 3744)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !287, file: !24, line: 599, baseType: !328, size: 64, align: 64, offset: 3776)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !287, file: !24, line: 605, baseType: !328, size: 64, align: 64, offset: 3840)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !287, file: !24, line: 616, baseType: !328, size: 64, align: 64, offset: 3904)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !287, file: !24, line: 626, baseType: !381, size: 64, align: 64, offset: 3968)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !382, line: 216, baseType: !318)
!382 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!383 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !287, file: !24, line: 627, baseType: !381, size: 64, align: 64, offset: 4032)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !287, file: !24, line: 628, baseType: !381, size: 64, align: 64, offset: 4096)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !287, file: !24, line: 629, baseType: !381, size: 64, align: 64, offset: 4160)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !287, file: !24, line: 645, baseType: !328, size: 64, align: 64, offset: 4224)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterLink", file: !169, line: 68, baseType: !170)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "get_audio_buffer", scope: !276, file: !277, line: 81, baseType: !390, size: 64, align: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!285, !387, !200}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "filter_frame", scope: !276, file: !277, line: 93, baseType: !394, size: 64, align: 64, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!200, !387, !285}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "poll_frame", scope: !276, file: !277, line: 104, baseType: !398, size: 64, align: 64, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!200, !387}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "request_frame", scope: !276, file: !277, line: 113, baseType: !398, size: 64, align: 64, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "config_props", scope: !276, file: !277, line: 129, baseType: !398, size: 64, align: 64, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "needs_fifo", scope: !276, file: !277, line: 137, baseType: !200, size: 32, align: 32, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "needs_writable", scope: !276, file: !277, line: 145, baseType: !200, size: 32, align: 32, offset: 544)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !268, file: !169, line: 172, baseType: !273, size: 64, align: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !268, file: !169, line: 182, baseType: !178, size: 64, align: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !268, file: !169, line: 187, baseType: !200, size: 32, align: 32, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "preinit", scope: !268, file: !169, line: 210, baseType: !409, size: 64, align: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!200, !173}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !268, file: !169, line: 233, baseType: !409, size: 64, align: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "init_dict", scope: !268, file: !169, line: 246, baseType: !414, size: 64, align: 64, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!200, !173, !417}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !268, file: !169, line: 258, baseType: !419, size: 64, align: 64, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !173}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "query_formats", scope: !268, file: !169, line: 282, baseType: !409, size: 64, align: 64, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "priv_size", scope: !268, file: !169, line: 284, baseType: !200, size: 32, align: 32, offset: 704)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flags_internal", scope: !268, file: !169, line: 286, baseType: !200, size: 32, align: 32, offset: 736)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !169, line: 292, baseType: !426, size: 64, align: 64, offset: 768)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "process_command", scope: !268, file: !169, line: 306, baseType: !428, size: 64, align: 64, offset: 832)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!200, !173, !184, !184, !431, !200, !200}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "init_opaque", scope: !268, file: !169, line: 313, baseType: !433, size: 64, align: 64, offset: 896)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!200, !173, !191}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !268, file: !169, line: 327, baseType: !409, size: 64, align: 64, offset: 960)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !169, line: 343, baseType: !431, size: 64, align: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "input_pads", scope: !175, file: !169, line: 345, baseType: !439, size: 64, align: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !175, file: !169, line: 346, baseType: !441, size: 64, align: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !175, file: !169, line: 347, baseType: !443, size: 32, align: 32, offset: 320)
!443 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "output_pads", scope: !175, file: !169, line: 349, baseType: !439, size: 64, align: 64, offset: 384)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !175, file: !169, line: 350, baseType: !441, size: 64, align: 64, offset: 448)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "nb_outputs", scope: !175, file: !169, line: 351, baseType: !443, size: 32, align: 32, offset: 512)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !175, file: !169, line: 353, baseType: !191, size: 64, align: 64, offset: 576)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !175, file: !169, line: 355, baseType: !449, size: 64, align: 64, offset: 640)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraph", file: !169, line: 840, size: 768, align: 64, elements: !451)
!451 = !{!452, !453, !455, !456, !457, !458, !459, !460, !482, !483, !484, !485, !486, !487}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !450, file: !169, line: 841, baseType: !178, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !450, file: !169, line: 842, baseType: !454, size: 64, align: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "nb_filters", scope: !450, file: !169, line: 843, baseType: !443, size: 32, align: 32, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "scale_sws_opts", scope: !450, file: !169, line: 845, baseType: !431, size: 64, align: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "resample_lavr_opts", scope: !450, file: !169, line: 847, baseType: !431, size: 64, align: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !450, file: !169, line: 862, baseType: !200, size: 32, align: 32, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !450, file: !169, line: 869, baseType: !200, size: 32, align: 32, offset: 352)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !450, file: !169, line: 874, baseType: !461, size: 64, align: 64, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterGraphInternal", file: !169, line: 809, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraphInternal", file: !277, line: 148, size: 192, align: 64, elements: !464)
!464 = !{!465, !466, !476}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !463, file: !277, line: 149, baseType: !191, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "thread_execute", scope: !463, file: !277, line: 150, baseType: !467, size: 64, align: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_execute_func", file: !169, line: 837, baseType: !469)
!469 = !DISubroutineType(types: !470)
!470 = !{!200, !173, !471, !191, !475, !200}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_action_func", file: !169, line: 823, baseType: !473)
!473 = !DISubroutineType(types: !474)
!474 = !{!200, !173, !191, !200, !200}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "frame_queues", scope: !463, file: !277, line: 151, baseType: !477, size: 8, align: 8, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameQueueGlobal", file: !478, line: 48, baseType: !479)
!478 = !DIFile(filename: "libavfilter/framequeue.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameQueueGlobal", file: !478, line: 46, size: 8, align: 8, elements: !480)
!480 = !{!481}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !479, file: !478, line: 47, baseType: !186, size: 8, align: 8)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !450, file: !169, line: 881, baseType: !191, size: 64, align: 64, offset: 448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !450, file: !169, line: 895, baseType: !467, size: 64, align: 64, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "aresample_swr_opts", scope: !450, file: !169, line: 897, baseType: !431, size: 64, align: 64, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links", scope: !450, file: !169, line: 906, baseType: !441, size: 64, align: 64, offset: 640)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links_count", scope: !450, file: !169, line: 907, baseType: !200, size: 32, align: 32, offset: 704)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "disable_auto_convert", scope: !450, file: !169, line: 909, baseType: !443, size: 32, align: 32, offset: 736)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !175, file: !169, line: 373, baseType: !200, size: 32, align: 32, offset: 704)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !175, file: !169, line: 378, baseType: !490, size: 64, align: 64, offset: 768)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterInternal", file: !169, line: 335, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterInternal", file: !277, line: 154, size: 64, align: 64, elements: !493)
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !492, file: !277, line: 155, baseType: !467, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "command_queue", scope: !175, file: !169, line: 380, baseType: !496, size: 64, align: 64, offset: 832)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64, align: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterCommand", file: !277, line: 38, size: 320, align: 64, elements: !498)
!498 = !{!499, !500, !501, !502, !503}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !497, file: !277, line: 39, baseType: !210, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !497, file: !277, line: 40, baseType: !431, size: 64, align: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !497, file: !277, line: 41, baseType: !431, size: 64, align: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !497, file: !277, line: 42, baseType: !200, size: 32, align: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !497, file: !277, line: 43, baseType: !496, size: 64, align: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "enable_str", scope: !175, file: !169, line: 382, baseType: !431, size: 64, align: 64, offset: 896)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !175, file: !169, line: 383, baseType: !191, size: 64, align: 64, offset: 960)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "var_values", scope: !175, file: !169, line: 384, baseType: !507, size: 64, align: 64, offset: 1024)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "is_disabled", scope: !175, file: !169, line: 385, baseType: !200, size: 32, align: 32, offset: 1088)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !175, file: !169, line: 394, baseType: !328, size: 64, align: 64, offset: 1152)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !175, file: !169, line: 401, baseType: !200, size: 32, align: 32, offset: 1216)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !175, file: !169, line: 408, baseType: !443, size: 32, align: 32, offset: 1248)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !175, file: !169, line: 424, baseType: !200, size: 32, align: 32, offset: 1280)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "srcpad", scope: !170, file: !169, line: 441, baseType: !439, size: 64, align: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !170, file: !169, line: 443, baseType: !173, size: 64, align: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "dstpad", scope: !170, file: !169, line: 444, baseType: !439, size: 64, align: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !169, line: 446, baseType: !3, size: 32, align: 32, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !170, file: !169, line: 449, baseType: !200, size: 32, align: 32, offset: 288)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !170, file: !169, line: 450, baseType: !200, size: 32, align: 32, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !170, file: !169, line: 451, baseType: !213, size: 64, align: 32, offset: 352)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !170, file: !169, line: 453, baseType: !317, size: 64, align: 64, offset: 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !170, file: !169, line: 454, baseType: !200, size: 32, align: 32, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !170, file: !169, line: 456, baseType: !200, size: 32, align: 32, offset: 544)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !170, file: !169, line: 465, baseType: !213, size: 64, align: 32, offset: 576)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "in_formats", scope: !170, file: !169, line: 481, baseType: !525, size: 64, align: 64, offset: 640)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterFormats", file: !169, line: 70, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterFormats", file: !528, line: 64, size: 256, align: 64, elements: !529)
!528 = !DIFile(filename: "libavfilter/formats.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!529 = !{!530, !531, !532, !533}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "nb_formats", scope: !527, file: !528, line: 65, baseType: !443, size: 32, align: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !527, file: !528, line: 66, baseType: !475, size: 64, align: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !527, file: !528, line: 68, baseType: !443, size: 32, align: 32, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !527, file: !528, line: 69, baseType: !534, size: 64, align: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "out_formats", scope: !170, file: !169, line: 482, baseType: !525, size: 64, align: 64, offset: 704)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "in_samplerates", scope: !170, file: !169, line: 488, baseType: !525, size: 64, align: 64, offset: 768)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "out_samplerates", scope: !170, file: !169, line: 489, baseType: !525, size: 64, align: 64, offset: 832)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "in_channel_layouts", scope: !170, file: !169, line: 490, baseType: !541, size: 64, align: 64, offset: 896)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterChannelLayouts", file: !528, line: 85, size: 256, align: 64, elements: !543)
!543 = !{!544, !546, !547, !548, !549, !550}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !542, file: !528, line: 86, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "nb_channel_layouts", scope: !542, file: !528, line: 87, baseType: !200, size: 32, align: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "all_layouts", scope: !542, file: !528, line: 88, baseType: !186, size: 8, align: 8, offset: 96)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "all_counts", scope: !542, file: !528, line: 89, baseType: !186, size: 8, align: 8, offset: 104)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !542, file: !528, line: 91, baseType: !443, size: 32, align: 32, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !542, file: !528, line: 92, baseType: !551, size: 64, align: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "out_channel_layouts", scope: !170, file: !169, line: 491, baseType: !541, size: 64, align: 64, offset: 960)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "request_samples", scope: !170, file: !169, line: 500, baseType: !200, size: 32, align: 32, offset: 1024)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !170, file: !169, line: 507, baseType: !168, size: 32, align: 32, offset: 1056)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !170, file: !169, line: 512, baseType: !449, size: 64, align: 64, offset: 1088)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts", scope: !170, file: !169, line: 518, baseType: !206, size: 64, align: 64, offset: 1152)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts_us", scope: !170, file: !169, line: 524, baseType: !206, size: 64, align: 64, offset: 1216)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "age_index", scope: !170, file: !169, line: 529, baseType: !200, size: 32, align: 32, offset: 1280)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !170, file: !169, line: 542, baseType: !213, size: 64, align: 32, offset: 1312)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf", scope: !170, file: !169, line: 547, baseType: !285, size: 64, align: 64, offset: 1408)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf_size", scope: !170, file: !169, line: 553, baseType: !200, size: 32, align: 32, offset: 1472)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "min_samples", scope: !170, file: !169, line: 562, baseType: !200, size: 32, align: 32, offset: 1504)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "max_samples", scope: !170, file: !169, line: 568, baseType: !200, size: 32, align: 32, offset: 1536)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !170, file: !169, line: 573, baseType: !200, size: 32, align: 32, offset: 1568)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !170, file: !169, line: 578, baseType: !443, size: 32, align: 32, offset: 1600)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_in", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1664)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_out", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1728)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pool", scope: !170, file: !169, line: 588, baseType: !191, size: 64, align: 64, offset: 1792)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "frame_wanted_out", scope: !170, file: !169, line: 595, baseType: !200, size: 32, align: 32, offset: 1856)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !170, file: !169, line: 601, baseType: !328, size: 64, align: 64, offset: 1920)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !170, file: !169, line: 610, baseType: !573, size: 491520, align: 8, offset: 1984)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 491520, align: 8, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 61440)
!576 = !{!577, !578, !579}
!577 = !DIEnumerator(name: "AVLINK_UNINIT", value: 0)
!578 = !DIEnumerator(name: "AVLINK_STARTINIT", value: 1)
!579 = !DIEnumerator(name: "AVLINK_INIT", value: 2)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !582, file: !581, line: 63, size: 32, align: 32, elements: !606)
!581 = !DIFile(filename: "libavfilter/vf_fade.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FadeContext", file: !581, line: 52, size: 768, align: 64, elements: !583)
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !600, !601, !602, !603, !604, !605}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !582, file: !581, line: 53, baseType: !178, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !582, file: !581, line: 54, baseType: !200, size: 32, align: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !582, file: !581, line: 55, baseType: !200, size: 32, align: 32, offset: 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "fade_per_frame", scope: !582, file: !581, line: 55, baseType: !200, size: 32, align: 32, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !582, file: !581, line: 56, baseType: !200, size: 32, align: 32, offset: 160)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "nb_frames", scope: !582, file: !581, line: 56, baseType: !200, size: 32, align: 32, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "hsub", scope: !582, file: !581, line: 57, baseType: !200, size: 32, align: 32, offset: 224)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "vsub", scope: !582, file: !581, line: 57, baseType: !200, size: 32, align: 32, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "bpp", scope: !582, file: !581, line: 57, baseType: !200, size: 32, align: 32, offset: 288)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "black_level", scope: !582, file: !581, line: 58, baseType: !443, size: 32, align: 32, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "black_level_scaled", scope: !582, file: !581, line: 58, baseType: !443, size: 32, align: 32, offset: 352)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "is_packed_rgb", scope: !582, file: !581, line: 59, baseType: !292, size: 8, align: 8, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rgba_map", scope: !582, file: !581, line: 60, baseType: !597, size: 32, align: 8, offset: 392)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 32, align: 8, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 4)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !582, file: !581, line: 61, baseType: !200, size: 32, align: 32, offset: 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !582, file: !581, line: 62, baseType: !317, size: 64, align: 64, offset: 512)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !582, file: !581, line: 62, baseType: !317, size: 64, align: 64, offset: 576)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "fade_state", scope: !582, file: !581, line: 63, baseType: !580, size: 32, align: 32, offset: 640)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "color_rgba", scope: !582, file: !581, line: 64, baseType: !597, size: 32, align: 8, offset: 672)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "black_fade", scope: !582, file: !581, line: 65, baseType: !200, size: 32, align: 32, offset: 704)
!606 = !{!607, !608, !609}
!607 = !DIEnumerator(name: "VF_FADE_WAITING", value: 0)
!608 = !DIEnumerator(name: "VF_FADE_FADING", value: 1)
!609 = !DIEnumerator(name: "VF_FADE_DONE", value: 2)
!610 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPixelFormat", file: !48, line: 64, size: 32, align: 32, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808}
!612 = !DIEnumerator(name: "AV_PIX_FMT_NONE", value: -1)
!613 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P", value: 0)
!614 = !DIEnumerator(name: "AV_PIX_FMT_YUYV422", value: 1)
!615 = !DIEnumerator(name: "AV_PIX_FMT_RGB24", value: 2)
!616 = !DIEnumerator(name: "AV_PIX_FMT_BGR24", value: 3)
!617 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P", value: 4)
!618 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P", value: 5)
!619 = !DIEnumerator(name: "AV_PIX_FMT_YUV410P", value: 6)
!620 = !DIEnumerator(name: "AV_PIX_FMT_YUV411P", value: 7)
!621 = !DIEnumerator(name: "AV_PIX_FMT_GRAY8", value: 8)
!622 = !DIEnumerator(name: "AV_PIX_FMT_MONOWHITE", value: 9)
!623 = !DIEnumerator(name: "AV_PIX_FMT_MONOBLACK", value: 10)
!624 = !DIEnumerator(name: "AV_PIX_FMT_PAL8", value: 11)
!625 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ420P", value: 12)
!626 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ422P", value: 13)
!627 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ444P", value: 14)
!628 = !DIEnumerator(name: "AV_PIX_FMT_UYVY422", value: 15)
!629 = !DIEnumerator(name: "AV_PIX_FMT_UYYVYY411", value: 16)
!630 = !DIEnumerator(name: "AV_PIX_FMT_BGR8", value: 17)
!631 = !DIEnumerator(name: "AV_PIX_FMT_BGR4", value: 18)
!632 = !DIEnumerator(name: "AV_PIX_FMT_BGR4_BYTE", value: 19)
!633 = !DIEnumerator(name: "AV_PIX_FMT_RGB8", value: 20)
!634 = !DIEnumerator(name: "AV_PIX_FMT_RGB4", value: 21)
!635 = !DIEnumerator(name: "AV_PIX_FMT_RGB4_BYTE", value: 22)
!636 = !DIEnumerator(name: "AV_PIX_FMT_NV12", value: 23)
!637 = !DIEnumerator(name: "AV_PIX_FMT_NV21", value: 24)
!638 = !DIEnumerator(name: "AV_PIX_FMT_ARGB", value: 25)
!639 = !DIEnumerator(name: "AV_PIX_FMT_RGBA", value: 26)
!640 = !DIEnumerator(name: "AV_PIX_FMT_ABGR", value: 27)
!641 = !DIEnumerator(name: "AV_PIX_FMT_BGRA", value: 28)
!642 = !DIEnumerator(name: "AV_PIX_FMT_GRAY16BE", value: 29)
!643 = !DIEnumerator(name: "AV_PIX_FMT_GRAY16LE", value: 30)
!644 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P", value: 31)
!645 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ440P", value: 32)
!646 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P", value: 33)
!647 = !DIEnumerator(name: "AV_PIX_FMT_RGB48BE", value: 34)
!648 = !DIEnumerator(name: "AV_PIX_FMT_RGB48LE", value: 35)
!649 = !DIEnumerator(name: "AV_PIX_FMT_RGB565BE", value: 36)
!650 = !DIEnumerator(name: "AV_PIX_FMT_RGB565LE", value: 37)
!651 = !DIEnumerator(name: "AV_PIX_FMT_RGB555BE", value: 38)
!652 = !DIEnumerator(name: "AV_PIX_FMT_RGB555LE", value: 39)
!653 = !DIEnumerator(name: "AV_PIX_FMT_BGR565BE", value: 40)
!654 = !DIEnumerator(name: "AV_PIX_FMT_BGR565LE", value: 41)
!655 = !DIEnumerator(name: "AV_PIX_FMT_BGR555BE", value: 42)
!656 = !DIEnumerator(name: "AV_PIX_FMT_BGR555LE", value: 43)
!657 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_MOCO", value: 44)
!658 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_IDCT", value: 45)
!659 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_VLD", value: 46)
!660 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI", value: 46)
!661 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P16LE", value: 47)
!662 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P16BE", value: 48)
!663 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P16LE", value: 49)
!664 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P16BE", value: 50)
!665 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P16LE", value: 51)
!666 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P16BE", value: 52)
!667 = !DIEnumerator(name: "AV_PIX_FMT_DXVA2_VLD", value: 53)
!668 = !DIEnumerator(name: "AV_PIX_FMT_RGB444LE", value: 54)
!669 = !DIEnumerator(name: "AV_PIX_FMT_RGB444BE", value: 55)
!670 = !DIEnumerator(name: "AV_PIX_FMT_BGR444LE", value: 56)
!671 = !DIEnumerator(name: "AV_PIX_FMT_BGR444BE", value: 57)
!672 = !DIEnumerator(name: "AV_PIX_FMT_YA8", value: 58)
!673 = !DIEnumerator(name: "AV_PIX_FMT_Y400A", value: 58)
!674 = !DIEnumerator(name: "AV_PIX_FMT_GRAY8A", value: 58)
!675 = !DIEnumerator(name: "AV_PIX_FMT_BGR48BE", value: 59)
!676 = !DIEnumerator(name: "AV_PIX_FMT_BGR48LE", value: 60)
!677 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P9BE", value: 61)
!678 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P9LE", value: 62)
!679 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P10BE", value: 63)
!680 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P10LE", value: 64)
!681 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P10BE", value: 65)
!682 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P10LE", value: 66)
!683 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P9BE", value: 67)
!684 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P9LE", value: 68)
!685 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P10BE", value: 69)
!686 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P10LE", value: 70)
!687 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P9BE", value: 71)
!688 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P9LE", value: 72)
!689 = !DIEnumerator(name: "AV_PIX_FMT_GBRP", value: 73)
!690 = !DIEnumerator(name: "AV_PIX_FMT_GBR24P", value: 73)
!691 = !DIEnumerator(name: "AV_PIX_FMT_GBRP9BE", value: 74)
!692 = !DIEnumerator(name: "AV_PIX_FMT_GBRP9LE", value: 75)
!693 = !DIEnumerator(name: "AV_PIX_FMT_GBRP10BE", value: 76)
!694 = !DIEnumerator(name: "AV_PIX_FMT_GBRP10LE", value: 77)
!695 = !DIEnumerator(name: "AV_PIX_FMT_GBRP16BE", value: 78)
!696 = !DIEnumerator(name: "AV_PIX_FMT_GBRP16LE", value: 79)
!697 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P", value: 80)
!698 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P", value: 81)
!699 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P9BE", value: 82)
!700 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P9LE", value: 83)
!701 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P9BE", value: 84)
!702 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P9LE", value: 85)
!703 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P9BE", value: 86)
!704 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P9LE", value: 87)
!705 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P10BE", value: 88)
!706 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P10LE", value: 89)
!707 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P10BE", value: 90)
!708 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P10LE", value: 91)
!709 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P10BE", value: 92)
!710 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P10LE", value: 93)
!711 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P16BE", value: 94)
!712 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P16LE", value: 95)
!713 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P16BE", value: 96)
!714 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P16LE", value: 97)
!715 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P16BE", value: 98)
!716 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P16LE", value: 99)
!717 = !DIEnumerator(name: "AV_PIX_FMT_VDPAU", value: 100)
!718 = !DIEnumerator(name: "AV_PIX_FMT_XYZ12LE", value: 101)
!719 = !DIEnumerator(name: "AV_PIX_FMT_XYZ12BE", value: 102)
!720 = !DIEnumerator(name: "AV_PIX_FMT_NV16", value: 103)
!721 = !DIEnumerator(name: "AV_PIX_FMT_NV20LE", value: 104)
!722 = !DIEnumerator(name: "AV_PIX_FMT_NV20BE", value: 105)
!723 = !DIEnumerator(name: "AV_PIX_FMT_RGBA64BE", value: 106)
!724 = !DIEnumerator(name: "AV_PIX_FMT_RGBA64LE", value: 107)
!725 = !DIEnumerator(name: "AV_PIX_FMT_BGRA64BE", value: 108)
!726 = !DIEnumerator(name: "AV_PIX_FMT_BGRA64LE", value: 109)
!727 = !DIEnumerator(name: "AV_PIX_FMT_YVYU422", value: 110)
!728 = !DIEnumerator(name: "AV_PIX_FMT_YA16BE", value: 111)
!729 = !DIEnumerator(name: "AV_PIX_FMT_YA16LE", value: 112)
!730 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP", value: 113)
!731 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP16BE", value: 114)
!732 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP16LE", value: 115)
!733 = !DIEnumerator(name: "AV_PIX_FMT_QSV", value: 116)
!734 = !DIEnumerator(name: "AV_PIX_FMT_MMAL", value: 117)
!735 = !DIEnumerator(name: "AV_PIX_FMT_D3D11VA_VLD", value: 118)
!736 = !DIEnumerator(name: "AV_PIX_FMT_CUDA", value: 119)
!737 = !DIEnumerator(name: "AV_PIX_FMT_0RGB", value: 120)
!738 = !DIEnumerator(name: "AV_PIX_FMT_RGB0", value: 121)
!739 = !DIEnumerator(name: "AV_PIX_FMT_0BGR", value: 122)
!740 = !DIEnumerator(name: "AV_PIX_FMT_BGR0", value: 123)
!741 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P12BE", value: 124)
!742 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P12LE", value: 125)
!743 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P14BE", value: 126)
!744 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P14LE", value: 127)
!745 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P12BE", value: 128)
!746 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P12LE", value: 129)
!747 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P14BE", value: 130)
!748 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P14LE", value: 131)
!749 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P12BE", value: 132)
!750 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P12LE", value: 133)
!751 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P14BE", value: 134)
!752 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P14LE", value: 135)
!753 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12BE", value: 136)
!754 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12LE", value: 137)
!755 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14BE", value: 138)
!756 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14LE", value: 139)
!757 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ411P", value: 140)
!758 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR8", value: 141)
!759 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB8", value: 142)
!760 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG8", value: 143)
!761 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG8", value: 144)
!762 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16LE", value: 145)
!763 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16BE", value: 146)
!764 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16LE", value: 147)
!765 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16BE", value: 148)
!766 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16LE", value: 149)
!767 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16BE", value: 150)
!768 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16LE", value: 151)
!769 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16BE", value: 152)
!770 = !DIEnumerator(name: "AV_PIX_FMT_XVMC", value: 153)
!771 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10LE", value: 154)
!772 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10BE", value: 155)
!773 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12LE", value: 156)
!774 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12BE", value: 157)
!775 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64LE", value: 158)
!776 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64BE", value: 159)
!777 = !DIEnumerator(name: "AV_PIX_FMT_VIDEOTOOLBOX", value: 160)
!778 = !DIEnumerator(name: "AV_PIX_FMT_P010LE", value: 161)
!779 = !DIEnumerator(name: "AV_PIX_FMT_P010BE", value: 162)
!780 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12BE", value: 163)
!781 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12LE", value: 164)
!782 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10BE", value: 165)
!783 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10LE", value: 166)
!784 = !DIEnumerator(name: "AV_PIX_FMT_MEDIACODEC", value: 167)
!785 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12BE", value: 168)
!786 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12LE", value: 169)
!787 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10BE", value: 170)
!788 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10LE", value: 171)
!789 = !DIEnumerator(name: "AV_PIX_FMT_P016LE", value: 172)
!790 = !DIEnumerator(name: "AV_PIX_FMT_P016BE", value: 173)
!791 = !DIEnumerator(name: "AV_PIX_FMT_D3D11", value: 174)
!792 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9BE", value: 175)
!793 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9LE", value: 176)
!794 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32BE", value: 177)
!795 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32LE", value: 178)
!796 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32BE", value: 179)
!797 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32LE", value: 180)
!798 = !DIEnumerator(name: "AV_PIX_FMT_DRM_PRIME", value: 181)
!799 = !DIEnumerator(name: "AV_PIX_FMT_OPENCL", value: 182)
!800 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14BE", value: 183)
!801 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14LE", value: 184)
!802 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32BE", value: 185)
!803 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32LE", value: 186)
!804 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12BE", value: 187)
!805 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12LE", value: 188)
!806 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12BE", value: 189)
!807 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12LE", value: 190)
!808 = !DIEnumerator(name: "AV_PIX_FMT_NB", value: 191)
!809 = !{!206, !210, !810, !191, !200}
!810 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!811 = !{!812, !813, !817, !822, !823, !824, !830, !836, !837, !839}
!812 = distinct !DIGlobalVariable(name: "ff_vf_fade", scope: !0, file: !581, line: 422, type: !267, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_vf_fade)
!813 = distinct !DIGlobalVariable(name: "avfilter_vf_fade_inputs", scope: !0, file: !581, line: 403, type: !814, isLocal: true, isDefinition: true, variable: [2 x %struct.AVFilterPad]* @avfilter_vf_fade_inputs)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 1152, align: 64, elements: !815)
!815 = !{!816}
!816 = !DISubrange(count: 2)
!817 = distinct !DIGlobalVariable(name: "studio_level_pix_fmts", scope: !0, file: !581, line: 147, type: !818, isLocal: true, isDefinition: true, variable: [7 x i32]* @studio_level_pix_fmts)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !819, size: 224, align: 32, elements: !820)
!819 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !610)
!820 = !{!821}
!821 = !DISubrange(count: 7)
!822 = distinct !DIGlobalVariable(name: "avfilter_vf_fade_outputs", scope: !0, file: !581, line: 414, type: !814, isLocal: true, isDefinition: true, variable: [2 x %struct.AVFilterPad]* @avfilter_vf_fade_outputs)
!823 = distinct !DIGlobalVariable(name: "fade_class", scope: !0, file: !581, line: 401, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @fade_class)
!824 = distinct !DIGlobalVariable(name: "fade_options", scope: !0, file: !581, line: 374, type: !825, isLocal: true, isDefinition: true, variable: <{ %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption }>* @fade_options)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !826, size: 8192, align: 64, elements: !828)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !126, line: 301, baseType: !195)
!828 = !{!829}
!829 = !DISubrange(count: 16)
!830 = distinct !DIGlobalVariable(name: "pix_fmts", scope: !831, file: !581, line: 101, type: !833, isLocal: true, isDefinition: true, variable: [20 x i32]* @query_formats.pix_fmts)
!831 = distinct !DISubprogram(name: "query_formats", scope: !581, file: !581, line: 98, type: !410, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !832)
!832 = !{}
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !819, size: 640, align: 32, elements: !834)
!834 = !{!835}
!835 = !DISubrange(count: 20)
!836 = distinct !DIGlobalVariable(name: "pix_fmts_rgb", scope: !831, file: !581, line: 112, type: !818, isLocal: true, isDefinition: true, variable: [7 x i32]* @query_formats.pix_fmts_rgb)
!837 = distinct !DIGlobalVariable(name: "pix_fmts_alpha", scope: !831, file: !581, line: 118, type: !838, isLocal: true, isDefinition: true, variable: [8 x i32]* @query_formats.pix_fmts_alpha)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !819, size: 256, align: 32, elements: !295)
!839 = distinct !DIGlobalVariable(name: "pix_fmts_rgba", scope: !831, file: !581, line: 124, type: !840, isLocal: true, isDefinition: true, variable: [5 x i32]* @query_formats.pix_fmts_rgba)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !819, size: 160, align: 32, elements: !841)
!841 = !{!842}
!842 = !DISubrange(count: 5)
!843 = !{i32 2, !"Dwarf Version", i32 4}
!844 = !{i32 2, !"Debug Info Version", i32 3}
!845 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!846 = distinct !DISubprogram(name: "init", scope: !581, file: !581, line: 68, type: !410, isLocal: true, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !832)
!847 = !DILocalVariable(name: "ctx", arg: 1, scope: !846, file: !581, line: 68, type: !173)
!848 = !DIExpression()
!849 = !DILocation(line: 68, column: 56, scope: !846)
!850 = !DILocalVariable(name: "s", scope: !846, file: !581, line: 70, type: !851)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64, align: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "FadeContext", file: !581, line: 66, baseType: !582)
!853 = !DILocation(line: 70, column: 18, scope: !846)
!854 = !DILocation(line: 70, column: 22, scope: !846)
!855 = !DILocation(line: 70, column: 27, scope: !846)
!856 = !DILocation(line: 72, column: 37, scope: !846)
!857 = !DILocation(line: 72, column: 40, scope: !846)
!858 = !DILocation(line: 72, column: 35, scope: !846)
!859 = !DILocation(line: 72, column: 5, scope: !846)
!860 = !DILocation(line: 72, column: 8, scope: !846)
!861 = !DILocation(line: 72, column: 23, scope: !846)
!862 = !DILocation(line: 73, column: 5, scope: !846)
!863 = !DILocation(line: 73, column: 8, scope: !846)
!864 = !DILocation(line: 73, column: 19, scope: !846)
!865 = !DILocation(line: 75, column: 9, scope: !866)
!866 = distinct !DILexicalBlock(scope: !846, file: !581, line: 75, column: 9)
!867 = !DILocation(line: 75, column: 12, scope: !866)
!868 = !DILocation(line: 75, column: 21, scope: !866)
!869 = !DILocation(line: 75, column: 9, scope: !846)
!870 = !DILocation(line: 77, column: 9, scope: !871)
!871 = distinct !DILexicalBlock(scope: !866, file: !581, line: 75, column: 27)
!872 = !DILocation(line: 77, column: 12, scope: !871)
!873 = !DILocation(line: 77, column: 22, scope: !871)
!874 = !DILocation(line: 78, column: 5, scope: !871)
!875 = !DILocation(line: 81, column: 9, scope: !876)
!876 = distinct !DILexicalBlock(scope: !846, file: !581, line: 81, column: 9)
!877 = !DILocation(line: 81, column: 12, scope: !876)
!878 = !DILocation(line: 81, column: 24, scope: !876)
!879 = !DILocation(line: 81, column: 27, scope: !880)
!880 = !DILexicalBlockFile(scope: !876, file: !581, discriminator: 1)
!881 = !DILocation(line: 81, column: 30, scope: !880)
!882 = !DILocation(line: 81, column: 9, scope: !880)
!883 = !DILocation(line: 82, column: 16, scope: !884)
!884 = distinct !DILexicalBlock(scope: !876, file: !581, line: 81, column: 41)
!885 = !DILocation(line: 84, column: 16, scope: !884)
!886 = !DILocation(line: 84, column: 19, scope: !884)
!887 = !DILocation(line: 84, column: 24, scope: !884)
!888 = !DILocation(line: 84, column: 45, scope: !884)
!889 = !DILocation(line: 84, column: 48, scope: !884)
!890 = !DILocation(line: 85, column: 16, scope: !884)
!891 = !DILocation(line: 85, column: 19, scope: !884)
!892 = !DILocation(line: 85, column: 29, scope: !884)
!893 = !DILocation(line: 85, column: 32, scope: !884)
!894 = !DILocation(line: 82, column: 9, scope: !884)
!895 = !DILocation(line: 86, column: 5, scope: !884)
!896 = !DILocation(line: 87, column: 9, scope: !897)
!897 = distinct !DILexicalBlock(scope: !846, file: !581, line: 87, column: 9)
!898 = !DILocation(line: 87, column: 12, scope: !897)
!899 = !DILocation(line: 87, column: 23, scope: !897)
!900 = !DILocation(line: 87, column: 26, scope: !901)
!901 = !DILexicalBlockFile(scope: !897, file: !581, discriminator: 1)
!902 = !DILocation(line: 87, column: 29, scope: !901)
!903 = !DILocation(line: 87, column: 9, scope: !901)
!904 = !DILocation(line: 88, column: 16, scope: !905)
!905 = distinct !DILexicalBlock(scope: !897, file: !581, line: 87, column: 39)
!906 = !DILocation(line: 90, column: 16, scope: !905)
!907 = !DILocation(line: 90, column: 19, scope: !905)
!908 = !DILocation(line: 90, column: 24, scope: !905)
!909 = !DILocation(line: 90, column: 46, scope: !905)
!910 = !DILocation(line: 90, column: 49, scope: !905)
!911 = !DILocation(line: 90, column: 60, scope: !905)
!912 = !DILocation(line: 91, column: 17, scope: !905)
!913 = !DILocation(line: 91, column: 20, scope: !905)
!914 = !DILocation(line: 91, column: 29, scope: !905)
!915 = !DILocation(line: 91, column: 48, scope: !905)
!916 = !DILocation(line: 91, column: 51, scope: !905)
!917 = !DILocation(line: 88, column: 9, scope: !905)
!918 = !DILocation(line: 92, column: 5, scope: !905)
!919 = !DILocation(line: 94, column: 29, scope: !846)
!920 = !DILocation(line: 94, column: 32, scope: !846)
!921 = !DILocation(line: 94, column: 22, scope: !846)
!922 = !DILocation(line: 94, column: 21, scope: !846)
!923 = !DILocation(line: 94, column: 5, scope: !846)
!924 = !DILocation(line: 94, column: 8, scope: !846)
!925 = !DILocation(line: 94, column: 19, scope: !846)
!926 = !DILocation(line: 95, column: 5, scope: !846)
!927 = !DILocalVariable(name: "ctx", arg: 1, scope: !831, file: !581, line: 98, type: !173)
!928 = !DILocation(line: 98, column: 43, scope: !831)
!929 = !DILocalVariable(name: "s", scope: !831, file: !581, line: 100, type: !930)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !852)
!932 = !DILocation(line: 100, column: 24, scope: !831)
!933 = !DILocation(line: 100, column: 28, scope: !831)
!934 = !DILocation(line: 100, column: 33, scope: !831)
!935 = !DILocalVariable(name: "fmts_list", scope: !831, file: !581, line: 129, type: !525)
!936 = !DILocation(line: 129, column: 22, scope: !831)
!937 = !DILocation(line: 131, column: 9, scope: !938)
!938 = distinct !DILexicalBlock(scope: !831, file: !581, line: 131, column: 9)
!939 = !DILocation(line: 131, column: 12, scope: !938)
!940 = !DILocation(line: 131, column: 9, scope: !831)
!941 = !DILocation(line: 132, column: 13, scope: !942)
!942 = distinct !DILexicalBlock(scope: !943, file: !581, line: 132, column: 13)
!943 = distinct !DILexicalBlock(scope: !938, file: !581, line: 131, column: 19)
!944 = !DILocation(line: 132, column: 16, scope: !942)
!945 = !DILocation(line: 132, column: 13, scope: !943)
!946 = !DILocation(line: 133, column: 25, scope: !942)
!947 = !DILocation(line: 133, column: 23, scope: !942)
!948 = !DILocation(line: 133, column: 13, scope: !942)
!949 = !DILocation(line: 135, column: 25, scope: !942)
!950 = !DILocation(line: 135, column: 23, scope: !942)
!951 = !DILocation(line: 136, column: 5, scope: !943)
!952 = !DILocation(line: 137, column: 13, scope: !953)
!953 = distinct !DILexicalBlock(scope: !954, file: !581, line: 137, column: 13)
!954 = distinct !DILexicalBlock(scope: !938, file: !581, line: 136, column: 12)
!955 = !DILocation(line: 137, column: 16, scope: !953)
!956 = !DILocation(line: 137, column: 13, scope: !954)
!957 = !DILocation(line: 138, column: 25, scope: !953)
!958 = !DILocation(line: 138, column: 23, scope: !953)
!959 = !DILocation(line: 138, column: 13, scope: !953)
!960 = !DILocation(line: 140, column: 25, scope: !953)
!961 = !DILocation(line: 140, column: 23, scope: !953)
!962 = !DILocation(line: 142, column: 10, scope: !963)
!963 = distinct !DILexicalBlock(scope: !831, file: !581, line: 142, column: 9)
!964 = !DILocation(line: 142, column: 9, scope: !831)
!965 = !DILocation(line: 143, column: 9, scope: !963)
!966 = !DILocation(line: 144, column: 34, scope: !831)
!967 = !DILocation(line: 144, column: 39, scope: !831)
!968 = !DILocation(line: 144, column: 12, scope: !831)
!969 = !DILocation(line: 144, column: 5, scope: !831)
!970 = !DILocation(line: 145, column: 1, scope: !831)
!971 = distinct !DISubprogram(name: "filter_frame", scope: !581, file: !581, line: 293, type: !395, isLocal: true, isDefinition: true, scopeLine: 294, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !832)
!972 = !DILocalVariable(name: "a", arg: 1, scope: !973, file: !974, line: 181, type: !200)
!973 = distinct !DISubprogram(name: "av_clip_uint16_c", scope: !974, file: !974, line: 181, type: !975, isLocal: true, isDefinition: true, scopeLine: 182, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !832)
!974 = !DIFile(filename: "./libavutil/common.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!975 = !DISubroutineType(types: !976)
!976 = !{!977, !200}
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !293, line: 49, baseType: !978)
!978 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!979 = !DILocation(line: 181, column: 99, scope: !973, inlinedAt: !980)
!980 = distinct !DILocation(line: 340, column: 17, scope: !971)
!981 = !DILocalVariable(name: "inlink", arg: 1, scope: !971, file: !581, line: 293, type: !387)
!982 = !DILocation(line: 293, column: 39, scope: !971)
!983 = !DILocalVariable(name: "frame", arg: 2, scope: !971, file: !581, line: 293, type: !285)
!984 = !DILocation(line: 293, column: 56, scope: !971)
!985 = !DILocalVariable(name: "ctx", scope: !971, file: !581, line: 295, type: !173)
!986 = !DILocation(line: 295, column: 22, scope: !971)
!987 = !DILocation(line: 295, column: 28, scope: !971)
!988 = !DILocation(line: 295, column: 36, scope: !971)
!989 = !DILocalVariable(name: "s", scope: !971, file: !581, line: 296, type: !851)
!990 = !DILocation(line: 296, column: 18, scope: !971)
!991 = !DILocation(line: 296, column: 22, scope: !971)
!992 = !DILocation(line: 296, column: 27, scope: !971)
!993 = !DILocalVariable(name: "frame_timestamp", scope: !971, file: !581, line: 297, type: !210)
!994 = !DILocation(line: 297, column: 12, scope: !971)
!995 = !DILocation(line: 297, column: 30, scope: !971)
!996 = !DILocation(line: 297, column: 37, scope: !971)
!997 = !DILocation(line: 297, column: 41, scope: !971)
!998 = !DILocation(line: 297, column: 30, scope: !999)
!999 = !DILexicalBlockFile(scope: !971, file: !581, discriminator: 1)
!1000 = !DILocation(line: 297, column: 83, scope: !1001)
!1001 = !DILexicalBlockFile(scope: !971, file: !581, discriminator: 2)
!1002 = !DILocation(line: 297, column: 90, scope: !1001)
!1003 = !DILocation(line: 297, column: 103, scope: !1001)
!1004 = !DILocation(line: 297, column: 111, scope: !1001)
!1005 = !DILocation(line: 297, column: 96, scope: !1001)
!1006 = !DILocation(line: 297, column: 94, scope: !1001)
!1007 = !DILocation(line: 297, column: 30, scope: !1001)
!1008 = !DILocation(line: 297, column: 30, scope: !1009)
!1009 = !DILexicalBlockFile(scope: !971, file: !581, discriminator: 3)
!1010 = !DILocation(line: 297, column: 12, scope: !1009)
!1011 = !DILocation(line: 300, column: 9, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !971, file: !581, line: 300, column: 9)
!1013 = !DILocation(line: 300, column: 12, scope: !1012)
!1014 = !DILocation(line: 300, column: 23, scope: !1012)
!1015 = !DILocation(line: 300, column: 9, scope: !971)
!1016 = !DILocation(line: 301, column: 9, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1012, file: !581, line: 300, column: 43)
!1018 = !DILocation(line: 301, column: 12, scope: !1017)
!1019 = !DILocation(line: 301, column: 18, scope: !1017)
!1020 = !DILocation(line: 302, column: 13, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1017, file: !581, line: 302, column: 13)
!1022 = !DILocation(line: 302, column: 32, scope: !1021)
!1023 = !DILocation(line: 302, column: 35, scope: !1021)
!1024 = !DILocation(line: 302, column: 45, scope: !1021)
!1025 = !DILocation(line: 302, column: 29, scope: !1021)
!1026 = !DILocation(line: 303, column: 13, scope: !1021)
!1027 = !DILocation(line: 303, column: 16, scope: !1028)
!1028 = !DILexicalBlockFile(scope: !1021, file: !581, discriminator: 1)
!1029 = !DILocation(line: 303, column: 24, scope: !1028)
!1030 = !DILocation(line: 303, column: 43, scope: !1028)
!1031 = !DILocation(line: 303, column: 46, scope: !1028)
!1032 = !DILocation(line: 303, column: 40, scope: !1028)
!1033 = !DILocation(line: 302, column: 13, scope: !1034)
!1034 = !DILexicalBlockFile(scope: !1017, file: !581, discriminator: 1)
!1035 = !DILocation(line: 305, column: 13, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1021, file: !581, line: 303, column: 59)
!1037 = !DILocation(line: 305, column: 16, scope: !1036)
!1038 = !DILocation(line: 305, column: 27, scope: !1036)
!1039 = !DILocation(line: 308, column: 17, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1036, file: !581, line: 308, column: 17)
!1041 = !DILocation(line: 308, column: 20, scope: !1040)
!1042 = !DILocation(line: 308, column: 31, scope: !1040)
!1043 = !DILocation(line: 308, column: 36, scope: !1040)
!1044 = !DILocation(line: 308, column: 39, scope: !1045)
!1045 = !DILexicalBlockFile(scope: !1040, file: !581, discriminator: 1)
!1046 = !DILocation(line: 308, column: 42, scope: !1045)
!1047 = !DILocation(line: 308, column: 54, scope: !1045)
!1048 = !DILocation(line: 308, column: 17, scope: !1045)
!1049 = !DILocation(line: 309, column: 33, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1040, file: !581, line: 308, column: 60)
!1051 = !DILocation(line: 309, column: 48, scope: !1050)
!1052 = !DILocation(line: 309, column: 17, scope: !1050)
!1053 = !DILocation(line: 309, column: 20, scope: !1050)
!1054 = !DILocation(line: 309, column: 31, scope: !1050)
!1055 = !DILocation(line: 310, column: 13, scope: !1050)
!1056 = !DILocation(line: 313, column: 17, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1036, file: !581, line: 313, column: 17)
!1058 = !DILocation(line: 313, column: 20, scope: !1057)
!1059 = !DILocation(line: 313, column: 31, scope: !1057)
!1060 = !DILocation(line: 313, column: 36, scope: !1057)
!1061 = !DILocation(line: 313, column: 39, scope: !1062)
!1062 = !DILexicalBlockFile(scope: !1057, file: !581, discriminator: 1)
!1063 = !DILocation(line: 313, column: 42, scope: !1062)
!1064 = !DILocation(line: 313, column: 54, scope: !1062)
!1065 = !DILocation(line: 313, column: 17, scope: !1062)
!1066 = !DILocation(line: 314, column: 34, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1057, file: !581, line: 313, column: 60)
!1068 = !DILocation(line: 314, column: 42, scope: !1067)
!1069 = !DILocation(line: 314, column: 17, scope: !1067)
!1070 = !DILocation(line: 314, column: 20, scope: !1067)
!1071 = !DILocation(line: 314, column: 32, scope: !1067)
!1072 = !DILocation(line: 315, column: 13, scope: !1067)
!1073 = !DILocation(line: 316, column: 9, scope: !1036)
!1074 = !DILocation(line: 317, column: 5, scope: !1017)
!1075 = !DILocation(line: 318, column: 9, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !971, file: !581, line: 318, column: 9)
!1077 = !DILocation(line: 318, column: 12, scope: !1076)
!1078 = !DILocation(line: 318, column: 23, scope: !1076)
!1079 = !DILocation(line: 318, column: 9, scope: !971)
!1080 = !DILocation(line: 319, column: 13, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !581, line: 319, column: 13)
!1082 = distinct !DILexicalBlock(scope: !1076, file: !581, line: 318, column: 42)
!1083 = !DILocation(line: 319, column: 16, scope: !1081)
!1084 = !DILocation(line: 319, column: 25, scope: !1081)
!1085 = !DILocation(line: 319, column: 13, scope: !1082)
!1086 = !DILocation(line: 321, column: 26, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1081, file: !581, line: 319, column: 31)
!1088 = !DILocation(line: 321, column: 34, scope: !1087)
!1089 = !DILocation(line: 321, column: 52, scope: !1087)
!1090 = !DILocation(line: 321, column: 55, scope: !1087)
!1091 = !DILocation(line: 321, column: 50, scope: !1087)
!1092 = !DILocation(line: 321, column: 70, scope: !1087)
!1093 = !DILocation(line: 321, column: 73, scope: !1087)
!1094 = !DILocation(line: 321, column: 68, scope: !1087)
!1095 = !DILocation(line: 321, column: 25, scope: !1087)
!1096 = !DILocation(line: 321, column: 13, scope: !1087)
!1097 = !DILocation(line: 321, column: 16, scope: !1087)
!1098 = !DILocation(line: 321, column: 23, scope: !1087)
!1099 = !DILocation(line: 322, column: 17, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1087, file: !581, line: 322, column: 17)
!1101 = !DILocation(line: 322, column: 25, scope: !1100)
!1102 = !DILocation(line: 322, column: 43, scope: !1100)
!1103 = !DILocation(line: 322, column: 46, scope: !1100)
!1104 = !DILocation(line: 322, column: 60, scope: !1100)
!1105 = !DILocation(line: 322, column: 63, scope: !1100)
!1106 = !DILocation(line: 322, column: 58, scope: !1100)
!1107 = !DILocation(line: 322, column: 41, scope: !1100)
!1108 = !DILocation(line: 322, column: 17, scope: !1087)
!1109 = !DILocation(line: 323, column: 17, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1100, file: !581, line: 322, column: 74)
!1111 = !DILocation(line: 323, column: 20, scope: !1110)
!1112 = !DILocation(line: 323, column: 31, scope: !1110)
!1113 = !DILocation(line: 324, column: 13, scope: !1110)
!1114 = !DILocation(line: 326, column: 9, scope: !1087)
!1115 = !DILocation(line: 328, column: 26, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1081, file: !581, line: 326, column: 16)
!1117 = !DILocation(line: 328, column: 44, scope: !1116)
!1118 = !DILocation(line: 328, column: 47, scope: !1116)
!1119 = !DILocation(line: 328, column: 57, scope: !1116)
!1120 = !DILocation(line: 328, column: 42, scope: !1116)
!1121 = !DILocation(line: 329, column: 29, scope: !1116)
!1122 = !DILocation(line: 329, column: 52, scope: !1116)
!1123 = !DILocation(line: 329, column: 55, scope: !1116)
!1124 = !DILocation(line: 329, column: 63, scope: !1116)
!1125 = !DILocation(line: 329, column: 49, scope: !1116)
!1126 = !DILocation(line: 328, column: 25, scope: !1116)
!1127 = !DILocation(line: 328, column: 13, scope: !1116)
!1128 = !DILocation(line: 328, column: 16, scope: !1116)
!1129 = !DILocation(line: 328, column: 23, scope: !1116)
!1130 = !DILocation(line: 330, column: 17, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1116, file: !581, line: 330, column: 17)
!1132 = !DILocation(line: 330, column: 35, scope: !1131)
!1133 = !DILocation(line: 330, column: 38, scope: !1131)
!1134 = !DILocation(line: 330, column: 48, scope: !1131)
!1135 = !DILocation(line: 331, column: 37, scope: !1131)
!1136 = !DILocation(line: 331, column: 40, scope: !1131)
!1137 = !DILocation(line: 331, column: 48, scope: !1131)
!1138 = !DILocation(line: 331, column: 35, scope: !1131)
!1139 = !DILocation(line: 330, column: 33, scope: !1131)
!1140 = !DILocation(line: 330, column: 17, scope: !1116)
!1141 = !DILocation(line: 332, column: 17, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1131, file: !581, line: 331, column: 66)
!1143 = !DILocation(line: 332, column: 20, scope: !1142)
!1144 = !DILocation(line: 332, column: 31, scope: !1142)
!1145 = !DILocation(line: 333, column: 13, scope: !1142)
!1146 = !DILocation(line: 335, column: 5, scope: !1082)
!1147 = !DILocation(line: 336, column: 9, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !971, file: !581, line: 336, column: 9)
!1149 = !DILocation(line: 336, column: 12, scope: !1148)
!1150 = !DILocation(line: 336, column: 23, scope: !1148)
!1151 = !DILocation(line: 336, column: 9, scope: !971)
!1152 = !DILocation(line: 337, column: 9, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1148, file: !581, line: 336, column: 40)
!1154 = !DILocation(line: 337, column: 12, scope: !1153)
!1155 = !DILocation(line: 337, column: 18, scope: !1153)
!1156 = !DILocation(line: 338, column: 5, scope: !1153)
!1157 = !DILocation(line: 340, column: 34, scope: !971)
!1158 = !DILocation(line: 340, column: 37, scope: !971)
!1159 = !DILocation(line: 340, column: 17, scope: !971)
!1160 = !DILocation(line: 183, column: 9, scope: !1161, inlinedAt: !980)
!1161 = distinct !DILexicalBlock(scope: !973, file: !974, line: 183, column: 9)
!1162 = !DILocation(line: 183, column: 10, scope: !1161, inlinedAt: !980)
!1163 = !DILocation(line: 183, column: 9, scope: !973, inlinedAt: !980)
!1164 = !DILocation(line: 183, column: 31, scope: !1165, inlinedAt: !980)
!1165 = !DILexicalBlockFile(scope: !1161, file: !974, discriminator: 1)
!1166 = !DILocation(line: 183, column: 30, scope: !1165, inlinedAt: !980)
!1167 = !DILocation(line: 183, column: 33, scope: !1165, inlinedAt: !980)
!1168 = !DILocation(line: 183, column: 29, scope: !1165, inlinedAt: !980)
!1169 = !DILocation(line: 183, column: 22, scope: !1165, inlinedAt: !980)
!1170 = !DILocation(line: 184, column: 17, scope: !1161, inlinedAt: !980)
!1171 = !DILocation(line: 184, column: 10, scope: !1161, inlinedAt: !980)
!1172 = !DILocation(line: 185, column: 1, scope: !973, inlinedAt: !980)
!1173 = !DILocation(line: 340, column: 5, scope: !971)
!1174 = !DILocation(line: 340, column: 8, scope: !971)
!1175 = !DILocation(line: 340, column: 15, scope: !971)
!1176 = !DILocation(line: 343, column: 9, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !971, file: !581, line: 343, column: 9)
!1178 = !DILocation(line: 343, column: 12, scope: !1177)
!1179 = !DILocation(line: 343, column: 17, scope: !1177)
!1180 = !DILocation(line: 343, column: 9, scope: !971)
!1181 = !DILocation(line: 344, column: 29, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1177, file: !581, line: 343, column: 23)
!1183 = !DILocation(line: 344, column: 32, scope: !1182)
!1184 = !DILocation(line: 344, column: 28, scope: !1182)
!1185 = !DILocation(line: 344, column: 9, scope: !1182)
!1186 = !DILocation(line: 344, column: 12, scope: !1182)
!1187 = !DILocation(line: 344, column: 18, scope: !1182)
!1188 = !DILocation(line: 345, column: 5, scope: !1182)
!1189 = !DILocation(line: 347, column: 9, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !971, file: !581, line: 347, column: 9)
!1191 = !DILocation(line: 347, column: 12, scope: !1190)
!1192 = !DILocation(line: 347, column: 19, scope: !1190)
!1193 = !DILocation(line: 347, column: 9, scope: !971)
!1194 = !DILocation(line: 348, column: 13, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1196, file: !581, line: 348, column: 13)
!1196 = distinct !DILexicalBlock(scope: !1190, file: !581, line: 347, column: 32)
!1197 = !DILocation(line: 348, column: 16, scope: !1195)
!1198 = !DILocation(line: 348, column: 13, scope: !1196)
!1199 = !DILocation(line: 349, column: 13, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1195, file: !581, line: 348, column: 23)
!1201 = !DILocation(line: 349, column: 18, scope: !1200)
!1202 = !DILocation(line: 349, column: 28, scope: !1200)
!1203 = !DILocation(line: 349, column: 36, scope: !1200)
!1204 = !DILocation(line: 349, column: 61, scope: !1200)
!1205 = !DILocation(line: 350, column: 35, scope: !1200)
!1206 = !DILocation(line: 350, column: 42, scope: !1200)
!1207 = !DILocation(line: 350, column: 78, scope: !1200)
!1208 = !DILocation(line: 350, column: 53, scope: !1200)
!1209 = !DILocation(line: 350, column: 50, scope: !1200)
!1210 = !DILocation(line: 350, column: 34, scope: !1200)
!1211 = !DILocation(line: 350, column: 112, scope: !1212)
!1212 = !DILexicalBlockFile(scope: !1200, file: !581, discriminator: 1)
!1213 = !DILocation(line: 350, column: 87, scope: !1212)
!1214 = !DILocation(line: 350, column: 34, scope: !1212)
!1215 = !DILocation(line: 350, column: 121, scope: !1216)
!1216 = !DILexicalBlockFile(scope: !1200, file: !581, discriminator: 2)
!1217 = !DILocation(line: 350, column: 128, scope: !1216)
!1218 = !DILocation(line: 350, column: 34, scope: !1216)
!1219 = !DILocation(line: 350, column: 34, scope: !1220)
!1220 = !DILexicalBlockFile(scope: !1200, file: !581, discriminator: 3)
!1221 = !DILocation(line: 349, column: 13, scope: !1212)
!1222 = !DILocation(line: 351, column: 9, scope: !1200)
!1223 = !DILocation(line: 351, column: 20, scope: !1224)
!1224 = !DILexicalBlockFile(scope: !1225, file: !581, discriminator: 1)
!1225 = distinct !DILexicalBlock(scope: !1195, file: !581, line: 351, column: 20)
!1226 = !DILocation(line: 351, column: 23, scope: !1224)
!1227 = !DILocation(line: 351, column: 37, scope: !1224)
!1228 = !DILocation(line: 351, column: 41, scope: !1229)
!1229 = !DILexicalBlockFile(scope: !1225, file: !581, discriminator: 2)
!1230 = !DILocation(line: 351, column: 44, scope: !1229)
!1231 = !DILocation(line: 351, column: 20, scope: !1229)
!1232 = !DILocation(line: 352, column: 13, scope: !1233)
!1233 = distinct !DILexicalBlock(scope: !1225, file: !581, line: 351, column: 56)
!1234 = !DILocation(line: 352, column: 18, scope: !1233)
!1235 = !DILocation(line: 352, column: 28, scope: !1233)
!1236 = !DILocation(line: 352, column: 36, scope: !1233)
!1237 = !DILocation(line: 352, column: 59, scope: !1233)
!1238 = !DILocation(line: 353, column: 38, scope: !1233)
!1239 = !DILocation(line: 353, column: 45, scope: !1233)
!1240 = !DILocation(line: 353, column: 81, scope: !1233)
!1241 = !DILocation(line: 353, column: 56, scope: !1233)
!1242 = !DILocation(line: 353, column: 53, scope: !1233)
!1243 = !DILocation(line: 353, column: 37, scope: !1233)
!1244 = !DILocation(line: 353, column: 115, scope: !1245)
!1245 = !DILexicalBlockFile(scope: !1233, file: !581, discriminator: 1)
!1246 = !DILocation(line: 353, column: 90, scope: !1245)
!1247 = !DILocation(line: 353, column: 37, scope: !1245)
!1248 = !DILocation(line: 353, column: 124, scope: !1249)
!1249 = !DILexicalBlockFile(scope: !1233, file: !581, discriminator: 2)
!1250 = !DILocation(line: 353, column: 131, scope: !1249)
!1251 = !DILocation(line: 353, column: 37, scope: !1249)
!1252 = !DILocation(line: 353, column: 37, scope: !1253)
!1253 = !DILexicalBlockFile(scope: !1233, file: !581, discriminator: 3)
!1254 = !DILocation(line: 352, column: 13, scope: !1245)
