; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--avfilter.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--avfilter.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVFrame = type { [8 x i8*], [8 x i32], i8**, i32, i32, i32, i32, i32, i32, %struct.AVRational, i64, i64, i64, i32, i32, i32, i8*, [8 x i64], i32, i32, i32, i32, i64, i32, i64, [8 x %struct.AVBufferRef*], %struct.AVBufferRef**, i32, %struct.AVFrameSideData**, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, %struct.AVDictionary*, i32, i32, i32, i8*, i32, i32, %struct.AVBufferRef*, %struct.AVBufferRef*, %struct.AVBufferRef*, i64, i64, i64, i64, %struct.AVBufferRef* }
%struct.AVRational = type { i32, i32 }
%struct.AVFrameSideData = type { i32, i8*, i32, %struct.AVDictionary*, %struct.AVBufferRef* }
%struct.AVDictionary = type opaque

!116 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVOptionType", file: !117, line: 221, size: 32, align: 32, elements: !118)
!117 = !DIFile(filename: "./libavutil/opt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!118 = !{!119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137}
!119 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!120 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!121 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!122 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!123 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!124 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!125 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!126 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!127 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!128 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!129 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!130 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!131 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!132 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!133 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!134 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!135 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!136 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!137 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!138 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !139, line: 29, size: 32, align: 32, elements: !140)
!139 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!140 = !{!141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158}
!141 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!142 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!143 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!144 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!145 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!146 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!147 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!148 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!149 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!150 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!151 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!152 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!153 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!154 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!155 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!156 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!157 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!158 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!159 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVMediaType", file: !4, line: 199, size: 32, align: 32, elements: !160)
!160 = !{!161, !162, !163, !164, !165, !166, !167}
!161 = !DIEnumerator(name: "AVMEDIA_TYPE_UNKNOWN", value: -1)
!162 = !DIEnumerator(name: "AVMEDIA_TYPE_VIDEO", value: 0)
!163 = !DIEnumerator(name: "AVMEDIA_TYPE_AUDIO", value: 1)
!164 = !DIEnumerator(name: "AVMEDIA_TYPE_DATA", value: 2)
!165 = !DIEnumerator(name: "AVMEDIA_TYPE_SUBTITLE", value: 3)
!166 = !DIEnumerator(name: "AVMEDIA_TYPE_ATTACHMENT", value: 4)
!167 = !DIEnumerator(name: "AVMEDIA_TYPE_NB", value: 5)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !170, file: !169, line: 503, size: 32, align: 32, elements: !595)
!169 = !DIFile(filename: "libavfilter/avfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterLink", file: !169, line: 439, size: 2816, align: 64, elements: !171)
!171 = !{!172, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !537, !538, !539, !540, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !591, !592, !593, !594}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !170, file: !169, line: 440, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterContext", file: !169, line: 67, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterContext", file: !169, line: 338, size: 1344, align: 64, elements: !176)
!176 = !{!177, !264, !437, !438, !440, !442, !444, !445, !446, !447, !448, !488, !489, !495, !504, !505, !506, !508, !509, !510, !511, !512}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !175, file: !169, line: 339, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !139, line: 143, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !139, line: 67, size: 640, align: 64, elements: !182)
!182 = !{!183, !187, !192, !223, !224, !225, !226, !230, !236, !238, !242}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !181, file: !139, line: 72, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !181, file: !139, line: 78, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!184, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !181, file: !139, line: 85, baseType: !193, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !117, line: 246, size: 512, align: 64, elements: !196)
!196 = !{!197, !198, !199, !201, !202, !219, !220, !221, !222}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !117, line: 247, baseType: !184, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !195, file: !117, line: 253, baseType: !184, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !195, file: !117, line: 259, baseType: !200, size: 32, align: 32, offset: 128)
!200 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !117, line: 260, baseType: !116, size: 32, align: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !195, file: !117, line: 271, baseType: !203, size: 64, align: 64, offset: 192)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !195, file: !117, line: 265, size: 64, align: 64, elements: !204)
!204 = !{!205, !209, !211, !212}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !203, file: !117, line: 266, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !207, line: 197, baseType: !208)
!207 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!208 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !203, file: !117, line: 267, baseType: !210, size: 64, align: 64)
!210 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !203, file: !117, line: 268, baseType: !184, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !203, file: !117, line: 270, baseType: !213, size: 64, align: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !214, line: 61, baseType: !215)
!214 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !214, line: 58, size: 64, align: 32, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !215, file: !214, line: 59, baseType: !200, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !215, file: !214, line: 60, baseType: !200, size: 32, align: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !195, file: !117, line: 272, baseType: !210, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !195, file: !117, line: 273, baseType: !210, size: 64, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !195, file: !117, line: 275, baseType: !200, size: 32, align: 32, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !195, file: !117, line: 300, baseType: !184, size: 64, align: 64, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !181, file: !139, line: 93, baseType: !200, size: 32, align: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !181, file: !139, line: 99, baseType: !200, size: 32, align: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !181, file: !139, line: 108, baseType: !200, size: 32, align: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !181, file: !139, line: 113, baseType: !227, size: 64, align: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!191, !191, !191}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !181, file: !139, line: 123, baseType: !231, size: 64, align: 64, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!234, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !181, file: !139, line: 130, baseType: !237, size: 32, align: 32, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !139, line: 48, baseType: !138)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !181, file: !139, line: 136, baseType: !239, size: 64, align: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!237, !191}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !181, file: !139, line: 142, baseType: !243, size: 64, align: 64, offset: 576)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!200, !246, !191, !184, !200}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !117, line: 329, size: 128, align: 64, elements: !249)
!249 = !{!250, !262, !263}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !248, file: !117, line: 360, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !117, line: 324, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !117, line: 306, size: 384, align: 64, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !254, file: !117, line: 307, baseType: !184, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !254, file: !117, line: 313, baseType: !210, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !254, file: !117, line: 313, baseType: !210, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !254, file: !117, line: 318, baseType: !210, size: 64, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !254, file: !117, line: 318, baseType: !210, size: 64, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !254, file: !117, line: 323, baseType: !200, size: 32, align: 32, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !248, file: !117, line: 364, baseType: !200, size: 32, align: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !248, file: !117, line: 368, baseType: !200, size: 32, align: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !175, file: !169, line: 341, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilter", file: !169, line: 328, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilter", file: !169, line: 144, size: 1024, align: 64, elements: !269)
!269 = !{!270, !271, !272, !405, !406, !407, !408, !412, !413, !418, !422, !423, !424, !425, !427, !432, !436}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !169, line: 148, baseType: !184, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !268, file: !169, line: 155, baseType: !184, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !268, file: !169, line: 164, baseType: !273, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterPad", file: !169, line: 69, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterPad", file: !277, line: 54, size: 576, align: 64, elements: !278)
!277 = !DIFile(filename: "libavfilter/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!278 = !{!279, !280, !281, !389, !393, !397, !401, !402, !403, !404}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !277, line: 60, baseType: !184, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !276, file: !277, line: 65, baseType: !159, size: 32, align: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "get_video_buffer", scope: !276, file: !277, line: 73, baseType: !282, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!285, !387, !200, !200}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !15, line: 646, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !15, line: 268, size: 4288, align: 64, elements: !288)
!288 = !{!289, !297, !299, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !319, !320, !321, !322, !323, !324, !325, !326, !339, !341, !342, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !375, !376, !377, !378, !379, !380, !383, !384, !385, !386}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !287, file: !15, line: 282, baseType: !290, size: 512, align: 64)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 512, align: 64, elements: !295)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !293, line: 48, baseType: !294)
!293 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!294 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!295 = !{!296}
!296 = !DISubrange(count: 8)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !287, file: !15, line: 299, baseType: !298, size: 256, align: 32, offset: 512)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 256, align: 32, elements: !295)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !287, file: !15, line: 315, baseType: !300, size: 64, align: 64, offset: 768)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !287, file: !15, line: 326, baseType: !200, size: 32, align: 32, offset: 832)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !287, file: !15, line: 326, baseType: !200, size: 32, align: 32, offset: 864)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !287, file: !15, line: 334, baseType: !200, size: 32, align: 32, offset: 896)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !287, file: !15, line: 341, baseType: !200, size: 32, align: 32, offset: 928)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !287, file: !15, line: 346, baseType: !200, size: 32, align: 32, offset: 960)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !287, file: !15, line: 351, baseType: !3, size: 32, align: 32, offset: 992)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !287, file: !15, line: 356, baseType: !213, size: 64, align: 32, offset: 1024)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !287, file: !15, line: 361, baseType: !206, size: 64, align: 64, offset: 1088)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !287, file: !15, line: 369, baseType: !206, size: 64, align: 64, offset: 1152)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !287, file: !15, line: 377, baseType: !206, size: 64, align: 64, offset: 1216)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !287, file: !15, line: 382, baseType: !200, size: 32, align: 32, offset: 1280)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !287, file: !15, line: 386, baseType: !200, size: 32, align: 32, offset: 1312)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !287, file: !15, line: 391, baseType: !200, size: 32, align: 32, offset: 1344)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !287, file: !15, line: 396, baseType: !191, size: 64, align: 64, offset: 1408)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !287, file: !15, line: 403, baseType: !316, size: 512, align: 64, offset: 1472)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 512, align: 64, elements: !295)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !293, line: 55, baseType: !318)
!318 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !287, file: !15, line: 410, baseType: !200, size: 32, align: 32, offset: 1984)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !287, file: !15, line: 415, baseType: !200, size: 32, align: 32, offset: 2016)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !287, file: !15, line: 420, baseType: !200, size: 32, align: 32, offset: 2048)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !287, file: !15, line: 425, baseType: !200, size: 32, align: 32, offset: 2080)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !287, file: !15, line: 435, baseType: !206, size: 64, align: 64, offset: 2112)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !287, file: !15, line: 440, baseType: !200, size: 32, align: 32, offset: 2176)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !287, file: !15, line: 445, baseType: !317, size: 64, align: 64, offset: 2240)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !287, file: !15, line: 459, baseType: !327, size: 512, align: 64, offset: 2304)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 512, align: 64, elements: !295)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !330, line: 94, baseType: !331)
!330 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !330, line: 81, size: 192, align: 64, elements: !332)
!332 = !{!333, !337, !338}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !331, file: !330, line: 82, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !330, line: 73, baseType: !336)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !330, line: 73, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !331, file: !330, line: 89, baseType: !291, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !331, file: !330, line: 93, baseType: !200, size: 32, align: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !287, file: !15, line: 473, baseType: !340, size: 64, align: 64, offset: 2816)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !287, file: !15, line: 477, baseType: !200, size: 32, align: 32, offset: 2880)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !287, file: !15, line: 479, baseType: !343, size: 64, align: 64, offset: 2944)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !15, line: 207, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !15, line: 201, size: 320, align: 64, elements: !347)
!347 = !{!348, !349, !350, !351, !356}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !346, file: !15, line: 202, baseType: !14, size: 32, align: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !346, file: !15, line: 203, baseType: !291, size: 64, align: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !346, file: !15, line: 204, baseType: !200, size: 32, align: 32, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !346, file: !15, line: 205, baseType: !352, size: 64, align: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !354, line: 86, baseType: !355)
!354 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !354, line: 86, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !346, file: !15, line: 206, baseType: !328, size: 64, align: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !287, file: !15, line: 480, baseType: !200, size: 32, align: 32, offset: 3008)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !15, line: 505, baseType: !200, size: 32, align: 32, offset: 3040)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !287, file: !15, line: 512, baseType: !38, size: 32, align: 32, offset: 3072)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !287, file: !15, line: 514, baseType: !45, size: 32, align: 32, offset: 3104)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !287, file: !15, line: 516, baseType: !63, size: 32, align: 32, offset: 3136)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !287, file: !15, line: 523, baseType: !87, size: 32, align: 32, offset: 3168)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !287, file: !15, line: 525, baseType: !106, size: 32, align: 32, offset: 3200)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !287, file: !15, line: 532, baseType: !206, size: 64, align: 64, offset: 3264)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !287, file: !15, line: 539, baseType: !206, size: 64, align: 64, offset: 3328)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !287, file: !15, line: 547, baseType: !206, size: 64, align: 64, offset: 3392)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !287, file: !15, line: 554, baseType: !352, size: 64, align: 64, offset: 3456)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !287, file: !15, line: 563, baseType: !200, size: 32, align: 32, offset: 3520)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !287, file: !15, line: 572, baseType: !200, size: 32, align: 32, offset: 3552)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !287, file: !15, line: 581, baseType: !200, size: 32, align: 32, offset: 3584)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !287, file: !15, line: 588, baseType: !372, size: 64, align: 64, offset: 3648)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !207, line: 194, baseType: !374)
!374 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !287, file: !15, line: 593, baseType: !200, size: 32, align: 32, offset: 3712)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !287, file: !15, line: 596, baseType: !200, size: 32, align: 32, offset: 3744)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !287, file: !15, line: 599, baseType: !328, size: 64, align: 64, offset: 3776)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !287, file: !15, line: 605, baseType: !328, size: 64, align: 64, offset: 3840)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !287, file: !15, line: 616, baseType: !328, size: 64, align: 64, offset: 3904)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !287, file: !15, line: 626, baseType: !381, size: 64, align: 64, offset: 3968)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !382, line: 216, baseType: !318)
!382 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!383 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !287, file: !15, line: 627, baseType: !381, size: 64, align: 64, offset: 4032)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !287, file: !15, line: 628, baseType: !381, size: 64, align: 64, offset: 4096)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !287, file: !15, line: 629, baseType: !381, size: 64, align: 64, offset: 4160)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !287, file: !15, line: 645, baseType: !328, size: 64, align: 64, offset: 4224)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterLink", file: !169, line: 68, baseType: !170)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "get_audio_buffer", scope: !276, file: !277, line: 81, baseType: !390, size: 64, align: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!285, !387, !200}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "filter_frame", scope: !276, file: !277, line: 93, baseType: !394, size: 64, align: 64, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!200, !387, !285}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "poll_frame", scope: !276, file: !277, line: 104, baseType: !398, size: 64, align: 64, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!200, !387}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "request_frame", scope: !276, file: !277, line: 113, baseType: !398, size: 64, align: 64, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "config_props", scope: !276, file: !277, line: 129, baseType: !398, size: 64, align: 64, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "needs_fifo", scope: !276, file: !277, line: 137, baseType: !200, size: 32, align: 32, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "needs_writable", scope: !276, file: !277, line: 145, baseType: !200, size: 32, align: 32, offset: 544)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !268, file: !169, line: 172, baseType: !273, size: 64, align: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !268, file: !169, line: 182, baseType: !178, size: 64, align: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !268, file: !169, line: 187, baseType: !200, size: 32, align: 32, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "preinit", scope: !268, file: !169, line: 210, baseType: !409, size: 64, align: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!200, !173}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !268, file: !169, line: 233, baseType: !409, size: 64, align: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "init_dict", scope: !268, file: !169, line: 246, baseType: !414, size: 64, align: 64, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!200, !173, !417}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !268, file: !169, line: 258, baseType: !419, size: 64, align: 64, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !173}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "query_formats", scope: !268, file: !169, line: 282, baseType: !409, size: 64, align: 64, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "priv_size", scope: !268, file: !169, line: 284, baseType: !200, size: 32, align: 32, offset: 704)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flags_internal", scope: !268, file: !169, line: 286, baseType: !200, size: 32, align: 32, offset: 736)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !169, line: 292, baseType: !426, size: 64, align: 64, offset: 768)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "process_command", scope: !268, file: !169, line: 306, baseType: !428, size: 64, align: 64, offset: 832)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!200, !173, !184, !184, !431, !200, !200}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "init_opaque", scope: !268, file: !169, line: 313, baseType: !433, size: 64, align: 64, offset: 896)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!200, !173, !191}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !268, file: !169, line: 327, baseType: !409, size: 64, align: 64, offset: 960)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !169, line: 343, baseType: !431, size: 64, align: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "input_pads", scope: !175, file: !169, line: 345, baseType: !439, size: 64, align: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !175, file: !169, line: 346, baseType: !441, size: 64, align: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !175, file: !169, line: 347, baseType: !443, size: 32, align: 32, offset: 320)
!443 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "output_pads", scope: !175, file: !169, line: 349, baseType: !439, size: 64, align: 64, offset: 384)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !175, file: !169, line: 350, baseType: !441, size: 64, align: 64, offset: 448)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "nb_outputs", scope: !175, file: !169, line: 351, baseType: !443, size: 32, align: 32, offset: 512)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !175, file: !169, line: 353, baseType: !191, size: 64, align: 64, offset: 576)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !175, file: !169, line: 355, baseType: !449, size: 64, align: 64, offset: 640)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraph", file: !169, line: 840, size: 768, align: 64, elements: !451)
!451 = !{!452, !453, !455, !456, !457, !458, !459, !460, !482, !483, !484, !485, !486, !487}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !450, file: !169, line: 841, baseType: !178, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !450, file: !169, line: 842, baseType: !454, size: 64, align: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "nb_filters", scope: !450, file: !169, line: 843, baseType: !443, size: 32, align: 32, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "scale_sws_opts", scope: !450, file: !169, line: 845, baseType: !431, size: 64, align: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "resample_lavr_opts", scope: !450, file: !169, line: 847, baseType: !431, size: 64, align: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !450, file: !169, line: 862, baseType: !200, size: 32, align: 32, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !450, file: !169, line: 869, baseType: !200, size: 32, align: 32, offset: 352)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !450, file: !169, line: 874, baseType: !461, size: 64, align: 64, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterGraphInternal", file: !169, line: 809, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraphInternal", file: !277, line: 148, size: 192, align: 64, elements: !464)
!464 = !{!465, !466, !476}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !463, file: !277, line: 149, baseType: !191, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "thread_execute", scope: !463, file: !277, line: 150, baseType: !467, size: 64, align: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_execute_func", file: !169, line: 837, baseType: !469)
!469 = !DISubroutineType(types: !470)
!470 = !{!200, !173, !471, !191, !475, !200}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_action_func", file: !169, line: 823, baseType: !473)
!473 = !DISubroutineType(types: !474)
!474 = !{!200, !173, !191, !200, !200}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "frame_queues", scope: !463, file: !277, line: 151, baseType: !477, size: 8, align: 8, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameQueueGlobal", file: !478, line: 48, baseType: !479)
!478 = !DIFile(filename: "libavfilter/framequeue.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameQueueGlobal", file: !478, line: 46, size: 8, align: 8, elements: !480)
!480 = !{!481}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !479, file: !478, line: 47, baseType: !186, size: 8, align: 8)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !450, file: !169, line: 881, baseType: !191, size: 64, align: 64, offset: 448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !450, file: !169, line: 895, baseType: !467, size: 64, align: 64, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "aresample_swr_opts", scope: !450, file: !169, line: 897, baseType: !431, size: 64, align: 64, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links", scope: !450, file: !169, line: 906, baseType: !441, size: 64, align: 64, offset: 640)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links_count", scope: !450, file: !169, line: 907, baseType: !200, size: 32, align: 32, offset: 704)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "disable_auto_convert", scope: !450, file: !169, line: 909, baseType: !443, size: 32, align: 32, offset: 736)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !175, file: !169, line: 373, baseType: !200, size: 32, align: 32, offset: 704)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !175, file: !169, line: 378, baseType: !490, size: 64, align: 64, offset: 768)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterInternal", file: !169, line: 335, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterInternal", file: !277, line: 154, size: 64, align: 64, elements: !493)
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !492, file: !277, line: 155, baseType: !467, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "command_queue", scope: !175, file: !169, line: 380, baseType: !496, size: 64, align: 64, offset: 832)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64, align: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterCommand", file: !277, line: 38, size: 320, align: 64, elements: !498)
!498 = !{!499, !500, !501, !502, !503}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !497, file: !277, line: 39, baseType: !210, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !497, file: !277, line: 40, baseType: !431, size: 64, align: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !497, file: !277, line: 41, baseType: !431, size: 64, align: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !497, file: !277, line: 42, baseType: !200, size: 32, align: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !497, file: !277, line: 43, baseType: !496, size: 64, align: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "enable_str", scope: !175, file: !169, line: 382, baseType: !431, size: 64, align: 64, offset: 896)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !175, file: !169, line: 383, baseType: !191, size: 64, align: 64, offset: 960)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "var_values", scope: !175, file: !169, line: 384, baseType: !507, size: 64, align: 64, offset: 1024)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "is_disabled", scope: !175, file: !169, line: 385, baseType: !200, size: 32, align: 32, offset: 1088)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !175, file: !169, line: 394, baseType: !328, size: 64, align: 64, offset: 1152)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !175, file: !169, line: 401, baseType: !200, size: 32, align: 32, offset: 1216)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !175, file: !169, line: 408, baseType: !443, size: 32, align: 32, offset: 1248)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !175, file: !169, line: 424, baseType: !200, size: 32, align: 32, offset: 1280)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "srcpad", scope: !170, file: !169, line: 441, baseType: !439, size: 64, align: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !170, file: !169, line: 443, baseType: !173, size: 64, align: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "dstpad", scope: !170, file: !169, line: 444, baseType: !439, size: 64, align: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !169, line: 446, baseType: !159, size: 32, align: 32, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !170, file: !169, line: 449, baseType: !200, size: 32, align: 32, offset: 288)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !170, file: !169, line: 450, baseType: !200, size: 32, align: 32, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !170, file: !169, line: 451, baseType: !213, size: 64, align: 32, offset: 352)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !170, file: !169, line: 453, baseType: !317, size: 64, align: 64, offset: 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !170, file: !169, line: 454, baseType: !200, size: 32, align: 32, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !170, file: !169, line: 456, baseType: !200, size: 32, align: 32, offset: 544)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !170, file: !169, line: 465, baseType: !213, size: 64, align: 32, offset: 576)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "in_formats", scope: !170, file: !169, line: 481, baseType: !525, size: 64, align: 64, offset: 640)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterFormats", file: !169, line: 70, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterFormats", file: !528, line: 64, size: 256, align: 64, elements: !529)
!528 = !DIFile(filename: "libavfilter/formats.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!529 = !{!530, !531, !532, !533}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "nb_formats", scope: !527, file: !528, line: 65, baseType: !443, size: 32, align: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !527, file: !528, line: 66, baseType: !475, size: 64, align: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !527, file: !528, line: 68, baseType: !443, size: 32, align: 32, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !527, file: !528, line: 69, baseType: !534, size: 64, align: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "out_formats", scope: !170, file: !169, line: 482, baseType: !525, size: 64, align: 64, offset: 704)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "in_samplerates", scope: !170, file: !169, line: 488, baseType: !525, size: 64, align: 64, offset: 768)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "out_samplerates", scope: !170, file: !169, line: 489, baseType: !525, size: 64, align: 64, offset: 832)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "in_channel_layouts", scope: !170, file: !169, line: 490, baseType: !541, size: 64, align: 64, offset: 896)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterChannelLayouts", file: !528, line: 85, size: 256, align: 64, elements: !543)
!543 = !{!544, !546, !547, !548, !549, !550}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !542, file: !528, line: 86, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "nb_channel_layouts", scope: !542, file: !528, line: 87, baseType: !200, size: 32, align: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "all_layouts", scope: !542, file: !528, line: 88, baseType: !186, size: 8, align: 8, offset: 96)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "all_counts", scope: !542, file: !528, line: 89, baseType: !186, size: 8, align: 8, offset: 104)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !542, file: !528, line: 91, baseType: !443, size: 32, align: 32, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !542, file: !528, line: 92, baseType: !551, size: 64, align: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "out_channel_layouts", scope: !170, file: !169, line: 491, baseType: !541, size: 64, align: 64, offset: 960)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "request_samples", scope: !170, file: !169, line: 500, baseType: !200, size: 32, align: 32, offset: 1024)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !170, file: !169, line: 507, baseType: !168, size: 32, align: 32, offset: 1056)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !170, file: !169, line: 512, baseType: !449, size: 64, align: 64, offset: 1088)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts", scope: !170, file: !169, line: 518, baseType: !206, size: 64, align: 64, offset: 1152)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts_us", scope: !170, file: !169, line: 524, baseType: !206, size: 64, align: 64, offset: 1216)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "age_index", scope: !170, file: !169, line: 529, baseType: !200, size: 32, align: 32, offset: 1280)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !170, file: !169, line: 542, baseType: !213, size: 64, align: 32, offset: 1312)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf", scope: !170, file: !169, line: 547, baseType: !285, size: 64, align: 64, offset: 1408)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf_size", scope: !170, file: !169, line: 553, baseType: !200, size: 32, align: 32, offset: 1472)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "min_samples", scope: !170, file: !169, line: 562, baseType: !200, size: 32, align: 32, offset: 1504)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "max_samples", scope: !170, file: !169, line: 568, baseType: !200, size: 32, align: 32, offset: 1536)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !170, file: !169, line: 573, baseType: !200, size: 32, align: 32, offset: 1568)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !170, file: !169, line: 578, baseType: !443, size: 32, align: 32, offset: 1600)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_in", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1664)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_out", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1728)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pool", scope: !170, file: !169, line: 588, baseType: !191, size: 64, align: 64, offset: 1792)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "frame_wanted_out", scope: !170, file: !169, line: 595, baseType: !200, size: 32, align: 32, offset: 1856)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !170, file: !169, line: 601, baseType: !328, size: 64, align: 64, offset: 1920)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "fifo", scope: !170, file: !169, line: 617, baseType: !573, size: 640, align: 64, offset: 1984)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameQueue", file: !478, line: 108, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameQueue", file: !478, line: 53, size: 640, align: 64, elements: !575)
!575 = !{!576, !582, !583, !584, !585, !586, !587, !588, !589, !590}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !574, file: !478, line: 58, baseType: !577, size: 64, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64, align: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameBucket", file: !478, line: 36, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameBucket", file: !478, line: 34, size: 64, align: 64, elements: !580)
!580 = !{!581}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !579, file: !478, line: 35, baseType: !285, size: 64, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !574, file: !478, line: 63, baseType: !381, size: 64, align: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !574, file: !478, line: 69, baseType: !381, size: 64, align: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "queued", scope: !574, file: !478, line: 74, baseType: !381, size: 64, align: 64, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "first_bucket", scope: !574, file: !478, line: 79, baseType: !578, size: 64, align: 64, offset: 256)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "total_frames_head", scope: !574, file: !478, line: 84, baseType: !317, size: 64, align: 64, offset: 320)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "total_frames_tail", scope: !574, file: !478, line: 90, baseType: !317, size: 64, align: 64, offset: 384)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "total_samples_head", scope: !574, file: !478, line: 95, baseType: !317, size: 64, align: 64, offset: 448)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "total_samples_tail", scope: !574, file: !478, line: 101, baseType: !317, size: 64, align: 64, offset: 512)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "samples_skipped", scope: !574, file: !478, line: 106, baseType: !200, size: 32, align: 32, offset: 576)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "frame_blocked_in", scope: !170, file: !169, line: 624, baseType: !200, size: 32, align: 32, offset: 2624)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "status_in", scope: !170, file: !169, line: 631, baseType: !200, size: 32, align: 32, offset: 2656)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "status_in_pts", scope: !170, file: !169, line: 636, baseType: !206, size: 64, align: 64, offset: 2688)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "status_out", scope: !170, file: !169, line: 643, baseType: !200, size: 32, align: 32, offset: 2752)
!595 = !{!596, !597, !598}
!596 = !DIEnumerator(name: "AVLINK_UNINIT", value: 0)
!597 = !DIEnumerator(name: "AVLINK_STARTINIT", value: 1)
!598 = !DIEnumerator(name: "AVLINK_INIT", value: 2)
!599 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !600, line: 497, size: 32, align: 32, elements: !601)
!600 = !DIFile(filename: "libavfilter/avfilter.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!601 = !{!602, !603, !604, !605, !606, !607}
!602 = !DIEnumerator(name: "VAR_T", value: 0)
!603 = !DIEnumerator(name: "VAR_N", value: 1)
!604 = !DIEnumerator(name: "VAR_POS", value: 2)
!605 = !DIEnumerator(name: "VAR_W", value: 3)
!606 = !DIEnumerator(name: "VAR_H", value: 4)
!607 = !DIEnumerator(name: "VAR_VARS_NB", value: 5)
!608 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVHWDeviceType", file: !609, line: 27, size: 32, align: 32, elements: !610)
!609 = !DIFile(filename: "./libavutil/hwcontext.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!610 = !{!611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!611 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_NONE", value: 0)
!612 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_VDPAU", value: 1)
!613 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_CUDA", value: 2)
!614 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_VAAPI", value: 3)
!615 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_DXVA2", value: 4)
!616 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_QSV", value: 5)
!617 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_VIDEOTOOLBOX", value: 6)
!618 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_D3D11VA", value: 7)
!619 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_DRM", value: 8)
!620 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_OPENCL", value: 9)
!621 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_MEDIACODEC", value: 10)
!622 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPixelFormat", file: !39, line: 64, size: 32, align: 32, elements: !623)
!623 = !{!624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820}
!624 = !DIEnumerator(name: "AV_PIX_FMT_NONE", value: -1)
!625 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P", value: 0)
!626 = !DIEnumerator(name: "AV_PIX_FMT_YUYV422", value: 1)
!627 = !DIEnumerator(name: "AV_PIX_FMT_RGB24", value: 2)
!628 = !DIEnumerator(name: "AV_PIX_FMT_BGR24", value: 3)
!629 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P", value: 4)
!630 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P", value: 5)
!631 = !DIEnumerator(name: "AV_PIX_FMT_YUV410P", value: 6)
!632 = !DIEnumerator(name: "AV_PIX_FMT_YUV411P", value: 7)
!633 = !DIEnumerator(name: "AV_PIX_FMT_GRAY8", value: 8)
!634 = !DIEnumerator(name: "AV_PIX_FMT_MONOWHITE", value: 9)
!635 = !DIEnumerator(name: "AV_PIX_FMT_MONOBLACK", value: 10)
!636 = !DIEnumerator(name: "AV_PIX_FMT_PAL8", value: 11)
!637 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ420P", value: 12)
!638 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ422P", value: 13)
!639 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ444P", value: 14)
!640 = !DIEnumerator(name: "AV_PIX_FMT_UYVY422", value: 15)
!641 = !DIEnumerator(name: "AV_PIX_FMT_UYYVYY411", value: 16)
!642 = !DIEnumerator(name: "AV_PIX_FMT_BGR8", value: 17)
!643 = !DIEnumerator(name: "AV_PIX_FMT_BGR4", value: 18)
!644 = !DIEnumerator(name: "AV_PIX_FMT_BGR4_BYTE", value: 19)
!645 = !DIEnumerator(name: "AV_PIX_FMT_RGB8", value: 20)
!646 = !DIEnumerator(name: "AV_PIX_FMT_RGB4", value: 21)
!647 = !DIEnumerator(name: "AV_PIX_FMT_RGB4_BYTE", value: 22)
!648 = !DIEnumerator(name: "AV_PIX_FMT_NV12", value: 23)
!649 = !DIEnumerator(name: "AV_PIX_FMT_NV21", value: 24)
!650 = !DIEnumerator(name: "AV_PIX_FMT_ARGB", value: 25)
!651 = !DIEnumerator(name: "AV_PIX_FMT_RGBA", value: 26)
!652 = !DIEnumerator(name: "AV_PIX_FMT_ABGR", value: 27)
!653 = !DIEnumerator(name: "AV_PIX_FMT_BGRA", value: 28)
!654 = !DIEnumerator(name: "AV_PIX_FMT_GRAY16BE", value: 29)
!655 = !DIEnumerator(name: "AV_PIX_FMT_GRAY16LE", value: 30)
!656 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P", value: 31)
!657 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ440P", value: 32)
!658 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P", value: 33)
!659 = !DIEnumerator(name: "AV_PIX_FMT_RGB48BE", value: 34)
!660 = !DIEnumerator(name: "AV_PIX_FMT_RGB48LE", value: 35)
!661 = !DIEnumerator(name: "AV_PIX_FMT_RGB565BE", value: 36)
!662 = !DIEnumerator(name: "AV_PIX_FMT_RGB565LE", value: 37)
!663 = !DIEnumerator(name: "AV_PIX_FMT_RGB555BE", value: 38)
!664 = !DIEnumerator(name: "AV_PIX_FMT_RGB555LE", value: 39)
!665 = !DIEnumerator(name: "AV_PIX_FMT_BGR565BE", value: 40)
!666 = !DIEnumerator(name: "AV_PIX_FMT_BGR565LE", value: 41)
!667 = !DIEnumerator(name: "AV_PIX_FMT_BGR555BE", value: 42)
!668 = !DIEnumerator(name: "AV_PIX_FMT_BGR555LE", value: 43)
!669 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_MOCO", value: 44)
!670 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_IDCT", value: 45)
!671 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_VLD", value: 46)
!672 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI", value: 46)
!673 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P16LE", value: 47)
!674 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P16BE", value: 48)
!675 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P16LE", value: 49)
!676 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P16BE", value: 50)
!677 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P16LE", value: 51)
!678 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P16BE", value: 52)
!679 = !DIEnumerator(name: "AV_PIX_FMT_DXVA2_VLD", value: 53)
!680 = !DIEnumerator(name: "AV_PIX_FMT_RGB444LE", value: 54)
!681 = !DIEnumerator(name: "AV_PIX_FMT_RGB444BE", value: 55)
!682 = !DIEnumerator(name: "AV_PIX_FMT_BGR444LE", value: 56)
!683 = !DIEnumerator(name: "AV_PIX_FMT_BGR444BE", value: 57)
!684 = !DIEnumerator(name: "AV_PIX_FMT_YA8", value: 58)
!685 = !DIEnumerator(name: "AV_PIX_FMT_Y400A", value: 58)
!686 = !DIEnumerator(name: "AV_PIX_FMT_GRAY8A", value: 58)
!687 = !DIEnumerator(name: "AV_PIX_FMT_BGR48BE", value: 59)
!688 = !DIEnumerator(name: "AV_PIX_FMT_BGR48LE", value: 60)
!689 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P9BE", value: 61)
!690 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P9LE", value: 62)
!691 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P10BE", value: 63)
!692 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P10LE", value: 64)
!693 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P10BE", value: 65)
!694 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P10LE", value: 66)
!695 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P9BE", value: 67)
!696 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P9LE", value: 68)
!697 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P10BE", value: 69)
!698 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P10LE", value: 70)
!699 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P9BE", value: 71)
!700 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P9LE", value: 72)
!701 = !DIEnumerator(name: "AV_PIX_FMT_GBRP", value: 73)
!702 = !DIEnumerator(name: "AV_PIX_FMT_GBR24P", value: 73)
!703 = !DIEnumerator(name: "AV_PIX_FMT_GBRP9BE", value: 74)
!704 = !DIEnumerator(name: "AV_PIX_FMT_GBRP9LE", value: 75)
!705 = !DIEnumerator(name: "AV_PIX_FMT_GBRP10BE", value: 76)
!706 = !DIEnumerator(name: "AV_PIX_FMT_GBRP10LE", value: 77)
!707 = !DIEnumerator(name: "AV_PIX_FMT_GBRP16BE", value: 78)
!708 = !DIEnumerator(name: "AV_PIX_FMT_GBRP16LE", value: 79)
!709 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P", value: 80)
!710 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P", value: 81)
!711 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P9BE", value: 82)
!712 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P9LE", value: 83)
!713 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P9BE", value: 84)
!714 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P9LE", value: 85)
!715 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P9BE", value: 86)
!716 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P9LE", value: 87)
!717 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P10BE", value: 88)
!718 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P10LE", value: 89)
!719 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P10BE", value: 90)
!720 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P10LE", value: 91)
!721 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P10BE", value: 92)
!722 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P10LE", value: 93)
!723 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P16BE", value: 94)
!724 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P16LE", value: 95)
!725 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P16BE", value: 96)
!726 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P16LE", value: 97)
!727 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P16BE", value: 98)
!728 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P16LE", value: 99)
!729 = !DIEnumerator(name: "AV_PIX_FMT_VDPAU", value: 100)
!730 = !DIEnumerator(name: "AV_PIX_FMT_XYZ12LE", value: 101)
!731 = !DIEnumerator(name: "AV_PIX_FMT_XYZ12BE", value: 102)
!732 = !DIEnumerator(name: "AV_PIX_FMT_NV16", value: 103)
!733 = !DIEnumerator(name: "AV_PIX_FMT_NV20LE", value: 104)
!734 = !DIEnumerator(name: "AV_PIX_FMT_NV20BE", value: 105)
!735 = !DIEnumerator(name: "AV_PIX_FMT_RGBA64BE", value: 106)
!736 = !DIEnumerator(name: "AV_PIX_FMT_RGBA64LE", value: 107)
!737 = !DIEnumerator(name: "AV_PIX_FMT_BGRA64BE", value: 108)
!738 = !DIEnumerator(name: "AV_PIX_FMT_BGRA64LE", value: 109)
!739 = !DIEnumerator(name: "AV_PIX_FMT_YVYU422", value: 110)
!740 = !DIEnumerator(name: "AV_PIX_FMT_YA16BE", value: 111)
!741 = !DIEnumerator(name: "AV_PIX_FMT_YA16LE", value: 112)
!742 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP", value: 113)
!743 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP16BE", value: 114)
!744 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP16LE", value: 115)
!745 = !DIEnumerator(name: "AV_PIX_FMT_QSV", value: 116)
!746 = !DIEnumerator(name: "AV_PIX_FMT_MMAL", value: 117)
!747 = !DIEnumerator(name: "AV_PIX_FMT_D3D11VA_VLD", value: 118)
!748 = !DIEnumerator(name: "AV_PIX_FMT_CUDA", value: 119)
!749 = !DIEnumerator(name: "AV_PIX_FMT_0RGB", value: 120)
!750 = !DIEnumerator(name: "AV_PIX_FMT_RGB0", value: 121)
!751 = !DIEnumerator(name: "AV_PIX_FMT_0BGR", value: 122)
!752 = !DIEnumerator(name: "AV_PIX_FMT_BGR0", value: 123)
!753 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P12BE", value: 124)
!754 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P12LE", value: 125)
!755 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P14BE", value: 126)
!756 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P14LE", value: 127)
!757 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P12BE", value: 128)
!758 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P12LE", value: 129)
!759 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P14BE", value: 130)
!760 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P14LE", value: 131)
!761 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P12BE", value: 132)
!762 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P12LE", value: 133)
!763 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P14BE", value: 134)
!764 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P14LE", value: 135)
!765 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12BE", value: 136)
!766 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12LE", value: 137)
!767 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14BE", value: 138)
!768 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14LE", value: 139)
!769 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ411P", value: 140)
!770 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR8", value: 141)
!771 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB8", value: 142)
!772 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG8", value: 143)
!773 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG8", value: 144)
!774 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16LE", value: 145)
!775 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16BE", value: 146)
!776 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16LE", value: 147)
!777 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16BE", value: 148)
!778 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16LE", value: 149)
!779 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16BE", value: 150)
!780 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16LE", value: 151)
!781 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16BE", value: 152)
!782 = !DIEnumerator(name: "AV_PIX_FMT_XVMC", value: 153)
!783 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10LE", value: 154)
!784 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10BE", value: 155)
!785 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12LE", value: 156)
!786 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12BE", value: 157)
!787 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64LE", value: 158)
!788 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64BE", value: 159)
!789 = !DIEnumerator(name: "AV_PIX_FMT_VIDEOTOOLBOX", value: 160)
!790 = !DIEnumerator(name: "AV_PIX_FMT_P010LE", value: 161)
!791 = !DIEnumerator(name: "AV_PIX_FMT_P010BE", value: 162)
!792 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12BE", value: 163)
!793 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12LE", value: 164)
!794 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10BE", value: 165)
!795 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10LE", value: 166)
!796 = !DIEnumerator(name: "AV_PIX_FMT_MEDIACODEC", value: 167)
!797 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12BE", value: 168)
!798 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12LE", value: 169)
!799 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10BE", value: 170)
!800 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10LE", value: 171)
!801 = !DIEnumerator(name: "AV_PIX_FMT_P016LE", value: 172)
!802 = !DIEnumerator(name: "AV_PIX_FMT_P016BE", value: 173)
!803 = !DIEnumerator(name: "AV_PIX_FMT_D3D11", value: 174)
!804 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9BE", value: 175)
!805 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9LE", value: 176)
!806 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32BE", value: 177)
!807 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32LE", value: 178)
!808 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32BE", value: 179)
!809 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32LE", value: 180)
!810 = !DIEnumerator(name: "AV_PIX_FMT_DRM_PRIME", value: 181)
!811 = !DIEnumerator(name: "AV_PIX_FMT_OPENCL", value: 182)
!812 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14BE", value: 183)
!813 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14LE", value: 184)
!814 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32BE", value: 185)
!815 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32LE", value: 186)
!816 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12BE", value: 187)
!817 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12LE", value: 188)
!818 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12BE", value: 189)
!819 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12LE", value: 190)
!820 = !DIEnumerator(name: "AV_PIX_FMT_NB", value: 191)
!821 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 523, size: 32, align: 32, elements: !822)
!822 = !{!823}
!823 = !DIEnumerator(name: "AV_OPT_FLAG_IMPLICIT_KEY", value: 1)
!824 = !{!825, !291, !191, !431, !826, !206, !200, !443, !831, !832, !835, !879, !880, !210}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64, align: 64)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64, align: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFramePool", file: !829, line: 32, baseType: !830)
!829 = !DIFile(filename: "libavfilter/framepool.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "FFFramePool", file: !829, line: 32, flags: DIFlagFwdDecl)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64, align: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64, align: 64)
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64, align: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVHWFramesContext", file: !609, line: 229, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWFramesContext", file: !609, line: 123, size: 704, align: 64, elements: !838)
!838 = !{!839, !840, !844, !845, !863, !864, !869, !870, !874, !875, !876, !877, !878}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !837, file: !609, line: 127, baseType: !178, size: 64, align: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !837, file: !609, line: 133, baseType: !841, size: 64, align: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64, align: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVHWFramesInternal", file: !609, line: 111, baseType: !843)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWFramesInternal", file: !609, line: 111, flags: DIFlagFwdDecl)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "device_ref", scope: !837, file: !609, line: 140, baseType: !328, size: 64, align: 64, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "device_ctx", scope: !837, file: !609, line: 148, baseType: !846, size: 64, align: 64, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64, align: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVHWDeviceContext", file: !609, line: 109, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWDeviceContext", file: !609, line: 60, size: 384, align: 64, elements: !849)
!849 = !{!850, !851, !855, !856, !857, !862}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !848, file: !609, line: 64, baseType: !178, size: 64, align: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !848, file: !609, line: 70, baseType: !852, size: 64, align: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64, align: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVHWDeviceInternal", file: !609, line: 41, baseType: !854)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWDeviceInternal", file: !609, line: 41, flags: DIFlagFwdDecl)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !848, file: !609, line: 78, baseType: !608, size: 32, align: 32, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "hwctx", scope: !848, file: !609, line: 91, baseType: !191, size: 64, align: 64, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !848, file: !609, line: 103, baseType: !858, size: 64, align: 64, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64, align: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{null, !861}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64, align: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "user_opaque", scope: !848, file: !609, line: 108, baseType: !191, size: 64, align: 64, offset: 320)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "hwctx", scope: !837, file: !609, line: 161, baseType: !191, size: 64, align: 64, offset: 256)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !837, file: !609, line: 169, baseType: !865, size: 64, align: 64, offset: 320)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64, align: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{null, !868}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64, align: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "user_opaque", scope: !837, file: !609, line: 174, baseType: !191, size: 64, align: 64, offset: 384)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !837, file: !609, line: 189, baseType: !871, size: 64, align: 64, offset: 448)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64, align: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !330, line: 238, baseType: !873)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !330, line: 238, flags: DIFlagFwdDecl)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "initial_pool_size", scope: !837, file: !609, line: 198, baseType: !200, size: 32, align: 32, offset: 512)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !837, file: !609, line: 208, baseType: !622, size: 32, align: 32, offset: 544)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "sw_format", scope: !837, file: !609, line: 221, baseType: !622, size: 32, align: 32, offset: 576)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !837, file: !609, line: 228, baseType: !200, size: 32, align: 32, offset: 608)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !837, file: !609, line: 228, baseType: !200, size: 32, align: 32, offset: 640)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !293, line: 119, baseType: !208)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64, align: 64)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64, align: 64)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVExpr", file: !883, line: 31, baseType: !884)
!883 = !DIFile(filename: "./libavutil/eval.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVExpr", file: !883, line: 31, flags: DIFlagFwdDecl)
!885 = !{!886, !890, !895, !896}
!886 = distinct !DIGlobalVariable(name: "av_filter_ffversion", scope: !0, file: !600, line: 47, type: !887, isLocal: false, isDefinition: true, variable: [32 x i8]* @av_filter_ffversion)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 256, align: 8, elements: !888)
!888 = !{!889}
!889 = !DISubrange(count: 32)
!890 = distinct !DIGlobalVariable(name: "var_names", scope: !0, file: !600, line: 488, type: !891, isLocal: true, isDefinition: true, variable: [6 x i8*]* @var_names)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !892, size: 384, align: 64, elements: !893)
!892 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!893 = !{!894}
!894 = !DISubrange(count: 6)
!895 = distinct !DIGlobalVariable(name: "avfilter_class", scope: !0, file: !600, line: 640, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @avfilter_class)
!896 = distinct !DIGlobalVariable(name: "avfilter_options", scope: !0, file: !600, line: 628, type: !897, isLocal: true, isDefinition: true, variable: <{ %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption }>* @avfilter_options)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 3072, align: 64, elements: !893)
!898 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !117, line: 301, baseType: !195)
!900 = !{i32 2, !"Dwarf Version", i32 4}
!901 = !{i32 2, !"Debug Info Version", i32 3}
!902 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!903 = distinct !DISubprogram(name: "ff_tlog_ref", scope: !600, file: !600, line: 49, type: !904, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !906)
!904 = !DISubroutineType(types: !905)
!905 = !{null, !191, !285, !200}
!906 = !{}
!907 = !DILocalVariable(name: "ctx", arg: 1, scope: !903, file: !600, line: 49, type: !191)
!908 = !DIExpression()
!909 = !DILocation(line: 49, column: 24, scope: !903)
!910 = !DILocalVariable(name: "ref", arg: 2, scope: !903, file: !600, line: 49, type: !285)
!911 = !DILocation(line: 49, column: 38, scope: !903)
!912 = !DILocalVariable(name: "end", arg: 3, scope: !903, file: !600, line: 49, type: !200)
!913 = !DILocation(line: 49, column: 47, scope: !903)
!914 = !DILocalVariable(name: "buf", scope: !903, file: !600, line: 51, type: !915)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 128, align: 8, elements: !916)
!916 = !{!917}
!917 = !DISubrange(count: 16)
!918 = !DILocation(line: 51, column: 34, scope: !903)
!919 = !DILocation(line: 52, column: 5, scope: !903)
!920 = distinct !{!920, !919}
!921 = !DILocation(line: 52, column: 10, scope: !922)
!922 = !DILexicalBlockFile(scope: !923, file: !600, discriminator: 1)
!923 = distinct !DILexicalBlock(scope: !903, file: !600, line: 52, column: 8)
!924 = !DILocation(line: 58, column: 9, scope: !925)
!925 = distinct !DILexicalBlock(scope: !903, file: !600, line: 58, column: 9)
!926 = !DILocation(line: 58, column: 14, scope: !925)
!927 = !DILocation(line: 58, column: 9, scope: !903)
!928 = !DILocation(line: 59, column: 9, scope: !929)
!929 = distinct !DILexicalBlock(scope: !925, file: !600, line: 58, column: 21)
!930 = distinct !{!930, !928}
!931 = !DILocation(line: 59, column: 14, scope: !932)
!932 = !DILexicalBlockFile(scope: !933, file: !600, discriminator: 1)
!933 = distinct !DILexicalBlock(scope: !929, file: !600, line: 59, column: 12)
!934 = !DILocation(line: 66, column: 5, scope: !929)
!935 = !DILocation(line: 67, column: 9, scope: !936)
!936 = distinct !DILexicalBlock(scope: !903, file: !600, line: 67, column: 9)
!937 = !DILocation(line: 67, column: 14, scope: !936)
!938 = !DILocation(line: 67, column: 9, scope: !903)
!939 = !DILocation(line: 68, column: 9, scope: !940)
!940 = distinct !DILexicalBlock(scope: !936, file: !600, line: 67, column: 26)
!941 = distinct !{!941, !939}
!942 = !DILocation(line: 68, column: 14, scope: !943)
!943 = !DILexicalBlockFile(scope: !944, file: !600, discriminator: 1)
!944 = distinct !DILexicalBlock(scope: !940, file: !600, line: 68, column: 12)
!945 = !DILocation(line: 72, column: 5, scope: !940)
!946 = !DILocation(line: 74, column: 5, scope: !903)
!947 = distinct !{!947, !946}
!948 = !DILocation(line: 74, column: 10, scope: !949)
!949 = !DILexicalBlockFile(scope: !950, file: !600, discriminator: 1)
!950 = distinct !DILexicalBlock(scope: !903, file: !600, line: 74, column: 8)
!951 = !DILocation(line: 75, column: 1, scope: !903)
!952 = distinct !DISubprogram(name: "avfilter_version", scope: !600, file: !600, line: 77, type: !953, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !906)
!953 = !DISubroutineType(types: !954)
!954 = !{!443}
!955 = !DILocation(line: 79, column: 5, scope: !952)
!956 = distinct !{!956, !955}
!957 = !DILocation(line: 79, column: 99, scope: !958)
!958 = !DILexicalBlockFile(scope: !959, file: !600, discriminator: 1)
!959 = distinct !DILexicalBlock(scope: !952, file: !600, line: 79, column: 8)
!960 = !DILocation(line: 80, column: 5, scope: !952)
!961 = distinct !DISubprogram(name: "avfilter_configuration", scope: !600, file: !600, line: 83, type: !962, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !906)
!962 = !DISubroutineType(types: !963)
!963 = !{!184}
!964 = !DILocation(line: 85, column: 5, scope: !961)
!965 = distinct !DISubprogram(name: "avfilter_license", scope: !600, file: !600, line: 88, type: !962, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !906)
!966 = !DILocation(line: 91, column: 5, scope: !965)
!967 = distinct !DISubprogram(name: "ff_command_queue_pop", scope: !600, file: !600, line: 94, type: !420, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !906)
!968 = !DILocalVariable(name: "filter", arg: 1, scope: !967, file: !600, line: 94, type: !173)
!969 = !DILocation(line: 94, column: 44, scope: !967)
!970 = !DILocalVariable(name: "c", scope: !967, file: !600, line: 96, type: !971)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterCommand", file: !277, line: 44, baseType: !497)
!973 = !DILocation(line: 96, column: 22, scope: !967)
!974 = !DILocation(line: 96, column: 25, scope: !967)
!975 = !DILocation(line: 96, column: 33, scope: !967)
!976 = !DILocation(line: 97, column: 15, scope: !967)
!977 = !DILocation(line: 97, column: 18, scope: !967)
!978 = !DILocation(line: 97, column: 14, scope: !967)
!979 = !DILocation(line: 97, column: 5, scope: !967)
!980 = !DILocation(line: 98, column: 15, scope: !967)
!981 = !DILocation(line: 98, column: 18, scope: !967)
!982 = !DILocation(line: 98, column: 14, scope: !967)
!983 = !DILocation(line: 98, column: 5, scope: !967)
!984 = !DILocation(line: 99, column: 28, scope: !967)
!985 = !DILocation(line: 99, column: 31, scope: !967)
!986 = !DILocation(line: 99, column: 5, scope: !967)
!987 = !DILocation(line: 99, column: 13, scope: !967)
!988 = !DILocation(line: 99, column: 26, scope: !967)
!989 = !DILocation(line: 100, column: 13, scope: !967)
!990 = !DILocation(line: 100, column: 5, scope: !967)
!991 = !DILocation(line: 101, column: 1, scope: !967)
!992 = distinct !DISubprogram(name: "ff_insert_pad", scope: !600, file: !600, line: 103, type: !993, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !906)
!993 = !DISubroutineType(types: !994)
!994 = !{!200, !443, !825, !381, !995, !996, !439}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!997 = !DILocalVariable(name: "idx", arg: 1, scope: !992, file: !600, line: 103, type: !443)
!998 = !DILocation(line: 103, column: 28, scope: !992)
!999 = !DILocalVariable(name: "count", arg: 2, scope: !992, file: !600, line: 103, type: !825)
!1000 = !DILocation(line: 103, column: 43, scope: !992)
!1001 = !DILocalVariable(name: "padidx_off", arg: 3, scope: !992, file: !600, line: 103, type: !381)
!1002 = !DILocation(line: 103, column: 57, scope: !992)
!1003 = !DILocalVariable(name: "pads", arg: 4, scope: !992, file: !600, line: 104, type: !995)
!1004 = !DILocation(line: 104, column: 34, scope: !992)
!1005 = !DILocalVariable(name: "links", arg: 5, scope: !992, file: !600, line: 104, type: !996)
!1006 = !DILocation(line: 104, column: 56, scope: !992)
!1007 = !DILocalVariable(name: "newpad", arg: 6, scope: !992, file: !600, line: 105, type: !439)
!1008 = !DILocation(line: 105, column: 33, scope: !992)
!1009 = !DILocalVariable(name: "newlinks", scope: !992, file: !600, line: 107, type: !441)
!1010 = !DILocation(line: 107, column: 20, scope: !992)
!1011 = !DILocalVariable(name: "newpads", scope: !992, file: !600, line: 108, type: !439)
!1012 = !DILocation(line: 108, column: 18, scope: !992)
!1013 = !DILocalVariable(name: "i", scope: !992, file: !600, line: 109, type: !443)
!1014 = !DILocation(line: 109, column: 14, scope: !992)
!1015 = !DILocation(line: 111, column: 13, scope: !992)
!1016 = !DILocation(line: 111, column: 22, scope: !992)
!1017 = !DILocation(line: 111, column: 21, scope: !992)
!1018 = !DILocation(line: 111, column: 18, scope: !992)
!1019 = !DILocation(line: 111, column: 12, scope: !992)
!1020 = !DILocation(line: 111, column: 33, scope: !1021)
!1021 = !DILexicalBlockFile(scope: !992, file: !600, discriminator: 1)
!1022 = !DILocation(line: 111, column: 32, scope: !1021)
!1023 = !DILocation(line: 111, column: 12, scope: !1021)
!1024 = !DILocation(line: 111, column: 43, scope: !1025)
!1025 = !DILexicalBlockFile(scope: !992, file: !600, discriminator: 2)
!1026 = !DILocation(line: 111, column: 12, scope: !1025)
!1027 = !DILocation(line: 111, column: 12, scope: !1028)
!1028 = !DILexicalBlockFile(scope: !992, file: !600, discriminator: 3)
!1029 = !DILocation(line: 111, column: 9, scope: !1028)
!1030 = !DILocation(line: 113, column: 33, scope: !992)
!1031 = !DILocation(line: 113, column: 32, scope: !992)
!1032 = !DILocation(line: 113, column: 40, scope: !992)
!1033 = !DILocation(line: 113, column: 39, scope: !992)
!1034 = !DILocation(line: 113, column: 46, scope: !992)
!1035 = !DILocation(line: 113, column: 15, scope: !992)
!1036 = !DILocation(line: 113, column: 13, scope: !992)
!1037 = !DILocation(line: 114, column: 34, scope: !992)
!1038 = !DILocation(line: 114, column: 33, scope: !992)
!1039 = !DILocation(line: 114, column: 42, scope: !992)
!1040 = !DILocation(line: 114, column: 41, scope: !992)
!1041 = !DILocation(line: 114, column: 48, scope: !992)
!1042 = !DILocation(line: 114, column: 16, scope: !992)
!1043 = !DILocation(line: 114, column: 14, scope: !992)
!1044 = !DILocation(line: 115, column: 9, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !992, file: !600, line: 115, column: 9)
!1046 = !DILocation(line: 115, column: 9, scope: !992)
!1047 = !DILocation(line: 116, column: 17, scope: !1045)
!1048 = !DILocation(line: 116, column: 10, scope: !1045)
!1049 = !DILocation(line: 116, column: 15, scope: !1045)
!1050 = !DILocation(line: 116, column: 9, scope: !1045)
!1051 = !DILocation(line: 117, column: 9, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !992, file: !600, line: 117, column: 9)
!1053 = !DILocation(line: 117, column: 9, scope: !992)
!1054 = !DILocation(line: 118, column: 18, scope: !1052)
!1055 = !DILocation(line: 118, column: 10, scope: !1052)
!1056 = !DILocation(line: 118, column: 16, scope: !1052)
!1057 = !DILocation(line: 118, column: 9, scope: !1052)
!1058 = !DILocation(line: 119, column: 10, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !992, file: !600, line: 119, column: 9)
!1060 = !DILocation(line: 119, column: 18, scope: !1059)
!1061 = !DILocation(line: 119, column: 22, scope: !1062)
!1062 = !DILexicalBlockFile(scope: !1059, file: !600, discriminator: 1)
!1063 = !DILocation(line: 119, column: 9, scope: !1062)
!1064 = !DILocation(line: 120, column: 9, scope: !1059)
!1065 = !DILocation(line: 122, column: 14, scope: !992)
!1066 = !DILocation(line: 122, column: 13, scope: !992)
!1067 = !DILocation(line: 122, column: 21, scope: !992)
!1068 = !DILocation(line: 122, column: 19, scope: !992)
!1069 = !DILocation(line: 122, column: 25, scope: !992)
!1070 = !DILocation(line: 122, column: 5, scope: !992)
!1071 = !DILocation(line: 122, column: 31, scope: !992)
!1072 = !DILocation(line: 122, column: 30, scope: !992)
!1073 = !DILocation(line: 122, column: 38, scope: !992)
!1074 = !DILocation(line: 122, column: 36, scope: !992)
!1075 = !DILocation(line: 122, column: 67, scope: !992)
!1076 = !DILocation(line: 122, column: 66, scope: !992)
!1077 = !DILocation(line: 122, column: 75, scope: !992)
!1078 = !DILocation(line: 122, column: 73, scope: !992)
!1079 = !DILocation(line: 122, column: 65, scope: !992)
!1080 = !DILocation(line: 122, column: 63, scope: !992)
!1081 = !DILocation(line: 123, column: 14, scope: !992)
!1082 = !DILocation(line: 123, column: 13, scope: !992)
!1083 = !DILocation(line: 123, column: 22, scope: !992)
!1084 = !DILocation(line: 123, column: 20, scope: !992)
!1085 = !DILocation(line: 123, column: 26, scope: !992)
!1086 = !DILocation(line: 123, column: 5, scope: !992)
!1087 = !DILocation(line: 123, column: 32, scope: !992)
!1088 = !DILocation(line: 123, column: 31, scope: !992)
!1089 = !DILocation(line: 123, column: 40, scope: !992)
!1090 = !DILocation(line: 123, column: 38, scope: !992)
!1091 = !DILocation(line: 123, column: 71, scope: !992)
!1092 = !DILocation(line: 123, column: 70, scope: !992)
!1093 = !DILocation(line: 123, column: 79, scope: !992)
!1094 = !DILocation(line: 123, column: 77, scope: !992)
!1095 = !DILocation(line: 123, column: 69, scope: !992)
!1096 = !DILocation(line: 123, column: 67, scope: !992)
!1097 = !DILocation(line: 124, column: 13, scope: !992)
!1098 = !DILocation(line: 124, column: 12, scope: !992)
!1099 = !DILocation(line: 124, column: 20, scope: !992)
!1100 = !DILocation(line: 124, column: 18, scope: !992)
!1101 = !DILocation(line: 124, column: 5, scope: !992)
!1102 = !DILocation(line: 124, column: 25, scope: !992)
!1103 = !DILocation(line: 125, column: 14, scope: !992)
!1104 = !DILocation(line: 125, column: 5, scope: !992)
!1105 = !DILocation(line: 125, column: 7, scope: !992)
!1106 = !DILocation(line: 125, column: 6, scope: !992)
!1107 = !DILocation(line: 125, column: 19, scope: !992)
!1108 = !DILocation(line: 127, column: 7, scope: !992)
!1109 = !DILocation(line: 127, column: 13, scope: !992)
!1110 = !DILocation(line: 128, column: 14, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !992, file: !600, line: 128, column: 5)
!1112 = !DILocation(line: 128, column: 18, scope: !1111)
!1113 = !DILocation(line: 128, column: 12, scope: !1111)
!1114 = !DILocation(line: 128, column: 10, scope: !1111)
!1115 = !DILocation(line: 128, column: 23, scope: !1116)
!1116 = !DILexicalBlockFile(scope: !1117, file: !600, discriminator: 1)
!1117 = distinct !DILexicalBlock(scope: !1111, file: !600, line: 128, column: 5)
!1118 = !DILocation(line: 128, column: 28, scope: !1116)
!1119 = !DILocation(line: 128, column: 27, scope: !1116)
!1120 = !DILocation(line: 128, column: 25, scope: !1116)
!1121 = !DILocation(line: 128, column: 5, scope: !1116)
!1122 = !DILocation(line: 129, column: 22, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1117, file: !600, line: 129, column: 13)
!1124 = !DILocation(line: 129, column: 13, scope: !1123)
!1125 = !DILocation(line: 129, column: 15, scope: !1123)
!1126 = !DILocation(line: 129, column: 14, scope: !1123)
!1127 = !DILocation(line: 129, column: 13, scope: !1117)
!1128 = !DILocation(line: 130, column: 49, scope: !1123)
!1129 = !DILocation(line: 130, column: 40, scope: !1123)
!1130 = !DILocation(line: 130, column: 42, scope: !1123)
!1131 = !DILocation(line: 130, column: 41, scope: !1123)
!1132 = !DILocation(line: 130, column: 28, scope: !1123)
!1133 = !DILocation(line: 130, column: 54, scope: !1123)
!1134 = !DILocation(line: 130, column: 52, scope: !1123)
!1135 = !DILocation(line: 130, column: 14, scope: !1123)
!1136 = !DILocation(line: 130, column: 66, scope: !1123)
!1137 = !DILocation(line: 130, column: 13, scope: !1123)
!1138 = !DILocation(line: 129, column: 23, scope: !1139)
!1139 = !DILexicalBlockFile(scope: !1123, file: !600, discriminator: 1)
!1140 = !DILocation(line: 128, column: 36, scope: !1141)
!1141 = !DILexicalBlockFile(scope: !1117, file: !600, discriminator: 2)
!1142 = !DILocation(line: 128, column: 5, scope: !1141)
!1143 = distinct !{!1143, !1144}
!1144 = !DILocation(line: 128, column: 5, scope: !992)
!1145 = !DILocation(line: 132, column: 5, scope: !992)
!1146 = !DILocation(line: 133, column: 1, scope: !992)
!1147 = distinct !DISubprogram(name: "avfilter_link", scope: !600, file: !600, line: 135, type: !1148, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !906)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!200, !173, !443, !173, !443}
!1150 = !DILocalVariable(name: "src", arg: 1, scope: !1147, file: !600, line: 135, type: !173)
!1151 = !DILocation(line: 135, column: 36, scope: !1147)
!1152 = !DILocalVariable(name: "srcpad", arg: 2, scope: !1147, file: !600, line: 135, type: !443)
!1153 = !DILocation(line: 135, column: 50, scope: !1147)
!1154 = !DILocalVariable(name: "dst", arg: 3, scope: !1147, file: !600, line: 136, type: !173)
!1155 = !DILocation(line: 136, column: 36, scope: !1147)
!1156 = !DILocalVariable(name: "dstpad", arg: 4, scope: !1147, file: !600, line: 136, type: !443)
!1157 = !DILocation(line: 136, column: 50, scope: !1147)
!1158 = !DILocalVariable(name: "link", scope: !1147, file: !600, line: 138, type: !387)
!1159 = !DILocation(line: 138, column: 19, scope: !1147)
!1160 = !DILocation(line: 140, column: 5, scope: !1147)
!1161 = distinct !{!1161, !1160}
!1162 = !DILocation(line: 140, column: 16, scope: !1163)
!1163 = !DILexicalBlockFile(scope: !1164, file: !600, discriminator: 1)
!1164 = distinct !DILexicalBlock(scope: !1165, file: !600, line: 140, column: 14)
!1165 = distinct !DILexicalBlock(scope: !1147, file: !600, line: 140, column: 8)
!1166 = !DILocation(line: 140, column: 21, scope: !1163)
!1167 = !DILocation(line: 140, column: 15, scope: !1163)
!1168 = !DILocation(line: 140, column: 14, scope: !1163)
!1169 = !DILocation(line: 140, column: 31, scope: !1170)
!1170 = !DILexicalBlockFile(scope: !1171, file: !600, discriminator: 2)
!1171 = distinct !DILexicalBlock(scope: !1164, file: !600, line: 140, column: 29)
!1172 = !DILocation(line: 140, column: 89, scope: !1173)
!1173 = !DILexicalBlockFile(scope: !1170, file: !600, discriminator: 4)
!1174 = !DILocation(line: 140, column: 89, scope: !1170)
!1175 = !DILocation(line: 140, column: 100, scope: !1176)
!1176 = !DILexicalBlockFile(scope: !1165, file: !600, discriminator: 3)
!1177 = !DILocation(line: 141, column: 5, scope: !1147)
!1178 = distinct !{!1178, !1177}
!1179 = !DILocation(line: 141, column: 16, scope: !1180)
!1180 = !DILexicalBlockFile(scope: !1181, file: !600, discriminator: 1)
!1181 = distinct !DILexicalBlock(scope: !1182, file: !600, line: 141, column: 14)
!1182 = distinct !DILexicalBlock(scope: !1147, file: !600, line: 141, column: 8)
!1183 = !DILocation(line: 141, column: 21, scope: !1180)
!1184 = !DILocation(line: 141, column: 15, scope: !1180)
!1185 = !DILocation(line: 141, column: 14, scope: !1180)
!1186 = !DILocation(line: 141, column: 31, scope: !1187)
!1187 = !DILexicalBlockFile(scope: !1188, file: !600, discriminator: 2)
!1188 = distinct !DILexicalBlock(scope: !1181, file: !600, line: 141, column: 29)
!1189 = !DILocation(line: 141, column: 89, scope: !1190)
!1190 = !DILexicalBlockFile(scope: !1187, file: !600, discriminator: 4)
!1191 = !DILocation(line: 141, column: 89, scope: !1187)
!1192 = !DILocation(line: 141, column: 100, scope: !1193)
!1193 = !DILexicalBlockFile(scope: !1182, file: !600, discriminator: 3)
!1194 = !DILocation(line: 142, column: 5, scope: !1147)
!1195 = distinct !{!1195, !1194}
!1196 = !DILocation(line: 142, column: 16, scope: !1197)
!1197 = !DILexicalBlockFile(scope: !1198, file: !600, discriminator: 1)
!1198 = distinct !DILexicalBlock(scope: !1199, file: !600, line: 142, column: 14)
!1199 = distinct !DILexicalBlock(scope: !1147, file: !600, line: 142, column: 8)
!1200 = !DILocation(line: 142, column: 21, scope: !1197)
!1201 = !DILocation(line: 142, column: 30, scope: !1197)
!1202 = !DILocation(line: 142, column: 35, scope: !1197)
!1203 = !DILocation(line: 142, column: 27, scope: !1197)
!1204 = !DILocation(line: 142, column: 14, scope: !1197)
!1205 = !DILocation(line: 142, column: 45, scope: !1206)
!1206 = !DILexicalBlockFile(scope: !1207, file: !600, discriminator: 2)
!1207 = distinct !DILexicalBlock(scope: !1198, file: !600, line: 142, column: 43)
!1208 = !DILocation(line: 142, column: 103, scope: !1209)
!1209 = !DILexicalBlockFile(scope: !1206, file: !600, discriminator: 4)
!1210 = !DILocation(line: 142, column: 103, scope: !1206)
!1211 = !DILocation(line: 142, column: 114, scope: !1212)
!1212 = !DILexicalBlockFile(scope: !1199, file: !600, discriminator: 3)
!1213 = !DILocation(line: 144, column: 9, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1147, file: !600, line: 144, column: 9)
!1215 = !DILocation(line: 144, column: 14, scope: !1214)
!1216 = !DILocation(line: 144, column: 28, scope: !1214)
