; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--x86--vf_framerate_init.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--x86--vf_framerate_init.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.FrameRateContext = type { %struct.AVClass*, %struct.AVRational, i32, double, i32, i32, [4 x i32], i32, %struct.AVRational, %struct.AVRational, void (i8*, i64, i8*, i64, i64, i64, i64*)*, double, i32, i32, %struct.AVFrame*, %struct.AVFrame*, %struct.AVFrame*, i64, i64, i64, double, i32, i64, i64, void (i8*, i64, i8*, i64, i8*, i64, i64, i64, i32, i32, i32)* }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVRational = type { i32, i32 }

!79 = !DIEnumerator(name: "AVCOL_PRI_SMPTEST428_1", value: 10)
!80 = !DIEnumerator(name: "AVCOL_PRI_SMPTE431", value: 11)
!81 = !DIEnumerator(name: "AVCOL_PRI_SMPTE432", value: 12)
!82 = !DIEnumerator(name: "AVCOL_PRI_JEDEC_P22", value: 22)
!83 = !DIEnumerator(name: "AVCOL_PRI_NB", value: 23)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorTransferCharacteristic", file: !60, line: 464, size: 32, align: 32, elements: !85)
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107}
!86 = !DIEnumerator(name: "AVCOL_TRC_RESERVED0", value: 0)
!87 = !DIEnumerator(name: "AVCOL_TRC_BT709", value: 1)
!88 = !DIEnumerator(name: "AVCOL_TRC_UNSPECIFIED", value: 2)
!89 = !DIEnumerator(name: "AVCOL_TRC_RESERVED", value: 3)
!90 = !DIEnumerator(name: "AVCOL_TRC_GAMMA22", value: 4)
!91 = !DIEnumerator(name: "AVCOL_TRC_GAMMA28", value: 5)
!92 = !DIEnumerator(name: "AVCOL_TRC_SMPTE170M", value: 6)
!93 = !DIEnumerator(name: "AVCOL_TRC_SMPTE240M", value: 7)
!94 = !DIEnumerator(name: "AVCOL_TRC_LINEAR", value: 8)
!95 = !DIEnumerator(name: "AVCOL_TRC_LOG", value: 9)
!96 = !DIEnumerator(name: "AVCOL_TRC_LOG_SQRT", value: 10)
!97 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_4", value: 11)
!98 = !DIEnumerator(name: "AVCOL_TRC_BT1361_ECG", value: 12)
!99 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_1", value: 13)
!100 = !DIEnumerator(name: "AVCOL_TRC_BT2020_10", value: 14)
!101 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!102 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!103 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!104 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!105 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!106 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!107 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !60, line: 493, size: 32, align: 32, elements: !109)
!109 = !{!110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126}
!110 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!111 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!112 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!113 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!114 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!115 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!116 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!117 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!118 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!119 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!120 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!121 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!122 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!123 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!124 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!125 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!126 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !60, line: 538, size: 32, align: 32, elements: !128)
!128 = !{!129, !130, !131, !132, !133, !134, !135, !136}
!129 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!130 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!131 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!132 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!133 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!134 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!135 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!136 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!137 = !{i32 2, !"Dwarf Version", i32 4}
!138 = !{i32 2, !"Debug Info Version", i32 3}
!139 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!140 = distinct !DISubprogram(name: "ff_framerate_init_x86", scope: !141, file: !141, line: 28, type: !142, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !346)
!141 = !DIFile(filename: "libavfilter/x86/vf_framerate_init.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!142 = !DISubroutineType(types: !143)
!143 = !{null, !144}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameRateContext", file: !146, line: 69, baseType: !147)
!146 = !DIFile(filename: "./libavfilter/framerate.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FrameRateContext", file: !146, line: 36, size: 1536, align: 64, elements: !148)
!148 = !{!149, !195, !202, !203, !205, !206, !207, !211, !212, !213, !214, !231, !232, !233, !234, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !147, file: !146, line: 37, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !154)
!154 = !{!155, !159, !164, !168, !170, !171, !172, !176, !182, !184, !188}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !153, file: !4, line: 72, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!158 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !153, file: !4, line: 78, baseType: !160, size: 64, align: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!156, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !153, file: !4, line: 85, baseType: !165, size: 64, align: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !153, file: !4, line: 93, baseType: !169, size: 32, align: 32, offset: 192)
!169 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !153, file: !4, line: 99, baseType: !169, size: 32, align: 32, offset: 224)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !153, file: !4, line: 108, baseType: !169, size: 32, align: 32, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !153, file: !4, line: 113, baseType: !173, size: 64, align: 64, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!163, !163, !163}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !153, file: !4, line: 123, baseType: !177, size: 64, align: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!180, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !153, file: !4, line: 130, baseType: !183, size: 32, align: 32, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !153, file: !4, line: 136, baseType: !185, size: 64, align: 64, offset: 512)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!183, !163}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !153, file: !4, line: 142, baseType: !189, size: 64, align: 64, offset: 576)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!169, !192, !163, !156, !169}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "dest_frame_rate", scope: !147, file: !146, line: 39, baseType: !196, size: 64, align: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !197, line: 61, baseType: !198)
!197 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !197, line: 58, size: 64, align: 32, elements: !199)
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !198, file: !197, line: 59, baseType: !169, size: 32, align: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !198, file: !197, line: 60, baseType: !169, size: 32, align: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !147, file: !146, line: 40, baseType: !169, size: 32, align: 32, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "scene_score", scope: !147, file: !146, line: 41, baseType: !204, size: 64, align: 64, offset: 192)
!204 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "interp_start", scope: !147, file: !146, line: 42, baseType: !169, size: 32, align: 32, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "interp_end", scope: !147, file: !146, line: 43, baseType: !169, size: 32, align: 32, offset: 288)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "line_size", scope: !147, file: !146, line: 45, baseType: !208, size: 128, align: 32, offset: 320)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 128, align: 32, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 4)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "vsub", scope: !147, file: !146, line: 46, baseType: !169, size: 32, align: 32, offset: 448)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "srce_time_base", scope: !147, file: !146, line: 48, baseType: !196, size: 64, align: 32, offset: 480)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dest_time_base", scope: !147, file: !146, line: 49, baseType: !196, size: 64, align: 32, offset: 544)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sad", scope: !147, file: !146, line: 51, baseType: !215, size: 64, align: 64, offset: 640)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "ff_scene_sad_fn", file: !216, line: 34, baseType: !217)
!216 = !DIFile(filename: "./libavfilter/scene_sad.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !220, !225, !220, !225, !225, !225, !228}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !223, line: 48, baseType: !224)
!223 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!224 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !226, line: 149, baseType: !227)
!226 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!227 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !223, line: 55, baseType: !230)
!230 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "prev_mafd", scope: !147, file: !146, line: 52, baseType: !204, size: 64, align: 64, offset: 704)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "blend_factor_max", scope: !147, file: !146, line: 54, baseType: !169, size: 32, align: 32, offset: 768)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth", scope: !147, file: !146, line: 55, baseType: !169, size: 32, align: 32, offset: 800)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !147, file: !146, line: 56, baseType: !235, size: 64, align: 64, offset: 832)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !36, line: 646, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !36, line: 268, size: 4288, align: 64, elements: !238)
!238 = !{!239, !244, !246, !248, !249, !250, !251, !252, !253, !254, !255, !257, !258, !259, !260, !261, !262, !263, !265, !266, !267, !268, !269, !270, !271, !272, !285, !287, !288, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !321, !322, !323, !324, !325, !326, !328, !329, !330, !331}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !237, file: !36, line: 282, baseType: !240, size: 512, align: 64)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 512, align: 64, elements: !242)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!242 = !{!243}
!243 = !DISubrange(count: 8)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !237, file: !36, line: 299, baseType: !245, size: 256, align: 32, offset: 512)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 256, align: 32, elements: !242)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !237, file: !36, line: 315, baseType: !247, size: 64, align: 64, offset: 768)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !237, file: !36, line: 326, baseType: !169, size: 32, align: 32, offset: 832)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !237, file: !36, line: 326, baseType: !169, size: 32, align: 32, offset: 864)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !237, file: !36, line: 334, baseType: !169, size: 32, align: 32, offset: 896)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !36, line: 341, baseType: !169, size: 32, align: 32, offset: 928)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !237, file: !36, line: 346, baseType: !169, size: 32, align: 32, offset: 960)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !237, file: !36, line: 351, baseType: !24, size: 32, align: 32, offset: 992)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !237, file: !36, line: 356, baseType: !196, size: 64, align: 32, offset: 1024)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !237, file: !36, line: 361, baseType: !256, size: 64, align: 64, offset: 1088)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !223, line: 40, baseType: !227)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !237, file: !36, line: 369, baseType: !256, size: 64, align: 64, offset: 1152)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !237, file: !36, line: 377, baseType: !256, size: 64, align: 64, offset: 1216)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !237, file: !36, line: 382, baseType: !169, size: 32, align: 32, offset: 1280)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !237, file: !36, line: 386, baseType: !169, size: 32, align: 32, offset: 1312)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !237, file: !36, line: 391, baseType: !169, size: 32, align: 32, offset: 1344)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !237, file: !36, line: 396, baseType: !163, size: 64, align: 64, offset: 1408)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !237, file: !36, line: 403, baseType: !264, size: 512, align: 64, offset: 1472)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 512, align: 64, elements: !242)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !237, file: !36, line: 410, baseType: !169, size: 32, align: 32, offset: 1984)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !237, file: !36, line: 415, baseType: !169, size: 32, align: 32, offset: 2016)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !237, file: !36, line: 420, baseType: !169, size: 32, align: 32, offset: 2048)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !237, file: !36, line: 425, baseType: !169, size: 32, align: 32, offset: 2080)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !237, file: !36, line: 435, baseType: !256, size: 64, align: 64, offset: 2112)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !237, file: !36, line: 440, baseType: !169, size: 32, align: 32, offset: 2176)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !237, file: !36, line: 445, baseType: !229, size: 64, align: 64, offset: 2240)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !36, line: 459, baseType: !273, size: 512, align: 64, offset: 2304)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 512, align: 64, elements: !242)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !276, line: 94, baseType: !277)
!276 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !276, line: 81, size: 192, align: 64, elements: !278)
!278 = !{!279, !283, !284}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !277, file: !276, line: 82, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !276, line: 73, baseType: !282)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !276, line: 73, flags: DIFlagFwdDecl)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !277, file: !276, line: 89, baseType: !241, size: 64, align: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !277, file: !276, line: 93, baseType: !169, size: 32, align: 32, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !237, file: !36, line: 473, baseType: !286, size: 64, align: 64, offset: 2816)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !237, file: !36, line: 477, baseType: !169, size: 32, align: 32, offset: 2880)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !237, file: !36, line: 479, baseType: !289, size: 64, align: 64, offset: 2944)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !36, line: 207, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !36, line: 201, size: 320, align: 64, elements: !293)
!293 = !{!294, !295, !296, !297, !302}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !292, file: !36, line: 202, baseType: !35, size: 32, align: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !292, file: !36, line: 203, baseType: !241, size: 64, align: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !292, file: !36, line: 204, baseType: !169, size: 32, align: 32, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !292, file: !36, line: 205, baseType: !298, size: 64, align: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !300, line: 86, baseType: !301)
!300 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !300, line: 86, flags: DIFlagFwdDecl)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !292, file: !36, line: 206, baseType: !274, size: 64, align: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !237, file: !36, line: 480, baseType: !169, size: 32, align: 32, offset: 3008)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !237, file: !36, line: 505, baseType: !169, size: 32, align: 32, offset: 3040)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !237, file: !36, line: 512, baseType: !59, size: 32, align: 32, offset: 3072)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !237, file: !36, line: 514, baseType: !66, size: 32, align: 32, offset: 3104)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !237, file: !36, line: 516, baseType: !84, size: 32, align: 32, offset: 3136)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !237, file: !36, line: 523, baseType: !108, size: 32, align: 32, offset: 3168)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !237, file: !36, line: 525, baseType: !127, size: 32, align: 32, offset: 3200)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !237, file: !36, line: 532, baseType: !256, size: 64, align: 64, offset: 3264)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !237, file: !36, line: 539, baseType: !256, size: 64, align: 64, offset: 3328)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !237, file: !36, line: 547, baseType: !256, size: 64, align: 64, offset: 3392)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !237, file: !36, line: 554, baseType: !298, size: 64, align: 64, offset: 3456)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !237, file: !36, line: 563, baseType: !169, size: 32, align: 32, offset: 3520)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !237, file: !36, line: 572, baseType: !169, size: 32, align: 32, offset: 3552)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !237, file: !36, line: 581, baseType: !169, size: 32, align: 32, offset: 3584)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !237, file: !36, line: 588, baseType: !318, size: 64, align: 64, offset: 3648)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !223, line: 36, baseType: !320)
!320 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !237, file: !36, line: 593, baseType: !169, size: 32, align: 32, offset: 3712)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !237, file: !36, line: 596, baseType: !169, size: 32, align: 32, offset: 3744)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !237, file: !36, line: 599, baseType: !274, size: 64, align: 64, offset: 3776)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !237, file: !36, line: 605, baseType: !274, size: 64, align: 64, offset: 3840)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !237, file: !36, line: 616, baseType: !274, size: 64, align: 64, offset: 3904)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !237, file: !36, line: 626, baseType: !327, size: 64, align: 64, offset: 3968)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !226, line: 216, baseType: !230)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !237, file: !36, line: 627, baseType: !327, size: 64, align: 64, offset: 4032)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !237, file: !36, line: 628, baseType: !327, size: 64, align: 64, offset: 4096)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !237, file: !36, line: 629, baseType: !327, size: 64, align: 64, offset: 4160)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !237, file: !36, line: 645, baseType: !274, size: 64, align: 64, offset: 4224)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "f0", scope: !147, file: !146, line: 58, baseType: !235, size: 64, align: 64, offset: 896)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !147, file: !146, line: 59, baseType: !235, size: 64, align: 64, offset: 960)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pts0", scope: !147, file: !146, line: 60, baseType: !256, size: 64, align: 64, offset: 1024)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "pts1", scope: !147, file: !146, line: 61, baseType: !256, size: 64, align: 64, offset: 1088)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !147, file: !146, line: 62, baseType: !256, size: 64, align: 64, offset: 1152)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !147, file: !146, line: 63, baseType: !204, size: 64, align: 64, offset: 1216)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !147, file: !146, line: 64, baseType: !169, size: 32, align: 32, offset: 1280)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "start_pts", scope: !147, file: !146, line: 65, baseType: !256, size: 64, align: 64, offset: 1344)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !147, file: !146, line: 66, baseType: !256, size: 64, align: 64, offset: 1408)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "blend", scope: !147, file: !146, line: 68, baseType: !342, size: 64, align: 64, offset: 1472)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "blend_func", file: !146, line: 34, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !220, !225, !220, !225, !241, !225, !225, !225, !169, !169, !169}
!346 = !{}
!347 = !DILocalVariable(name: "s", arg: 1, scope: !140, file: !141, line: 28, type: !144)
!348 = !DIExpression()
!349 = !DILocation(line: 28, column: 46, scope: !140)
!350 = !DILocalVariable(name: "cpu_flags", scope: !140, file: !141, line: 30, type: !169)
!351 = !DILocation(line: 30, column: 9, scope: !140)
!352 = !DILocation(line: 30, column: 21, scope: !140)
!353 = !DILocation(line: 31, column: 9, scope: !354)
!354 = distinct !DILexicalBlock(scope: !140, file: !141, line: 31, column: 9)
!355 = !DILocation(line: 31, column: 12, scope: !354)
!356 = !DILocation(line: 31, column: 21, scope: !354)
!357 = !DILocation(line: 31, column: 9, scope: !140)
!358 = !DILocation(line: 36, column: 5, scope: !359)
!359 = distinct !DILexicalBlock(scope: !354, file: !141, line: 31, column: 27)
!360 = !DILocation(line: 42, column: 1, scope: !140)
