; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--motion_estimation.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--motion_estimation.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVMotionEstContext = type { i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x %struct.AVMotionEstPredictor], i64 (%struct.AVMotionEstContext*, i32, i32, i32, i32)* }
%struct.AVMotionEstPredictor = type { [10 x [2 x i32]], i32 }

@sqr1 = internal constant [8 x [2 x i8]] [[2 x i8] c"\00\FF", [2 x i8] c"\00\01", [2 x i8] c"\FF\00", [2 x i8] c"\01\00", [2 x i8] c"\FF\FF", [2 x i8] c"\FF\01", [2 x i8] c"\01\FF", [2 x i8] c"\01\01"], align 16
@dia1 = internal constant [4 x [2 x i8]] [[2 x i8] c"\FF\00", [2 x i8] c"\00\FF", [2 x i8] c"\01\00", [2 x i8] c"\00\01"], align 1
@dia2 = internal constant [8 x [2 x i8]] [[2 x i8] c"\FE\00", [2 x i8] c"\FF\FF", [2 x i8] c"\00\FE", [2 x i8] c"\01\FF", [2 x i8] c"\02\00", [2 x i8] c"\01\01", [2 x i8] c"\00\02", [2 x i8] c"\FF\01"], align 16
@hex2 = internal constant [6 x [2 x i8]] [[2 x i8] c"\FE\00", [2 x i8] c"\FF\FE", [2 x i8] c"\FF\02", [2 x i8] c"\01\FE", [2 x i8] c"\01\02", [2 x i8] c"\02\00"], align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, globals: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a/[inter]libavfilter--motion_estimation.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!2 = !{}
!3 = !{!4, !14, !18, !19, !23}
!4 = distinct !DIGlobalVariable(name: "sqr1", scope: !0, file: !5, line: 23, type: !6, isLocal: true, isDefinition: true, variable: [8 x [2 x i8]]* @sqr1)
!5 = !DIFile(filename: "libavfilter/motion_estimation.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!6 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, align: 8, elements: !11)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !9, line: 36, baseType: !10)
!9 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!10 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!11 = !{!12, !13}
!12 = !DISubrange(count: 8)
!13 = !DISubrange(count: 2)
!14 = distinct !DIGlobalVariable(name: "dia1", scope: !0, file: !5, line: 24, type: !15, isLocal: true, isDefinition: true, variable: [4 x [2 x i8]]* @dia1)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, align: 8, elements: !16)
!16 = !{!17, !13}
!17 = !DISubrange(count: 4)
!18 = distinct !DIGlobalVariable(name: "dia2", scope: !0, file: !5, line: 25, type: !6, isLocal: true, isDefinition: true, variable: [8 x [2 x i8]]* @dia2)
!19 = distinct !DIGlobalVariable(name: "hex2", scope: !0, file: !5, line: 26, type: !20, isLocal: true, isDefinition: true, variable: [6 x [2 x i8]]* @hex2)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, align: 8, elements: !21)
!21 = !{!22, !13}
!22 = !DISubrange(count: 6)
!23 = distinct !DIGlobalVariable(name: "hex4", scope: !0, file: !5, line: 27, type: !24, isLocal: true, isDefinition: true, variable: [16 x [2 x i8]]* @hex4)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, align: 8, elements: !25)
!25 = !{!26, !13}
!26 = !DISubrange(count: 16)
!27 = !{i32 2, !"Dwarf Version", i32 4}
!28 = !{i32 2, !"Debug Info Version", i32 3}
!29 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!30 = distinct !DISubprogram(name: "ff_me_init_context", scope: !5, file: !5, line: 45, type: !31, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !33, !44, !44, !44, !44, !44, !44, !44, !44}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVMotionEstContext", file: !35, line: 62, baseType: !36)
!35 = !DIFile(filename: "libavfilter/motion_estimation.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavfilter--libavfilter.a")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVMotionEstContext", file: !35, line: 41, size: 1920, align: 64, elements: !37)
!37 = !{!38, !42, !43, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !66}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "data_cur", scope: !36, file: !35, line: 42, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !9, line: 48, baseType: !41)
!41 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "data_ref", scope: !36, file: !35, line: 42, baseType: !39, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !36, file: !35, line: 43, baseType: !44, size: 32, align: 32, offset: 128)
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size", scope: !36, file: !35, line: 45, baseType: !44, size: 32, align: 32, offset: 160)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "search_param", scope: !36, file: !35, line: 46, baseType: !44, size: 32, align: 32, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !36, file: !35, line: 48, baseType: !44, size: 32, align: 32, offset: 224)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !36, file: !35, line: 49, baseType: !44, size: 32, align: 32, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "x_min", scope: !36, file: !35, line: 51, baseType: !44, size: 32, align: 32, offset: 288)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "x_max", scope: !36, file: !35, line: 52, baseType: !44, size: 32, align: 32, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "y_min", scope: !36, file: !35, line: 53, baseType: !44, size: 32, align: 32, offset: 352)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "y_max", scope: !36, file: !35, line: 54, baseType: !44, size: 32, align: 32, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "pred_x", scope: !36, file: !35, line: 56, baseType: !44, size: 32, align: 32, offset: 416)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "pred_y", scope: !36, file: !35, line: 57, baseType: !44, size: 32, align: 32, offset: 448)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !36, file: !35, line: 58, baseType: !56, size: 1344, align: 32, offset: 480)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 1344, align: 32, elements: !65)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVMotionEstPredictor", file: !35, line: 39, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVMotionEstPredictor", file: !35, line: 36, size: 672, align: 32, elements: !59)
!59 = !{!60, !64}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "mvs", scope: !58, file: !35, line: 37, baseType: !61, size: 640, align: 32)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 640, align: 32, elements: !62)
!62 = !{!63, !13}
!63 = !DISubrange(count: 10)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "nb", scope: !58, file: !35, line: 38, baseType: !44, size: 32, align: 32, offset: 640)
!65 = !{!13}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "get_cost", scope: !36, file: !35, line: 60, baseType: !67, size: 64, align: 64, offset: 1856)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!70, !72, !44, !44, !44, !44}
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !9, line: 55, baseType: !71)
!71 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!73 = !DILocalVariable(name: "me_ctx", arg: 1, scope: !30, file: !5, line: 45, type: !33)
!74 = !DIExpression()
!75 = !DILocation(line: 45, column: 45, scope: !30)
!76 = !DILocalVariable(name: "mb_size", arg: 2, scope: !30, file: !5, line: 45, type: !44)
!77 = !DILocation(line: 45, column: 57, scope: !30)
!78 = !DILocalVariable(name: "search_param", arg: 3, scope: !30, file: !5, line: 45, type: !44)
!79 = !DILocation(line: 45, column: 70, scope: !30)
!80 = !DILocalVariable(name: "width", arg: 4, scope: !30, file: !5, line: 46, type: !44)
!81 = !DILocation(line: 46, column: 29, scope: !30)
!82 = !DILocalVariable(name: "height", arg: 5, scope: !30, file: !5, line: 46, type: !44)
!83 = !DILocation(line: 46, column: 40, scope: !30)
!84 = !DILocalVariable(name: "x_min", arg: 6, scope: !30, file: !5, line: 46, type: !44)
!85 = !DILocation(line: 46, column: 52, scope: !30)
!86 = !DILocalVariable(name: "x_max", arg: 7, scope: !30, file: !5, line: 46, type: !44)
!87 = !DILocation(line: 46, column: 63, scope: !30)
!88 = !DILocalVariable(name: "y_min", arg: 8, scope: !30, file: !5, line: 46, type: !44)
!89 = !DILocation(line: 46, column: 74, scope: !30)
!90 = !DILocalVariable(name: "y_max", arg: 9, scope: !30, file: !5, line: 46, type: !44)
!91 = !DILocation(line: 46, column: 85, scope: !30)
!92 = !DILocation(line: 48, column: 21, scope: !30)
!93 = !DILocation(line: 48, column: 5, scope: !30)
!94 = !DILocation(line: 48, column: 13, scope: !30)
!95 = !DILocation(line: 48, column: 19, scope: !30)
!96 = !DILocation(line: 49, column: 22, scope: !30)
!97 = !DILocation(line: 49, column: 5, scope: !30)
!98 = !DILocation(line: 49, column: 13, scope: !30)
!99 = !DILocation(line: 49, column: 20, scope: !30)
!100 = !DILocation(line: 50, column: 23, scope: !30)
!101 = !DILocation(line: 50, column: 5, scope: !30)
!102 = !DILocation(line: 50, column: 13, scope: !30)
!103 = !DILocation(line: 50, column: 21, scope: !30)
!104 = !DILocation(line: 51, column: 28, scope: !30)
!105 = !DILocation(line: 51, column: 5, scope: !30)
!106 = !DILocation(line: 51, column: 13, scope: !30)
!107 = !DILocation(line: 51, column: 26, scope: !30)
!108 = !DILocation(line: 52, column: 5, scope: !30)
!109 = !DILocation(line: 52, column: 13, scope: !30)
!110 = !DILocation(line: 52, column: 22, scope: !30)
!111 = !DILocation(line: 53, column: 21, scope: !30)
!112 = !DILocation(line: 53, column: 5, scope: !30)
!113 = !DILocation(line: 53, column: 13, scope: !30)
!114 = !DILocation(line: 53, column: 19, scope: !30)
!115 = !DILocation(line: 54, column: 21, scope: !30)
!116 = !DILocation(line: 54, column: 5, scope: !30)
!117 = !DILocation(line: 54, column: 13, scope: !30)
!118 = !DILocation(line: 54, column: 19, scope: !30)
!119 = !DILocation(line: 55, column: 21, scope: !30)
!120 = !DILocation(line: 55, column: 5, scope: !30)
!121 = !DILocation(line: 55, column: 13, scope: !30)
!122 = !DILocation(line: 55, column: 19, scope: !30)
!123 = !DILocation(line: 56, column: 21, scope: !30)
!124 = !DILocation(line: 56, column: 5, scope: !30)
!125 = !DILocation(line: 56, column: 13, scope: !30)
!126 = !DILocation(line: 56, column: 19, scope: !30)
!127 = !DILocation(line: 57, column: 1, scope: !30)
!128 = distinct !DISubprogram(name: "ff_me_cmp_sad", scope: !5, file: !5, line: 59, type: !129, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!129 = !DISubroutineType(types: !130)
