; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--modes--libcrypto-shlib-gcm128.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--modes--libcrypto-shlib-gcm128.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.anon.0 = type { i64 }
%union.anon.1 = type { i64 }
%union.anon.2 = type { i64 }
%union.anon.3 = type { i64 }
%union.anon.4 = type { i64 }
%union.anon.5 = type { i64 }
%union.anon.6 = type { i64 }
%struct.gcm128_context = type { %union.anon, %union.anon, %union.anon, %union.anon, %union.anon, %union.anon, [16 x %struct.u128], void (i64*, %struct.u128*)*, void (i64*, %struct.u128*, i8*, i64)*, i32, i32, void (i8*, i8*, i8*)*, i8*, [48 x i8] }
%union.anon = type { [2 x i64] }
%struct.u128 = type { i64, i64 }

@CRYPTO_gcm128_init.is_endian = internal constant %union.anon.0 { i64 1 }, align 8
@OPENSSL_ia32cap_P = external global [0 x i32], align 4
@CRYPTO_gcm128_setiv.is_endian = internal constant %union.anon.1 { i64 1 }, align 8
@CRYPTO_gcm128_encrypt.is_endian = internal constant %union.anon.2 { i64 1 }, align 8
@CRYPTO_gcm128_decrypt.is_endian = internal constant %union.anon.3 { i64 1 }, align 8
@CRYPTO_gcm128_encrypt_ctr32.is_endian = internal constant %union.anon.4 { i64 1 }, align 8
@CRYPTO_gcm128_decrypt_ctr32.is_endian = internal constant %union.anon.5 { i64 1 }, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !12)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--modes--libcrypto-shlib-gcm128.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{}
!3 = !{!4, !7, !8, !9, !11}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !5, line: 216, baseType: !6)
!5 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!6 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!7 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !{!13, !95, !104, !114, !121, !134, !141}
!13 = distinct !DIGlobalVariable(name: "is_endian", scope: !14, file: !15, line: 718, type: !88, isLocal: true, isDefinition: true, variable: %union.anon.0* @CRYPTO_gcm128_init.is_endian)
!14 = distinct !DISubprogram(name: "CRYPTO_gcm128_init", scope: !15, file: !15, line: 713, type: !16, isLocal: false, isDefinition: true, scopeLine: 714, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!15 = !DIFile(filename: "crypto/modes/gcm128.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!16 = !DISubroutineType(types: !17)
!17 = !{null, !18, !11, !74}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCM128_CONTEXT", file: !20, line: 104, baseType: !21)
!20 = !DIFile(filename: "include/openssl/modes.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gcm128_context", file: !22, line: 108, size: 3520, align: 64, elements: !23)
!22 = !DIFile(filename: "crypto/modes/modes_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!23 = !{!24, !46, !47, !48, !49, !50, !51, !58, !65, !71, !72, !73, !83, !84}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "Yi", scope: !21, file: !22, line: 115, baseType: !25, size: 128, align: 64)
!25 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !21, file: !22, line: 110, size: 128, align: 64, elements: !26)
!26 = !{!27, !33, !38, !44}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !25, file: !22, line: 111, baseType: !28, size: 128, align: 64)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 128, align: 64, elements: !31)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !22, line: 22, baseType: !30)
!30 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!31 = !{!32}
!32 = !DISubrange(count: 2)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !25, file: !22, line: 112, baseType: !34, size: 128, align: 32)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 128, align: 32, elements: !36)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !22, line: 26, baseType: !7)
!36 = !{!37}
!37 = !DISubrange(count: 4)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !25, file: !22, line: 113, baseType: !39, size: 128, align: 8)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 128, align: 8, elements: !42)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !22, line: 27, baseType: !41)
!41 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!42 = !{!43}
!43 = !DISubrange(count: 16)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !25, file: !22, line: 114, baseType: !45, size: 128, align: 64)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, align: 64, elements: !31)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "EKi", scope: !21, file: !22, line: 115, baseType: !25, size: 128, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "EK0", scope: !21, file: !22, line: 115, baseType: !25, size: 128, align: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !21, file: !22, line: 115, baseType: !25, size: 128, align: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Xi", scope: !21, file: !22, line: 115, baseType: !25, size: 128, align: 64, offset: 512)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "H", scope: !21, file: !22, line: 115, baseType: !25, size: 128, align: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "Htable", scope: !21, file: !22, line: 123, baseType: !52, size: 2048, align: 64, offset: 768)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 2048, align: 64, elements: !42)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "u128", file: !22, line: 97, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 95, size: 128, align: 64, elements: !55)
!55 = !{!56, !57}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "hi", scope: !54, file: !22, line: 96, baseType: !29, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "lo", scope: !54, file: !22, line: 96, baseType: !29, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "gmult", scope: !21, file: !22, line: 124, baseType: !59, size: 64, align: 64, offset: 2816)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !62, !63}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !21, file: !22, line: 125, baseType: !66, size: 64, align: 64, offset: 2880)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !62, !63, !69, !4}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "mres", scope: !21, file: !22, line: 128, baseType: !7, size: 32, align: 32, offset: 2944)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ares", scope: !21, file: !22, line: 128, baseType: !7, size: 32, align: 32, offset: 2976)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !21, file: !22, line: 129, baseType: !74, size: 64, align: 64, offset: 3008)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "block128_f", file: !20, line: 19, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !78, !80, !81}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !21, file: !22, line: 130, baseType: !11, size: 64, align: 64, offset: 3072)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "Xn", scope: !21, file: !22, line: 132, baseType: !85, size: 384, align: 8, offset: 3136)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 384, align: 8, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 48)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !15, line: 715, size: 64, align: 64, elements: !90)
!90 = !{!91, !93}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "one", scope: !89, file: !15, line: 716, baseType: !92, size: 64, align: 64)
!92 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "little", scope: !89, file: !15, line: 717, baseType: !94, size: 8, align: 8)
!94 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!95 = distinct !DIGlobalVariable(name: "is_endian", scope: !96, file: !15, line: 833, type: !99, isLocal: true, isDefinition: true, variable: %union.anon.1* @CRYPTO_gcm128_setiv.is_endian)
!96 = distinct !DISubprogram(name: "CRYPTO_gcm128_setiv", scope: !15, file: !15, line: 827, type: !97, isLocal: false, isDefinition: true, scopeLine: 829, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !18, !78, !4}
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !96, file: !15, line: 830, size: 64, align: 64, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "one", scope: !100, file: !15, line: 831, baseType: !92, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "little", scope: !100, file: !15, line: 832, baseType: !94, size: 8, align: 8)
!104 = distinct !DIGlobalVariable(name: "is_endian", scope: !105, file: !15, line: 988, type: !109, isLocal: true, isDefinition: true, variable: %union.anon.2* @CRYPTO_gcm128_encrypt.is_endian)
!105 = distinct !DISubprogram(name: "CRYPTO_gcm128_encrypt", scope: !15, file: !15, line: 981, type: !106, isLocal: false, isDefinition: true, scopeLine: 984, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!106 = !DISubroutineType(types: !107)
!107 = !{!108, !18, !78, !80, !4}
!108 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !105, file: !15, line: 985, size: 64, align: 64, elements: !111)
!111 = !{!112, !113}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "one", scope: !110, file: !15, line: 986, baseType: !92, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "little", scope: !110, file: !15, line: 987, baseType: !94, size: 8, align: 8)
!114 = distinct !DIGlobalVariable(name: "is_endian", scope: !115, file: !15, line: 1223, type: !116, isLocal: true, isDefinition: true, variable: %union.anon.3* @CRYPTO_gcm128_decrypt.is_endian)
!115 = distinct !DISubprogram(name: "CRYPTO_gcm128_decrypt", scope: !15, file: !15, line: 1216, type: !106, isLocal: false, isDefinition: true, scopeLine: 1219, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !115, file: !15, line: 1220, size: 64, align: 64, elements: !118)
!118 = !{!119, !120}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "one", scope: !117, file: !15, line: 1221, baseType: !92, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "little", scope: !117, file: !15, line: 1222, baseType: !94, size: 8, align: 8)
!121 = distinct !DIGlobalVariable(name: "is_endian", scope: !122, file: !15, line: 1469, type: !129, isLocal: true, isDefinition: true, variable: %union.anon.4* @CRYPTO_gcm128_encrypt_ctr32.is_endian)
