; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--cms--libcrypto-shlib-cms_smime.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--cms--libcrypto-shlib-cms_smime.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CMS_ContentInfo_st = type { %struct.asn1_object_st*, %union.anon }
%struct.asn1_object_st = type { i8*, i8*, i32, i32, i8*, i32 }
%union.anon = type { %struct.asn1_string_st* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.bio_st = type opaque
%struct.evp_md_st = type opaque
%struct.evp_cipher_st = type opaque
%struct.stack_st_X509 = type opaque
%struct.x509_store_st = type opaque
%struct.CMS_SignerInfo_st = type { i32, %struct.CMS_SignerIdentifier_st*, %struct.X509_algor_st*, %struct.stack_st_X509_ATTRIBUTE*, %struct.X509_algor_st*, %struct.asn1_string_st*, %struct.stack_st_X509_ATTRIBUTE*, %struct.x509_st*, %struct.evp_pkey_st*, %struct.evp_md_ctx_st*, %struct.evp_pkey_ctx_st* }
%struct.CMS_SignerIdentifier_st = type { i32, %union.anon.1 }
%union.anon.1 = type { %struct.CMS_IssuerAndSerialNumber_st* }
%struct.CMS_IssuerAndSerialNumber_st = type { %struct.X509_name_st*, %struct.asn1_string_st* }
%struct.X509_name_st = type opaque
%struct.X509_algor_st = type { %struct.asn1_object_st*, %struct.asn1_type_st* }
%struct.asn1_type_st = type { i32, %union.anon.0 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--cms--libcrypto-shlib-cms_smime.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{}
!3 = !{!4, !5, !7, !8, !13, !161, !162, !146, !166, !267}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !11, line: 17, baseType: !12)
!11 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !11, line: 17, flags: DIFlagFwdDecl)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_SignerInfo", file: !15, line: 25, baseType: !16)
!15 = !DIFile(filename: "include/openssl/cms.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_SignerInfo_st", file: !17, line: 81, size: 704, align: 64, elements: !18)
!17 = !DIFile(filename: "crypto/cms/cms_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!18 = !{!19, !22, !57, !139, !142, !143, !144, !145, !149, !153, !157}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !16, file: !17, line: 82, baseType: !20, size: 32, align: 32)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !21, line: 196, baseType: !7)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!22 = !DIDerivedType(tag: DW_TAG_member, name: "sid", scope: !16, file: !17, line: 83, baseType: !23, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_SignerIdentifier", file: !17, line: 23, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_SignerIdentifier_st", file: !17, line: 97, size: 128, align: 64, elements: !26)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !25, file: !17, line: 98, baseType: !7, size: 32, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !25, file: !17, line: 102, baseType: !29, size: 64, align: 64, offset: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !25, file: !17, line: 99, size: 64, align: 64, elements: !30)
!30 = !{!31, !54}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "issuerAndSerialNumber", scope: !29, file: !17, line: 100, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_IssuerAndSerialNumber", file: !17, line: 21, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_IssuerAndSerialNumber_st", file: !17, line: 308, size: 128, align: 64, elements: !35)
!35 = !{!36, !41}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !34, file: !17, line: 309, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !39, line: 129, baseType: !40)
!39 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !39, line: 129, flags: DIFlagFwdDecl)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "serialNumber", scope: !34, file: !17, line: 310, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !39, line: 40, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !45, line: 146, size: 192, align: 64, elements: !46)
!45 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!46 = !{!47, !48, !49, !52}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !44, file: !45, line: 147, baseType: !7, size: 32, align: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !44, file: !45, line: 148, baseType: !7, size: 32, align: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !44, file: !45, line: 149, baseType: !50, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !44, file: !45, line: 155, baseType: !53, size: 64, align: 64, offset: 128)
!53 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "subjectKeyIdentifier", scope: !29, file: !17, line: 101, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !39, line: 43, baseType: !44)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "digestAlgorithm", scope: !16, file: !17, line: 84, baseType: !58, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !39, line: 125, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !61, line: 59, size: 128, align: 64, elements: !62)
!61 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!62 = !{!63, !79}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !60, file: !61, line: 60, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !39, line: 60, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !67, line: 95, size: 320, align: 64, elements: !68)
!67 = !DIFile(filename: "crypto/include/internal/asn1_int.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!68 = !{!69, !72, !73, !74, !75, !78}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "sn", scope: !66, file: !67, line: 96, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ln", scope: !66, file: !67, line: 96, baseType: !70, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "nid", scope: !66, file: !67, line: 97, baseType: !7, size: 32, align: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !66, file: !67, line: 98, baseType: !7, size: 32, align: 32, offset: 160)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !66, file: !67, line: 99, baseType: !76, size: 64, align: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !66, file: !67, line: 100, baseType: !7, size: 32, align: 32, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !60, file: !61, line: 61, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !45, line: 473, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !45, line: 444, size: 128, align: 64, elements: !83)
!83 = !{!84, !85}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !45, line: 445, baseType: !7, size: 32, align: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !82, file: !45, line: 472, baseType: !86, size: 64, align: 64, offset: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !82, file: !45, line: 446, size: 64, align: 64, elements: !87)
!87 = !{!88, !89, !91, !94, !95, !96, !99, !102, !103, !106, !109, !112, !115, !118, !121, !124, !127, !130, !133, !134, !135}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !86, file: !45, line: 447, baseType: !5, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !86, file: !45, line: 448, baseType: !90, size: 32, align: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !39, line: 56, baseType: !7)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !86, file: !45, line: 449, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !39, line: 55, baseType: !44)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !86, file: !45, line: 450, baseType: !64, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !86, file: !45, line: 451, baseType: !42, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !86, file: !45, line: 452, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !39, line: 41, baseType: !44)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !86, file: !45, line: 453, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !39, line: 42, baseType: !44)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !86, file: !45, line: 454, baseType: !55, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !86, file: !45, line: 455, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !39, line: 44, baseType: !44)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !86, file: !45, line: 456, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !39, line: 45, baseType: !44)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !86, file: !45, line: 457, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !39, line: 46, baseType: !44)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !86, file: !45, line: 458, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !39, line: 47, baseType: !44)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !86, file: !45, line: 459, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !39, line: 49, baseType: !44)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !86, file: !45, line: 460, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !39, line: 48, baseType: !44)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !86, file: !45, line: 461, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !39, line: 50, baseType: !44)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !86, file: !45, line: 462, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !39, line: 52, baseType: !44)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !86, file: !45, line: 463, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !39, line: 53, baseType: !44)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !86, file: !45, line: 464, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !39, line: 54, baseType: !44)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !86, file: !45, line: 469, baseType: !92, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !86, file: !45, line: 470, baseType: !92, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !86, file: !45, line: 471, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !45, line: 213, baseType: !138)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !45, line: 213, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "signedAttrs", scope: !16, file: !17, line: 85, baseType: !140, size: 64, align: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ATTRIBUTE", file: !61, line: 89, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "signatureAlgorithm", scope: !16, file: !17, line: 86, baseType: !58, size: 64, align: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !16, file: !17, line: 87, baseType: !55, size: 64, align: 64, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "unsignedAttrs", scope: !16, file: !17, line: 88, baseType: !140, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "signer", scope: !16, file: !17, line: 90, baseType: !146, size: 64, align: 64, offset: 448)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !39, line: 124, baseType: !148)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !39, line: 124, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "pkey", scope: !16, file: !17, line: 91, baseType: !150, size: 64, align: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY", file: !39, line: 95, baseType: !152)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_st", file: !39, line: 95, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !16, file: !17, line: 93, baseType: !154, size: 64, align: 64, offset: 576)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_MD_CTX", file: !39, line: 92, baseType: !156)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_md_ctx_st", file: !39, line: 92, flags: DIFlagFwdDecl)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "pctx", scope: !16, file: !17, line: 94, baseType: !158, size: 64, align: 64, offset: 640)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY_CTX", file: !39, line: 100, baseType: !160)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_ctx_st", file: !39, line: 100, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !11, line: 20, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !4}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_RecipientInfo", file: !15, line: 28, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_RecipientInfo_st", file: !17, line: 130, size: 128, align: 64, elements: !169)
!169 = !{!170, !171}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !168, file: !17, line: 131, baseType: !7, size: 32, align: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !168, file: !17, line: 138, baseType: !172, size: 64, align: 64, offset: 64)
!172 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !168, file: !17, line: 132, size: 64, align: 64, elements: !173)
!173 = !{!174, !188, !222, !249, !260}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ktri", scope: !172, file: !17, line: 133, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_KeyTransRecipientInfo", file: !17, line: 34, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_KeyTransRecipientInfo_st", file: !17, line: 143, size: 448, align: 64, elements: !178)
!178 = !{!179, !180, !183, !184, !185, !186, !187}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !177, file: !17, line: 144, baseType: !20, size: 32, align: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "rid", scope: !177, file: !17, line: 145, baseType: !181, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_RecipientIdentifier", file: !17, line: 141, baseType: !24)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "keyEncryptionAlgorithm", scope: !177, file: !17, line: 146, baseType: !58, size: 64, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "encryptedKey", scope: !177, file: !17, line: 147, baseType: !55, size: 64, align: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "recip", scope: !177, file: !17, line: 149, baseType: !146, size: 64, align: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pkey", scope: !177, file: !17, line: 150, baseType: !150, size: 64, align: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pctx", scope: !177, file: !17, line: 152, baseType: !158, size: 64, align: 64, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "kari", scope: !172, file: !17, line: 134, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_KeyAgreeRecipientInfo", file: !17, line: 37, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_KeyAgreeRecipientInfo_st", file: !17, line: 155, size: 448, align: 64, elements: !192)
!192 = !{!193, !194, !212, !213, !214, !217, !218}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !191, file: !17, line: 156, baseType: !20, size: 32, align: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "originator", scope: !191, file: !17, line: 157, baseType: !195, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_OriginatorIdentifierOrKey", file: !17, line: 36, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_OriginatorIdentifierOrKey_st", file: !17, line: 167, size: 128, align: 64, elements: !198)
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !197, file: !17, line: 168, baseType: !7, size: 32, align: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !197, file: !17, line: 173, baseType: !201, size: 64, align: 64, offset: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !197, file: !17, line: 169, size: 64, align: 64, elements: !202)
!202 = !{!203, !204, !205}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "issuerAndSerialNumber", scope: !201, file: !17, line: 170, baseType: !32, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "subjectKeyIdentifier", scope: !201, file: !17, line: 171, baseType: !55, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "originatorKey", scope: !201, file: !17, line: 172, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_OriginatorPublicKey", file: !17, line: 35, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_OriginatorPublicKey_st", file: !17, line: 176, size: 128, align: 64, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !208, file: !17, line: 177, baseType: !58, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "publicKey", scope: !208, file: !17, line: 178, baseType: !100, size: 64, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ukm", scope: !191, file: !17, line: 158, baseType: !55, size: 64, align: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "keyEncryptionAlgorithm", scope: !191, file: !17, line: 159, baseType: !58, size: 64, align: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "recipientEncryptedKeys", scope: !191, file: !17, line: 160, baseType: !215, size: 64, align: 64, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CMS_RecipientEncryptedKey", file: !15, line: 35, flags: DIFlagFwdDecl)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pctx", scope: !191, file: !17, line: 162, baseType: !158, size: 64, align: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !191, file: !17, line: 164, baseType: !219, size: 64, align: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER_CTX", file: !39, line: 90, baseType: !221)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_ctx_st", file: !39, line: 90, flags: DIFlagFwdDecl)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "kekri", scope: !172, file: !17, line: 135, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_KEKRecipientInfo", file: !17, line: 42, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_KEKRecipientInfo_st", file: !17, line: 202, size: 384, align: 64, elements: !226)
!226 = !{!227, !228, !242, !243, !244, !245}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !225, file: !17, line: 203, baseType: !20, size: 32, align: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "kekid", scope: !225, file: !17, line: 204, baseType: !229, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_KEKIdentifier", file: !17, line: 41, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_KEKIdentifier_st", file: !17, line: 212, size: 192, align: 64, elements: !232)
!232 = !{!233, !234, !235}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "keyIdentifier", scope: !231, file: !17, line: 213, baseType: !55, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !231, file: !17, line: 214, baseType: !125, size: 64, align: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !231, file: !17, line: 215, baseType: !236, size: 64, align: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_OtherKeyAttribute", file: !15, line: 32, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_OtherKeyAttribute_st", file: !17, line: 313, size: 128, align: 64, elements: !239)
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "keyAttrId", scope: !238, file: !17, line: 314, baseType: !64, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "keyAttr", scope: !238, file: !17, line: 315, baseType: !80, size: 64, align: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "keyEncryptionAlgorithm", scope: !225, file: !17, line: 205, baseType: !58, size: 64, align: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "encryptedKey", scope: !225, file: !17, line: 206, baseType: !55, size: 64, align: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !225, file: !17, line: 208, baseType: !50, size: 64, align: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !225, file: !17, line: 209, baseType: !246, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !247, line: 216, baseType: !248)
!247 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!248 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pwri", scope: !172, file: !17, line: 136, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_PasswordRecipientInfo", file: !17, line: 43, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_PasswordRecipientInfo_st", file: !17, line: 218, size: 384, align: 64, elements: !253)
!253 = !{!254, !255, !256, !257, !258, !259}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !252, file: !17, line: 219, baseType: !20, size: 32, align: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "keyDerivationAlgorithm", scope: !252, file: !17, line: 220, baseType: !58, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "keyEncryptionAlgorithm", scope: !252, file: !17, line: 221, baseType: !58, size: 64, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "encryptedKey", scope: !252, file: !17, line: 222, baseType: !55, size: 64, align: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !252, file: !17, line: 224, baseType: !50, size: 64, align: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "passlen", scope: !252, file: !17, line: 225, baseType: !246, size: 64, align: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ori", scope: !172, file: !17, line: 137, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_OtherRecipientInfo", file: !17, line: 44, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_OtherRecipientInfo_st", file: !17, line: 228, size: 128, align: 64, elements: !264)
!264 = !{!265, !266}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "oriType", scope: !263, file: !17, line: 229, baseType: !64, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "oriValue", scope: !263, file: !17, line: 230, baseType: !80, size: 64, align: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_RecipientEncryptedKey", file: !15, line: 31, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_RecipientEncryptedKey_st", file: !17, line: 181, size: 192, align: 64, elements: !270)
!270 = !{!271, !289, !290}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "rid", scope: !269, file: !17, line: 182, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_KeyAgreeRecipientIdentifier", file: !17, line: 40, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_KeyAgreeRecipientIdentifier_st", file: !17, line: 188, size: 128, align: 64, elements: !275)
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !274, file: !17, line: 189, baseType: !7, size: 32, align: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !274, file: !17, line: 193, baseType: !278, size: 64, align: 64, offset: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !274, file: !17, line: 190, size: 64, align: 64, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "issuerAndSerialNumber", scope: !278, file: !17, line: 191, baseType: !32, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "rKeyId", scope: !278, file: !17, line: 192, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_RecipientKeyIdentifier", file: !17, line: 38, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_RecipientKeyIdentifier_st", file: !17, line: 196, size: 192, align: 64, elements: !285)
!285 = !{!286, !287, !288}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "subjectKeyIdentifier", scope: !284, file: !17, line: 197, baseType: !55, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !284, file: !17, line: 198, baseType: !125, size: 64, align: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !284, file: !17, line: 199, baseType: !236, size: 64, align: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "encryptedKey", scope: !269, file: !17, line: 183, baseType: !55, size: 64, align: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pkey", scope: !269, file: !17, line: 185, baseType: !150, size: 64, align: 64, offset: 128)
!291 = !{i32 2, !"Dwarf Version", i32 4}
!292 = !{i32 2, !"Debug Info Version", i32 3}
!293 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!294 = distinct !DISubprogram(name: "CMS_data", scope: !295, file: !295, line: 102, type: !296, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!295 = !DIFile(filename: "crypto/cms/cms_smime.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!296 = !DISubroutineType(types: !297)
!297 = !{!7, !298, !408, !411}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_ContentInfo", file: !15, line: 24, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_ContentInfo_st", file: !17, line: 47, size: 128, align: 64, elements: !301)
!301 = !{!302, !303}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "contentType", scope: !300, file: !17, line: 48, baseType: !64, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !300, file: !17, line: 60, baseType: !304, size: 64, align: 64, offset: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !300, file: !17, line: 49, size: 64, align: 64, elements: !305)
!305 = !{!306, !307, !333, !366, !375, !383, !397, !406, !407}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !304, file: !17, line: 50, baseType: !55, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "signedData", scope: !304, file: !17, line: 51, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_SignedData", file: !17, line: 24, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_SignedData_st", file: !17, line: 65, size: 384, align: 64, elements: !311)
!311 = !{!312, !313, !316, !324, !327, !330}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !310, file: !17, line: 66, baseType: !20, size: 32, align: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "digestAlgorithms", scope: !310, file: !17, line: 67, baseType: !314, size: 64, align: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ALGOR", file: !45, line: 119, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "encapContentInfo", scope: !310, file: !17, line: 68, baseType: !317, size: 64, align: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_EncapsulatedContentInfo", file: !17, line: 22, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_EncapsulatedContentInfo_st", file: !17, line: 74, size: 192, align: 64, elements: !320)
!320 = !{!321, !322, !323}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "eContentType", scope: !319, file: !17, line: 75, baseType: !64, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "eContent", scope: !319, file: !17, line: 76, baseType: !55, size: 64, align: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "partial", scope: !319, file: !17, line: 78, baseType: !7, size: 32, align: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "certificates", scope: !310, file: !17, line: 69, baseType: !325, size: 64, align: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CMS_CertificateChoices", file: !17, line: 63, flags: DIFlagFwdDecl)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "crls", scope: !310, file: !17, line: 70, baseType: !328, size: 64, align: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CMS_RevocationInfoChoice", file: !15, line: 37, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "signerInfos", scope: !310, file: !17, line: 71, baseType: !331, size: 64, align: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CMS_SignerInfo", file: !15, line: 34, flags: DIFlagFwdDecl)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "envelopedData", scope: !304, file: !17, line: 52, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_EnvelopedData", file: !17, line: 28, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_EnvelopedData_st", file: !17, line: 105, size: 320, align: 64, elements: !337)
!337 = !{!338, !339, !346, !349, !365}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !336, file: !17, line: 106, baseType: !20, size: 32, align: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "originatorInfo", scope: !336, file: !17, line: 107, baseType: !340, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_OriginatorInfo", file: !17, line: 26, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_OriginatorInfo_st", file: !17, line: 113, size: 128, align: 64, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "certificates", scope: !342, file: !17, line: 114, baseType: !325, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "crls", scope: !342, file: !17, line: 115, baseType: !328, size: 64, align: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "recipientInfos", scope: !336, file: !17, line: 108, baseType: !347, size: 64, align: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CMS_RecipientInfo", file: !15, line: 36, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "encryptedContentInfo", scope: !336, file: !17, line: 109, baseType: !350, size: 64, align: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_EncryptedContentInfo", file: !17, line: 27, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_EncryptedContentInfo_st", file: !17, line: 118, size: 448, align: 64, elements: !353)
!353 = !{!354, !355, !356, !357, !362, !363, !364}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "contentType", scope: !352, file: !17, line: 119, baseType: !64, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "contentEncryptionAlgorithm", scope: !352, file: !17, line: 120, baseType: !58, size: 64, align: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "encryptedContent", scope: !352, file: !17, line: 121, baseType: !55, size: 64, align: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !352, file: !17, line: 123, baseType: !358, size: 64, align: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !39, line: 89, baseType: !361)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !39, line: 89, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !352, file: !17, line: 124, baseType: !50, size: 64, align: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !352, file: !17, line: 125, baseType: !246, size: 64, align: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !352, file: !17, line: 127, baseType: !7, size: 32, align: 32, offset: 384)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "unprotectedAttrs", scope: !336, file: !17, line: 110, baseType: !140, size: 64, align: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "digestedData", scope: !304, file: !17, line: 53, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_DigestedData", file: !17, line: 29, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_DigestedData_st", file: !17, line: 233, size: 256, align: 64, elements: !370)
!370 = !{!371, !372, !373, !374}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !369, file: !17, line: 234, baseType: !20, size: 32, align: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "digestAlgorithm", scope: !369, file: !17, line: 235, baseType: !58, size: 64, align: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "encapContentInfo", scope: !369, file: !17, line: 236, baseType: !317, size: 64, align: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !369, file: !17, line: 237, baseType: !55, size: 64, align: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "encryptedData", scope: !304, file: !17, line: 54, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_EncryptedData", file: !17, line: 30, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_EncryptedData_st", file: !17, line: 240, size: 192, align: 64, elements: !379)
!379 = !{!380, !381, !382}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !378, file: !17, line: 241, baseType: !20, size: 32, align: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "encryptedContentInfo", scope: !378, file: !17, line: 242, baseType: !350, size: 64, align: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "unprotectedAttrs", scope: !378, file: !17, line: 243, baseType: !140, size: 64, align: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "authenticatedData", scope: !304, file: !17, line: 55, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_AuthenticatedData", file: !17, line: 31, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_AuthenticatedData_st", file: !17, line: 246, size: 576, align: 64, elements: !387)
!387 = !{!388, !389, !390, !391, !392, !393, !394, !395, !396}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !386, file: !17, line: 247, baseType: !20, size: 32, align: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "originatorInfo", scope: !386, file: !17, line: 248, baseType: !340, size: 64, align: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "recipientInfos", scope: !386, file: !17, line: 249, baseType: !347, size: 64, align: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "macAlgorithm", scope: !386, file: !17, line: 250, baseType: !58, size: 64, align: 64, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "digestAlgorithm", scope: !386, file: !17, line: 251, baseType: !58, size: 64, align: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "encapContentInfo", scope: !386, file: !17, line: 252, baseType: !317, size: 64, align: 64, offset: 320)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "authAttrs", scope: !386, file: !17, line: 253, baseType: !140, size: 64, align: 64, offset: 384)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !386, file: !17, line: 254, baseType: !55, size: 64, align: 64, offset: 448)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "unauthAttrs", scope: !386, file: !17, line: 255, baseType: !140, size: 64, align: 64, offset: 512)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "compressedData", scope: !304, file: !17, line: 56, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_CompressedData", file: !17, line: 32, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_CompressedData_st", file: !17, line: 258, size: 256, align: 64, elements: !401)
!401 = !{!402, !403, !404, !405}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !400, file: !17, line: 259, baseType: !20, size: 32, align: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "compressionAlgorithm", scope: !400, file: !17, line: 260, baseType: !58, size: 64, align: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "recipientInfos", scope: !400, file: !17, line: 261, baseType: !347, size: 64, align: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "encapContentInfo", scope: !400, file: !17, line: 262, baseType: !317, size: 64, align: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !304, file: !17, line: 57, baseType: !80, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "otherData", scope: !304, file: !17, line: 59, baseType: !4, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !39, line: 79, baseType: !410)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !39, line: 79, flags: DIFlagFwdDecl)
!411 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!412 = !DILocalVariable(name: "cms", arg: 1, scope: !294, file: !295, line: 102, type: !298)
!413 = !DIExpression()
!414 = !DILocation(line: 102, column: 31, scope: !294)
!415 = !DILocalVariable(name: "out", arg: 2, scope: !294, file: !295, line: 102, type: !408)
!416 = !DILocation(line: 102, column: 41, scope: !294)
!417 = !DILocalVariable(name: "flags", arg: 3, scope: !294, file: !295, line: 102, type: !411)
!418 = !DILocation(line: 102, column: 59, scope: !294)
!419 = !DILocalVariable(name: "cont", scope: !294, file: !295, line: 104, type: !408)
!420 = !DILocation(line: 104, column: 10, scope: !294)
!421 = !DILocalVariable(name: "r", scope: !294, file: !295, line: 105, type: !7)
!422 = !DILocation(line: 105, column: 9, scope: !294)
!423 = !DILocation(line: 106, column: 35, scope: !424)
!424 = distinct !DILexicalBlock(scope: !294, file: !295, line: 106, column: 9)
!425 = !DILocation(line: 106, column: 21, scope: !424)
!426 = !DILocation(line: 106, column: 9, scope: !427)
!427 = !DILexicalBlockFile(scope: !424, file: !295, discriminator: 1)
!428 = !DILocation(line: 106, column: 41, scope: !424)
!429 = !DILocation(line: 106, column: 9, scope: !294)
!430 = !DILocation(line: 107, column: 9, scope: !431)
!431 = distinct !DILexicalBlock(scope: !424, file: !295, line: 106, column: 48)
!432 = !DILocation(line: 108, column: 9, scope: !431)
!433 = !DILocation(line: 110, column: 25, scope: !294)
!434 = !DILocation(line: 110, column: 12, scope: !294)
!435 = !DILocation(line: 110, column: 10, scope: !294)
!436 = !DILocation(line: 111, column: 10, scope: !437)
!437 = distinct !DILexicalBlock(scope: !294, file: !295, line: 111, column: 9)
!438 = !DILocation(line: 111, column: 9, scope: !294)
!439 = !DILocation(line: 112, column: 9, scope: !437)
!440 = !DILocation(line: 113, column: 26, scope: !294)
!441 = !DILocation(line: 113, column: 31, scope: !294)
!442 = !DILocation(line: 113, column: 37, scope: !294)
!443 = !DILocation(line: 113, column: 9, scope: !294)
!444 = !DILocation(line: 113, column: 7, scope: !294)
!445 = !DILocation(line: 114, column: 18, scope: !294)
!446 = !DILocation(line: 114, column: 5, scope: !294)
!447 = !DILocation(line: 115, column: 12, scope: !294)
!448 = !DILocation(line: 115, column: 5, scope: !294)
!449 = !DILocation(line: 116, column: 1, scope: !294)
!450 = distinct !DISubprogram(name: "cms_copy_content", scope: !295, file: !295, line: 32, type: !451, isLocal: true, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!451 = !DISubroutineType(types: !452)
!452 = !{!7, !408, !408, !411}
!453 = !DILocalVariable(name: "out", arg: 1, scope: !450, file: !295, line: 32, type: !408)
!454 = !DILocation(line: 32, column: 34, scope: !450)
!455 = !DILocalVariable(name: "in", arg: 2, scope: !450, file: !295, line: 32, type: !408)
!456 = !DILocation(line: 32, column: 44, scope: !450)
!457 = !DILocalVariable(name: "flags", arg: 3, scope: !450, file: !295, line: 32, type: !411)
!458 = !DILocation(line: 32, column: 61, scope: !450)
!459 = !DILocalVariable(name: "buf", scope: !450, file: !295, line: 34, type: !460)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 32768, align: 8, elements: !461)
