; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--asn1--libcrypto-shlib-x_int64.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--asn1--libcrypto-shlib-x_int64.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_PRIMITIVE_FUNCS_st = type { i8*, i64, i32 (%struct.ASN1_VALUE_st**, %struct.ASN1_ITEM_st*)*, void (%struct.ASN1_VALUE_st**, %struct.ASN1_ITEM_st*)*, void (%struct.ASN1_VALUE_st**, %struct.ASN1_ITEM_st*)*, i32 (%struct.ASN1_VALUE_st**, i8*, i32, i32, i8*, %struct.ASN1_ITEM_st*)*, i32 (%struct.ASN1_VALUE_st**, i8*, i32*, %struct.ASN1_ITEM_st*)*, i32 (%struct.bio_st*, %struct.ASN1_VALUE_st**, %struct.ASN1_ITEM_st*, i32, %struct.asn1_pctx_st*)* }
%struct.ASN1_VALUE_st = type opaque
%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.bio_st = type opaque
%struct.asn1_pctx_st = type opaque


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !29)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--asn1--libcrypto-shlib-x_int64.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{}
!3 = !{!4, !8, !9, !14, !11, !16, !19, !21, !23, !25, !27}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !6, line: 213, baseType: !7)
!6 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !6, line: 213, flags: DIFlagFwdDecl)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !12, line: 51, baseType: !13)
!12 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!13 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !17, line: 196, baseType: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !12, line: 55, baseType: !20)
!20 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !17, line: 197, baseType: !26)
!26 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!29 = !{!30, !61, !62, !63, !64, !65, !66, !67, !68, !114}
!30 = distinct !DIGlobalVariable(name: "INT32_it", scope: !0, file: !31, line: 254, type: !32, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @INT32_it)
!31 = !DIFile(filename: "crypto/asn1/x_int64.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !34, line: 62, baseType: !35)
!34 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !36, line: 580, size: 448, align: 64, elements: !37)
!36 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!37 = !{!38, !39, !40, !55, !56, !59, !60}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !35, file: !36, line: 581, baseType: !15, size: 8, align: 8)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !35, file: !36, line: 583, baseType: !26, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !35, file: !36, line: 584, baseType: !41, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !6, line: 210, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !36, line: 468, size: 320, align: 64, elements: !45)
!45 = !{!46, !47, !48, !49, !52}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !44, file: !36, line: 469, baseType: !20, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !44, file: !36, line: 470, baseType: !26, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !44, file: !36, line: 471, baseType: !20, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !44, file: !36, line: 472, baseType: !50, size: 64, align: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !44, file: !36, line: 473, baseType: !53, size: 64, align: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !6, line: 318, baseType: !32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !35, file: !36, line: 586, baseType: !26, size: 64, align: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !35, file: !36, line: 587, baseType: !57, size: 64, align: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !35, file: !36, line: 588, baseType: !26, size: 64, align: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !35, file: !36, line: 589, baseType: !50, size: 64, align: 64, offset: 384)
!61 = distinct !DIGlobalVariable(name: "UINT32_it", scope: !0, file: !31, line: 259, type: !32, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @UINT32_it)
!62 = distinct !DIGlobalVariable(name: "INT64_it", scope: !0, file: !31, line: 263, type: !32, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @INT64_it)
!63 = distinct !DIGlobalVariable(name: "UINT64_it", scope: !0, file: !31, line: 268, type: !32, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @UINT64_it)
!64 = distinct !DIGlobalVariable(name: "ZINT32_it", scope: !0, file: !31, line: 272, type: !32, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ZINT32_it)
!65 = distinct !DIGlobalVariable(name: "ZUINT32_it", scope: !0, file: !31, line: 277, type: !32, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ZUINT32_it)
!66 = distinct !DIGlobalVariable(name: "ZINT64_it", scope: !0, file: !31, line: 282, type: !32, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ZINT64_it)
!67 = distinct !DIGlobalVariable(name: "ZUINT64_it", scope: !0, file: !31, line: 287, type: !32, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ZUINT64_it)
!68 = distinct !DIGlobalVariable(name: "uint32_pf", scope: !0, file: !31, line: 234, type: !69, isLocal: true, isDefinition: true, variable: %struct.ASN1_PRIMITIVE_FUNCS_st* @uint32_pf)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRIMITIVE_FUNCS", file: !36, line: 701, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_PRIMITIVE_FUNCS_st", file: !36, line: 692, size: 512, align: 64, elements: !71)
!71 = !{!72, !73, !74, !81, !86, !87, !95, !102}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !70, file: !36, line: 693, baseType: !8, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !70, file: !36, line: 694, baseType: !20, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "prim_new", scope: !70, file: !36, line: 695, baseType: !75, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ex_new_func", file: !36, line: 666, baseType: !77)
!77 = !DISubroutineType(types: !78)
!78 = !{!18, !79, !80}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "prim_free", scope: !70, file: !36, line: 696, baseType: !82, size: 64, align: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ex_free_func", file: !36, line: 667, baseType: !84)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !79, !80}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "prim_clear", scope: !70, file: !36, line: 697, baseType: !82, size: 64, align: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "prim_c2i", scope: !70, file: !36, line: 698, baseType: !88, size: 64, align: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_primitive_c2i", file: !36, line: 675, baseType: !90)
!90 = !DISubroutineType(types: !91)
!91 = !{!18, !79, !92, !18, !18, !14, !80}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "prim_i2c", scope: !70, file: !36, line: 699, baseType: !96, size: 64, align: 64, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_primitive_i2c", file: !36, line: 673, baseType: !98)
!98 = !DISubroutineType(types: !99)
!99 = !{!18, !79, !100, !101, !80}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "prim_print", scope: !70, file: !36, line: 700, baseType: !103, size: 64, align: 64, offset: 448)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_primitive_print", file: !36, line: 678, baseType: !105)
!105 = !DISubroutineType(types: !106)
!106 = !{!18, !107, !79, !80, !18, !110}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !34, line: 79, baseType: !109)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !34, line: 79, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PCTX", file: !34, line: 63, baseType: !113)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_pctx_st", file: !34, line: 63, flags: DIFlagFwdDecl)
!114 = distinct !DIGlobalVariable(name: "uint64_pf", scope: !0, file: !31, line: 244, type: !69, isLocal: true, isDefinition: true, variable: %struct.ASN1_PRIMITIVE_FUNCS_st* @uint64_pf)
!115 = !{i32 2, !"Dwarf Version", i32 4}
!116 = !{i32 2, !"Debug Info Version", i32 3}
!117 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!118 = distinct !DISubprogram(name: "uint32_new", scope: !31, file: !31, line: 124, type: !77, isLocal: true, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!119 = !DILocalVariable(name: "pval", arg: 1, scope: !118, file: !31, line: 124, type: !79)
!120 = !DIExpression()
!121 = !DILocation(line: 124, column: 36, scope: !118)
!122 = !DILocalVariable(name: "it", arg: 2, scope: !118, file: !31, line: 124, type: !80)
!123 = !DILocation(line: 124, column: 59, scope: !118)
!124 = !DILocation(line: 126, column: 32, scope: !125)
!125 = distinct !DILexicalBlock(scope: !118, file: !31, line: 126, column: 9)
!126 = !DILocation(line: 126, column: 18, scope: !125)
!127 = !DILocation(line: 126, column: 11, scope: !125)
!128 = !DILocation(line: 126, column: 16, scope: !125)
!129 = !DILocation(line: 126, column: 95, scope: !125)
!130 = !DILocation(line: 126, column: 9, scope: !118)
!131 = !DILocation(line: 127, column: 9, scope: !132)
!132 = distinct !DILexicalBlock(scope: !125, file: !31, line: 126, column: 74)
!133 = !DILocation(line: 128, column: 9, scope: !132)
!134 = !DILocation(line: 130, column: 5, scope: !118)
!135 = !DILocation(line: 131, column: 1, scope: !118)
!136 = distinct !DISubprogram(name: "uint32_free", scope: !31, file: !31, line: 133, type: !84, isLocal: true, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!137 = !DILocalVariable(name: "pval", arg: 1, scope: !136, file: !31, line: 133, type: !79)
!138 = !DILocation(line: 133, column: 38, scope: !136)
!139 = !DILocalVariable(name: "it", arg: 2, scope: !136, file: !31, line: 133, type: !80)
!140 = !DILocation(line: 133, column: 61, scope: !136)
!141 = !DILocation(line: 135, column: 18, scope: !136)
!142 = !DILocation(line: 135, column: 17, scope: !136)
!143 = !DILocation(line: 135, column: 5, scope: !136)
!144 = !DILocation(line: 136, column: 6, scope: !136)
!145 = !DILocation(line: 136, column: 11, scope: !136)
!146 = !DILocation(line: 137, column: 1, scope: !136)
!147 = distinct !DISubprogram(name: "uint32_clear", scope: !31, file: !31, line: 139, type: !84, isLocal: true, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!148 = !DILocalVariable(name: "pval", arg: 1, scope: !147, file: !31, line: 139, type: !79)
!149 = !DILocation(line: 139, column: 39, scope: !147)
!150 = !DILocalVariable(name: "it", arg: 2, scope: !147, file: !31, line: 139, type: !80)
!151 = !DILocation(line: 139, column: 62, scope: !147)
