; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--x509v3--libcrypto-shlib-v3_sxnet.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--x509v3--libcrypto-shlib-v3_sxnet.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.v3_ext_method = type { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, {}*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }
%struct.stack_st_CONF_VALUE = type opaque
%struct.v3_ext_ctx = type { i32, %struct.x509_st*, %struct.x509_st*, %struct.X509_req_st*, %struct.X509_crl_st*, %struct.X509V3_CONF_METHOD_st*, i8* }
%struct.x509_st = type opaque
%struct.X509_req_st = type opaque
%struct.X509_crl_st = type opaque
%struct.X509V3_CONF_METHOD_st = type { i8* (i8*, i8*, i8*)*, %struct.stack_st_CONF_VALUE* (i8*, i8*)*, void (i8*, i8*)*, void (i8*, %struct.stack_st_CONF_VALUE*)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !60)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--x509v3--libcrypto-shlib-v3_sxnet.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{}
!3 = !{!4, !27, !28, !31, !39, !40, !42, !47, !57, !58}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "SXNETID", file: !6, line: 218, baseType: !7)
!6 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SXNET_ID_st", file: !6, line: 215, size: 128, align: 64, elements: !8)
!8 = !{!9, !24}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !7, file: !6, line: 216, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !12, line: 40, baseType: !13)
!12 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !14, line: 146, size: 192, align: 64, elements: !15)
!14 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!15 = !{!16, !18, !19, !22}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !13, file: !14, line: 147, baseType: !17, size: 32, align: 32)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !13, file: !14, line: 148, baseType: !17, size: 32, align: 32, offset: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !13, file: !14, line: 149, baseType: !20, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !13, file: !14, line: 155, baseType: !23, size: 64, align: 64, offset: 128)
!23 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !7, file: !6, line: 217, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !12, line: 43, baseType: !13)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !14, line: 213, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !14, line: 213, flags: DIFlagFwdDecl)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "SXNET", file: !6, line: 225, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SXNET_st", file: !6, line: 222, size: 128, align: 64, elements: !34)
!34 = !{!35, !36}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !33, file: !6, line: 223, baseType: !10, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ids", scope: !33, file: !6, line: 224, baseType: !37, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_SXNETID", file: !6, line: 220, flags: DIFlagFwdDecl)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !45, line: 17, baseType: !46)
!45 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !45, line: 17, flags: DIFlagFwdDecl)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_VALUE", file: !49, line: 28, baseType: !50)
!49 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !49, line: 24, size: 192, align: 64, elements: !51)
!51 = !{!52, !55, !56}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !50, file: !49, line: 25, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !50, file: !49, line: 26, baseType: !53, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !50, file: !49, line: 27, baseType: !53, size: 64, align: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!60 = !{!61, !194, !195, !196, !200}
!61 = distinct !DIGlobalVariable(name: "v3_sxnet", scope: !0, file: !62, line: 28, type: !63, isLocal: false, isDefinition: true, variable: { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, i8* (%struct.v3_ext_method*, i8*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }* @v3_sxnet)
!62 = !DIFile(filename: "crypto/x509v3/v3_sxnet.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_METHOD", file: !6, line: 92, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_method", file: !6, line: 49, size: 832, align: 64, elements: !66)
!66 = !{!67, !68, !69, !97, !102, !107, !113, !119, !126, !173, !178, !183, !191, !193}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ext_nid", scope: !65, file: !6, line: 50, baseType: !17, size: 32, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !65, file: !6, line: 51, baseType: !17, size: 32, align: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !65, file: !6, line: 53, baseType: !70, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !14, line: 318, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !12, line: 62, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !75, line: 580, size: 448, align: 64, elements: !76)
!75 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!76 = !{!77, !78, !79, !93, !94, !95, !96}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !74, file: !75, line: 581, baseType: !54, size: 8, align: 8)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !74, file: !75, line: 583, baseType: !23, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !74, file: !75, line: 584, baseType: !80, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !14, line: 210, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !75, line: 468, size: 320, align: 64, elements: !84)
!84 = !{!85, !87, !88, !89, !92}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !83, file: !75, line: 469, baseType: !86, size: 64, align: 64)
!86 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !83, file: !75, line: 470, baseType: !23, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !83, file: !75, line: 471, baseType: !86, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !83, file: !75, line: 472, baseType: !90, size: 64, align: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !83, file: !75, line: 473, baseType: !70, size: 64, align: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !74, file: !75, line: 586, baseType: !23, size: 64, align: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !74, file: !75, line: 587, baseType: !58, size: 64, align: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !74, file: !75, line: 588, baseType: !23, size: 64, align: 64, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !74, file: !75, line: 589, baseType: !90, size: 64, align: 64, offset: 384)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ext_new", scope: !65, file: !6, line: 55, baseType: !98, size: 64, align: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_NEW", file: !6, line: 28, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!39}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ext_free", scope: !65, file: !6, line: 56, baseType: !103, size: 64, align: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_FREE", file: !6, line: 29, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !39}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "d2i", scope: !65, file: !6, line: 57, baseType: !108, size: 64, align: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_D2I", file: !6, line: 30, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!39, !39, !112, !23}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i2d", scope: !65, file: !6, line: 58, baseType: !114, size: 64, align: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2D", file: !6, line: 31, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!17, !39, !118}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "i2s", scope: !65, file: !6, line: 60, baseType: !120, size: 64, align: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2S", file: !6, line: 38, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!53, !124, !39}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "s2i", scope: !65, file: !6, line: 61, baseType: !127, size: 64, align: 64, offset: 448)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_S2I", file: !6, line: 40, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!39, !124, !131, !90}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_ctx", file: !6, line: 79, size: 448, align: 64, elements: !133)
!133 = !{!134, !135, !139, !140, !145, !149, !172}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !132, file: !6, line: 82, baseType: !17, size: 32, align: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_cert", scope: !132, file: !6, line: 83, baseType: !136, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !12, line: 124, baseType: !138)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !12, line: 124, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "subject_cert", scope: !132, file: !6, line: 84, baseType: !136, size: 64, align: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "subject_req", scope: !132, file: !6, line: 85, baseType: !141, size: 64, align: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_REQ", file: !143, line: 93, baseType: !144)
!143 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_req_st", file: !143, line: 93, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !132, file: !6, line: 86, baseType: !146, size: 64, align: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL", file: !12, line: 126, baseType: !148)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_st", file: !12, line: 126, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "db_meth", scope: !132, file: !6, line: 87, baseType: !150, size: 64, align: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_CONF_METHOD", file: !6, line: 76, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509V3_CONF_METHOD_st", file: !6, line: 71, size: 256, align: 64, elements: !153)
!153 = !{!154, !158, !164, !168}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "get_string", scope: !152, file: !6, line: 72, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!53, !39, !90, !90}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "get_section", scope: !152, file: !6, line: 73, baseType: !159, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !39, !90}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_VALUE", file: !49, line: 30, flags: DIFlagFwdDecl)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "free_string", scope: !152, file: !6, line: 74, baseType: !165, size: 64, align: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !39, !53}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "free_section", scope: !152, file: !6, line: 75, baseType: !169, size: 64, align: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !39, !162}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !132, file: !6, line: 88, baseType: !39, size: 64, align: 64, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "i2v", scope: !65, file: !6, line: 63, baseType: !174, size: 64, align: 64, offset: 512)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2V", file: !6, line: 33, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!162, !124, !39, !162}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "v2i", scope: !65, file: !6, line: 64, baseType: !179, size: 64, align: 64, offset: 576)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_V2I", file: !6, line: 35, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!39, !124, !131, !162}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "i2r", scope: !65, file: !6, line: 66, baseType: !184, size: 64, align: 64, offset: 640)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2R", file: !6, line: 42, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!17, !124, !39, !188, !17}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !12, line: 79, baseType: !190)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !12, line: 79, flags: DIFlagFwdDecl)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "r2i", scope: !65, file: !6, line: 67, baseType: !192, size: 64, align: 64, offset: 704)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_R2I", file: !6, line: 44, baseType: !128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "usr_data", scope: !65, file: !6, line: 68, baseType: !39, size: 64, align: 64, offset: 768)
!194 = distinct !DIGlobalVariable(name: "SXNETID_it", scope: !0, file: !62, line: 46, type: !72, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @SXNETID_it)
!195 = distinct !DIGlobalVariable(name: "SXNET_it", scope: !0, file: !62, line: 53, type: !72, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @SXNET_it)
!196 = distinct !DIGlobalVariable(name: "SXNETID_seq_tt", scope: !0, file: !62, line: 43, type: !197, isLocal: true, isDefinition: true, variable: [2 x %struct.ASN1_TEMPLATE_st]* @SXNETID_seq_tt)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 640, align: 64, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 2)
!200 = distinct !DIGlobalVariable(name: "SXNET_seq_tt", scope: !0, file: !62, line: 50, type: !197, isLocal: true, isDefinition: true, variable: [2 x %struct.ASN1_TEMPLATE_st]* @SXNET_seq_tt)
!201 = !{i32 2, !"Dwarf Version", i32 4}
!202 = !{i32 2, !"Debug Info Version", i32 3}
!203 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!204 = distinct !DISubprogram(name: "sxnet_v2i", scope: !62, file: !62, line: 84, type: !205, isLocal: true, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!205 = !DISubroutineType(types: !206)
!206 = !{!31, !207, !208, !162}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_CTX", file: !12, line: 143, baseType: !132)
!210 = !DILocalVariable(name: "method", arg: 1, scope: !204, file: !62, line: 84, type: !207)
!211 = !DIExpression()
!212 = !DILocation(line: 84, column: 44, scope: !204)
!213 = !DILocalVariable(name: "ctx", arg: 2, scope: !204, file: !62, line: 84, type: !208)
!214 = !DILocation(line: 84, column: 64, scope: !204)
!215 = !DILocalVariable(name: "nval", arg: 3, scope: !204, file: !62, line: 85, type: !162)
!216 = !DILocation(line: 85, column: 53, scope: !204)
!217 = !DILocalVariable(name: "cnf", scope: !204, file: !62, line: 87, type: !47)
!218 = !DILocation(line: 87, column: 17, scope: !204)
!219 = !DILocalVariable(name: "sx", scope: !204, file: !62, line: 88, type: !31)
!220 = !DILocation(line: 88, column: 12, scope: !204)
!221 = !DILocalVariable(name: "i", scope: !204, file: !62, line: 89, type: !17)
!222 = !DILocation(line: 89, column: 9, scope: !204)
!223 = !DILocation(line: 90, column: 12, scope: !224)
!224 = distinct !DILexicalBlock(scope: !204, file: !62, line: 90, column: 5)
!225 = !DILocation(line: 90, column: 10, scope: !224)
!226 = !DILocation(line: 90, column: 17, scope: !227)
!227 = !DILexicalBlockFile(scope: !228, file: !62, discriminator: 1)
!228 = distinct !DILexicalBlock(scope: !224, file: !62, line: 90, column: 5)
!229 = !DILocation(line: 90, column: 39, scope: !227)
!230 = !DILocation(line: 90, column: 21, scope: !227)
!231 = !DILocation(line: 90, column: 19, scope: !227)
!232 = !DILocation(line: 90, column: 5, scope: !227)
!233 = !DILocation(line: 91, column: 35, scope: !234)
!234 = distinct !DILexicalBlock(scope: !228, file: !62, line: 90, column: 51)
!235 = !DILocation(line: 91, column: 41, scope: !234)
!236 = !DILocation(line: 91, column: 15, scope: !234)
!237 = !DILocation(line: 91, column: 13, scope: !234)
!238 = !DILocation(line: 92, column: 36, scope: !239)
!239 = distinct !DILexicalBlock(scope: !234, file: !62, line: 92, column: 13)
!240 = !DILocation(line: 92, column: 41, scope: !239)
!241 = !DILocation(line: 92, column: 47, scope: !239)
!242 = !DILocation(line: 92, column: 52, scope: !239)
!243 = !DILocation(line: 92, column: 14, scope: !239)
!244 = !DILocation(line: 92, column: 13, scope: !234)
!245 = !DILocation(line: 93, column: 13, scope: !239)
!246 = !DILocation(line: 94, column: 5, scope: !234)
