; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--x509v3--libcrypto-shlib-v3_bitst.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--x509v3--libcrypto-shlib-v3_bitst.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type opaque
%struct.BIT_STRING_BITNAME_st = type { i32, i8*, i8* }
%struct.v3_ext_method = type { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, {}*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }
%struct.stack_st_CONF_VALUE = type opaque
%struct.v3_ext_ctx = type { i32, %struct.x509_st*, %struct.x509_st*, %struct.X509_req_st*, %struct.X509_crl_st*, %struct.X509V3_CONF_METHOD_st*, i8* }
%struct.x509_st = type opaque
%struct.X509_req_st = type opaque
%struct.X509_crl_st = type opaque
%struct.X509V3_CONF_METHOD_st = type { i8* (i8*, i8*, i8*)*, %struct.stack_st_CONF_VALUE* (i8*, i8*)*, void (i8*, i8*)*, void (i8*, %struct.stack_st_CONF_VALUE*)* }
%struct.bio_st = type opaque
%struct.asn1_string_st = type { i32, i32, i8*, i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !20)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--x509v3--libcrypto-shlib-v3_bitst.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{}
!3 = !{!4, !5, !10}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !8, line: 17, baseType: !9)
!8 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !8, line: 17, flags: DIFlagFwdDecl)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_VALUE", file: !12, line: 28, baseType: !13)
!12 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 24, size: 192, align: 64, elements: !14)
!14 = !{!15, !18, !19}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !13, file: !12, line: 25, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !13, file: !12, line: 26, baseType: !16, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !13, file: !12, line: 27, baseType: !16, size: 64, align: 64, offset: 128)
!20 = !{!21, !143, !144, !154}
!21 = distinct !DIGlobalVariable(name: "v3_nscert", scope: !0, file: !22, line: 41, type: !23, isLocal: false, isDefinition: true, variable: { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, i8* (%struct.v3_ext_method*, i8*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }* @v3_nscert)
!22 = !DIFile(filename: "crypto/x509v3/v3_bitst.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_METHOD", file: !25, line: 92, baseType: !26)
!25 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_method", file: !25, line: 49, size: 832, align: 64, elements: !27)
!27 = !{!28, !30, !31, !39, !44, !49, !59, !66, !73, !122, !127, !132, !140, !142}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ext_nid", scope: !26, file: !25, line: 50, baseType: !29, size: 32, align: 32)
!29 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !26, file: !25, line: 51, baseType: !29, size: 32, align: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !26, file: !25, line: 53, baseType: !32, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !34, line: 318, baseType: !35)
!34 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !37, line: 62, baseType: !38)
!37 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !37, line: 62, flags: DIFlagFwdDecl)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ext_new", scope: !26, file: !25, line: 55, baseType: !40, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_NEW", file: !25, line: 28, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!4}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ext_free", scope: !26, file: !25, line: 56, baseType: !45, size: 64, align: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_FREE", file: !25, line: 29, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !4}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "d2i", scope: !26, file: !25, line: 57, baseType: !50, size: 64, align: 64, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_D2I", file: !25, line: 30, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!4, !4, !54, !58}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!58 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "i2d", scope: !26, file: !25, line: 58, baseType: !60, size: 64, align: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2D", file: !25, line: 31, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!29, !4, !64}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "i2s", scope: !26, file: !25, line: 60, baseType: !67, size: 64, align: 64, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2S", file: !25, line: 38, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!16, !71, !4}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "s2i", scope: !26, file: !25, line: 61, baseType: !74, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_S2I", file: !25, line: 40, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!4, !71, !78, !105}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_ctx", file: !25, line: 79, size: 448, align: 64, elements: !80)
!80 = !{!81, !82, !86, !87, !92, !96, !121}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !79, file: !25, line: 82, baseType: !29, size: 32, align: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_cert", scope: !79, file: !25, line: 83, baseType: !83, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !37, line: 124, baseType: !85)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !37, line: 124, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "subject_cert", scope: !79, file: !25, line: 84, baseType: !83, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "subject_req", scope: !79, file: !25, line: 85, baseType: !88, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_REQ", file: !90, line: 93, baseType: !91)
!90 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_req_st", file: !90, line: 93, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !79, file: !25, line: 86, baseType: !93, size: 64, align: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL", file: !37, line: 126, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_st", file: !37, line: 126, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "db_meth", scope: !79, file: !25, line: 87, baseType: !97, size: 64, align: 64, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_CONF_METHOD", file: !25, line: 76, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509V3_CONF_METHOD_st", file: !25, line: 71, size: 256, align: 64, elements: !100)
!100 = !{!101, !107, !113, !117}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "get_string", scope: !99, file: !25, line: 72, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!16, !4, !105, !105}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "get_section", scope: !99, file: !25, line: 73, baseType: !108, size: 64, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!111, !4, !105}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_VALUE", file: !12, line: 30, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "free_string", scope: !99, file: !25, line: 74, baseType: !114, size: 64, align: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !4, !16}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "free_section", scope: !99, file: !25, line: 75, baseType: !118, size: 64, align: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !4, !111}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !79, file: !25, line: 88, baseType: !4, size: 64, align: 64, offset: 384)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "i2v", scope: !26, file: !25, line: 63, baseType: !123, size: 64, align: 64, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2V", file: !25, line: 33, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!111, !71, !4, !111}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "v2i", scope: !26, file: !25, line: 64, baseType: !128, size: 64, align: 64, offset: 576)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_V2I", file: !25, line: 35, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!4, !71, !78, !111}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "i2r", scope: !26, file: !25, line: 66, baseType: !133, size: 64, align: 64, offset: 640)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2R", file: !25, line: 42, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!29, !71, !4, !137, !29}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !37, line: 79, baseType: !139)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !37, line: 79, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "r2i", scope: !26, file: !25, line: 67, baseType: !141, size: 64, align: 64, offset: 704)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_R2I", file: !25, line: 44, baseType: !75)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "usr_data", scope: !26, file: !25, line: 68, baseType: !4, size: 64, align: 64, offset: 768)
!143 = distinct !DIGlobalVariable(name: "v3_key_usage", scope: !0, file: !22, line: 43, type: !23, isLocal: false, isDefinition: true, variable: { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, i8* (%struct.v3_ext_method*, i8*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }* @v3_key_usage)
!144 = distinct !DIGlobalVariable(name: "ns_cert_type_table", scope: !0, file: !22, line: 16, type: !145, isLocal: true, isDefinition: true, variable: [9 x %struct.BIT_STRING_BITNAME_st]* @ns_cert_type_table)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 1728, align: 64, elements: !152)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIT_STRING_BITNAME", file: !34, line: 487, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BIT_STRING_BITNAME_st", file: !34, line: 483, size: 192, align: 64, elements: !148)
!148 = !{!149, !150, !151}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "bitnum", scope: !147, file: !34, line: 484, baseType: !29, size: 32, align: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !147, file: !34, line: 485, baseType: !105, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !147, file: !34, line: 486, baseType: !105, size: 64, align: 64, offset: 128)
!152 = !{!153}
!153 = !DISubrange(count: 9)
!154 = distinct !DIGlobalVariable(name: "key_usage_type_table", scope: !0, file: !22, line: 28, type: !155, isLocal: true, isDefinition: true, variable: [10 x %struct.BIT_STRING_BITNAME_st]* @key_usage_type_table)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 1920, align: 64, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 10)
!158 = !{i32 2, !"Dwarf Version", i32 4}
!159 = !{i32 2, !"Debug Info Version", i32 3}
!160 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!161 = distinct !DISubprogram(name: "i2v_ASN1_BIT_STRING", scope: !22, file: !22, line: 46, type: !162, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!162 = !DISubroutineType(types: !163)
!163 = !{!111, !164, !165, !111}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !37, line: 42, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !34, line: 146, size: 192, align: 64, elements: !168)
!168 = !{!169, !170, !171, !172}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !167, file: !34, line: 147, baseType: !29, size: 32, align: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !167, file: !34, line: 148, baseType: !29, size: 32, align: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !167, file: !34, line: 149, baseType: !65, size: 64, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !167, file: !34, line: 155, baseType: !58, size: 64, align: 64, offset: 128)
!173 = !DILocalVariable(name: "method", arg: 1, scope: !161, file: !22, line: 46, type: !164)
!174 = !DIExpression()
!175 = !DILocation(line: 46, column: 68, scope: !161)
!176 = !DILocalVariable(name: "bits", arg: 2, scope: !161, file: !22, line: 47, type: !165)
!177 = !DILocation(line: 47, column: 60, scope: !161)
!178 = !DILocalVariable(name: "ret", arg: 3, scope: !161, file: !22, line: 48, type: !111)
!179 = !DILocation(line: 48, column: 71, scope: !161)
!180 = !DILocalVariable(name: "bnam", scope: !161, file: !22, line: 50, type: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!182 = !DILocation(line: 50, column: 25, scope: !161)
!183 = !DILocation(line: 51, column: 17, scope: !184)
!184 = distinct !DILexicalBlock(scope: !161, file: !22, line: 51, column: 5)
!185 = !DILocation(line: 51, column: 25, scope: !184)
!186 = !DILocation(line: 51, column: 15, scope: !184)
!187 = !DILocation(line: 51, column: 10, scope: !184)
!188 = !DILocation(line: 51, column: 35, scope: !189)
!189 = !DILexicalBlockFile(scope: !190, file: !22, discriminator: 1)
!190 = distinct !DILexicalBlock(scope: !184, file: !22, line: 51, column: 5)
!191 = !DILocation(line: 51, column: 41, scope: !189)
!192 = !DILocation(line: 51, column: 5, scope: !189)
!193 = !DILocation(line: 52, column: 37, scope: !194)
!194 = distinct !DILexicalBlock(scope: !195, file: !22, line: 52, column: 13)
!195 = distinct !DILexicalBlock(scope: !190, file: !22, line: 51, column: 56)
!196 = !DILocation(line: 52, column: 43, scope: !194)
!197 = !DILocation(line: 52, column: 49, scope: !194)
!198 = !DILocation(line: 52, column: 13, scope: !194)
!199 = !DILocation(line: 52, column: 13, scope: !195)
!200 = !DILocation(line: 53, column: 30, scope: !194)
!201 = !DILocation(line: 53, column: 36, scope: !194)
!202 = !DILocation(line: 53, column: 13, scope: !194)
!203 = !DILocation(line: 54, column: 5, scope: !195)
!204 = !DILocation(line: 51, column: 52, scope: !205)
!205 = !DILexicalBlockFile(scope: !190, file: !22, discriminator: 2)
!206 = !DILocation(line: 51, column: 5, scope: !205)
!207 = distinct !{!207, !208}
!208 = !DILocation(line: 51, column: 5, scope: !161)
!209 = !DILocation(line: 55, column: 12, scope: !161)
!210 = !DILocation(line: 55, column: 5, scope: !161)
!211 = distinct !DISubprogram(name: "v2i_ASN1_BIT_STRING", scope: !22, file: !22, line: 58, type: !212, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!212 = !DISubroutineType(types: !213)
!213 = !{!165, !164, !214, !111}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_CTX", file: !37, line: 143, baseType: !79)
!216 = !DILocalVariable(name: "method", arg: 1, scope: !211, file: !22, line: 58, type: !164)
!217 = !DILocation(line: 58, column: 57, scope: !211)
!218 = !DILocalVariable(name: "ctx", arg: 2, scope: !211, file: !22, line: 59, type: !214)
!219 = !DILocation(line: 59, column: 50, scope: !211)
!220 = !DILocalVariable(name: "nval", arg: 3, scope: !211, file: !22, line: 60, type: !111)
!221 = !DILocation(line: 60, column: 66, scope: !211)
!222 = !DILocalVariable(name: "val", scope: !211, file: !22, line: 62, type: !10)
!223 = !DILocation(line: 62, column: 17, scope: !211)
!224 = !DILocalVariable(name: "bs", scope: !211, file: !22, line: 63, type: !165)
!225 = !DILocation(line: 63, column: 22, scope: !211)
!226 = !DILocalVariable(name: "i", scope: !211, file: !22, line: 64, type: !29)
!227 = !DILocation(line: 64, column: 9, scope: !211)
!228 = !DILocalVariable(name: "bnam", scope: !211, file: !22, line: 65, type: !181)
!229 = !DILocation(line: 65, column: 25, scope: !211)
!230 = !DILocation(line: 66, column: 15, scope: !231)
!231 = distinct !DILexicalBlock(scope: !211, file: !22, line: 66, column: 9)
