; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--property--libcrypto-shlib-property.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--property--libcrypto-shlib-property.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ossl_method_store_st = type { i64, %struct.sparse_array_st_ALGORITHM*, %struct.ossl_property_list_st*, i32, i32, [63 x i8], i8* }
%struct.sparse_array_st_ALGORITHM = type opaque
%struct.ossl_property_list_st = type opaque
%struct.sparse_array_st = type opaque
%struct.ALGORITHM = type { i32, %struct.stack_st_IMPLEMENTATION*, %struct.lhash_st_QUERY* }
%struct.stack_st_IMPLEMENTATION = type opaque
%struct.lhash_st_QUERY = type { %union.lh_QUERY_dummy }
%union.lh_QUERY_dummy = type { i8* }
%struct.IMPLEMENTATION = type { %struct.ossl_property_list_st*, i8*, void (i8*)* }
%struct.stack_st = type opaque
%struct.QUERY = type { i8*, i8*, [1 x i8] }
%struct.lhash_st = type opaque
%struct.IMPL_CACHE_FLUSH = type { %struct.ossl_method_store_st*, %struct.lhash_st_QUERY*, i64 }
%struct.ossl_init_settings_st = type opaque

@.str = private unnamed_addr constant [27 x i8] c"crypto/property/property.c\00", align 1
@method_store_init_flag = internal global i32 0, align 4
@do_method_store_init_ossl_ret_ = internal global i32 0, align 4
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !121)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--property--libcrypto-shlib-property.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{}
!3 = !{!4, !5, !7, !10, !14, !20, !24, !28, !32, !33, !40, !43, !52, !58, !56, !62, !64, !75, !87, !90, !117}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "sparse_array_st_ALGORITHM", file: !9, line: 51, flags: DIFlagFwdDecl)
!9 = !DIFile(filename: "crypto/property/property.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_SA", file: !12, line: 66, baseType: !13)
!12 = !DIFile(filename: "crypto/include/internal/sparse_array.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "sparse_array_st", file: !12, line: 66, flags: DIFlagFwdDecl)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DISubroutineType(types: !16)
!16 = !{null, !17, !4}
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !18, line: 216, baseType: !19)
!18 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!19 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !22, line: 17, baseType: !23)
!22 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !22, line: 17, flags: DIFlagFwdDecl)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !22, line: 20, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DISubroutineType(types: !27)
!27 = !{null, !4}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_LHASH", file: !30, line: 29, baseType: !31)
!30 = !DIFile(filename: "include/openssl/lhash.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "lhash_st", file: !30, line: 29, flags: DIFlagFwdDecl)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_LH_DOALL_FUNC", file: !30, line: 27, baseType: !25)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALGORITHM", file: !9, line: 47, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 43, size: 192, align: 64, elements: !36)
!36 = !{!37, !39, !42}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "nid", scope: !35, file: !9, line: 44, baseType: !38, size: 32, align: 32)
!38 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "impls", scope: !35, file: !9, line: 45, baseType: !40, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_IMPLEMENTATION", file: !9, line: 33, flags: DIFlagFwdDecl)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !35, file: !9, line: 46, baseType: !43, size: 64, align: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lhash_st_QUERY", file: !9, line: 41, size: 64, align: 64, elements: !45)
!45 = !{!46}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !44, file: !9, line: 41, baseType: !47, size: 64, align: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "lh_QUERY_dummy", file: !9, line: 41, size: 64, align: 64, elements: !48)
!48 = !{!49, !50, !51}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !47, file: !9, line: 41, baseType: !4, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !47, file: !9, line: 41, baseType: !19, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !47, file: !9, line: 41, baseType: !38, size: 32, align: 32)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_LH_HASHFUNC", file: !30, line: 26, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!19, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_LH_COMPFUNC", file: !30, line: 25, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!38, !56, !56}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMPLEMENTATION", file: !9, line: 31, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 27, size: 192, align: 64, elements: !67)
!67 = !{!68, !73, !74}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !66, file: !9, line: 28, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSSL_PROPERTY_LIST", file: !71, line: 14, baseType: !72)
!71 = !DIFile(filename: "crypto/property/property_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "ossl_property_list_st", file: !71, line: 14, flags: DIFlagFwdDecl)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !66, file: !9, line: 29, baseType: !4, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "implementation_destruct", scope: !66, file: !9, line: 30, baseType: !25, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY", file: !9, line: 39, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 35, size: 192, align: 64, elements: !78)
!78 = !{!79, !82, !83}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !77, file: !9, line: 36, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !77, file: !9, line: 37, baseType: !4, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !77, file: !9, line: 38, baseType: !84, size: 8, align: 8, offset: 128)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 8, align: 8, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 1)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{null, !17, !4, !4}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMPL_CACHE_FLUSH", file: !9, line: 63, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 59, size: 192, align: 64, elements: !93)
!93 = !{!94, !115, !116}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !92, file: !9, line: 60, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSSL_METHOD_STORE", file: !97, line: 14, baseType: !98)
!97 = !DIFile(filename: "include/internal/property.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ossl_method_store_st", file: !9, line: 49, size: 832, align: 64, elements: !99)
!99 = !{!100, !101, !102, !103, !104, !106, !111}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "nelem", scope: !98, file: !9, line: 50, baseType: !17, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "algs", scope: !98, file: !9, line: 51, baseType: !7, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "global_properties", scope: !98, file: !9, line: 52, baseType: !69, size: 64, align: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "need_flush", scope: !98, file: !9, line: 53, baseType: !38, size: 32, align: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !98, file: !9, line: 54, baseType: !105, size: 32, align: 32, offset: 224)
!105 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "rand_bits", scope: !98, file: !9, line: 55, baseType: !107, size: 504, align: 8, offset: 256)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 504, align: 8, elements: !109)
!108 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!109 = !{!110}
!110 = !DISubrange(count: 63)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !98, file: !9, line: 56, baseType: !112, size: 64, align: 64, offset: 768)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_RWLOCK", file: !114, line: 67, baseType: null)
!114 = !DIFile(filename: "include/openssl/crypto.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!115 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !92, file: !9, line: 61, baseType: !43, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "nelem", scope: !92, file: !9, line: 62, baseType: !17, size: 64, align: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_LH_DOALL_FUNCARG", file: !30, line: 28, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !4, !4}
!121 = !{!122, !126}
!122 = distinct !DIGlobalVariable(name: "method_store_init_flag", scope: !0, file: !9, line: 102, type: !123, isLocal: true, isDefinition: true, variable: i32* @method_store_init_flag)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_ONCE", file: !114, line: 429, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_once_t", file: !125, line: 168, baseType: !38)
!125 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!126 = distinct !DIGlobalVariable(name: "do_method_store_init_ossl_ret_", scope: !0, file: !9, line: 103, type: !38, isLocal: true, isDefinition: true, variable: i32* @do_method_store_init_ossl_ret_)
!127 = !{i32 2, !"Dwarf Version", i32 4}
!128 = !{i32 2, !"Debug Info Version", i32 3}
!129 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!130 = distinct !DISubprogram(name: "ossl_property_read_lock", scope: !9, file: !9, line: 70, type: !131, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!131 = !DISubroutineType(types: !132)
!132 = !{!38, !95}
!133 = !DILocalVariable(name: "p", arg: 1, scope: !130, file: !9, line: 70, type: !95)
!134 = !DIExpression()
!135 = !DILocation(line: 70, column: 48, scope: !130)
!136 = !DILocation(line: 72, column: 12, scope: !130)
!137 = !DILocation(line: 72, column: 14, scope: !130)
!138 = !DILocation(line: 72, column: 47, scope: !139)
!139 = !DILexicalBlockFile(scope: !130, file: !9, discriminator: 1)
!140 = !DILocation(line: 72, column: 50, scope: !139)
!141 = !DILocation(line: 72, column: 23, scope: !139)
!142 = !DILocation(line: 72, column: 12, scope: !139)
!143 = !DILocation(line: 72, column: 12, scope: !144)
!144 = !DILexicalBlockFile(scope: !130, file: !9, discriminator: 2)
!145 = !DILocation(line: 72, column: 12, scope: !146)
!146 = !DILexicalBlockFile(scope: !130, file: !9, discriminator: 3)
!147 = !DILocation(line: 72, column: 5, scope: !146)
!148 = distinct !DISubprogram(name: "ossl_property_write_lock", scope: !9, file: !9, line: 75, type: !131, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!149 = !DILocalVariable(name: "p", arg: 1, scope: !148, file: !9, line: 75, type: !95)
!150 = !DILocation(line: 75, column: 49, scope: !148)
!151 = !DILocation(line: 77, column: 12, scope: !148)
!152 = !DILocation(line: 77, column: 14, scope: !148)
!153 = !DILocation(line: 77, column: 48, scope: !154)
!154 = !DILexicalBlockFile(scope: !148, file: !9, discriminator: 1)
!155 = !DILocation(line: 77, column: 51, scope: !154)
!156 = !DILocation(line: 77, column: 23, scope: !154)
!157 = !DILocation(line: 77, column: 12, scope: !154)
!158 = !DILocation(line: 77, column: 12, scope: !159)
!159 = !DILexicalBlockFile(scope: !148, file: !9, discriminator: 2)
!160 = !DILocation(line: 77, column: 12, scope: !161)
!161 = !DILexicalBlockFile(scope: !148, file: !9, discriminator: 3)
!162 = !DILocation(line: 77, column: 5, scope: !161)
!163 = distinct !DISubprogram(name: "ossl_property_unlock", scope: !9, file: !9, line: 80, type: !131, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!164 = !DILocalVariable(name: "p", arg: 1, scope: !163, file: !9, line: 80, type: !95)
!165 = !DILocation(line: 80, column: 45, scope: !163)
!166 = !DILocation(line: 82, column: 12, scope: !163)
!167 = !DILocation(line: 82, column: 14, scope: !163)
