; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--pkcs12--libcrypto-shlib-p12_kiss.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--pkcs12--libcrypto-shlib-p12_kiss.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PKCS12_st = type opaque
%struct.evp_pkey_st = type opaque
%struct.x509_st = type opaque
%struct.stack_st_X509 = type opaque
%struct.stack_st = type opaque
%struct.stack_st_PKCS7 = type opaque
%struct.stack_st_PKCS12_SAFEBAG = type opaque
%struct.pkcs7_st = type { i8*, i64, i32, i32, %struct.asn1_object_st*, %union.anon }
%struct.asn1_object_st = type opaque
%union.anon = type { i8* }
%struct.PKCS12_SAFEBAG_st = type opaque
%struct.pkcs8_priv_key_info_st = type opaque
%struct.asn1_type_st = type { i32, %union.anon.0 }
%union.anon.0 = type { i8* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }

@.str = private unnamed_addr constant [25 x i8] c"crypto/pkcs12/p12_kiss.c\00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1

; Function Attrs: nounwind uwtable
define i32 @PKCS12_parse(%struct.PKCS12_st* %p12, i8* %pass, %struct.evp_pkey_st** %pkey, %struct.x509_st** %cert, %struct.stack_st_X509** %ca) #0 !dbg !200 {
entry:
  %retval = alloca i32, align 4
  %p12.addr = alloca %struct.PKCS12_st*, align 8
  %pass.addr = alloca i8*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--pkcs12--libcrypto-shlib-p12_kiss.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{}
!3 = !{!4, !7, !11, !15, !17, !21, !22, !24, !193}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509", file: !6, line: 99, flags: DIFlagFwdDecl)
!6 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !9, line: 124, baseType: !10)
!9 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !9, line: 124, flags: DIFlagFwdDecl)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !13, line: 17, baseType: !14)
!13 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !13, line: 17, flags: DIFlagFwdDecl)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !13, line: 20, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DISubroutineType(types: !20)
!20 = !{null, !21}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7", file: !26, line: 144, baseType: !27)
!26 = !DIFile(filename: "include/openssl/pkcs7.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_st", file: !26, line: 109, size: 320, align: 64, elements: !28)
!28 = !{!29, !32, !34, !36, !37, !41}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "asn1", scope: !27, file: !26, line: 114, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !27, file: !26, line: 115, baseType: !33, size: 64, align: 64, offset: 64)
!33 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !27, file: !26, line: 119, baseType: !35, size: 32, align: 32, offset: 128)
!35 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !27, file: !26, line: 120, baseType: !35, size: 32, align: 32, offset: 160)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !26, line: 121, baseType: !38, size: 64, align: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !9, line: 60, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !9, line: 60, flags: DIFlagFwdDecl)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !27, file: !26, line: 143, baseType: !42, size: 64, align: 64, offset: 256)
!42 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !27, file: !26, line: 127, size: 64, align: 64, elements: !43)
!43 = !{!44, !47, !57, !77, !164, !176, !185, !192}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !42, file: !26, line: 128, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !42, file: !26, line: 130, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !9, line: 43, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !51, line: 146, size: 192, align: 64, elements: !52)
!51 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!52 = !{!53, !54, !55, !56}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !50, file: !51, line: 147, baseType: !35, size: 32, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !50, file: !51, line: 148, baseType: !35, size: 32, align: 32, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !50, file: !51, line: 149, baseType: !30, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !50, file: !51, line: 155, baseType: !33, size: 64, align: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !42, file: !26, line: 132, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGNED", file: !26, line: 68, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signed_st", file: !26, line: 61, size: 384, align: 64, elements: !61)
!61 = !{!62, !65, !68, !69, !72, !75}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !60, file: !26, line: 62, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !9, line: 40, baseType: !50)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !60, file: !26, line: 63, baseType: !66, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ALGOR", file: !51, line: 119, flags: DIFlagFwdDecl)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !60, file: !26, line: 64, baseType: !4, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !60, file: !26, line: 65, baseType: !70, size: 64, align: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_CRL", file: !6, line: 228, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !60, file: !26, line: 66, baseType: !73, size: 64, align: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_SIGNER_INFO", file: !26, line: 49, flags: DIFlagFwdDecl)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !60, file: !26, line: 67, baseType: !76, size: 64, align: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "enveloped", scope: !42, file: !26, line: 134, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENVELOPE", file: !26, line: 85, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enveloped_st", file: !26, line: 81, size: 192, align: 64, elements: !81)
!81 = !{!82, !83, !86}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !80, file: !26, line: 82, baseType: !63, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !80, file: !26, line: 83, baseType: !84, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_RECIP_INFO", file: !26, line: 59, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !80, file: !26, line: 84, baseType: !87, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENC_CONTENT", file: !26, line: 79, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enc_content_st", file: !26, line: 74, size: 256, align: 64, elements: !90)
!90 = !{!91, !92, !158, !159}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !89, file: !26, line: 75, baseType: !38, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !89, file: !26, line: 76, baseType: !93, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !9, line: 125, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !6, line: 59, size: 128, align: 64, elements: !96)
!96 = !{!97, !98}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !95, file: !6, line: 60, baseType: !38, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !95, file: !6, line: 61, baseType: !99, size: 64, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !51, line: 473, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !51, line: 444, size: 128, align: 64, elements: !102)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !101, file: !51, line: 445, baseType: !35, size: 32, align: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !101, file: !51, line: 472, baseType: !105, size: 64, align: 64, offset: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !101, file: !51, line: 446, size: 64, align: 64, elements: !106)
!106 = !{!107, !108, !110, !113, !114, !115, !118, !121, !122, !125, !128, !131, !134, !137, !140, !143, !146, !149, !152, !153, !154}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !105, file: !51, line: 447, baseType: !45, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !105, file: !51, line: 448, baseType: !109, size: 32, align: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !9, line: 56, baseType: !35)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !105, file: !51, line: 449, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !9, line: 55, baseType: !50)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !105, file: !51, line: 450, baseType: !38, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !105, file: !51, line: 451, baseType: !63, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !105, file: !51, line: 452, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !9, line: 41, baseType: !50)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !105, file: !51, line: 453, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !9, line: 42, baseType: !50)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !105, file: !51, line: 454, baseType: !48, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !105, file: !51, line: 455, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !9, line: 44, baseType: !50)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !105, file: !51, line: 456, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !9, line: 45, baseType: !50)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !105, file: !51, line: 457, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !9, line: 46, baseType: !50)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !105, file: !51, line: 458, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !9, line: 47, baseType: !50)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !105, file: !51, line: 459, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !9, line: 49, baseType: !50)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !105, file: !51, line: 460, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !9, line: 48, baseType: !50)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !105, file: !51, line: 461, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !9, line: 50, baseType: !50)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !105, file: !51, line: 462, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !9, line: 52, baseType: !50)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !105, file: !51, line: 463, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !9, line: 53, baseType: !50)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !105, file: !51, line: 464, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !9, line: 54, baseType: !50)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !105, file: !51, line: 469, baseType: !111, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !105, file: !51, line: 470, baseType: !111, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !105, file: !51, line: 471, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !51, line: 213, baseType: !157)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !51, line: 213, flags: DIFlagFwdDecl)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !89, file: !26, line: 77, baseType: !48, size: 64, align: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !89, file: !26, line: 78, baseType: !160, size: 64, align: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !9, line: 89, baseType: !163)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !9, line: 89, flags: DIFlagFwdDecl)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "signed_and_enveloped", scope: !42, file: !26, line: 136, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGN_ENVELOPE", file: !26, line: 95, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signedandenveloped_st", file: !26, line: 87, size: 448, align: 64, elements: !168)
!168 = !{!169, !170, !171, !172, !173, !174, !175}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !167, file: !26, line: 88, baseType: !63, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !167, file: !26, line: 89, baseType: !66, size: 64, align: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !167, file: !26, line: 90, baseType: !4, size: 64, align: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !167, file: !26, line: 91, baseType: !70, size: 64, align: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !167, file: !26, line: 92, baseType: !73, size: 64, align: 64, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !167, file: !26, line: 93, baseType: !87, size: 64, align: 64, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !167, file: !26, line: 94, baseType: !84, size: 64, align: 64, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !42, file: !26, line: 138, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_DIGEST", file: !26, line: 102, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_digest_st", file: !26, line: 97, size: 256, align: 64, elements: !180)
!180 = !{!181, !182, !183, !184}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !179, file: !26, line: 98, baseType: !63, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !179, file: !26, line: 99, baseType: !93, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !179, file: !26, line: 100, baseType: !76, size: 64, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !179, file: !26, line: 101, baseType: !48, size: 64, align: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "encrypted", scope: !42, file: !26, line: 140, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENCRYPT", file: !26, line: 107, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_encrypted_st", file: !26, line: 104, size: 128, align: 64, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !188, file: !26, line: 105, baseType: !63, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !188, file: !26, line: 106, baseType: !87, size: 64, align: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !42, file: !26, line: 142, baseType: !99, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS12_SAFEBAG", file: !195, line: 47, baseType: !196)
!195 = !DIFile(filename: "include/openssl/pkcs12.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "PKCS12_SAFEBAG_st", file: !195, line: 47, flags: DIFlagFwdDecl)
!197 = !{i32 2, !"Dwarf Version", i32 4}
!198 = !{i32 2, !"Debug Info Version", i32 3}
!199 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!200 = distinct !DISubprogram(name: "PKCS12_parse", scope: !201, file: !201, line: 32, type: !202, isLocal: false, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!201 = !DIFile(filename: "crypto/pkcs12/p12_kiss.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!202 = !DISubroutineType(types: !203)
!203 = !{!35, !204, !207, !209, !213, !214}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS12", file: !195, line: 45, baseType: !206)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "PKCS12_st", file: !195, line: 45, flags: DIFlagFwdDecl)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY", file: !9, line: 95, baseType: !212)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_st", file: !9, line: 95, flags: DIFlagFwdDecl)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!215 = !DILocalVariable(name: "p12", arg: 1, scope: !200, file: !201, line: 32, type: !204)
!216 = !DIExpression()
!217 = !DILocation(line: 32, column: 26, scope: !200)
!218 = !DILocalVariable(name: "pass", arg: 2, scope: !200, file: !201, line: 32, type: !207)
!219 = !DILocation(line: 32, column: 43, scope: !200)
!220 = !DILocalVariable(name: "pkey", arg: 3, scope: !200, file: !201, line: 32, type: !209)
!221 = !DILocation(line: 32, column: 60, scope: !200)
!222 = !DILocalVariable(name: "cert", arg: 4, scope: !200, file: !201, line: 32, type: !213)
!223 = !DILocation(line: 32, column: 73, scope: !200)
!224 = !DILocalVariable(name: "ca", arg: 5, scope: !200, file: !201, line: 33, type: !214)
!225 = !DILocation(line: 33, column: 41, scope: !200)
!226 = !DILocalVariable(name: "ocerts", scope: !200, file: !201, line: 35, type: !4)
!227 = !DILocation(line: 35, column: 27, scope: !200)
!228 = !DILocalVariable(name: "x", scope: !200, file: !201, line: 36, type: !7)
!229 = !DILocation(line: 36, column: 11, scope: !200)
!230 = !DILocation(line: 38, column: 9, scope: !231)
!231 = distinct !DILexicalBlock(scope: !200, file: !201, line: 38, column: 9)
!232 = !DILocation(line: 38, column: 9, scope: !200)
!233 = !DILocation(line: 39, column: 10, scope: !231)
!234 = !DILocation(line: 39, column: 15, scope: !231)
!235 = !DILocation(line: 39, column: 9, scope: !231)
!236 = !DILocation(line: 40, column: 9, scope: !237)
!237 = distinct !DILexicalBlock(scope: !200, file: !201, line: 40, column: 9)
!238 = !DILocation(line: 40, column: 9, scope: !200)
!239 = !DILocation(line: 41, column: 10, scope: !237)
!240 = !DILocation(line: 41, column: 15, scope: !237)
!241 = !DILocation(line: 41, column: 9, scope: !237)
