; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--ct--libcrypto-shlib-ct_b64.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--ct--libcrypto-shlib-ct_b64.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.sct_st = type { i32, i8*, i64, i8*, i64, i64, i8*, i64, i8, i8, i8*, i64, i32, i32, i32 }
%struct.ctlog_st = type opaque
%struct.evp_pkey_st = type opaque

@.str = private unnamed_addr constant [19 x i8] c"crypto/ct/ct_b64.c\00", align 1

; Function Attrs: nounwind uwtable
define %struct.sct_st* @SCT_new_from_base64(i8 zeroext %version, i8* %logid_base64, i32 %entry_type, i64 %timestamp, i8* %extensions_base64, i8* %signature_base64) #0 !dbg !34 {
entry:
  %retval = alloca %struct.sct_st*, align 8
  %version.addr = alloca i8, align 1
  %logid_base64.addr = alloca i8*, align 8
  %entry_type.addr = alloca i32, align 4
  %timestamp.addr = alloca i64, align 8
  %extensions_base64.addr = alloca i8*, align 8
  %signature_base64.addr = alloca i8*, align 8
  %sct = alloca %struct.sct_st*, align 8
  %dec = alloca i8*, align 8
  %p = alloca i8*, align 8
  %declen = alloca i32, align 4
  store i8 %version, i8* %version.addr, align 1
  call void @llvm.dbg.declare(metadata i8* %version.addr, metadata !72, metadata !73), !dbg !74
  store i8* %logid_base64, i8** %logid_base64.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !27)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--ct--libcrypto-shlib-ct_b64.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{!3, !8, !13, !19}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 37, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "include/openssl/ct.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "SCT_VERSION_NOT_SET", value: -1)
!7 = !DIEnumerator(name: "SCT_VERSION_V1", value: 0)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 31, size: 32, align: 32, elements: !9)
!9 = !{!10, !11, !12}
!10 = !DIEnumerator(name: "CT_LOG_ENTRY_TYPE_NOT_SET", value: -1)
!11 = !DIEnumerator(name: "CT_LOG_ENTRY_TYPE_X509", value: 0)
!12 = !DIEnumerator(name: "CT_LOG_ENTRY_TYPE_PRECERT", value: 1)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 42, size: 32, align: 32, elements: !14)
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "SCT_SOURCE_UNKNOWN", value: 0)
!16 = !DIEnumerator(name: "SCT_SOURCE_TLS_EXTENSION", value: 1)
!17 = !DIEnumerator(name: "SCT_SOURCE_X509V3_EXTENSION", value: 2)
!18 = !DIEnumerator(name: "SCT_SOURCE_OCSP_STAPLED_RESPONSE", value: 3)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 49, size: 32, align: 32, elements: !20)
!20 = !{!21, !22, !23, !24, !25, !26}
!21 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_NOT_SET", value: 0)
!22 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_UNKNOWN_LOG", value: 1)
!23 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_VALID", value: 2)
!24 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_INVALID", value: 3)
!25 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_UNVERIFIED", value: 4)
!26 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_UNKNOWN_VERSION", value: 5)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!31 = !{i32 2, !"Dwarf Version", i32 4}
!32 = !{i32 2, !"Debug Info Version", i32 3}
!33 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!34 = distinct !DISubprogram(name: "SCT_new_from_base64", scope: !35, file: !35, line: 63, type: !36, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !71)
!35 = !DIFile(filename: "crypto/ct/ct_b64.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !30, !68, !63, !54, !68, !68}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCT", file: !40, line: 173, baseType: !41)
!40 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sct_st", file: !42, line: 57, size: 832, align: 64, elements: !43)
!42 = !DIFile(filename: "crypto/ct/ct_locl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!43 = !{!44, !46, !47, !51, !52, !53, !56, !57, !58, !59, !60, !61, !62, !64, !66}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !41, file: !42, line: 58, baseType: !45, size: 32, align: 32)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "sct_version_t", file: !4, line: 40, baseType: !3)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sct", scope: !41, file: !42, line: 60, baseType: !29, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "sct_len", scope: !41, file: !42, line: 61, baseType: !48, size: 64, align: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !49, line: 216, baseType: !50)
!49 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!50 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "log_id", scope: !41, file: !42, line: 63, baseType: !29, size: 64, align: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "log_id_len", scope: !41, file: !42, line: 64, baseType: !48, size: 64, align: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !41, file: !42, line: 70, baseType: !54, size: 64, align: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !55, line: 55, baseType: !50)
!55 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !41, file: !42, line: 71, baseType: !29, size: 64, align: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ext_len", scope: !41, file: !42, line: 72, baseType: !48, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "hash_alg", scope: !41, file: !42, line: 73, baseType: !30, size: 8, align: 8, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "sig_alg", scope: !41, file: !42, line: 74, baseType: !30, size: 8, align: 8, offset: 520)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !41, file: !42, line: 75, baseType: !29, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "sig_len", scope: !41, file: !42, line: 76, baseType: !48, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "entry_type", scope: !41, file: !42, line: 78, baseType: !63, size: 32, align: 32, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ct_log_entry_type_t", file: !4, line: 35, baseType: !8)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !41, file: !42, line: 80, baseType: !65, size: 32, align: 32, offset: 736)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "sct_source_t", file: !4, line: 47, baseType: !13)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "validation_status", scope: !41, file: !42, line: 82, baseType: !67, size: 32, align: 32, offset: 768)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "sct_validation_status_t", file: !4, line: 56, baseType: !19)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!70 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!71 = !{}
!72 = !DILocalVariable(name: "version", arg: 1, scope: !34, file: !35, line: 63, type: !30)
!73 = !DIExpression()
!74 = !DILocation(line: 63, column: 40, scope: !34)
!75 = !DILocalVariable(name: "logid_base64", arg: 2, scope: !34, file: !35, line: 63, type: !68)
!76 = !DILocation(line: 63, column: 61, scope: !34)
!77 = !DILocalVariable(name: "entry_type", arg: 3, scope: !34, file: !35, line: 64, type: !63)
!78 = !DILocation(line: 64, column: 46, scope: !34)
!79 = !DILocalVariable(name: "timestamp", arg: 4, scope: !34, file: !35, line: 64, type: !54)
!80 = !DILocation(line: 64, column: 67, scope: !34)
!81 = !DILocalVariable(name: "extensions_base64", arg: 5, scope: !34, file: !35, line: 65, type: !68)
!82 = !DILocation(line: 65, column: 38, scope: !34)
!83 = !DILocalVariable(name: "signature_base64", arg: 6, scope: !34, file: !35, line: 66, type: !68)
!84 = !DILocation(line: 66, column: 38, scope: !34)
!85 = !DILocalVariable(name: "sct", scope: !34, file: !35, line: 68, type: !38)
!86 = !DILocation(line: 68, column: 10, scope: !34)
!87 = !DILocation(line: 68, column: 16, scope: !34)
!88 = !DILocalVariable(name: "dec", scope: !34, file: !35, line: 69, type: !29)
!89 = !DILocation(line: 69, column: 20, scope: !34)
!90 = !DILocalVariable(name: "p", scope: !34, file: !35, line: 70, type: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!93 = !DILocation(line: 70, column: 26, scope: !34)
!94 = !DILocalVariable(name: "declen", scope: !34, file: !35, line: 71, type: !95)
!95 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!96 = !DILocation(line: 71, column: 9, scope: !34)
!97 = !DILocation(line: 73, column: 9, scope: !98)
!98 = distinct !DILexicalBlock(scope: !34, file: !35, line: 73, column: 9)
!99 = !DILocation(line: 73, column: 13, scope: !98)
!100 = !DILocation(line: 73, column: 9, scope: !34)
!101 = !DILocation(line: 74, column: 9, scope: !102)
!102 = distinct !DILexicalBlock(scope: !98, file: !35, line: 73, column: 21)
!103 = !DILocation(line: 75, column: 9, scope: !102)
!104 = !DILocation(line: 82, column: 26, scope: !105)
!105 = distinct !DILexicalBlock(scope: !34, file: !35, line: 82, column: 9)
!106 = !DILocation(line: 82, column: 31, scope: !105)
!107 = !DILocation(line: 82, column: 10, scope: !105)
!108 = !DILocation(line: 82, column: 9, scope: !34)
!109 = !DILocation(line: 83, column: 9, scope: !110)
!110 = distinct !DILexicalBlock(scope: !105, file: !35, line: 82, column: 41)
!111 = !DILocation(line: 84, column: 9, scope: !110)
!112 = !DILocation(line: 87, column: 31, scope: !34)
!113 = !DILocation(line: 87, column: 14, scope: !34)
!114 = !DILocation(line: 87, column: 12, scope: !34)
!115 = !DILocation(line: 88, column: 9, scope: !116)
!116 = distinct !DILexicalBlock(scope: !34, file: !35, line: 88, column: 9)
!117 = !DILocation(line: 88, column: 16, scope: !116)
!118 = !DILocation(line: 88, column: 9, scope: !34)
!119 = !DILocation(line: 89, column: 9, scope: !120)
!120 = distinct !DILexicalBlock(scope: !116, file: !35, line: 88, column: 21)
!121 = !DILocation(line: 90, column: 9, scope: !120)
!122 = !DILocation(line: 92, column: 26, scope: !123)
!123 = distinct !DILexicalBlock(scope: !34, file: !35, line: 92, column: 9)
!124 = !DILocation(line: 92, column: 31, scope: !123)
!125 = !DILocation(line: 92, column: 36, scope: !123)
!126 = !DILocation(line: 92, column: 10, scope: !123)
!127 = !DILocation(line: 92, column: 9, scope: !34)
