; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--ct--libcrypto-shlib-ct_x509v3.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--ct--libcrypto-shlib-ct_x509v3.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type opaque
%struct.v3_ext_method = type { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, i8* (%struct.v3_ext_method*, i8*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }
%struct.stack_st_CONF_VALUE = type opaque
%struct.v3_ext_ctx = type { i32, %struct.x509_st*, %struct.x509_st*, %struct.X509_req_st*, %struct.X509_crl_st*, %struct.X509V3_CONF_METHOD_st*, i8* }
%struct.x509_st = type opaque
%struct.X509_req_st = type opaque
%struct.X509_crl_st = type opaque
%struct.X509V3_CONF_METHOD_st = type { i8* (i8*, i8*, i8*)*, %struct.stack_st_CONF_VALUE* (i8*, i8*)*, void (i8*, i8*)*, void (i8*, %struct.stack_st_CONF_VALUE*)* }
%struct.bio_st = type opaque
%struct.stack_st_SCT = type opaque
%struct.ctlog_store_st = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !27, globals: !66)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--ct--libcrypto-shlib-ct_x509v3.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{!3, !10, !14, !19}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 42, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "include/openssl/ct.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "SCT_SOURCE_UNKNOWN", value: 0)
!7 = !DIEnumerator(name: "SCT_SOURCE_TLS_EXTENSION", value: 1)
!8 = !DIEnumerator(name: "SCT_SOURCE_X509V3_EXTENSION", value: 2)
!9 = !DIEnumerator(name: "SCT_SOURCE_OCSP_STAPLED_RESPONSE", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 37, size: 32, align: 32, elements: !11)
!11 = !{!12, !13}
!12 = !DIEnumerator(name: "SCT_VERSION_NOT_SET", value: -1)
!13 = !DIEnumerator(name: "SCT_VERSION_V1", value: 0)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 31, size: 32, align: 32, elements: !15)
!15 = !{!16, !17, !18}
!16 = !DIEnumerator(name: "CT_LOG_ENTRY_TYPE_NOT_SET", value: -1)
!17 = !DIEnumerator(name: "CT_LOG_ENTRY_TYPE_X509", value: 0)
!18 = !DIEnumerator(name: "CT_LOG_ENTRY_TYPE_PRECERT", value: 1)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 49, size: 32, align: 32, elements: !20)
!20 = !{!21, !22, !23, !24, !25, !26}
!21 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_NOT_SET", value: 0)
!22 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_UNKNOWN_LOG", value: 1)
!23 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_VALID", value: 2)
!24 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_INVALID", value: 3)
!25 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_UNVERIFIED", value: 4)
!26 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_UNKNOWN_VERSION", value: 5)
!27 = !{!28, !29, !34}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !32, line: 17, baseType: !33)
!32 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !32, line: 17, flags: DIFlagFwdDecl)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCT", file: !36, line: 173, baseType: !37)
!36 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sct_st", file: !38, line: 57, size: 832, align: 64, elements: !39)
!38 = !DIFile(filename: "crypto/ct/ct_locl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!39 = !{!40, !42, !45, !49, !50, !51, !54, !55, !56, !57, !58, !59, !60, !62, !64}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !37, file: !38, line: 58, baseType: !41, size: 32, align: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "sct_version_t", file: !4, line: 40, baseType: !10)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "sct", scope: !37, file: !38, line: 60, baseType: !43, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "sct_len", scope: !37, file: !38, line: 61, baseType: !46, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !47, line: 216, baseType: !48)
!47 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!48 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "log_id", scope: !37, file: !38, line: 63, baseType: !43, size: 64, align: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "log_id_len", scope: !37, file: !38, line: 64, baseType: !46, size: 64, align: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !37, file: !38, line: 70, baseType: !52, size: 64, align: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !53, line: 55, baseType: !48)
!53 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !37, file: !38, line: 71, baseType: !43, size: 64, align: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ext_len", scope: !37, file: !38, line: 72, baseType: !46, size: 64, align: 64, offset: 448)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "hash_alg", scope: !37, file: !38, line: 73, baseType: !44, size: 8, align: 8, offset: 512)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "sig_alg", scope: !37, file: !38, line: 74, baseType: !44, size: 8, align: 8, offset: 520)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !37, file: !38, line: 75, baseType: !43, size: 64, align: 64, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "sig_len", scope: !37, file: !38, line: 76, baseType: !46, size: 64, align: 64, offset: 640)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "entry_type", scope: !37, file: !38, line: 78, baseType: !61, size: 32, align: 32, offset: 704)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "ct_log_entry_type_t", file: !4, line: 35, baseType: !14)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !37, file: !38, line: 80, baseType: !63, size: 32, align: 32, offset: 736)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "sct_source_t", file: !4, line: 47, baseType: !3)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "validation_status", scope: !37, file: !38, line: 82, baseType: !65, size: 32, align: 32, offset: 768)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "sct_validation_status_t", file: !4, line: 56, baseType: !19)
!66 = !{!67}
!67 = distinct !DIGlobalVariable(name: "v3_ct_scts", scope: !0, file: !68, line: 78, type: !69, isLocal: false, isDefinition: true, variable: [3 x %struct.v3_ext_method]* @v3_ct_scts)
!68 = !DIFile(filename: "crypto/ct/ct_x509v3.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 2496, align: 64, elements: !190)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_METHOD", file: !72, line: 92, baseType: !73)
!72 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_method", file: !72, line: 49, size: 832, align: 64, elements: !74)
!74 = !{!75, !77, !78, !85, !90, !95, !104, !110, !119, !169, !174, !179, !187, !189}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ext_nid", scope: !73, file: !72, line: 50, baseType: !76, size: 32, align: 32)
!76 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !73, file: !72, line: 51, baseType: !76, size: 32, align: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !73, file: !72, line: 53, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !81, line: 318, baseType: !82)
!81 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !36, line: 62, baseType: !84)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !36, line: 62, flags: DIFlagFwdDecl)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ext_new", scope: !73, file: !72, line: 55, baseType: !86, size: 64, align: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_NEW", file: !72, line: 28, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!28}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ext_free", scope: !73, file: !72, line: 56, baseType: !91, size: 64, align: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_FREE", file: !72, line: 29, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !28}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d2i", scope: !73, file: !72, line: 57, baseType: !96, size: 64, align: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_D2I", file: !72, line: 30, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!28, !28, !100, !103}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!103 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "i2d", scope: !73, file: !72, line: 58, baseType: !105, size: 64, align: 64, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2D", file: !72, line: 31, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!76, !28, !109}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "i2s", scope: !73, file: !72, line: 60, baseType: !111, size: 64, align: 64, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2S", file: !72, line: 38, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!115, !117, !28}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "s2i", scope: !73, file: !72, line: 61, baseType: !120, size: 64, align: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_S2I", file: !72, line: 40, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!28, !117, !124, !151}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_ctx", file: !72, line: 79, size: 448, align: 64, elements: !126)
!126 = !{!127, !128, !132, !133, !138, !142, !168}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !125, file: !72, line: 82, baseType: !76, size: 32, align: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_cert", scope: !125, file: !72, line: 83, baseType: !129, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !36, line: 124, baseType: !131)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !36, line: 124, flags: DIFlagFwdDecl)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "subject_cert", scope: !125, file: !72, line: 84, baseType: !129, size: 64, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "subject_req", scope: !125, file: !72, line: 85, baseType: !134, size: 64, align: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_REQ", file: !136, line: 93, baseType: !137)
!136 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_req_st", file: !136, line: 93, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !125, file: !72, line: 86, baseType: !139, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL", file: !36, line: 126, baseType: !141)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_st", file: !36, line: 126, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "db_meth", scope: !125, file: !72, line: 87, baseType: !143, size: 64, align: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_CONF_METHOD", file: !72, line: 76, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509V3_CONF_METHOD_st", file: !72, line: 71, size: 256, align: 64, elements: !146)
!146 = !{!147, !153, !160, !164}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "get_string", scope: !145, file: !72, line: 72, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!115, !28, !151, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "get_section", scope: !145, file: !72, line: 73, baseType: !154, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!157, !28, !151}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_VALUE", file: !159, line: 30, flags: DIFlagFwdDecl)
!159 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!160 = !DIDerivedType(tag: DW_TAG_member, name: "free_string", scope: !145, file: !72, line: 74, baseType: !161, size: 64, align: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !28, !115}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "free_section", scope: !145, file: !72, line: 75, baseType: !165, size: 64, align: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !28, !157}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !125, file: !72, line: 88, baseType: !28, size: 64, align: 64, offset: 384)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "i2v", scope: !73, file: !72, line: 63, baseType: !170, size: 64, align: 64, offset: 512)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2V", file: !72, line: 33, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!157, !117, !28, !157}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "v2i", scope: !73, file: !72, line: 64, baseType: !175, size: 64, align: 64, offset: 576)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_V2I", file: !72, line: 35, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!28, !117, !124, !157}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "i2r", scope: !73, file: !72, line: 66, baseType: !180, size: 64, align: 64, offset: 640)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2R", file: !72, line: 42, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!76, !117, !28, !184, !76}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !36, line: 79, baseType: !186)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !36, line: 79, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "r2i", scope: !73, file: !72, line: 67, baseType: !188, size: 64, align: 64, offset: 704)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_R2I", file: !72, line: 44, baseType: !121)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "usr_data", scope: !73, file: !72, line: 68, baseType: !28, size: 64, align: 64, offset: 768)
!190 = !{!191}
!191 = !DISubrange(count: 3)
!192 = !{i32 2, !"Dwarf Version", i32 4}
!193 = !{i32 2, !"Debug Info Version", i32 3}
!194 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!195 = distinct !DISubprogram(name: "x509_ext_d2i_SCT_LIST", scope: !68, file: !68, line: 49, type: !196, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !201)
!196 = !DISubroutineType(types: !197)
!197 = !{!198, !200, !100, !103}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_SCT", file: !4, line: 58, flags: DIFlagFwdDecl)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!201 = !{}
!202 = !DILocalVariable(name: "a", arg: 1, scope: !195, file: !68, line: 49, type: !200)
!203 = !DIExpression()
!204 = !DILocation(line: 49, column: 73, scope: !195)
!205 = !DILocalVariable(name: "pp", arg: 2, scope: !195, file: !68, line: 50, type: !100)
!206 = !DILocation(line: 50, column: 67, scope: !195)
!207 = !DILocalVariable(name: "len", arg: 3, scope: !195, file: !68, line: 51, type: !103)
!208 = !DILocation(line: 51, column: 50, scope: !195)
!209 = !DILocalVariable(name: "s", scope: !195, file: !68, line: 53, type: !198)
!210 = !DILocation(line: 53, column: 27, scope: !195)
!211 = !DILocation(line: 53, column: 44, scope: !195)
!212 = !DILocation(line: 53, column: 47, scope: !195)
!213 = !DILocation(line: 53, column: 51, scope: !195)
!214 = !DILocation(line: 53, column: 31, scope: !195)
!215 = !DILocation(line: 55, column: 30, scope: !216)
!216 = distinct !DILexicalBlock(scope: !195, file: !68, line: 55, column: 10)
!217 = !DILocation(line: 55, column: 10, scope: !216)
!218 = !DILocation(line: 55, column: 62, scope: !216)
!219 = !DILocation(line: 55, column: 10, scope: !195)
!220 = !DILocation(line: 56, column: 24, scope: !221)
!221 = distinct !DILexicalBlock(scope: !216, file: !68, line: 55, column: 68)
!222 = !DILocation(line: 56, column: 10, scope: !221)
!223 = !DILocation(line: 57, column: 11, scope: !221)
!224 = !DILocation(line: 57, column: 13, scope: !221)
!225 = !DILocation(line: 58, column: 10, scope: !221)
!226 = !DILocation(line: 60, column: 13, scope: !195)
!227 = !DILocation(line: 60, column: 6, scope: !195)
!228 = !DILocation(line: 61, column: 1, scope: !195)
!229 = distinct !DISubprogram(name: "i2r_SCT_LIST", scope: !68, file: !68, line: 26, type: !230, isLocal: true, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !201)
!230 = !DISubroutineType(types: !231)
!231 = !{!76, !232, !198, !184, !76}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!233 = !DILocalVariable(name: "method", arg: 1, scope: !229, file: !68, line: 26, type: !232)
!234 = !DILocation(line: 26, column: 44, scope: !229)
!235 = !DILocalVariable(name: "sct_list", arg: 2, scope: !229, file: !68, line: 26, type: !198)
!236 = !DILocation(line: 26, column: 73, scope: !229)
!237 = !DILocalVariable(name: "out", arg: 3, scope: !229, file: !68, line: 27, type: !184)
!238 = !DILocation(line: 27, column: 23, scope: !229)
!239 = !DILocalVariable(name: "indent", arg: 4, scope: !229, file: !68, line: 27, type: !76)
!240 = !DILocation(line: 27, column: 32, scope: !229)
!241 = !DILocation(line: 29, column: 20, scope: !229)
!242 = !DILocation(line: 29, column: 30, scope: !229)
!243 = !DILocation(line: 29, column: 35, scope: !229)
!244 = !DILocation(line: 29, column: 5, scope: !229)
!245 = !DILocation(line: 30, column: 5, scope: !229)
!246 = distinct !DISubprogram(name: "i2s_poison", scope: !68, file: !68, line: 16, type: !247, isLocal: true, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !201)
!247 = !DISubroutineType(types: !248)
