; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--blake2--libcrypto-shlib-blake2b.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--blake2--libcrypto-shlib-blake2b.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.anon = type { i64 }
%union.anon.0 = type { i64 }
%union.anon.1 = type { i64 }
%struct.blake2b_param_st = type { i8, i8, i8, i8, [4 x i8], [8 x i8], i8, i8, [14 x i8], [16 x i8], [16 x i8] }
%struct.blake2b_ctx_st = type { [8 x i64], [2 x i64], [2 x i64], [128 x i8], i64, i64 }

@store32.is_endian = internal constant %union.anon { i64 1 }, align 8
@store64.is_endian = internal constant %union.anon.0 { i64 1 }, align 8
@blake2b_IV = internal constant [8 x i64] [i64 7640891576956012808, i64 -4942790177534073029, i64 4354685564936845355, i64 -6534734903238641935, i64 5840696475078001361, i64 -7276294671716946913, i64 2270897969802886507, i64 6620516959819538809], align 16
@load64.is_endian = internal constant %union.anon.1 { i64 1 }, align 8

!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--blake2--libcrypto-shlib-blake2b.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{}
!3 = !{!4, !5, !8, !10}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !6, line: 48, baseType: !7)
!6 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!7 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !6, line: 55, baseType: !11)
!11 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!12 = !{!13, !27, !36, !42, !51}
!13 = distinct !DIGlobalVariable(name: "is_endian", scope: !14, file: !15, line: 68, type: !20, isLocal: true, isDefinition: true, variable: %union.anon* @store32.is_endian)
!14 = distinct !DISubprogram(name: "store32", scope: !15, file: !15, line: 63, type: !16, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!15 = !DIFile(filename: "crypto/blake2/blake2_impl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!16 = !DISubroutineType(types: !17)
!17 = !{null, !4, !18}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !6, line: 51, baseType: !19)
!19 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!21 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !15, line: 65, size: 64, align: 64, elements: !22)
!22 = !{!23, !25}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "one", scope: !21, file: !15, line: 66, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "little", scope: !21, file: !15, line: 67, baseType: !26, size: 8, align: 8)
!26 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!27 = distinct !DIGlobalVariable(name: "is_endian", scope: !28, file: !15, line: 86, type: !31, isLocal: true, isDefinition: true, variable: %union.anon.0* @store64.is_endian)
!28 = distinct !DISubprogram(name: "store64", scope: !15, file: !15, line: 81, type: !29, isLocal: true, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!29 = !DISubroutineType(types: !30)
!30 = !{null, !4, !10}
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !28, file: !15, line: 83, size: 64, align: 64, elements: !33)
!33 = !{!34, !35}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "one", scope: !32, file: !15, line: 84, baseType: !24, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "little", scope: !32, file: !15, line: 85, baseType: !26, size: 8, align: 8)
!36 = distinct !DIGlobalVariable(name: "blake2b_IV", scope: !0, file: !37, line: 24, type: !38, isLocal: true, isDefinition: true, variable: [8 x i64]* @blake2b_IV)
!37 = !DIFile(filename: "crypto/blake2/blake2b.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 512, align: 64, elements: !40)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!40 = !{!41}
!41 = !DISubrange(count: 8)
!42 = distinct !DIGlobalVariable(name: "is_endian", scope: !43, file: !15, line: 44, type: !46, isLocal: true, isDefinition: true, variable: %union.anon.1* @load64.is_endian)
!43 = distinct !DISubprogram(name: "load64", scope: !15, file: !15, line: 39, type: !44, isLocal: true, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!44 = !DISubroutineType(types: !45)
!45 = !{!10, !8}
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !43, file: !15, line: 41, size: 64, align: 64, elements: !48)
!48 = !{!49, !50}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "one", scope: !47, file: !15, line: 42, baseType: !24, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "little", scope: !47, file: !15, line: 43, baseType: !26, size: 8, align: 8)
!51 = distinct !DIGlobalVariable(name: "blake2b_sigma", scope: !0, file: !37, line: 32, type: !52, isLocal: true, isDefinition: true, variable: [12 x [16 x i8]]* @blake2b_sigma)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1536, align: 8, elements: !53)
!53 = !{!54, !55}
!54 = !DISubrange(count: 12)
!55 = !DISubrange(count: 16)
!56 = !{i32 2, !"Dwarf Version", i32 4}
!57 = !{i32 2, !"Debug Info Version", i32 3}
!58 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!59 = distinct !DISubprogram(name: "blake2b_param_init", scope: !37, file: !37, line: 84, type: !60, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !62}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLAKE2B_PARAM", file: !64, line: 69, baseType: !65)
!64 = !DIFile(filename: "crypto/blake2/blake2_locl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blake2b_param_st", file: !64, line: 55, size: 512, align: 8, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !75, !77, !78, !79, !83, !86}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "digest_length", scope: !65, file: !64, line: 56, baseType: !5, size: 8, align: 8)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "key_length", scope: !65, file: !64, line: 57, baseType: !5, size: 8, align: 8, offset: 8)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "fanout", scope: !65, file: !64, line: 58, baseType: !5, size: 8, align: 8, offset: 16)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !65, file: !64, line: 59, baseType: !5, size: 8, align: 8, offset: 24)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "leaf_length", scope: !65, file: !64, line: 60, baseType: !72, size: 32, align: 8, offset: 32)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 32, align: 8, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 4)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "node_offset", scope: !65, file: !64, line: 61, baseType: !76, size: 64, align: 8, offset: 64)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, align: 8, elements: !40)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "node_depth", scope: !65, file: !64, line: 62, baseType: !5, size: 8, align: 8, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "inner_length", scope: !65, file: !64, line: 63, baseType: !5, size: 8, align: 8, offset: 136)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !65, file: !64, line: 64, baseType: !80, size: 112, align: 8, offset: 144)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 112, align: 8, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 14)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "salt", scope: !65, file: !64, line: 65, baseType: !84, size: 128, align: 8, offset: 256)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 128, align: 8, elements: !85)
!85 = !{!55}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "personal", scope: !65, file: !64, line: 66, baseType: !84, size: 128, align: 8, offset: 384)
!87 = !DILocalVariable(name: "P", arg: 1, scope: !59, file: !37, line: 84, type: !62)
!88 = !DIExpression()
!89 = !DILocation(line: 84, column: 40, scope: !59)
!90 = !DILocation(line: 86, column: 5, scope: !59)
!91 = !DILocation(line: 86, column: 8, scope: !59)
!92 = !DILocation(line: 86, column: 22, scope: !59)
!93 = !DILocation(line: 87, column: 5, scope: !59)
!94 = !DILocation(line: 87, column: 8, scope: !59)
!95 = !DILocation(line: 87, column: 19, scope: !59)
!96 = !DILocation(line: 88, column: 5, scope: !59)
!97 = !DILocation(line: 88, column: 8, scope: !59)
!98 = !DILocation(line: 88, column: 15, scope: !59)
!99 = !DILocation(line: 89, column: 5, scope: !59)
!100 = !DILocation(line: 89, column: 8, scope: !59)
!101 = !DILocation(line: 89, column: 14, scope: !59)
!102 = !DILocation(line: 90, column: 13, scope: !59)
!103 = !DILocation(line: 90, column: 16, scope: !59)
!104 = !DILocation(line: 90, column: 5, scope: !59)
!105 = !DILocation(line: 91, column: 13, scope: !59)
!106 = !DILocation(line: 91, column: 16, scope: !59)
!107 = !DILocation(line: 91, column: 5, scope: !59)
!108 = !DILocation(line: 92, column: 5, scope: !59)
!109 = !DILocation(line: 92, column: 8, scope: !59)
!110 = !DILocation(line: 92, column: 19, scope: !59)
!111 = !DILocation(line: 93, column: 5, scope: !59)
!112 = !DILocation(line: 93, column: 8, scope: !59)
!113 = !DILocation(line: 93, column: 21, scope: !59)
!114 = !DILocation(line: 94, column: 12, scope: !59)
!115 = !DILocation(line: 94, column: 15, scope: !59)
!116 = !DILocation(line: 94, column: 5, scope: !59)
!117 = !DILocation(line: 95, column: 12, scope: !59)
!118 = !DILocation(line: 95, column: 15, scope: !59)
!119 = !DILocation(line: 95, column: 5, scope: !59)
!120 = !DILocation(line: 96, column: 12, scope: !59)
!121 = !DILocation(line: 96, column: 15, scope: !59)
!122 = !DILocation(line: 96, column: 5, scope: !59)
!123 = !DILocation(line: 97, column: 1, scope: !59)
!124 = !DILocalVariable(name: "dst", arg: 1, scope: !14, file: !15, line: 63, type: !4)
!125 = !DILocation(line: 63, column: 37, scope: !14)
!126 = !DILocalVariable(name: "w", arg: 2, scope: !14, file: !15, line: 63, type: !18)
!127 = !DILocation(line: 63, column: 51, scope: !14)
!128 = !DILocation(line: 70, column: 19, scope: !129)
!129 = distinct !DILexicalBlock(scope: !14, file: !15, line: 70, column: 9)
!130 = !DILocation(line: 70, column: 9, scope: !129)
!131 = !DILocation(line: 70, column: 9, scope: !14)
!132 = !DILocation(line: 71, column: 16, scope: !133)
!133 = distinct !DILexicalBlock(scope: !129, file: !15, line: 70, column: 27)
!134 = !DILocation(line: 71, column: 9, scope: !133)
!135 = !DILocation(line: 72, column: 5, scope: !133)
!136 = !DILocalVariable(name: "p", scope: !137, file: !15, line: 73, type: !4)
!137 = distinct !DILexicalBlock(scope: !129, file: !15, line: 72, column: 12)
!138 = !DILocation(line: 73, column: 18, scope: !137)
!139 = !DILocation(line: 73, column: 33, scope: !137)
!140 = !DILocalVariable(name: "i", scope: !137, file: !15, line: 74, type: !141)
!141 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!142 = !DILocation(line: 74, column: 13, scope: !137)
!143 = !DILocation(line: 76, column: 16, scope: !144)
!144 = distinct !DILexicalBlock(scope: !137, file: !15, line: 76, column: 9)
!145 = !DILocation(line: 76, column: 14, scope: !144)
!146 = !DILocation(line: 76, column: 21, scope: !147)
!147 = !DILexicalBlockFile(scope: !148, file: !15, discriminator: 1)
!148 = distinct !DILexicalBlock(scope: !144, file: !15, line: 76, column: 9)
!149 = !DILocation(line: 76, column: 23, scope: !147)
!150 = !DILocation(line: 76, column: 9, scope: !147)
!151 = !DILocation(line: 77, column: 30, scope: !148)
!152 = !DILocation(line: 77, column: 40, scope: !148)
!153 = !DILocation(line: 77, column: 38, scope: !148)
!154 = !DILocation(line: 77, column: 32, scope: !148)
!155 = !DILocation(line: 77, column: 20, scope: !148)
!156 = !DILocation(line: 77, column: 15, scope: !148)
!157 = !DILocation(line: 77, column: 13, scope: !148)
!158 = !DILocation(line: 77, column: 18, scope: !148)
!159 = !DILocation(line: 76, column: 29, scope: !160)
!160 = !DILexicalBlockFile(scope: !148, file: !15, discriminator: 2)
!161 = !DILocation(line: 76, column: 9, scope: !160)
!162 = distinct !{!162, !163}
!163 = !DILocation(line: 76, column: 9, scope: !137)
!164 = !DILocation(line: 79, column: 1, scope: !14)
!165 = !DILocalVariable(name: "dst", arg: 1, scope: !28, file: !15, line: 81, type: !4)
!166 = !DILocation(line: 81, column: 37, scope: !28)
!167 = !DILocalVariable(name: "w", arg: 2, scope: !28, file: !15, line: 81, type: !10)
!168 = !DILocation(line: 81, column: 51, scope: !28)
!169 = !DILocation(line: 88, column: 19, scope: !170)
!170 = distinct !DILexicalBlock(scope: !28, file: !15, line: 88, column: 9)
!171 = !DILocation(line: 88, column: 9, scope: !170)
!172 = !DILocation(line: 88, column: 9, scope: !28)
!173 = !DILocation(line: 89, column: 16, scope: !174)
!174 = distinct !DILexicalBlock(scope: !170, file: !15, line: 88, column: 27)
!175 = !DILocation(line: 89, column: 9, scope: !174)
!176 = !DILocation(line: 90, column: 5, scope: !174)
!177 = !DILocalVariable(name: "p", scope: !178, file: !15, line: 91, type: !4)
!178 = distinct !DILexicalBlock(scope: !170, file: !15, line: 90, column: 12)
!179 = !DILocation(line: 91, column: 18, scope: !178)
!180 = !DILocation(line: 91, column: 33, scope: !178)
!181 = !DILocalVariable(name: "i", scope: !178, file: !15, line: 92, type: !141)
!182 = !DILocation(line: 92, column: 13, scope: !178)
!183 = !DILocation(line: 94, column: 16, scope: !184)
!184 = distinct !DILexicalBlock(scope: !178, file: !15, line: 94, column: 9)
!185 = !DILocation(line: 94, column: 14, scope: !184)
!186 = !DILocation(line: 94, column: 21, scope: !187)
!187 = !DILexicalBlockFile(scope: !188, file: !15, discriminator: 1)
!188 = distinct !DILexicalBlock(scope: !184, file: !15, line: 94, column: 9)
!189 = !DILocation(line: 94, column: 23, scope: !187)
!190 = !DILocation(line: 94, column: 9, scope: !187)
!191 = !DILocation(line: 95, column: 30, scope: !188)
!192 = !DILocation(line: 95, column: 40, scope: !188)
!193 = !DILocation(line: 95, column: 38, scope: !188)
!194 = !DILocation(line: 95, column: 32, scope: !188)
!195 = !DILocation(line: 95, column: 20, scope: !188)
!196 = !DILocation(line: 95, column: 15, scope: !188)
!197 = !DILocation(line: 95, column: 13, scope: !188)
!198 = !DILocation(line: 95, column: 18, scope: !188)
!199 = !DILocation(line: 94, column: 29, scope: !200)
!200 = !DILexicalBlockFile(scope: !188, file: !15, discriminator: 2)
!201 = !DILocation(line: 94, column: 9, scope: !200)
!202 = distinct !{!202, !203}
!203 = !DILocation(line: 94, column: 9, scope: !178)
!204 = !DILocation(line: 97, column: 1, scope: !28)
!205 = distinct !DISubprogram(name: "blake2b_param_set_digest_length", scope: !37, file: !37, line: 99, type: !206, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !62, !5}
!208 = !DILocalVariable(name: "P", arg: 1, scope: !205, file: !37, line: 99, type: !62)
!209 = !DILocation(line: 99, column: 53, scope: !205)
!210 = !DILocalVariable(name: "outlen", arg: 2, scope: !205, file: !37, line: 99, type: !5)
!211 = !DILocation(line: 99, column: 64, scope: !205)
!212 = !DILocation(line: 101, column: 24, scope: !205)
!213 = !DILocation(line: 101, column: 5, scope: !205)
!214 = !DILocation(line: 101, column: 8, scope: !205)
!215 = !DILocation(line: 101, column: 22, scope: !205)
!216 = !DILocation(line: 102, column: 1, scope: !205)
!217 = distinct !DISubprogram(name: "blake2b_param_set_key_length", scope: !37, file: !37, line: 104, type: !206, isLocal: false, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!218 = !DILocalVariable(name: "P", arg: 1, scope: !217, file: !37, line: 104, type: !62)
!219 = !DILocation(line: 104, column: 50, scope: !217)
!220 = !DILocalVariable(name: "keylen", arg: 2, scope: !217, file: !37, line: 104, type: !5)
!221 = !DILocation(line: 104, column: 61, scope: !217)
!222 = !DILocation(line: 106, column: 21, scope: !217)
!223 = !DILocation(line: 106, column: 5, scope: !217)
!224 = !DILocation(line: 106, column: 8, scope: !217)
!225 = !DILocation(line: 106, column: 19, scope: !217)
!226 = !DILocation(line: 107, column: 1, scope: !217)
!227 = distinct !DISubprogram(name: "blake2b_param_set_personal", scope: !37, file: !37, line: 109, type: !228, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !62, !8, !230}
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !231, line: 216, baseType: !11)
!231 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!232 = !DILocalVariable(name: "P", arg: 1, scope: !227, file: !37, line: 109, type: !62)
!233 = !DILocation(line: 109, column: 48, scope: !227)
!234 = !DILocalVariable(name: "personal", arg: 2, scope: !227, file: !37, line: 109, type: !8)
!235 = !DILocation(line: 109, column: 66, scope: !227)
!236 = !DILocalVariable(name: "len", arg: 3, scope: !227, file: !37, line: 109, type: !230)
!237 = !DILocation(line: 109, column: 83, scope: !227)
!238 = !DILocation(line: 111, column: 12, scope: !227)
!239 = !DILocation(line: 111, column: 15, scope: !227)
!240 = !DILocation(line: 111, column: 5, scope: !227)
!241 = !DILocation(line: 111, column: 25, scope: !227)
!242 = !DILocation(line: 111, column: 35, scope: !227)
!243 = !DILocation(line: 112, column: 12, scope: !227)
!244 = !DILocation(line: 112, column: 15, scope: !227)
!245 = !DILocation(line: 112, column: 26, scope: !227)
!246 = !DILocation(line: 112, column: 24, scope: !227)
!247 = !DILocation(line: 112, column: 39, scope: !227)
!248 = !DILocation(line: 112, column: 37, scope: !227)
!249 = !DILocation(line: 112, column: 5, scope: !227)
!250 = !DILocation(line: 113, column: 1, scope: !227)
!251 = distinct !DISubprogram(name: "blake2b_param_set_salt", scope: !37, file: !37, line: 115, type: !228, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!252 = !DILocalVariable(name: "P", arg: 1, scope: !251, file: !37, line: 115, type: !62)
!253 = !DILocation(line: 115, column: 44, scope: !251)
!254 = !DILocalVariable(name: "salt", arg: 2, scope: !251, file: !37, line: 115, type: !8)
!255 = !DILocation(line: 115, column: 62, scope: !251)
!256 = !DILocalVariable(name: "len", arg: 3, scope: !251, file: !37, line: 115, type: !230)
!257 = !DILocation(line: 115, column: 75, scope: !251)
!258 = !DILocation(line: 117, column: 12, scope: !251)
!259 = !DILocation(line: 117, column: 15, scope: !251)
!260 = !DILocation(line: 117, column: 5, scope: !251)
!261 = !DILocation(line: 117, column: 21, scope: !251)
!262 = !DILocation(line: 117, column: 27, scope: !251)
!263 = !DILocation(line: 118, column: 12, scope: !251)
!264 = !DILocation(line: 118, column: 15, scope: !251)
!265 = !DILocation(line: 118, column: 22, scope: !251)
!266 = !DILocation(line: 118, column: 20, scope: !251)
!267 = !DILocation(line: 118, column: 35, scope: !251)
!268 = !DILocation(line: 118, column: 33, scope: !251)
!269 = !DILocation(line: 118, column: 5, scope: !251)
!270 = !DILocation(line: 119, column: 1, scope: !251)
!271 = distinct !DISubprogram(name: "BLAKE2b_Init", scope: !37, file: !37, line: 125, type: !272, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!272 = !DISubroutineType(types: !273)
!273 = !{!141, !274, !291}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLAKE2B_CTX", file: !64, line: 84, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blake2b_ctx_st", file: !64, line: 71, size: 1920, align: 64, elements: !277)
!277 = !{!278, !280, !284, !285, !289, !290}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !276, file: !64, line: 72, baseType: !279, size: 512, align: 64)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 512, align: 64, elements: !40)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !276, file: !64, line: 73, baseType: !281, size: 128, align: 64, offset: 512)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 128, align: 64, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 2)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !276, file: !64, line: 74, baseType: !281, size: 128, align: 64, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !276, file: !64, line: 75, baseType: !286, size: 1024, align: 8, offset: 768)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 1024, align: 8, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !276, file: !64, line: 76, baseType: !230, size: 64, align: 64, offset: 1792)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "outlen", scope: !276, file: !64, line: 77, baseType: !230, size: 64, align: 64, offset: 1856)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!293 = !DILocalVariable(name: "c", arg: 1, scope: !271, file: !37, line: 125, type: !274)
!294 = !DILocation(line: 125, column: 31, scope: !271)
!295 = !DILocalVariable(name: "P", arg: 2, scope: !271, file: !37, line: 125, type: !291)
!296 = !DILocation(line: 125, column: 55, scope: !271)
!297 = !DILocation(line: 127, column: 24, scope: !271)
!298 = !DILocation(line: 127, column: 27, scope: !271)
!299 = !DILocation(line: 127, column: 5, scope: !271)
!300 = !DILocation(line: 128, column: 5, scope: !271)
!301 = distinct !DISubprogram(name: "blake2b_init_param", scope: !37, file: !37, line: 66, type: !302, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !274, !291}
!304 = !DILocalVariable(name: "S", arg: 1, scope: !301, file: !37, line: 66, type: !274)
!305 = !DILocation(line: 66, column: 45, scope: !301)
!306 = !DILocalVariable(name: "P", arg: 2, scope: !301, file: !37, line: 66, type: !291)
!307 = !DILocation(line: 66, column: 69, scope: !301)
!308 = !DILocalVariable(name: "i", scope: !301, file: !37, line: 68, type: !230)
!309 = !DILocation(line: 68, column: 12, scope: !301)
!310 = !DILocalVariable(name: "p", scope: !301, file: !37, line: 69, type: !8)
!311 = !DILocation(line: 69, column: 20, scope: !301)
!312 = !DILocation(line: 69, column: 42, scope: !301)
!313 = !DILocation(line: 69, column: 24, scope: !301)
!314 = !DILocation(line: 71, column: 19, scope: !301)
!315 = !DILocation(line: 71, column: 5, scope: !301)
!316 = !DILocation(line: 72, column: 17, scope: !301)
!317 = !DILocation(line: 72, column: 20, scope: !301)
!318 = !DILocation(line: 72, column: 5, scope: !301)
!319 = !DILocation(line: 72, column: 8, scope: !301)
!320 = !DILocation(line: 72, column: 15, scope: !301)
!321 = !DILocation(line: 78, column: 12, scope: !322)
!322 = distinct !DILexicalBlock(scope: !301, file: !37, line: 78, column: 5)
!323 = !DILocation(line: 78, column: 10, scope: !322)
!324 = !DILocation(line: 78, column: 17, scope: !325)
!325 = !DILexicalBlockFile(scope: !326, file: !37, discriminator: 1)
!326 = distinct !DILexicalBlock(scope: !322, file: !37, line: 78, column: 5)
!327 = !DILocation(line: 78, column: 19, scope: !325)
!328 = !DILocation(line: 78, column: 5, scope: !325)
!329 = !DILocation(line: 79, column: 27, scope: !330)
!330 = distinct !DILexicalBlock(scope: !326, file: !37, line: 78, column: 29)
!331 = !DILocation(line: 79, column: 49, scope: !330)
!332 = !DILocation(line: 79, column: 47, scope: !330)
!333 = !DILocation(line: 79, column: 29, scope: !330)
!334 = !DILocation(line: 79, column: 20, scope: !330)
!335 = !DILocation(line: 79, column: 14, scope: !330)
!336 = !DILocation(line: 79, column: 9, scope: !330)
!337 = !DILocation(line: 79, column: 12, scope: !330)
!338 = !DILocation(line: 79, column: 17, scope: !330)
!339 = !DILocation(line: 80, column: 5, scope: !330)
!340 = !DILocation(line: 78, column: 24, scope: !341)
!341 = !DILexicalBlockFile(scope: !326, file: !37, discriminator: 2)
!342 = !DILocation(line: 78, column: 5, scope: !341)
!343 = distinct !{!343, !344}
!344 = !DILocation(line: 78, column: 5, scope: !301)
!345 = !DILocation(line: 81, column: 1, scope: !301)
!346 = distinct !DISubprogram(name: "BLAKE2b_Init_key", scope: !37, file: !37, line: 135, type: !347, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!347 = !DISubroutineType(types: !348)
!348 = !{!141, !274, !291, !349}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
