; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--asn1--libcrypto-shlib-p5_pbe.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--asn1--libcrypto-shlib-p5_pbe.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.PBEPARAM_st = type { %struct.asn1_string_st*, %struct.asn1_string_st* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.ASN1_VALUE_st = type opaque
%struct.X509_algor_st = type { %struct.asn1_object_st*, %struct.asn1_type_st* }
%struct.asn1_object_st = type opaque
%struct.asn1_type_st = type { i32, %union.anon }
%union.anon = type { i8* }

@PBEPARAM_seq_tt = internal constant [2 x %struct.ASN1_TEMPLATE_st] [%struct.ASN1_TEMPLATE_st { i64 0, i64 0, i64 0, i8* getelementptr inbounds ([5 x i8], [5 x i8]* @.str.2, i32 0, i32 0), %struct.ASN1_ITEM_st* @ASN1_OCTET_STRING_it }, %struct.ASN1_TEMPLATE_st { i64 0, i64 0, i64 8, i8* getelementptr inbounds ([5 x i8], [5 x i8]* @.str.3, i32 0, i32 0), %struct.ASN1_ITEM_st* @ASN1_INTEGER_it }], align 16
@.str = private unnamed_addr constant [9 x i8] c"PBEPARAM\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !32)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--asn1--libcrypto-shlib-p5_pbe.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{}
!3 = !{!4, !27, !28, !31}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "PBEPARAM", file: !6, line: 289, baseType: !7)
!6 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PBEPARAM_st", file: !6, line: 286, size: 128, align: 64, elements: !8)
!8 = !{!9, !24}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "salt", scope: !7, file: !6, line: 287, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !12, line: 43, baseType: !13)
!12 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !14, line: 146, size: 192, align: 64, elements: !15)
!14 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!15 = !{!16, !18, !19, !22}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !13, file: !14, line: 147, baseType: !17, size: 32, align: 32)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !13, file: !14, line: 148, baseType: !17, size: 32, align: 32, offset: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !13, file: !14, line: 149, baseType: !20, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !13, file: !14, line: 155, baseType: !23, size: 64, align: 64, offset: 128)
!23 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !7, file: !6, line: 288, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !12, line: 40, baseType: !13)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !14, line: 213, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !14, line: 213, flags: DIFlagFwdDecl)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!32 = !{!33, !65}
!33 = distinct !DIGlobalVariable(name: "PBEPARAM_it", scope: !0, file: !34, line: 21, type: !35, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @PBEPARAM_it)
!34 = !DIFile(filename: "crypto/asn1/p5_pbe.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !12, line: 62, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !38, line: 580, size: 448, align: 64, elements: !39)
!38 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!39 = !{!40, !42, !43, !59, !60, !63, !64}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !37, file: !38, line: 581, baseType: !41, size: 8, align: 8)
!41 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !37, file: !38, line: 583, baseType: !23, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !37, file: !38, line: 584, baseType: !44, size: 64, align: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !14, line: 210, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !38, line: 468, size: 320, align: 64, elements: !48)
!48 = !{!49, !51, !52, !53, !56}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !47, file: !38, line: 469, baseType: !50, size: 64, align: 64)
!50 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !47, file: !38, line: 470, baseType: !23, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !47, file: !38, line: 471, baseType: !50, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !47, file: !38, line: 472, baseType: !54, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !47, file: !38, line: 473, baseType: !57, size: 64, align: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !14, line: 318, baseType: !35)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !37, file: !38, line: 586, baseType: !23, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !37, file: !38, line: 587, baseType: !61, size: 64, align: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !37, file: !38, line: 588, baseType: !23, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !37, file: !38, line: 589, baseType: !54, size: 64, align: 64, offset: 384)
!65 = distinct !DIGlobalVariable(name: "PBEPARAM_seq_tt", scope: !0, file: !34, line: 18, type: !66, isLocal: true, isDefinition: true, variable: [2 x %struct.ASN1_TEMPLATE_st]* @PBEPARAM_seq_tt)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 640, align: 64, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 2)
!69 = !{i32 2, !"Dwarf Version", i32 4}
!70 = !{i32 2, !"Debug Info Version", i32 3}
!71 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!72 = distinct !DISubprogram(name: "d2i_PBEPARAM", scope: !34, file: !34, line: 23, type: !73, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!73 = !DISubroutineType(types: !74)
!74 = !{!4, !75, !76, !23}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!79 = !DILocalVariable(name: "a", arg: 1, scope: !72, file: !34, line: 23, type: !75)
!80 = !DIExpression()
!81 = !DILocation(line: 23, column: 35, scope: !72)
!82 = !DILocalVariable(name: "in", arg: 2, scope: !72, file: !34, line: 23, type: !76)
!83 = !DILocation(line: 23, column: 60, scope: !72)
!84 = !DILocalVariable(name: "len", arg: 3, scope: !72, file: !34, line: 23, type: !23)
!85 = !DILocation(line: 23, column: 69, scope: !72)
!86 = !DILocation(line: 23, column: 124, scope: !72)
!87 = !DILocation(line: 23, column: 109, scope: !72)
!88 = !DILocation(line: 23, column: 127, scope: !72)
!89 = !DILocation(line: 23, column: 131, scope: !72)
!90 = !DILocation(line: 23, column: 95, scope: !72)
!91 = !DILocation(line: 23, column: 83, scope: !72)
!92 = !DILocation(line: 23, column: 76, scope: !72)
!93 = distinct !DISubprogram(name: "i2d_PBEPARAM", scope: !34, file: !34, line: 23, type: !94, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!94 = !DISubroutineType(types: !95)
!95 = !{!17, !4, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!97 = !DILocalVariable(name: "a", arg: 1, scope: !93, file: !34, line: 23, type: !4)
!98 = !DILocation(line: 23, column: 184, scope: !93)
!99 = !DILocalVariable(name: "out", arg: 2, scope: !93, file: !34, line: 23, type: !96)
!100 = !DILocation(line: 23, column: 203, scope: !93)
!101 = !DILocation(line: 23, column: 245, scope: !93)
!102 = !DILocation(line: 23, column: 231, scope: !93)
!103 = !DILocation(line: 23, column: 248, scope: !93)
!104 = !DILocation(line: 23, column: 217, scope: !93)
!105 = !DILocation(line: 23, column: 210, scope: !93)
!106 = distinct !DISubprogram(name: "PBEPARAM_new", scope: !34, file: !34, line: 23, type: !107, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!107 = !DISubroutineType(types: !108)
!108 = !{!4}
!109 = !DILocation(line: 23, column: 324, scope: !106)
!110 = !DILocation(line: 23, column: 312, scope: !106)
!111 = !DILocation(line: 23, column: 305, scope: !106)
!112 = distinct !DISubprogram(name: "PBEPARAM_free", scope: !34, file: !34, line: 23, type: !113, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !4}
!115 = !DILocalVariable(name: "a", arg: 1, scope: !112, file: !34, line: 23, type: !4)
!116 = !DILocation(line: 23, column: 388, scope: !112)
!117 = !DILocation(line: 23, column: 422, scope: !112)
!118 = !DILocation(line: 23, column: 408, scope: !112)
!119 = !DILocation(line: 23, column: 393, scope: !112)
!120 = !DILocation(line: 23, column: 444, scope: !112)
!121 = distinct !DISubprogram(name: "PKCS5_pbe_set0_algor", scope: !34, file: !34, line: 27, type: !122, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!122 = !DISubroutineType(types: !123)
!123 = !{!17, !124, !17, !17, !77, !17}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !12, line: 125, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !6, line: 59, size: 128, align: 64, elements: !127)
!127 = !{!128, !132}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !126, file: !6, line: 60, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !12, line: 60, baseType: !131)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !12, line: 60, flags: DIFlagFwdDecl)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !126, file: !6, line: 61, baseType: !133, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !14, line: 473, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !14, line: 444, size: 128, align: 64, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !135, file: !14, line: 445, baseType: !17, size: 32, align: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !135, file: !14, line: 472, baseType: !139, size: 64, align: 64, offset: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !135, file: !14, line: 446, size: 64, align: 64, elements: !140)
!140 = !{!141, !143, !145, !148, !149, !150, !153, !156, !157, !160, !163, !166, !169, !172, !175, !178, !181, !184, !187, !188, !189}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !139, file: !14, line: 447, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !139, file: !14, line: 448, baseType: !144, size: 32, align: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !12, line: 56, baseType: !17)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !139, file: !14, line: 449, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !12, line: 55, baseType: !13)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !139, file: !14, line: 450, baseType: !129, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !139, file: !14, line: 451, baseType: !25, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !139, file: !14, line: 452, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !12, line: 41, baseType: !13)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !139, file: !14, line: 453, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !12, line: 42, baseType: !13)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !139, file: !14, line: 454, baseType: !10, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !139, file: !14, line: 455, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !12, line: 44, baseType: !13)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !139, file: !14, line: 456, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !12, line: 45, baseType: !13)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !139, file: !14, line: 457, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !12, line: 46, baseType: !13)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !139, file: !14, line: 458, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !12, line: 47, baseType: !13)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !139, file: !14, line: 459, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !12, line: 49, baseType: !13)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !139, file: !14, line: 460, baseType: !173, size: 64, align: 64)
