; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--asn1--libcrypto-shlib-bio_asn1.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--asn1--libcrypto-shlib-bio_asn1.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bio_method_st = type { i32, i8*, i32 (%struct.bio_st*, i8*, i64, i64*)*, i32 (%struct.bio_st*, i8*, i32)*, i32 (%struct.bio_st*, i8*, i64, i64*)*, i32 (%struct.bio_st*, i8*, i32)*, i32 (%struct.bio_st*, i8*)*, i32 (%struct.bio_st*, i8*, i32)*, i64 (%struct.bio_st*, i32, i64, i8*)*, i32 (%struct.bio_st*)*, i32 (%struct.bio_st*)*, i64 (%struct.bio_st*, i32, i32 (%struct.bio_st*, i32, i32)*)* }
%struct.bio_st = type opaque
%struct.BIO_ASN1_EX_FUNCS_st = type { i32 (%struct.bio_st*, i8**, i32*, i8*)*, i32 (%struct.bio_st*, i8**, i32*, i8*)* }
%struct.BIO_ASN1_BUF_CTX_t = type { i32, i8*, i32, i32, i32, i32, i32, i32, i32 (%struct.bio_st*, i8**, i32*, i8*)*, i32 (%struct.bio_st*, i8**, i32*, i8*)*, i32 (%struct.bio_st*, i8**, i32*, i8*)*, i32 (%struct.bio_st*, i8**, i32*, i8*)*, i8*, i32, i32, i8* }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !13, globals: !16)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--asn1--libcrypto-shlib-bio_asn1.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 24, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "crypto/asn1/bio_asn1.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!5 = !{!6, !7, !8, !9, !10, !11, !12}
!6 = !DIEnumerator(name: "ASN1_STATE_START", value: 0)
!7 = !DIEnumerator(name: "ASN1_STATE_PRE_COPY", value: 1)
!8 = !DIEnumerator(name: "ASN1_STATE_HEADER", value: 2)
!9 = !DIEnumerator(name: "ASN1_STATE_HEADER_COPY", value: 3)
!10 = !DIEnumerator(name: "ASN1_STATE_DATA_COPY", value: 4)
!11 = !DIEnumerator(name: "ASN1_STATE_POST_COPY", value: 5)
!12 = !DIEnumerator(name: "ASN1_STATE_DONE", value: 6)
!13 = !{!14, !15}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!16 = !{!17}
!17 = distinct !DIGlobalVariable(name: "methods_asn1", scope: !0, file: !4, line: 79, type: !18, isLocal: true, isDefinition: true, variable: %struct.bio_method_st* @methods_asn1)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO_METHOD", file: !20, line: 263, baseType: !21)
!20 = !DIFile(filename: "include/openssl/bio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bio_method_st", file: !22, line: 15, size: 768, align: 64, elements: !23)
!22 = !DIFile(filename: "include/internal/bio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!23 = !{!24, !26, !29, !43, !47, !51, !55, !59, !60, !65, !69, !70}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !21, file: !22, line: 16, baseType: !25, size: 32, align: 32)
!25 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !21, file: !22, line: 17, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "bwrite", scope: !21, file: !22, line: 18, baseType: !30, size: 64, align: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DISubroutineType(types: !32)
!32 = !{!25, !33, !37, !39, !42}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !35, line: 79, baseType: !36)
!35 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !35, line: 79, flags: DIFlagFwdDecl)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !40, line: 216, baseType: !41)
!40 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!41 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "bwrite_old", scope: !21, file: !22, line: 19, baseType: !44, size: 64, align: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!25, !33, !37, !25}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "bread", scope: !21, file: !22, line: 20, baseType: !48, size: 64, align: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!25, !33, !27, !39, !42}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "bread_old", scope: !21, file: !22, line: 21, baseType: !52, size: 64, align: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!25, !33, !27, !25}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "bputs", scope: !21, file: !22, line: 22, baseType: !56, size: 64, align: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!25, !33, !37}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "bgets", scope: !21, file: !22, line: 23, baseType: !52, size: 64, align: 64, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !21, file: !22, line: 24, baseType: !61, size: 64, align: 64, offset: 512)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !33, !25, !64, !14}
!64 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !21, file: !22, line: 25, baseType: !66, size: 64, align: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!25, !33}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !21, file: !22, line: 26, baseType: !66, size: 64, align: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "callback_ctrl", scope: !21, file: !22, line: 27, baseType: !71, size: 64, align: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!64, !33, !25, !74}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO_info_cb", file: !20, line: 268, baseType: !76)
!76 = !DISubroutineType(types: !77)
!77 = !{!25, !33, !25, !25}
!78 = !{i32 2, !"Dwarf Version", i32 4}
!79 = !{i32 2, !"Debug Info Version", i32 3}
!80 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!81 = distinct !DISubprogram(name: "BIO_f_asn1", scope: !4, file: !4, line: 96, type: !82, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !85)
!82 = !DISubroutineType(types: !83)
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!85 = !{}
!86 = !DILocation(line: 98, column: 5, scope: !81)
!87 = distinct !DISubprogram(name: "BIO_asn1_set_prefix", scope: !4, file: !4, line: 422, type: !88, isLocal: false, isDefinition: true, scopeLine: 424, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !85)
!88 = !DISubroutineType(types: !89)
!89 = !{!25, !33, !90, !90}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "asn1_ps_func", file: !20, line: 274, baseType: !92)
!92 = !DISubroutineType(types: !93)
!93 = !{!25, !33, !94, !97, !14}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!98 = !DILocalVariable(name: "b", arg: 1, scope: !87, file: !4, line: 422, type: !33)
!99 = !DIExpression()
!100 = !DILocation(line: 422, column: 30, scope: !87)
!101 = !DILocalVariable(name: "prefix", arg: 2, scope: !87, file: !4, line: 422, type: !90)
!102 = !DILocation(line: 422, column: 47, scope: !87)
!103 = !DILocalVariable(name: "prefix_free", arg: 3, scope: !87, file: !4, line: 423, type: !90)
!104 = !DILocation(line: 423, column: 39, scope: !87)
!105 = !DILocation(line: 425, column: 28, scope: !87)
!106 = !DILocation(line: 425, column: 36, scope: !87)
!107 = !DILocation(line: 425, column: 44, scope: !87)
!108 = !DILocation(line: 425, column: 12, scope: !87)
!109 = !DILocation(line: 425, column: 5, scope: !87)
!110 = distinct !DISubprogram(name: "asn1_bio_set_ex", scope: !4, file: !4, line: 399, type: !111, isLocal: true, isDefinition: true, scopeLine: 401, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !85)
!111 = !DISubroutineType(types: !112)
!112 = !{!25, !33, !25, !90, !90}
!113 = !DILocalVariable(name: "b", arg: 1, scope: !110, file: !4, line: 399, type: !33)
!114 = !DILocation(line: 399, column: 33, scope: !110)
!115 = !DILocalVariable(name: "cmd", arg: 2, scope: !110, file: !4, line: 399, type: !25)
!116 = !DILocation(line: 399, column: 40, scope: !110)
!117 = !DILocalVariable(name: "ex_func", arg: 3, scope: !110, file: !4, line: 400, type: !90)
!118 = !DILocation(line: 400, column: 42, scope: !110)
!119 = !DILocalVariable(name: "ex_free_func", arg: 4, scope: !110, file: !4, line: 400, type: !90)
!120 = !DILocation(line: 400, column: 65, scope: !110)
!121 = !DILocalVariable(name: "extmp", scope: !110, file: !4, line: 402, type: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO_ASN1_EX_FUNCS", file: !4, line: 37, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BIO_ASN1_EX_FUNCS_st", file: !4, line: 34, size: 128, align: 64, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ex_func", scope: !123, file: !4, line: 35, baseType: !90, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ex_free_func", scope: !123, file: !4, line: 36, baseType: !90, size: 64, align: 64, offset: 64)
!127 = !DILocation(line: 402, column: 23, scope: !110)
!128 = !DILocation(line: 403, column: 21, scope: !110)
!129 = !DILocation(line: 403, column: 11, scope: !110)
!130 = !DILocation(line: 403, column: 19, scope: !110)
!131 = !DILocation(line: 404, column: 26, scope: !110)
!132 = !DILocation(line: 404, column: 11, scope: !110)
!133 = !DILocation(line: 404, column: 24, scope: !110)
!134 = !DILocation(line: 405, column: 21, scope: !110)
!135 = !DILocation(line: 405, column: 24, scope: !110)
!136 = !DILocation(line: 405, column: 32, scope: !110)
!137 = !DILocation(line: 405, column: 12, scope: !110)
!138 = !DILocation(line: 405, column: 5, scope: !110)
!139 = distinct !DISubprogram(name: "BIO_asn1_get_prefix", scope: !4, file: !4, line: 428, type: !140, isLocal: false, isDefinition: true, scopeLine: 430, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !85)
!140 = !DISubroutineType(types: !141)
!141 = !{!25, !33, !142, !142}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!143 = !DILocalVariable(name: "b", arg: 1, scope: !139, file: !4, line: 428, type: !33)
!144 = !DILocation(line: 428, column: 30, scope: !139)
!145 = !DILocalVariable(name: "pprefix", arg: 2, scope: !139, file: !4, line: 428, type: !142)
!146 = !DILocation(line: 428, column: 48, scope: !139)
!147 = !DILocalVariable(name: "pprefix_free", arg: 3, scope: !139, file: !4, line: 429, type: !142)
!148 = !DILocation(line: 429, column: 40, scope: !139)
!149 = !DILocation(line: 431, column: 28, scope: !139)
!150 = !DILocation(line: 431, column: 36, scope: !139)
!151 = !DILocation(line: 431, column: 45, scope: !139)
!152 = !DILocation(line: 431, column: 12, scope: !139)
!153 = !DILocation(line: 431, column: 5, scope: !139)
!154 = distinct !DISubprogram(name: "asn1_bio_get_ex", scope: !4, file: !4, line: 408, type: !155, isLocal: true, isDefinition: true, scopeLine: 411, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !85)
!155 = !DISubroutineType(types: !156)
!156 = !{!25, !33, !25, !142, !142}
!157 = !DILocalVariable(name: "b", arg: 1, scope: !154, file: !4, line: 408, type: !33)
!158 = !DILocation(line: 408, column: 33, scope: !154)
!159 = !DILocalVariable(name: "cmd", arg: 2, scope: !154, file: !4, line: 408, type: !25)
!160 = !DILocation(line: 408, column: 40, scope: !154)
!161 = !DILocalVariable(name: "ex_func", arg: 3, scope: !154, file: !4, line: 409, type: !142)
!162 = !DILocation(line: 409, column: 43, scope: !154)
!163 = !DILocalVariable(name: "ex_free_func", arg: 4, scope: !154, file: !4, line: 410, type: !142)
!164 = !DILocation(line: 410, column: 43, scope: !154)
!165 = !DILocalVariable(name: "extmp", scope: !154, file: !4, line: 412, type: !122)
!166 = !DILocation(line: 412, column: 23, scope: !154)
!167 = !DILocalVariable(name: "ret", scope: !154, file: !4, line: 413, type: !25)
!168 = !DILocation(line: 413, column: 9, scope: !154)
!169 = !DILocation(line: 414, column: 20, scope: !154)
!170 = !DILocation(line: 414, column: 23, scope: !154)
!171 = !DILocation(line: 414, column: 31, scope: !154)
!172 = !DILocation(line: 414, column: 11, scope: !154)
!173 = !DILocation(line: 414, column: 9, scope: !154)
!174 = !DILocation(line: 415, column: 9, scope: !175)
!175 = distinct !DILexicalBlock(scope: !154, file: !4, line: 415, column: 9)
!176 = !DILocation(line: 415, column: 13, scope: !175)
!177 = !DILocation(line: 415, column: 9, scope: !154)
!178 = !DILocation(line: 416, column: 26, scope: !179)
!179 = distinct !DILexicalBlock(scope: !175, file: !4, line: 415, column: 18)
!180 = !DILocation(line: 416, column: 10, scope: !179)
!181 = !DILocation(line: 416, column: 18, scope: !179)
!182 = !DILocation(line: 417, column: 31, scope: !179)
!183 = !DILocation(line: 417, column: 10, scope: !179)
!184 = !DILocation(line: 417, column: 23, scope: !179)
!185 = !DILocation(line: 418, column: 5, scope: !179)
!186 = !DILocation(line: 419, column: 12, scope: !154)
!187 = !DILocation(line: 419, column: 5, scope: !154)
!188 = distinct !DISubprogram(name: "BIO_asn1_set_suffix", scope: !4, file: !4, line: 434, type: !88, isLocal: false, isDefinition: true, scopeLine: 436, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !85)
!189 = !DILocalVariable(name: "b", arg: 1, scope: !188, file: !4, line: 434, type: !33)
!190 = !DILocation(line: 434, column: 30, scope: !188)
!191 = !DILocalVariable(name: "suffix", arg: 2, scope: !188, file: !4, line: 434, type: !90)
!192 = !DILocation(line: 434, column: 47, scope: !188)
!193 = !DILocalVariable(name: "suffix_free", arg: 3, scope: !188, file: !4, line: 435, type: !90)
!194 = !DILocation(line: 435, column: 39, scope: !188)
!195 = !DILocation(line: 437, column: 28, scope: !188)
!196 = !DILocation(line: 437, column: 36, scope: !188)
!197 = !DILocation(line: 437, column: 44, scope: !188)
!198 = !DILocation(line: 437, column: 12, scope: !188)
!199 = !DILocation(line: 437, column: 5, scope: !188)
!200 = distinct !DISubprogram(name: "BIO_asn1_get_suffix", scope: !4, file: !4, line: 440, type: !140, isLocal: false, isDefinition: true, scopeLine: 442, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !85)
!201 = !DILocalVariable(name: "b", arg: 1, scope: !200, file: !4, line: 440, type: !33)
!202 = !DILocation(line: 440, column: 30, scope: !200)
!203 = !DILocalVariable(name: "psuffix", arg: 2, scope: !200, file: !4, line: 440, type: !142)
!204 = !DILocation(line: 440, column: 48, scope: !200)
!205 = !DILocalVariable(name: "psuffix_free", arg: 3, scope: !200, file: !4, line: 441, type: !142)
!206 = !DILocation(line: 441, column: 40, scope: !200)
!207 = !DILocation(line: 443, column: 28, scope: !200)
!208 = !DILocation(line: 443, column: 36, scope: !200)
!209 = !DILocation(line: 443, column: 45, scope: !200)
!210 = !DILocation(line: 443, column: 12, scope: !200)
!211 = !DILocation(line: 443, column: 5, scope: !200)
!212 = distinct !DISubprogram(name: "asn1_bio_write", scope: !4, file: !4, line: 149, type: !45, isLocal: true, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !85)
!213 = !DILocalVariable(name: "b", arg: 1, scope: !212, file: !4, line: 149, type: !33)
!214 = !DILocation(line: 149, column: 32, scope: !212)
!215 = !DILocalVariable(name: "in", arg: 2, scope: !212, file: !4, line: 149, type: !37)
!216 = !DILocation(line: 149, column: 47, scope: !212)
!217 = !DILocalVariable(name: "inl", arg: 3, scope: !212, file: !4, line: 149, type: !25)
!218 = !DILocation(line: 149, column: 55, scope: !212)
!219 = !DILocalVariable(name: "ctx", scope: !212, file: !4, line: 151, type: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO_ASN1_BUF_CTX", file: !4, line: 60, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BIO_ASN1_BUF_CTX_t", file: !4, line: 39, size: 768, align: 64, elements: !223)
!223 = !{!224, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !222, file: !4, line: 41, baseType: !225, size: 32, align: 32)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "asn1_bio_state_t", file: !4, line: 32, baseType: !3)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !222, file: !4, line: 43, baseType: !95, size: 64, align: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !222, file: !4, line: 45, baseType: !25, size: 32, align: 32, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !222, file: !4, line: 47, baseType: !25, size: 32, align: 32, offset: 160)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !222, file: !4, line: 49, baseType: !25, size: 32, align: 32, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "copylen", scope: !222, file: !4, line: 51, baseType: !25, size: 32, align: 32, offset: 224)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_class", scope: !222, file: !4, line: 53, baseType: !25, size: 32, align: 32, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_tag", scope: !222, file: !4, line: 53, baseType: !25, size: 32, align: 32, offset: 288)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !222, file: !4, line: 54, baseType: !90, size: 64, align: 64, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "prefix_free", scope: !222, file: !4, line: 54, baseType: !90, size: 64, align: 64, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "suffix", scope: !222, file: !4, line: 54, baseType: !90, size: 64, align: 64, offset: 448)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "suffix_free", scope: !222, file: !4, line: 54, baseType: !90, size: 64, align: 64, offset: 512)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ex_buf", scope: !222, file: !4, line: 56, baseType: !95, size: 64, align: 64, offset: 576)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ex_len", scope: !222, file: !4, line: 57, baseType: !25, size: 32, align: 32, offset: 640)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ex_pos", scope: !222, file: !4, line: 58, baseType: !25, size: 32, align: 32, offset: 672)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ex_arg", scope: !222, file: !4, line: 59, baseType: !14, size: 64, align: 64, offset: 704)
!241 = !DILocation(line: 151, column: 23, scope: !212)
!242 = !DILocalVariable(name: "wrmax", scope: !212, file: !4, line: 152, type: !25)
!243 = !DILocation(line: 152, column: 9, scope: !212)
!244 = !DILocalVariable(name: "wrlen", scope: !212, file: !4, line: 152, type: !25)
!245 = !DILocation(line: 152, column: 16, scope: !212)
!246 = !DILocalVariable(name: "ret", scope: !212, file: !4, line: 152, type: !25)
!247 = !DILocation(line: 152, column: 23, scope: !212)
!248 = !DILocalVariable(name: "p", scope: !212, file: !4, line: 153, type: !95)
!249 = !DILocation(line: 153, column: 20, scope: !212)
!250 = !DILocalVariable(name: "next", scope: !212, file: !4, line: 154, type: !33)
!251 = !DILocation(line: 154, column: 10, scope: !212)
!252 = !DILocation(line: 156, column: 24, scope: !212)
!253 = !DILocation(line: 156, column: 11, scope: !212)
!254 = !DILocation(line: 156, column: 9, scope: !212)
!255 = !DILocation(line: 157, column: 21, scope: !212)
!256 = !DILocation(line: 157, column: 12, scope: !212)
!257 = !DILocation(line: 157, column: 10, scope: !212)
!258 = !DILocation(line: 158, column: 9, scope: !259)
!259 = distinct !DILexicalBlock(scope: !212, file: !4, line: 158, column: 9)
!260 = !DILocation(line: 158, column: 12, scope: !259)
!261 = !DILocation(line: 158, column: 19, scope: !259)
!262 = !DILocation(line: 158, column: 22, scope: !263)
!263 = !DILexicalBlockFile(scope: !259, file: !4, discriminator: 1)
!264 = !DILocation(line: 158, column: 26, scope: !263)
!265 = !DILocation(line: 158, column: 30, scope: !263)
!266 = !DILocation(line: 158, column: 33, scope: !267)
!267 = !DILexicalBlockFile(scope: !259, file: !4, discriminator: 2)
!268 = !DILocation(line: 158, column: 37, scope: !267)
!269 = !DILocation(line: 158, column: 45, scope: !267)
!270 = !DILocation(line: 158, column: 48, scope: !271)
!271 = !DILexicalBlockFile(scope: !259, file: !4, discriminator: 3)
!272 = !DILocation(line: 158, column: 53, scope: !271)
!273 = !DILocation(line: 158, column: 9, scope: !271)
!274 = !DILocation(line: 159, column: 9, scope: !259)
!275 = !DILocation(line: 161, column: 11, scope: !212)
!276 = !DILocation(line: 162, column: 9, scope: !212)
!277 = !DILocation(line: 164, column: 5, scope: !212)
!278 = !DILocation(line: 165, column: 17, scope: !279)
!279 = distinct !DILexicalBlock(scope: !280, file: !4, line: 164, column: 14)
!280 = distinct !DILexicalBlock(scope: !281, file: !4, line: 164, column: 5)
!281 = distinct !DILexicalBlock(scope: !212, file: !4, line: 164, column: 5)
!282 = !DILocation(line: 165, column: 22, scope: !279)
!283 = !DILocation(line: 165, column: 9, scope: !279)
!284 = !DILocation(line: 168, column: 36, scope: !285)
!285 = distinct !DILexicalBlock(scope: !286, file: !4, line: 168, column: 17)
!286 = distinct !DILexicalBlock(scope: !279, file: !4, line: 165, column: 29)
!287 = !DILocation(line: 168, column: 39, scope: !285)
!288 = !DILocation(line: 168, column: 44, scope: !285)
!289 = !DILocation(line: 168, column: 49, scope: !285)
!290 = !DILocation(line: 168, column: 18, scope: !285)
!291 = !DILocation(line: 168, column: 17, scope: !286)
!292 = !DILocation(line: 170, column: 17, scope: !285)
!293 = !DILocation(line: 171, column: 13, scope: !286)
!294 = !DILocation(line: 176, column: 37, scope: !286)
!295 = !DILocation(line: 176, column: 40, scope: !286)
!296 = !DILocation(line: 176, column: 45, scope: !286)
!297 = !DILocation(line: 176, column: 50, scope: !286)
!298 = !DILocation(line: 176, column: 19, scope: !286)
!299 = !DILocation(line: 176, column: 17, scope: !286)
!300 = !DILocation(line: 179, column: 17, scope: !301)
!301 = distinct !DILexicalBlock(scope: !286, file: !4, line: 179, column: 17)
!302 = !DILocation(line: 179, column: 21, scope: !301)
!303 = !DILocation(line: 179, column: 17, scope: !286)
!304 = !DILocation(line: 180, column: 17, scope: !301)
