; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--x509v3--libcrypto-shlib-pcy_lib.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--x509v3--libcrypto-shlib-pcy_lib.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.X509_POLICY_TREE_st = type { %struct.X509_POLICY_LEVEL_st*, i32, %struct.stack_st_X509_POLICY_DATA*, %struct.stack_st_X509_POLICY_NODE*, %struct.stack_st_X509_POLICY_NODE*, i32 }
%struct.X509_POLICY_LEVEL_st = type { %struct.x509_st*, %struct.stack_st_X509_POLICY_NODE*, %struct.X509_POLICY_NODE_st*, i32 }
%struct.x509_st = type opaque
%struct.X509_POLICY_NODE_st = type { %struct.X509_POLICY_DATA_st*, %struct.X509_POLICY_NODE_st*, i32 }
%struct.X509_POLICY_DATA_st = type { i32, %struct.asn1_object_st*, %struct.stack_st_POLICYQUALINFO*, %struct.stack_st_ASN1_OBJECT* }
%struct.asn1_object_st = type opaque
%struct.stack_st_POLICYQUALINFO = type opaque
%struct.stack_st_ASN1_OBJECT = type opaque
%struct.stack_st_X509_POLICY_DATA = type opaque
%struct.stack_st_X509_POLICY_NODE = type opaque
%struct.stack_st = type opaque

; Function Attrs: nounwind uwtable
define i32 @X509_policy_tree_level_count(%struct.X509_POLICY_TREE_st* %tree) #0 !dbg !41 {
entry:
  %retval = alloca i32, align 4
  %tree.addr = alloca %struct.X509_POLICY_TREE_st*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--x509v3--libcrypto-shlib-pcy_lib.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{}
!3 = !{!4, !9}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !7, line: 17, baseType: !8)
!7 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !7, line: 17, flags: DIFlagFwdDecl)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_POLICY_NODE", file: !11, line: 157, baseType: !12)
!11 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_POLICY_NODE_st", file: !13, line: 90, size: 192, align: 64, elements: !14)
!13 = !DIFile(filename: "crypto/x509v3/pcy_int.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!14 = !{!15, !35, !36}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !12, file: !13, line: 92, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_POLICY_DATA", file: !13, line: 10, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_POLICY_DATA_st", file: !13, line: 23, size: 256, align: 64, elements: !20)
!20 = !{!21, !23, !27, !31}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !19, file: !13, line: 24, baseType: !22, size: 32, align: 32)
!22 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "valid_policy", scope: !19, file: !13, line: 26, baseType: !24, size: 64, align: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !11, line: 60, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !11, line: 60, flags: DIFlagFwdDecl)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier_set", scope: !19, file: !13, line: 27, baseType: !28, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_POLICYQUALINFO", file: !30, line: 623, flags: DIFlagFwdDecl)
!30 = !DIFile(filename: "include/openssl/x509_vfy.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!31 = !DIDerivedType(tag: DW_TAG_member, name: "expected_policy_set", scope: !19, file: !13, line: 28, baseType: !32, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ASN1_OBJECT", file: !34, line: 536, flags: DIFlagFwdDecl)
!34 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!35 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !12, file: !13, line: 94, baseType: !9, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "nchild", scope: !12, file: !13, line: 96, baseType: !37, size: 32, align: 32, offset: 128)
!37 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!38 = !{i32 2, !"Dwarf Version", i32 4}
!39 = !{i32 2, !"Debug Info Version", i32 3}
!40 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!41 = distinct !DISubprogram(name: "X509_policy_tree_level_count", scope: !42, file: !42, line: 20, type: !43, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!42 = !DIFile(filename: "crypto/x509v3/pcy_lib.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!43 = !DISubroutineType(types: !44)
!44 = !{!37, !45}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_POLICY_TREE", file: !11, line: 159, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_POLICY_TREE_st", file: !13, line: 113, size: 384, align: 64, elements: !49)
!49 = !{!50, !64, !65, !68, !69, !70}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !48, file: !13, line: 115, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_POLICY_LEVEL", file: !11, line: 158, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_POLICY_LEVEL_st", file: !13, line: 99, size: 256, align: 64, elements: !54)
!54 = !{!55, !59, !62, !63}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !53, file: !13, line: 101, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !11, line: 124, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !11, line: 124, flags: DIFlagFwdDecl)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !53, file: !13, line: 103, baseType: !60, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_POLICY_NODE", file: !30, line: 608, flags: DIFlagFwdDecl)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "anyPolicy", scope: !53, file: !13, line: 105, baseType: !9, size: 64, align: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !53, file: !13, line: 110, baseType: !22, size: 32, align: 32, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "nlevel", scope: !48, file: !13, line: 116, baseType: !37, size: 32, align: 32, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "extra_data", scope: !48, file: !13, line: 121, baseType: !66, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_POLICY_DATA", file: !13, line: 12, flags: DIFlagFwdDecl)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "auth_policies", scope: !48, file: !13, line: 123, baseType: !60, size: 64, align: 64, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "user_policies", scope: !48, file: !13, line: 124, baseType: !60, size: 64, align: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !48, file: !13, line: 125, baseType: !22, size: 32, align: 32, offset: 320)
!71 = !DILocalVariable(name: "tree", arg: 1, scope: !41, file: !42, line: 20, type: !45)
!72 = !DIExpression()
!73 = !DILocation(line: 20, column: 58, scope: !41)
!74 = !DILocation(line: 22, column: 10, scope: !75)
!75 = distinct !DILexicalBlock(scope: !41, file: !42, line: 22, column: 9)
!76 = !DILocation(line: 22, column: 9, scope: !41)
!77 = !DILocation(line: 23, column: 9, scope: !75)
!78 = !DILocation(line: 24, column: 12, scope: !41)
!79 = !DILocation(line: 24, column: 18, scope: !41)
!80 = !DILocation(line: 24, column: 5, scope: !41)
!81 = !DILocation(line: 25, column: 1, scope: !41)
!82 = distinct !DISubprogram(name: "X509_policy_tree_get0_level", scope: !42, file: !42, line: 27, type: !83, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!83 = !DISubroutineType(types: !84)
!84 = !{!51, !45, !37}
!85 = !DILocalVariable(name: "tree", arg: 1, scope: !82, file: !42, line: 27, type: !45)
!86 = !DILocation(line: 27, column: 72, scope: !82)
!87 = !DILocalVariable(name: "i", arg: 2, scope: !82, file: !42, line: 28, type: !37)
!88 = !DILocation(line: 28, column: 52, scope: !82)
!89 = !DILocation(line: 30, column: 10, scope: !90)
!90 = distinct !DILexicalBlock(scope: !82, file: !42, line: 30, column: 9)
!91 = !DILocation(line: 30, column: 15, scope: !90)
!92 = !DILocation(line: 30, column: 19, scope: !93)
!93 = !DILexicalBlockFile(scope: !90, file: !42, discriminator: 1)
!94 = !DILocation(line: 30, column: 21, scope: !93)
!95 = !DILocation(line: 30, column: 26, scope: !93)
!96 = !DILocation(line: 30, column: 30, scope: !97)
!97 = !DILexicalBlockFile(scope: !90, file: !42, discriminator: 2)
!98 = !DILocation(line: 30, column: 35, scope: !97)
!99 = !DILocation(line: 30, column: 41, scope: !97)
!100 = !DILocation(line: 30, column: 32, scope: !97)
!101 = !DILocation(line: 30, column: 9, scope: !97)
!102 = !DILocation(line: 31, column: 9, scope: !90)
!103 = !DILocation(line: 32, column: 12, scope: !82)
!104 = !DILocation(line: 32, column: 18, scope: !82)
!105 = !DILocation(line: 32, column: 27, scope: !82)
!106 = !DILocation(line: 32, column: 25, scope: !82)
!107 = !DILocation(line: 32, column: 5, scope: !82)
!108 = !DILocation(line: 33, column: 1, scope: !82)
!109 = distinct !DISubprogram(name: "X509_policy_tree_get0_policies", scope: !42, file: !42, line: 35, type: !110, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!110 = !DISubroutineType(types: !111)
!111 = !{!60, !45}
!112 = !DILocalVariable(name: "tree", arg: 1, scope: !109, file: !42, line: 37, type: !45)
!113 = !DILocation(line: 37, column: 61, scope: !109)
!114 = !DILocation(line: 39, column: 10, scope: !115)
!115 = distinct !DILexicalBlock(scope: !109, file: !42, line: 39, column: 9)
!116 = !DILocation(line: 39, column: 9, scope: !109)
!117 = !DILocation(line: 40, column: 9, scope: !115)
!118 = !DILocation(line: 41, column: 12, scope: !109)
!119 = !DILocation(line: 41, column: 18, scope: !109)
!120 = !DILocation(line: 41, column: 5, scope: !109)
!121 = !DILocation(line: 42, column: 1, scope: !109)
!122 = distinct !DISubprogram(name: "X509_policy_tree_get0_user_policies", scope: !42, file: !42, line: 44, type: !110, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!123 = !DILocalVariable(name: "tree", arg: 1, scope: !122, file: !42, line: 46, type: !45)
!124 = !DILocation(line: 46, column: 66, scope: !122)
!125 = !DILocation(line: 48, column: 10, scope: !126)
!126 = distinct !DILexicalBlock(scope: !122, file: !42, line: 48, column: 9)
!127 = !DILocation(line: 48, column: 9, scope: !122)
!128 = !DILocation(line: 49, column: 9, scope: !126)
!129 = !DILocation(line: 50, column: 9, scope: !130)
