; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--txt_db--libcrypto-shlib-txt_db.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--txt_db--libcrypto-shlib-txt_db.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.txt_db_st = type { i32, %struct.stack_st_OPENSSL_PSTRING*, %struct.lhash_st_OPENSSL_STRING**, i32 (i8**)**, i64, i64, i64, i8** }
%struct.stack_st_OPENSSL_PSTRING = type opaque
%struct.lhash_st_OPENSSL_STRING = type { %union.lh_OPENSSL_STRING_dummy }
%union.lh_OPENSSL_STRING_dummy = type { i8* }
%struct.bio_st = type opaque
%struct.buf_mem_st = type { i64, i8*, i64, i64 }
%struct.stack_st = type opaque
%struct.lhash_st = type opaque

@.str = private unnamed_addr constant [23 x i8] c"crypto/txt_db/txt_db.c\00", align 1

; Function Attrs: nounwind uwtable
define %struct.txt_db_st* @TXT_DB_read(%struct.bio_st* %in, i32 %num) #0 !dbg !40 {
entry:
  %retval = alloca %struct.txt_db_st*, align 8
  %in.addr = alloca %struct.bio_st*, align 8
  %num.addr = alloca i32, align 4
  %ret = alloca %struct.txt_db_st*, align 8
  %esc = alloca i32, align 4
  %ln = alloca i64, align 8
  %i = alloca i32, align 4
  %add = alloca i32, align 4
  %n = alloca i32, align 4
  %size = alloca i32, align 4
  %offset = alloca i32, align 4
  %p = alloca i8*, align 8
  %f = alloca i8*, align 8
  %pp = alloca i8**, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--txt_db--libcrypto-shlib-txt_db.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{}
!3 = !{!4, !5, !8, !19, !6, !20, !23, !27, !29, !32, !35}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lhash_st_OPENSSL_STRING", file: !10, line: 202, size: 64, align: 64, elements: !11)
!10 = !DIFile(filename: "include/openssl/lhash.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!11 = !{!12}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !9, file: !10, line: 202, baseType: !13, size: 64, align: 64)
!13 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "lh_OPENSSL_STRING_dummy", file: !10, line: 202, size: 64, align: 64, elements: !14)
!14 = !{!15, !16, !18}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !13, file: !10, line: 202, baseType: !4, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !13, file: !10, line: 202, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !13, file: !10, line: 202, baseType: !19, size: 32, align: 32)
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_OPENSSL_PSTRING", file: !22, line: 31, flags: DIFlagFwdDecl)
!22 = !DIFile(filename: "include/openssl/txt_db.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !25, line: 17, baseType: !26)
!25 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !25, line: 17, flags: DIFlagFwdDecl)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STRING", file: !31, line: 149, baseType: !6)
!31 = !DIFile(filename: "include/openssl/safestack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_LHASH", file: !10, line: 29, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "lhash_st", file: !10, line: 29, flags: DIFlagFwdDecl)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!37 = !{i32 2, !"Dwarf Version", i32 4}
!38 = !{i32 2, !"Debug Info Version", i32 3}
!39 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!40 = distinct !DISubprogram(name: "TXT_DB_read", scope: !41, file: !41, line: 20, type: !42, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!41 = !DIFile(filename: "crypto/txt_db/txt_db.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !62, !19}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "TXT_DB", file: !22, line: 42, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "txt_db_st", file: !22, line: 33, size: 512, align: 64, elements: !47)
!47 = !{!48, !49, !50, !52, !57, !59, !60, !61}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "num_fields", scope: !46, file: !22, line: 34, baseType: !19, size: 32, align: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !46, file: !22, line: 35, baseType: !20, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !46, file: !22, line: 36, baseType: !51, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "qual", scope: !46, file: !22, line: 37, baseType: !53, size: 64, align: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!19, !29}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !46, file: !22, line: 38, baseType: !58, size: 64, align: 64, offset: 256)
!58 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "arg1", scope: !46, file: !22, line: 39, baseType: !58, size: 64, align: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "arg2", scope: !46, file: !22, line: 40, baseType: !58, size: 64, align: 64, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "arg_row", scope: !46, file: !22, line: 41, baseType: !29, size: 64, align: 64, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !64, line: 79, baseType: !65)
!64 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !64, line: 79, flags: DIFlagFwdDecl)
!66 = !DILocalVariable(name: "in", arg: 1, scope: !40, file: !41, line: 20, type: !62)
!67 = !DIExpression()
!68 = !DILocation(line: 20, column: 26, scope: !40)
!69 = !DILocalVariable(name: "num", arg: 2, scope: !40, file: !41, line: 20, type: !19)
!70 = !DILocation(line: 20, column: 34, scope: !40)
!71 = !DILocalVariable(name: "ret", scope: !40, file: !41, line: 22, type: !44)
!72 = !DILocation(line: 22, column: 13, scope: !40)
!73 = !DILocalVariable(name: "esc", scope: !40, file: !41, line: 23, type: !19)
!74 = !DILocation(line: 23, column: 9, scope: !40)
!75 = !DILocalVariable(name: "ln", scope: !40, file: !41, line: 24, type: !58)
!76 = !DILocation(line: 24, column: 10, scope: !40)
!77 = !DILocalVariable(name: "i", scope: !40, file: !41, line: 25, type: !19)
!78 = !DILocation(line: 25, column: 9, scope: !40)
!79 = !DILocalVariable(name: "add", scope: !40, file: !41, line: 25, type: !19)
!80 = !DILocation(line: 25, column: 12, scope: !40)
!81 = !DILocalVariable(name: "n", scope: !40, file: !41, line: 25, type: !19)
!82 = !DILocation(line: 25, column: 17, scope: !40)
!83 = !DILocalVariable(name: "size", scope: !40, file: !41, line: 26, type: !19)
!84 = !DILocation(line: 26, column: 9, scope: !40)
!85 = !DILocalVariable(name: "offset", scope: !40, file: !41, line: 27, type: !19)
!86 = !DILocation(line: 27, column: 9, scope: !40)
!87 = !DILocalVariable(name: "p", scope: !40, file: !41, line: 28, type: !6)
!88 = !DILocation(line: 28, column: 11, scope: !40)
!89 = !DILocalVariable(name: "f", scope: !40, file: !41, line: 28, type: !6)
!90 = !DILocation(line: 28, column: 15, scope: !40)
!91 = !DILocalVariable(name: "pp", scope: !40, file: !41, line: 29, type: !29)
!92 = !DILocation(line: 29, column: 21, scope: !40)
!93 = !DILocalVariable(name: "buf", scope: !40, file: !41, line: 30, type: !94)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "BUF_MEM", file: !64, line: 87, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_mem_st", file: !97, line: 38, size: 256, align: 64, elements: !98)
!97 = !DIFile(filename: "include/openssl/buffer.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!98 = !{!99, !102, !103, !104}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !96, file: !97, line: 39, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !101, line: 216, baseType: !17)
!101 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !96, file: !97, line: 40, baseType: !6, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !96, file: !97, line: 41, baseType: !100, size: 64, align: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !96, file: !97, line: 42, baseType: !17, size: 64, align: 64, offset: 192)
!105 = !DILocation(line: 30, column: 14, scope: !40)
!106 = !DILocation(line: 32, column: 16, scope: !107)
!107 = distinct !DILexicalBlock(scope: !40, file: !41, line: 32, column: 9)
!108 = !DILocation(line: 32, column: 14, scope: !107)
!109 = !DILocation(line: 32, column: 31, scope: !107)
!110 = !DILocation(line: 32, column: 9, scope: !40)
!111 = !DILocation(line: 33, column: 9, scope: !107)
!112 = !DILocation(line: 34, column: 23, scope: !113)
!113 = distinct !DILexicalBlock(scope: !40, file: !41, line: 34, column: 9)
!114 = !DILocation(line: 34, column: 28, scope: !113)
!115 = !DILocation(line: 34, column: 10, scope: !113)
!116 = !DILocation(line: 34, column: 9, scope: !40)
!117 = !DILocation(line: 35, column: 9, scope: !113)
!118 = !DILocation(line: 37, column: 16, scope: !119)
!119 = distinct !DILexicalBlock(scope: !40, file: !41, line: 37, column: 9)
!120 = !DILocation(line: 37, column: 14, scope: !119)
!121 = !DILocation(line: 37, column: 75, scope: !119)
!122 = !DILocation(line: 37, column: 9, scope: !40)
!123 = !DILocation(line: 38, column: 9, scope: !119)
!124 = !DILocation(line: 39, column: 23, scope: !40)
!125 = !DILocation(line: 39, column: 5, scope: !40)
!126 = !DILocation(line: 39, column: 10, scope: !40)
!127 = !DILocation(line: 39, column: 21, scope: !40)
!128 = !DILocation(line: 40, column: 5, scope: !40)
!129 = !DILocation(line: 40, column: 10, scope: !40)
!130 = !DILocation(line: 40, column: 16, scope: !40)
!131 = !DILocation(line: 41, column: 5, scope: !40)
!132 = !DILocation(line: 41, column: 10, scope: !40)
!133 = !DILocation(line: 41, column: 15, scope: !40)
!134 = !DILocation(line: 42, column: 22, scope: !135)
!135 = distinct !DILexicalBlock(scope: !40, file: !41, line: 42, column: 9)
!136 = !DILocation(line: 42, column: 10, scope: !135)
!137 = !DILocation(line: 42, column: 15, scope: !135)
!138 = !DILocation(line: 42, column: 20, scope: !135)
!139 = !DILocation(line: 42, column: 53, scope: !135)
!140 = !DILocation(line: 42, column: 9, scope: !40)
!141 = !DILocation(line: 43, column: 9, scope: !135)
!142 = !DILocation(line: 44, column: 59, scope: !143)
!143 = distinct !DILexicalBlock(scope: !40, file: !41, line: 44, column: 9)
!144 = !DILocation(line: 44, column: 57, scope: !143)
!145 = !DILocation(line: 44, column: 23, scope: !143)
!146 = !DILocation(line: 44, column: 10, scope: !143)
!147 = !DILocation(line: 44, column: 15, scope: !143)
!148 = !DILocation(line: 44, column: 21, scope: !143)
!149 = !DILocation(line: 44, column: 95, scope: !143)
!150 = !DILocation(line: 44, column: 9, scope: !40)
!151 = !DILocation(line: 45, column: 9, scope: !143)
!152 = !DILocation(line: 46, column: 59, scope: !153)
!153 = distinct !DILexicalBlock(scope: !40, file: !41, line: 46, column: 9)
!154 = !DILocation(line: 46, column: 57, scope: !153)
!155 = !DILocation(line: 46, column: 22, scope: !153)
!156 = !DILocation(line: 46, column: 10, scope: !153)
!157 = !DILocation(line: 46, column: 15, scope: !153)
!158 = !DILocation(line: 46, column: 20, scope: !153)
!159 = !DILocation(line: 46, column: 95, scope: !153)
!160 = !DILocation(line: 46, column: 9, scope: !40)
!161 = !DILocation(line: 47, column: 9, scope: !153)
!162 = !DILocation(line: 48, column: 12, scope: !163)
!163 = distinct !DILexicalBlock(scope: !40, file: !41, line: 48, column: 5)
!164 = !DILocation(line: 48, column: 10, scope: !163)
!165 = !DILocation(line: 48, column: 17, scope: !166)
!166 = !DILexicalBlockFile(scope: !167, file: !41, discriminator: 1)
!167 = distinct !DILexicalBlock(scope: !163, file: !41, line: 48, column: 5)
!168 = !DILocation(line: 48, column: 21, scope: !166)
!169 = !DILocation(line: 48, column: 19, scope: !166)
!170 = !DILocation(line: 48, column: 5, scope: !166)
!171 = !DILocation(line: 49, column: 20, scope: !172)
!172 = distinct !DILexicalBlock(scope: !167, file: !41, line: 48, column: 31)
