; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--asn1--libcrypto-shlib-a_d2i_fp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--asn1--libcrypto-shlib-a_d2i_fp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.bio_st = type opaque
%struct.bio_method_st = type opaque
%struct.buf_mem_st = type { i64, i8*, i64, i64 }
%struct.ASN1_ITEM_st = type opaque
%struct.ASN1_VALUE_st = type opaque

@.str = private unnamed_addr constant [23 x i8] c"crypto/asn1/a_d2i_fp.c\00", align 1

; Function Attrs: nounwind uwtable
define i8* @ASN1_d2i_fp(i8* ()* %xnew, i8* (i8**, i8**, i64)* %d2i, %struct._IO_FILE* %in, i8** %x) #0 !dbg !15 {
entry:
  %retval = alloca i8*, align 8
  %xnew.addr = alloca i8* ()*, align 8
  %d2i.addr = alloca i8* (i8**, i8**, i64)*, align 8
  %in.addr = alloca %struct._IO_FILE*, align 8
  %x.addr = alloca i8**, align 8
  %b = alloca %struct.bio_st*, align 8
  %ret = alloca i8*, align 8
  store i8* ()* %xnew, i8* ()** %xnew.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--asn1--libcrypto-shlib-a_d2i_fp.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{}
!3 = !{!4, !5, !7, !9, !11}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!11 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!12 = !{i32 2, !"Dwarf Version", i32 4}
!13 = !{i32 2, !"Debug Info Version", i32 3}
!14 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!15 = distinct !DISubprogram(name: "ASN1_d2i_fp", scope: !16, file: !16, line: 21, type: !17, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!16 = !DIFile(filename: "crypto/asn1/a_d2i_fp.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!17 = !DISubroutineType(types: !18)
!18 = !{!4, !19, !22, !30, !27}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{!4}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "d2i_of_void", file: !24, line: 277, baseType: !25)
!24 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!25 = !DISubroutineType(types: !26)
!26 = !{!4, !27, !28, !29}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!29 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !32, line: 48, baseType: !33)
!32 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !34, line: 241, size: 1728, align: 64, elements: !35)
!34 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !56, !57, !58, !59, !62, !64, !66, !70, !73, !75, !76, !77, !78, !79, !83, !84}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !33, file: !34, line: 242, baseType: !11, size: 32, align: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !33, file: !34, line: 247, baseType: !5, size: 64, align: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !33, file: !34, line: 248, baseType: !5, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !33, file: !34, line: 249, baseType: !5, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !33, file: !34, line: 250, baseType: !5, size: 64, align: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !33, file: !34, line: 251, baseType: !5, size: 64, align: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !33, file: !34, line: 252, baseType: !5, size: 64, align: 64, offset: 384)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !33, file: !34, line: 253, baseType: !5, size: 64, align: 64, offset: 448)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !33, file: !34, line: 254, baseType: !5, size: 64, align: 64, offset: 512)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !33, file: !34, line: 256, baseType: !5, size: 64, align: 64, offset: 576)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !33, file: !34, line: 257, baseType: !5, size: 64, align: 64, offset: 640)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !33, file: !34, line: 258, baseType: !5, size: 64, align: 64, offset: 704)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !33, file: !34, line: 260, baseType: !49, size: 64, align: 64, offset: 768)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !34, line: 156, size: 192, align: 64, elements: !51)
!51 = !{!52, !53, !55}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !50, file: !34, line: 157, baseType: !49, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !50, file: !34, line: 158, baseType: !54, size: 64, align: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !50, file: !34, line: 162, baseType: !11, size: 32, align: 32, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !33, file: !34, line: 262, baseType: !54, size: 64, align: 64, offset: 832)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !33, file: !34, line: 264, baseType: !11, size: 32, align: 32, offset: 896)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !33, file: !34, line: 268, baseType: !11, size: 32, align: 32, offset: 928)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !33, file: !34, line: 270, baseType: !60, size: 64, align: 64, offset: 960)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !61, line: 131, baseType: !29)
!61 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !33, file: !34, line: 274, baseType: !63, size: 16, align: 16, offset: 1024)
!63 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !33, file: !34, line: 275, baseType: !65, size: 8, align: 8, offset: 1040)
!65 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !33, file: !34, line: 276, baseType: !67, size: 8, align: 8, offset: 1048)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 8, align: 8, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 1)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !33, file: !34, line: 280, baseType: !71, size: 64, align: 64, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !34, line: 150, baseType: null)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !33, file: !34, line: 289, baseType: !74, size: 64, align: 64, offset: 1152)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !61, line: 132, baseType: !29)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !33, file: !34, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !33, file: !34, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !33, file: !34, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !33, file: !34, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !33, file: !34, line: 302, baseType: !80, size: 64, align: 64, offset: 1472)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !81, line: 216, baseType: !82)
!81 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!82 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !33, file: !34, line: 303, baseType: !11, size: 32, align: 32, offset: 1536)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !33, file: !34, line: 305, baseType: !85, size: 160, align: 8, offset: 1568)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 160, align: 8, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 20)
!88 = !DILocalVariable(name: "xnew", arg: 1, scope: !15, file: !16, line: 21, type: !19)
!89 = !DIExpression()
!90 = !DILocation(line: 21, column: 27, scope: !15)
!91 = !DILocalVariable(name: "d2i", arg: 2, scope: !15, file: !16, line: 21, type: !22)
!92 = !DILocation(line: 21, column: 54, scope: !15)
!93 = !DILocalVariable(name: "in", arg: 3, scope: !15, file: !16, line: 21, type: !30)
!94 = !DILocation(line: 21, column: 65, scope: !15)
!95 = !DILocalVariable(name: "x", arg: 4, scope: !15, file: !16, line: 21, type: !27)
!96 = !DILocation(line: 21, column: 76, scope: !15)
!97 = !DILocalVariable(name: "b", scope: !15, file: !16, line: 23, type: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !100, line: 79, baseType: !101)
!100 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !100, line: 79, flags: DIFlagFwdDecl)
!102 = !DILocation(line: 23, column: 10, scope: !15)
!103 = !DILocalVariable(name: "ret", scope: !15, file: !16, line: 24, type: !4)
!104 = !DILocation(line: 24, column: 11, scope: !15)
!105 = !DILocation(line: 26, column: 22, scope: !106)
!106 = distinct !DILexicalBlock(scope: !15, file: !16, line: 26, column: 9)
!107 = !DILocation(line: 26, column: 14, scope: !108)
!108 = !DILexicalBlockFile(scope: !106, file: !16, discriminator: 1)
!109 = !DILocation(line: 26, column: 12, scope: !106)
!110 = !DILocation(line: 26, column: 37, scope: !106)
!111 = !DILocation(line: 26, column: 9, scope: !15)
!112 = !DILocation(line: 27, column: 9, scope: !113)
!113 = distinct !DILexicalBlock(scope: !106, file: !16, line: 26, column: 45)
!114 = !DILocation(line: 28, column: 9, scope: !113)
!115 = !DILocation(line: 30, column: 14, scope: !15)
!116 = !DILocation(line: 30, column: 34, scope: !15)
!117 = !DILocation(line: 30, column: 25, scope: !15)
!118 = !DILocation(line: 30, column: 5, scope: !15)
!119 = !DILocation(line: 31, column: 24, scope: !15)
!120 = !DILocation(line: 31, column: 30, scope: !15)
!121 = !DILocation(line: 31, column: 35, scope: !15)
!122 = !DILocation(line: 31, column: 38, scope: !15)
!123 = !DILocation(line: 31, column: 11, scope: !15)
!124 = !DILocation(line: 31, column: 9, scope: !15)
!125 = !DILocation(line: 32, column: 14, scope: !15)
!126 = !DILocation(line: 32, column: 5, scope: !15)
!127 = !DILocation(line: 33, column: 12, scope: !15)
!128 = !DILocation(line: 33, column: 5, scope: !15)
!129 = !DILocation(line: 34, column: 1, scope: !15)
!130 = distinct !DISubprogram(name: "ASN1_d2i_bio", scope: !16, file: !16, line: 37, type: !131, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!131 = !DISubroutineType(types: !132)
!132 = !{!4, !19, !22, !98, !27}
!133 = !DILocalVariable(name: "xnew", arg: 1, scope: !130, file: !16, line: 37, type: !19)
!134 = !DILocation(line: 37, column: 28, scope: !130)
!135 = !DILocalVariable(name: "d2i", arg: 2, scope: !130, file: !16, line: 37, type: !22)
!136 = !DILocation(line: 37, column: 55, scope: !130)
!137 = !DILocalVariable(name: "in", arg: 3, scope: !130, file: !16, line: 37, type: !98)
!138 = !DILocation(line: 37, column: 65, scope: !130)
!139 = !DILocalVariable(name: "x", arg: 4, scope: !130, file: !16, line: 37, type: !27)
!140 = !DILocation(line: 37, column: 76, scope: !130)
!141 = !DILocalVariable(name: "b", scope: !130, file: !16, line: 39, type: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "BUF_MEM", file: !100, line: 87, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_mem_st", file: !145, line: 38, size: 256, align: 64, elements: !146)
!145 = !DIFile(filename: "include/openssl/buffer.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!146 = !{!147, !148, !149, !150}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !144, file: !145, line: 39, baseType: !80, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !144, file: !145, line: 40, baseType: !5, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !144, file: !145, line: 41, baseType: !80, size: 64, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !144, file: !145, line: 42, baseType: !82, size: 64, align: 64, offset: 192)
!151 = !DILocation(line: 39, column: 14, scope: !130)
!152 = !DILocalVariable(name: "p", scope: !130, file: !16, line: 40, type: !9)
!153 = !DILocation(line: 40, column: 26, scope: !130)
!154 = !DILocalVariable(name: "ret", scope: !130, file: !16, line: 41, type: !4)
!155 = !DILocation(line: 41, column: 11, scope: !130)
!156 = !DILocalVariable(name: "len", scope: !130, file: !16, line: 42, type: !11)
!157 = !DILocation(line: 42, column: 9, scope: !130)
!158 = !DILocation(line: 44, column: 29, scope: !130)
!159 = !DILocation(line: 44, column: 11, scope: !130)
!160 = !DILocation(line: 44, column: 9, scope: !130)
!161 = !DILocation(line: 45, column: 9, scope: !162)
!162 = distinct !DILexicalBlock(scope: !130, file: !16, line: 45, column: 9)
!163 = !DILocation(line: 45, column: 13, scope: !162)
!164 = !DILocation(line: 45, column: 9, scope: !130)
!165 = !DILocation(line: 46, column: 9, scope: !162)
!166 = !DILocation(line: 48, column: 26, scope: !130)
!167 = !DILocation(line: 48, column: 29, scope: !130)
!168 = !DILocation(line: 48, column: 7, scope: !130)
!169 = !DILocation(line: 49, column: 11, scope: !130)
!170 = !DILocation(line: 49, column: 15, scope: !130)
!171 = !DILocation(line: 49, column: 22, scope: !130)
!172 = !DILocation(line: 49, column: 9, scope: !130)
!173 = !DILocation(line: 49, column: 5, scope: !130)
!174 = !DILocation(line: 51, column: 18, scope: !130)
!175 = !DILocation(line: 51, column: 5, scope: !130)
!176 = !DILocation(line: 52, column: 12, scope: !130)
!177 = !DILocation(line: 52, column: 5, scope: !130)
!178 = distinct !DISubprogram(name: "asn1_d2i_read_bio", scope: !16, file: !16, line: 94, type: !179, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!179 = !DISubroutineType(types: !180)
!180 = !{!11, !98, !181}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!182 = !DILocalVariable(name: "in", arg: 1, scope: !178, file: !16, line: 94, type: !98)
!183 = !DILocation(line: 94, column: 28, scope: !178)
!184 = !DILocalVariable(name: "pb", arg: 2, scope: !178, file: !16, line: 94, type: !181)
!185 = !DILocation(line: 94, column: 42, scope: !178)
!186 = !DILocalVariable(name: "b", scope: !178, file: !16, line: 96, type: !142)
!187 = !DILocation(line: 96, column: 14, scope: !178)
!188 = !DILocalVariable(name: "p", scope: !178, file: !16, line: 97, type: !7)
!189 = !DILocation(line: 97, column: 20, scope: !178)
!190 = !DILocalVariable(name: "i", scope: !178, file: !16, line: 98, type: !11)
!191 = !DILocation(line: 98, column: 9, scope: !178)
!192 = !DILocalVariable(name: "want", scope: !178, file: !16, line: 99, type: !80)
!193 = !DILocation(line: 99, column: 12, scope: !178)
!194 = !DILocalVariable(name: "eos", scope: !178, file: !16, line: 100, type: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !196, line: 51, baseType: !197)
!196 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!197 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!198 = !DILocation(line: 100, column: 14, scope: !178)
!199 = !DILocalVariable(name: "off", scope: !178, file: !16, line: 101, type: !80)
!200 = !DILocation(line: 101, column: 12, scope: !178)
!201 = !DILocalVariable(name: "len", scope: !178, file: !16, line: 102, type: !80)
!202 = !DILocation(line: 102, column: 12, scope: !178)
!203 = !DILocalVariable(name: "q", scope: !178, file: !16, line: 104, type: !9)
!204 = !DILocation(line: 104, column: 26, scope: !178)
!205 = !DILocalVariable(name: "slen", scope: !178, file: !16, line: 105, type: !29)
!206 = !DILocation(line: 105, column: 10, scope: !178)
!207 = !DILocalVariable(name: "inf", scope: !178, file: !16, line: 106, type: !11)
