; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--conf--libcrypto-shlib-conf_api.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--conf--libcrypto-shlib-conf_api.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CONF_VALUE = type { i8*, i8*, i8* }
%struct.conf_st = type { %struct.conf_method_st*, i8*, %struct.lhash_st_CONF_VALUE* }
%struct.conf_method_st = type { i8*, %struct.conf_st* (%struct.conf_method_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*, %struct.bio_st*, i64*)*, i32 (%struct.conf_st*, %struct.bio_st*)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8*, i64*)* }
%struct.bio_st = type opaque
%struct.lhash_st_CONF_VALUE = type { %union.lh_CONF_VALUE_dummy }
%union.lh_CONF_VALUE_dummy = type { i8* }
%struct.lhash_st = type opaque
%struct.stack_st_CONF_VALUE = type opaque
%struct.stack_st = type opaque

@.str = private unnamed_addr constant [23 x i8] c"crypto/conf/conf_api.c\00", align 1
@.str.1 = private unnamed_addr constant [4 x i8] c"ENV\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c"default\00", align 1

; Function Attrs: nounwind uwtable
define %struct.CONF_VALUE* @_CONF_get_section(%struct.conf_st* %conf, i8* %section) #0 !dbg !59 {
entry:

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--conf--libcrypto-shlib-conf_api.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{}
!3 = !{!4, !5, !7, !10, !17, !21, !25, !27, !38, !42, !46, !50, !54}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_VALUE", file: !9, line: 30, flags: DIFlagFwdDecl)
!9 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_VALUE", file: !9, line: 28, baseType: !12)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 24, size: 192, align: 64, elements: !13)
!13 = !{!14, !15, !16}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !12, file: !9, line: 25, baseType: !5, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !12, file: !9, line: 26, baseType: !5, size: 64, align: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !12, file: !9, line: 27, baseType: !5, size: 64, align: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_LHASH", file: !19, line: 29, baseType: !20)
!19 = !DIFile(filename: "include/openssl/lhash.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "lhash_st", file: !19, line: 29, flags: DIFlagFwdDecl)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !23, line: 17, baseType: !24)
!23 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !23, line: 17, flags: DIFlagFwdDecl)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lhash_st_CONF_VALUE", file: !9, line: 31, size: 64, align: 64, elements: !29)
!29 = !{!30}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !28, file: !9, line: 31, baseType: !31, size: 64, align: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "lh_CONF_VALUE_dummy", file: !9, line: 31, size: 64, align: 64, elements: !32)
!32 = !{!33, !34, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !31, file: !9, line: 31, baseType: !4, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !31, file: !9, line: 31, baseType: !35, size: 64, align: 64)
!35 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !31, file: !9, line: 31, baseType: !37, size: 32, align: 32)
!37 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_LH_HASHFUNC", file: !19, line: 26, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!35, !25}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_LH_COMPFUNC", file: !19, line: 25, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!37, !25, !25}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_LH_DOALL_FUNCARG", file: !19, line: 28, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !4, !4}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_LH_DOALL_FUNC", file: !19, line: 27, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !4}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!56 = !{i32 2, !"Dwarf Version", i32 4}
!57 = !{i32 2, !"Debug Info Version", i32 3}
!58 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!59 = distinct !DISubprogram(name: "_CONF_get_section", scope: !60, file: !60, line: 23, type: !61, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!60 = !DIFile(filename: "crypto/conf/conf_api.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!61 = !DISubroutineType(types: !62)
!62 = !{!10, !63, !75}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF", file: !66, line: 144, baseType: !67)
!66 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_st", file: !9, line: 103, size: 192, align: 64, elements: !68)
!68 = !{!69, !110, !111}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !67, file: !9, line: 104, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_METHOD", file: !9, line: 35, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_method_st", file: !9, line: 37, size: 640, align: 64, elements: !73)
!73 = !{!74, !77, !82, !86, !87, !88, !97, !101, !105, !106}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !72, file: !9, line: 38, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !72, file: !9, line: 39, baseType: !78, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!81, !70}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !72, file: !9, line: 40, baseType: !83, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!37, !81}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !72, file: !9, line: 41, baseType: !83, size: 64, align: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_data", scope: !72, file: !9, line: 42, baseType: !83, size: 64, align: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "load_bio", scope: !72, file: !9, line: 43, baseType: !89, size: 64, align: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!37, !81, !92, !95}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !66, line: 79, baseType: !94)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !66, line: 79, flags: DIFlagFwdDecl)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !72, file: !9, line: 44, baseType: !98, size: 64, align: 64, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!37, !63, !92}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "is_number", scope: !72, file: !9, line: 45, baseType: !102, size: 64, align: 64, offset: 448)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!37, !63, !6}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "to_int", scope: !72, file: !9, line: 46, baseType: !102, size: 64, align: 64, offset: 512)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !72, file: !9, line: 47, baseType: !107, size: 64, align: 64, offset: 576)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!37, !81, !75, !95}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "meth_data", scope: !67, file: !9, line: 105, baseType: !4, size: 64, align: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !67, file: !9, line: 106, baseType: !27, size: 64, align: 64, offset: 128)
!112 = !DILocalVariable(name: "conf", arg: 1, scope: !59, file: !60, line: 23, type: !63)
!113 = !DIExpression()
!114 = !DILocation(line: 23, column: 43, scope: !59)
!115 = !DILocalVariable(name: "section", arg: 2, scope: !59, file: !60, line: 23, type: !75)
!116 = !DILocation(line: 23, column: 61, scope: !59)
!117 = !DILocalVariable(name: "v", scope: !59, file: !60, line: 25, type: !10)
!118 = !DILocation(line: 25, column: 17, scope: !59)
!119 = !DILocalVariable(name: "vv", scope: !59, file: !60, line: 25, type: !11)
!120 = !DILocation(line: 25, column: 20, scope: !59)
!121 = !DILocation(line: 27, column: 10, scope: !122)
!122 = distinct !DILexicalBlock(scope: !59, file: !60, line: 27, column: 9)
!123 = !DILocation(line: 27, column: 15, scope: !122)
!124 = !DILocation(line: 27, column: 23, scope: !122)
!125 = !DILocation(line: 27, column: 27, scope: !126)
!126 = !DILexicalBlockFile(scope: !122, file: !60, discriminator: 1)
!127 = !DILocation(line: 27, column: 35, scope: !126)
!128 = !DILocation(line: 27, column: 9, scope: !126)
!129 = !DILocation(line: 28, column: 9, scope: !122)
!130 = !DILocation(line: 29, column: 8, scope: !59)
!131 = !DILocation(line: 29, column: 13, scope: !59)
!132 = !DILocation(line: 30, column: 26, scope: !59)
!133 = !DILocation(line: 30, column: 8, scope: !59)
!134 = !DILocation(line: 30, column: 16, scope: !59)
!135 = !DILocation(line: 31, column: 32, scope: !59)
!136 = !DILocation(line: 31, column: 38, scope: !59)
!137 = !DILocation(line: 31, column: 9, scope: !59)
!138 = !DILocation(line: 31, column: 7, scope: !59)
!139 = !DILocation(line: 32, column: 12, scope: !59)
!140 = !DILocation(line: 32, column: 5, scope: !59)
!141 = !DILocation(line: 33, column: 1, scope: !59)
!142 = distinct !DISubprogram(name: "lh_CONF_VALUE_retrieve", scope: !9, file: !9, line: 31, type: !143, isLocal: true, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!143 = !DISubroutineType(types: !144)
!144 = !{!10, !27, !145}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!147 = !DILocalVariable(name: "lh", arg: 1, scope: !142, file: !9, line: 31, type: !27)
!148 = !DILocation(line: 31, column: 1124, scope: !142)
!149 = !DILocalVariable(name: "d", arg: 2, scope: !142, file: !9, line: 31, type: !145)
!150 = !DILocation(line: 31, column: 1146, scope: !142)
!151 = !DILocation(line: 31, column: 1209, scope: !142)
!152 = !DILocation(line: 31, column: 1192, scope: !142)
!153 = !DILocation(line: 31, column: 1213, scope: !142)
!154 = !DILocation(line: 31, column: 1172, scope: !142)
!155 = !DILocation(line: 31, column: 1158, scope: !142)
!156 = !DILocation(line: 31, column: 1151, scope: !142)
!157 = distinct !DISubprogram(name: "_CONF_get_section_values", scope: !60, file: !60, line: 36, type: !158, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!158 = !DISubroutineType(types: !159)
!159 = !{!7, !63, !75}
!160 = !DILocalVariable(name: "conf", arg: 1, scope: !157, file: !60, line: 36, type: !63)
!161 = !DILocation(line: 36, column: 66, scope: !157)
!162 = !DILocalVariable(name: "section", arg: 2, scope: !157, file: !60, line: 37, type: !75)
!163 = !DILocation(line: 37, column: 60, scope: !157)
!164 = !DILocalVariable(name: "v", scope: !157, file: !60, line: 39, type: !10)
!165 = !DILocation(line: 39, column: 17, scope: !157)
!166 = !DILocation(line: 41, column: 27, scope: !157)
!167 = !DILocation(line: 41, column: 33, scope: !157)
!168 = !DILocation(line: 41, column: 9, scope: !157)
!169 = !DILocation(line: 41, column: 7, scope: !157)
!170 = !DILocation(line: 42, column: 9, scope: !171)
!171 = distinct !DILexicalBlock(scope: !157, file: !60, line: 42, column: 9)
