; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--ocsp--libcrypto-shlib-ocsp_srv.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--ocsp--libcrypto-shlib-ocsp_srv.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type opaque
%struct.ocsp_request_st = type { %struct.ocsp_req_info_st, %struct.ocsp_signature_st* }
%struct.ocsp_req_info_st = type { %struct.asn1_string_st*, %struct.GENERAL_NAME_st*, %struct.stack_st_OCSP_ONEREQ*, %struct.stack_st_X509_EXTENSION* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.GENERAL_NAME_st = type { i32, %union.anon }
%union.anon = type { i8* }
%struct.stack_st_OCSP_ONEREQ = type opaque
%struct.stack_st_X509_EXTENSION = type opaque
%struct.ocsp_signature_st = type { %struct.X509_algor_st, %struct.asn1_string_st*, %struct.stack_st_X509* }
%struct.X509_algor_st = type { %struct.asn1_object_st*, %struct.asn1_type_st* }
%struct.asn1_object_st = type opaque
%struct.asn1_type_st = type { i32, %union.anon.0 }
%union.anon.0 = type { i8* }
%struct.stack_st_X509 = type opaque
%struct.stack_st = type opaque
%struct.ocsp_one_request_st = type { %struct.ocsp_cert_id_st*, %struct.stack_st_X509_EXTENSION* }
%struct.ocsp_cert_id_st = type { %struct.X509_algor_st, %struct.asn1_string_st, %struct.asn1_string_st, %struct.asn1_string_st }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--ocsp--libcrypto-shlib-ocsp_srv.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{}
!3 = !{!4, !5, !10, !114, !116, !117, !119, !121}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !8, line: 17, baseType: !9)
!8 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !8, line: 17, flags: DIFlagFwdDecl)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_ONEREQ", file: !12, line: 75, baseType: !13)
!12 = !DIFile(filename: "include/openssl/ocsp.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_one_request_st", file: !14, line: 27, size: 128, align: 64, elements: !15)
!14 = !DIFile(filename: "crypto/ocsp/ocsp_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!15 = !{!16, !111}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "reqCert", scope: !13, file: !14, line: 28, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_CERTID", file: !12, line: 71, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_cert_id_st", file: !14, line: 16, size: 704, align: 64, elements: !20)
!20 = !{!21, !108, !109, !110}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "hashAlgorithm", scope: !19, file: !14, line: 17, baseType: !22, size: 128, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !23, line: 125, baseType: !24)
!23 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !25, line: 59, size: 128, align: 64, elements: !26)
!25 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!26 = !{!27, !31}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !24, file: !25, line: 60, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !23, line: 60, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !23, line: 60, flags: DIFlagFwdDecl)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !24, file: !25, line: 61, baseType: !32, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !34, line: 473, baseType: !35)
!34 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !34, line: 444, size: 128, align: 64, elements: !36)
!36 = !{!37, !39}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !35, file: !34, line: 445, baseType: !38, size: 32, align: 32)
!38 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !35, file: !34, line: 472, baseType: !40, size: 64, align: 64, offset: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !35, file: !34, line: 446, size: 64, align: 64, elements: !41)
!41 = !{!42, !45, !47, !59, !60, !63, !66, !69, !72, !75, !78, !81, !84, !87, !90, !93, !96, !99, !102, !103, !104}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !40, file: !34, line: 447, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !40, file: !34, line: 448, baseType: !46, size: 32, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !23, line: 56, baseType: !38)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !40, file: !34, line: 449, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !23, line: 55, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !34, line: 146, size: 192, align: 64, elements: !51)
!51 = !{!52, !53, !54, !57}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !50, file: !34, line: 147, baseType: !38, size: 32, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !50, file: !34, line: 148, baseType: !38, size: 32, align: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !50, file: !34, line: 149, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !50, file: !34, line: 155, baseType: !58, size: 64, align: 64, offset: 128)
!58 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !40, file: !34, line: 450, baseType: !28, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !40, file: !34, line: 451, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !23, line: 40, baseType: !50)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !40, file: !34, line: 452, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !23, line: 41, baseType: !50)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !40, file: !34, line: 453, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !23, line: 42, baseType: !50)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !40, file: !34, line: 454, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !23, line: 43, baseType: !50)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !40, file: !34, line: 455, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !23, line: 44, baseType: !50)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !40, file: !34, line: 456, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !23, line: 45, baseType: !50)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !40, file: !34, line: 457, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !23, line: 46, baseType: !50)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !40, file: !34, line: 458, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !23, line: 47, baseType: !50)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !40, file: !34, line: 459, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !23, line: 49, baseType: !50)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !40, file: !34, line: 460, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !23, line: 48, baseType: !50)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !40, file: !34, line: 461, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !23, line: 50, baseType: !50)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !40, file: !34, line: 462, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !23, line: 52, baseType: !50)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !40, file: !34, line: 463, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !23, line: 53, baseType: !50)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !40, file: !34, line: 464, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !23, line: 54, baseType: !50)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !40, file: !34, line: 469, baseType: !48, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !40, file: !34, line: 470, baseType: !48, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !40, file: !34, line: 471, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !34, line: 213, baseType: !107)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !34, line: 213, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "issuerNameHash", scope: !19, file: !14, line: 18, baseType: !71, size: 192, align: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "issuerKeyHash", scope: !19, file: !14, line: 19, baseType: !71, size: 192, align: 64, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "serialNumber", scope: !19, file: !14, line: 20, baseType: !62, size: 192, align: 64, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "singleRequestExtensions", scope: !13, file: !14, line: 29, baseType: !112, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_EXTENSION", file: !25, line: 83, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_OCSP_SINGLERESP", file: !12, line: 106, flags: DIFlagFwdDecl)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509", file: !25, line: 99, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !23, line: 124, baseType: !123)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !23, line: 124, flags: DIFlagFwdDecl)
!124 = !{i32 2, !"Dwarf Version", i32 4}
!125 = !{i32 2, !"Debug Info Version", i32 3}
!126 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!127 = distinct !DISubprogram(name: "OCSP_request_onereq_count", scope: !128, file: !128, line: 24, type: !129, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!128 = !DIFile(filename: "crypto/ocsp/ocsp_srv.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!129 = !DISubroutineType(types: !130)
!130 = !{!38, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_REQUEST", file: !12, line: 81, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_request_st", file: !14, line: 60, size: 320, align: 64, elements: !134)
!134 = !{!135, !184}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tbsRequest", scope: !133, file: !14, line: 61, baseType: !136, size: 256, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_REQINFO", file: !12, line: 79, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_req_info_st", file: !14, line: 38, size: 256, align: 64, elements: !138)
!138 = !{!139, !140, !180, !183}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !137, file: !14, line: 39, baseType: !61, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "requestorName", scope: !137, file: !14, line: 40, baseType: !141, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "GENERAL_NAME", file: !143, line: 153, baseType: !144)
!143 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GENERAL_NAME_st", file: !143, line: 123, size: 128, align: 64, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !144, file: !143, line: 133, baseType: !38, size: 32, align: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !144, file: !143, line: 152, baseType: !148, size: 64, align: 64, offset: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !144, file: !143, line: 134, size: 64, align: 64, elements: !149)
!149 = !{!150, !151, !158, !159, !160, !161, !165, !172, !173, !174, !175, !176, !177, !178, !179}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !148, file: !143, line: 135, baseType: !43, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "otherName", scope: !148, file: !143, line: 136, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "OTHERNAME", file: !143, line: 116, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "otherName_st", file: !143, line: 113, size: 128, align: 64, elements: !155)
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "type_id", scope: !154, file: !143, line: 114, baseType: !28, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !154, file: !143, line: 115, baseType: !32, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "rfc822Name", scope: !148, file: !143, line: 137, baseType: !79, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "dNSName", scope: !148, file: !143, line: 138, baseType: !79, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "x400Address", scope: !148, file: !143, line: 139, baseType: !32, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "directoryName", scope: !148, file: !143, line: 140, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !23, line: 129, baseType: !164)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !23, line: 129, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ediPartyName", scope: !148, file: !143, line: 141, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDIPARTYNAME", file: !143, line: 121, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EDIPartyName_st", file: !143, line: 118, size: 128, align: 64, elements: !169)
!169 = !{!170, !171}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nameAssigner", scope: !168, file: !143, line: 119, baseType: !48, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "partyName", scope: !168, file: !143, line: 120, baseType: !48, size: 64, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "uniformResourceIdentifier", scope: !148, file: !143, line: 142, baseType: !79, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "iPAddress", scope: !148, file: !143, line: 143, baseType: !70, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "registeredID", scope: !148, file: !143, line: 144, baseType: !28, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !148, file: !143, line: 146, baseType: !70, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "dirn", scope: !148, file: !143, line: 147, baseType: !162, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ia5", scope: !148, file: !143, line: 148, baseType: !79, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "rid", scope: !148, file: !143, line: 150, baseType: !28, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !148, file: !143, line: 151, baseType: !32, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "requestList", scope: !137, file: !14, line: 41, baseType: !181, size: 64, align: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_OCSP_ONEREQ", file: !12, line: 77, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "requestExtensions", scope: !137, file: !14, line: 42, baseType: !112, size: 64, align: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "optionalSignature", scope: !133, file: !14, line: 62, baseType: !185, size: 64, align: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_SIGNATURE", file: !12, line: 80, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_signature_st", file: !14, line: 50, size: 256, align: 64, elements: !188)
!188 = !{!189, !190, !191}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "signatureAlgorithm", scope: !187, file: !14, line: 51, baseType: !22, size: 128, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !187, file: !14, line: 52, baseType: !67, size: 64, align: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "certs", scope: !187, file: !14, line: 53, baseType: !119, size: 64, align: 64, offset: 192)
!192 = !DILocalVariable(name: "req", arg: 1, scope: !127, file: !128, line: 24, type: !131)
!193 = !DIExpression()
!194 = !DILocation(line: 24, column: 45, scope: !127)
!195 = !DILocation(line: 26, column: 31, scope: !127)
!196 = !DILocation(line: 26, column: 36, scope: !127)
!197 = !DILocation(line: 26, column: 47, scope: !127)
!198 = !DILocation(line: 26, column: 12, scope: !127)
!199 = !DILocation(line: 26, column: 5, scope: !127)
!200 = distinct !DISubprogram(name: "sk_OCSP_ONEREQ_num", scope: !12, file: !12, line: 77, type: !201, isLocal: true, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!201 = !DISubroutineType(types: !202)
!202 = !{!38, !203}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!205 = !DILocalVariable(name: "sk", arg: 1, scope: !200, file: !12, line: 77, type: !203)
!206 = !DILocation(line: 77, column: 354, scope: !200)
!207 = !DILocation(line: 77, column: 405, scope: !200)
!208 = !DILocation(line: 77, column: 382, scope: !200)
!209 = !DILocation(line: 77, column: 367, scope: !200)
!210 = !DILocation(line: 77, column: 360, scope: !200)
!211 = distinct !DISubprogram(name: "OCSP_request_onereq_get0", scope: !128, file: !128, line: 29, type: !212, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!212 = !DISubroutineType(types: !213)
!213 = !{!10, !131, !38}
!214 = !DILocalVariable(name: "req", arg: 1, scope: !211, file: !128, line: 29, type: !131)
!215 = !DILocation(line: 29, column: 53, scope: !211)
!216 = !DILocalVariable(name: "i", arg: 2, scope: !211, file: !128, line: 29, type: !38)
!217 = !DILocation(line: 29, column: 62, scope: !211)
!218 = !DILocation(line: 31, column: 33, scope: !211)
!219 = !DILocation(line: 31, column: 38, scope: !211)
!220 = !DILocation(line: 31, column: 49, scope: !211)
!221 = !DILocation(line: 31, column: 62, scope: !211)
!222 = !DILocation(line: 31, column: 12, scope: !211)
!223 = !DILocation(line: 31, column: 5, scope: !211)
!224 = distinct !DISubprogram(name: "sk_OCSP_ONEREQ_value", scope: !12, file: !12, line: 77, type: !225, isLocal: true, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!225 = !DISubroutineType(types: !226)
!226 = !{!10, !203, !38}
!227 = !DILocalVariable(name: "sk", arg: 1, scope: !224, file: !12, line: 77, type: !203)
!228 = !DILocation(line: 77, column: 519, scope: !224)
!229 = !DILocalVariable(name: "idx", arg: 2, scope: !224, file: !12, line: 77, type: !38)
!230 = !DILocation(line: 77, column: 527, scope: !224)
!231 = !DILocation(line: 77, column: 596, scope: !224)
!232 = !DILocation(line: 77, column: 573, scope: !224)
!233 = !DILocation(line: 77, column: 600, scope: !224)
!234 = !DILocation(line: 77, column: 556, scope: !224)
!235 = !DILocation(line: 77, column: 541, scope: !224)
!236 = !DILocation(line: 77, column: 534, scope: !224)
!237 = distinct !DISubprogram(name: "OCSP_onereq_get0_id", scope: !128, file: !128, line: 34, type: !238, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!238 = !DISubroutineType(types: !239)
!239 = !{!17, !10}
!240 = !DILocalVariable(name: "one", arg: 1, scope: !237, file: !128, line: 34, type: !10)
!241 = !DILocation(line: 34, column: 47, scope: !237)
!242 = !DILocation(line: 36, column: 12, scope: !237)
!243 = !DILocation(line: 36, column: 17, scope: !237)
!244 = !DILocation(line: 36, column: 5, scope: !237)
!245 = distinct !DISubprogram(name: "OCSP_id_get0_info", scope: !128, file: !128, line: 39, type: !246, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!246 = !DISubroutineType(types: !247)
!247 = !{!38, !248, !249, !248, !250, !17}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!251 = !DILocalVariable(name: "piNameHash", arg: 1, scope: !245, file: !128, line: 39, type: !248)
!252 = !DILocation(line: 39, column: 43, scope: !245)
!253 = !DILocalVariable(name: "pmd", arg: 2, scope: !245, file: !128, line: 39, type: !249)
!254 = !DILocation(line: 39, column: 69, scope: !245)
!255 = !DILocalVariable(name: "pikeyHash", arg: 3, scope: !245, file: !128, line: 40, type: !248)
!256 = !DILocation(line: 40, column: 43, scope: !245)
!257 = !DILocalVariable(name: "pserial", arg: 4, scope: !245, file: !128, line: 41, type: !250)
!258 = !DILocation(line: 41, column: 38, scope: !245)
!259 = !DILocalVariable(name: "cid", arg: 5, scope: !245, file: !128, line: 41, type: !17)
!260 = !DILocation(line: 41, column: 60, scope: !245)
!261 = !DILocation(line: 43, column: 10, scope: !262)
!262 = distinct !DILexicalBlock(scope: !245, file: !128, line: 43, column: 9)
!263 = !DILocation(line: 43, column: 9, scope: !245)
!264 = !DILocation(line: 44, column: 9, scope: !262)
!265 = !DILocation(line: 45, column: 9, scope: !266)
!266 = distinct !DILexicalBlock(scope: !245, file: !128, line: 45, column: 9)
!267 = !DILocation(line: 45, column: 9, scope: !245)
!268 = !DILocation(line: 46, column: 16, scope: !266)
!269 = !DILocation(line: 46, column: 21, scope: !266)
!270 = !DILocation(line: 46, column: 35, scope: !266)
!271 = !DILocation(line: 46, column: 10, scope: !266)
!272 = !DILocation(line: 46, column: 14, scope: !266)
!273 = !DILocation(line: 46, column: 9, scope: !266)
!274 = !DILocation(line: 47, column: 9, scope: !275)
!275 = distinct !DILexicalBlock(scope: !245, file: !128, line: 47, column: 9)
!276 = !DILocation(line: 47, column: 9, scope: !245)
!277 = !DILocation(line: 48, column: 24, scope: !275)
!278 = !DILocation(line: 48, column: 29, scope: !275)
!279 = !DILocation(line: 48, column: 10, scope: !275)
!280 = !DILocation(line: 48, column: 21, scope: !275)
!281 = !DILocation(line: 48, column: 9, scope: !275)
!282 = !DILocation(line: 49, column: 9, scope: !283)
!283 = distinct !DILexicalBlock(scope: !245, file: !128, line: 49, column: 9)
!284 = !DILocation(line: 49, column: 9, scope: !245)
!285 = !DILocation(line: 50, column: 23, scope: !283)
!286 = !DILocation(line: 50, column: 28, scope: !283)
!287 = !DILocation(line: 50, column: 10, scope: !283)
!288 = !DILocation(line: 50, column: 20, scope: !283)
!289 = !DILocation(line: 50, column: 9, scope: !283)
!290 = !DILocation(line: 51, column: 9, scope: !291)
!291 = distinct !DILexicalBlock(scope: !245, file: !128, line: 51, column: 9)
!292 = !DILocation(line: 51, column: 9, scope: !245)
!293 = !DILocation(line: 52, column: 21, scope: !291)
!294 = !DILocation(line: 52, column: 26, scope: !291)
!295 = !DILocation(line: 52, column: 10, scope: !291)
!296 = !DILocation(line: 52, column: 18, scope: !291)
!297 = !DILocation(line: 52, column: 9, scope: !291)
!298 = !DILocation(line: 53, column: 5, scope: !245)
!299 = !DILocation(line: 54, column: 1, scope: !245)
!300 = distinct !DISubprogram(name: "OCSP_request_is_signed", scope: !128, file: !128, line: 56, type: !129, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!301 = !DILocalVariable(name: "req", arg: 1, scope: !300, file: !128, line: 56, type: !131)
!302 = !DILocation(line: 56, column: 42, scope: !300)
!303 = !DILocation(line: 58, column: 9, scope: !304)
!304 = distinct !DILexicalBlock(scope: !300, file: !128, line: 58, column: 9)
!305 = !DILocation(line: 58, column: 14, scope: !304)
!306 = !DILocation(line: 58, column: 9, scope: !300)
!307 = !DILocation(line: 59, column: 9, scope: !304)
!308 = !DILocation(line: 60, column: 5, scope: !300)
!309 = !DILocation(line: 61, column: 1, scope: !300)
!310 = distinct !DISubprogram(name: "OCSP_response_create", scope: !128, file: !128, line: 64, type: !311, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!311 = !DISubroutineType(types: !312)
!312 = !{!313, !38, !325}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_RESPONSE", file: !23, line: 170, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_response_st", file: !14, line: 89, size: 128, align: 64, elements: !316)
!316 = !{!317, !318}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "responseStatus", scope: !315, file: !14, line: 90, baseType: !64, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "responseBytes", scope: !315, file: !14, line: 91, baseType: !319, size: 64, align: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_RESPBYTES", file: !12, line: 90, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_resp_bytes_st", file: !14, line: 80, size: 128, align: 64, elements: !322)
!322 = !{!323, !324}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "responseType", scope: !321, file: !14, line: 81, baseType: !28, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !321, file: !14, line: 82, baseType: !70, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_BASICRESP", file: !12, line: 110, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_basic_response_st", file: !14, line: 189, size: 640, align: 64, elements: !328)
!328 = !{!329, !347, !348, !349}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tbsResponseData", scope: !327, file: !14, line: 190, baseType: !330, size: 384, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_RESPDATA", file: !12, line: 108, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_response_data_st", file: !14, line: 155, size: 384, align: 64, elements: !332)
!332 = !{!333, !334, !344, !345, !346}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !331, file: !14, line: 156, baseType: !61, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "responderId", scope: !331, file: !14, line: 157, baseType: !335, size: 128, align: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_RESPID", file: !23, line: 171, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_responder_id_st", file: !14, line: 98, size: 128, align: 64, elements: !337)
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !336, file: !14, line: 99, baseType: !38, size: 32, align: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !336, file: !14, line: 103, baseType: !340, size: 64, align: 64, offset: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !336, file: !14, line: 100, size: 64, align: 64, elements: !341)
!341 = !{!342, !343}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "byName", scope: !340, file: !14, line: 101, baseType: !162, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "byKey", scope: !340, file: !14, line: 102, baseType: !70, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "producedAt", scope: !331, file: !14, line: 158, baseType: !94, size: 64, align: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "responses", scope: !331, file: !14, line: 159, baseType: !114, size: 64, align: 64, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "responseExtensions", scope: !331, file: !14, line: 160, baseType: !112, size: 64, align: 64, offset: 320)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "signatureAlgorithm", scope: !327, file: !14, line: 191, baseType: !22, size: 128, align: 64, offset: 384)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !327, file: !14, line: 192, baseType: !67, size: 64, align: 64, offset: 512)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "certs", scope: !327, file: !14, line: 193, baseType: !119, size: 64, align: 64, offset: 576)
!350 = !DILocalVariable(name: "status", arg: 1, scope: !310, file: !128, line: 64, type: !38)
!351 = !DILocation(line: 64, column: 41, scope: !310)
!352 = !DILocalVariable(name: "bs", arg: 2, scope: !310, file: !128, line: 64, type: !325)
!353 = !DILocation(line: 64, column: 65, scope: !310)
!354 = !DILocalVariable(name: "rsp", scope: !310, file: !128, line: 66, type: !313)
!355 = !DILocation(line: 66, column: 20, scope: !310)
!356 = !DILocation(line: 68, column: 16, scope: !357)
!357 = distinct !DILexicalBlock(scope: !310, file: !128, line: 68, column: 9)
!358 = !DILocation(line: 68, column: 14, scope: !357)
!359 = !DILocation(line: 68, column: 37, scope: !357)
!360 = !DILocation(line: 68, column: 9, scope: !310)
!361 = !DILocation(line: 69, column: 9, scope: !357)
!362 = !DILocation(line: 70, column: 31, scope: !363)
!363 = distinct !DILexicalBlock(scope: !310, file: !128, line: 70, column: 9)
!364 = !DILocation(line: 70, column: 36, scope: !363)
!365 = !DILocation(line: 70, column: 52, scope: !363)
!366 = !DILocation(line: 70, column: 11, scope: !363)
!367 = !DILocation(line: 70, column: 9, scope: !310)
!368 = !DILocation(line: 71, column: 9, scope: !363)
!369 = !DILocation(line: 72, column: 10, scope: !370)
!370 = distinct !DILexicalBlock(scope: !310, file: !128, line: 72, column: 9)
!371 = !DILocation(line: 72, column: 9, scope: !310)
!372 = !DILocation(line: 73, column: 16, scope: !370)
!373 = !DILocation(line: 73, column: 9, scope: !370)
!374 = !DILocation(line: 74, column: 31, scope: !375)
!375 = distinct !DILexicalBlock(scope: !310, file: !128, line: 74, column: 9)
!376 = !DILocation(line: 74, column: 10, scope: !375)
!377 = !DILocation(line: 74, column: 15, scope: !375)
!378 = !DILocation(line: 74, column: 29, scope: !375)
!379 = !DILocation(line: 74, column: 53, scope: !375)
!380 = !DILocation(line: 74, column: 9, scope: !310)
!381 = !DILocation(line: 75, column: 9, scope: !375)
!382 = !DILocation(line: 76, column: 40, scope: !310)
!383 = !DILocation(line: 76, column: 5, scope: !310)
!384 = !DILocation(line: 76, column: 10, scope: !310)
!385 = !DILocation(line: 76, column: 25, scope: !310)
!386 = !DILocation(line: 76, column: 38, scope: !310)
!387 = !DILocation(line: 78, column: 10, scope: !388)
!388 = distinct !DILexicalBlock(scope: !310, file: !128, line: 77, column: 9)
!389 = !DILocation(line: 78, column: 39, scope: !388)
!390 = !DILocation(line: 78, column: 44, scope: !388)
!391 = !DILocation(line: 78, column: 59, scope: !388)
!392 = !DILocation(line: 77, column: 10, scope: !388)
!393 = !DILocation(line: 77, column: 9, scope: !310)
!394 = !DILocation(line: 79, column: 10, scope: !388)
!395 = !DILocation(line: 80, column: 12, scope: !310)
!396 = !DILocation(line: 80, column: 5, scope: !310)
!397 = !DILocation(line: 82, column: 24, scope: !310)
!398 = !DILocation(line: 82, column: 5, scope: !310)
!399 = !DILocation(line: 83, column: 5, scope: !310)
!400 = !DILocation(line: 84, column: 1, scope: !310)
!401 = distinct !DISubprogram(name: "OCSP_basic_add1_status", scope: !128, file: !128, line: 86, type: !402, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!402 = !DISubroutineType(types: !403)
!403 = !{!404, !325, !17, !38, !38, !432, !432, !432}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_SINGLERESP", file: !12, line: 104, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_single_response_st", file: !14, line: 140, size: 320, align: 64, elements: !407)
!407 = !{!408, !409, !429, !430, !431}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "certId", scope: !406, file: !14, line: 141, baseType: !17, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "certStatus", scope: !406, file: !14, line: 142, baseType: !410, size: 64, align: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_CERTSTATUS", file: !12, line: 103, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_cert_status_st", file: !14, line: 124, size: 128, align: 64, elements: !413)
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !412, file: !14, line: 125, baseType: !38, size: 32, align: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !412, file: !14, line: 130, baseType: !416, size: 64, align: 64, offset: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !412, file: !14, line: 126, size: 64, align: 64, elements: !417)
!417 = !{!418, !421, !428}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "good", scope: !416, file: !14, line: 127, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_NULL", file: !23, line: 57, baseType: !38)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "revoked", scope: !416, file: !14, line: 128, baseType: !422, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_REVOKEDINFO", file: !12, line: 97, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_revoked_info_st", file: !14, line: 114, size: 128, align: 64, elements: !425)
!425 = !{!426, !427}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "revocationTime", scope: !424, file: !14, line: 115, baseType: !94, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "revocationReason", scope: !424, file: !14, line: 116, baseType: !64, size: 64, align: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "unknown", scope: !416, file: !14, line: 129, baseType: !419, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "thisUpdate", scope: !406, file: !14, line: 143, baseType: !94, size: 64, align: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "nextUpdate", scope: !406, file: !14, line: 144, baseType: !94, size: 64, align: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "singleExtensions", scope: !406, file: !14, line: 145, baseType: !112, size: 64, align: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TIME", file: !23, line: 51, baseType: !50)
!434 = !DILocalVariable(name: "rsp", arg: 1, scope: !401, file: !128, line: 86, type: !325)
!435 = !DILocation(line: 86, column: 57, scope: !401)
!436 = !DILocalVariable(name: "cid", arg: 2, scope: !401, file: !128, line: 87, type: !17)
!437 = !DILocation(line: 87, column: 54, scope: !401)
!438 = !DILocalVariable(name: "status", arg: 3, scope: !401, file: !128, line: 88, type: !38)
!439 = !DILocation(line: 88, column: 45, scope: !401)
!440 = !DILocalVariable(name: "reason", arg: 4, scope: !401, file: !128, line: 88, type: !38)
!441 = !DILocation(line: 88, column: 57, scope: !401)
!442 = !DILocalVariable(name: "revtime", arg: 5, scope: !401, file: !128, line: 89, type: !432)
!443 = !DILocation(line: 89, column: 52, scope: !401)
!444 = !DILocalVariable(name: "thisupd", arg: 6, scope: !401, file: !128, line: 90, type: !432)
!445 = !DILocation(line: 90, column: 52, scope: !401)
!446 = !DILocalVariable(name: "nextupd", arg: 7, scope: !401, file: !128, line: 91, type: !432)
!447 = !DILocation(line: 91, column: 52, scope: !401)
!448 = !DILocalVariable(name: "single", scope: !401, file: !128, line: 93, type: !404)
!449 = !DILocation(line: 93, column: 22, scope: !401)
!450 = !DILocalVariable(name: "cs", scope: !401, file: !128, line: 94, type: !410)
!451 = !DILocation(line: 94, column: 22, scope: !401)
!452 = !DILocalVariable(name: "ri", scope: !401, file: !128, line: 95, type: !422)
!453 = !DILocation(line: 95, column: 23, scope: !401)
!454 = !DILocation(line: 97, column: 9, scope: !455)
!455 = distinct !DILexicalBlock(scope: !401, file: !128, line: 97, column: 9)
!456 = !DILocation(line: 97, column: 14, scope: !455)
!457 = !DILocation(line: 97, column: 30, scope: !455)
!458 = !DILocation(line: 97, column: 40, scope: !455)
!459 = !DILocation(line: 98, column: 8, scope: !455)
!460 = !DILocation(line: 99, column: 19, scope: !455)
!461 = !DILocation(line: 98, column: 12, scope: !462)
!462 = !DILexicalBlockFile(scope: !455, file: !128, discriminator: 1)
!463 = !DILocation(line: 98, column: 17, scope: !462)
!464 = !DILocation(line: 98, column: 33, scope: !462)
!465 = !DILocation(line: 99, column: 17, scope: !455)
!466 = !DILocation(line: 99, column: 50, scope: !455)
!467 = !DILocation(line: 97, column: 9, scope: !468)
!468 = !DILexicalBlockFile(scope: !401, file: !128, discriminator: 1)
!469 = !DILocation(line: 100, column: 9, scope: !455)
!470 = !DILocation(line: 102, column: 19, scope: !471)
!471 = distinct !DILexicalBlock(scope: !401, file: !128, line: 102, column: 9)
!472 = !DILocation(line: 102, column: 17, scope: !471)
!473 = !DILocation(line: 102, column: 42, scope: !471)
!474 = !DILocation(line: 102, column: 9, scope: !401)
!475 = !DILocation(line: 103, column: 9, scope: !471)
!476 = !DILocation(line: 105, column: 39, scope: !477)
!477 = distinct !DILexicalBlock(scope: !401, file: !128, line: 105, column: 9)
!478 = !DILocation(line: 105, column: 49, scope: !477)
!479 = !DILocation(line: 105, column: 57, scope: !477)
!480 = !DILocation(line: 105, column: 10, scope: !477)
!481 = !DILocation(line: 105, column: 9, scope: !401)
!482 = !DILocation(line: 106, column: 9, scope: !477)
!483 = !DILocation(line: 107, column: 9, scope: !484)
!484 = distinct !DILexicalBlock(scope: !401, file: !128, line: 107, column: 9)
!485 = !DILocation(line: 107, column: 17, scope: !484)
!486 = !DILocation(line: 108, column: 39, scope: !484)
!487 = !DILocation(line: 108, column: 49, scope: !484)
!488 = !DILocation(line: 108, column: 57, scope: !484)
!489 = !DILocation(line: 108, column: 10, scope: !484)
!490 = !DILocation(line: 107, column: 9, scope: !468)
!491 = !DILocation(line: 109, column: 9, scope: !484)
