; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--ui--libcrypto-shlib-ui_openssl.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--ui--libcrypto-shlib-ui_openssl.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ui_method_st = type { i8*, i32 (%struct.ui_st*)*, i32 (%struct.ui_st*, %struct.ui_string_st*)*, i32 (%struct.ui_st*)*, i32 (%struct.ui_st*, %struct.ui_string_st*)*, i32 (%struct.ui_st*)*, i8* (%struct.ui_st*, i8*)*, void (%struct.ui_st*, i8*)*, i8* (%struct.ui_st*, i8*, i8*)*, %struct.crypto_ex_data_st }
%struct.ui_st = type { %struct.ui_method_st*, %struct.stack_st_UI_STRING*, i8*, %struct.crypto_ex_data_st, i32, i8* }
%struct.stack_st_UI_STRING = type opaque
%struct.ui_string_st = type { i32, i8*, i32, i8*, i64, %union.anon, i32 }
%union.anon = type { %struct.anon.0 }
%struct.anon.0 = type { i8*, i8*, i8* }
%struct.crypto_ex_data_st = type { %struct.stack_st_void* }
%struct.stack_st_void = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.termios = type { i32, i32, i32, i32, i8, [32 x i8], i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !12, globals: !22)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--ui--libcrypto-shlib-ui_openssl.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "UI_string_types", file: !4, line: 286, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "include/openssl/ui.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!5 = !{!6, !7, !8, !9, !10, !11}
!6 = !DIEnumerator(name: "UIT_NONE", value: 0)
!7 = !DIEnumerator(name: "UIT_PROMPT", value: 1)
!8 = !DIEnumerator(name: "UIT_VERIFY", value: 2)
!9 = !DIEnumerator(name: "UIT_BOOLEAN", value: 3)
!10 = !DIEnumerator(name: "UIT_INFO", value: 4)
!11 = !DIEnumerator(name: "UIT_ERROR", value: 5)
!12 = !{!13, !14, !16}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !17, line: 85, baseType: !18)
!17 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DISubroutineType(types: !20)
!20 = !{null, !21}
!21 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!22 = !{!23, !108, !109, !166, !167, !187, !192, !197, !294, !295}
!23 = distinct !DIGlobalVariable(name: "ui_openssl", scope: !0, file: !24, line: 712, type: !25, isLocal: true, isDefinition: true, variable: %struct.ui_method_st* @ui_openssl)
!24 = !DIFile(filename: "crypto/ui/ui_openssl.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "UI_METHOD", file: !26, line: 148, baseType: !27)
!26 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ui_method_st", file: !28, line: 20, size: 640, align: 64, elements: !29)
!28 = !DIFile(filename: "crypto/ui/ui_locl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!29 = !{!30, !31, !58, !92, !93, !94, !95, !99, !103, !107}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !27, file: !28, line: 21, baseType: !14, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ui_open_session", scope: !27, file: !28, line: 31, baseType: !32, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!21, !35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "UI", file: !26, line: 147, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ui_st", file: !28, line: 94, size: 384, align: 64, elements: !38)
!38 = !{!39, !42, !45, !46, !54, !55}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !37, file: !28, line: 95, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "strings", scope: !37, file: !28, line: 96, baseType: !43, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_UI_STRING", file: !4, line: 280, flags: DIFlagFwdDecl)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !37, file: !28, line: 99, baseType: !13, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !37, file: !28, line: 100, baseType: !47, size: 64, align: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_EX_DATA", file: !26, line: 167, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_ex_data_st", file: !49, line: 86, size: 64, align: 64, elements: !50)
!49 = !DIFile(filename: "include/openssl/crypto.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !48, file: !49, line: 87, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_void", file: !49, line: 87, flags: DIFlagFwdDecl)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !37, file: !28, line: 104, baseType: !21, size: 32, align: 32, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !37, file: !28, line: 106, baseType: !56, size: 64, align: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_RWLOCK", file: !49, line: 67, baseType: null)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ui_write_string", scope: !27, file: !28, line: 32, baseType: !59, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!21, !35, !62}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "UI_STRING", file: !4, line: 279, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ui_string_st", file: !28, line: 61, size: 576, align: 64, elements: !65)
!65 = !{!66, !67, !70, !71, !72, !76, !91}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !64, file: !28, line: 62, baseType: !3, size: 32, align: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "out_string", scope: !64, file: !28, line: 63, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "input_flags", scope: !64, file: !28, line: 64, baseType: !21, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "result_buf", scope: !64, file: !28, line: 69, baseType: !14, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "result_len", scope: !64, file: !28, line: 74, baseType: !73, size: 64, align: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !74, line: 216, baseType: !75)
!74 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!75 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_", scope: !64, file: !28, line: 88, baseType: !77, size: 192, align: 64, offset: 320)
!77 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !64, file: !28, line: 75, size: 192, align: 64, elements: !78)
!78 = !{!79, !85}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "string_data", scope: !77, file: !28, line: 82, baseType: !80, size: 128, align: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !77, file: !28, line: 76, size: 128, align: 64, elements: !81)
!81 = !{!82, !83, !84}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "result_minsize", scope: !80, file: !28, line: 77, baseType: !21, size: 32, align: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "result_maxsize", scope: !80, file: !28, line: 79, baseType: !21, size: 32, align: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "test_buf", scope: !80, file: !28, line: 81, baseType: !68, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "boolean_data", scope: !77, file: !28, line: 87, baseType: !86, size: 192, align: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !77, file: !28, line: 83, size: 192, align: 64, elements: !87)
!87 = !{!88, !89, !90}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "action_desc", scope: !86, file: !28, line: 84, baseType: !68, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ok_chars", scope: !86, file: !28, line: 85, baseType: !68, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "cancel_chars", scope: !86, file: !28, line: 86, baseType: !68, size: 64, align: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !64, file: !28, line: 91, baseType: !21, size: 32, align: 32, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ui_flush", scope: !27, file: !28, line: 37, baseType: !32, size: 64, align: 64, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ui_read_string", scope: !27, file: !28, line: 38, baseType: !59, size: 64, align: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "ui_close_session", scope: !27, file: !28, line: 39, baseType: !32, size: 64, align: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ui_duplicate_data", scope: !27, file: !28, line: 44, baseType: !96, size: 64, align: 64, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!13, !35, !13}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ui_destroy_data", scope: !27, file: !28, line: 45, baseType: !100, size: 64, align: 64, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !35, !13}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ui_construct_prompt", scope: !27, file: !28, line: 53, baseType: !104, size: 64, align: 64, offset: 512)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!14, !35, !68, !68}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !27, file: !28, line: 58, baseType: !47, size: 64, align: 64, offset: 576)
!108 = distinct !DIGlobalVariable(name: "is_a_tty", scope: !0, file: !24, line: 181, type: !21, isLocal: true, isDefinition: true, variable: i32* @is_a_tty)
!109 = distinct !DIGlobalVariable(name: "tty_in", scope: !0, file: !24, line: 180, type: !110, isLocal: true, isDefinition: true, variable: %struct._IO_FILE** @tty_in)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !112, line: 48, baseType: !113)
!112 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !114, line: 241, size: 1728, align: 64, elements: !115)
!114 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!115 = !{!116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !136, !137, !138, !139, !143, !145, !147, !151, !154, !156, !157, !158, !159, !160, !161, !162}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !113, file: !114, line: 242, baseType: !21, size: 32, align: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !113, file: !114, line: 247, baseType: !14, size: 64, align: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !113, file: !114, line: 248, baseType: !14, size: 64, align: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !113, file: !114, line: 249, baseType: !14, size: 64, align: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !113, file: !114, line: 250, baseType: !14, size: 64, align: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !113, file: !114, line: 251, baseType: !14, size: 64, align: 64, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !113, file: !114, line: 252, baseType: !14, size: 64, align: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !113, file: !114, line: 253, baseType: !14, size: 64, align: 64, offset: 448)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !113, file: !114, line: 254, baseType: !14, size: 64, align: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !113, file: !114, line: 256, baseType: !14, size: 64, align: 64, offset: 576)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !113, file: !114, line: 257, baseType: !14, size: 64, align: 64, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !113, file: !114, line: 258, baseType: !14, size: 64, align: 64, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !113, file: !114, line: 260, baseType: !129, size: 64, align: 64, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !114, line: 156, size: 192, align: 64, elements: !131)
!131 = !{!132, !133, !135}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !130, file: !114, line: 157, baseType: !129, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !130, file: !114, line: 158, baseType: !134, size: 64, align: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !130, file: !114, line: 162, baseType: !21, size: 32, align: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !113, file: !114, line: 262, baseType: !134, size: 64, align: 64, offset: 832)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !113, file: !114, line: 264, baseType: !21, size: 32, align: 32, offset: 896)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !113, file: !114, line: 268, baseType: !21, size: 32, align: 32, offset: 928)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !113, file: !114, line: 270, baseType: !140, size: 64, align: 64, offset: 960)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !141, line: 131, baseType: !142)
!141 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!142 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !113, file: !114, line: 274, baseType: !144, size: 16, align: 16, offset: 1024)
!144 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !113, file: !114, line: 275, baseType: !146, size: 8, align: 8, offset: 1040)
!146 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !113, file: !114, line: 276, baseType: !148, size: 8, align: 8, offset: 1048)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, align: 8, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 1)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !113, file: !114, line: 280, baseType: !152, size: 64, align: 64, offset: 1088)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !114, line: 150, baseType: null)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !113, file: !114, line: 289, baseType: !155, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !141, line: 132, baseType: !142)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !113, file: !114, line: 297, baseType: !13, size: 64, align: 64, offset: 1216)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !113, file: !114, line: 298, baseType: !13, size: 64, align: 64, offset: 1280)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !113, file: !114, line: 299, baseType: !13, size: 64, align: 64, offset: 1344)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !113, file: !114, line: 300, baseType: !13, size: 64, align: 64, offset: 1408)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !113, file: !114, line: 302, baseType: !73, size: 64, align: 64, offset: 1472)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !113, file: !114, line: 303, baseType: !21, size: 32, align: 32, offset: 1536)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !113, file: !114, line: 305, baseType: !163, size: 160, align: 8, offset: 1568)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 160, align: 8, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 20)
!166 = distinct !DIGlobalVariable(name: "tty_out", scope: !0, file: !24, line: 180, type: !110, isLocal: true, isDefinition: true, variable: %struct._IO_FILE** @tty_out)
!167 = distinct !DIGlobalVariable(name: "tty_orig", scope: !0, file: !24, line: 177, type: !168, isLocal: true, isDefinition: true, variable: %struct.termios* @tty_orig)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "termios", file: !169, line: 28, size: 480, align: 32, elements: !170)
!169 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/termios.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!170 = !{!171, !174, !175, !176, !177, !180, !184, !186}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "c_iflag", scope: !168, file: !169, line: 30, baseType: !172, size: 32, align: 32)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcflag_t", file: !169, line: 25, baseType: !173)
!173 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "c_oflag", scope: !168, file: !169, line: 31, baseType: !172, size: 32, align: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "c_cflag", scope: !168, file: !169, line: 32, baseType: !172, size: 32, align: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "c_lflag", scope: !168, file: !169, line: 33, baseType: !172, size: 32, align: 32, offset: 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "c_line", scope: !168, file: !169, line: 34, baseType: !178, size: 8, align: 8, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "cc_t", file: !169, line: 23, baseType: !179)
!179 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "c_cc", scope: !168, file: !169, line: 35, baseType: !181, size: 256, align: 8, offset: 136)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 256, align: 8, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "c_ispeed", scope: !168, file: !169, line: 36, baseType: !185, size: 32, align: 32, offset: 416)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "speed_t", file: !169, line: 24, baseType: !173)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "c_ospeed", scope: !168, file: !169, line: 37, baseType: !185, size: 32, align: 32, offset: 448)
!187 = distinct !DIGlobalVariable(name: "ps", scope: !188, file: !24, line: 282, type: !21, isLocal: true, isDefinition: true, variable: i32* @read_string_inner.ps)
!188 = distinct !DISubprogram(name: "read_string_inner", scope: !24, file: !24, line: 280, type: !189, isLocal: true, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !191)
!189 = !DISubroutineType(types: !190)
!190 = !{!21, !35, !62, !21, !21}
!191 = !{}
!192 = distinct !DIGlobalVariable(name: "intr_signal", scope: !0, file: !24, line: 277, type: !193, isLocal: true, isDefinition: true, variable: i32* @intr_signal)
!193 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !17, line: 40, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !196, line: 22, baseType: !21)
!196 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigset.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!197 = distinct !DIGlobalVariable(name: "savsig", scope: !0, file: !24, line: 160, type: !198, isLocal: true, isDefinition: true, variable: [32 x %struct.sigaction]* @savsig)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 38912, align: 64, elements: !182)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !200, line: 24, size: 1216, align: 64, elements: !201)
!200 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigaction.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!201 = !{!202, !281, !289, !290}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !199, file: !200, line: 35, baseType: !203, size: 64, align: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !199, file: !200, line: 28, size: 64, align: 64, elements: !204)
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !203, file: !200, line: 31, baseType: !16, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !203, file: !200, line: 33, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !21, !210, !13}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !212, line: 133, baseType: !213)
!212 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/siginfo.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 62, size: 1024, align: 64, elements: !214)
!214 = !{!215, !216, !217, !218}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !213, file: !212, line: 64, baseType: !21, size: 32, align: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !213, file: !212, line: 65, baseType: !21, size: 32, align: 32, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !213, file: !212, line: 67, baseType: !21, size: 32, align: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !213, file: !212, line: 132, baseType: !219, size: 896, align: 64, offset: 128)
!219 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !213, file: !212, line: 69, size: 896, align: 64, elements: !220)
!220 = !{!221, !225, !232, !243, !249, !259, !270, !275}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !219, file: !212, line: 71, baseType: !222, size: 896, align: 32)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 896, align: 32, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 28)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !219, file: !212, line: 78, baseType: !226, size: 64, align: 32)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !219, file: !212, line: 74, size: 64, align: 32, elements: !227)
!227 = !{!228, !230}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !226, file: !212, line: 76, baseType: !229, size: 32, align: 32)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !141, line: 133, baseType: !21)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !226, file: !212, line: 77, baseType: !231, size: 32, align: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !141, line: 125, baseType: !173)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !219, file: !212, line: 86, baseType: !233, size: 128, align: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !219, file: !212, line: 81, size: 128, align: 64, elements: !234)
!234 = !{!235, !236, !237}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !233, file: !212, line: 83, baseType: !21, size: 32, align: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !233, file: !212, line: 84, baseType: !21, size: 32, align: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !233, file: !212, line: 85, baseType: !238, size: 64, align: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !212, line: 36, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !212, line: 32, size: 64, align: 64, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !239, file: !212, line: 34, baseType: !21, size: 32, align: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !239, file: !212, line: 35, baseType: !13, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !219, file: !212, line: 94, baseType: !244, size: 128, align: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !219, file: !212, line: 89, size: 128, align: 64, elements: !245)
!245 = !{!246, !247, !248}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !244, file: !212, line: 91, baseType: !229, size: 32, align: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !244, file: !212, line: 92, baseType: !231, size: 32, align: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !244, file: !212, line: 93, baseType: !238, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !219, file: !212, line: 104, baseType: !250, size: 256, align: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !219, file: !212, line: 97, size: 256, align: 64, elements: !251)
!251 = !{!252, !253, !254, !255, !258}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !250, file: !212, line: 99, baseType: !229, size: 32, align: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !250, file: !212, line: 100, baseType: !231, size: 32, align: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !250, file: !212, line: 101, baseType: !21, size: 32, align: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !250, file: !212, line: 102, baseType: !256, size: 64, align: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigchld_clock_t", file: !212, line: 58, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !141, line: 135, baseType: !142)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !250, file: !212, line: 103, baseType: !256, size: 64, align: 64, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !219, file: !212, line: 116, baseType: !260, size: 256, align: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !219, file: !212, line: 107, size: 256, align: 64, elements: !261)
!261 = !{!262, !263, !265}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !260, file: !212, line: 109, baseType: !13, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !260, file: !212, line: 110, baseType: !264, size: 16, align: 16, offset: 64)
!264 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_bnd", scope: !260, file: !212, line: 115, baseType: !266, size: 128, align: 64, offset: 128)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !260, file: !212, line: 111, size: 128, align: 64, elements: !267)
!267 = !{!268, !269}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !266, file: !212, line: 113, baseType: !13, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !266, file: !212, line: 114, baseType: !13, size: 64, align: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !219, file: !212, line: 123, baseType: !271, size: 128, align: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !219, file: !212, line: 119, size: 128, align: 64, elements: !272)
!272 = !{!273, !274}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !271, file: !212, line: 121, baseType: !142, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !271, file: !212, line: 122, baseType: !21, size: 32, align: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !219, file: !212, line: 131, baseType: !276, size: 128, align: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !219, file: !212, line: 126, size: 128, align: 64, elements: !277)
!277 = !{!278, !279, !280}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !276, file: !212, line: 128, baseType: !13, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !276, file: !212, line: 129, baseType: !21, size: 32, align: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !276, file: !212, line: 130, baseType: !173, size: 32, align: 32, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !199, file: !200, line: 43, baseType: !282, size: 1024, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !196, line: 30, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !196, line: 27, size: 1024, align: 64, elements: !284)
!284 = !{!285}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !283, file: !196, line: 29, baseType: !286, size: 1024, align: 64)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 1024, align: 64, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 16)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !199, file: !200, line: 46, baseType: !21, size: 32, align: 32, offset: 1088)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !199, file: !200, line: 49, baseType: !291, size: 64, align: 64, offset: 1152)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{null}
!294 = distinct !DIGlobalVariable(name: "tty_new", scope: !0, file: !24, line: 177, type: !168, isLocal: true, isDefinition: true, variable: %struct.termios* @tty_new)
!295 = distinct !DIGlobalVariable(name: "default_UI_meth", scope: !0, file: !24, line: 728, type: !40, isLocal: true, isDefinition: true, variable: %struct.ui_method_st** @default_UI_meth)
!296 = !{i32 2, !"Dwarf Version", i32 4}
!297 = !{i32 2, !"Debug Info Version", i32 3}
!298 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!299 = distinct !DISubprogram(name: "UI_OpenSSL", scope: !24, file: !24, line: 723, type: !300, isLocal: false, isDefinition: true, scopeLine: 724, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !191)
!300 = !DISubroutineType(types: !301)
!301 = !{!302}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!303 = !DILocation(line: 725, column: 5, scope: !299)
!304 = distinct !DISubprogram(name: "UI_set_default_method", scope: !24, file: !24, line: 736, type: !305, isLocal: false, isDefinition: true, scopeLine: 737, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !191)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !40}
!307 = !DILocalVariable(name: "meth", arg: 1, scope: !304, file: !24, line: 736, type: !40)
!308 = !DIExpression()
!309 = !DILocation(line: 736, column: 45, scope: !304)
!310 = !DILocation(line: 738, column: 23, scope: !304)
!311 = !DILocation(line: 738, column: 21, scope: !304)
!312 = !DILocation(line: 739, column: 1, scope: !304)
!313 = distinct !DISubprogram(name: "UI_get_default_method", scope: !24, file: !24, line: 741, type: !314, isLocal: false, isDefinition: true, scopeLine: 742, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !191)
!314 = !DISubroutineType(types: !315)
!315 = !{!40}
!316 = !DILocation(line: 743, column: 12, scope: !313)
!317 = !DILocation(line: 743, column: 5, scope: !313)
!318 = distinct !DISubprogram(name: "open_console", scope: !24, file: !24, line: 377, type: !33, isLocal: true, isDefinition: true, scopeLine: 378, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !191)
!319 = !DILocalVariable(name: "ui", arg: 1, scope: !318, file: !24, line: 377, type: !35)
!320 = !DILocation(line: 377, column: 29, scope: !318)
!321 = !DILocation(line: 379, column: 30, scope: !318)
!322 = !DILocation(line: 379, column: 34, scope: !318)
!323 = !DILocation(line: 379, column: 5, scope: !318)
!324 = !DILocation(line: 380, column: 14, scope: !318)
!325 = !DILocation(line: 402, column: 19, scope: !326)
!326 = distinct !DILexicalBlock(scope: !318, file: !24, line: 402, column: 9)
!327 = !DILocation(line: 402, column: 17, scope: !326)
!328 = !DILocation(line: 402, column: 43, scope: !326)
!329 = !DILocation(line: 402, column: 9, scope: !318)
!330 = !DILocation(line: 403, column: 17, scope: !326)
!331 = !DILocation(line: 403, column: 16, scope: !326)
!332 = !DILocation(line: 403, column: 9, scope: !326)
!333 = !DILocation(line: 404, column: 20, scope: !334)
!334 = distinct !DILexicalBlock(scope: !318, file: !24, line: 404, column: 9)
!335 = !DILocation(line: 404, column: 18, scope: !334)
!336 = !DILocation(line: 404, column: 44, scope: !334)
!337 = !DILocation(line: 404, column: 9, scope: !318)
!338 = !DILocation(line: 405, column: 18, scope: !334)
!339 = !DILocation(line: 405, column: 17, scope: !334)
!340 = !DILocation(line: 405, column: 9, scope: !334)
!341 = !DILocation(line: 409, column: 26, scope: !342)
!342 = distinct !DILexicalBlock(scope: !318, file: !24, line: 409, column: 9)
!343 = !DILocation(line: 409, column: 19, scope: !342)
!344 = !DILocation(line: 409, column: 9, scope: !345)
