; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--asn1--libcrypto-shlib-tasn_new.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--asn1--libcrypto-shlib-tasn_new.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_VALUE_st = type opaque
%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.ASN1_EXTERN_FUNCS_st = type { i8*, i32 (%struct.ASN1_VALUE_st**, %struct.ASN1_ITEM_st*)*, void (%struct.ASN1_VALUE_st**, %struct.ASN1_ITEM_st*)*, void (%struct.ASN1_VALUE_st**, %struct.ASN1_ITEM_st*)*, i32 (%struct.ASN1_VALUE_st**, i8**, i64, %struct.ASN1_ITEM_st*, i32, i32, i8, %struct.ASN1_TLC_st*)*, i32 (%struct.ASN1_VALUE_st**, i8**, %struct.ASN1_ITEM_st*, i32, i32)*, i32 (%struct.bio_st*, %struct.ASN1_VALUE_st**, i32, i8*, %struct.asn1_pctx_st*)* }
%struct.ASN1_TLC_st = type { i8, i32, i64, i32, i32, i32 }
%struct.bio_st = type opaque
%struct.asn1_pctx_st = type opaque
%struct.ASN1_AUX_st = type { i8*, i32, i32, i32, i32 (i32, %struct.ASN1_VALUE_st**, %struct.ASN1_ITEM_st*, i8*)*, i32 }
%struct.stack_st_ASN1_VALUE = type opaque
%struct.asn1_type_st = type { i32, %union.anon }
%union.anon = type { i8* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--asn1--libcrypto-shlib-tasn_new.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{}
!3 = !{!4, !5, !9, !13, !16}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !7, line: 213, baseType: !8)
!7 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !7, line: 213, flags: DIFlagFwdDecl)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !11, line: 56, baseType: !12)
!11 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ASN1_VALUE", file: !15, line: 928, flags: DIFlagFwdDecl)
!15 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !11, line: 55, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !7, line: 146, size: 192, align: 64, elements: !20)
!20 = !{!21, !22, !23, !26}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !19, file: !7, line: 147, baseType: !12, size: 32, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !19, file: !7, line: 148, baseType: !12, size: 32, align: 32, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !19, file: !7, line: 149, baseType: !24, size: 64, align: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !19, file: !7, line: 155, baseType: !27, size: 64, align: 64, offset: 128)
!27 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!28 = !{i32 2, !"Dwarf Version", i32 4}
!29 = !{i32 2, !"Debug Info Version", i32 3}
!30 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!31 = distinct !DISubprogram(name: "ASN1_item_new", scope: !32, file: !32, line: 27, type: !33, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!32 = !DIFile(filename: "crypto/asn1/tasn_new.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!33 = !DISubroutineType(types: !34)
!34 = !{!5, !35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !11, line: 62, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !15, line: 580, size: 448, align: 64, elements: !39)
!39 = !{!40, !42, !43, !59, !60, !63, !64}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !38, file: !15, line: 581, baseType: !41, size: 8, align: 8)
!41 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !38, file: !15, line: 583, baseType: !27, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !38, file: !15, line: 584, baseType: !44, size: 64, align: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !7, line: 210, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !15, line: 468, size: 320, align: 64, elements: !48)
!48 = !{!49, !51, !52, !53, !56}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !47, file: !15, line: 469, baseType: !50, size: 64, align: 64)
!50 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !47, file: !15, line: 470, baseType: !27, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !47, file: !15, line: 471, baseType: !50, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !47, file: !15, line: 472, baseType: !54, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !47, file: !15, line: 473, baseType: !57, size: 64, align: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !7, line: 318, baseType: !36)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !38, file: !15, line: 586, baseType: !27, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !38, file: !15, line: 587, baseType: !61, size: 64, align: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !38, file: !15, line: 588, baseType: !27, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !38, file: !15, line: 589, baseType: !54, size: 64, align: 64, offset: 384)
!65 = !DILocalVariable(name: "it", arg: 1, scope: !31, file: !32, line: 27, type: !35)
!66 = !DIExpression()
!67 = !DILocation(line: 27, column: 44, scope: !31)
!68 = !DILocalVariable(name: "ret", scope: !31, file: !32, line: 29, type: !5)
!69 = !DILocation(line: 29, column: 17, scope: !31)
!70 = !DILocation(line: 30, column: 32, scope: !71)
!71 = distinct !DILexicalBlock(scope: !31, file: !32, line: 30, column: 9)
!72 = !DILocation(line: 30, column: 9, scope: !71)
!73 = !DILocation(line: 30, column: 36, scope: !71)
!74 = !DILocation(line: 30, column: 9, scope: !31)
!75 = !DILocation(line: 31, column: 16, scope: !71)
!76 = !DILocation(line: 31, column: 9, scope: !71)
!77 = !DILocation(line: 32, column: 5, scope: !31)
!78 = !DILocation(line: 33, column: 1, scope: !31)
!79 = distinct !DISubprogram(name: "ASN1_item_ex_new", scope: !32, file: !32, line: 37, type: !80, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!80 = !DISubroutineType(types: !81)
!81 = !{!12, !82, !35}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!83 = !DILocalVariable(name: "pval", arg: 1, scope: !79, file: !32, line: 37, type: !82)
!84 = !DILocation(line: 37, column: 35, scope: !79)
!85 = !DILocalVariable(name: "it", arg: 2, scope: !79, file: !32, line: 37, type: !35)
!86 = !DILocation(line: 37, column: 58, scope: !79)
!87 = !DILocation(line: 39, column: 32, scope: !79)
!88 = !DILocation(line: 39, column: 38, scope: !79)
!89 = !DILocation(line: 39, column: 12, scope: !79)
!90 = !DILocation(line: 39, column: 5, scope: !79)
!91 = distinct !DISubprogram(name: "asn1_item_embed_new", scope: !32, file: !32, line: 42, type: !92, isLocal: true, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!92 = !DISubroutineType(types: !93)
!93 = !{!12, !82, !35, !12}
!94 = !DILocalVariable(name: "pval", arg: 1, scope: !91, file: !32, line: 42, type: !82)
!95 = !DILocation(line: 42, column: 38, scope: !91)
!96 = !DILocalVariable(name: "it", arg: 2, scope: !91, file: !32, line: 42, type: !35)
!97 = !DILocation(line: 42, column: 61, scope: !91)
!98 = !DILocalVariable(name: "embed", arg: 3, scope: !91, file: !32, line: 42, type: !12)
!99 = !DILocation(line: 42, column: 69, scope: !91)
!100 = !DILocalVariable(name: "tt", scope: !91, file: !32, line: 44, type: !44)
!101 = !DILocation(line: 44, column: 26, scope: !91)
!102 = !DILocalVariable(name: "ef", scope: !91, file: !32, line: 45, type: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_EXTERN_FUNCS", file: !15, line: 690, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_EXTERN_FUNCS_st", file: !15, line: 682, size: 448, align: 64, elements: !107)
!107 = !{!108, !109, !112, !117, !118, !136, !142}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !106, file: !15, line: 683, baseType: !4, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_ex_new", scope: !106, file: !15, line: 684, baseType: !110, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ex_new_func", file: !15, line: 666, baseType: !80)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_ex_free", scope: !106, file: !15, line: 685, baseType: !113, size: 64, align: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ex_free_func", file: !15, line: 667, baseType: !115)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !82, !35}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_ex_clear", scope: !106, file: !15, line: 686, baseType: !113, size: 64, align: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_ex_d2i", scope: !106, file: !15, line: 687, baseType: !119, size: 64, align: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ex_d2i", file: !15, line: 660, baseType: !121)
!121 = !DISubroutineType(types: !122)
!122 = !{!12, !82, !123, !27, !35, !12, !12, !41, !126}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TLC", file: !7, line: 211, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TLC_st", file: !15, line: 650, size: 256, align: 64, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !135}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !128, file: !15, line: 651, baseType: !41, size: 8, align: 8)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ret", scope: !128, file: !15, line: 652, baseType: !12, size: 32, align: 32, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "plen", scope: !128, file: !15, line: 653, baseType: !27, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ptag", scope: !128, file: !15, line: 654, baseType: !12, size: 32, align: 32, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "pclass", scope: !128, file: !15, line: 655, baseType: !12, size: 32, align: 32, offset: 160)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "hdrlen", scope: !128, file: !15, line: 656, baseType: !12, size: 32, align: 32, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_ex_i2d", scope: !106, file: !15, line: 688, baseType: !137, size: 64, align: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ex_i2d", file: !15, line: 664, baseType: !139)
!139 = !DISubroutineType(types: !140)
!140 = !{!12, !82, !141, !35, !12, !12}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_ex_print", scope: !106, file: !15, line: 689, baseType: !143, size: 64, align: 64, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ex_print_func", file: !15, line: 669, baseType: !145)
!145 = !DISubroutineType(types: !146)
!146 = !{!12, !147, !82, !12, !54, !150}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !11, line: 79, baseType: !149)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !11, line: 79, flags: DIFlagFwdDecl)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PCTX", file: !11, line: 63, baseType: !153)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_pctx_st", file: !11, line: 63, flags: DIFlagFwdDecl)
!154 = !DILocation(line: 45, column: 30, scope: !91)
!155 = !DILocalVariable(name: "aux", scope: !91, file: !32, line: 46, type: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_AUX", file: !15, line: 726, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_AUX_st", file: !15, line: 719, size: 320, align: 64, elements: !160)
!160 = !{!161, !162, !163, !164, !165, !170}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !159, file: !15, line: 720, baseType: !4, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !159, file: !15, line: 721, baseType: !12, size: 32, align: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !159, file: !15, line: 722, baseType: !12, size: 32, align: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "ref_lock", scope: !159, file: !15, line: 723, baseType: !12, size: 32, align: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_cb", scope: !159, file: !15, line: 724, baseType: !166, size: 64, align: 64, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_aux_cb", file: !15, line: 716, baseType: !168)
!168 = !DISubroutineType(types: !169)
!169 = !{!12, !12, !82, !35, !4}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "enc_offset", scope: !159, file: !15, line: 725, baseType: !12, size: 32, align: 32, offset: 256)
!171 = !DILocation(line: 46, column: 21, scope: !91)
!172 = !DILocation(line: 46, column: 27, scope: !91)
!173 = !DILocation(line: 46, column: 31, scope: !91)
!174 = !DILocalVariable(name: "asn1_cb", scope: !91, file: !32, line: 47, type: !166)
!175 = !DILocation(line: 47, column: 18, scope: !91)
!176 = !DILocalVariable(name: "pseqval", scope: !91, file: !32, line: 48, type: !82)
!177 = !DILocation(line: 48, column: 18, scope: !91)
!178 = !DILocalVariable(name: "i", scope: !91, file: !32, line: 49, type: !12)
!179 = !DILocation(line: 49, column: 9, scope: !91)
!180 = !DILocation(line: 50, column: 9, scope: !181)
!181 = distinct !DILexicalBlock(scope: !91, file: !32, line: 50, column: 9)
!182 = !DILocation(line: 50, column: 13, scope: !181)
!183 = !DILocation(line: 50, column: 16, scope: !184)
!184 = !DILexicalBlockFile(scope: !181, file: !32, discriminator: 1)
!185 = !DILocation(line: 50, column: 21, scope: !184)
!186 = !DILocation(line: 50, column: 9, scope: !184)
!187 = !DILocation(line: 51, column: 19, scope: !181)
!188 = !DILocation(line: 51, column: 24, scope: !181)
!189 = !DILocation(line: 51, column: 17, scope: !181)
!190 = !DILocation(line: 51, column: 9, scope: !181)
!191 = !DILocation(line: 53, column: 17, scope: !181)
!192 = !DILocation(line: 59, column: 13, scope: !91)
!193 = !DILocation(line: 59, column: 17, scope: !91)
!194 = !DILocation(line: 59, column: 5, scope: !91)
!195 = !DILocation(line: 62, column: 14, scope: !196)
!196 = distinct !DILexicalBlock(scope: !91, file: !32, line: 59, column: 24)
!197 = !DILocation(line: 62, column: 18, scope: !196)
!198 = !DILocation(line: 62, column: 12, scope: !196)
!199 = !DILocation(line: 63, column: 13, scope: !200)
!200 = distinct !DILexicalBlock(scope: !196, file: !32, line: 63, column: 13)
!201 = !DILocation(line: 63, column: 16, scope: !200)
!202 = !DILocation(line: 63, column: 19, scope: !203)
!203 = !DILexicalBlockFile(scope: !200, file: !32, discriminator: 1)
!204 = !DILocation(line: 63, column: 23, scope: !203)
!205 = !DILocation(line: 63, column: 13, scope: !203)
!206 = !DILocation(line: 64, column: 18, scope: !207)
!207 = distinct !DILexicalBlock(scope: !208, file: !32, line: 64, column: 17)
!208 = distinct !DILexicalBlock(scope: !200, file: !32, line: 63, column: 36)
!209 = !DILocation(line: 64, column: 22, scope: !207)
!210 = !DILocation(line: 64, column: 34, scope: !207)
!211 = !DILocation(line: 64, column: 40, scope: !207)
!212 = !DILocation(line: 64, column: 17, scope: !208)
!213 = !DILocation(line: 65, column: 17, scope: !207)
!214 = !DILocation(line: 66, column: 9, scope: !208)
!215 = !DILocation(line: 67, column: 9, scope: !196)
!216 = !DILocation(line: 70, column: 13, scope: !217)
!217 = distinct !DILexicalBlock(scope: !196, file: !32, line: 70, column: 13)
!218 = !DILocation(line: 70, column: 17, scope: !217)
!219 = !DILocation(line: 70, column: 13, scope: !196)
!220 = !DILocation(line: 71, column: 36, scope: !221)
!221 = distinct !DILexicalBlock(scope: !222, file: !32, line: 71, column: 17)
!222 = distinct !DILexicalBlock(scope: !217, file: !32, line: 70, column: 28)
!223 = !DILocation(line: 71, column: 42, scope: !221)
!224 = !DILocation(line: 71, column: 46, scope: !221)
!225 = !DILocation(line: 71, column: 18, scope: !221)
!226 = !DILocation(line: 71, column: 17, scope: !222)
!227 = !DILocation(line: 72, column: 17, scope: !221)
!228 = !DILocation(line: 73, column: 9, scope: !222)
!229 = !DILocation(line: 73, column: 40, scope: !230)
!230 = !DILexicalBlockFile(scope: !231, file: !32, discriminator: 1)
!231 = distinct !DILexicalBlock(scope: !217, file: !32, line: 73, column: 20)
!232 = !DILocation(line: 73, column: 46, scope: !230)
!233 = !DILocation(line: 73, column: 50, scope: !230)
!234 = !DILocation(line: 73, column: 21, scope: !230)
!235 = !DILocation(line: 73, column: 20, scope: !230)
!236 = !DILocation(line: 74, column: 13, scope: !231)
!237 = !DILocation(line: 75, column: 9, scope: !196)
!238 = !DILocation(line: 78, column: 33, scope: !239)
!239 = distinct !DILexicalBlock(scope: !196, file: !32, line: 78, column: 13)
!240 = !DILocation(line: 78, column: 39, scope: !239)
!241 = !DILocation(line: 78, column: 43, scope: !239)
!242 = !DILocation(line: 78, column: 14, scope: !239)
!243 = !DILocation(line: 78, column: 13, scope: !196)
!244 = !DILocation(line: 79, column: 13, scope: !239)
!245 = !DILocation(line: 80, column: 9, scope: !196)
!246 = !DILocation(line: 83, column: 13, scope: !247)
!247 = distinct !DILexicalBlock(scope: !196, file: !32, line: 83, column: 13)
!248 = !DILocation(line: 83, column: 13, scope: !196)
!249 = !DILocation(line: 84, column: 17, scope: !250)
!250 = distinct !DILexicalBlock(scope: !247, file: !32, line: 83, column: 22)
!251 = !DILocation(line: 84, column: 28, scope: !250)
!252 = !DILocation(line: 84, column: 34, scope: !250)
!253 = !DILocation(line: 84, column: 15, scope: !250)
!254 = !DILocation(line: 85, column: 18, scope: !255)
!255 = distinct !DILexicalBlock(scope: !250, file: !32, line: 85, column: 17)
!256 = !DILocation(line: 85, column: 17, scope: !250)
!257 = !DILocation(line: 86, column: 17, scope: !255)
!258 = !DILocation(line: 87, column: 17, scope: !259)
!259 = distinct !DILexicalBlock(scope: !250, file: !32, line: 87, column: 17)
!260 = !DILocation(line: 87, column: 19, scope: !259)
!261 = !DILocation(line: 87, column: 17, scope: !250)
!262 = !DILocation(line: 91, column: 17, scope: !263)
!263 = distinct !DILexicalBlock(scope: !259, file: !32, line: 87, column: 25)
!264 = !DILocation(line: 93, column: 9, scope: !250)
!265 = !DILocation(line: 94, column: 13, scope: !266)
!266 = distinct !DILexicalBlock(scope: !196, file: !32, line: 94, column: 13)
!267 = !DILocation(line: 94, column: 13, scope: !196)
!268 = !DILocation(line: 95, column: 21, scope: !269)
!269 = distinct !DILexicalBlock(scope: !266, file: !32, line: 94, column: 20)
!270 = !DILocation(line: 95, column: 20, scope: !269)
!271 = !DILocation(line: 95, column: 13, scope: !269)
!272 = !DILocation(line: 95, column: 30, scope: !269)
!273 = !DILocation(line: 95, column: 34, scope: !269)
!274 = !DILocation(line: 96, column: 9, scope: !269)
!275 = !DILocation(line: 97, column: 35, scope: !276)
!276 = distinct !DILexicalBlock(scope: !266, file: !32, line: 96, column: 16)
!277 = !DILocation(line: 97, column: 39, scope: !276)
!278 = !DILocation(line: 97, column: 21, scope: !276)
!279 = !DILocation(line: 97, column: 14, scope: !276)
!280 = !DILocation(line: 97, column: 19, scope: !276)
!281 = !DILocation(line: 98, column: 18, scope: !282)
!282 = distinct !DILexicalBlock(scope: !276, file: !32, line: 98, column: 17)
!283 = !DILocation(line: 98, column: 17, scope: !282)
!284 = !DILocation(line: 98, column: 23, scope: !282)
!285 = !DILocation(line: 98, column: 17, scope: !276)
!286 = !DILocation(line: 99, column: 17, scope: !282)
!287 = !DILocation(line: 101, column: 34, scope: !196)
!288 = !DILocation(line: 101, column: 44, scope: !196)
!289 = !DILocation(line: 101, column: 9, scope: !196)
!290 = !DILocation(line: 102, column: 13, scope: !291)
!291 = distinct !DILexicalBlock(scope: !196, file: !32, line: 102, column: 13)
!292 = !DILocation(line: 102, column: 21, scope: !291)
!293 = !DILocation(line: 102, column: 25, scope: !294)
!294 = !DILexicalBlockFile(scope: !291, file: !32, discriminator: 1)
!295 = !DILocation(line: 102, column: 36, scope: !294)
!296 = !DILocation(line: 102, column: 42, scope: !294)
!297 = !DILocation(line: 102, column: 13, scope: !294)
!298 = !DILocation(line: 103, column: 13, scope: !291)
!299 = !DILocation(line: 104, column: 9, scope: !196)
!300 = !DILocation(line: 108, column: 13, scope: !301)
!301 = distinct !DILexicalBlock(scope: !196, file: !32, line: 108, column: 13)
!302 = !DILocation(line: 108, column: 13, scope: !196)
!303 = !DILocation(line: 109, column: 17, scope: !304)
!304 = distinct !DILexicalBlock(scope: !301, file: !32, line: 108, column: 22)
!305 = !DILocation(line: 109, column: 28, scope: !304)
!306 = !DILocation(line: 109, column: 34, scope: !304)
!307 = !DILocation(line: 109, column: 15, scope: !304)
!308 = !DILocation(line: 110, column: 18, scope: !309)
!309 = distinct !DILexicalBlock(scope: !304, file: !32, line: 110, column: 17)
!310 = !DILocation(line: 110, column: 17, scope: !304)
!311 = !DILocation(line: 111, column: 17, scope: !309)
!312 = !DILocation(line: 112, column: 17, scope: !313)
!313 = distinct !DILexicalBlock(scope: !304, file: !32, line: 112, column: 17)
!314 = !DILocation(line: 112, column: 19, scope: !313)
!315 = !DILocation(line: 112, column: 17, scope: !304)
!316 = !DILocation(line: 116, column: 17, scope: !317)
!317 = distinct !DILexicalBlock(scope: !313, file: !32, line: 112, column: 25)
!318 = !DILocation(line: 118, column: 9, scope: !304)
!319 = !DILocation(line: 119, column: 13, scope: !320)
!320 = distinct !DILexicalBlock(scope: !196, file: !32, line: 119, column: 13)
!321 = !DILocation(line: 119, column: 13, scope: !196)
!322 = !DILocation(line: 120, column: 21, scope: !323)
!323 = distinct !DILexicalBlock(scope: !320, file: !32, line: 119, column: 20)
!324 = !DILocation(line: 120, column: 20, scope: !323)
!325 = !DILocation(line: 120, column: 13, scope: !323)
!326 = !DILocation(line: 120, column: 30, scope: !323)
!327 = !DILocation(line: 120, column: 34, scope: !323)
!328 = !DILocation(line: 121, column: 9, scope: !323)
!329 = !DILocation(line: 122, column: 35, scope: !330)
!330 = distinct !DILexicalBlock(scope: !320, file: !32, line: 121, column: 16)
!331 = !DILocation(line: 122, column: 39, scope: !330)
!332 = !DILocation(line: 122, column: 21, scope: !330)
!333 = !DILocation(line: 122, column: 14, scope: !330)
!334 = !DILocation(line: 122, column: 19, scope: !330)
!335 = !DILocation(line: 123, column: 18, scope: !336)
!336 = distinct !DILexicalBlock(scope: !330, file: !32, line: 123, column: 17)
!337 = !DILocation(line: 123, column: 17, scope: !336)
!338 = !DILocation(line: 123, column: 23, scope: !336)
!339 = !DILocation(line: 123, column: 17, scope: !330)
!340 = !DILocation(line: 124, column: 17, scope: !336)
!341 = !DILocation(line: 127, column: 26, scope: !342)
!342 = distinct !DILexicalBlock(scope: !196, file: !32, line: 127, column: 13)
!343 = !DILocation(line: 127, column: 35, scope: !342)
!344 = !DILocation(line: 127, column: 13, scope: !342)
!345 = !DILocation(line: 127, column: 39, scope: !342)
!346 = !DILocation(line: 127, column: 13, scope: !196)
!347 = !DILocation(line: 128, column: 18, scope: !348)
!348 = distinct !DILexicalBlock(scope: !349, file: !32, line: 128, column: 17)
!349 = distinct !DILexicalBlock(scope: !342, file: !32, line: 127, column: 44)
!350 = !DILocation(line: 128, column: 17, scope: !349)
!351 = !DILocation(line: 129, column: 30, scope: !352)
!352 = distinct !DILexicalBlock(scope: !348, file: !32, line: 128, column: 25)
!353 = !DILocation(line: 129, column: 29, scope: !352)
!354 = !DILocation(line: 129, column: 17, scope: !352)
!355 = !DILocation(line: 130, column: 18, scope: !352)
!356 = !DILocation(line: 130, column: 23, scope: !352)
!357 = !DILocation(line: 131, column: 13, scope: !352)
!358 = !DILocation(line: 132, column: 13, scope: !349)
!359 = !DILocation(line: 134, column: 23, scope: !196)
!360 = !DILocation(line: 134, column: 29, scope: !196)
!361 = !DILocation(line: 134, column: 9, scope: !196)
!362 = !DILocation(line: 135, column: 16, scope: !363)
!363 = distinct !DILexicalBlock(scope: !196, file: !32, line: 135, column: 9)
!364 = !DILocation(line: 135, column: 26, scope: !363)
!365 = !DILocation(line: 135, column: 30, scope: !363)
!366 = !DILocation(line: 135, column: 24, scope: !363)
!367 = !DILocation(line: 135, column: 14, scope: !363)
!368 = !DILocation(line: 135, column: 41, scope: !369)
!369 = !DILexicalBlockFile(scope: !370, file: !32, discriminator: 1)
!370 = distinct !DILexicalBlock(scope: !363, file: !32, line: 135, column: 9)
!371 = !DILocation(line: 135, column: 45, scope: !369)
!372 = !DILocation(line: 135, column: 49, scope: !369)
!373 = !DILocation(line: 135, column: 43, scope: !369)
!374 = !DILocation(line: 135, column: 9, scope: !369)
!375 = !DILocation(line: 136, column: 42, scope: !376)
!376 = distinct !DILexicalBlock(scope: !370, file: !32, line: 135, column: 68)
!377 = !DILocation(line: 136, column: 48, scope: !376)
!378 = !DILocation(line: 136, column: 23, scope: !376)
!379 = !DILocation(line: 136, column: 21, scope: !376)
!380 = !DILocation(line: 137, column: 36, scope: !381)
!381 = distinct !DILexicalBlock(scope: !376, file: !32, line: 137, column: 17)
!382 = !DILocation(line: 137, column: 45, scope: !381)
!383 = !DILocation(line: 137, column: 18, scope: !381)
!384 = !DILocation(line: 137, column: 17, scope: !376)
!385 = !DILocation(line: 138, column: 17, scope: !381)
!386 = !DILocation(line: 139, column: 9, scope: !376)
!387 = !DILocation(line: 135, column: 59, scope: !388)
!388 = !DILexicalBlockFile(scope: !370, file: !32, discriminator: 2)
!389 = !DILocation(line: 135, column: 64, scope: !388)
!390 = !DILocation(line: 135, column: 9, scope: !388)
!391 = distinct !{!391, !392}
!392 = !DILocation(line: 135, column: 9, scope: !196)
!393 = !DILocation(line: 140, column: 13, scope: !394)
!394 = distinct !DILexicalBlock(scope: !196, file: !32, line: 140, column: 13)
!395 = !DILocation(line: 140, column: 21, scope: !394)
!396 = !DILocation(line: 140, column: 25, scope: !397)
!397 = !DILexicalBlockFile(scope: !394, file: !32, discriminator: 1)
!398 = !DILocation(line: 140, column: 36, scope: !397)
!399 = !DILocation(line: 140, column: 42, scope: !397)
!400 = !DILocation(line: 140, column: 13, scope: !397)
!401 = !DILocation(line: 141, column: 13, scope: !394)
!402 = !DILocation(line: 142, column: 9, scope: !196)
!403 = !DILocation(line: 147, column: 5, scope: !91)
!404 = !DILocation(line: 150, column: 26, scope: !91)
!405 = !DILocation(line: 150, column: 32, scope: !91)
!406 = !DILocation(line: 150, column: 36, scope: !91)
!407 = !DILocation(line: 150, column: 5, scope: !91)
!408 = !DILocation(line: 152, column: 5, scope: !91)
!409 = !DILocation(line: 156, column: 5, scope: !91)
!410 = !DILocation(line: 159, column: 26, scope: !91)
!411 = !DILocation(line: 159, column: 32, scope: !91)
!412 = !DILocation(line: 159, column: 36, scope: !91)
!413 = !DILocation(line: 159, column: 5, scope: !91)
!414 = !DILocation(line: 161, column: 5, scope: !91)
!415 = !DILocation(line: 165, column: 5, scope: !91)
!416 = !DILocation(line: 167, column: 1, scope: !91)
!417 = distinct !DISubprogram(name: "asn1_template_new", scope: !32, file: !32, line: 202, type: !418, isLocal: true, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!418 = !DISubroutineType(types: !419)
!419 = !{!12, !82, !44}
!420 = !DILocalVariable(name: "pval", arg: 1, scope: !417, file: !32, line: 202, type: !82)
!421 = !DILocation(line: 202, column: 43, scope: !417)
!422 = !DILocalVariable(name: "tt", arg: 2, scope: !417, file: !32, line: 202, type: !44)
!423 = !DILocation(line: 202, column: 70, scope: !417)
!424 = !DILocalVariable(name: "it", scope: !417, file: !32, line: 204, type: !35)
!425 = !DILocation(line: 204, column: 22, scope: !417)
!426 = !DILocation(line: 204, column: 28, scope: !417)
!427 = !DILocation(line: 204, column: 32, scope: !417)
!428 = !DILocalVariable(name: "embed", scope: !417, file: !32, line: 205, type: !12)
!429 = !DILocation(line: 205, column: 9, scope: !417)
!430 = !DILocation(line: 205, column: 17, scope: !417)
!431 = !DILocation(line: 205, column: 21, scope: !417)
!432 = !DILocation(line: 205, column: 27, scope: !417)
!433 = !DILocalVariable(name: "tval", scope: !417, file: !32, line: 206, type: !5)
!434 = !DILocation(line: 206, column: 17, scope: !417)
!435 = !DILocalVariable(name: "ret", scope: !417, file: !32, line: 207, type: !12)
!436 = !DILocation(line: 207, column: 9, scope: !417)
!437 = !DILocation(line: 208, column: 9, scope: !438)
!438 = distinct !DILexicalBlock(scope: !417, file: !32, line: 208, column: 9)
!439 = !DILocation(line: 208, column: 9, scope: !417)
!440 = !DILocation(line: 209, column: 30, scope: !441)
!441 = distinct !DILexicalBlock(scope: !438, file: !32, line: 208, column: 16)
!442 = !DILocation(line: 209, column: 16, scope: !441)
!443 = !DILocation(line: 209, column: 14, scope: !441)
!444 = !DILocation(line: 210, column: 14, scope: !441)
!445 = !DILocation(line: 211, column: 5, scope: !441)
!446 = !DILocation(line: 212, column: 9, scope: !447)
!447 = distinct !DILexicalBlock(scope: !417, file: !32, line: 212, column: 9)
!448 = !DILocation(line: 212, column: 13, scope: !447)
!449 = !DILocation(line: 212, column: 19, scope: !447)
!450 = !DILocation(line: 212, column: 9, scope: !417)
!451 = !DILocation(line: 213, column: 29, scope: !452)
!452 = distinct !DILexicalBlock(scope: !447, file: !32, line: 212, column: 28)
!453 = !DILocation(line: 213, column: 35, scope: !452)
!454 = !DILocation(line: 213, column: 9, scope: !452)
!455 = !DILocation(line: 214, column: 9, scope: !452)
!456 = !DILocation(line: 218, column: 9, scope: !457)
!457 = distinct !DILexicalBlock(scope: !417, file: !32, line: 218, column: 9)
!458 = !DILocation(line: 218, column: 13, scope: !457)
!459 = !DILocation(line: 218, column: 19, scope: !457)
!460 = !DILocation(line: 218, column: 9, scope: !417)
!461 = !DILocation(line: 219, column: 10, scope: !462)
!462 = distinct !DILexicalBlock(scope: !457, file: !32, line: 218, column: 31)
!463 = !DILocation(line: 219, column: 15, scope: !462)
!464 = !DILocation(line: 220, column: 9, scope: !462)
!465 = !DILocation(line: 227, column: 9, scope: !466)
!466 = distinct !DILexicalBlock(scope: !417, file: !32, line: 227, column: 9)
!467 = !DILocation(line: 227, column: 13, scope: !466)
!468 = !DILocation(line: 227, column: 19, scope: !466)
!469 = !DILocation(line: 227, column: 9, scope: !417)
!470 = !DILocalVariable(name: "skval", scope: !471, file: !32, line: 228, type: !13)
!471 = distinct !DILexicalBlock(scope: !466, file: !32, line: 227, column: 33)
!472 = !DILocation(line: 228, column: 37, scope: !471)
!473 = !DILocation(line: 229, column: 17, scope: !471)
!474 = !DILocation(line: 229, column: 15, scope: !471)
!475 = !DILocation(line: 230, column: 14, scope: !476)
!476 = distinct !DILexicalBlock(scope: !471, file: !32, line: 230, column: 13)
!477 = !DILocation(line: 230, column: 13, scope: !471)
!478 = !DILocation(line: 231, column: 13, scope: !479)
!479 = distinct !DILexicalBlock(scope: !476, file: !32, line: 230, column: 21)
!480 = !DILocation(line: 232, column: 17, scope: !479)
!481 = !DILocation(line: 233, column: 13, scope: !479)
!482 = !DILocation(line: 235, column: 31, scope: !471)
!483 = !DILocation(line: 235, column: 17, scope: !471)
!484 = !DILocation(line: 235, column: 10, scope: !471)
!485 = !DILocation(line: 235, column: 15, scope: !471)
!486 = !DILocation(line: 236, column: 13, scope: !471)
!487 = !DILocation(line: 237, column: 9, scope: !471)
!488 = !DILocation(line: 240, column: 31, scope: !417)
!489 = !DILocation(line: 240, column: 37, scope: !417)
!490 = !DILocation(line: 240, column: 41, scope: !417)
!491 = !DILocation(line: 240, column: 11, scope: !417)
!492 = !DILocation(line: 240, column: 9, scope: !417)
!493 = !DILocation(line: 240, column: 5, scope: !417)
!494 = !DILocation(line: 245, column: 12, scope: !417)
!495 = !DILocation(line: 245, column: 5, scope: !417)
!496 = !DILocation(line: 246, column: 1, scope: !417)
!497 = distinct !DISubprogram(name: "asn1_primitive_new", scope: !32, file: !32, line: 262, type: !92, isLocal: true, isDefinition: true, scopeLine: 264, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!498 = !DILocalVariable(name: "pval", arg: 1, scope: !497, file: !32, line: 262, type: !82)
!499 = !DILocation(line: 262, column: 44, scope: !497)
!500 = !DILocalVariable(name: "it", arg: 2, scope: !497, file: !32, line: 262, type: !35)
!501 = !DILocation(line: 262, column: 67, scope: !497)
!502 = !DILocalVariable(name: "embed", arg: 3, scope: !497, file: !32, line: 263, type: !12)
!503 = !DILocation(line: 263, column: 35, scope: !497)
!504 = !DILocalVariable(name: "typ", scope: !497, file: !32, line: 265, type: !505)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !7, line: 473, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !7, line: 444, size: 128, align: 64, elements: !508)
!508 = !{!509, !510}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !507, file: !7, line: 445, baseType: !12, size: 32, align: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !507, file: !7, line: 472, baseType: !511, size: 64, align: 64, offset: 64)
!511 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !507, file: !7, line: 446, size: 64, align: 64, elements: !512)
!512 = !{!513, !515, !516, !517, !521, !524, !527, !530, !533, !536, !539, !542, !545, !548, !551, !554, !557, !560, !563, !564, !565}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !511, file: !7, line: 447, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !511, file: !7, line: 448, baseType: !10, size: 32, align: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !511, file: !7, line: 449, baseType: !17, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !511, file: !7, line: 450, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !11, line: 60, baseType: !520)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !11, line: 60, flags: DIFlagFwdDecl)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !511, file: !7, line: 451, baseType: !522, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !11, line: 40, baseType: !19)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !511, file: !7, line: 452, baseType: !525, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !11, line: 41, baseType: !19)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !511, file: !7, line: 453, baseType: !528, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !11, line: 42, baseType: !19)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !511, file: !7, line: 454, baseType: !531, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !11, line: 43, baseType: !19)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !511, file: !7, line: 455, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !11, line: 44, baseType: !19)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !511, file: !7, line: 456, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !11, line: 45, baseType: !19)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !511, file: !7, line: 457, baseType: !540, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !11, line: 46, baseType: !19)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !511, file: !7, line: 458, baseType: !543, size: 64, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !11, line: 47, baseType: !19)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !511, file: !7, line: 459, baseType: !546, size: 64, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !11, line: 49, baseType: !19)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !511, file: !7, line: 460, baseType: !549, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !11, line: 48, baseType: !19)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !511, file: !7, line: 461, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !11, line: 50, baseType: !19)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !511, file: !7, line: 462, baseType: !555, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !11, line: 52, baseType: !19)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !511, file: !7, line: 463, baseType: !558, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !11, line: 53, baseType: !19)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !511, file: !7, line: 464, baseType: !561, size: 64, align: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !11, line: 54, baseType: !19)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !511, file: !7, line: 469, baseType: !17, size: 64, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !511, file: !7, line: 470, baseType: !17, size: 64, align: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !511, file: !7, line: 471, baseType: !5, size: 64, align: 64)
!566 = !DILocation(line: 265, column: 16, scope: !497)
!567 = !DILocalVariable(name: "str", scope: !497, file: !32, line: 266, type: !17)
!568 = !DILocation(line: 266, column: 18, scope: !497)
!569 = !DILocalVariable(name: "utype", scope: !497, file: !32, line: 267, type: !12)
!570 = !DILocation(line: 267, column: 9, scope: !497)
!571 = !DILocation(line: 269, column: 10, scope: !572)
!572 = distinct !DILexicalBlock(scope: !497, file: !32, line: 269, column: 9)
!573 = !DILocation(line: 269, column: 9, scope: !497)
!574 = !DILocation(line: 270, column: 9, scope: !572)
!575 = !DILocation(line: 272, column: 9, scope: !576)
!576 = distinct !DILexicalBlock(scope: !497, file: !32, line: 272, column: 9)
!577 = !DILocation(line: 272, column: 13, scope: !576)
!578 = !DILocation(line: 272, column: 9, scope: !497)
!579 = !DILocalVariable(name: "pf", scope: !580, file: !32, line: 273, type: !581)
!580 = distinct !DILexicalBlock(scope: !576, file: !32, line: 272, column: 20)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRIMITIVE_FUNCS", file: !15, line: 701, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_PRIMITIVE_FUNCS_st", file: !15, line: 692, size: 512, align: 64, elements: !585)
!585 = !{!586, !587, !588, !589, !590, !591, !596, !602}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !584, file: !15, line: 693, baseType: !4, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !584, file: !15, line: 694, baseType: !50, size: 64, align: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "prim_new", scope: !584, file: !15, line: 695, baseType: !110, size: 64, align: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "prim_free", scope: !584, file: !15, line: 696, baseType: !113, size: 64, align: 64, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "prim_clear", scope: !584, file: !15, line: 697, baseType: !113, size: 64, align: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "prim_c2i", scope: !584, file: !15, line: 698, baseType: !592, size: 64, align: 64, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_primitive_c2i", file: !15, line: 675, baseType: !594)
!594 = !DISubroutineType(types: !595)
!595 = !{!12, !82, !124, !12, !12, !514, !35}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "prim_i2c", scope: !584, file: !15, line: 699, baseType: !597, size: 64, align: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_primitive_i2c", file: !15, line: 673, baseType: !599)
!599 = !DISubroutineType(types: !600)
!600 = !{!12, !82, !24, !601, !35}
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "prim_print", scope: !584, file: !15, line: 700, baseType: !603, size: 64, align: 64, offset: 448)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_primitive_print", file: !15, line: 678, baseType: !605)
!605 = !DISubroutineType(types: !606)
!606 = !{!12, !147, !82, !35, !12, !150}
!607 = !DILocation(line: 273, column: 37, scope: !580)
!608 = !DILocation(line: 273, column: 42, scope: !580)
!609 = !DILocation(line: 273, column: 46, scope: !580)
!610 = !DILocation(line: 274, column: 13, scope: !611)
!611 = distinct !DILexicalBlock(scope: !580, file: !32, line: 274, column: 13)
!612 = !DILocation(line: 274, column: 13, scope: !580)
!613 = !DILocation(line: 275, column: 17, scope: !614)
!614 = distinct !DILexicalBlock(scope: !615, file: !32, line: 275, column: 17)
!615 = distinct !DILexicalBlock(scope: !611, file: !32, line: 274, column: 20)
!616 = !DILocation(line: 275, column: 21, scope: !614)
!617 = !DILocation(line: 275, column: 17, scope: !615)
!618 = !DILocation(line: 276, column: 17, scope: !619)
!619 = distinct !DILexicalBlock(scope: !614, file: !32, line: 275, column: 33)
!620 = !DILocation(line: 276, column: 21, scope: !619)
!621 = !DILocation(line: 276, column: 32, scope: !619)
!622 = !DILocation(line: 276, column: 38, scope: !619)
!623 = !DILocation(line: 277, column: 17, scope: !619)
!624 = !DILocation(line: 279, column: 9, scope: !615)
!625 = !DILocation(line: 279, column: 20, scope: !626)
!626 = !DILexicalBlockFile(scope: !627, file: !32, discriminator: 1)
!627 = distinct !DILexicalBlock(scope: !611, file: !32, line: 279, column: 20)
!628 = !DILocation(line: 279, column: 24, scope: !626)
!629 = !DILocation(line: 280, column: 20, scope: !630)
!630 = distinct !DILexicalBlock(scope: !627, file: !32, line: 279, column: 34)
!631 = !DILocation(line: 280, column: 24, scope: !630)
!632 = !DILocation(line: 280, column: 33, scope: !630)
!633 = !DILocation(line: 280, column: 39, scope: !630)
!634 = !DILocation(line: 280, column: 13, scope: !630)
!635 = !DILocation(line: 282, column: 5, scope: !580)
!636 = !DILocation(line: 284, column: 9, scope: !637)
!637 = distinct !DILexicalBlock(scope: !497, file: !32, line: 284, column: 9)
!638 = !DILocation(line: 284, column: 13, scope: !637)
!639 = !DILocation(line: 284, column: 19, scope: !637)
!640 = !DILocation(line: 284, column: 9, scope: !497)
!641 = !DILocation(line: 285, column: 15, scope: !637)
!642 = !DILocation(line: 285, column: 9, scope: !637)
!643 = !DILocation(line: 287, column: 17, scope: !637)
!644 = !DILocation(line: 287, column: 21, scope: !637)
!645 = !DILocation(line: 287, column: 15, scope: !637)
!646 = !DILocation(line: 288, column: 13, scope: !497)
!647 = !DILocation(line: 288, column: 5, scope: !497)
!648 = !DILocation(line: 290, column: 31, scope: !649)
!649 = distinct !DILexicalBlock(scope: !497, file: !32, line: 288, column: 20)
!650 = !DILocation(line: 290, column: 17, scope: !649)
!651 = !DILocation(line: 290, column: 10, scope: !649)
!652 = !DILocation(line: 290, column: 15, scope: !649)
!653 = !DILocation(line: 291, column: 9, scope: !649)
!654 = !DILocation(line: 294, column: 33, scope: !649)
!655 = !DILocation(line: 294, column: 37, scope: !649)
!656 = !DILocation(line: 294, column: 26, scope: !649)
!657 = !DILocation(line: 294, column: 9, scope: !649)
!658 = !DILocation(line: 294, column: 31, scope: !649)
!659 = !DILocation(line: 295, column: 9, scope: !649)
!660 = !DILocation(line: 298, column: 10, scope: !649)
!661 = !DILocation(line: 298, column: 15, scope: !649)
!662 = !DILocation(line: 299, column: 9, scope: !649)
!663 = !DILocation(line: 302, column: 20, scope: !664)
!664 = distinct !DILexicalBlock(scope: !649, file: !32, line: 302, column: 13)
!665 = !DILocation(line: 302, column: 18, scope: !664)
!666 = !DILocation(line: 302, column: 80, scope: !664)
!667 = !DILocation(line: 302, column: 13, scope: !649)
