; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--bn--libcrypto-shlib-bn_exp2.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--bn--libcrypto-shlib-bn_exp2.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bignum_st = type { i64*, i32, i32, i32, i32 }
%struct.bignum_ctx = type opaque
%struct.bn_mont_ctx_st = type { i32, %struct.bignum_st, %struct.bignum_st, %struct.bignum_st, [2 x i64], i32 }

@.str = private unnamed_addr constant [20 x i8] c"crypto/bn/bn_exp2.c\00", align 1

; Function Attrs: nounwind uwtable
define i32 @BN_mod_exp2_mont(%struct.bignum_st* %rr, %struct.bignum_st* %a1, %struct.bignum_st* %p1, %struct.bignum_st* %a2, %struct.bignum_st* %p2, %struct.bignum_st* %m, %struct.bignum_ctx* %ctx, %struct.bn_mont_ctx_st* %in_mont) #0 !dbg !8 {
entry:
  %retval = alloca i32, align 4
  %rr.addr = alloca %struct.bignum_st*, align 8
  %a1.addr = alloca %struct.bignum_st*, align 8
  %p1.addr = alloca %struct.bignum_st*, align 8
  %a2.addr = alloca %struct.bignum_st*, align 8
  %p2.addr = alloca %struct.bignum_st*, align 8
  %m.addr = alloca %struct.bignum_st*, align 8
  %ctx.addr = alloca %struct.bignum_ctx*, align 8
  %in_mont.addr = alloca %struct.bn_mont_ctx_st*, align 8
  %i = alloca i32, align 4
  %j = alloca i32, align 4
  %bits = alloca i32, align 4
  %b = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--bn--libcrypto-shlib-bn_exp2.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{i32 2, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!8 = distinct !DISubprogram(name: "BN_mod_exp2_mont", scope: !9, file: !9, line: 16, type: !10, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!9 = !DIFile(filename: "crypto/bn/bn_exp2.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !13, !26, !26, !26, !26, !26, !28, !31}
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIGNUM", file: !15, line: 80, baseType: !16)
!15 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_st", file: !17, line: 218, size: 192, align: 64, elements: !18)
!17 = !DIFile(filename: "crypto/bn/bn_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!18 = !{!19, !22, !23, !24, !25}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !16, file: !17, line: 219, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !16, file: !17, line: 221, baseType: !12, size: 32, align: 32, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "dmax", scope: !16, file: !17, line: 223, baseType: !12, size: 32, align: 32, offset: 96)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "neg", scope: !16, file: !17, line: 224, baseType: !12, size: 32, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !16, file: !17, line: 225, baseType: !12, size: 32, align: 32, offset: 160)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_CTX", file: !15, line: 81, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_ctx", file: !15, line: 81, flags: DIFlagFwdDecl)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_MONT_CTX", file: !15, line: 83, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bn_mont_ctx_st", file: !17, line: 229, size: 832, align: 64, elements: !34)
!34 = !{!35, !36, !37, !38, !39, !43}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ri", scope: !33, file: !17, line: 230, baseType: !12, size: 32, align: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "RR", scope: !33, file: !17, line: 231, baseType: !14, size: 192, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !33, file: !17, line: 233, baseType: !14, size: 192, align: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "Ni", scope: !33, file: !17, line: 234, baseType: !14, size: 192, align: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "n0", scope: !33, file: !17, line: 236, baseType: !40, size: 128, align: 64, offset: 640)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 128, align: 64, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 2)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !33, file: !17, line: 239, baseType: !12, size: 32, align: 32, offset: 768)
!44 = !DILocalVariable(name: "rr", arg: 1, scope: !8, file: !9, line: 16, type: !13)
!45 = !DIExpression()
!46 = !DILocation(line: 16, column: 30, scope: !8)
!47 = !DILocalVariable(name: "a1", arg: 2, scope: !8, file: !9, line: 16, type: !26)
!48 = !DILocation(line: 16, column: 48, scope: !8)
!49 = !DILocalVariable(name: "p1", arg: 3, scope: !8, file: !9, line: 16, type: !26)
!50 = !DILocation(line: 16, column: 66, scope: !8)
!51 = !DILocalVariable(name: "a2", arg: 4, scope: !8, file: !9, line: 17, type: !26)
!52 = !DILocation(line: 17, column: 36, scope: !8)
!53 = !DILocalVariable(name: "p2", arg: 5, scope: !8, file: !9, line: 17, type: !26)
!54 = !DILocation(line: 17, column: 54, scope: !8)
!55 = !DILocalVariable(name: "m", arg: 6, scope: !8, file: !9, line: 17, type: !26)
!56 = !DILocation(line: 17, column: 72, scope: !8)
!57 = !DILocalVariable(name: "ctx", arg: 7, scope: !8, file: !9, line: 18, type: !28)
!58 = !DILocation(line: 18, column: 30, scope: !8)
!59 = !DILocalVariable(name: "in_mont", arg: 8, scope: !8, file: !9, line: 18, type: !31)
!60 = !DILocation(line: 18, column: 48, scope: !8)
!61 = !DILocalVariable(name: "i", scope: !8, file: !9, line: 20, type: !12)
!62 = !DILocation(line: 20, column: 9, scope: !8)
!63 = !DILocalVariable(name: "j", scope: !8, file: !9, line: 20, type: !12)
!64 = !DILocation(line: 20, column: 12, scope: !8)
!65 = !DILocalVariable(name: "bits", scope: !8, file: !9, line: 20, type: !12)
!66 = !DILocation(line: 20, column: 15, scope: !8)
!67 = !DILocalVariable(name: "b", scope: !8, file: !9, line: 20, type: !12)
!68 = !DILocation(line: 20, column: 21, scope: !8)
!69 = !DILocalVariable(name: "bits1", scope: !8, file: !9, line: 20, type: !12)
!70 = !DILocation(line: 20, column: 24, scope: !8)
!71 = !DILocalVariable(name: "bits2", scope: !8, file: !9, line: 20, type: !12)
!72 = !DILocation(line: 20, column: 31, scope: !8)
!73 = !DILocalVariable(name: "ret", scope: !8, file: !9, line: 20, type: !12)
!74 = !DILocation(line: 20, column: 38, scope: !8)
!75 = !DILocalVariable(name: "wpos1", scope: !8, file: !9, line: 21, type: !12)
!76 = !DILocation(line: 21, column: 12, scope: !8)
!77 = !DILocalVariable(name: "wpos2", scope: !8, file: !9, line: 21, type: !12)
!78 = !DILocation(line: 21, column: 19, scope: !8)
!79 = !DILocalVariable(name: "window1", scope: !8, file: !9, line: 21, type: !12)
!80 = !DILocation(line: 21, column: 26, scope: !8)
!81 = !DILocalVariable(name: "window2", scope: !8, file: !9, line: 21, type: !12)
!82 = !DILocation(line: 21, column: 35, scope: !8)
!83 = !DILocalVariable(name: "wvalue1", scope: !8, file: !9, line: 21, type: !12)
!84 = !DILocation(line: 21, column: 44, scope: !8)
!85 = !DILocalVariable(name: "wvalue2", scope: !8, file: !9, line: 21, type: !12)
!86 = !DILocation(line: 21, column: 53, scope: !8)
!87 = !DILocalVariable(name: "r_is_one", scope: !8, file: !9, line: 22, type: !12)
!88 = !DILocation(line: 22, column: 9, scope: !8)
!89 = !DILocalVariable(name: "d", scope: !8, file: !9, line: 23, type: !13)
!90 = !DILocation(line: 23, column: 13, scope: !8)
!91 = !DILocalVariable(name: "r", scope: !8, file: !9, line: 23, type: !13)
!92 = !DILocation(line: 23, column: 17, scope: !8)
!93 = !DILocalVariable(name: "a_mod_m", scope: !8, file: !9, line: 24, type: !26)
!94 = !DILocation(line: 24, column: 19, scope: !8)
!95 = !DILocalVariable(name: "val1", scope: !8, file: !9, line: 26, type: !96)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 2048, align: 64, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 32)
!99 = !DILocation(line: 26, column: 13, scope: !8)
!100 = !DILocalVariable(name: "val2", scope: !8, file: !9, line: 26, type: !96)
!101 = !DILocation(line: 26, column: 24, scope: !8)
!102 = !DILocalVariable(name: "mont", scope: !8, file: !9, line: 27, type: !31)
!103 = !DILocation(line: 27, column: 18, scope: !8)
