; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--pkcs12--libcrypto-shlib-p12_utl.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--pkcs12--libcrypto-shlib-p12_utl.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type opaque
%struct.bio_st = type opaque
%struct.PKCS12_st = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [24 x i8] c"crypto/pkcs12/p12_utl.c\00", align 1
@PKCS12_it = external constant %struct.ASN1_ITEM_st, align 1

; Function Attrs: nounwind uwtable
define i8* @OPENSSL_asc2uni(i8* %asc, i32 %asclen, i8** %uni, i32* %unilen) #0 !dbg !12 {
entry:
  %retval = alloca i8*, align 8
  %asc.addr = alloca i8*, align 8
  %asclen.addr = alloca i32, align 4
  %uni.addr = alloca i8**, align 8
  %unilen.addr = alloca i32*, align 8
  %ulen = alloca i32, align 4
  %i = alloca i32, align 4
  %unitmp = alloca i8*, align 8
  store i8* %asc, i8** %asc.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %asc.addr, metadata !22, metadata !23), !dbg !24
  store i32 %asclen, i32* %asclen.addr, align 4

!533 = !DILocation(line: 160, column: 9, scope: !534)
!534 = distinct !DILexicalBlock(scope: !504, file: !13, line: 160, column: 9)
!535 = !DILocation(line: 160, column: 18, scope: !534)
!536 = !DILocation(line: 160, column: 28, scope: !534)
!537 = !DILocation(line: 160, column: 31, scope: !538)
!538 = !DILexicalBlockFile(scope: !534, file: !13, discriminator: 1)
!539 = !DILocation(line: 160, column: 40, scope: !538)
!540 = !DILocation(line: 160, column: 9, scope: !538)
!541 = !DILocalVariable(name: "lo", scope: !542, file: !13, line: 161, type: !293)
!542 = distinct !DILexicalBlock(scope: !534, file: !13, line: 160, column: 50)
!543 = !DILocation(line: 161, column: 22, scope: !542)
!544 = !DILocation(line: 163, column: 13, scope: !545)
!545 = distinct !DILexicalBlock(scope: !542, file: !13, line: 163, column: 13)
!546 = !DILocation(line: 163, column: 17, scope: !545)
!547 = !DILocation(line: 163, column: 13, scope: !542)
!548 = !DILocation(line: 163, column: 22, scope: !549)
!549 = !DILexicalBlockFile(scope: !545, file: !13, discriminator: 1)
!550 = !DILocation(line: 165, column: 18, scope: !542)
!551 = !DILocation(line: 166, column: 18, scope: !542)
!552 = !DILocation(line: 167, column: 15, scope: !542)
!553 = !DILocation(line: 167, column: 23, scope: !542)
!554 = !DILocation(line: 167, column: 30, scope: !542)
!555 = !DILocation(line: 167, column: 28, scope: !542)
!556 = !DILocation(line: 167, column: 12, scope: !542)
!557 = !DILocation(line: 168, column: 13, scope: !558)
!558 = distinct !DILexicalBlock(scope: !542, file: !13, line: 168, column: 13)
!559 = !DILocation(line: 168, column: 16, scope: !558)
!560 = !DILocation(line: 168, column: 25, scope: !558)
!561 = !DILocation(line: 168, column: 28, scope: !562)
!562 = !DILexicalBlockFile(scope: !558, file: !13, discriminator: 1)
!563 = !DILocation(line: 168, column: 31, scope: !562)
!564 = !DILocation(line: 168, column: 13, scope: !562)
!565 = !DILocation(line: 168, column: 42, scope: !566)
!566 = !DILexicalBlockFile(scope: !558, file: !13, discriminator: 2)
!567 = !DILocation(line: 169, column: 21, scope: !542)
!568 = !DILocation(line: 169, column: 23, scope: !542)
!569 = !DILocation(line: 169, column: 18, scope: !542)
!570 = !DILocation(line: 170, column: 18, scope: !542)
!571 = !DILocation(line: 171, column: 5, scope: !542)
!572 = !DILocation(line: 173, column: 39, scope: !504)
!573 = !DILocation(line: 173, column: 44, scope: !504)
!574 = !DILocation(line: 173, column: 48, scope: !504)
!575 = !DILocation(line: 173, column: 44, scope: !576)
!576 = !DILexicalBlockFile(scope: !504, file: !13, discriminator: 1)
!577 = !DILocation(line: 173, column: 58, scope: !578)
!578 = !DILexicalBlockFile(scope: !504, file: !13, discriminator: 2)
!579 = !DILocation(line: 173, column: 44, scope: !578)
!580 = !DILocation(line: 173, column: 44, scope: !581)
!581 = !DILexicalBlockFile(scope: !504, file: !13, discriminator: 3)
!582 = !DILocation(line: 173, column: 63, scope: !581)
!583 = !DILocation(line: 173, column: 12, scope: !581)
!584 = !DILocation(line: 173, column: 5, scope: !581)
!585 = !DILocation(line: 174, column: 1, scope: !504)
!586 = distinct !DISubprogram(name: "i2d_PKCS12_bio", scope: !13, file: !13, line: 222, type: !587, isLocal: false, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!587 = !DISubroutineType(types: !588)
!588 = !{!19, !589, !593}
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64, align: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !591, line: 79, baseType: !592)
!591 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !591, line: 79, flags: DIFlagFwdDecl)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS12", file: !595, line: 45, baseType: !596)
!595 = !DIFile(filename: "include/openssl/pkcs12.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "PKCS12_st", file: !595, line: 45, flags: DIFlagFwdDecl)
!597 = !DILocalVariable(name: "bp", arg: 1, scope: !586, file: !13, line: 222, type: !589)
!598 = !DILocation(line: 222, column: 25, scope: !586)
!599 = !DILocalVariable(name: "p12", arg: 2, scope: !586, file: !13, line: 222, type: !593)
!600 = !DILocation(line: 222, column: 37, scope: !586)
!601 = !DILocation(line: 224, column: 46, scope: !586)
!602 = !DILocation(line: 224, column: 50, scope: !586)
!603 = !DILocation(line: 224, column: 12, scope: !586)
!604 = !DILocation(line: 224, column: 5, scope: !586)
!605 = distinct !DISubprogram(name: "i2d_PKCS12_fp", scope: !13, file: !13, line: 228, type: !606, isLocal: false, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!606 = !DISubroutineType(types: !607)
!607 = !{!19, !608, !593}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !610, line: 48, baseType: !611)
!610 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !612, line: 241, size: 1728, align: 64, elements: !613)
!612 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!613 = !{!614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !634, !635, !636, !637, !641, !643, !645, !649, !652, !654, !655, !656, !657, !658, !661, !662}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !611, file: !612, line: 242, baseType: !19, size: 32, align: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !611, file: !612, line: 247, baseType: !113, size: 64, align: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !611, file: !612, line: 248, baseType: !113, size: 64, align: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !611, file: !612, line: 249, baseType: !113, size: 64, align: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !611, file: !612, line: 250, baseType: !113, size: 64, align: 64, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !611, file: !612, line: 251, baseType: !113, size: 64, align: 64, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !611, file: !612, line: 252, baseType: !113, size: 64, align: 64, offset: 384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !611, file: !612, line: 253, baseType: !113, size: 64, align: 64, offset: 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !611, file: !612, line: 254, baseType: !113, size: 64, align: 64, offset: 512)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !611, file: !612, line: 256, baseType: !113, size: 64, align: 64, offset: 576)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !611, file: !612, line: 257, baseType: !113, size: 64, align: 64, offset: 640)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !611, file: !612, line: 258, baseType: !113, size: 64, align: 64, offset: 704)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !611, file: !612, line: 260, baseType: !627, size: 64, align: 64, offset: 768)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !612, line: 156, size: 192, align: 64, elements: !629)
!629 = !{!630, !631, !633}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !628, file: !612, line: 157, baseType: !627, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !628, file: !612, line: 158, baseType: !632, size: 64, align: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64, align: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !628, file: !612, line: 162, baseType: !19, size: 32, align: 32, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !611, file: !612, line: 262, baseType: !632, size: 64, align: 64, offset: 832)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !611, file: !612, line: 264, baseType: !19, size: 32, align: 32, offset: 896)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !611, file: !612, line: 268, baseType: !19, size: 32, align: 32, offset: 928)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !611, file: !612, line: 270, baseType: !638, size: 64, align: 64, offset: 960)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !639, line: 131, baseType: !640)
!639 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!640 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !611, file: !612, line: 274, baseType: !642, size: 16, align: 16, offset: 1024)
!642 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !611, file: !612, line: 275, baseType: !644, size: 8, align: 8, offset: 1040)
!644 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !611, file: !612, line: 276, baseType: !646, size: 8, align: 8, offset: 1048)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, align: 8, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 1)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !611, file: !612, line: 280, baseType: !650, size: 64, align: 64, offset: 1088)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !612, line: 150, baseType: null)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !611, file: !612, line: 289, baseType: !653, size: 64, align: 64, offset: 1152)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !639, line: 132, baseType: !640)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !611, file: !612, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !611, file: !612, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !611, file: !612, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !611, file: !612, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !611, file: !612, line: 302, baseType: !659, size: 64, align: 64, offset: 1472)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !660, line: 216, baseType: !199)
!660 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !611, file: !612, line: 303, baseType: !19, size: 32, align: 32, offset: 1536)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !611, file: !612, line: 305, baseType: !663, size: 160, align: 8, offset: 1568)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 160, align: 8, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 20)
!666 = !DILocalVariable(name: "fp", arg: 1, scope: !605, file: !13, line: 228, type: !608)
!667 = !DILocation(line: 228, column: 25, scope: !605)
!668 = !DILocalVariable(name: "p12", arg: 2, scope: !605, file: !13, line: 228, type: !593)
!669 = !DILocation(line: 228, column: 37, scope: !605)
!670 = !DILocation(line: 230, column: 45, scope: !605)
!671 = !DILocation(line: 230, column: 49, scope: !605)
!672 = !DILocation(line: 230, column: 12, scope: !605)
!673 = !DILocation(line: 230, column: 5, scope: !605)
!674 = distinct !DISubprogram(name: "d2i_PKCS12_bio", scope: !13, file: !13, line: 234, type: !675, isLocal: false, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!675 = !DISubroutineType(types: !676)
!676 = !{!593, !589, !677}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!678 = !DILocalVariable(name: "bp", arg: 1, scope: !674, file: !13, line: 234, type: !589)
!679 = !DILocation(line: 234, column: 29, scope: !674)
!680 = !DILocalVariable(name: "p12", arg: 2, scope: !674, file: !13, line: 234, type: !677)
!681 = !DILocation(line: 234, column: 42, scope: !674)
!682 = !DILocation(line: 236, column: 46, scope: !674)
!683 = !DILocation(line: 236, column: 50, scope: !674)
!684 = !DILocation(line: 236, column: 12, scope: !674)
!685 = !DILocation(line: 236, column: 5, scope: !674)
!686 = distinct !DISubprogram(name: "d2i_PKCS12_fp", scope: !13, file: !13, line: 240, type: !687, isLocal: false, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!687 = !DISubroutineType(types: !688)
!688 = !{!593, !608, !677}
!689 = !DILocalVariable(name: "fp", arg: 1, scope: !686, file: !13, line: 240, type: !608)
!690 = !DILocation(line: 240, column: 29, scope: !686)
!691 = !DILocalVariable(name: "p12", arg: 2, scope: !686, file: !13, line: 240, type: !677)
!692 = !DILocation(line: 240, column: 42, scope: !686)
!693 = !DILocation(line: 242, column: 45, scope: !686)
!694 = !DILocation(line: 242, column: 49, scope: !686)
!695 = !DILocation(line: 242, column: 12, scope: !686)
!696 = !DILocation(line: 242, column: 5, scope: !686)
