; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--x509v3--libcrypto-shlib-pcy_node.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--x509v3--libcrypto-shlib-pcy_node.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.stack_st_X509_POLICY_NODE = type opaque
%struct.X509_POLICY_NODE_st = type { %struct.X509_POLICY_DATA_st*, %struct.X509_POLICY_NODE_st*, i32 }
%struct.X509_POLICY_DATA_st = type { i32, %struct.asn1_object_st*, %struct.stack_st_POLICYQUALINFO*, %struct.stack_st_ASN1_OBJECT* }
%struct.asn1_object_st = type opaque
%struct.stack_st_POLICYQUALINFO = type opaque
%struct.stack_st_ASN1_OBJECT = type opaque
%struct.stack_st = type opaque
%struct.X509_POLICY_LEVEL_st = type { %struct.x509_st*, %struct.stack_st_X509_POLICY_NODE*, %struct.X509_POLICY_NODE_st*, i32 }
%struct.x509_st = type opaque
%struct.X509_POLICY_TREE_st = type { %struct.X509_POLICY_LEVEL_st*, i32, %struct.stack_st_X509_POLICY_DATA*, %struct.stack_st_X509_POLICY_NODE*, %struct.stack_st_X509_POLICY_NODE*, i32 }
%struct.stack_st_X509_POLICY_DATA = type opaque

@.str = private unnamed_addr constant [25 x i8] c"crypto/x509v3/pcy_node.c\00", align 1

; Function Attrs: nounwind uwtable
define %struct.stack_st_X509_POLICY_NODE* @policy_node_cmp_new() #0 !dbg !53 {
entry:

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--x509v3--libcrypto-shlib-pcy_node.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{}
!3 = !{!4, !8, !9, !12, !20, !18, !23, !46, !48}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !6, line: 60, baseType: !7)
!6 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !6, line: 60, flags: DIFlagFwdDecl)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_POLICY_NODE", file: !11, line: 608, flags: DIFlagFwdDecl)
!11 = !DIFile(filename: "include/openssl/x509_vfy.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_compfunc", file: !13, line: 19, baseType: !14)
!13 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DISubroutineType(types: !16)
!16 = !{!17, !18, !18}
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !13, line: 17, baseType: !22)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !13, line: 17, flags: DIFlagFwdDecl)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_POLICY_NODE", file: !6, line: 157, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_POLICY_NODE_st", file: !26, line: 90, size: 192, align: 64, elements: !27)
!26 = !DIFile(filename: "crypto/x509v3/pcy_int.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!27 = !{!28, !44, !45}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !25, file: !26, line: 92, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_POLICY_DATA", file: !26, line: 10, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_POLICY_DATA_st", file: !26, line: 23, size: 256, align: 64, elements: !33)
!33 = !{!34, !36, !37, !40}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !32, file: !26, line: 24, baseType: !35, size: 32, align: 32)
!35 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "valid_policy", scope: !32, file: !26, line: 26, baseType: !4, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier_set", scope: !32, file: !26, line: 27, baseType: !38, size: 64, align: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_POLICYQUALINFO", file: !11, line: 623, flags: DIFlagFwdDecl)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "expected_policy_set", scope: !32, file: !26, line: 28, baseType: !41, size: 64, align: 64, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ASN1_OBJECT", file: !43, line: 536, flags: DIFlagFwdDecl)
!43 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!44 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !25, file: !26, line: 94, baseType: !23, size: 64, align: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "nchild", scope: !25, file: !26, line: 96, baseType: !17, size: 32, align: 32, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_POLICY_DATA", file: !26, line: 12, flags: DIFlagFwdDecl)
!50 = !{i32 2, !"Dwarf Version", i32 4}
!51 = !{i32 2, !"Debug Info Version", i32 3}
!52 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!53 = distinct !DISubprogram(name: "policy_node_cmp_new", scope: !54, file: !54, line: 23, type: !55, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!54 = !DIFile(filename: "crypto/x509v3/pcy_node.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!55 = !DISubroutineType(types: !56)
!56 = !{!9}
!57 = !DILocation(line: 25, column: 12, scope: !53)
!58 = !DILocation(line: 25, column: 5, scope: !53)
!59 = distinct !DISubprogram(name: "sk_X509_POLICY_NODE_new", scope: !60, file: !60, line: 719, type: !61, isLocal: true, isDefinition: true, scopeLine: 719, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!60 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!61 = !DISubroutineType(types: !62)
!62 = !{!9, !63}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_X509_POLICY_NODE_compfunc", file: !60, line: 719, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!17, !67, !67}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!71 = !DILocalVariable(name: "compare", arg: 1, scope: !59, file: !60, line: 719, type: !63)
!72 = !DIExpression()
!73 = !DILocation(line: 719, column: 808, scope: !59)
!74 = !DILocation(line: 719, column: 898, scope: !59)
!75 = !DILocation(line: 719, column: 877, scope: !59)
!76 = !DILocation(line: 719, column: 862, scope: !59)
!77 = !DILocation(line: 719, column: 826, scope: !59)
!78 = !DILocation(line: 719, column: 819, scope: !59)
!79 = distinct !DISubprogram(name: "node_cmp", scope: !54, file: !54, line: 17, type: !65, isLocal: true, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!80 = !DILocalVariable(name: "a", arg: 1, scope: !79, file: !54, line: 17, type: !67)
!81 = !DILocation(line: 17, column: 52, scope: !79)
!82 = !DILocalVariable(name: "b", arg: 2, scope: !79, file: !54, line: 18, type: !67)
!83 = !DILocation(line: 18, column: 52, scope: !79)
!84 = !DILocation(line: 20, column: 22, scope: !79)
!85 = !DILocation(line: 20, column: 21, scope: !79)
!86 = !DILocation(line: 20, column: 26, scope: !79)
!87 = !DILocation(line: 20, column: 32, scope: !79)
!88 = !DILocation(line: 20, column: 48, scope: !79)
!89 = !DILocation(line: 20, column: 47, scope: !79)
!90 = !DILocation(line: 20, column: 52, scope: !79)
!91 = !DILocation(line: 20, column: 58, scope: !79)
!92 = !DILocation(line: 20, column: 12, scope: !79)
!93 = !DILocation(line: 20, column: 5, scope: !79)
!94 = distinct !DISubprogram(name: "tree_find_sk", scope: !54, file: !54, line: 28, type: !95, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!95 = !DISubroutineType(types: !96)
!96 = !{!23, !9, !97}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!99 = !DILocalVariable(name: "nodes", arg: 1, scope: !94, file: !54, line: 28, type: !9)
!100 = !DILocation(line: 28, column: 66, scope: !94)
!101 = !DILocalVariable(name: "id", arg: 2, scope: !94, file: !54, line: 29, type: !97)
!102 = !DILocation(line: 29, column: 51, scope: !94)
!103 = !DILocalVariable(name: "n", scope: !94, file: !54, line: 31, type: !31)
!104 = !DILocation(line: 31, column: 22, scope: !94)
!105 = !DILocalVariable(name: "l", scope: !94, file: !54, line: 32, type: !24)
!106 = !DILocation(line: 32, column: 22, scope: !94)
!107 = !DILocalVariable(name: "idx", scope: !94, file: !54, line: 33, type: !17)
!108 = !DILocation(line: 33, column: 9, scope: !94)
!109 = !DILocation(line: 35, column: 37, scope: !94)
!110 = !DILocation(line: 35, column: 7, scope: !94)
!111 = !DILocation(line: 35, column: 20, scope: !94)
!112 = !DILocation(line: 36, column: 7, scope: !94)
!113 = !DILocation(line: 36, column: 12, scope: !94)
!114 = !DILocation(line: 38, column: 36, scope: !94)
!115 = !DILocation(line: 38, column: 11, scope: !94)
!116 = !DILocation(line: 38, column: 9, scope: !94)
!117 = !DILocation(line: 39, column: 38, scope: !94)
!118 = !DILocation(line: 39, column: 45, scope: !94)
!119 = !DILocation(line: 39, column: 12, scope: !94)
!120 = !DILocation(line: 39, column: 5, scope: !94)
!121 = distinct !DISubprogram(name: "sk_X509_POLICY_NODE_find", scope: !60, file: !60, line: 719, type: !122, isLocal: true, isDefinition: true, scopeLine: 719, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!122 = !DISubroutineType(types: !123)
!123 = !{!17, !9, !23}
!124 = !DILocalVariable(name: "sk", arg: 1, scope: !121, file: !60, line: 719, type: !9)
!125 = !DILocation(line: 719, column: 3807, scope: !121)
!126 = !DILocalVariable(name: "ptr", arg: 2, scope: !121, file: !60, line: 719, type: !23)
!127 = !DILocation(line: 719, column: 3829, scope: !121)
!128 = !DILocation(line: 719, column: 3876, scope: !121)
!129 = !DILocation(line: 719, column: 3859, scope: !121)
!130 = !DILocation(line: 719, column: 3894, scope: !121)
!131 = !DILocation(line: 719, column: 3880, scope: !121)
!132 = !DILocation(line: 719, column: 3843, scope: !121)
!133 = !DILocation(line: 719, column: 3836, scope: !121)
!134 = distinct !DISubprogram(name: "sk_X509_POLICY_NODE_value", scope: !60, file: !60, line: 719, type: !135, isLocal: true, isDefinition: true, scopeLine: 719, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!135 = !DISubroutineType(types: !136)
!136 = !{!23, !137, !17}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!139 = !DILocalVariable(name: "sk", arg: 1, scope: !134, file: !60, line: 719, type: !137)
!140 = !DILocation(line: 719, column: 589, scope: !134)
!141 = !DILocalVariable(name: "idx", arg: 2, scope: !134, file: !60, line: 719, type: !17)
!142 = !DILocation(line: 719, column: 597, scope: !134)
!143 = !DILocation(line: 719, column: 671, scope: !134)
!144 = !DILocation(line: 719, column: 648, scope: !134)
!145 = !DILocation(line: 719, column: 675, scope: !134)
!146 = !DILocation(line: 719, column: 631, scope: !134)
!147 = !DILocation(line: 719, column: 611, scope: !134)
!148 = !DILocation(line: 719, column: 604, scope: !134)
!149 = distinct !DISubprogram(name: "level_find_node", scope: !54, file: !54, line: 43, type: !150, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!150 = !DISubroutineType(types: !151)
!151 = !{!23, !152, !69, !97}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_POLICY_LEVEL", file: !6, line: 158, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_POLICY_LEVEL_st", file: !26, line: 99, size: 256, align: 64, elements: !156)
!156 = !{!157, !161, !162, !163}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !155, file: !26, line: 101, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !6, line: 124, baseType: !160)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !6, line: 124, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !155, file: !26, line: 103, baseType: !9, size: 64, align: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "anyPolicy", scope: !155, file: !26, line: 105, baseType: !23, size: 64, align: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !155, file: !26, line: 110, baseType: !35, size: 32, align: 32, offset: 192)
!164 = !DILocalVariable(name: "level", arg: 1, scope: !149, file: !54, line: 43, type: !152)
!165 = !DILocation(line: 43, column: 60, scope: !149)
!166 = !DILocalVariable(name: "parent", arg: 2, scope: !149, file: !54, line: 44, type: !69)
!167 = !DILocation(line: 44, column: 59, scope: !149)
!168 = !DILocalVariable(name: "id", arg: 3, scope: !149, file: !54, line: 45, type: !97)
!169 = !DILocation(line: 45, column: 54, scope: !149)
!170 = !DILocalVariable(name: "node", scope: !149, file: !54, line: 47, type: !23)
!171 = !DILocation(line: 47, column: 23, scope: !149)
!172 = !DILocalVariable(name: "i", scope: !149, file: !54, line: 48, type: !17)
!173 = !DILocation(line: 48, column: 9, scope: !149)
!174 = !DILocation(line: 49, column: 12, scope: !175)
!175 = distinct !DILexicalBlock(scope: !149, file: !54, line: 49, column: 5)
!176 = !DILocation(line: 49, column: 10, scope: !175)
!177 = !DILocation(line: 49, column: 17, scope: !178)
!178 = !DILexicalBlockFile(scope: !179, file: !54, discriminator: 1)
!179 = distinct !DILexicalBlock(scope: !175, file: !54, line: 49, column: 5)
!180 = !DILocation(line: 49, column: 45, scope: !178)
!181 = !DILocation(line: 49, column: 52, scope: !178)
!182 = !DILocation(line: 49, column: 21, scope: !178)
!183 = !DILocation(line: 49, column: 19, scope: !178)
!184 = !DILocation(line: 49, column: 5, scope: !178)
!185 = !DILocation(line: 50, column: 42, scope: !186)
!186 = distinct !DILexicalBlock(scope: !179, file: !54, line: 49, column: 65)
!187 = !DILocation(line: 50, column: 49, scope: !186)
!188 = !DILocation(line: 50, column: 56, scope: !186)
!189 = !DILocation(line: 50, column: 16, scope: !186)
!190 = !DILocation(line: 50, column: 14, scope: !186)
!191 = !DILocation(line: 51, column: 13, scope: !192)
!192 = distinct !DILexicalBlock(scope: !186, file: !54, line: 51, column: 13)
!193 = !DILocation(line: 51, column: 19, scope: !192)
!194 = !DILocation(line: 51, column: 29, scope: !192)
!195 = !DILocation(line: 51, column: 26, scope: !192)
!196 = !DILocation(line: 51, column: 13, scope: !186)
!197 = !DILocation(line: 52, column: 26, scope: !198)
!198 = distinct !DILexicalBlock(scope: !199, file: !54, line: 52, column: 17)
!199 = distinct !DILexicalBlock(scope: !192, file: !54, line: 51, column: 37)
!200 = !DILocation(line: 52, column: 32, scope: !198)
!201 = !DILocation(line: 52, column: 38, scope: !198)
!202 = !DILocation(line: 52, column: 52, scope: !198)
!203 = !DILocation(line: 52, column: 18, scope: !198)
!204 = !DILocation(line: 52, column: 17, scope: !199)
!205 = !DILocation(line: 53, column: 24, scope: !198)
!206 = !DILocation(line: 53, column: 17, scope: !198)
!207 = !DILocation(line: 54, column: 9, scope: !199)
!208 = !DILocation(line: 55, column: 5, scope: !186)
!209 = !DILocation(line: 49, column: 61, scope: !210)
!210 = !DILexicalBlockFile(scope: !179, file: !54, discriminator: 2)
!211 = !DILocation(line: 49, column: 5, scope: !210)
!212 = distinct !{!212, !213}
!213 = !DILocation(line: 49, column: 5, scope: !149)
!214 = !DILocation(line: 56, column: 5, scope: !149)
!215 = !DILocation(line: 57, column: 1, scope: !149)
!216 = distinct !DISubprogram(name: "sk_X509_POLICY_NODE_num", scope: !60, file: !60, line: 719, type: !217, isLocal: true, isDefinition: true, scopeLine: 719, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!217 = !DISubroutineType(types: !218)
!218 = !{!17, !137}
!219 = !DILocalVariable(name: "sk", arg: 1, scope: !216, file: !60, line: 719, type: !137)
!220 = !DILocation(line: 719, column: 409, scope: !216)
!221 = !DILocation(line: 719, column: 460, scope: !216)
!222 = !DILocation(line: 719, column: 437, scope: !216)
!223 = !DILocation(line: 719, column: 422, scope: !216)
!224 = !DILocation(line: 719, column: 415, scope: !216)
!225 = distinct !DISubprogram(name: "level_add_node", scope: !54, file: !54, line: 59, type: !226, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!226 = !DISubroutineType(types: !227)
!227 = !{!23, !228, !229, !23, !230}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_POLICY_TREE", file: !6, line: 159, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_POLICY_TREE_st", file: !26, line: 113, size: 384, align: 64, elements: !233)
!233 = !{!234, !235, !236, !237, !238, !239}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !232, file: !26, line: 115, baseType: !228, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "nlevel", scope: !232, file: !26, line: 116, baseType: !17, size: 32, align: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "extra_data", scope: !232, file: !26, line: 121, baseType: !48, size: 64, align: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "auth_policies", scope: !232, file: !26, line: 123, baseType: !9, size: 64, align: 64, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "user_policies", scope: !232, file: !26, line: 124, baseType: !9, size: 64, align: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !232, file: !26, line: 125, baseType: !35, size: 32, align: 32, offset: 320)
!240 = !DILocalVariable(name: "level", arg: 1, scope: !225, file: !54, line: 59, type: !228)
!241 = !DILocation(line: 59, column: 53, scope: !225)
!242 = !DILocalVariable(name: "data", arg: 2, scope: !225, file: !54, line: 60, type: !229)
!243 = !DILocation(line: 60, column: 52, scope: !225)
!244 = !DILocalVariable(name: "parent", arg: 3, scope: !225, file: !54, line: 61, type: !23)
!245 = !DILocation(line: 61, column: 52, scope: !225)
!246 = !DILocalVariable(name: "tree", arg: 4, scope: !225, file: !54, line: 62, type: !230)
!247 = !DILocation(line: 62, column: 52, scope: !225)
!248 = !DILocalVariable(name: "node", scope: !225, file: !54, line: 64, type: !23)
!249 = !DILocation(line: 64, column: 23, scope: !225)
!250 = !DILocation(line: 66, column: 12, scope: !225)
!251 = !DILocation(line: 66, column: 10, scope: !225)
!252 = !DILocation(line: 67, column: 9, scope: !253)
!253 = distinct !DILexicalBlock(scope: !225, file: !54, line: 67, column: 9)
!254 = !DILocation(line: 67, column: 14, scope: !253)
!255 = !DILocation(line: 67, column: 9, scope: !225)
!256 = !DILocation(line: 68, column: 9, scope: !257)
!257 = distinct !DILexicalBlock(scope: !253, file: !54, line: 67, column: 22)
!258 = !DILocation(line: 69, column: 9, scope: !257)
!259 = !DILocation(line: 71, column: 18, scope: !225)
!260 = !DILocation(line: 71, column: 5, scope: !225)
!261 = !DILocation(line: 71, column: 11, scope: !225)
!262 = !DILocation(line: 71, column: 16, scope: !225)
!263 = !DILocation(line: 72, column: 20, scope: !225)
!264 = !DILocation(line: 72, column: 5, scope: !225)
!265 = !DILocation(line: 72, column: 11, scope: !225)
!266 = !DILocation(line: 72, column: 18, scope: !225)
!267 = !DILocation(line: 73, column: 9, scope: !268)
!268 = distinct !DILexicalBlock(scope: !225, file: !54, line: 73, column: 9)
!269 = !DILocation(line: 73, column: 9, scope: !225)
!270 = !DILocation(line: 74, column: 25, scope: !271)
!271 = distinct !DILexicalBlock(scope: !272, file: !54, line: 74, column: 13)
!272 = distinct !DILexicalBlock(scope: !268, file: !54, line: 73, column: 16)
!273 = !DILocation(line: 74, column: 31, scope: !271)
!274 = !DILocation(line: 74, column: 13, scope: !271)
!275 = !DILocation(line: 74, column: 45, scope: !271)
!276 = !DILocation(line: 74, column: 13, scope: !272)
!277 = !DILocation(line: 75, column: 17, scope: !278)
!278 = distinct !DILexicalBlock(scope: !279, file: !54, line: 75, column: 17)
!279 = distinct !DILexicalBlock(scope: !271, file: !54, line: 74, column: 53)
!280 = !DILocation(line: 75, column: 24, scope: !278)
!281 = !DILocation(line: 75, column: 17, scope: !279)
!282 = !DILocation(line: 76, column: 17, scope: !278)
!283 = !DILocation(line: 77, column: 32, scope: !279)
!284 = !DILocation(line: 77, column: 13, scope: !279)
!285 = !DILocation(line: 77, column: 20, scope: !279)
!286 = !DILocation(line: 77, column: 30, scope: !279)
!287 = !DILocation(line: 78, column: 9, scope: !279)
!288 = !DILocation(line: 80, column: 17, scope: !289)
!289 = distinct !DILexicalBlock(scope: !290, file: !54, line: 80, column: 17)
!290 = distinct !DILexicalBlock(scope: !271, file: !54, line: 78, column: 16)
!291 = !DILocation(line: 80, column: 24, scope: !289)
!292 = !DILocation(line: 80, column: 30, scope: !289)
!293 = !DILocation(line: 80, column: 17, scope: !290)
!294 = !DILocation(line: 81, column: 32, scope: !289)
!295 = !DILocation(line: 81, column: 17, scope: !289)
!296 = !DILocation(line: 81, column: 24, scope: !289)
!297 = !DILocation(line: 81, column: 30, scope: !289)
!298 = !DILocation(line: 82, column: 17, scope: !299)
!299 = distinct !DILexicalBlock(scope: !290, file: !54, line: 82, column: 17)
!300 = !DILocation(line: 82, column: 24, scope: !299)
!301 = !DILocation(line: 82, column: 30, scope: !299)
!302 = !DILocation(line: 82, column: 17, scope: !290)
!303 = !DILocation(line: 83, column: 17, scope: !304)
