; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--x509v3--libcrypto-shlib-v3_genn.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--x509v3--libcrypto-shlib-v3_genn.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.otherName_st = type { %struct.asn1_object_st*, %struct.asn1_type_st* }
%struct.asn1_object_st = type opaque
%struct.asn1_type_st = type { i32, %union.anon }
%union.anon = type { i8* }
%struct.ASN1_VALUE_st = type opaque
%struct.EDIPartyName_st = type { %struct.asn1_string_st*, %struct.asn1_string_st* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.GENERAL_NAME_st = type { i32, %union.anon.0 }
%union.anon.0 = type { i8* }
%struct.stack_st_GENERAL_NAME = type opaque
%struct.X509_name_st = type opaque

@OTHERNAME_seq_tt = internal constant [2 x %struct.ASN1_TEMPLATE_st] [%struct.ASN1_TEMPLATE_st { i64 0, i64 0, i64 0, i8* getelementptr inbounds ([8 x i8], [8 x i8]* @.str.4, i32 0, i32 0), %struct.ASN1_ITEM_st* @ASN1_OBJECT_it }, %struct.ASN1_TEMPLATE_st { i64 144, i64 0, i64 8, i8* getelementptr inbounds ([6 x i8], [6 x i8]* @.str.5, i32 0, i32 0), %struct.ASN1_ITEM_st* @ASN1_ANY_it }], align 16

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !141)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3/[inter]crypto--x509v3--libcrypto-shlib-v3_genn.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!2 = !{}
!3 = !{!4, !91, !88, !92, !98, !124, !127, !133, !26, !131}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "OTHERNAME", file: !6, line: 116, baseType: !7)
!6 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "otherName_st", file: !6, line: 113, size: 128, align: 64, elements: !8)
!8 = !{!9, !14}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "type_id", scope: !7, file: !6, line: 114, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !12, line: 60, baseType: !13)
!12 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !12, line: 60, flags: DIFlagFwdDecl)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !7, file: !6, line: 115, baseType: !15, size: 64, align: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !17, line: 473, baseType: !18)
!17 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !17, line: 444, size: 128, align: 64, elements: !19)
!19 = !{!20, !22}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !18, file: !17, line: 445, baseType: !21, size: 32, align: 32)
!21 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !18, file: !17, line: 472, baseType: !23, size: 64, align: 64, offset: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !18, file: !17, line: 446, size: 64, align: 64, elements: !24)
!24 = !{!25, !28, !30, !42, !43, !46, !49, !52, !55, !58, !61, !64, !67, !70, !73, !76, !79, !82, !85, !86, !87}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !23, file: !17, line: 447, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !23, file: !17, line: 448, baseType: !29, size: 32, align: 32)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !12, line: 56, baseType: !21)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !23, file: !17, line: 449, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !12, line: 55, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !17, line: 146, size: 192, align: 64, elements: !34)
!34 = !{!35, !36, !37, !40}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !33, file: !17, line: 147, baseType: !21, size: 32, align: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !33, file: !17, line: 148, baseType: !21, size: 32, align: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !33, file: !17, line: 149, baseType: !38, size: 64, align: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !33, file: !17, line: 155, baseType: !41, size: 64, align: 64, offset: 128)
!41 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !23, file: !17, line: 450, baseType: !10, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !23, file: !17, line: 451, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !12, line: 40, baseType: !33)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !23, file: !17, line: 452, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !12, line: 41, baseType: !33)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !23, file: !17, line: 453, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !12, line: 42, baseType: !33)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !23, file: !17, line: 454, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !12, line: 43, baseType: !33)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !23, file: !17, line: 455, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !12, line: 44, baseType: !33)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !23, file: !17, line: 456, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !12, line: 45, baseType: !33)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !23, file: !17, line: 457, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !12, line: 46, baseType: !33)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !23, file: !17, line: 458, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !12, line: 47, baseType: !33)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !23, file: !17, line: 459, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !12, line: 49, baseType: !33)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !23, file: !17, line: 460, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !12, line: 48, baseType: !33)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !23, file: !17, line: 461, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !12, line: 50, baseType: !33)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !23, file: !17, line: 462, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !12, line: 52, baseType: !33)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !23, file: !17, line: 463, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !12, line: 53, baseType: !33)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !23, file: !17, line: 464, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !12, line: 54, baseType: !33)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !23, file: !17, line: 469, baseType: !31, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !23, file: !17, line: 470, baseType: !31, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !23, file: !17, line: 471, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !17, line: 213, baseType: !90)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !17, line: 213, flags: DIFlagFwdDecl)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDIPARTYNAME", file: !6, line: 121, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EDIPartyName_st", file: !6, line: 118, size: 128, align: 64, elements: !95)
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "nameAssigner", scope: !94, file: !6, line: 119, baseType: !31, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "partyName", scope: !94, file: !6, line: 120, baseType: !31, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "GENERAL_NAME", file: !6, line: 153, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GENERAL_NAME_st", file: !6, line: 123, size: 128, align: 64, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !100, file: !6, line: 133, baseType: !21, size: 32, align: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !100, file: !6, line: 152, baseType: !104, size: 64, align: 64, offset: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !100, file: !6, line: 134, size: 64, align: 64, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !115, !116, !117, !118, !119, !120, !121, !122, !123}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !104, file: !6, line: 135, baseType: !26, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "otherName", scope: !104, file: !6, line: 136, baseType: !4, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "rfc822Name", scope: !104, file: !6, line: 137, baseType: !62, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "dNSName", scope: !104, file: !6, line: 138, baseType: !62, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "x400Address", scope: !104, file: !6, line: 139, baseType: !15, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "directoryName", scope: !104, file: !6, line: 140, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !12, line: 129, baseType: !114)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !12, line: 129, flags: DIFlagFwdDecl)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ediPartyName", scope: !104, file: !6, line: 141, baseType: !92, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "uniformResourceIdentifier", scope: !104, file: !6, line: 142, baseType: !62, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "iPAddress", scope: !104, file: !6, line: 143, baseType: !53, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "registeredID", scope: !104, file: !6, line: 144, baseType: !10, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !104, file: !6, line: 146, baseType: !53, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "dirn", scope: !104, file: !6, line: 147, baseType: !112, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ia5", scope: !104, file: !6, line: 148, baseType: !62, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "rid", scope: !104, file: !6, line: 150, baseType: !10, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !104, file: !6, line: 151, baseType: !15, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "GENERAL_NAMES", file: !6, line: 167, baseType: !126)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_GENERAL_NAME", file: !6, line: 166, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2d_of_void", file: !17, line: 277, baseType: !129)
!129 = !DISubroutineType(types: !130)
!130 = !{!21, !131, !132}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "d2i_of_void", file: !17, line: 277, baseType: !135)
!135 = !DISubroutineType(types: !136)
!136 = !{!131, !137, !138, !41}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!141 = !{!142, !173, !174, !175, !176, !180, !181, !185}
!142 = distinct !DIGlobalVariable(name: "OTHERNAME_it", scope: !0, file: !143, line: 20, type: !144, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @OTHERNAME_it)
!143 = !DIFile(filename: "crypto/x509v3/v3_genn.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !12, line: 62, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !147, line: 580, size: 448, align: 64, elements: !148)
!147 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.so.3")
!148 = !{!149, !150, !151, !167, !168, !171, !172}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !146, file: !147, line: 581, baseType: !27, size: 8, align: 8)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !146, file: !147, line: 583, baseType: !41, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !146, file: !147, line: 584, baseType: !152, size: 64, align: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !17, line: 210, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !147, line: 468, size: 320, align: 64, elements: !156)
!156 = !{!157, !159, !160, !161, !164}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !155, file: !147, line: 469, baseType: !158, size: 64, align: 64)
!158 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !155, file: !147, line: 470, baseType: !41, size: 64, align: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !155, file: !147, line: 471, baseType: !158, size: 64, align: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !155, file: !147, line: 472, baseType: !162, size: 64, align: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !155, file: !147, line: 473, baseType: !165, size: 64, align: 64, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !17, line: 318, baseType: !144)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !146, file: !147, line: 586, baseType: !41, size: 64, align: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !146, file: !147, line: 587, baseType: !169, size: 64, align: 64, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !146, file: !147, line: 588, baseType: !41, size: 64, align: 64, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !146, file: !147, line: 589, baseType: !162, size: 64, align: 64, offset: 384)
!173 = distinct !DIGlobalVariable(name: "EDIPARTYNAME_it", scope: !0, file: !143, line: 27, type: !144, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @EDIPARTYNAME_it)
!174 = distinct !DIGlobalVariable(name: "GENERAL_NAME_it", scope: !0, file: !143, line: 43, type: !144, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @GENERAL_NAME_it)
!175 = distinct !DIGlobalVariable(name: "GENERAL_NAMES_it", scope: !0, file: !143, line: 49, type: !144, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @GENERAL_NAMES_it)
!176 = distinct !DIGlobalVariable(name: "OTHERNAME_seq_tt", scope: !0, file: !143, line: 16, type: !177, isLocal: true, isDefinition: true, variable: [2 x %struct.ASN1_TEMPLATE_st]* @OTHERNAME_seq_tt)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 640, align: 64, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 2)
!180 = distinct !DIGlobalVariable(name: "EDIPARTYNAME_seq_tt", scope: !0, file: !143, line: 24, type: !177, isLocal: true, isDefinition: true, variable: [2 x %struct.ASN1_TEMPLATE_st]* @EDIPARTYNAME_seq_tt)
!181 = distinct !DIGlobalVariable(name: "GENERAL_NAME_ch_tt", scope: !0, file: !143, line: 31, type: !182, isLocal: true, isDefinition: true, variable: [9 x %struct.ASN1_TEMPLATE_st]* @GENERAL_NAME_ch_tt)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 2880, align: 64, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 9)
!185 = distinct !DIGlobalVariable(name: "GENERAL_NAMES_item_tt", scope: !0, file: !143, line: 47, type: !153, isLocal: true, isDefinition: true, variable: %struct.ASN1_TEMPLATE_st* @GENERAL_NAMES_item_tt)
!186 = !{i32 2, !"Dwarf Version", i32 4}
!187 = !{i32 2, !"Debug Info Version", i32 3}
!188 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!189 = distinct !DISubprogram(name: "d2i_OTHERNAME", scope: !143, file: !143, line: 22, type: !190, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!190 = !DISubroutineType(types: !191)
!191 = !{!4, !192, !138, !41}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!193 = !DILocalVariable(name: "a", arg: 1, scope: !189, file: !143, line: 22, type: !192)
!194 = !DIExpression()
!195 = !DILocation(line: 22, column: 38, scope: !189)
!196 = !DILocalVariable(name: "in", arg: 2, scope: !189, file: !143, line: 22, type: !138)
!197 = !DILocation(line: 22, column: 63, scope: !189)
!198 = !DILocalVariable(name: "len", arg: 3, scope: !189, file: !143, line: 22, type: !41)
!199 = !DILocation(line: 22, column: 72, scope: !189)
!200 = !DILocation(line: 22, column: 128, scope: !189)
!201 = !DILocation(line: 22, column: 113, scope: !189)
!202 = !DILocation(line: 22, column: 131, scope: !189)
!203 = !DILocation(line: 22, column: 135, scope: !189)
!204 = !DILocation(line: 22, column: 99, scope: !189)
!205 = !DILocation(line: 22, column: 86, scope: !189)
!206 = !DILocation(line: 22, column: 79, scope: !189)
!207 = distinct !DISubprogram(name: "i2d_OTHERNAME", scope: !143, file: !143, line: 22, type: !208, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!208 = !DISubroutineType(types: !209)
!209 = !{!21, !4, !132}
!210 = !DILocalVariable(name: "a", arg: 1, scope: !207, file: !143, line: 22, type: !4)
!211 = !DILocation(line: 22, column: 191, scope: !207)
!212 = !DILocalVariable(name: "out", arg: 2, scope: !207, file: !143, line: 22, type: !132)
!213 = !DILocation(line: 22, column: 210, scope: !207)
!214 = !DILocation(line: 22, column: 252, scope: !207)
!215 = !DILocation(line: 22, column: 238, scope: !207)
!216 = !DILocation(line: 22, column: 255, scope: !207)
!217 = !DILocation(line: 22, column: 224, scope: !207)
