; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--audio_frame_queue.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--audio_frame_queue.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!852 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!853 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!854 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!855 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!856 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!857 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !35, line: 1534, size: 32, align: 32, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865}
!860 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!861 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!862 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!863 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!864 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!865 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !35, line: 810, size: 32, align: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !{!888, !891}
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !889, line: 40, baseType: !890)
!889 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!890 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!892 = !{i32 2, !"Dwarf Version", i32 4}
!893 = !{i32 2, !"Debug Info Version", i32 3}
!894 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!895 = distinct !DISubprogram(name: "ff_af_queue_init", scope: !896, file: !896, line: 28, type: !897, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1644)
!896 = !DIFile(filename: "libavcodec/audio_frame_queue.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!897 = !DISubroutineType(types: !898)
!898 = !{null, !899, !1627}
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64, align: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !902)
!902 = !{!903, !948, !949, !950, !1225, !1226, !1227, !1228, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1381, !1385, !1386, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1565, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !901, file: !35, line: 1561, baseType: !904, size: 64, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64, align: 64)
!905 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !908)
!908 = !{!909, !913, !917, !921, !923, !924, !925, !929, !935, !937, !941}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !907, file: !4, line: 72, baseType: !910, size: 64, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!912 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !907, file: !4, line: 78, baseType: !914, size: 64, align: 64, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!910, !891}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !907, file: !4, line: 85, baseType: !918, size: 64, align: 64, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !907, file: !4, line: 93, baseType: !922, size: 32, align: 32, offset: 192)
!922 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !907, file: !4, line: 99, baseType: !922, size: 32, align: 32, offset: 224)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !907, file: !4, line: 108, baseType: !922, size: 32, align: 32, offset: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !907, file: !4, line: 113, baseType: !926, size: 64, align: 64, offset: 320)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!891, !891, !891}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !907, file: !4, line: 123, baseType: !930, size: 64, align: 64, offset: 384)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!933, !933}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !907)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !907, file: !4, line: 130, baseType: !936, size: 32, align: 32, offset: 448)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !907, file: !4, line: 136, baseType: !938, size: 64, align: 64, offset: 512)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!936, !891}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !907, file: !4, line: 142, baseType: !942, size: 64, align: 64, offset: 576)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!922, !945, !891, !910, !922}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !901, file: !35, line: 1562, baseType: !922, size: 32, align: 32, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !901, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !901, file: !35, line: 1565, baseType: !951, size: 64, align: 64, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !954)
!954 = !{!955, !956, !957, !958, !959, !960, !969, !972, !975, !978, !983, !986, !987, !995, !996, !997, !999, !1003, !1009, !1020, !1024, !1025, !1075, !1196, !1200, !1201, !1205, !1209, !1214, !1218, !1219, !1220}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !953, file: !35, line: 3475, baseType: !910, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !953, file: !35, line: 3480, baseType: !910, size: 64, align: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !953, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !953, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !953, file: !35, line: 3487, baseType: !922, size: 32, align: 32, offset: 192)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !953, file: !35, line: 3488, baseType: !961, size: 64, align: 64, offset: 256)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !964, line: 61, baseType: !965)
!964 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !964, line: 58, size: 64, align: 32, elements: !966)
!966 = !{!967, !968}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !965, file: !964, line: 59, baseType: !922, size: 32, align: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !965, file: !964, line: 60, baseType: !922, size: 32, align: 32, offset: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !953, file: !35, line: 3489, baseType: !970, size: 64, align: 64, offset: 320)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !953, file: !35, line: 3490, baseType: !973, size: 64, align: 64, offset: 384)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !922)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !953, file: !35, line: 3491, baseType: !976, size: 64, align: 64, offset: 448)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !953, file: !35, line: 3492, baseType: !979, size: 64, align: 64, offset: 512)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !889, line: 55, baseType: !982)
!982 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !953, file: !35, line: 3493, baseType: !984, size: 8, align: 8, offset: 576)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !889, line: 48, baseType: !985)
!985 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !953, file: !35, line: 3494, baseType: !904, size: 64, align: 64, offset: 640)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !953, file: !35, line: 3495, baseType: !988, size: 64, align: 64, offset: 704)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !992)
!992 = !{!993, !994}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !991, file: !35, line: 3402, baseType: !922, size: 32, align: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !991, file: !35, line: 3403, baseType: !910, size: 64, align: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !953, file: !35, line: 3507, baseType: !910, size: 64, align: 64, offset: 768)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !953, file: !35, line: 3516, baseType: !922, size: 32, align: 32, offset: 832)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !953, file: !35, line: 3517, baseType: !998, size: 64, align: 64, offset: 896)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !953, file: !35, line: 3527, baseType: !1000, size: 64, align: 64, offset: 960)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!922, !899}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !953, file: !35, line: 3535, baseType: !1004, size: 64, align: 64, offset: 1024)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!922, !899, !1007}
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !900)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !953, file: !35, line: 3541, baseType: !1010, size: 64, align: 64, offset: 1088)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1014, line: 223, size: 128, align: 64, elements: !1015)
!1014 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1015 = !{!1016, !1019}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1013, file: !1014, line: 224, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1013, file: !1014, line: 225, baseType: !1017, size: 64, align: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !953, file: !35, line: 3549, baseType: !1021, size: 64, align: 64, offset: 1152)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{null, !998}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !953, file: !35, line: 3551, baseType: !1000, size: 64, align: 64, offset: 1216)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !953, file: !35, line: 3552, baseType: !1026, size: 64, align: 64, offset: 1280)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!922, !899, !1029, !922, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1033)
!1033 = !{!1034, !1037, !1040, !1041, !1042, !1074}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1032, file: !35, line: 3921, baseType: !1035, size: 16, align: 16)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !889, line: 49, baseType: !1036)
!1036 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1032, file: !35, line: 3922, baseType: !1038, size: 32, align: 32, offset: 32)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !889, line: 51, baseType: !1039)
!1039 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1032, file: !35, line: 3923, baseType: !1038, size: 32, align: 32, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1032, file: !35, line: 3924, baseType: !1039, size: 32, align: 32, offset: 96)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1032, file: !35, line: 3925, baseType: !1043, size: 64, align: 64, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1047)
!1047 = !{!1048, !1049, !1050, !1051, !1052, !1053, !1063, !1067, !1069, !1070, !1072, !1073}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1046, file: !35, line: 3886, baseType: !922, size: 32, align: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1046, file: !35, line: 3887, baseType: !922, size: 32, align: 32, offset: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1046, file: !35, line: 3888, baseType: !922, size: 32, align: 32, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1046, file: !35, line: 3889, baseType: !922, size: 32, align: 32, offset: 96)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1046, file: !35, line: 3890, baseType: !922, size: 32, align: 32, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1046, file: !35, line: 3897, baseType: !1054, size: 768, align: 64, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1055)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1056)
!1056 = !{!1057, !1061}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1055, file: !35, line: 3855, baseType: !1058, size: 512, align: 64)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1029, size: 512, align: 64, elements: !1059)
!1059 = !{!1060}
!1060 = !DISubrange(count: 8)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1055, file: !35, line: 3857, baseType: !1062, size: 256, align: 32, offset: 512)
!1062 = !DICompositeType(tag: DW_TAG_array_type, baseType: !922, size: 256, align: 32, elements: !1059)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1046, file: !35, line: 3903, baseType: !1064, size: 256, align: 64, offset: 960)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1029, size: 256, align: 64, elements: !1065)
!1065 = !{!1066}
!1066 = !DISubrange(count: 4)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1046, file: !35, line: 3904, baseType: !1068, size: 128, align: 32, offset: 1216)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !922, size: 128, align: 32, elements: !1065)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1046, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1046, file: !35, line: 3908, baseType: !1071, size: 64, align: 64, offset: 1408)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1046, file: !35, line: 3915, baseType: !1071, size: 64, align: 64, offset: 1472)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1046, file: !35, line: 3917, baseType: !922, size: 32, align: 32, offset: 1536)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1032, file: !35, line: 3926, baseType: !888, size: 64, align: 64, offset: 192)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !953, file: !35, line: 3564, baseType: !1076, size: 64, align: 64, offset: 1344)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!922, !899, !1079, !1113, !1195}
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1082)
!1082 = !{!1083, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1109, !1110, !1111, !1112}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1081, file: !35, line: 1451, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1086, line: 94, baseType: !1087)
!1086 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1086, line: 81, size: 192, align: 64, elements: !1088)
!1088 = !{!1089, !1093, !1094}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1087, file: !1086, line: 82, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1086, line: 73, baseType: !1092)
!1092 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1086, line: 73, flags: DIFlagFwdDecl)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1087, file: !1086, line: 89, baseType: !1029, size: 64, align: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1087, file: !1086, line: 93, baseType: !922, size: 32, align: 32, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1081, file: !35, line: 1461, baseType: !888, size: 64, align: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1081, file: !35, line: 1467, baseType: !888, size: 64, align: 64, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1081, file: !35, line: 1468, baseType: !1029, size: 64, align: 64, offset: 192)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1081, file: !35, line: 1469, baseType: !922, size: 32, align: 32, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1081, file: !35, line: 1470, baseType: !922, size: 32, align: 32, offset: 288)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1081, file: !35, line: 1474, baseType: !922, size: 32, align: 32, offset: 320)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1081, file: !35, line: 1479, baseType: !1102, size: 64, align: 64, offset: 384)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1104)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1105)
!1105 = !{!1106, !1107, !1108}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1104, file: !35, line: 1412, baseType: !1029, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1104, file: !35, line: 1413, baseType: !922, size: 32, align: 32, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1104, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1081, file: !35, line: 1480, baseType: !922, size: 32, align: 32, offset: 448)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1081, file: !35, line: 1486, baseType: !888, size: 64, align: 64, offset: 512)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1081, file: !35, line: 1488, baseType: !888, size: 64, align: 64, offset: 576)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1081, file: !35, line: 1497, baseType: !888, size: 64, align: 64, offset: 640)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1115)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1117)
!1117 = !{!1118, !1119, !1120, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1147, !1149, !1150, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1183, !1184, !1185, !1186, !1187, !1188, !1191, !1192, !1193, !1194}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1116, file: !758, line: 282, baseType: !1058, size: 512, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1116, file: !758, line: 299, baseType: !1062, size: 256, align: 32, offset: 512)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1116, file: !758, line: 315, baseType: !1121, size: 64, align: 64, offset: 768)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1116, file: !758, line: 326, baseType: !922, size: 32, align: 32, offset: 832)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1116, file: !758, line: 326, baseType: !922, size: 32, align: 32, offset: 864)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1116, file: !758, line: 334, baseType: !922, size: 32, align: 32, offset: 896)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1116, file: !758, line: 341, baseType: !922, size: 32, align: 32, offset: 928)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1116, file: !758, line: 346, baseType: !922, size: 32, align: 32, offset: 960)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1116, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1116, file: !758, line: 356, baseType: !963, size: 64, align: 32, offset: 1024)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1116, file: !758, line: 361, baseType: !888, size: 64, align: 64, offset: 1088)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1116, file: !758, line: 369, baseType: !888, size: 64, align: 64, offset: 1152)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1116, file: !758, line: 377, baseType: !888, size: 64, align: 64, offset: 1216)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1116, file: !758, line: 382, baseType: !922, size: 32, align: 32, offset: 1280)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1116, file: !758, line: 386, baseType: !922, size: 32, align: 32, offset: 1312)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1116, file: !758, line: 391, baseType: !922, size: 32, align: 32, offset: 1344)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1116, file: !758, line: 396, baseType: !891, size: 64, align: 64, offset: 1408)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1116, file: !758, line: 403, baseType: !1137, size: 512, align: 64, offset: 1472)
!1137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 512, align: 64, elements: !1059)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1116, file: !758, line: 410, baseType: !922, size: 32, align: 32, offset: 1984)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1116, file: !758, line: 415, baseType: !922, size: 32, align: 32, offset: 2016)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1116, file: !758, line: 420, baseType: !922, size: 32, align: 32, offset: 2048)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1116, file: !758, line: 425, baseType: !922, size: 32, align: 32, offset: 2080)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1116, file: !758, line: 435, baseType: !888, size: 64, align: 64, offset: 2112)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1116, file: !758, line: 440, baseType: !922, size: 32, align: 32, offset: 2176)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1116, file: !758, line: 445, baseType: !981, size: 64, align: 64, offset: 2240)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1116, file: !758, line: 459, baseType: !1146, size: 512, align: 64, offset: 2304)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 512, align: 64, elements: !1059)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1116, file: !758, line: 473, baseType: !1148, size: 64, align: 64, offset: 2816)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1116, file: !758, line: 477, baseType: !922, size: 32, align: 32, offset: 2880)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1116, file: !758, line: 479, baseType: !1151, size: 64, align: 64, offset: 2944)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1155)
!1155 = !{!1156, !1157, !1158, !1159, !1164}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1154, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1154, file: !758, line: 203, baseType: !1029, size: 64, align: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1154, file: !758, line: 204, baseType: !922, size: 32, align: 32, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1154, file: !758, line: 205, baseType: !1160, size: 64, align: 64, offset: 192)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1162, line: 86, baseType: !1163)
!1162 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1163 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1162, line: 86, flags: DIFlagFwdDecl)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1154, file: !758, line: 206, baseType: !1084, size: 64, align: 64, offset: 256)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1116, file: !758, line: 480, baseType: !922, size: 32, align: 32, offset: 3008)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1116, file: !758, line: 505, baseType: !922, size: 32, align: 32, offset: 3040)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1116, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1116, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1116, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1116, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1116, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1116, file: !758, line: 532, baseType: !888, size: 64, align: 64, offset: 3264)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1116, file: !758, line: 539, baseType: !888, size: 64, align: 64, offset: 3328)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1116, file: !758, line: 547, baseType: !888, size: 64, align: 64, offset: 3392)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1116, file: !758, line: 554, baseType: !1160, size: 64, align: 64, offset: 3456)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1116, file: !758, line: 563, baseType: !922, size: 32, align: 32, offset: 3520)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1116, file: !758, line: 572, baseType: !922, size: 32, align: 32, offset: 3552)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1116, file: !758, line: 581, baseType: !922, size: 32, align: 32, offset: 3584)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1116, file: !758, line: 588, baseType: !1180, size: 64, align: 64, offset: 3648)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !889, line: 36, baseType: !1182)
!1182 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1116, file: !758, line: 593, baseType: !922, size: 32, align: 32, offset: 3712)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1116, file: !758, line: 596, baseType: !922, size: 32, align: 32, offset: 3744)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1116, file: !758, line: 599, baseType: !1084, size: 64, align: 64, offset: 3776)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1116, file: !758, line: 605, baseType: !1084, size: 64, align: 64, offset: 3840)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1116, file: !758, line: 616, baseType: !1084, size: 64, align: 64, offset: 3904)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1116, file: !758, line: 626, baseType: !1189, size: 64, align: 64, offset: 3968)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1190, line: 216, baseType: !982)
!1190 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1116, file: !758, line: 627, baseType: !1189, size: 64, align: 64, offset: 4032)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1116, file: !758, line: 628, baseType: !1189, size: 64, align: 64, offset: 4096)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1116, file: !758, line: 629, baseType: !1189, size: 64, align: 64, offset: 4160)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1116, file: !758, line: 645, baseType: !1084, size: 64, align: 64, offset: 4224)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !953, file: !35, line: 3566, baseType: !1197, size: 64, align: 64, offset: 1408)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!922, !899, !891, !1195, !1079}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !953, file: !35, line: 3567, baseType: !1000, size: 64, align: 64, offset: 1472)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !953, file: !35, line: 3576, baseType: !1202, size: 64, align: 64, offset: 1536)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!922, !899, !1113}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !953, file: !35, line: 3577, baseType: !1206, size: 64, align: 64, offset: 1600)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!922, !899, !1079}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !953, file: !35, line: 3584, baseType: !1210, size: 64, align: 64, offset: 1664)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!922, !899, !1213}
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !953, file: !35, line: 3589, baseType: !1215, size: 64, align: 64, offset: 1728)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{null, !899}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !953, file: !35, line: 3594, baseType: !922, size: 32, align: 32, offset: 1792)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !953, file: !35, line: 3600, baseType: !910, size: 64, align: 64, offset: 1856)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !953, file: !35, line: 3609, baseType: !1221, size: 64, align: 64, offset: 1920)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1224)
!1224 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !901, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !901, file: !35, line: 1581, baseType: !1039, size: 32, align: 32, offset: 224)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !901, file: !35, line: 1583, baseType: !891, size: 64, align: 64, offset: 256)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !901, file: !35, line: 1591, baseType: !1229, size: 64, align: 64, offset: 320)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1014, line: 129, size: 1664, align: 64, elements: !1231)
!1231 = !{!1232, !1233, !1234, !1235, !1236, !1254, !1255, !1261, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1230, file: !1014, line: 136, baseType: !922, size: 32, align: 32)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1230, file: !1014, line: 151, baseType: !922, size: 32, align: 32, offset: 32)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1230, file: !1014, line: 157, baseType: !922, size: 32, align: 32, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1230, file: !1014, line: 159, baseType: !1213, size: 64, align: 64, offset: 128)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1230, file: !1014, line: 161, baseType: !1237, size: 64, align: 64, offset: 192)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1014, line: 117, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1014, line: 100, size: 832, align: 64, elements: !1240)
!1240 = !{!1241, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1239, file: !1014, line: 105, baseType: !1242, size: 256, align: 64)
!1242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1243, size: 256, align: 64, elements: !1065)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1086, line: 238, baseType: !1245)
!1245 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1086, line: 238, flags: DIFlagFwdDecl)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1239, file: !1014, line: 110, baseType: !922, size: 32, align: 32, offset: 256)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1239, file: !1014, line: 111, baseType: !922, size: 32, align: 32, offset: 288)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1239, file: !1014, line: 111, baseType: !922, size: 32, align: 32, offset: 320)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1239, file: !1014, line: 112, baseType: !1062, size: 256, align: 32, offset: 352)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1239, file: !1014, line: 113, baseType: !1068, size: 128, align: 32, offset: 608)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1239, file: !1014, line: 114, baseType: !922, size: 32, align: 32, offset: 736)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1239, file: !1014, line: 115, baseType: !922, size: 32, align: 32, offset: 768)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1239, file: !1014, line: 116, baseType: !922, size: 32, align: 32, offset: 800)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1230, file: !1014, line: 163, baseType: !891, size: 64, align: 64, offset: 256)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1230, file: !1014, line: 165, baseType: !1256, size: 128, align: 64, offset: 320)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1014, line: 122, baseType: !1257)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1014, line: 119, size: 128, align: 64, elements: !1258)
!1258 = !{!1259, !1260}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1257, file: !1014, line: 120, baseType: !1079, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1257, file: !1014, line: 121, baseType: !1213, size: 64, align: 64, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1230, file: !1014, line: 166, baseType: !1262, size: 128, align: 64, offset: 448)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1014, line: 127, baseType: !1263)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1014, line: 124, size: 128, align: 64, elements: !1264)
!1264 = !{!1265, !1338}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1263, file: !1014, line: 125, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1269)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1270)
!1270 = !{!1271, !1272, !1296, !1300, !1301, !1335, !1336, !1337}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1269, file: !35, line: 5751, baseType: !904, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1269, file: !35, line: 5756, baseType: !1273, size: 64, align: 64, offset: 64)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1275)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1276)
!1276 = !{!1277, !1278, !1281, !1282, !1283, !1287, !1291, !1295}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1275, file: !35, line: 5797, baseType: !910, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1275, file: !35, line: 5804, baseType: !1279, size: 64, align: 64, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1275, file: !35, line: 5815, baseType: !904, size: 64, align: 64, offset: 128)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1275, file: !35, line: 5825, baseType: !922, size: 32, align: 32, offset: 192)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1275, file: !35, line: 5826, baseType: !1284, size: 64, align: 64, offset: 256)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!922, !1267}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1275, file: !35, line: 5827, baseType: !1288, size: 64, align: 64, offset: 320)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{!922, !1267, !1079}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1275, file: !35, line: 5828, baseType: !1292, size: 64, align: 64, offset: 384)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{null, !1267}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1275, file: !35, line: 5829, baseType: !1292, size: 64, align: 64, offset: 448)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1269, file: !35, line: 5762, baseType: !1297, size: 64, align: 64, offset: 128)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1299)
!1299 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1269, file: !35, line: 5768, baseType: !891, size: 64, align: 64, offset: 192)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1269, file: !35, line: 5775, baseType: !1302, size: 64, align: 64, offset: 256)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1304)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1305)
!1305 = !{!1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1304, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1304, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1304, file: !35, line: 3948, baseType: !1038, size: 32, align: 32, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1304, file: !35, line: 3958, baseType: !1029, size: 64, align: 64, offset: 128)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1304, file: !35, line: 3962, baseType: !922, size: 32, align: 32, offset: 192)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1304, file: !35, line: 3968, baseType: !922, size: 32, align: 32, offset: 224)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1304, file: !35, line: 3973, baseType: !888, size: 64, align: 64, offset: 256)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1304, file: !35, line: 3986, baseType: !922, size: 32, align: 32, offset: 320)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1304, file: !35, line: 3999, baseType: !922, size: 32, align: 32, offset: 352)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1304, file: !35, line: 4004, baseType: !922, size: 32, align: 32, offset: 384)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1304, file: !35, line: 4005, baseType: !922, size: 32, align: 32, offset: 416)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1304, file: !35, line: 4010, baseType: !922, size: 32, align: 32, offset: 448)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1304, file: !35, line: 4011, baseType: !922, size: 32, align: 32, offset: 480)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1304, file: !35, line: 4020, baseType: !963, size: 64, align: 32, offset: 512)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1304, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1304, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1304, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1304, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1304, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1304, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1304, file: !35, line: 4039, baseType: !922, size: 32, align: 32, offset: 768)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1304, file: !35, line: 4046, baseType: !981, size: 64, align: 64, offset: 832)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1304, file: !35, line: 4050, baseType: !922, size: 32, align: 32, offset: 896)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1304, file: !35, line: 4054, baseType: !922, size: 32, align: 32, offset: 928)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1304, file: !35, line: 4061, baseType: !922, size: 32, align: 32, offset: 960)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1304, file: !35, line: 4065, baseType: !922, size: 32, align: 32, offset: 992)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1304, file: !35, line: 4073, baseType: !922, size: 32, align: 32, offset: 1024)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1304, file: !35, line: 4080, baseType: !922, size: 32, align: 32, offset: 1056)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1304, file: !35, line: 4084, baseType: !922, size: 32, align: 32, offset: 1088)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1269, file: !35, line: 5781, baseType: !1302, size: 64, align: 64, offset: 320)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1269, file: !35, line: 5787, baseType: !963, size: 64, align: 32, offset: 384)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1269, file: !35, line: 5793, baseType: !963, size: 64, align: 32, offset: 448)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1263, file: !1014, line: 126, baseType: !922, size: 32, align: 32, offset: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1230, file: !1014, line: 172, baseType: !1079, size: 64, align: 64, offset: 576)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1230, file: !1014, line: 177, baseType: !1029, size: 64, align: 64, offset: 640)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1230, file: !1014, line: 178, baseType: !1039, size: 32, align: 32, offset: 704)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1230, file: !1014, line: 180, baseType: !891, size: 64, align: 64, offset: 768)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1230, file: !1014, line: 185, baseType: !922, size: 32, align: 32, offset: 832)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1230, file: !1014, line: 190, baseType: !891, size: 64, align: 64, offset: 896)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1230, file: !1014, line: 195, baseType: !922, size: 32, align: 32, offset: 960)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1230, file: !1014, line: 200, baseType: !1079, size: 64, align: 64, offset: 1024)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1230, file: !1014, line: 201, baseType: !922, size: 32, align: 32, offset: 1088)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1230, file: !1014, line: 202, baseType: !1213, size: 64, align: 64, offset: 1152)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1230, file: !1014, line: 203, baseType: !922, size: 32, align: 32, offset: 1216)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1230, file: !1014, line: 205, baseType: !922, size: 32, align: 32, offset: 1248)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1230, file: !1014, line: 206, baseType: !922, size: 32, align: 32, offset: 1280)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1230, file: !1014, line: 209, baseType: !1189, size: 64, align: 64, offset: 1344)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1230, file: !1014, line: 212, baseType: !1189, size: 64, align: 64, offset: 1408)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1230, file: !1014, line: 213, baseType: !1213, size: 64, align: 64, offset: 1472)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1230, file: !1014, line: 215, baseType: !922, size: 32, align: 32, offset: 1536)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1230, file: !1014, line: 217, baseType: !922, size: 32, align: 32, offset: 1568)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1230, file: !1014, line: 220, baseType: !922, size: 32, align: 32, offset: 1600)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !901, file: !35, line: 1598, baseType: !891, size: 64, align: 64, offset: 384)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !901, file: !35, line: 1606, baseType: !888, size: 64, align: 64, offset: 448)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !901, file: !35, line: 1614, baseType: !922, size: 32, align: 32, offset: 512)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !901, file: !35, line: 1622, baseType: !922, size: 32, align: 32, offset: 544)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !901, file: !35, line: 1628, baseType: !922, size: 32, align: 32, offset: 576)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !901, file: !35, line: 1636, baseType: !922, size: 32, align: 32, offset: 608)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !901, file: !35, line: 1643, baseType: !922, size: 32, align: 32, offset: 640)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !901, file: !35, line: 1657, baseType: !1029, size: 64, align: 64, offset: 704)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !901, file: !35, line: 1658, baseType: !922, size: 32, align: 32, offset: 768)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !901, file: !35, line: 1679, baseType: !963, size: 64, align: 32, offset: 800)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !901, file: !35, line: 1688, baseType: !922, size: 32, align: 32, offset: 864)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !901, file: !35, line: 1712, baseType: !922, size: 32, align: 32, offset: 896)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !901, file: !35, line: 1729, baseType: !922, size: 32, align: 32, offset: 928)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !901, file: !35, line: 1729, baseType: !922, size: 32, align: 32, offset: 960)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !901, file: !35, line: 1744, baseType: !922, size: 32, align: 32, offset: 992)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !901, file: !35, line: 1744, baseType: !922, size: 32, align: 32, offset: 1024)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !901, file: !35, line: 1751, baseType: !922, size: 32, align: 32, offset: 1056)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !901, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !901, file: !35, line: 1791, baseType: !1377, size: 64, align: 64, offset: 1152)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DISubroutineType(types: !1379)
!1379 = !{null, !1380, !1113, !1195, !922, !922, !922}
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !901, file: !35, line: 1808, baseType: !1382, size: 64, align: 64, offset: 1216)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DISubroutineType(types: !1384)
!1384 = !{!494, !1380, !970}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !901, file: !35, line: 1816, baseType: !922, size: 32, align: 32, offset: 1280)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !901, file: !35, line: 1825, baseType: !1387, size: 32, align: 32, offset: 1312)
!1387 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !901, file: !35, line: 1830, baseType: !922, size: 32, align: 32, offset: 1344)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !901, file: !35, line: 1838, baseType: !1387, size: 32, align: 32, offset: 1376)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !901, file: !35, line: 1846, baseType: !922, size: 32, align: 32, offset: 1408)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !901, file: !35, line: 1851, baseType: !922, size: 32, align: 32, offset: 1440)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !901, file: !35, line: 1861, baseType: !1387, size: 32, align: 32, offset: 1472)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !901, file: !35, line: 1868, baseType: !1387, size: 32, align: 32, offset: 1504)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !901, file: !35, line: 1875, baseType: !1387, size: 32, align: 32, offset: 1536)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !901, file: !35, line: 1882, baseType: !1387, size: 32, align: 32, offset: 1568)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !901, file: !35, line: 1889, baseType: !1387, size: 32, align: 32, offset: 1600)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !901, file: !35, line: 1896, baseType: !1387, size: 32, align: 32, offset: 1632)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !901, file: !35, line: 1903, baseType: !1387, size: 32, align: 32, offset: 1664)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !901, file: !35, line: 1910, baseType: !922, size: 32, align: 32, offset: 1696)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !901, file: !35, line: 1915, baseType: !922, size: 32, align: 32, offset: 1728)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !901, file: !35, line: 1926, baseType: !1195, size: 64, align: 64, offset: 1792)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !901, file: !35, line: 1935, baseType: !963, size: 64, align: 32, offset: 1856)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !901, file: !35, line: 1942, baseType: !922, size: 32, align: 32, offset: 1920)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !901, file: !35, line: 1948, baseType: !922, size: 32, align: 32, offset: 1952)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !901, file: !35, line: 1954, baseType: !922, size: 32, align: 32, offset: 1984)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !901, file: !35, line: 1960, baseType: !922, size: 32, align: 32, offset: 2016)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !901, file: !35, line: 1984, baseType: !922, size: 32, align: 32, offset: 2048)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !901, file: !35, line: 1991, baseType: !922, size: 32, align: 32, offset: 2080)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !901, file: !35, line: 1996, baseType: !922, size: 32, align: 32, offset: 2112)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !901, file: !35, line: 2004, baseType: !922, size: 32, align: 32, offset: 2144)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !901, file: !35, line: 2011, baseType: !922, size: 32, align: 32, offset: 2176)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !901, file: !35, line: 2018, baseType: !922, size: 32, align: 32, offset: 2208)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !901, file: !35, line: 2027, baseType: !922, size: 32, align: 32, offset: 2240)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !901, file: !35, line: 2034, baseType: !922, size: 32, align: 32, offset: 2272)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !901, file: !35, line: 2044, baseType: !922, size: 32, align: 32, offset: 2304)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !901, file: !35, line: 2054, baseType: !1417, size: 64, align: 64, offset: 2368)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !901, file: !35, line: 2061, baseType: !1417, size: 64, align: 64, offset: 2432)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !901, file: !35, line: 2066, baseType: !922, size: 32, align: 32, offset: 2496)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !901, file: !35, line: 2070, baseType: !922, size: 32, align: 32, offset: 2528)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !901, file: !35, line: 2078, baseType: !922, size: 32, align: 32, offset: 2560)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !901, file: !35, line: 2085, baseType: !922, size: 32, align: 32, offset: 2592)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !901, file: !35, line: 2092, baseType: !922, size: 32, align: 32, offset: 2624)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !901, file: !35, line: 2099, baseType: !922, size: 32, align: 32, offset: 2656)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !901, file: !35, line: 2106, baseType: !922, size: 32, align: 32, offset: 2688)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !901, file: !35, line: 2113, baseType: !922, size: 32, align: 32, offset: 2720)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !901, file: !35, line: 2120, baseType: !922, size: 32, align: 32, offset: 2752)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !901, file: !35, line: 2125, baseType: !922, size: 32, align: 32, offset: 2784)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !901, file: !35, line: 2133, baseType: !922, size: 32, align: 32, offset: 2816)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !901, file: !35, line: 2140, baseType: !922, size: 32, align: 32, offset: 2848)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !901, file: !35, line: 2145, baseType: !922, size: 32, align: 32, offset: 2880)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !901, file: !35, line: 2153, baseType: !922, size: 32, align: 32, offset: 2912)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !901, file: !35, line: 2158, baseType: !922, size: 32, align: 32, offset: 2944)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !901, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !901, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !901, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !901, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !901, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !901, file: !35, line: 2203, baseType: !922, size: 32, align: 32, offset: 3136)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !901, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !901, file: !35, line: 2212, baseType: !922, size: 32, align: 32, offset: 3200)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !901, file: !35, line: 2213, baseType: !922, size: 32, align: 32, offset: 3232)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !901, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !901, file: !35, line: 2232, baseType: !922, size: 32, align: 32, offset: 3296)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !901, file: !35, line: 2243, baseType: !922, size: 32, align: 32, offset: 3328)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !901, file: !35, line: 2249, baseType: !922, size: 32, align: 32, offset: 3360)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !901, file: !35, line: 2256, baseType: !922, size: 32, align: 32, offset: 3392)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !901, file: !35, line: 2263, baseType: !981, size: 64, align: 64, offset: 3456)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !901, file: !35, line: 2270, baseType: !981, size: 64, align: 64, offset: 3520)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !901, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !901, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !901, file: !35, line: 2367, baseType: !1453, size: 64, align: 64, offset: 3648)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DISubroutineType(types: !1455)
!1455 = !{!922, !1380, !1213, !922}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !901, file: !35, line: 2383, baseType: !922, size: 32, align: 32, offset: 3712)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !901, file: !35, line: 2386, baseType: !1387, size: 32, align: 32, offset: 3744)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !901, file: !35, line: 2387, baseType: !1387, size: 32, align: 32, offset: 3776)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !901, file: !35, line: 2394, baseType: !922, size: 32, align: 32, offset: 3808)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !901, file: !35, line: 2401, baseType: !922, size: 32, align: 32, offset: 3840)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !901, file: !35, line: 2408, baseType: !922, size: 32, align: 32, offset: 3872)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !901, file: !35, line: 2415, baseType: !922, size: 32, align: 32, offset: 3904)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !901, file: !35, line: 2422, baseType: !922, size: 32, align: 32, offset: 3936)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !901, file: !35, line: 2423, baseType: !1465, size: 64, align: 64, offset: 3968)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1467)
!1467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1468)
!1468 = !{!1469, !1470, !1471, !1472}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1467, file: !35, line: 827, baseType: !922, size: 32, align: 32)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1467, file: !35, line: 828, baseType: !922, size: 32, align: 32, offset: 32)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1467, file: !35, line: 829, baseType: !922, size: 32, align: 32, offset: 64)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1467, file: !35, line: 830, baseType: !1387, size: 32, align: 32, offset: 96)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !901, file: !35, line: 2430, baseType: !888, size: 64, align: 64, offset: 4032)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !901, file: !35, line: 2437, baseType: !888, size: 64, align: 64, offset: 4096)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !901, file: !35, line: 2444, baseType: !1387, size: 32, align: 32, offset: 4160)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !901, file: !35, line: 2451, baseType: !1387, size: 32, align: 32, offset: 4192)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !901, file: !35, line: 2458, baseType: !922, size: 32, align: 32, offset: 4224)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !901, file: !35, line: 2469, baseType: !922, size: 32, align: 32, offset: 4256)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !901, file: !35, line: 2475, baseType: !922, size: 32, align: 32, offset: 4288)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !901, file: !35, line: 2481, baseType: !922, size: 32, align: 32, offset: 4320)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !901, file: !35, line: 2485, baseType: !922, size: 32, align: 32, offset: 4352)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !901, file: !35, line: 2489, baseType: !922, size: 32, align: 32, offset: 4384)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !901, file: !35, line: 2493, baseType: !922, size: 32, align: 32, offset: 4416)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !901, file: !35, line: 2501, baseType: !922, size: 32, align: 32, offset: 4448)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !901, file: !35, line: 2506, baseType: !922, size: 32, align: 32, offset: 4480)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !901, file: !35, line: 2510, baseType: !922, size: 32, align: 32, offset: 4512)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !901, file: !35, line: 2514, baseType: !888, size: 64, align: 64, offset: 4544)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !901, file: !35, line: 2528, baseType: !1489, size: 64, align: 64, offset: 4608)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{null, !1380, !891, !922, !922}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !901, file: !35, line: 2534, baseType: !922, size: 32, align: 32, offset: 4672)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !901, file: !35, line: 2545, baseType: !922, size: 32, align: 32, offset: 4704)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !901, file: !35, line: 2547, baseType: !922, size: 32, align: 32, offset: 4736)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !901, file: !35, line: 2549, baseType: !922, size: 32, align: 32, offset: 4768)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !901, file: !35, line: 2551, baseType: !922, size: 32, align: 32, offset: 4800)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !901, file: !35, line: 2553, baseType: !922, size: 32, align: 32, offset: 4832)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !901, file: !35, line: 2555, baseType: !922, size: 32, align: 32, offset: 4864)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !901, file: !35, line: 2557, baseType: !922, size: 32, align: 32, offset: 4896)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !901, file: !35, line: 2559, baseType: !922, size: 32, align: 32, offset: 4928)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !901, file: !35, line: 2563, baseType: !922, size: 32, align: 32, offset: 4960)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !901, file: !35, line: 2571, baseType: !1071, size: 64, align: 64, offset: 4992)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !901, file: !35, line: 2579, baseType: !1071, size: 64, align: 64, offset: 5056)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !901, file: !35, line: 2586, baseType: !922, size: 32, align: 32, offset: 5120)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !901, file: !35, line: 2615, baseType: !922, size: 32, align: 32, offset: 5152)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !901, file: !35, line: 2627, baseType: !922, size: 32, align: 32, offset: 5184)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !901, file: !35, line: 2637, baseType: !922, size: 32, align: 32, offset: 5216)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !901, file: !35, line: 2681, baseType: !922, size: 32, align: 32, offset: 5248)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !901, file: !35, line: 2709, baseType: !888, size: 64, align: 64, offset: 5312)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !901, file: !35, line: 2716, baseType: !1511, size: 64, align: 64, offset: 5376)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1513)
!1513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1514)
!1514 = !{!1515, !1516, !1517, !1518, !1519, !1520, !1521, !1525, !1529, !1530, !1531, !1532, !1538, !1539, !1540, !1541, !1542}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1513, file: !35, line: 3642, baseType: !910, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1513, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1513, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1513, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1513, file: !35, line: 3669, baseType: !922, size: 32, align: 32, offset: 160)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1513, file: !35, line: 3682, baseType: !1210, size: 64, align: 64, offset: 192)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1513, file: !35, line: 3698, baseType: !1522, size: 64, align: 64, offset: 256)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!1523 = !DISubroutineType(types: !1524)
!1524 = !{!922, !899, !1017, !1038}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1513, file: !35, line: 3712, baseType: !1526, size: 64, align: 64, offset: 320)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64, align: 64)
!1527 = !DISubroutineType(types: !1528)
!1528 = !{!922, !899, !922, !1017, !1038}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1513, file: !35, line: 3726, baseType: !1522, size: 64, align: 64, offset: 384)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1513, file: !35, line: 3737, baseType: !1000, size: 64, align: 64, offset: 448)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1513, file: !35, line: 3746, baseType: !922, size: 32, align: 32, offset: 512)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1513, file: !35, line: 3757, baseType: !1533, size: 64, align: 64, offset: 576)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64, align: 64)
!1534 = !DISubroutineType(types: !1535)
!1535 = !{null, !1536}
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1513, file: !35, line: 3766, baseType: !1000, size: 64, align: 64, offset: 640)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1513, file: !35, line: 3774, baseType: !1000, size: 64, align: 64, offset: 704)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1513, file: !35, line: 3780, baseType: !922, size: 32, align: 32, offset: 768)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1513, file: !35, line: 3785, baseType: !922, size: 32, align: 32, offset: 800)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1513, file: !35, line: 3795, baseType: !1543, size: 64, align: 64, offset: 832)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DISubroutineType(types: !1545)
!1545 = !{!922, !899, !1084}
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !901, file: !35, line: 2728, baseType: !891, size: 64, align: 64, offset: 5440)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !901, file: !35, line: 2735, baseType: !1137, size: 512, align: 64, offset: 5504)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !901, file: !35, line: 2742, baseType: !922, size: 32, align: 32, offset: 6016)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !901, file: !35, line: 2755, baseType: !922, size: 32, align: 32, offset: 6048)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !901, file: !35, line: 2776, baseType: !922, size: 32, align: 32, offset: 6080)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !901, file: !35, line: 2783, baseType: !922, size: 32, align: 32, offset: 6112)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !901, file: !35, line: 2791, baseType: !922, size: 32, align: 32, offset: 6144)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !901, file: !35, line: 2802, baseType: !1213, size: 64, align: 64, offset: 6208)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !901, file: !35, line: 2811, baseType: !922, size: 32, align: 32, offset: 6272)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !901, file: !35, line: 2821, baseType: !922, size: 32, align: 32, offset: 6304)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !901, file: !35, line: 2830, baseType: !922, size: 32, align: 32, offset: 6336)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !901, file: !35, line: 2840, baseType: !922, size: 32, align: 32, offset: 6368)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !901, file: !35, line: 2851, baseType: !1559, size: 64, align: 64, offset: 6400)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64, align: 64)
!1560 = !DISubroutineType(types: !1561)
!1561 = !{!922, !1380, !1562, !891, !1195, !922, !922}
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DISubroutineType(types: !1564)
!1564 = !{!922, !1380, !891}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !901, file: !35, line: 2871, baseType: !1566, size: 64, align: 64, offset: 6464)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64, align: 64)
!1567 = !DISubroutineType(types: !1568)
!1568 = !{!922, !1380, !1569, !891, !1195, !922}
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64, align: 64)
!1570 = !DISubroutineType(types: !1571)
!1571 = !{!922, !1380, !891, !922, !922}
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !901, file: !35, line: 2878, baseType: !922, size: 32, align: 32, offset: 6528)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !901, file: !35, line: 2885, baseType: !922, size: 32, align: 32, offset: 6560)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !901, file: !35, line: 3005, baseType: !922, size: 32, align: 32, offset: 6592)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !901, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !901, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !901, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !901, file: !35, line: 3037, baseType: !1029, size: 64, align: 64, offset: 6720)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !901, file: !35, line: 3038, baseType: !922, size: 32, align: 32, offset: 6784)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !901, file: !35, line: 3050, baseType: !981, size: 64, align: 64, offset: 6848)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !901, file: !35, line: 3065, baseType: !922, size: 32, align: 32, offset: 6912)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !901, file: !35, line: 3083, baseType: !922, size: 32, align: 32, offset: 6944)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !901, file: !35, line: 3092, baseType: !963, size: 64, align: 32, offset: 6976)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !901, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !901, file: !35, line: 3106, baseType: !963, size: 64, align: 32, offset: 7072)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !901, file: !35, line: 3113, baseType: !1587, size: 64, align: 64, offset: 7168)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64, align: 64)
!1588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1589)
!1589 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1590)
!1590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1591)
!1591 = !{!1592, !1593, !1594, !1595, !1596, !1597, !1600}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1590, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1590, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1590, file: !35, line: 720, baseType: !910, size: 64, align: 64, offset: 64)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1590, file: !35, line: 724, baseType: !910, size: 64, align: 64, offset: 128)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1590, file: !35, line: 728, baseType: !922, size: 32, align: 32, offset: 192)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1590, file: !35, line: 734, baseType: !1598, size: 64, align: 64, offset: 256)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1590, file: !35, line: 739, baseType: !1601, size: 64, align: 64, offset: 320)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !901, file: !35, line: 3129, baseType: !888, size: 64, align: 64, offset: 7232)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !901, file: !35, line: 3130, baseType: !888, size: 64, align: 64, offset: 7296)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !901, file: !35, line: 3131, baseType: !888, size: 64, align: 64, offset: 7360)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !901, file: !35, line: 3132, baseType: !888, size: 64, align: 64, offset: 7424)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !901, file: !35, line: 3139, baseType: !1071, size: 64, align: 64, offset: 7488)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !901, file: !35, line: 3147, baseType: !922, size: 32, align: 32, offset: 7552)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !901, file: !35, line: 3165, baseType: !922, size: 32, align: 32, offset: 7584)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !901, file: !35, line: 3172, baseType: !922, size: 32, align: 32, offset: 7616)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !901, file: !35, line: 3180, baseType: !922, size: 32, align: 32, offset: 7648)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !901, file: !35, line: 3191, baseType: !1417, size: 64, align: 64, offset: 7680)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !901, file: !35, line: 3199, baseType: !1029, size: 64, align: 64, offset: 7744)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !901, file: !35, line: 3207, baseType: !1071, size: 64, align: 64, offset: 7808)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !901, file: !35, line: 3214, baseType: !1039, size: 32, align: 32, offset: 7872)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !901, file: !35, line: 3224, baseType: !1102, size: 64, align: 64, offset: 7936)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !901, file: !35, line: 3225, baseType: !922, size: 32, align: 32, offset: 8000)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !901, file: !35, line: 3249, baseType: !1084, size: 64, align: 64, offset: 8064)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !901, file: !35, line: 3256, baseType: !922, size: 32, align: 32, offset: 8128)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !901, file: !35, line: 3271, baseType: !922, size: 32, align: 32, offset: 8160)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !901, file: !35, line: 3279, baseType: !888, size: 64, align: 64, offset: 8192)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !901, file: !35, line: 3301, baseType: !1084, size: 64, align: 64, offset: 8256)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !901, file: !35, line: 3310, baseType: !922, size: 32, align: 32, offset: 8320)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !901, file: !35, line: 3337, baseType: !922, size: 32, align: 32, offset: 8352)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !901, file: !35, line: 3351, baseType: !922, size: 32, align: 32, offset: 8384)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !901, file: !35, line: 3359, baseType: !922, size: 32, align: 32, offset: 8416)
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64, align: 64)
!1628 = !DIDerivedType(tag: DW_TAG_typedef, name: "AudioFrameQueue", file: !1629, line: 39, baseType: !1630)
!1629 = !DIFile(filename: "libavcodec/audio_frame_queue.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AudioFrameQueue", file: !1629, line: 32, size: 256, align: 64, elements: !1631)
!1631 = !{!1632, !1633, !1634, !1635, !1642, !1643}
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1630, file: !1629, line: 33, baseType: !899, size: 64, align: 64)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_delay", scope: !1630, file: !1629, line: 34, baseType: !922, size: 32, align: 32, offset: 64)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_samples", scope: !1630, file: !1629, line: 35, baseType: !922, size: 32, align: 32, offset: 96)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1630, file: !1629, line: 36, baseType: !1636, size: 64, align: 64, offset: 128)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DIDerivedType(tag: DW_TAG_typedef, name: "AudioFrame", file: !1629, line: 30, baseType: !1638)
!1638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AudioFrame", file: !1629, line: 27, size: 128, align: 64, elements: !1639)
!1639 = !{!1640, !1641}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1638, file: !1629, line: 28, baseType: !888, size: 64, align: 64)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1638, file: !1629, line: 29, baseType: !922, size: 32, align: 32, offset: 64)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count", scope: !1630, file: !1629, line: 37, baseType: !1039, size: 32, align: 32, offset: 192)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "frame_alloc", scope: !1630, file: !1629, line: 38, baseType: !1039, size: 32, align: 32, offset: 224)
!1644 = !{}
!1645 = !DILocalVariable(name: "avctx", arg: 1, scope: !895, file: !896, line: 28, type: !899)
!1646 = !DIExpression()
!1647 = !DILocation(line: 28, column: 61, scope: !895)
!1648 = !DILocalVariable(name: "afq", arg: 2, scope: !895, file: !896, line: 28, type: !1627)
!1649 = !DILocation(line: 28, column: 85, scope: !895)
!1650 = !DILocation(line: 30, column: 18, scope: !895)
!1651 = !DILocation(line: 30, column: 5, scope: !895)
!1652 = !DILocation(line: 30, column: 10, scope: !895)
!1653 = !DILocation(line: 30, column: 16, scope: !895)
!1654 = !DILocation(line: 31, column: 28, scope: !895)
!1655 = !DILocation(line: 31, column: 35, scope: !895)
!1656 = !DILocation(line: 31, column: 5, scope: !895)
!1657 = !DILocation(line: 31, column: 10, scope: !895)
!1658 = !DILocation(line: 31, column: 26, scope: !895)
!1659 = !DILocation(line: 32, column: 30, scope: !895)
!1660 = !DILocation(line: 32, column: 37, scope: !895)
!1661 = !DILocation(line: 32, column: 5, scope: !895)
!1662 = !DILocation(line: 32, column: 10, scope: !895)
!1663 = !DILocation(line: 32, column: 28, scope: !895)
!1664 = !DILocation(line: 33, column: 5, scope: !895)
!1665 = !DILocation(line: 33, column: 10, scope: !895)
!1666 = !DILocation(line: 33, column: 22, scope: !895)
!1667 = !DILocation(line: 34, column: 1, scope: !895)
!1668 = distinct !DISubprogram(name: "ff_af_queue_close", scope: !896, file: !896, line: 36, type: !1669, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1644)
!1669 = !DISubroutineType(types: !1670)
!1670 = !{null, !1627}
!1671 = !DILocalVariable(name: "afq", arg: 1, scope: !1668, file: !896, line: 36, type: !1627)
!1672 = !DILocation(line: 36, column: 41, scope: !1668)
!1673 = !DILocation(line: 38, column: 8, scope: !1674)
!1674 = distinct !DILexicalBlock(scope: !1668, file: !896, line: 38, column: 8)
!1675 = !DILocation(line: 38, column: 13, scope: !1674)
!1676 = !DILocation(line: 38, column: 8, scope: !1668)
!1677 = !DILocation(line: 39, column: 16, scope: !1674)
!1678 = !DILocation(line: 39, column: 21, scope: !1674)
!1679 = !DILocation(line: 39, column: 76, scope: !1674)
!1680 = !DILocation(line: 39, column: 81, scope: !1674)
!1681 = !DILocation(line: 39, column: 9, scope: !1674)
