; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mdct_float.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mdct_float.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.FFTContext = type { i32, i32, i16*, %struct.FFTComplex*, i32, i32, float*, float*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, float*, float*)*, void (%struct.FFTContext*, float*, float*)*, void (%struct.FFTContext*, float*, float*)*, void (%struct.FFTContext*, float*, float*)*, i32, i32, i32* }
%struct.FFTComplex = type { float, float }

; Function Attrs: cold nounwind optsize uwtable
define i32 @ff_mdct_init(%struct.FFTContext* %s, i32 %nbits, i32 %inverse, double %scale) #0 !dbg !26 {
entry:
  %retval = alloca i32, align 4
  %s.addr = alloca %struct.FFTContext*, align 8
  %nbits.addr = alloca i32, align 4
  %inverse.addr = alloca i32, align 4
  %scale.addr = alloca double, align 8
  %n = alloca i32, align 4
  %n4 = alloca i32, align 4
  %i = alloca i32, align 4
  %alpha = alloca double, align 8
  %theta = alloca double, align 8
  %tstep = alloca i32, align 4
  store %struct.FFTContext* %s, %struct.FFTContext** %s.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !13)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mdct_float.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fft_permutation_type", file: !4, line: 77, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavcodec/fft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "FF_FFT_PERM_DEFAULT", value: 0)
!7 = !DIEnumerator(name: "FF_FFT_PERM_SWAP_LSBS", value: 1)
!8 = !DIEnumerator(name: "FF_FFT_PERM_AVX", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mdct_permutation_type", file: !4, line: 83, size: 32, align: 32, elements: !10)
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "FF_MDCT_PERM_NONE", value: 0)
!12 = !DIEnumerator(name: "FF_MDCT_PERM_INTERLEAVE", value: 1)
!13 = !{!14}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !16, line: 39, baseType: !17)
!16 = !DIFile(filename: "libavcodec/avfft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !16, line: 37, size: 64, align: 32, elements: !18)
!18 = !{!19, !22}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !17, file: !16, line: 38, baseType: !20, size: 32, align: 32)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !16, line: 35, baseType: !21)
!21 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !17, file: !16, line: 38, baseType: !20, size: 32, align: 32, offset: 32)
!23 = !{i32 2, !"Dwarf Version", i32 4}
!24 = !{i32 2, !"Debug Info Version", i32 3}
!25 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!26 = distinct !DISubprogram(name: "ff_mdct_init", scope: !27, file: !27, line: 48, type: !28, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !75)
!27 = !DIFile(filename: "libavcodec/mdct_template.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!28 = !DISubroutineType(types: !29)
!29 = !{!30, !31, !30, !30, !74}
!30 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !16, line: 41, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !4, line: 88, size: 896, align: 64, elements: !34)
!34 = !{!35, !36, !37, !42, !43, !44, !45, !47, !48, !53, !54, !60, !61, !62, !68, !69, !70}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !33, file: !4, line: 89, baseType: !30, size: 32, align: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !33, file: !4, line: 90, baseType: !30, size: 32, align: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "revtab", scope: !33, file: !4, line: 91, baseType: !38, size: 64, align: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !40, line: 49, baseType: !41)
!40 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!41 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !33, file: !4, line: 92, baseType: !14, size: 64, align: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_size", scope: !33, file: !4, line: 93, baseType: !30, size: 32, align: 32, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_bits", scope: !33, file: !4, line: 94, baseType: !30, size: 32, align: 32, offset: 224)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !33, file: !4, line: 96, baseType: !46, size: 64, align: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !33, file: !4, line: 97, baseType: !46, size: 64, align: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permute", scope: !33, file: !4, line: 101, baseType: !49, size: 64, align: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !52, !14}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "fft_calc", scope: !33, file: !4, line: 106, baseType: !49, size: 64, align: 64, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_calc", scope: !33, file: !4, line: 107, baseType: !55, size: 64, align: 64, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !52, !46, !58}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !33, file: !4, line: 108, baseType: !55, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calc", scope: !33, file: !4, line: 109, baseType: !55, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calcw", scope: !33, file: !4, line: 110, baseType: !63, size: 64, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !52, !66, !58}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTDouble", file: !4, line: 43, baseType: !21)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permutation", scope: !33, file: !4, line: 111, baseType: !3, size: 32, align: 32, offset: 768)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_permutation", scope: !33, file: !4, line: 112, baseType: !9, size: 32, align: 32, offset: 800)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "revtab32", scope: !33, file: !4, line: 113, baseType: !71, size: 64, align: 64, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !40, line: 51, baseType: !73)
!73 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!74 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!75 = !{}
!76 = !DILocalVariable(name: "s", arg: 1, scope: !26, file: !27, line: 48, type: !31)
!77 = !DIExpression()
!78 = !DILocation(line: 48, column: 52, scope: !26)
!79 = !DILocalVariable(name: "nbits", arg: 2, scope: !26, file: !27, line: 48, type: !30)
!80 = !DILocation(line: 48, column: 59, scope: !26)
!81 = !DILocalVariable(name: "inverse", arg: 3, scope: !26, file: !27, line: 48, type: !30)
!82 = !DILocation(line: 48, column: 70, scope: !26)
!83 = !DILocalVariable(name: "scale", arg: 4, scope: !26, file: !27, line: 48, type: !74)
!84 = !DILocation(line: 48, column: 86, scope: !26)
!85 = !DILocalVariable(name: "n", scope: !26, file: !27, line: 50, type: !30)
!86 = !DILocation(line: 50, column: 9, scope: !26)
!87 = !DILocalVariable(name: "n4", scope: !26, file: !27, line: 50, type: !30)
!88 = !DILocation(line: 50, column: 12, scope: !26)
!89 = !DILocalVariable(name: "i", scope: !26, file: !27, line: 50, type: !30)
!90 = !DILocation(line: 50, column: 16, scope: !26)
!91 = !DILocalVariable(name: "alpha", scope: !26, file: !27, line: 51, type: !74)
!92 = !DILocation(line: 51, column: 12, scope: !26)
!93 = !DILocalVariable(name: "theta", scope: !26, file: !27, line: 51, type: !74)
!94 = !DILocation(line: 51, column: 19, scope: !26)
!95 = !DILocalVariable(name: "tstep", scope: !26, file: !27, line: 52, type: !30)
!96 = !DILocation(line: 52, column: 9, scope: !26)
!97 = !DILocation(line: 54, column: 12, scope: !26)
!98 = !DILocation(line: 54, column: 5, scope: !26)
!99 = !DILocation(line: 55, column: 14, scope: !26)
!100 = !DILocation(line: 55, column: 11, scope: !26)
!101 = !DILocation(line: 55, column: 7, scope: !26)
!102 = !DILocation(line: 56, column: 20, scope: !26)
!103 = !DILocation(line: 56, column: 5, scope: !26)
!104 = !DILocation(line: 56, column: 8, scope: !26)
!105 = !DILocation(line: 56, column: 18, scope: !26)
!106 = !DILocation(line: 57, column: 20, scope: !26)
!107 = !DILocation(line: 57, column: 5, scope: !26)
!108 = !DILocation(line: 57, column: 8, scope: !26)
!109 = !DILocation(line: 57, column: 18, scope: !26)
!110 = !DILocation(line: 58, column: 10, scope: !26)
!111 = !DILocation(line: 58, column: 12, scope: !26)
!112 = !DILocation(line: 58, column: 8, scope: !26)
!113 = !DILocation(line: 59, column: 5, scope: !26)
!114 = !DILocation(line: 59, column: 8, scope: !26)
!115 = !DILocation(line: 59, column: 25, scope: !26)
!116 = !DILocation(line: 61, column: 21, scope: !117)
!117 = distinct !DILexicalBlock(scope: !26, file: !27, line: 61, column: 9)
!118 = !DILocation(line: 61, column: 24, scope: !117)
!119 = !DILocation(line: 61, column: 27, scope: !117)
!120 = !DILocation(line: 61, column: 37, scope: !117)
!121 = !DILocation(line: 61, column: 42, scope: !117)
!122 = !DILocation(line: 61, column: 9, scope: !117)
!123 = !DILocation(line: 61, column: 51, scope: !117)
!124 = !DILocation(line: 61, column: 9, scope: !26)
!125 = !DILocation(line: 62, column: 9, scope: !117)
!126 = !DILocation(line: 64, column: 31, scope: !26)
!127 = !DILocation(line: 64, column: 32, scope: !26)
!128 = !DILocation(line: 64, column: 15, scope: !26)
!129 = !DILocation(line: 64, column: 5, scope: !26)
!130 = !DILocation(line: 64, column: 8, scope: !26)
!131 = !DILocation(line: 64, column: 13, scope: !26)
!132 = !DILocation(line: 65, column: 10, scope: !133)
!133 = distinct !DILexicalBlock(scope: !26, file: !27, line: 65, column: 9)
!134 = !DILocation(line: 65, column: 13, scope: !133)
!135 = !DILocation(line: 65, column: 9, scope: !26)
