; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--aacenc_is.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--aacenc_is.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AACEncContext = type { %struct.AVClass*, %struct.AACEncOptions, %struct.PutBitContext, %struct.FFTContext, %struct.FFTContext, %struct.AVFloatDSPContext*, %struct.AACPCEInfo, [16 x float*], i32, i32, [8 x i8], %struct.LPCContext, i32, i32, i8*, i8*, %struct.ChannelElement*, %struct.FFPsyContext, %struct.FFPsyPreprocessContext*, %struct.AACCoefficientsEncoder*, i32, i32, float, i32, float, i32, i32, %struct.AudioFrameQueue, [96 x i32], [1024 x float], i16, [256 x [128 x %struct.AACQuantizeBandCostCacheEntry]], void (float*, float*, i32)*, void (i32*, float*, float*, i32, i32, i32, float, float)*, %struct.anon.0 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AACEncOptions = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.PutBitContext = type { i32, i32, i8*, i8*, i8*, i32 }

!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !85, line: 810, size: 32, align: 32, elements: !917)
!917 = !{!918, !919, !920, !921, !922, !923, !924, !925, !926, !927}
!918 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!919 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!920 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!921 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!922 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!923 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!924 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!925 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!926 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!927 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!928 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !85, line: 798, size: 32, align: 32, elements: !929)
!929 = !{!930, !931, !932, !933, !934, !935, !936}
!930 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!931 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!932 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!933 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!934 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!935 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!936 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!937 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OCStatus", file: !44, line: 115, size: 32, align: 32, elements: !938)
!938 = !{!939, !940, !941, !942, !943}
!939 = !DIEnumerator(name: "OC_NONE", value: 0)
!940 = !DIEnumerator(name: "OC_TRIAL_PCE", value: 1)
!941 = !DIEnumerator(name: "OC_TRIAL_FRAME", value: 2)
!942 = !DIEnumerator(name: "OC_GLOBAL_HDR", value: 3)
!943 = !DIEnumerator(name: "OC_LOCKED", value: 4)
!944 = !{!945, !953}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !947, line: 221, size: 32, align: 8, elements: !948)
!947 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!948 = !{!949}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !946, file: !947, line: 221, baseType: !950, size: 32, align: 32)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !951, line: 51, baseType: !952)
!951 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!952 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!954 = !{!955, !962, !2737, !2741, !2742}
!955 = distinct !DIGlobalVariable(name: "aac_maxval_cb", scope: !0, file: !956, line: 128, type: !957, isLocal: true, isDefinition: true, variable: [14 x i8]* @aac_maxval_cb)
!956 = !DIFile(filename: "libavcodec/aacenctab.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 112, align: 8, elements: !960)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!960 = !{!961}
!961 = !DISubrange(count: 14)
!962 = distinct !DIGlobalVariable(name: "quantize_and_encode_band_cost_rtz_arr", scope: !0, file: !963, line: 219, type: !964, isLocal: true, isDefinition: true, variable: [16 x float (%struct.AACEncContext*, %struct.PutBitContext*, float*, float*, float*, i32, i32, i32, float, float, i32*, float*)*]* @quantize_and_encode_band_cost_rtz_arr)
!963 = !DIFile(filename: "libavcodec/aacenc_quantization.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !965, size: 1024, align: 64, elements: !1159)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!969, !970, !2645, !1103, !1102, !1103, !992, !992, !992, !1104, !1104, !1963, !1102}
!969 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACEncContext", file: !972, line: 376, size: 4539904, align: 256, elements: !973)
!972 = !DIFile(filename: "libavcodec/aacenc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!973 = !{!974, !1018, !1030, !1043, !1091, !1092, !1138, !1162, !1164, !1165, !1166, !1215, !1216, !1217, !1220, !1221, !2544, !2624, !2627, !2681, !2682, !2683, !2684, !2685, !2686, !2687, !2688, !2705, !2709, !2711, !2712, !2725, !2729, !2733}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !971, file: !972, line: 377, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !978)
!978 = !{!979, !983, !987, !991, !993, !994, !995, !999, !1005, !1007, !1011}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !977, file: !4, line: 72, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !977, file: !4, line: 78, baseType: !984, size: 64, align: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!980, !953}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !977, file: !4, line: 85, baseType: !988, size: 64, align: 64, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !977, file: !4, line: 93, baseType: !992, size: 32, align: 32, offset: 192)
!992 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !977, file: !4, line: 99, baseType: !992, size: 32, align: 32, offset: 224)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !977, file: !4, line: 108, baseType: !992, size: 32, align: 32, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !977, file: !4, line: 113, baseType: !996, size: 64, align: 64, offset: 320)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!953, !953, !953}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !977, file: !4, line: 123, baseType: !1000, size: 64, align: 64, offset: 384)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!1003, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !977, file: !4, line: 130, baseType: !1006, size: 32, align: 32, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !977, file: !4, line: 136, baseType: !1008, size: 64, align: 64, offset: 512)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!1006, !953}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !977, file: !4, line: 142, baseType: !1012, size: 64, align: 64, offset: 576)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!992, !1015, !953, !980, !992}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !971, file: !972, line: 378, baseType: !1019, size: 256, align: 32, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACEncOptions", file: !972, line: 52, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACEncOptions", file: !972, line: 43, size: 256, align: 32, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !1020, file: !972, line: 44, baseType: !992, size: 32, align: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "pns", scope: !1020, file: !972, line: 45, baseType: !992, size: 32, align: 32, offset: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "tns", scope: !1020, file: !972, line: 46, baseType: !992, size: 32, align: 32, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ltp", scope: !1020, file: !972, line: 47, baseType: !992, size: 32, align: 32, offset: 96)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "pce", scope: !1020, file: !972, line: 48, baseType: !992, size: 32, align: 32, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !1020, file: !972, line: 49, baseType: !992, size: 32, align: 32, offset: 160)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "mid_side", scope: !1020, file: !972, line: 50, baseType: !992, size: 32, align: 32, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "intensity_stereo", scope: !1020, file: !972, line: 51, baseType: !992, size: 32, align: 32, offset: 224)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !971, file: !972, line: 379, baseType: !1031, size: 320, align: 64, offset: 320)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "PutBitContext", file: !1032, line: 40, baseType: !1033)
!1032 = !DIFile(filename: "libavcodec/put_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PutBitContext", file: !1032, line: 35, size: 320, align: 64, elements: !1034)
!1034 = !{!1035, !1036, !1037, !1040, !1041, !1042}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "bit_buf", scope: !1033, file: !1032, line: 36, baseType: !950, size: 32, align: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "bit_left", scope: !1033, file: !1032, line: 37, baseType: !992, size: 32, align: 32, offset: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1033, file: !1032, line: 38, baseType: !1038, size: 64, align: 64, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !951, line: 48, baseType: !959)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1033, file: !1032, line: 38, baseType: !1038, size: 64, align: 64, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1033, file: !1032, line: 38, baseType: !1038, size: 64, align: 64, offset: 192)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1033, file: !1032, line: 39, baseType: !992, size: 32, align: 32, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "mdct1024", scope: !971, file: !972, line: 380, baseType: !1044, size: 896, align: 64, offset: 640)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !1045, line: 41, baseType: !1046)
!1045 = !DIFile(filename: "libavcodec/avfft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !25, line: 88, size: 896, align: 64, elements: !1047)
!1047 = !{!1048, !1049, !1050, !1054, !1062, !1063, !1064, !1066, !1067, !1072, !1073, !1079, !1080, !1081, !1087, !1088, !1089}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !1046, file: !25, line: 89, baseType: !992, size: 32, align: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !1046, file: !25, line: 90, baseType: !992, size: 32, align: 32, offset: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "revtab", scope: !1046, file: !25, line: 91, baseType: !1051, size: 64, align: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !951, line: 49, baseType: !1053)
!1053 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !1046, file: !25, line: 92, baseType: !1055, size: 64, align: 64, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !1045, line: 39, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !1045, line: 37, size: 64, align: 32, elements: !1058)
!1058 = !{!1059, !1061}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !1057, file: !1045, line: 38, baseType: !1060, size: 32, align: 32)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !1045, line: 35, baseType: !969)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !1057, file: !1045, line: 38, baseType: !1060, size: 32, align: 32, offset: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_size", scope: !1046, file: !25, line: 93, baseType: !992, size: 32, align: 32, offset: 192)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_bits", scope: !1046, file: !25, line: 94, baseType: !992, size: 32, align: 32, offset: 224)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !1046, file: !25, line: 96, baseType: !1065, size: 64, align: 64, offset: 256)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !1046, file: !25, line: 97, baseType: !1065, size: 64, align: 64, offset: 320)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permute", scope: !1046, file: !25, line: 101, baseType: !1068, size: 64, align: 64, offset: 384)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{null, !1071, !1055}
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "fft_calc", scope: !1046, file: !25, line: 106, baseType: !1068, size: 64, align: 64, offset: 448)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_calc", scope: !1046, file: !25, line: 107, baseType: !1074, size: 64, align: 64, offset: 512)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{null, !1071, !1065, !1077}
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1060)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !1046, file: !25, line: 108, baseType: !1074, size: 64, align: 64, offset: 576)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calc", scope: !1046, file: !25, line: 109, baseType: !1074, size: 64, align: 64, offset: 640)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calcw", scope: !1046, file: !25, line: 110, baseType: !1082, size: 64, align: 64, offset: 704)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{null, !1071, !1085, !1077}
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTDouble", file: !25, line: 43, baseType: !969)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permutation", scope: !1046, file: !25, line: 111, baseType: !24, size: 32, align: 32, offset: 768)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_permutation", scope: !1046, file: !25, line: 112, baseType: !30, size: 32, align: 32, offset: 800)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "revtab32", scope: !1046, file: !25, line: 113, baseType: !1090, size: 64, align: 64, offset: 832)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "mdct128", scope: !971, file: !972, line: 381, baseType: !1044, size: 896, align: 64, offset: 1536)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "fdsp", scope: !971, file: !972, line: 382, baseType: !1093, size: 64, align: 64, offset: 2432)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFloatDSPContext", file: !1095, line: 192, baseType: !1096)
!1095 = !DIFile(filename: "./libavutil/float_dsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFloatDSPContext", file: !1095, line: 24, size: 704, align: 64, elements: !1097)
!1097 = !{!1098, !1105, !1109, !1117, !1118, !1119, !1123, !1124, !1125, !1130, !1134}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul", scope: !1096, file: !1095, line: 38, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{null, !1102, !1103, !1103, !992}
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmac_scalar", scope: !1096, file: !1095, line: 54, baseType: !1106, size: 64, align: 64, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{null, !1102, !1103, !969, !992}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmac_scalar", scope: !1096, file: !1095, line: 70, baseType: !1110, size: 64, align: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{null, !1113, !1115, !1114, !992}
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1114)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_scalar", scope: !1096, file: !1095, line: 85, baseType: !1106, size: 64, align: 64, offset: 192)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmul_scalar", scope: !1096, file: !1095, line: 100, baseType: !1110, size: 64, align: 64, offset: 256)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_window", scope: !1096, file: !1095, line: 119, baseType: !1120, size: 64, align: 64, offset: 320)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{null, !1102, !1103, !1103, !1103, !992}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_add", scope: !1096, file: !1095, line: 137, baseType: !1120, size: 64, align: 64, offset: 384)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_reverse", scope: !1096, file: !1095, line: 154, baseType: !1099, size: 64, align: 64, offset: 448)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "butterflies_float", scope: !1096, file: !1095, line: 164, baseType: !1126, size: 64, align: 64, offset: 512)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{null, !1129, !1129, !992}
!1129 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1102)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "scalarproduct_float", scope: !1096, file: !1095, line: 175, baseType: !1131, size: 64, align: 64, offset: 576)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!969, !1103, !1103, !992}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmul", scope: !1096, file: !1095, line: 190, baseType: !1135, size: 64, align: 64, offset: 640)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{null, !1113, !1115, !1115, !992}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pce", scope: !971, file: !972, line: 383, baseType: !1139, size: 2240, align: 64, offset: 2496)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACPCEInfo", file: !972, line: 100, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACPCEInfo", file: !972, line: 93, size: 2240, align: 64, elements: !1141)
!1141 = !{!1142, !1145, !1149, !1154, !1157, !1161}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !1140, file: !972, line: 94, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !951, line: 40, baseType: !1144)
!1144 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "num_ele", scope: !1140, file: !972, line: 95, baseType: !1146, size: 128, align: 32, offset: 64)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 128, align: 32, elements: !1147)
!1147 = !{!1148}
!1148 = !DISubrange(count: 4)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "pairing", scope: !1140, file: !972, line: 96, baseType: !1150, size: 768, align: 32, offset: 192)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 768, align: 32, elements: !1151)
!1151 = !{!1152, !1153}
!1152 = !DISubrange(count: 3)
!1153 = !DISubrange(count: 8)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1140, file: !972, line: 97, baseType: !1155, size: 1024, align: 32, offset: 960)
!1155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 1024, align: 32, elements: !1156)
!1156 = !{!1148, !1153}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "config_map", scope: !1140, file: !972, line: 98, baseType: !1158, size: 128, align: 8, offset: 1984)
!1158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 128, align: 8, elements: !1159)
!1159 = !{!1160}
!1160 = !DISubrange(count: 16)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "reorder_map", scope: !1140, file: !972, line: 99, baseType: !1158, size: 128, align: 8, offset: 2112)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "planar_samples", scope: !971, file: !972, line: 384, baseType: !1163, size: 1024, align: 64, offset: 4736)
!1163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1102, size: 1024, align: 64, elements: !1159)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !971, file: !972, line: 386, baseType: !992, size: 32, align: 32, offset: 5760)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "needs_pce", scope: !971, file: !972, line: 387, baseType: !992, size: 32, align: 32, offset: 5792)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "lpc", scope: !971, file: !972, line: 388, baseType: !1167, size: 302080, align: 256, offset: 5888)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "LPCContext", file: !35, line: 87, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LPCContext", file: !35, line: 52, size: 302080, align: 256, elements: !1169)
!1169 = !{!1170, !1171, !1172, !1173, !1174, !1175, !1182, !1186}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "blocksize", scope: !1168, file: !35, line: 53, baseType: !992, size: 32, align: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "max_order", scope: !1168, file: !35, line: 54, baseType: !992, size: 32, align: 32, offset: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "lpc_type", scope: !1168, file: !35, line: 55, baseType: !34, size: 32, align: 32, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "windowed_buffer", scope: !1168, file: !35, line: 56, baseType: !1113, size: 64, align: 64, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "windowed_samples", scope: !1168, file: !35, line: 57, baseType: !1113, size: 64, align: 64, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "lpc_apply_welch_window", scope: !1168, file: !35, line: 67, baseType: !1176, size: 64, align: 64, offset: 256)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{null, !1179, !992, !1113}
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1181)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !951, line: 38, baseType: !992)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "lpc_compute_autocorr", scope: !1168, file: !35, line: 82, baseType: !1183, size: 64, align: 64, offset: 320)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{null, !1115, !992, !992, !1113}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "lls_models", scope: !1168, file: !35, line: 86, baseType: !1187, size: 301568, align: 256, offset: 512)
!1187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1188, size: 301568, align: 256, elements: !1213)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLSModel", file: !1189, line: 58, baseType: !1190)
!1189 = !DIFile(filename: "./libavutil/lls.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LLSModel", file: !1189, line: 38, size: 150784, align: 256, elements: !1191)
!1191 = !{!1192, !1196, !1200, !1203, !1204, !1209}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "covariance", scope: !1190, file: !1189, line: 39, baseType: !1193, size: 82944, align: 64)
!1193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1114, size: 82944, align: 64, elements: !1194)
!1194 = !{!1195, !1195}
!1195 = !DISubrange(count: 36)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "coeff", scope: !1190, file: !1189, line: 40, baseType: !1197, size: 65536, align: 64, offset: 82944)
!1197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1114, size: 65536, align: 64, elements: !1198)
!1198 = !{!1199, !1199}
!1199 = !DISubrange(count: 32)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "variance", scope: !1190, file: !1189, line: 41, baseType: !1201, size: 2048, align: 64, offset: 148480)
!1201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1114, size: 2048, align: 64, elements: !1202)
!1202 = !{!1199}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "indep_count", scope: !1190, file: !1189, line: 42, baseType: !992, size: 32, align: 32, offset: 150528)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "update_lls", scope: !1190, file: !1189, line: 50, baseType: !1205, size: 64, align: 64, offset: 150592)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{null, !1208, !1115}
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "evaluate_lls", scope: !1190, file: !1189, line: 57, baseType: !1210, size: 64, align: 64, offset: 150656)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!1114, !1208, !1115, !992}
!1213 = !{!1214}
!1214 = !DISubrange(count: 2)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "samplerate_index", scope: !971, file: !972, line: 389, baseType: !992, size: 32, align: 32, offset: 307968)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !971, file: !972, line: 390, baseType: !992, size: 32, align: 32, offset: 308000)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "reorder_map", scope: !971, file: !972, line: 391, baseType: !1218, size: 64, align: 64, offset: 308032)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "chan_map", scope: !971, file: !972, line: 392, baseType: !1218, size: 64, align: 64, offset: 308096)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "cpe", scope: !971, file: !972, line: 394, baseType: !1222, size: 64, align: 64, offset: 308160)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelElement", file: !44, line: 288, baseType: !1224)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelElement", file: !44, line: 275, size: 4381952, align: 256, elements: !1225)
!1225 = !{!1226, !1227, !1228, !1229, !1230, !1234, !1235, !1371, !1384}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !1224, file: !44, line: 276, baseType: !992, size: 32, align: 32)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "common_window", scope: !1224, file: !44, line: 278, baseType: !992, size: 32, align: 32, offset: 32)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "ms_mode", scope: !1224, file: !44, line: 279, baseType: !992, size: 32, align: 32, offset: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "is_mode", scope: !1224, file: !44, line: 280, baseType: !1039, size: 8, align: 8, offset: 96)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "ms_mask", scope: !1224, file: !44, line: 281, baseType: !1231, size: 1024, align: 8, offset: 104)
!1231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 1024, align: 8, elements: !1232)
!1232 = !{!1233}
!1233 = !DISubrange(count: 128)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "is_mask", scope: !1224, file: !44, line: 282, baseType: !1231, size: 1024, align: 8, offset: 1128)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !1224, file: !44, line: 284, baseType: !1236, size: 1187328, align: 256, offset: 2304)
!1236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1237, size: 1187328, align: 256, elements: !1213)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "SingleChannelElement", file: !44, line: 270, baseType: !1238)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SingleChannelElement", file: !44, line: 248, size: 593664, align: 256, elements: !1239)
!1239 = !{!1240, !1291, !1309, !1317, !1319, !1320, !1324, !1326, !1328, !1329, !1330, !1332, !1333, !1337, !1338, !1342, !1346, !1350, !1353, !1354, !1369}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "ics", scope: !1238, file: !44, line: 249, baseType: !1241, size: 2432, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndividualChannelStream", file: !44, line: 193, baseType: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IndividualChannelStream", file: !44, line: 174, size: 2432, align: 64, elements: !1243)
!1243 = !{!1244, !1245, !1247, !1249, !1250, !1253, !1271, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1285, !1289, !1290}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "max_sfb", scope: !1242, file: !44, line: 175, baseType: !1039, size: 8, align: 8)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "window_sequence", scope: !1242, file: !44, line: 176, baseType: !1246, size: 64, align: 32, offset: 32)
!1246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 64, align: 32, elements: !1213)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "use_kb_window", scope: !1242, file: !44, line: 177, baseType: !1248, size: 16, align: 8, offset: 96)
!1248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 16, align: 8, elements: !1213)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "num_window_groups", scope: !1242, file: !44, line: 178, baseType: !992, size: 32, align: 32, offset: 128)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "group_len", scope: !1242, file: !44, line: 179, baseType: !1251, size: 64, align: 8, offset: 160)
!1251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 64, align: 8, elements: !1252)
!1252 = !{!1153}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "ltp", scope: !1242, file: !44, line: 180, baseType: !1254, size: 416, align: 32, offset: 224)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "LongTermPrediction", file: !44, line: 169, baseType: !1255)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LongTermPrediction", file: !44, line: 163, size: 416, align: 32, elements: !1256)
!1256 = !{!1257, !1260, !1263, !1264, !1267}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !1255, file: !44, line: 164, baseType: !1258, size: 8, align: 8)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !951, line: 36, baseType: !1259)
!1259 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !1255, file: !44, line: 165, baseType: !1261, size: 16, align: 16, offset: 16)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !951, line: 37, baseType: !1262)
!1262 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "coef_idx", scope: !1255, file: !44, line: 166, baseType: !992, size: 32, align: 32, offset: 32)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !1255, file: !44, line: 167, baseType: !1265, size: 32, align: 32, offset: 64)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTFLOAT", file: !1266, line: 86, baseType: !969)
!1266 = !DIFile(filename: "libavcodec/aac_defines.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1255, file: !44, line: 168, baseType: !1268, size: 320, align: 8, offset: 96)
!1268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1258, size: 320, align: 8, elements: !1269)
!1269 = !{!1270}
!1270 = !DISubrange(count: 40)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "swb_offset", scope: !1242, file: !44, line: 181, baseType: !1272, size: 64, align: 64, offset: 640)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "swb_sizes", scope: !1242, file: !44, line: 182, baseType: !1218, size: 64, align: 64, offset: 704)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "num_swb", scope: !1242, file: !44, line: 183, baseType: !992, size: 32, align: 32, offset: 768)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "num_windows", scope: !1242, file: !44, line: 184, baseType: !992, size: 32, align: 32, offset: 800)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "tns_max_bands", scope: !1242, file: !44, line: 185, baseType: !992, size: 32, align: 32, offset: 832)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_present", scope: !1242, file: !44, line: 186, baseType: !992, size: 32, align: 32, offset: 864)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_initialized", scope: !1242, file: !44, line: 187, baseType: !992, size: 32, align: 32, offset: 896)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_reset_group", scope: !1242, file: !44, line: 188, baseType: !992, size: 32, align: 32, offset: 928)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_reset_count", scope: !1242, file: !44, line: 189, baseType: !1282, size: 992, align: 32, offset: 960)
!1282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 992, align: 32, elements: !1283)
!1283 = !{!1284}
!1284 = !DISubrange(count: 31)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_used", scope: !1242, file: !44, line: 190, baseType: !1286, size: 328, align: 8, offset: 1952)
!1286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 328, align: 8, elements: !1287)
!1287 = !{!1288}
!1288 = !DISubrange(count: 41)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "window_clipping", scope: !1242, file: !44, line: 191, baseType: !1251, size: 64, align: 8, offset: 2280)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "clip_avoidance_factor", scope: !1242, file: !44, line: 192, baseType: !969, size: 32, align: 32, offset: 2368)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "tns", scope: !1238, file: !44, line: 250, baseType: !1292, size: 44320, align: 32, offset: 2432)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "TemporalNoiseShaping", file: !44, line: 206, baseType: !1293)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TemporalNoiseShaping", file: !44, line: 198, size: 44320, align: 32, elements: !1294)
!1294 = !{!1295, !1296, !1298, !1301, !1302, !1303, !1307}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !1293, file: !44, line: 199, baseType: !992, size: 32, align: 32)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "n_filt", scope: !1293, file: !44, line: 200, baseType: !1297, size: 256, align: 32, offset: 32)
!1297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 256, align: 32, elements: !1252)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1293, file: !44, line: 201, baseType: !1299, size: 1024, align: 32, offset: 288)
!1299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 1024, align: 32, elements: !1300)
!1300 = !{!1153, !1148}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !1293, file: !44, line: 202, baseType: !1299, size: 1024, align: 32, offset: 1312)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !1293, file: !44, line: 203, baseType: !1299, size: 1024, align: 32, offset: 2336)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "coef_idx", scope: !1293, file: !44, line: 204, baseType: !1304, size: 20480, align: 32, offset: 3360)
!1304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 20480, align: 32, elements: !1305)
!1305 = !{!1153, !1148, !1306}
!1306 = !DISubrange(count: 20)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !1293, file: !44, line: 205, baseType: !1308, size: 20480, align: 32, offset: 23840)
!1308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 20480, align: 32, elements: !1305)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "pulse", scope: !1238, file: !44, line: 251, baseType: !1310, size: 320, align: 32, offset: 46752)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pulse", file: !44, line: 229, baseType: !1311)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Pulse", file: !44, line: 224, size: 320, align: 32, elements: !1312)
!1312 = !{!1313, !1314, !1315, !1316}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "num_pulse", scope: !1311, file: !44, line: 225, baseType: !992, size: 32, align: 32)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1311, file: !44, line: 226, baseType: !992, size: 32, align: 32, offset: 32)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1311, file: !44, line: 227, baseType: !1146, size: 128, align: 32, offset: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "amp", scope: !1311, file: !44, line: 228, baseType: !1146, size: 128, align: 32, offset: 192)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "band_type", scope: !1238, file: !44, line: 252, baseType: !1318, size: 4096, align: 32, offset: 47072)
!1318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 4096, align: 32, elements: !1232)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "band_alt", scope: !1238, file: !44, line: 253, baseType: !1318, size: 4096, align: 32, offset: 51168)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "band_type_run_end", scope: !1238, file: !44, line: 254, baseType: !1321, size: 3840, align: 32, offset: 55264)
!1321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 3840, align: 32, elements: !1322)
!1322 = !{!1323}
!1323 = !DISubrange(count: 120)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !1238, file: !44, line: 255, baseType: !1325, size: 3840, align: 32, offset: 59104)
!1325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 3840, align: 32, elements: !1322)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "sf_idx", scope: !1238, file: !44, line: 256, baseType: !1327, size: 4096, align: 32, offset: 62944)
!1327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 4096, align: 32, elements: !1232)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "zeroes", scope: !1238, file: !44, line: 257, baseType: !1231, size: 1024, align: 8, offset: 67040)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "can_pns", scope: !1238, file: !44, line: 258, baseType: !1231, size: 1024, align: 8, offset: 68064)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "is_ener", scope: !1238, file: !44, line: 259, baseType: !1331, size: 4096, align: 32, offset: 69088)
!1331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !969, size: 4096, align: 32, elements: !1232)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "pns_ener", scope: !1238, file: !44, line: 260, baseType: !1331, size: 4096, align: 32, offset: 73184)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "pcoeffs", scope: !1238, file: !44, line: 261, baseType: !1334, size: 32768, align: 32, offset: 77312)
!1334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 32768, align: 32, elements: !1335)
!1335 = !{!1336}
!1336 = !DISubrange(count: 1024)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "coeffs", scope: !1238, file: !44, line: 262, baseType: !1334, size: 32768, align: 32, offset: 110080)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1238, file: !44, line: 263, baseType: !1339, size: 49152, align: 32, offset: 142848)
!1339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 49152, align: 32, elements: !1340)
!1340 = !{!1341}
!1341 = !DISubrange(count: 1536)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "ret_buf", scope: !1238, file: !44, line: 264, baseType: !1343, size: 65536, align: 32, offset: 192000)
!1343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 65536, align: 32, elements: !1344)
!1344 = !{!1345}
!1345 = !DISubrange(count: 2048)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "ltp_state", scope: !1238, file: !44, line: 265, baseType: !1347, size: 98304, align: 32, offset: 257536)
!1347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 98304, align: 32, elements: !1348)
!1348 = !{!1349}
!1349 = !DISubrange(count: 3072)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "lcoeffs", scope: !1238, file: !44, line: 266, baseType: !1351, size: 32768, align: 32, offset: 355840)
!1351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1352, size: 32768, align: 32, elements: !1335)
!1352 = !DIDerivedType(tag: DW_TAG_typedef, name: "AAC_FLOAT", file: !1266, line: 90, baseType: !969)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "prcoeffs", scope: !1238, file: !44, line: 267, baseType: !1351, size: 32768, align: 32, offset: 388608)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_state", scope: !1238, file: !44, line: 268, baseType: !1355, size: 172032, align: 32, offset: 421376)
!1355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1356, size: 172032, align: 32, elements: !1367)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "PredictorState", file: !44, line: 144, baseType: !1357)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PredictorState", file: !44, line: 135, size: 256, align: 32, elements: !1358)
!1358 = !{!1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "cor0", scope: !1357, file: !44, line: 136, baseType: !1352, size: 32, align: 32)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "cor1", scope: !1357, file: !44, line: 137, baseType: !1352, size: 32, align: 32, offset: 32)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "var0", scope: !1357, file: !44, line: 138, baseType: !1352, size: 32, align: 32, offset: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "var1", scope: !1357, file: !44, line: 139, baseType: !1352, size: 32, align: 32, offset: 96)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "r0", scope: !1357, file: !44, line: 140, baseType: !1352, size: 32, align: 32, offset: 128)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "r1", scope: !1357, file: !44, line: 141, baseType: !1352, size: 32, align: 32, offset: 160)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1357, file: !44, line: 142, baseType: !1352, size: 32, align: 32, offset: 192)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "x_est", scope: !1357, file: !44, line: 143, baseType: !1352, size: 32, align: 32, offset: 224)
!1367 = !{!1368}
!1368 = !DISubrange(count: 672)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "ret", scope: !1238, file: !44, line: 269, baseType: !1370, size: 64, align: 64, offset: 593408)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "coup", scope: !1224, file: !44, line: 286, baseType: !1372, size: 62272, align: 32, offset: 1189632)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelCoupling", file: !44, line: 243, baseType: !1373)
!1373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelCoupling", file: !44, line: 234, size: 62272, align: 32, elements: !1374)
!1374 = !{!1375, !1376, !1377, !1379, !1380, !1381}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "coupling_point", scope: !1373, file: !44, line: 235, baseType: !59, size: 32, align: 32)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "num_coupled", scope: !1373, file: !44, line: 236, baseType: !992, size: 32, align: 32, offset: 32)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1373, file: !44, line: 237, baseType: !1378, size: 256, align: 32, offset: 64)
!1378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 256, align: 32, elements: !1252)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "id_select", scope: !1373, file: !44, line: 238, baseType: !1297, size: 256, align: 32, offset: 320)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "ch_select", scope: !1373, file: !44, line: 239, baseType: !1297, size: 256, align: 32, offset: 576)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1373, file: !44, line: 242, baseType: !1382, size: 61440, align: 32, offset: 832)
!1382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 61440, align: 32, elements: !1383)
!1383 = !{!1160, !1323}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "sbr", scope: !1224, file: !44, line: 287, baseType: !1385, size: 3129856, align: 256, offset: 1252096)
!1385 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpectralBandReplication", file: !1386, line: 115, baseType: !1387)
!1386 = !DIFile(filename: "libavcodec/sbr.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpectralBandReplication", file: !1386, line: 139, size: 3129856, align: 256, elements: !1388)
!1388 = !{!1389, !1390, !1391, !1392, !1393, !1394, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1415, !1417, !1418, !1419, !1420, !1492, !1610, !1611, !1612, !1613, !1617, !1621, !1622, !1624, !1628, !1629, !1631, !1632, !1635, !1638, !1641, !1644, !1645, !1648, !1649, !1651, !1652, !1653, !1654, !1655, !1658, !1659, !1660, !1713}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1387, file: !1386, line: 140, baseType: !992, size: 32, align: 32)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1387, file: !1386, line: 141, baseType: !992, size: 32, align: 32, offset: 32)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "ready_for_dequant", scope: !1387, file: !1386, line: 142, baseType: !992, size: 32, align: 32, offset: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "id_aac", scope: !1387, file: !1386, line: 143, baseType: !992, size: 32, align: 32, offset: 96)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !1387, file: !1386, line: 144, baseType: !992, size: 32, align: 32, offset: 128)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "spectrum_params", scope: !1387, file: !1386, line: 145, baseType: !1395, size: 48, align: 8, offset: 160)
!1395 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpectrumParameters", file: !1386, line: 55, baseType: !1396)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpectrumParameters", file: !1386, line: 42, size: 48, align: 8, elements: !1397)
!1397 = !{!1398, !1399, !1400, !1401, !1402, !1403}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "bs_start_freq", scope: !1396, file: !1386, line: 43, baseType: !1039, size: 8, align: 8)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "bs_stop_freq", scope: !1396, file: !1386, line: 44, baseType: !1039, size: 8, align: 8, offset: 8)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "bs_xover_band", scope: !1396, file: !1386, line: 45, baseType: !1039, size: 8, align: 8, offset: 16)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "bs_freq_scale", scope: !1396, file: !1386, line: 51, baseType: !1039, size: 8, align: 8, offset: 24)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "bs_alter_scale", scope: !1396, file: !1386, line: 52, baseType: !1039, size: 8, align: 8, offset: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "bs_noise_bands", scope: !1396, file: !1386, line: 53, baseType: !1039, size: 8, align: 8, offset: 40)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "bs_amp_res_header", scope: !1387, file: !1386, line: 146, baseType: !992, size: 32, align: 32, offset: 224)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "bs_limiter_bands", scope: !1387, file: !1386, line: 151, baseType: !952, size: 32, align: 32, offset: 256)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "bs_limiter_gains", scope: !1387, file: !1386, line: 152, baseType: !952, size: 32, align: 32, offset: 288)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "bs_interpol_freq", scope: !1387, file: !1386, line: 153, baseType: !952, size: 32, align: 32, offset: 320)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "bs_smoothing_mode", scope: !1387, file: !1386, line: 154, baseType: !952, size: 32, align: 32, offset: 352)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "bs_coupling", scope: !1387, file: !1386, line: 156, baseType: !952, size: 32, align: 32, offset: 384)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !1387, file: !1386, line: 157, baseType: !1411, size: 160, align: 32, offset: 416)
!1411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1412, size: 160, align: 32, elements: !1413)
!1412 = !DIDerivedType(tag: DW_TAG_typedef, name: "AAC_SIGNE", file: !1266, line: 91, baseType: !952)
!1413 = !{!1414}
!1414 = !DISubrange(count: 5)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !1387, file: !1386, line: 160, baseType: !1416, size: 64, align: 32, offset: 576)
!1416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1412, size: 64, align: 32, elements: !1213)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1387, file: !1386, line: 162, baseType: !1416, size: 64, align: 32, offset: 640)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "kx_and_m_pushed", scope: !1387, file: !1386, line: 163, baseType: !952, size: 32, align: 32, offset: 704)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "n_master", scope: !1387, file: !1386, line: 165, baseType: !1412, size: 32, align: 32, offset: 736)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1387, file: !1386, line: 166, baseType: !1421, size: 1407488, align: 256, offset: 768)
!1421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1422, size: 1407488, align: 256, elements: !1213)
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBRData", file: !1386, line: 113, baseType: !1423)
!1423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SBRData", file: !1386, line: 62, size: 703744, align: 256, elements: !1424)
!1424 = !{!1425, !1426, !1427, !1428, !1432, !1433, !1435, !1436, !1439, !1443, !1444, !1448, !1452, !1453, !1455, !1457, !1460, !1461, !1466, !1470, !1471, !1474, !1478, !1480, !1483, !1485, !1486, !1487, !1490, !1491}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "bs_frame_class", scope: !1423, file: !1386, line: 67, baseType: !952, size: 32, align: 32)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "bs_add_harmonic_flag", scope: !1423, file: !1386, line: 68, baseType: !952, size: 32, align: 32, offset: 32)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "bs_num_env", scope: !1423, file: !1386, line: 69, baseType: !1412, size: 32, align: 32, offset: 64)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "bs_freq_res", scope: !1423, file: !1386, line: 70, baseType: !1429, size: 56, align: 8, offset: 96)
!1429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 56, align: 8, elements: !1430)
!1430 = !{!1431}
!1431 = !DISubrange(count: 7)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "bs_num_noise", scope: !1423, file: !1386, line: 71, baseType: !1412, size: 32, align: 32, offset: 160)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "bs_df_env", scope: !1423, file: !1386, line: 72, baseType: !1434, size: 40, align: 8, offset: 192)
!1434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 40, align: 8, elements: !1413)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "bs_df_noise", scope: !1423, file: !1386, line: 73, baseType: !1248, size: 16, align: 8, offset: 232)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "bs_invf_mode", scope: !1423, file: !1386, line: 74, baseType: !1437, size: 80, align: 8, offset: 248)
!1437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 80, align: 8, elements: !1438)
!1438 = !{!1214, !1414}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "bs_add_harmonic", scope: !1423, file: !1386, line: 75, baseType: !1440, size: 384, align: 8, offset: 328)
!1440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 384, align: 8, elements: !1441)
!1441 = !{!1442}
!1442 = !DISubrange(count: 48)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "bs_amp_res", scope: !1423, file: !1386, line: 76, baseType: !952, size: 32, align: 32, offset: 736)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "synthesis_filterbank_samples", scope: !1423, file: !1386, line: 83, baseType: !1445, size: 73728, align: 32, offset: 768)
!1445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 73728, align: 32, elements: !1446)
!1446 = !{!1447}
!1447 = !DISubrange(count: 2304)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "analysis_filterbank_samples", scope: !1423, file: !1386, line: 84, baseType: !1449, size: 41984, align: 32, offset: 74496)
!1449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 41984, align: 32, elements: !1450)
!1450 = !{!1451}
!1451 = !DISubrange(count: 1312)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "synthesis_filterbank_samples_offset", scope: !1423, file: !1386, line: 85, baseType: !992, size: 32, align: 32, offset: 116480)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "e_a", scope: !1423, file: !1386, line: 87, baseType: !1454, size: 64, align: 32, offset: 116512)
!1454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 64, align: 32, elements: !1213)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "bw_array", scope: !1423, file: !1386, line: 89, baseType: !1456, size: 160, align: 32, offset: 116576)
!1456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 160, align: 32, elements: !1413)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !1423, file: !1386, line: 91, baseType: !1458, size: 131072, align: 32, offset: 116736)
!1458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 131072, align: 32, elements: !1459)
!1459 = !{!1214, !1199, !1199, !1214}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "Ypos", scope: !1423, file: !1386, line: 93, baseType: !992, size: 32, align: 32, offset: 247808)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "Y", scope: !1423, file: !1386, line: 94, baseType: !1462, size: 311296, align: 32, offset: 247936)
!1462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 311296, align: 32, elements: !1463)
!1463 = !{!1214, !1464, !1465, !1214}
!1464 = !DISubrange(count: 38)
!1465 = !DISubrange(count: 64)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "g_temp", scope: !1423, file: !1386, line: 95, baseType: !1467, size: 64512, align: 32, offset: 559232)
!1467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1352, size: 64512, align: 32, elements: !1468)
!1468 = !{!1469, !1442}
!1469 = !DISubrange(count: 42)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "q_temp", scope: !1423, file: !1386, line: 96, baseType: !1467, size: 64512, align: 32, offset: 623744)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "s_indexmapped", scope: !1423, file: !1386, line: 97, baseType: !1472, size: 3072, align: 8, offset: 688256)
!1472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 3072, align: 8, elements: !1473)
!1473 = !{!1153, !1442}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "env_facs_q", scope: !1423, file: !1386, line: 99, baseType: !1475, size: 2304, align: 8, offset: 691328)
!1475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 2304, align: 8, elements: !1476)
!1476 = !{!1477, !1442}
!1477 = !DISubrange(count: 6)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "env_facs", scope: !1423, file: !1386, line: 100, baseType: !1479, size: 9216, align: 32, offset: 693632)
!1479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1352, size: 9216, align: 32, elements: !1476)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "noise_facs_q", scope: !1423, file: !1386, line: 102, baseType: !1481, size: 120, align: 8, offset: 702848)
!1481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 120, align: 8, elements: !1482)
!1482 = !{!1152, !1414}
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "noise_facs", scope: !1423, file: !1386, line: 103, baseType: !1484, size: 480, align: 32, offset: 702976)
!1484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1352, size: 480, align: 32, elements: !1482)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "t_env", scope: !1423, file: !1386, line: 105, baseType: !1251, size: 64, align: 8, offset: 703456)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "t_env_num_env_old", scope: !1423, file: !1386, line: 107, baseType: !1039, size: 8, align: 8, offset: 703520)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "t_q", scope: !1423, file: !1386, line: 109, baseType: !1488, size: 24, align: 8, offset: 703528)
!1488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 24, align: 8, elements: !1489)
!1489 = !{!1152}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "f_indexnoise", scope: !1423, file: !1386, line: 110, baseType: !952, size: 32, align: 32, offset: 703552)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "f_indexsine", scope: !1423, file: !1386, line: 111, baseType: !952, size: 32, align: 32, offset: 703584)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "ps", scope: !1387, file: !1386, line: 167, baseType: !1493, size: 1072896, align: 128, offset: 1408256)
!1493 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSContext", file: !1494, line: 79, baseType: !1495)
!1494 = !DIFile(filename: "libavcodec/aacps.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PSContext", file: !1494, line: 41, size: 1072896, align: 128, elements: !1496)
!1496 = !{!1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1513, !1517, !1518, !1519, !1520, !1521, !1522, !1526, !1531, !1536, !1539, !1540, !1541, !1544, !1545, !1546, !1547, !1550, !1551, !1553, !1554}
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1495, file: !1494, line: 42, baseType: !992, size: 32, align: 32)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "enable_iid", scope: !1495, file: !1494, line: 43, baseType: !992, size: 32, align: 32, offset: 32)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "iid_quant", scope: !1495, file: !1494, line: 44, baseType: !992, size: 32, align: 32, offset: 64)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "nr_iid_par", scope: !1495, file: !1494, line: 45, baseType: !992, size: 32, align: 32, offset: 96)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "nr_ipdopd_par", scope: !1495, file: !1494, line: 46, baseType: !992, size: 32, align: 32, offset: 128)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "enable_icc", scope: !1495, file: !1494, line: 47, baseType: !992, size: 32, align: 32, offset: 160)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "icc_mode", scope: !1495, file: !1494, line: 48, baseType: !992, size: 32, align: 32, offset: 192)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "nr_icc_par", scope: !1495, file: !1494, line: 49, baseType: !992, size: 32, align: 32, offset: 224)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "enable_ext", scope: !1495, file: !1494, line: 50, baseType: !992, size: 32, align: 32, offset: 256)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "frame_class", scope: !1495, file: !1494, line: 51, baseType: !992, size: 32, align: 32, offset: 288)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "num_env_old", scope: !1495, file: !1494, line: 52, baseType: !992, size: 32, align: 32, offset: 320)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "num_env", scope: !1495, file: !1494, line: 53, baseType: !992, size: 32, align: 32, offset: 352)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "enable_ipdopd", scope: !1495, file: !1494, line: 54, baseType: !992, size: 32, align: 32, offset: 384)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "border_position", scope: !1495, file: !1494, line: 55, baseType: !1511, size: 192, align: 32, offset: 416)
!1511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 192, align: 32, elements: !1512)
!1512 = !{!1477}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "iid_par", scope: !1495, file: !1494, line: 56, baseType: !1514, size: 1360, align: 8, offset: 608)
!1514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1258, size: 1360, align: 8, elements: !1515)
!1515 = !{!1414, !1516}
!1516 = !DISubrange(count: 34)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "icc_par", scope: !1495, file: !1494, line: 57, baseType: !1514, size: 1360, align: 8, offset: 1968)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "ipd_par", scope: !1495, file: !1494, line: 59, baseType: !1514, size: 1360, align: 8, offset: 3328)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "opd_par", scope: !1495, file: !1494, line: 60, baseType: !1514, size: 1360, align: 8, offset: 4688)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "is34bands", scope: !1495, file: !1494, line: 61, baseType: !992, size: 32, align: 32, offset: 6048)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "is34bands_old", scope: !1495, file: !1494, line: 62, baseType: !992, size: 32, align: 32, offset: 6080)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !1495, file: !1494, line: 64, baseType: !1523, size: 14080, align: 32, offset: 6144)
!1523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 14080, align: 32, elements: !1524)
!1524 = !{!1414, !1525, !1214}
!1525 = !DISubrange(count: 44)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1495, file: !1494, line: 65, baseType: !1527, size: 267904, align: 32, offset: 20224)
!1527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 267904, align: 32, elements: !1528)
!1528 = !{!1529, !1530, !1214}
!1529 = !DISubrange(count: 91)
!1530 = !DISubrange(count: 46)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "ap_delay", scope: !1495, file: !1494, line: 66, baseType: !1532, size: 355200, align: 32, offset: 288128)
!1532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 355200, align: 32, elements: !1533)
!1533 = !{!1534, !1152, !1535, !1214}
!1534 = !DISubrange(count: 50)
!1535 = !DISubrange(count: 37)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "peak_decay_nrg", scope: !1495, file: !1494, line: 67, baseType: !1537, size: 1088, align: 32, offset: 643328)
!1537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 1088, align: 32, elements: !1538)
!1538 = !{!1516}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "power_smooth", scope: !1495, file: !1494, line: 68, baseType: !1537, size: 1088, align: 32, offset: 644480)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "peak_decay_diff_smooth", scope: !1495, file: !1494, line: 69, baseType: !1537, size: 1088, align: 32, offset: 645632)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "H11", scope: !1495, file: !1494, line: 70, baseType: !1542, size: 13056, align: 32, offset: 646784)
!1542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 13056, align: 32, elements: !1543)
!1543 = !{!1214, !1477, !1516}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "H12", scope: !1495, file: !1494, line: 71, baseType: !1542, size: 13056, align: 32, offset: 659840)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "H21", scope: !1495, file: !1494, line: 72, baseType: !1542, size: 13056, align: 32, offset: 672896)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "H22", scope: !1495, file: !1494, line: 73, baseType: !1542, size: 13056, align: 32, offset: 685952)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "Lbuf", scope: !1495, file: !1494, line: 74, baseType: !1548, size: 186368, align: 32, offset: 699008)
!1548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 186368, align: 32, elements: !1549)
!1549 = !{!1529, !1199, !1214}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "Rbuf", scope: !1495, file: !1494, line: 75, baseType: !1548, size: 186368, align: 32, offset: 885376)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "opd_hist", scope: !1495, file: !1494, line: 76, baseType: !1552, size: 272, align: 8, offset: 1071744)
!1552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1258, size: 272, align: 8, elements: !1538)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "ipd_hist", scope: !1495, file: !1494, line: 77, baseType: !1552, size: 272, align: 8, offset: 1072016)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "dsp", scope: !1495, file: !1494, line: 78, baseType: !1555, size: 512, align: 64, offset: 1072320)
!1555 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSDSPContext", file: !1556, line: 52, baseType: !1557)
!1556 = !DIFile(filename: "libavcodec/aacpsdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PSDSPContext", file: !1556, line: 32, size: 512, align: 64, elements: !1558)
!1558 = !{!1559, !1566, !1572, !1581, !1591, !1595, !1603}
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "add_squares", scope: !1557, file: !1556, line: 33, baseType: !1560, size: 64, align: 64)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DISubroutineType(types: !1562)
!1562 = !{null, !1370, !1563, !992}
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1565, size: 64, align: 32, elements: !1213)
!1565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1265)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "mul_pair_single", scope: !1557, file: !1556, line: 34, baseType: !1567, size: 64, align: 64, offset: 64)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DISubroutineType(types: !1569)
!1569 = !{null, !1570, !1570, !1370, !992}
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 64, align: 32, elements: !1213)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "hybrid_analysis", scope: !1557, file: !1556, line: 36, baseType: !1573, size: 64, align: 64, offset: 128)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DISubroutineType(types: !1575)
!1575 = !{null, !1570, !1570, !1576, !1579, !992}
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1565, size: 512, align: 32, elements: !1578)
!1578 = !{!1153, !1214}
!1579 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1580, line: 149, baseType: !1144)
!1580 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "hybrid_analysis_ileave", scope: !1557, file: !1556, line: 39, baseType: !1582, size: 64, align: 64, offset: 192)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DISubroutineType(types: !1584)
!1584 = !{null, !1585, !1588, !992, !992}
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 2048, align: 32, elements: !1587)
!1587 = !{!1199, !1214}
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 77824, align: 32, elements: !1590)
!1590 = !{!1464, !1465}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "hybrid_synthesis_deint", scope: !1557, file: !1556, line: 41, baseType: !1592, size: 64, align: 64, offset: 256)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DISubroutineType(types: !1594)
!1594 = !{null, !1588, !1585, !992, !992}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "decorrelate", scope: !1557, file: !1556, line: 43, baseType: !1596, size: 64, align: 64, offset: 320)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{null, !1570, !1570, !1599, !1602, !1563, !1602, !1265, !992}
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 2368, align: 32, elements: !1601)
!1601 = !{!1535, !1214}
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "stereo_interpolate", scope: !1557, file: !1556, line: 49, baseType: !1604, size: 128, align: 64, offset: 384)
!1604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1605, size: 128, align: 64, elements: !1213)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DISubroutineType(types: !1607)
!1607 = !{null, !1570, !1570, !1608, !1608, !992}
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 128, align: 32, elements: !1147)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1387, file: !1386, line: 169, baseType: !1416, size: 64, align: 32, offset: 2481152)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "n_q", scope: !1387, file: !1386, line: 171, baseType: !1412, size: 32, align: 32, offset: 2481216)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "n_lim", scope: !1387, file: !1386, line: 173, baseType: !1412, size: 32, align: 32, offset: 2481248)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "f_master", scope: !1387, file: !1386, line: 175, baseType: !1614, size: 784, align: 16, offset: 2481280)
!1614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 784, align: 16, elements: !1615)
!1615 = !{!1616}
!1616 = !DISubrange(count: 49)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablelow", scope: !1387, file: !1386, line: 177, baseType: !1618, size: 400, align: 16, offset: 2482064)
!1618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 400, align: 16, elements: !1619)
!1619 = !{!1620}
!1620 = !DISubrange(count: 25)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablehigh", scope: !1387, file: !1386, line: 179, baseType: !1614, size: 784, align: 16, offset: 2482464)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablenoise", scope: !1387, file: !1386, line: 181, baseType: !1623, size: 96, align: 16, offset: 2483248)
!1623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 96, align: 16, elements: !1512)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablelim", scope: !1387, file: !1386, line: 183, baseType: !1625, size: 480, align: 16, offset: 2483344)
!1625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 480, align: 16, elements: !1626)
!1626 = !{!1627}
!1627 = !DISubrange(count: 30)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "num_patches", scope: !1387, file: !1386, line: 184, baseType: !1412, size: 32, align: 32, offset: 2483840)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "patch_num_subbands", scope: !1387, file: !1386, line: 185, baseType: !1630, size: 48, align: 8, offset: 2483872)
!1630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 48, align: 8, elements: !1512)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "patch_start_subband", scope: !1387, file: !1386, line: 186, baseType: !1630, size: 48, align: 8, offset: 2483920)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "X_low", scope: !1387, file: !1386, line: 188, baseType: !1633, size: 81920, align: 32, offset: 2483968)
!1633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 81920, align: 32, elements: !1634)
!1634 = !{!1199, !1270, !1214}
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "X_high", scope: !1387, file: !1386, line: 190, baseType: !1636, size: 163840, align: 32, offset: 2565888)
!1636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 163840, align: 32, elements: !1637)
!1637 = !{!1465, !1270, !1214}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !1387, file: !1386, line: 192, baseType: !1639, size: 311296, align: 32, offset: 2729728)
!1639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 311296, align: 32, elements: !1640)
!1640 = !{!1214, !1214, !1464, !1465}
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "alpha0", scope: !1387, file: !1386, line: 194, baseType: !1642, size: 4096, align: 32, offset: 3041024)
!1642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 4096, align: 32, elements: !1643)
!1643 = !{!1465, !1214}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "alpha1", scope: !1387, file: !1386, line: 196, baseType: !1642, size: 4096, align: 32, offset: 3045120)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "e_origmapped", scope: !1387, file: !1386, line: 198, baseType: !1646, size: 10752, align: 32, offset: 3049216)
!1646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1352, size: 10752, align: 32, elements: !1647)
!1647 = !{!1431, !1442}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "q_mapped", scope: !1387, file: !1386, line: 200, baseType: !1646, size: 10752, align: 32, offset: 3059968)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "s_mapped", scope: !1387, file: !1386, line: 202, baseType: !1650, size: 2688, align: 8, offset: 3070720)
!1650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 2688, align: 8, elements: !1647)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "e_curr", scope: !1387, file: !1386, line: 204, baseType: !1646, size: 10752, align: 32, offset: 3073408)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "q_m", scope: !1387, file: !1386, line: 206, baseType: !1646, size: 10752, align: 32, offset: 3084160)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "s_m", scope: !1387, file: !1386, line: 208, baseType: !1646, size: 10752, align: 32, offset: 3094912)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1387, file: !1386, line: 209, baseType: !1646, size: 10752, align: 32, offset: 3105664)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_filter_scratch", scope: !1387, file: !1386, line: 210, baseType: !1656, size: 10240, align: 32, offset: 3116544)
!1656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 10240, align: 32, elements: !1657)
!1657 = !{!1414, !1465}
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_ana", scope: !1387, file: !1386, line: 211, baseType: !1044, size: 896, align: 64, offset: 3126784)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "mdct", scope: !1387, file: !1386, line: 212, baseType: !1044, size: 896, align: 64, offset: 3127680)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "dsp", scope: !1387, file: !1386, line: 213, baseType: !1661, size: 896, align: 64, offset: 3128576)
!1661 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBRDSPContext", file: !1662, line: 45, baseType: !1663)
!1662 = !DIFile(filename: "libavcodec/sbrdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SBRDSPContext", file: !1662, line: 28, size: 896, align: 64, elements: !1664)
!1664 = !{!1665, !1669, !1673, !1674, !1675, !1679, !1683, !1687, !1694, !1698, !1708}
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "sum64x5", scope: !1663, file: !1662, line: 29, baseType: !1666, size: 64, align: 64)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = !DISubroutineType(types: !1668)
!1668 = !{null, !1370}
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "sum_square", scope: !1663, file: !1662, line: 30, baseType: !1670, size: 64, align: 64, offset: 64)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{!1352, !1570, !992}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "neg_odd_64", scope: !1663, file: !1662, line: 31, baseType: !1666, size: 64, align: 64, offset: 128)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_pre_shuffle", scope: !1663, file: !1662, line: 32, baseType: !1666, size: 64, align: 64, offset: 192)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_post_shuffle", scope: !1663, file: !1662, line: 33, baseType: !1676, size: 64, align: 64, offset: 256)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DISubroutineType(types: !1678)
!1678 = !{null, !1570, !1602}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_deint_neg", scope: !1663, file: !1662, line: 34, baseType: !1680, size: 64, align: 64, offset: 320)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{null, !1370, !1602}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_deint_bfly", scope: !1663, file: !1662, line: 35, baseType: !1684, size: 64, align: 64, offset: 384)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DISubroutineType(types: !1686)
!1686 = !{null, !1370, !1602, !1602}
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "autocorrelate", scope: !1663, file: !1662, line: 36, baseType: !1688, size: 64, align: 64, offset: 448)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{null, !1563, !1691}
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64, align: 64)
!1692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1352, size: 128, align: 32, elements: !1693)
!1693 = !{!1214, !1214}
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "hf_gen", scope: !1663, file: !1662, line: 37, baseType: !1695, size: 64, align: 64, offset: 512)
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1696, size: 64, align: 64)
!1696 = !DISubroutineType(types: !1697)
!1697 = !{null, !1570, !1563, !1602, !1602, !1265, !992, !992}
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "hf_g_filt", scope: !1663, file: !1662, line: 40, baseType: !1699, size: 64, align: 64, offset: 576)
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DISubroutineType(types: !1701)
!1701 = !{null, !1570, !1702, !1705, !992, !1707}
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64, align: 64)
!1703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1565, size: 2560, align: 32, elements: !1704)
!1704 = !{!1270, !1214}
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64, align: 64)
!1706 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1352)
!1707 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !951, line: 119, baseType: !1144)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "hf_apply_noise", scope: !1663, file: !1662, line: 42, baseType: !1709, size: 256, align: 64, offset: 640)
!1709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1710, size: 256, align: 64, elements: !1147)
!1710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1711, size: 64, align: 64)
!1711 = !DISubroutineType(types: !1712)
!1712 = !{null, !1570, !1705, !1705, !992, !992, !992}
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1387, file: !1386, line: 214, baseType: !1714, size: 256, align: 64, offset: 3129472)
!1714 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACSBRContext", file: !1386, line: 134, baseType: !1715)
!1715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACSBRContext", file: !1386, line: 120, size: 256, align: 64, elements: !1716)
!1716 = !{!1717, !2527, !2533, !2539}
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "sbr_lf_gen", scope: !1715, file: !1386, line: 121, baseType: !1718, size: 64, align: 64)
!1718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1719, size: 64, align: 64)
!1719 = !DISubroutineType(types: !1720)
!1720 = !{!992, !1721, !2521, !2522, !2524, !992}
!1721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1722, size: 64, align: 64)
!1722 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACContext", file: !1386, line: 37, baseType: !1723)
!1723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACContext", file: !44, line: 293, size: 62208, align: 256, elements: !1724)
!1724 = !{!1725, !1726, !2393, !2394, !2395, !2412, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2454, !2455, !2456, !2457, !2458, !2461, !2462, !2463, !2465, !2494, !2495, !2496, !2497, !2501, !2502, !2508, !2512, !2513, !2517}
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1723, file: !44, line: 294, baseType: !975, size: 64, align: 64)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1723, file: !44, line: 295, baseType: !1727, size: 64, align: 64, offset: 64)
!1727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1728, size: 64, align: 64)
!1728 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !85, line: 3360, baseType: !1729)
!1729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !85, line: 1556, size: 8448, align: 64, elements: !1730)
!1730 = !{!1731, !1734, !1735, !1736, !1993, !1994, !1995, !1996, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2149, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252, !2253, !2254, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2331, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392}
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1729, file: !85, line: 1561, baseType: !1732, size: 64, align: 64)
!1732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1733, size: 64, align: 64)
!1733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1729, file: !85, line: 1562, baseType: !992, size: 32, align: 32, offset: 64)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1729, file: !85, line: 1564, baseType: !74, size: 32, align: 32, offset: 96)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1729, file: !85, line: 1565, baseType: !1737, size: 64, align: 64, offset: 128)
!1737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1738, size: 64, align: 64)
!1738 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1739)
!1739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !85, line: 3468, size: 1984, align: 64, elements: !1740)
!1740 = !{!1741, !1742, !1743, !1744, !1745, !1746, !1755, !1758, !1761, !1764, !1769, !1770, !1771, !1779, !1780, !1781, !1783, !1787, !1793, !1802, !1806, !1807, !1846, !1964, !1968, !1969, !1973, !1977, !1982, !1986, !1987, !1988}
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1739, file: !85, line: 3475, baseType: !980, size: 64, align: 64)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1739, file: !85, line: 3480, baseType: !980, size: 64, align: 64, offset: 64)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1739, file: !85, line: 3481, baseType: !74, size: 32, align: 32, offset: 128)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1739, file: !85, line: 3482, baseType: !84, size: 32, align: 32, offset: 160)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1739, file: !85, line: 3487, baseType: !992, size: 32, align: 32, offset: 192)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1739, file: !85, line: 3488, baseType: !1747, size: 64, align: 64, offset: 256)
!1747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1748, size: 64, align: 64)
!1748 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1749)
!1749 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1750, line: 61, baseType: !1751)
!1750 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1750, line: 58, size: 64, align: 32, elements: !1752)
!1752 = !{!1753, !1754}
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1751, file: !1750, line: 59, baseType: !992, size: 32, align: 32)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1751, file: !1750, line: 60, baseType: !992, size: 32, align: 32, offset: 32)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1739, file: !85, line: 3489, baseType: !1756, size: 64, align: 64, offset: 320)
!1756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1757, size: 64, align: 64)
!1757 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1739, file: !85, line: 3490, baseType: !1759, size: 64, align: 64, offset: 384)
!1759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1760, size: 64, align: 64)
!1760 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1739, file: !85, line: 3491, baseType: !1762, size: 64, align: 64, offset: 448)
!1762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1763, size: 64, align: 64)
!1763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !744)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1739, file: !85, line: 3492, baseType: !1765, size: 64, align: 64, offset: 512)
!1765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1766, size: 64, align: 64)
!1766 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1767)
!1767 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !951, line: 55, baseType: !1768)
!1768 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1739, file: !85, line: 3493, baseType: !1039, size: 8, align: 8, offset: 576)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1739, file: !85, line: 3494, baseType: !1732, size: 64, align: 64, offset: 640)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1739, file: !85, line: 3495, baseType: !1772, size: 64, align: 64, offset: 704)
!1772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1773, size: 64, align: 64)
!1773 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1774)
!1774 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !85, line: 3404, baseType: !1775)
!1775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !85, line: 3401, size: 128, align: 64, elements: !1776)
!1776 = !{!1777, !1778}
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1775, file: !85, line: 3402, baseType: !992, size: 32, align: 32)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1775, file: !85, line: 3403, baseType: !980, size: 64, align: 64, offset: 64)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1739, file: !85, line: 3507, baseType: !980, size: 64, align: 64, offset: 768)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1739, file: !85, line: 3516, baseType: !992, size: 32, align: 32, offset: 832)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1739, file: !85, line: 3517, baseType: !1782, size: 64, align: 64, offset: 896)
!1782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1739, size: 64, align: 64)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1739, file: !85, line: 3527, baseType: !1784, size: 64, align: 64, offset: 960)
!1784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1785, size: 64, align: 64)
!1785 = !DISubroutineType(types: !1786)
!1786 = !{!992, !1727}
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1739, file: !85, line: 3535, baseType: !1788, size: 64, align: 64, offset: 1024)
!1788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1789, size: 64, align: 64)
!1789 = !DISubroutineType(types: !1790)
!1790 = !{!992, !1727, !1791}
!1791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1792, size: 64, align: 64)
!1792 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1728)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1739, file: !85, line: 3541, baseType: !1794, size: 64, align: 64, offset: 1088)
!1794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1795, size: 64, align: 64)
!1795 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1796)
!1796 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !85, line: 3461, baseType: !1797)
!1797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1798, line: 223, size: 128, align: 64, elements: !1799)
!1798 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1799 = !{!1800, !1801}
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1797, file: !1798, line: 224, baseType: !1218, size: 64, align: 64)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1797, file: !1798, line: 225, baseType: !1218, size: 64, align: 64, offset: 64)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1739, file: !85, line: 3549, baseType: !1803, size: 64, align: 64, offset: 1152)
!1803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1804, size: 64, align: 64)
!1804 = !DISubroutineType(types: !1805)
!1805 = !{null, !1782}
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1739, file: !85, line: 3551, baseType: !1784, size: 64, align: 64, offset: 1216)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1739, file: !85, line: 3552, baseType: !1808, size: 64, align: 64, offset: 1280)
!1808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1809, size: 64, align: 64)
!1809 = !DISubroutineType(types: !1810)
!1810 = !{!992, !1727, !1038, !992, !1811}
!1811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1812, size: 64, align: 64)
!1812 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1813)
!1813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !85, line: 3920, size: 256, align: 64, elements: !1814)
!1814 = !{!1815, !1816, !1817, !1818, !1819, !1845}
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1813, file: !85, line: 3921, baseType: !1052, size: 16, align: 16)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1813, file: !85, line: 3922, baseType: !950, size: 32, align: 32, offset: 32)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1813, file: !85, line: 3923, baseType: !950, size: 32, align: 32, offset: 64)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1813, file: !85, line: 3924, baseType: !952, size: 32, align: 32, offset: 96)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1813, file: !85, line: 3925, baseType: !1820, size: 64, align: 64, offset: 128)
!1820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1821, size: 64, align: 64)
!1821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1822, size: 64, align: 64)
!1822 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !85, line: 3918, baseType: !1823)
!1823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !85, line: 3885, size: 1600, align: 64, elements: !1824)
!1824 = !{!1825, !1826, !1827, !1828, !1829, !1830, !1837, !1839, !1840, !1841, !1843, !1844}
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1823, file: !85, line: 3886, baseType: !992, size: 32, align: 32)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1823, file: !85, line: 3887, baseType: !992, size: 32, align: 32, offset: 32)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1823, file: !85, line: 3888, baseType: !992, size: 32, align: 32, offset: 64)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1823, file: !85, line: 3889, baseType: !992, size: 32, align: 32, offset: 96)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1823, file: !85, line: 3890, baseType: !992, size: 32, align: 32, offset: 128)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1823, file: !85, line: 3897, baseType: !1831, size: 768, align: 64, offset: 192)
!1831 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !85, line: 3858, baseType: !1832)
!1832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !85, line: 3853, size: 768, align: 64, elements: !1833)
!1833 = !{!1834, !1836}
