; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--indeo5.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--indeo5.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!845 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!846 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!847 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!848 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!849 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!850 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!851 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !14, line: 1175, size: 32, align: 32, elements: !852)
!852 = !{!853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880}
!853 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!854 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!855 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!856 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!857 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!858 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!859 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!860 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!861 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!862 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!863 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!864 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!865 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!866 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!867 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!868 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!869 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!870 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!871 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!872 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!873 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!874 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!875 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!876 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!877 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!878 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!879 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!880 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !888, line: 40, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/indeo5.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!889 = !{!890, !891, !892, !893, !894}
!890 = !DIEnumerator(name: "FRAMETYPE_INTRA", value: 0)
!891 = !DIEnumerator(name: "FRAMETYPE_INTER", value: 1)
!892 = !DIEnumerator(name: "FRAMETYPE_INTER_SCAL", value: 2)
!893 = !DIEnumerator(name: "FRAMETYPE_INTER_NOREF", value: 3)
!894 = !DIEnumerator(name: "FRAMETYPE_NULL", value: 4)
!895 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !896, line: 73, size: 32, align: 32, elements: !897)
!896 = !DIFile(filename: "libavcodec/ivi.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!897 = !{!898, !899}
!898 = !DIEnumerator(name: "IVI_MB_HUFF", value: 0)
!899 = !DIEnumerator(name: "IVI_BLK_HUFF", value: 1)
!900 = !{!901, !902, !903}
!901 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!902 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !906, line: 221, size: 32, align: 8, elements: !907)
!906 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!907 = !{!908}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !905, file: !906, line: 221, baseType: !909, size: 32, align: 32)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !910, line: 51, baseType: !902)
!910 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!911 = !{!912, !1511, !1516, !1522, !1523, !1527, !1528, !1532, !1533, !1536}
!912 = distinct !DIGlobalVariable(name: "ff_indeo5_decoder", scope: !0, file: !888, line: 685, type: !913, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_indeo5_decoder)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !915)
!915 = !{!916, !920, !921, !922, !923, !924, !933, !936, !939, !942, !947, !950, !992, !1000, !1001, !1002, !1004, !1410, !1416, !1421, !1425, !1426, !1466, !1486, !1490, !1491, !1495, !1499, !1500, !1504, !1505, !1506}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !914, file: !14, line: 3475, baseType: !917, size: 64, align: 64)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!919 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !914, file: !14, line: 3480, baseType: !917, size: 64, align: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !914, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !914, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !914, file: !14, line: 3487, baseType: !901, size: 32, align: 32, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !914, file: !14, line: 3488, baseType: !925, size: 64, align: 64, offset: 256)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !928, line: 61, baseType: !929)
!928 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !928, line: 58, size: 64, align: 32, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !929, file: !928, line: 59, baseType: !901, size: 32, align: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !929, file: !928, line: 60, baseType: !901, size: 32, align: 32, offset: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !914, file: !14, line: 3489, baseType: !934, size: 64, align: 64, offset: 320)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !914, file: !14, line: 3490, baseType: !937, size: 64, align: 64, offset: 384)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !914, file: !14, line: 3491, baseType: !940, size: 64, align: 64, offset: 448)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !914, file: !14, line: 3492, baseType: !943, size: 64, align: 64, offset: 512)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !910, line: 55, baseType: !946)
!946 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !914, file: !14, line: 3493, baseType: !948, size: 8, align: 8, offset: 576)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !910, line: 48, baseType: !949)
!949 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !914, file: !14, line: 3494, baseType: !951, size: 64, align: 64, offset: 640)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !955)
!955 = !{!956, !957, !962, !966, !967, !968, !969, !973, !979, !981, !985}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !954, file: !691, line: 72, baseType: !917, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !954, file: !691, line: 78, baseType: !958, size: 64, align: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!917, !961}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !954, file: !691, line: 85, baseType: !963, size: 64, align: 64, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !954, file: !691, line: 93, baseType: !901, size: 32, align: 32, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !954, file: !691, line: 99, baseType: !901, size: 32, align: 32, offset: 224)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !954, file: !691, line: 108, baseType: !901, size: 32, align: 32, offset: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !954, file: !691, line: 113, baseType: !970, size: 64, align: 64, offset: 320)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!961, !961, !961}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !954, file: !691, line: 123, baseType: !974, size: 64, align: 64, offset: 384)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!977, !977}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !954, file: !691, line: 130, baseType: !980, size: 32, align: 32, offset: 448)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !954, file: !691, line: 136, baseType: !982, size: 64, align: 64, offset: 512)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!980, !961}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !954, file: !691, line: 142, baseType: !986, size: 64, align: 64, offset: 576)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!901, !989, !961, !917, !901}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !914, file: !14, line: 3495, baseType: !993, size: 64, align: 64, offset: 704)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !997)
!997 = !{!998, !999}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !996, file: !14, line: 3402, baseType: !901, size: 32, align: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !996, file: !14, line: 3403, baseType: !917, size: 64, align: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !914, file: !14, line: 3507, baseType: !917, size: 64, align: 64, offset: 768)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !914, file: !14, line: 3516, baseType: !901, size: 32, align: 32, offset: 832)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !914, file: !14, line: 3517, baseType: !1003, size: 64, align: 64, offset: 896)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !914, file: !14, line: 3527, baseType: !1005, size: 64, align: 64, offset: 960)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!901, !1008}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1018, !1019, !1020, !1021, !1024, !1025, !1028, !1029, !1030, !1031, !1032, !1033, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1148, !1152, !1153, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1341, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1010, file: !14, line: 1561, baseType: !951, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1010, file: !14, line: 1562, baseType: !901, size: 32, align: 32, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1010, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1010, file: !14, line: 1565, baseType: !1016, size: 64, align: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !914)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1010, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1010, file: !14, line: 1581, baseType: !902, size: 32, align: 32, offset: 224)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1010, file: !14, line: 1583, baseType: !961, size: 64, align: 64, offset: 256)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1010, file: !14, line: 1591, baseType: !1022, size: 64, align: 64, offset: 320)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !14, line: 1532, flags: DIFlagFwdDecl)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1010, file: !14, line: 1598, baseType: !961, size: 64, align: 64, offset: 384)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1010, file: !14, line: 1606, baseType: !1026, size: 64, align: 64, offset: 448)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !910, line: 40, baseType: !1027)
!1027 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1010, file: !14, line: 1614, baseType: !901, size: 32, align: 32, offset: 512)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1010, file: !14, line: 1622, baseType: !901, size: 32, align: 32, offset: 544)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1010, file: !14, line: 1628, baseType: !901, size: 32, align: 32, offset: 576)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1010, file: !14, line: 1636, baseType: !901, size: 32, align: 32, offset: 608)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1010, file: !14, line: 1643, baseType: !901, size: 32, align: 32, offset: 640)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1010, file: !14, line: 1657, baseType: !1034, size: 64, align: 64, offset: 704)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1010, file: !14, line: 1658, baseType: !901, size: 32, align: 32, offset: 768)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1010, file: !14, line: 1679, baseType: !927, size: 64, align: 32, offset: 800)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1010, file: !14, line: 1688, baseType: !901, size: 32, align: 32, offset: 864)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1010, file: !14, line: 1712, baseType: !901, size: 32, align: 32, offset: 896)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1010, file: !14, line: 1729, baseType: !901, size: 32, align: 32, offset: 928)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1010, file: !14, line: 1729, baseType: !901, size: 32, align: 32, offset: 960)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1010, file: !14, line: 1744, baseType: !901, size: 32, align: 32, offset: 992)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1010, file: !14, line: 1744, baseType: !901, size: 32, align: 32, offset: 1024)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1010, file: !14, line: 1751, baseType: !901, size: 32, align: 32, offset: 1056)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1010, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1010, file: !14, line: 1791, baseType: !1046, size: 64, align: 64, offset: 1152)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{null, !1049, !1050, !1147, !901, !901, !901}
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1054)
!1054 = !{!1055, !1059, !1061, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1099, !1101, !1102, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1135, !1136, !1137, !1138, !1139, !1140, !1143, !1144, !1145, !1146}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1053, file: !722, line: 282, baseType: !1056, size: 512, align: 64)
!1056 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1034, size: 512, align: 64, elements: !1057)
!1057 = !{!1058}
!1058 = !DISubrange(count: 8)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1053, file: !722, line: 299, baseType: !1060, size: 256, align: 32, offset: 512)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 256, align: 32, elements: !1057)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1053, file: !722, line: 315, baseType: !1062, size: 64, align: 64, offset: 768)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1053, file: !722, line: 326, baseType: !901, size: 32, align: 32, offset: 832)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1053, file: !722, line: 326, baseType: !901, size: 32, align: 32, offset: 864)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1053, file: !722, line: 334, baseType: !901, size: 32, align: 32, offset: 896)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1053, file: !722, line: 341, baseType: !901, size: 32, align: 32, offset: 928)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1053, file: !722, line: 346, baseType: !901, size: 32, align: 32, offset: 960)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1053, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1053, file: !722, line: 356, baseType: !927, size: 64, align: 32, offset: 1024)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1053, file: !722, line: 361, baseType: !1026, size: 64, align: 64, offset: 1088)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1053, file: !722, line: 369, baseType: !1026, size: 64, align: 64, offset: 1152)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1053, file: !722, line: 377, baseType: !1026, size: 64, align: 64, offset: 1216)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1053, file: !722, line: 382, baseType: !901, size: 32, align: 32, offset: 1280)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1053, file: !722, line: 386, baseType: !901, size: 32, align: 32, offset: 1312)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1053, file: !722, line: 391, baseType: !901, size: 32, align: 32, offset: 1344)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1053, file: !722, line: 396, baseType: !961, size: 64, align: 64, offset: 1408)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1053, file: !722, line: 403, baseType: !1078, size: 512, align: 64, offset: 1472)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 512, align: 64, elements: !1057)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1053, file: !722, line: 410, baseType: !901, size: 32, align: 32, offset: 1984)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1053, file: !722, line: 415, baseType: !901, size: 32, align: 32, offset: 2016)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1053, file: !722, line: 420, baseType: !901, size: 32, align: 32, offset: 2048)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1053, file: !722, line: 425, baseType: !901, size: 32, align: 32, offset: 2080)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1053, file: !722, line: 435, baseType: !1026, size: 64, align: 64, offset: 2112)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1053, file: !722, line: 440, baseType: !901, size: 32, align: 32, offset: 2176)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1053, file: !722, line: 445, baseType: !945, size: 64, align: 64, offset: 2240)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1053, file: !722, line: 459, baseType: !1087, size: 512, align: 64, offset: 2304)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1088, size: 512, align: 64, elements: !1057)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1090, line: 94, baseType: !1091)
!1090 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1090, line: 81, size: 192, align: 64, elements: !1092)
!1092 = !{!1093, !1097, !1098}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1091, file: !1090, line: 82, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1090, line: 73, baseType: !1096)
!1096 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1090, line: 73, flags: DIFlagFwdDecl)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1091, file: !1090, line: 89, baseType: !1034, size: 64, align: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1091, file: !1090, line: 93, baseType: !901, size: 32, align: 32, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1053, file: !722, line: 473, baseType: !1100, size: 64, align: 64, offset: 2816)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1053, file: !722, line: 477, baseType: !901, size: 32, align: 32, offset: 2880)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1053, file: !722, line: 479, baseType: !1103, size: 64, align: 64, offset: 2944)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1107)
!1107 = !{!1108, !1109, !1110, !1111, !1116}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1106, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1106, file: !722, line: 203, baseType: !1034, size: 64, align: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1106, file: !722, line: 204, baseType: !901, size: 32, align: 32, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1106, file: !722, line: 205, baseType: !1112, size: 64, align: 64, offset: 192)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1114, line: 86, baseType: !1115)
!1114 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1115 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1114, line: 86, flags: DIFlagFwdDecl)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1106, file: !722, line: 206, baseType: !1088, size: 64, align: 64, offset: 256)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1053, file: !722, line: 480, baseType: !901, size: 32, align: 32, offset: 3008)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1053, file: !722, line: 505, baseType: !901, size: 32, align: 32, offset: 3040)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1053, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1053, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1053, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1053, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1053, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1053, file: !722, line: 532, baseType: !1026, size: 64, align: 64, offset: 3264)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1053, file: !722, line: 539, baseType: !1026, size: 64, align: 64, offset: 3328)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1053, file: !722, line: 547, baseType: !1026, size: 64, align: 64, offset: 3392)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1053, file: !722, line: 554, baseType: !1112, size: 64, align: 64, offset: 3456)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1053, file: !722, line: 563, baseType: !901, size: 32, align: 32, offset: 3520)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1053, file: !722, line: 572, baseType: !901, size: 32, align: 32, offset: 3552)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1053, file: !722, line: 581, baseType: !901, size: 32, align: 32, offset: 3584)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1053, file: !722, line: 588, baseType: !1132, size: 64, align: 64, offset: 3648)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !910, line: 36, baseType: !1134)
!1134 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1053, file: !722, line: 593, baseType: !901, size: 32, align: 32, offset: 3712)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1053, file: !722, line: 596, baseType: !901, size: 32, align: 32, offset: 3744)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1053, file: !722, line: 599, baseType: !1088, size: 64, align: 64, offset: 3776)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1053, file: !722, line: 605, baseType: !1088, size: 64, align: 64, offset: 3840)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1053, file: !722, line: 616, baseType: !1088, size: 64, align: 64, offset: 3904)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1053, file: !722, line: 626, baseType: !1141, size: 64, align: 64, offset: 3968)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1142, line: 216, baseType: !946)
!1142 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1053, file: !722, line: 627, baseType: !1141, size: 64, align: 64, offset: 4032)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1053, file: !722, line: 628, baseType: !1141, size: 64, align: 64, offset: 4096)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1053, file: !722, line: 629, baseType: !1141, size: 64, align: 64, offset: 4160)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1053, file: !722, line: 645, baseType: !1088, size: 64, align: 64, offset: 4224)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1010, file: !14, line: 1808, baseType: !1149, size: 64, align: 64, offset: 1216)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!473, !1049, !934}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1010, file: !14, line: 1816, baseType: !901, size: 32, align: 32, offset: 1280)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1010, file: !14, line: 1825, baseType: !1154, size: 32, align: 32, offset: 1312)
!1154 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1010, file: !14, line: 1830, baseType: !901, size: 32, align: 32, offset: 1344)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1010, file: !14, line: 1838, baseType: !1154, size: 32, align: 32, offset: 1376)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1010, file: !14, line: 1846, baseType: !901, size: 32, align: 32, offset: 1408)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1010, file: !14, line: 1851, baseType: !901, size: 32, align: 32, offset: 1440)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1010, file: !14, line: 1861, baseType: !1154, size: 32, align: 32, offset: 1472)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1010, file: !14, line: 1868, baseType: !1154, size: 32, align: 32, offset: 1504)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1010, file: !14, line: 1875, baseType: !1154, size: 32, align: 32, offset: 1536)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1010, file: !14, line: 1882, baseType: !1154, size: 32, align: 32, offset: 1568)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1010, file: !14, line: 1889, baseType: !1154, size: 32, align: 32, offset: 1600)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1010, file: !14, line: 1896, baseType: !1154, size: 32, align: 32, offset: 1632)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1010, file: !14, line: 1903, baseType: !1154, size: 32, align: 32, offset: 1664)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1010, file: !14, line: 1910, baseType: !901, size: 32, align: 32, offset: 1696)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1010, file: !14, line: 1915, baseType: !901, size: 32, align: 32, offset: 1728)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1010, file: !14, line: 1926, baseType: !1147, size: 64, align: 64, offset: 1792)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1010, file: !14, line: 1935, baseType: !927, size: 64, align: 32, offset: 1856)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1010, file: !14, line: 1942, baseType: !901, size: 32, align: 32, offset: 1920)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1010, file: !14, line: 1948, baseType: !901, size: 32, align: 32, offset: 1952)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1010, file: !14, line: 1954, baseType: !901, size: 32, align: 32, offset: 1984)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1010, file: !14, line: 1960, baseType: !901, size: 32, align: 32, offset: 2016)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1010, file: !14, line: 1984, baseType: !901, size: 32, align: 32, offset: 2048)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1010, file: !14, line: 1991, baseType: !901, size: 32, align: 32, offset: 2080)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1010, file: !14, line: 1996, baseType: !901, size: 32, align: 32, offset: 2112)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1010, file: !14, line: 2004, baseType: !901, size: 32, align: 32, offset: 2144)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1010, file: !14, line: 2011, baseType: !901, size: 32, align: 32, offset: 2176)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1010, file: !14, line: 2018, baseType: !901, size: 32, align: 32, offset: 2208)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1010, file: !14, line: 2027, baseType: !901, size: 32, align: 32, offset: 2240)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1010, file: !14, line: 2034, baseType: !901, size: 32, align: 32, offset: 2272)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1010, file: !14, line: 2044, baseType: !901, size: 32, align: 32, offset: 2304)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1010, file: !14, line: 2054, baseType: !1184, size: 64, align: 64, offset: 2368)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !910, line: 49, baseType: !1186)
!1186 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1010, file: !14, line: 2061, baseType: !1184, size: 64, align: 64, offset: 2432)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1010, file: !14, line: 2066, baseType: !901, size: 32, align: 32, offset: 2496)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1010, file: !14, line: 2070, baseType: !901, size: 32, align: 32, offset: 2528)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1010, file: !14, line: 2078, baseType: !901, size: 32, align: 32, offset: 2560)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1010, file: !14, line: 2085, baseType: !901, size: 32, align: 32, offset: 2592)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1010, file: !14, line: 2092, baseType: !901, size: 32, align: 32, offset: 2624)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1010, file: !14, line: 2099, baseType: !901, size: 32, align: 32, offset: 2656)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1010, file: !14, line: 2106, baseType: !901, size: 32, align: 32, offset: 2688)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1010, file: !14, line: 2113, baseType: !901, size: 32, align: 32, offset: 2720)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1010, file: !14, line: 2120, baseType: !901, size: 32, align: 32, offset: 2752)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1010, file: !14, line: 2125, baseType: !901, size: 32, align: 32, offset: 2784)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1010, file: !14, line: 2133, baseType: !901, size: 32, align: 32, offset: 2816)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1010, file: !14, line: 2140, baseType: !901, size: 32, align: 32, offset: 2848)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1010, file: !14, line: 2145, baseType: !901, size: 32, align: 32, offset: 2880)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1010, file: !14, line: 2153, baseType: !901, size: 32, align: 32, offset: 2912)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1010, file: !14, line: 2158, baseType: !901, size: 32, align: 32, offset: 2944)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1010, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1010, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1010, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1010, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1010, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1010, file: !14, line: 2203, baseType: !901, size: 32, align: 32, offset: 3136)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1010, file: !14, line: 2209, baseType: !822, size: 32, align: 32, offset: 3168)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1010, file: !14, line: 2212, baseType: !901, size: 32, align: 32, offset: 3200)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1010, file: !14, line: 2213, baseType: !901, size: 32, align: 32, offset: 3232)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1010, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1010, file: !14, line: 2232, baseType: !901, size: 32, align: 32, offset: 3296)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1010, file: !14, line: 2243, baseType: !901, size: 32, align: 32, offset: 3328)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1010, file: !14, line: 2249, baseType: !901, size: 32, align: 32, offset: 3360)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1010, file: !14, line: 2256, baseType: !901, size: 32, align: 32, offset: 3392)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1010, file: !14, line: 2263, baseType: !945, size: 64, align: 64, offset: 3456)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1010, file: !14, line: 2270, baseType: !945, size: 64, align: 64, offset: 3520)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1010, file: !14, line: 2277, baseType: !830, size: 32, align: 32, offset: 3584)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1010, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1010, file: !14, line: 2367, baseType: !1222, size: 64, align: 64, offset: 3648)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!901, !1049, !1225, !901}
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1010, file: !14, line: 2383, baseType: !901, size: 32, align: 32, offset: 3712)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1010, file: !14, line: 2386, baseType: !1154, size: 32, align: 32, offset: 3744)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1010, file: !14, line: 2387, baseType: !1154, size: 32, align: 32, offset: 3776)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1010, file: !14, line: 2394, baseType: !901, size: 32, align: 32, offset: 3808)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1010, file: !14, line: 2401, baseType: !901, size: 32, align: 32, offset: 3840)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1010, file: !14, line: 2408, baseType: !901, size: 32, align: 32, offset: 3872)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1010, file: !14, line: 2415, baseType: !901, size: 32, align: 32, offset: 3904)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1010, file: !14, line: 2422, baseType: !901, size: 32, align: 32, offset: 3936)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1010, file: !14, line: 2423, baseType: !1235, size: 64, align: 64, offset: 3968)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1238)
!1238 = !{!1239, !1240, !1241, !1242}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1237, file: !14, line: 827, baseType: !901, size: 32, align: 32)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1237, file: !14, line: 828, baseType: !901, size: 32, align: 32, offset: 32)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1237, file: !14, line: 829, baseType: !901, size: 32, align: 32, offset: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1237, file: !14, line: 830, baseType: !1154, size: 32, align: 32, offset: 96)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1010, file: !14, line: 2430, baseType: !1026, size: 64, align: 64, offset: 4032)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1010, file: !14, line: 2437, baseType: !1026, size: 64, align: 64, offset: 4096)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1010, file: !14, line: 2444, baseType: !1154, size: 32, align: 32, offset: 4160)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1010, file: !14, line: 2451, baseType: !1154, size: 32, align: 32, offset: 4192)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1010, file: !14, line: 2458, baseType: !901, size: 32, align: 32, offset: 4224)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1010, file: !14, line: 2469, baseType: !901, size: 32, align: 32, offset: 4256)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1010, file: !14, line: 2475, baseType: !901, size: 32, align: 32, offset: 4288)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1010, file: !14, line: 2481, baseType: !901, size: 32, align: 32, offset: 4320)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1010, file: !14, line: 2485, baseType: !901, size: 32, align: 32, offset: 4352)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1010, file: !14, line: 2489, baseType: !901, size: 32, align: 32, offset: 4384)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1010, file: !14, line: 2493, baseType: !901, size: 32, align: 32, offset: 4416)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1010, file: !14, line: 2501, baseType: !901, size: 32, align: 32, offset: 4448)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1010, file: !14, line: 2506, baseType: !901, size: 32, align: 32, offset: 4480)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1010, file: !14, line: 2510, baseType: !901, size: 32, align: 32, offset: 4512)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1010, file: !14, line: 2514, baseType: !1026, size: 64, align: 64, offset: 4544)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1010, file: !14, line: 2528, baseType: !1259, size: 64, align: 64, offset: 4608)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{null, !1049, !961, !901, !901}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1010, file: !14, line: 2534, baseType: !901, size: 32, align: 32, offset: 4672)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1010, file: !14, line: 2545, baseType: !901, size: 32, align: 32, offset: 4704)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1010, file: !14, line: 2547, baseType: !901, size: 32, align: 32, offset: 4736)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1010, file: !14, line: 2549, baseType: !901, size: 32, align: 32, offset: 4768)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1010, file: !14, line: 2551, baseType: !901, size: 32, align: 32, offset: 4800)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1010, file: !14, line: 2553, baseType: !901, size: 32, align: 32, offset: 4832)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1010, file: !14, line: 2555, baseType: !901, size: 32, align: 32, offset: 4864)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1010, file: !14, line: 2557, baseType: !901, size: 32, align: 32, offset: 4896)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1010, file: !14, line: 2559, baseType: !901, size: 32, align: 32, offset: 4928)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1010, file: !14, line: 2563, baseType: !901, size: 32, align: 32, offset: 4960)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1010, file: !14, line: 2571, baseType: !1273, size: 64, align: 64, offset: 4992)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1010, file: !14, line: 2579, baseType: !1273, size: 64, align: 64, offset: 5056)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1010, file: !14, line: 2586, baseType: !901, size: 32, align: 32, offset: 5120)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1010, file: !14, line: 2615, baseType: !901, size: 32, align: 32, offset: 5152)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1010, file: !14, line: 2627, baseType: !901, size: 32, align: 32, offset: 5184)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1010, file: !14, line: 2637, baseType: !901, size: 32, align: 32, offset: 5216)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1010, file: !14, line: 2681, baseType: !901, size: 32, align: 32, offset: 5248)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1010, file: !14, line: 2709, baseType: !1026, size: 64, align: 64, offset: 5312)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1010, file: !14, line: 2716, baseType: !1282, size: 64, align: 64, offset: 5376)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1284)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1285)
!1285 = !{!1286, !1287, !1288, !1289, !1290, !1291, !1295, !1301, !1305, !1306, !1307, !1308, !1314, !1315, !1316, !1317, !1318}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1284, file: !14, line: 3642, baseType: !917, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1284, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1284, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1284, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1284, file: !14, line: 3669, baseType: !901, size: 32, align: 32, offset: 160)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1284, file: !14, line: 3682, baseType: !1292, size: 64, align: 64, offset: 192)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{!901, !1008, !1225}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1284, file: !14, line: 3698, baseType: !1296, size: 64, align: 64, offset: 256)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!901, !1008, !1299, !909}
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1284, file: !14, line: 3712, baseType: !1302, size: 64, align: 64, offset: 320)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{!901, !1008, !901, !1299, !909}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1284, file: !14, line: 3726, baseType: !1296, size: 64, align: 64, offset: 384)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1284, file: !14, line: 3737, baseType: !1005, size: 64, align: 64, offset: 448)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1284, file: !14, line: 3746, baseType: !901, size: 32, align: 32, offset: 512)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1284, file: !14, line: 3757, baseType: !1309, size: 64, align: 64, offset: 576)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{null, !1312}
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1284, file: !14, line: 3766, baseType: !1005, size: 64, align: 64, offset: 640)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1284, file: !14, line: 3774, baseType: !1005, size: 64, align: 64, offset: 704)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1284, file: !14, line: 3780, baseType: !901, size: 32, align: 32, offset: 768)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1284, file: !14, line: 3785, baseType: !901, size: 32, align: 32, offset: 800)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1284, file: !14, line: 3795, baseType: !1319, size: 64, align: 64, offset: 832)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!901, !1008, !1088}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1010, file: !14, line: 2728, baseType: !961, size: 64, align: 64, offset: 5440)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1010, file: !14, line: 2735, baseType: !1078, size: 512, align: 64, offset: 5504)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1010, file: !14, line: 2742, baseType: !901, size: 32, align: 32, offset: 6016)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1010, file: !14, line: 2755, baseType: !901, size: 32, align: 32, offset: 6048)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1010, file: !14, line: 2776, baseType: !901, size: 32, align: 32, offset: 6080)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1010, file: !14, line: 2783, baseType: !901, size: 32, align: 32, offset: 6112)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1010, file: !14, line: 2791, baseType: !901, size: 32, align: 32, offset: 6144)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1010, file: !14, line: 2802, baseType: !1225, size: 64, align: 64, offset: 6208)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1010, file: !14, line: 2811, baseType: !901, size: 32, align: 32, offset: 6272)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1010, file: !14, line: 2821, baseType: !901, size: 32, align: 32, offset: 6304)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1010, file: !14, line: 2830, baseType: !901, size: 32, align: 32, offset: 6336)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1010, file: !14, line: 2840, baseType: !901, size: 32, align: 32, offset: 6368)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1010, file: !14, line: 2851, baseType: !1335, size: 64, align: 64, offset: 6400)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DISubroutineType(types: !1337)
!1337 = !{!901, !1049, !1338, !961, !1147, !901, !901}
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!901, !1049, !961}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1010, file: !14, line: 2871, baseType: !1342, size: 64, align: 64, offset: 6464)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!901, !1049, !1345, !961, !1147, !901}
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DISubroutineType(types: !1347)
!1347 = !{!901, !1049, !961, !901, !901}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1010, file: !14, line: 2878, baseType: !901, size: 32, align: 32, offset: 6528)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1010, file: !14, line: 2885, baseType: !901, size: 32, align: 32, offset: 6560)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1010, file: !14, line: 3005, baseType: !901, size: 32, align: 32, offset: 6592)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1010, file: !14, line: 3013, baseType: !842, size: 32, align: 32, offset: 6624)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1010, file: !14, line: 3020, baseType: !842, size: 32, align: 32, offset: 6656)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1010, file: !14, line: 3027, baseType: !842, size: 32, align: 32, offset: 6688)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1010, file: !14, line: 3037, baseType: !1034, size: 64, align: 64, offset: 6720)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1010, file: !14, line: 3038, baseType: !901, size: 32, align: 32, offset: 6784)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1010, file: !14, line: 3050, baseType: !945, size: 64, align: 64, offset: 6848)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1010, file: !14, line: 3065, baseType: !901, size: 32, align: 32, offset: 6912)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1010, file: !14, line: 3083, baseType: !901, size: 32, align: 32, offset: 6944)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1010, file: !14, line: 3092, baseType: !927, size: 64, align: 32, offset: 6976)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1010, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1010, file: !14, line: 3106, baseType: !927, size: 64, align: 32, offset: 7072)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1010, file: !14, line: 3113, baseType: !1363, size: 64, align: 64, offset: 7168)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1365)
!1365 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1366)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1367)
!1367 = !{!1368, !1369, !1370, !1371, !1372, !1373, !1376}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1366, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1366, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1366, file: !14, line: 720, baseType: !917, size: 64, align: 64, offset: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1366, file: !14, line: 724, baseType: !917, size: 64, align: 64, offset: 128)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1366, file: !14, line: 728, baseType: !901, size: 32, align: 32, offset: 192)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1366, file: !14, line: 734, baseType: !1374, size: 64, align: 64, offset: 256)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1366, file: !14, line: 739, baseType: !1377, size: 64, align: 64, offset: 320)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1010, file: !14, line: 3129, baseType: !1026, size: 64, align: 64, offset: 7232)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1010, file: !14, line: 3130, baseType: !1026, size: 64, align: 64, offset: 7296)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1010, file: !14, line: 3131, baseType: !1026, size: 64, align: 64, offset: 7360)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1010, file: !14, line: 3132, baseType: !1026, size: 64, align: 64, offset: 7424)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1010, file: !14, line: 3139, baseType: !1273, size: 64, align: 64, offset: 7488)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1010, file: !14, line: 3147, baseType: !901, size: 32, align: 32, offset: 7552)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1010, file: !14, line: 3165, baseType: !901, size: 32, align: 32, offset: 7584)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1010, file: !14, line: 3172, baseType: !901, size: 32, align: 32, offset: 7616)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1010, file: !14, line: 3180, baseType: !901, size: 32, align: 32, offset: 7648)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1010, file: !14, line: 3191, baseType: !1184, size: 64, align: 64, offset: 7680)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1010, file: !14, line: 3199, baseType: !1034, size: 64, align: 64, offset: 7744)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1010, file: !14, line: 3207, baseType: !1273, size: 64, align: 64, offset: 7808)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1010, file: !14, line: 3214, baseType: !902, size: 32, align: 32, offset: 7872)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1010, file: !14, line: 3224, baseType: !1393, size: 64, align: 64, offset: 7936)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1395)
!1395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1396)
!1396 = !{!1397, !1398, !1399}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1395, file: !14, line: 1412, baseType: !1034, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1395, file: !14, line: 1413, baseType: !901, size: 32, align: 32, offset: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1395, file: !14, line: 1414, baseType: !851, size: 32, align: 32, offset: 96)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1010, file: !14, line: 3225, baseType: !901, size: 32, align: 32, offset: 8000)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1010, file: !14, line: 3249, baseType: !1088, size: 64, align: 64, offset: 8064)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1010, file: !14, line: 3256, baseType: !901, size: 32, align: 32, offset: 8128)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1010, file: !14, line: 3271, baseType: !901, size: 32, align: 32, offset: 8160)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1010, file: !14, line: 3279, baseType: !1026, size: 64, align: 64, offset: 8192)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1010, file: !14, line: 3301, baseType: !1088, size: 64, align: 64, offset: 8256)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1010, file: !14, line: 3310, baseType: !901, size: 32, align: 32, offset: 8320)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1010, file: !14, line: 3337, baseType: !901, size: 32, align: 32, offset: 8352)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1010, file: !14, line: 3351, baseType: !901, size: 32, align: 32, offset: 8384)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1010, file: !14, line: 3359, baseType: !901, size: 32, align: 32, offset: 8416)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !914, file: !14, line: 3535, baseType: !1411, size: 64, align: 64, offset: 1024)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DISubroutineType(types: !1413)
!1413 = !{!901, !1008, !1414}
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !914, file: !14, line: 3541, baseType: !1417, size: 64, align: 64, offset: 1088)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1419)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1420)
!1420 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !14, line: 3461, flags: DIFlagFwdDecl)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !914, file: !14, line: 3549, baseType: !1422, size: 64, align: 64, offset: 1152)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{null, !1003}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !914, file: !14, line: 3551, baseType: !1005, size: 64, align: 64, offset: 1216)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !914, file: !14, line: 3552, baseType: !1427, size: 64, align: 64, offset: 1280)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{!901, !1008, !1034, !901, !1430}
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1432)
!1432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1433)
!1433 = !{!1434, !1435, !1436, !1437, !1438, !1465}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1432, file: !14, line: 3921, baseType: !1185, size: 16, align: 16)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1432, file: !14, line: 3922, baseType: !909, size: 32, align: 32, offset: 32)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1432, file: !14, line: 3923, baseType: !909, size: 32, align: 32, offset: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1432, file: !14, line: 3924, baseType: !902, size: 32, align: 32, offset: 96)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1432, file: !14, line: 3925, baseType: !1439, size: 64, align: 64, offset: 128)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1442)
!1442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1443)
!1443 = !{!1444, !1445, !1446, !1447, !1448, !1449, !1455, !1459, !1461, !1462, !1463, !1464}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1442, file: !14, line: 3886, baseType: !901, size: 32, align: 32)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1442, file: !14, line: 3887, baseType: !901, size: 32, align: 32, offset: 32)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1442, file: !14, line: 3888, baseType: !901, size: 32, align: 32, offset: 64)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1442, file: !14, line: 3889, baseType: !901, size: 32, align: 32, offset: 96)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1442, file: !14, line: 3890, baseType: !901, size: 32, align: 32, offset: 128)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1442, file: !14, line: 3897, baseType: !1450, size: 768, align: 64, offset: 192)
!1450 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1451)
!1451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1452)
!1452 = !{!1453, !1454}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1451, file: !14, line: 3855, baseType: !1056, size: 512, align: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1451, file: !14, line: 3857, baseType: !1060, size: 256, align: 32, offset: 512)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1442, file: !14, line: 3903, baseType: !1456, size: 256, align: 64, offset: 960)
!1456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1034, size: 256, align: 64, elements: !1457)
!1457 = !{!1458}
!1458 = !DISubrange(count: 4)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1442, file: !14, line: 3904, baseType: !1460, size: 128, align: 32, offset: 1216)
!1460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 128, align: 32, elements: !1457)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1442, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1442, file: !14, line: 3908, baseType: !1273, size: 64, align: 64, offset: 1408)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1442, file: !14, line: 3915, baseType: !1273, size: 64, align: 64, offset: 1472)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1442, file: !14, line: 3917, baseType: !901, size: 32, align: 32, offset: 1536)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1432, file: !14, line: 3926, baseType: !1026, size: 64, align: 64, offset: 192)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !914, file: !14, line: 3564, baseType: !1467, size: 64, align: 64, offset: 1344)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DISubroutineType(types: !1469)
!1469 = !{!901, !1008, !1470, !1050, !1147}
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1472)
!1472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1473)
!1473 = !{!1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1472, file: !14, line: 1451, baseType: !1088, size: 64, align: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1472, file: !14, line: 1461, baseType: !1026, size: 64, align: 64, offset: 64)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1472, file: !14, line: 1467, baseType: !1026, size: 64, align: 64, offset: 128)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1472, file: !14, line: 1468, baseType: !1034, size: 64, align: 64, offset: 192)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1472, file: !14, line: 1469, baseType: !901, size: 32, align: 32, offset: 256)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1472, file: !14, line: 1470, baseType: !901, size: 32, align: 32, offset: 288)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1472, file: !14, line: 1474, baseType: !901, size: 32, align: 32, offset: 320)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1472, file: !14, line: 1479, baseType: !1393, size: 64, align: 64, offset: 384)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1472, file: !14, line: 1480, baseType: !901, size: 32, align: 32, offset: 448)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1472, file: !14, line: 1486, baseType: !1026, size: 64, align: 64, offset: 512)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1472, file: !14, line: 1488, baseType: !1026, size: 64, align: 64, offset: 576)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1472, file: !14, line: 1497, baseType: !1026, size: 64, align: 64, offset: 640)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !914, file: !14, line: 3566, baseType: !1487, size: 64, align: 64, offset: 1408)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DISubroutineType(types: !1489)
!1489 = !{!901, !1008, !961, !1147, !1470}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !914, file: !14, line: 3567, baseType: !1005, size: 64, align: 64, offset: 1472)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !914, file: !14, line: 3576, baseType: !1492, size: 64, align: 64, offset: 1536)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DISubroutineType(types: !1494)
!1494 = !{!901, !1008, !1050}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !914, file: !14, line: 3577, baseType: !1496, size: 64, align: 64, offset: 1600)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{!901, !1008, !1470}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !914, file: !14, line: 3584, baseType: !1292, size: 64, align: 64, offset: 1664)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !914, file: !14, line: 3589, baseType: !1501, size: 64, align: 64, offset: 1728)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{null, !1008}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !914, file: !14, line: 3594, baseType: !901, size: 32, align: 32, offset: 1792)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !914, file: !14, line: 3600, baseType: !917, size: 64, align: 64, offset: 1856)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !914, file: !14, line: 3609, baseType: !1507, size: 64, align: 64, offset: 1920)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1510)
!1510 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1511 = distinct !DIGlobalVariable(name: "ivi5_common_pic_sizes", scope: !0, file: !1512, line: 35, type: !1513, isLocal: true, isDefinition: true, variable: [30 x i8]* @ivi5_common_pic_sizes)
!1512 = !DIFile(filename: "libavcodec/indeo5data.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1300, size: 240, align: 8, elements: !1514)
!1514 = !{!1515}
!1515 = !DISubrange(count: 30)
!1516 = distinct !DIGlobalVariable(name: "ivi5_base_quant_8x8_intra", scope: !0, file: !1512, line: 78, type: !1517, isLocal: true, isDefinition: true, variable: [5 x [64 x i16]]* @ivi5_base_quant_8x8_intra)
!1517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1518, size: 5120, align: 16, elements: !1519)
!1518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1185)
!1519 = !{!1520, !1521}
!1520 = !DISubrange(count: 5)
!1521 = !DISubrange(count: 64)
!1522 = distinct !DIGlobalVariable(name: "ivi5_base_quant_8x8_inter", scope: !0, file: !1512, line: 50, type: !1517, isLocal: true, isDefinition: true, variable: [5 x [64 x i16]]* @ivi5_base_quant_8x8_inter)
!1523 = distinct !DIGlobalVariable(name: "ivi5_scale_quant_8x8_intra", scope: !0, file: !1512, line: 133, type: !1524, isLocal: true, isDefinition: true, variable: [5 x [24 x i8]]* @ivi5_scale_quant_8x8_intra)
!1524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1300, size: 960, align: 8, elements: !1525)
!1525 = !{!1520, !1526}
!1526 = !DISubrange(count: 24)
!1527 = distinct !DIGlobalVariable(name: "ivi5_scale_quant_8x8_inter", scope: !0, file: !1512, line: 115, type: !1524, isLocal: true, isDefinition: true, variable: [5 x [24 x i8]]* @ivi5_scale_quant_8x8_inter)
!1528 = distinct !DIGlobalVariable(name: "ivi5_base_quant_4x4_intra", scope: !0, file: !1512, line: 110, type: !1529, isLocal: true, isDefinition: true, variable: [16 x i16]* @ivi5_base_quant_4x4_intra)
!1529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1518, size: 256, align: 16, elements: !1530)
!1530 = !{!1531}
!1531 = !DISubrange(count: 16)
!1532 = distinct !DIGlobalVariable(name: "ivi5_base_quant_4x4_inter", scope: !0, file: !1512, line: 106, type: !1529, isLocal: true, isDefinition: true, variable: [16 x i16]* @ivi5_base_quant_4x4_inter)
!1533 = distinct !DIGlobalVariable(name: "ivi5_scale_quant_4x4_intra", scope: !0, file: !1512, line: 156, type: !1534, isLocal: true, isDefinition: true, variable: [24 x i8]* @ivi5_scale_quant_4x4_intra)
!1534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1300, size: 192, align: 8, elements: !1535)
!1535 = !{!1526}
!1536 = distinct !DIGlobalVariable(name: "ivi5_scale_quant_4x4_inter", scope: !0, file: !1512, line: 151, type: !1534, isLocal: true, isDefinition: true, variable: [24 x i8]* @ivi5_scale_quant_4x4_inter)
!1537 = !{i32 2, !"Dwarf Version", i32 4}
!1538 = !{i32 2, !"Debug Info Version", i32 3}
!1539 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1540 = distinct !DISubprogram(name: "decode_init", scope: !888, file: !888, line: 640, type: !1006, isLocal: true, isDefinition: true, scopeLine: 641, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1541)
!1541 = !{}
!1542 = !DILocalVariable(name: "avctx", arg: 1, scope: !1540, file: !888, line: 640, type: !1008)
!1543 = !DIExpression()
!1544 = !DILocation(line: 640, column: 62, scope: !1540)
!1545 = !DILocalVariable(name: "ctx", scope: !1540, file: !888, line: 642, type: !1546)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVI45DecContext", file: !896, line: 271, baseType: !1548)
!1548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IVI45DecContext", file: !896, line: 213, size: 40256, align: 64, elements: !1549)
!1549 = !{!1550, !1560, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1598, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1755, !1759, !1763, !1767, !1771, !1772, !1773, !1774, !1775}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "gb", scope: !1548, file: !896, line: 214, baseType: !1551, size: 256, align: 64)
!1551 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1552, line: 70, baseType: !1553)
!1552 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1552, line: 61, size: 256, align: 64, elements: !1554)
!1554 = !{!1555, !1556, !1557, !1558, !1559}
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1553, file: !1552, line: 62, baseType: !1299, size: 64, align: 64)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1553, file: !1552, line: 62, baseType: !1299, size: 64, align: 64, offset: 64)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1553, file: !1552, line: 67, baseType: !901, size: 32, align: 32, offset: 128)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1553, file: !1552, line: 68, baseType: !901, size: 32, align: 32, offset: 160)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1553, file: !1552, line: 69, baseType: !901, size: 32, align: 32, offset: 192)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "rvmap_tabs", scope: !1548, file: !896, line: 215, baseType: !1561, size: 37008, align: 8, offset: 256)
!1561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1562, size: 37008, align: 8, elements: !1573)
!1562 = !DIDerivedType(tag: DW_TAG_typedef, name: "RVMapDesc", file: !896, line: 102, baseType: !1563)
!1563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RVMapDesc", file: !896, line: 97, size: 4112, align: 8, elements: !1564)
!1564 = !{!1565, !1566, !1567, !1571}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "eob_sym", scope: !1563, file: !896, line: 98, baseType: !948, size: 8, align: 8)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "esc_sym", scope: !1563, file: !896, line: 99, baseType: !948, size: 8, align: 8, offset: 8)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "runtab", scope: !1563, file: !896, line: 100, baseType: !1568, size: 2048, align: 8, offset: 16)
!1568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !948, size: 2048, align: 8, elements: !1569)
!1569 = !{!1570}
!1570 = !DISubrange(count: 256)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "valtab", scope: !1563, file: !896, line: 101, baseType: !1572, size: 2048, align: 8, offset: 2064)
!1572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1133, size: 2048, align: 8, elements: !1569)
!1573 = !{!1574}
!1574 = !DISubrange(count: 9)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !1548, file: !896, line: 217, baseType: !909, size: 32, align: 32, offset: 37280)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "frame_type", scope: !1548, file: !896, line: 218, baseType: !901, size: 32, align: 32, offset: 37312)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "prev_frame_type", scope: !1548, file: !896, line: 219, baseType: !901, size: 32, align: 32, offset: 37344)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !1548, file: !896, line: 220, baseType: !909, size: 32, align: 32, offset: 37376)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "is_scalable", scope: !1548, file: !896, line: 221, baseType: !901, size: 32, align: 32, offset: 37408)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "frame_data", scope: !1548, file: !896, line: 222, baseType: !1299, size: 64, align: 64, offset: 37440)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scal", scope: !1548, file: !896, line: 223, baseType: !901, size: 32, align: 32, offset: 37504)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1548, file: !896, line: 224, baseType: !909, size: 32, align: 32, offset: 37536)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "pic_hdr_size", scope: !1548, file: !896, line: 225, baseType: !909, size: 32, align: 32, offset: 37568)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "frame_flags", scope: !1548, file: !896, line: 226, baseType: !948, size: 8, align: 8, offset: 37600)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1548, file: !896, line: 227, baseType: !1185, size: 16, align: 16, offset: 37616)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "pic_conf", scope: !1548, file: !896, line: 229, baseType: !1587, size: 112, align: 16, offset: 37632)
!1587 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVIPicConfig", file: !896, line: 211, baseType: !1588)
!1588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IVIPicConfig", file: !896, line: 202, size: 112, align: 16, elements: !1589)
!1589 = !{!1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597}
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width", scope: !1588, file: !896, line: 203, baseType: !1185, size: 16, align: 16)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height", scope: !1588, file: !896, line: 204, baseType: !1185, size: 16, align: 16, offset: 16)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_width", scope: !1588, file: !896, line: 205, baseType: !1185, size: 16, align: 16, offset: 32)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_height", scope: !1588, file: !896, line: 206, baseType: !1185, size: 16, align: 16, offset: 48)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "tile_width", scope: !1588, file: !896, line: 207, baseType: !1185, size: 16, align: 16, offset: 64)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "tile_height", scope: !1588, file: !896, line: 208, baseType: !1185, size: 16, align: 16, offset: 80)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "luma_bands", scope: !1588, file: !896, line: 209, baseType: !948, size: 8, align: 8, offset: 96)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_bands", scope: !1588, file: !896, line: 210, baseType: !948, size: 8, align: 8, offset: 104)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1548, file: !896, line: 230, baseType: !1599, size: 384, align: 64, offset: 37760)
!1599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1600, size: 384, align: 64, elements: !1727)
!1600 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVIPlaneDesc", file: !896, line: 199, baseType: !1601)
!1601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IVIPlaneDesc", file: !896, line: 194, size: 128, align: 64, elements: !1602)
!1602 = !{!1603, !1604, !1605, !1606}
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1601, file: !896, line: 195, baseType: !1185, size: 16, align: 16)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1601, file: !896, line: 196, baseType: !1185, size: 16, align: 16, offset: 16)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "num_bands", scope: !1601, file: !896, line: 197, baseType: !948, size: 8, align: 8, offset: 32)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "bands", scope: !1601, file: !896, line: 198, baseType: !1607, size: 64, align: 64, offset: 64)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVIBandDesc", file: !896, line: 188, baseType: !1609)
!1609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IVIBandDesc", file: !896, line: 144, size: 3648, align: 64, elements: !1610)
!1610 = !{!1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1622, !1623, !1624, !1626, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1667, !1668, !1672, !1673, !1675, !1676, !1705, !1712, !1713, !1718, !1719, !1720, !1721, !1722, !1724, !1725, !1726}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !1609, file: !896, line: 145, baseType: !901, size: 32, align: 32)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "band_num", scope: !1609, file: !896, line: 146, baseType: !901, size: 32, align: 32, offset: 32)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1609, file: !896, line: 147, baseType: !901, size: 32, align: 32, offset: 64)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1609, file: !896, line: 148, baseType: !901, size: 32, align: 32, offset: 96)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "aheight", scope: !1609, file: !896, line: 149, baseType: !901, size: 32, align: 32, offset: 128)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !1609, file: !896, line: 150, baseType: !1299, size: 64, align: 64, offset: 192)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !1609, file: !896, line: 151, baseType: !901, size: 32, align: 32, offset: 256)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1609, file: !896, line: 152, baseType: !1619, size: 64, align: 64, offset: 320)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !910, line: 37, baseType: !1621)
!1621 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "ref_buf", scope: !1609, file: !896, line: 153, baseType: !1619, size: 64, align: 64, offset: 384)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_buf", scope: !1609, file: !896, line: 154, baseType: !1619, size: 64, align: 64, offset: 448)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !1609, file: !896, line: 155, baseType: !1625, size: 256, align: 64, offset: 512)
!1625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1619, size: 256, align: 64, elements: !1457)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !1609, file: !896, line: 156, baseType: !1627, size: 64, align: 64, offset: 768)
!1627 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1142, line: 149, baseType: !1027)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "is_empty", scope: !1609, file: !896, line: 157, baseType: !901, size: 32, align: 32, offset: 832)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size", scope: !1609, file: !896, line: 158, baseType: !901, size: 32, align: 32, offset: 864)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "blk_size", scope: !1609, file: !896, line: 159, baseType: !901, size: 32, align: 32, offset: 896)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "is_halfpel", scope: !1609, file: !896, line: 160, baseType: !901, size: 32, align: 32, offset: 928)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "inherit_mv", scope: !1609, file: !896, line: 161, baseType: !901, size: 32, align: 32, offset: 960)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "inherit_qdelta", scope: !1609, file: !896, line: 162, baseType: !901, size: 32, align: 32, offset: 992)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "qdelta_present", scope: !1609, file: !896, line: 163, baseType: !901, size: 32, align: 32, offset: 1024)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "quant_mat", scope: !1609, file: !896, line: 164, baseType: !901, size: 32, align: 32, offset: 1056)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "glob_quant", scope: !1609, file: !896, line: 165, baseType: !901, size: 32, align: 32, offset: 1088)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "scan", scope: !1609, file: !896, line: 166, baseType: !1299, size: 64, align: 64, offset: 1152)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "scan_size", scope: !1609, file: !896, line: 167, baseType: !901, size: 32, align: 32, offset: 1216)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "blk_vlc", scope: !1609, file: !896, line: 169, baseType: !1640, size: 512, align: 64, offset: 1280)
!1640 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVIHuffTab", file: !896, line: 71, baseType: !1641)
!1641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IVIHuffTab", file: !896, line: 63, size: 512, align: 64, elements: !1642)
!1642 = !{!1643, !1645, !1659, !1666}
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "tab_sel", scope: !1641, file: !896, line: 64, baseType: !1644, size: 32, align: 32)
!1644 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !910, line: 38, baseType: !901)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "tab", scope: !1641, file: !896, line: 66, baseType: !1646, size: 64, align: 64, offset: 64)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DIDerivedType(tag: DW_TAG_typedef, name: "VLC", file: !1648, line: 30, baseType: !1649)
!1648 = !DIFile(filename: "libavcodec/vlc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VLC", file: !1648, line: 26, size: 192, align: 64, elements: !1650)
!1650 = !{!1651, !1652, !1657, !1658}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1649, file: !1648, line: 27, baseType: !901, size: 32, align: 32)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !1649, file: !1648, line: 28, baseType: !1653, size: 64, align: 64, offset: 64)
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64, align: 64)
!1654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1620, size: 32, align: 16, elements: !1655)
!1655 = !{!1656}
!1656 = !DISubrange(count: 2)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !1649, file: !1648, line: 29, baseType: !901, size: 32, align: 32, offset: 128)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "table_allocated", scope: !1649, file: !1648, line: 29, baseType: !901, size: 32, align: 32, offset: 160)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "cust_desc", scope: !1641, file: !896, line: 69, baseType: !1660, size: 160, align: 32, offset: 128)
!1660 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVIHuffDesc", file: !896, line: 58, baseType: !1661)
!1661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IVIHuffDesc", file: !896, line: 55, size: 160, align: 32, elements: !1662)
