; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mpeg4videodec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mpeg4videodec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RLTable = type { i32, i32, [2 x i16]*, i8*, i8*, [2 x i8*], [2 x i8*], [2 x i8*], [32 x %struct.RL_VLC_ELEM*] }
%struct.RL_VLC_ELEM = type { i16, i8, i8 }
%struct.VLC = type { i32, [2 x i16]*, i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVProfile = type { i32, i8* }
%struct.AVCodecHWConfigInternal = type { %struct.AVCodecHWConfig, %struct.AVHWAccel* }
%struct.AVCodecHWConfig = type { i32, i32, i32 }

!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!909 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!910 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!911 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!912 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!913 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!914 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !57, line: 798, size: 32, align: 32, elements: !915)
!915 = !{!916, !917, !918, !919, !920, !921, !922}
!916 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!917 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!918 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!919 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!920 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!921 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!922 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!923 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OutputFormat", file: !924, line: 123, size: 32, align: 32, elements: !925)
!924 = !DIFile(filename: "libavcodec/mpegutils.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!925 = !{!926, !927, !928, !929}
!926 = !DIEnumerator(name: "FMT_MPEG1", value: 0)
!927 = !DIEnumerator(name: "FMT_H261", value: 1)
!928 = !DIEnumerator(name: "FMT_H263", value: 2)
!929 = !DIEnumerator(name: "FMT_MJPEG", value: 3)
!930 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !931, line: 37, size: 32, align: 32, elements: !932)
!931 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!932 = !{!933, !934, !935, !936, !937, !938}
!933 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!934 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!935 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!936 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!937 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!938 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!939 = !{!940, !941, !942, !950, !952, !953, !948, !955, !957}
!940 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!941 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !945, line: 221, size: 32, align: 8, elements: !946)
!945 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!946 = !{!947}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !944, file: !945, line: 221, baseType: !948, size: 32, align: 32)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !949, line: 51, baseType: !941)
!949 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !949, line: 48, baseType: !951)
!951 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !949, line: 40, baseType: !954)
!954 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !949, line: 55, baseType: !956)
!956 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!958 = !{!959, !965, !981, !985, !986, !991, !992, !996, !1000, !2655, !2663, !2664, !2665, !2666, !2709, !2714, !2716, !2720, !2724, !2726, !2727}
!959 = distinct !DIGlobalVariable(name: "done", scope: !960, file: !961, line: 3365, type: !940, isLocal: true, isDefinition: true, variable: i32* @ff_mpeg4videodec_static_init.done)
!960 = distinct !DISubprogram(name: "ff_mpeg4videodec_static_init", scope: !961, file: !961, line: 3364, type: !962, isLocal: false, isDefinition: true, scopeLine: 3364, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !964)
!961 = !DIFile(filename: "libavcodec/mpeg4videodec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!962 = !DISubroutineType(types: !963)
!963 = !{null}
!964 = !{}
!965 = distinct !DIGlobalVariable(name: "rl_vlc_table", scope: !960, file: !961, line: 3371, type: !966, isLocal: true, isDefinition: true, variable: [32 x [554 x %struct.RL_VLC_ELEM]]* @ff_mpeg4videodec_static_init.rl_vlc_table)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 567296, align: 16, elements: !978)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "RL_VLC_ELEM", file: !968, line: 36, baseType: !969)
!968 = !DIFile(filename: "libavcodec/vlc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RL_VLC_ELEM", file: !968, line: 32, size: 32, align: 16, elements: !970)
!970 = !{!971, !974, !977}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !969, file: !968, line: 33, baseType: !972, size: 16, align: 16)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !949, line: 37, baseType: !973)
!973 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !969, file: !968, line: 34, baseType: !975, size: 8, align: 8, offset: 16)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !949, line: 36, baseType: !976)
!976 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !969, file: !968, line: 35, baseType: !950, size: 8, align: 8, offset: 24)
!978 = !{!979, !980}
!979 = !DISubrange(count: 32)
!980 = !DISubrange(count: 554)
!981 = distinct !DIGlobalVariable(name: "rl_vlc_table", scope: !960, file: !961, line: 3372, type: !982, isLocal: true, isDefinition: true, variable: [32 x [1072 x %struct.RL_VLC_ELEM]]* @ff_mpeg4videodec_static_init.rl_vlc_table.54)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 1097728, align: 16, elements: !983)
!983 = !{!979, !984}
!984 = !DISubrange(count: 1072)
!985 = distinct !DIGlobalVariable(name: "rl_vlc_table", scope: !960, file: !961, line: 3373, type: !982, isLocal: true, isDefinition: true, variable: [32 x [1072 x %struct.RL_VLC_ELEM]]* @ff_mpeg4videodec_static_init.rl_vlc_table.55)
!986 = distinct !DIGlobalVariable(name: "table", scope: !960, file: !961, line: 3374, type: !987, isLocal: true, isDefinition: true, variable: [512 x [2 x i16]]* @ff_mpeg4videodec_static_init.table)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 16384, align: 16, elements: !988)
!988 = !{!989, !990}
!989 = !DISubrange(count: 512)
!990 = !DISubrange(count: 2)
!991 = distinct !DIGlobalVariable(name: "table", scope: !960, file: !961, line: 3377, type: !987, isLocal: true, isDefinition: true, variable: [512 x [2 x i16]]* @ff_mpeg4videodec_static_init.table.56)
!992 = distinct !DIGlobalVariable(name: "table", scope: !960, file: !961, line: 3380, type: !993, isLocal: true, isDefinition: true, variable: [128 x [2 x i16]]* @ff_mpeg4videodec_static_init.table.57)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 4096, align: 16, elements: !994)
!994 = !{!995, !990}
!995 = !DISubrange(count: 128)
!996 = distinct !DIGlobalVariable(name: "table", scope: !960, file: !961, line: 3383, type: !997, isLocal: true, isDefinition: true, variable: [16 x [2 x i16]]* @ff_mpeg4videodec_static_init.table.58)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 512, align: 16, elements: !998)
!998 = !{!999, !990}
!999 = !DISubrange(count: 16)
!1000 = distinct !DIGlobalVariable(name: "ff_mpeg4_decoder", scope: !0, file: !961, line: 3550, type: !1001, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_mpeg4_decoder)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !57, line: 3610, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1003)
!1003 = !{!1004, !1008, !1009, !1010, !1011, !1012, !1021, !1024, !1027, !1030, !1033, !1034, !1107, !1115, !1116, !1117, !1119, !2557, !2563, !2571, !2575, !2576, !2613, !2617, !2621, !2622, !2626, !2630, !2631, !2635, !2636, !2637}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1002, file: !57, line: 3475, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1002, file: !57, line: 3480, baseType: !1005, size: 64, align: 64, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1002, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1002, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1002, file: !57, line: 3487, baseType: !940, size: 32, align: 32, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1002, file: !57, line: 3488, baseType: !1013, size: 64, align: 64, offset: 256)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1016, line: 61, baseType: !1017)
!1016 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1016, line: 58, size: 64, align: 32, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1017, file: !1016, line: 59, baseType: !940, size: 32, align: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1017, file: !1016, line: 60, baseType: !940, size: 32, align: 32, offset: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1002, file: !57, line: 3489, baseType: !1022, size: 64, align: 64, offset: 320)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1002, file: !57, line: 3490, baseType: !1025, size: 64, align: 64, offset: 384)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1002, file: !57, line: 3491, baseType: !1028, size: 64, align: 64, offset: 448)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1002, file: !57, line: 3492, baseType: !1031, size: 64, align: 64, offset: 512)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1002, file: !57, line: 3493, baseType: !950, size: 8, align: 8, offset: 576)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1002, file: !57, line: 3494, baseType: !1035, size: 64, align: 64, offset: 640)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !1039)
!1039 = !{!1040, !1041, !1045, !1066, !1067, !1068, !1069, !1073, !1079, !1081, !1085}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1038, file: !26, line: 72, baseType: !1005, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1038, file: !26, line: 78, baseType: !1042, size: 64, align: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!1005, !952}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1038, file: !26, line: 85, baseType: !1046, size: 64, align: 64, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1048)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !1049)
!1049 = !{!1050, !1051, !1052, !1053, !1054, !1062, !1063, !1064, !1065}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1048, file: !4, line: 247, baseType: !1005, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1048, file: !4, line: 253, baseType: !1005, size: 64, align: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1048, file: !4, line: 259, baseType: !940, size: 32, align: 32, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1048, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1048, file: !4, line: 271, baseType: !1055, size: 64, align: 64, offset: 192)
!1055 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1048, file: !4, line: 265, size: 64, align: 64, elements: !1056)
!1056 = !{!1057, !1058, !1060, !1061}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1055, file: !4, line: 266, baseType: !953, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1055, file: !4, line: 267, baseType: !1059, size: 64, align: 64)
!1059 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1055, file: !4, line: 268, baseType: !1005, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1055, file: !4, line: 270, baseType: !1015, size: 64, align: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1048, file: !4, line: 272, baseType: !1059, size: 64, align: 64, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1048, file: !4, line: 273, baseType: !1059, size: 64, align: 64, offset: 320)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1048, file: !4, line: 275, baseType: !940, size: 32, align: 32, offset: 384)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1048, file: !4, line: 300, baseType: !1005, size: 64, align: 64, offset: 448)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1038, file: !26, line: 93, baseType: !940, size: 32, align: 32, offset: 192)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1038, file: !26, line: 99, baseType: !940, size: 32, align: 32, offset: 224)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1038, file: !26, line: 108, baseType: !940, size: 32, align: 32, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1038, file: !26, line: 113, baseType: !1070, size: 64, align: 64, offset: 320)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!952, !952, !952}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1038, file: !26, line: 123, baseType: !1074, size: 64, align: 64, offset: 384)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!1077, !1077}
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1038)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1038, file: !26, line: 130, baseType: !1080, size: 32, align: 32, offset: 448)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1038, file: !26, line: 136, baseType: !1082, size: 64, align: 64, offset: 512)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!1080, !952}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1038, file: !26, line: 142, baseType: !1086, size: 64, align: 64, offset: 576)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!940, !1089, !952, !1005, !940}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1092)
!1092 = !{!1093, !1105, !1106}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1091, file: !4, line: 360, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1097)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1098)
!1098 = !{!1099, !1100, !1101, !1102, !1103, !1104}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1097, file: !4, line: 307, baseType: !1005, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1097, file: !4, line: 313, baseType: !1059, size: 64, align: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1097, file: !4, line: 313, baseType: !1059, size: 64, align: 64, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1097, file: !4, line: 318, baseType: !1059, size: 64, align: 64, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1097, file: !4, line: 318, baseType: !1059, size: 64, align: 64, offset: 256)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1097, file: !4, line: 323, baseType: !940, size: 32, align: 32, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1091, file: !4, line: 364, baseType: !940, size: 32, align: 32, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1091, file: !4, line: 368, baseType: !940, size: 32, align: 32, offset: 96)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1002, file: !57, line: 3495, baseType: !1108, size: 64, align: 64, offset: 704)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1110)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1112)
!1112 = !{!1113, !1114}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1111, file: !57, line: 3402, baseType: !940, size: 32, align: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1111, file: !57, line: 3403, baseType: !1005, size: 64, align: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1002, file: !57, line: 3507, baseType: !1005, size: 64, align: 64, offset: 768)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1002, file: !57, line: 3516, baseType: !940, size: 32, align: 32, offset: 832)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1002, file: !57, line: 3517, baseType: !1118, size: 64, align: 64, offset: 896)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1002, file: !57, line: 3527, baseType: !1120, size: 64, align: 64, offset: 960)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!940, !1123}
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1125)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1126)
!1126 = !{!1127, !1128, !1129, !1130, !1133, !1134, !1135, !1136, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1413, !1417, !1418, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !2476, !2477, !2478, !2479, !2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488, !2495, !2502, !2503, !2504, !2505, !2506, !2507, !2508, !2509, !2510, !2511, !2512, !2513, !2514, !2515, !2516, !2533, !2534, !2535, !2536, !2537, !2538, !2539, !2540, !2541, !2542, !2543, !2544, !2545, !2546, !2547, !2548, !2549, !2550, !2551, !2552, !2553, !2554, !2555, !2556}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1125, file: !57, line: 1561, baseType: !1035, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1125, file: !57, line: 1562, baseType: !940, size: 32, align: 32, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1125, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1125, file: !57, line: 1565, baseType: !1131, size: 64, align: 64, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1125, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1125, file: !57, line: 1581, baseType: !941, size: 32, align: 32, offset: 224)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1125, file: !57, line: 1583, baseType: !952, size: 64, align: 64, offset: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1125, file: !57, line: 1591, baseType: !1137, size: 64, align: 64, offset: 320)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1139, line: 129, size: 1664, align: 64, elements: !1140)
!1139 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1140 = !{!1141, !1142, !1143, !1144, !1239, !1260, !1261, !1290, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1138, file: !1139, line: 136, baseType: !940, size: 32, align: 32)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1138, file: !1139, line: 151, baseType: !940, size: 32, align: 32, offset: 32)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1138, file: !1139, line: 157, baseType: !940, size: 32, align: 32, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1138, file: !1139, line: 159, baseType: !1145, size: 64, align: 64, offset: 128)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1147)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1148)
!1148 = !{!1149, !1153, !1155, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1193, !1195, !1196, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1227, !1228, !1229, !1230, !1231, !1232, !1235, !1236, !1237, !1238}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1147, file: !780, line: 282, baseType: !1150, size: 512, align: 64)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 512, align: 64, elements: !1151)
!1151 = !{!1152}
!1152 = !DISubrange(count: 8)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1147, file: !780, line: 299, baseType: !1154, size: 256, align: 32, offset: 512)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !940, size: 256, align: 32, elements: !1151)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1147, file: !780, line: 315, baseType: !1156, size: 64, align: 64, offset: 768)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1147, file: !780, line: 326, baseType: !940, size: 32, align: 32, offset: 832)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1147, file: !780, line: 326, baseType: !940, size: 32, align: 32, offset: 864)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1147, file: !780, line: 334, baseType: !940, size: 32, align: 32, offset: 896)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1147, file: !780, line: 341, baseType: !940, size: 32, align: 32, offset: 928)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1147, file: !780, line: 346, baseType: !940, size: 32, align: 32, offset: 960)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1147, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1147, file: !780, line: 356, baseType: !1015, size: 64, align: 32, offset: 1024)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1147, file: !780, line: 361, baseType: !953, size: 64, align: 64, offset: 1088)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1147, file: !780, line: 369, baseType: !953, size: 64, align: 64, offset: 1152)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1147, file: !780, line: 377, baseType: !953, size: 64, align: 64, offset: 1216)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1147, file: !780, line: 382, baseType: !940, size: 32, align: 32, offset: 1280)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1147, file: !780, line: 386, baseType: !940, size: 32, align: 32, offset: 1312)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1147, file: !780, line: 391, baseType: !940, size: 32, align: 32, offset: 1344)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1147, file: !780, line: 396, baseType: !952, size: 64, align: 64, offset: 1408)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1147, file: !780, line: 403, baseType: !1172, size: 512, align: 64, offset: 1472)
!1172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 512, align: 64, elements: !1151)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1147, file: !780, line: 410, baseType: !940, size: 32, align: 32, offset: 1984)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1147, file: !780, line: 415, baseType: !940, size: 32, align: 32, offset: 2016)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1147, file: !780, line: 420, baseType: !940, size: 32, align: 32, offset: 2048)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1147, file: !780, line: 425, baseType: !940, size: 32, align: 32, offset: 2080)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1147, file: !780, line: 435, baseType: !953, size: 64, align: 64, offset: 2112)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1147, file: !780, line: 440, baseType: !940, size: 32, align: 32, offset: 2176)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1147, file: !780, line: 445, baseType: !955, size: 64, align: 64, offset: 2240)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1147, file: !780, line: 459, baseType: !1181, size: 512, align: 64, offset: 2304)
!1181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1182, size: 512, align: 64, elements: !1151)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1184, line: 94, baseType: !1185)
!1184 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1184, line: 81, size: 192, align: 64, elements: !1186)
!1186 = !{!1187, !1191, !1192}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1185, file: !1184, line: 82, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1184, line: 73, baseType: !1190)
!1190 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1184, line: 73, flags: DIFlagFwdDecl)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1185, file: !1184, line: 89, baseType: !957, size: 64, align: 64, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1185, file: !1184, line: 93, baseType: !940, size: 32, align: 32, offset: 128)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1147, file: !780, line: 473, baseType: !1194, size: 64, align: 64, offset: 2816)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1147, file: !780, line: 477, baseType: !940, size: 32, align: 32, offset: 2880)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1147, file: !780, line: 479, baseType: !1197, size: 64, align: 64, offset: 2944)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1200)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1201)
!1201 = !{!1202, !1203, !1204, !1205, !1210}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1200, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1200, file: !780, line: 203, baseType: !957, size: 64, align: 64, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1200, file: !780, line: 204, baseType: !940, size: 32, align: 32, offset: 128)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1200, file: !780, line: 205, baseType: !1206, size: 64, align: 64, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1208, line: 86, baseType: !1209)
!1208 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1209 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1208, line: 86, flags: DIFlagFwdDecl)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1200, file: !780, line: 206, baseType: !1182, size: 64, align: 64, offset: 256)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1147, file: !780, line: 480, baseType: !940, size: 32, align: 32, offset: 3008)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1147, file: !780, line: 505, baseType: !940, size: 32, align: 32, offset: 3040)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1147, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1147, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1147, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1147, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1147, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1147, file: !780, line: 532, baseType: !953, size: 64, align: 64, offset: 3264)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1147, file: !780, line: 539, baseType: !953, size: 64, align: 64, offset: 3328)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1147, file: !780, line: 547, baseType: !953, size: 64, align: 64, offset: 3392)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1147, file: !780, line: 554, baseType: !1206, size: 64, align: 64, offset: 3456)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1147, file: !780, line: 563, baseType: !940, size: 32, align: 32, offset: 3520)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1147, file: !780, line: 572, baseType: !940, size: 32, align: 32, offset: 3552)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1147, file: !780, line: 581, baseType: !940, size: 32, align: 32, offset: 3584)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1147, file: !780, line: 588, baseType: !1226, size: 64, align: 64, offset: 3648)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1147, file: !780, line: 593, baseType: !940, size: 32, align: 32, offset: 3712)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1147, file: !780, line: 596, baseType: !940, size: 32, align: 32, offset: 3744)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1147, file: !780, line: 599, baseType: !1182, size: 64, align: 64, offset: 3776)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1147, file: !780, line: 605, baseType: !1182, size: 64, align: 64, offset: 3840)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1147, file: !780, line: 616, baseType: !1182, size: 64, align: 64, offset: 3904)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1147, file: !780, line: 626, baseType: !1233, size: 64, align: 64, offset: 3968)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1234, line: 216, baseType: !956)
!1234 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1147, file: !780, line: 627, baseType: !1233, size: 64, align: 64, offset: 4032)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1147, file: !780, line: 628, baseType: !1233, size: 64, align: 64, offset: 4096)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1147, file: !780, line: 629, baseType: !1233, size: 64, align: 64, offset: 4160)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1147, file: !780, line: 645, baseType: !1182, size: 64, align: 64, offset: 4224)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1138, file: !1139, line: 161, baseType: !1240, size: 64, align: 64, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1139, line: 117, baseType: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1139, line: 100, size: 832, align: 64, elements: !1243)
!1243 = !{!1244, !1251, !1252, !1253, !1254, !1255, !1257, !1258, !1259}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1242, file: !1139, line: 105, baseType: !1245, size: 256, align: 64)
!1245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1246, size: 256, align: 64, elements: !1249)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1184, line: 238, baseType: !1248)
!1248 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1184, line: 238, flags: DIFlagFwdDecl)
!1249 = !{!1250}
!1250 = !DISubrange(count: 4)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1242, file: !1139, line: 110, baseType: !940, size: 32, align: 32, offset: 256)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1242, file: !1139, line: 111, baseType: !940, size: 32, align: 32, offset: 288)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1242, file: !1139, line: 111, baseType: !940, size: 32, align: 32, offset: 320)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1242, file: !1139, line: 112, baseType: !1154, size: 256, align: 32, offset: 352)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1242, file: !1139, line: 113, baseType: !1256, size: 128, align: 32, offset: 608)
!1256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !940, size: 128, align: 32, elements: !1249)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1242, file: !1139, line: 114, baseType: !940, size: 32, align: 32, offset: 736)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1242, file: !1139, line: 115, baseType: !940, size: 32, align: 32, offset: 768)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1242, file: !1139, line: 116, baseType: !940, size: 32, align: 32, offset: 800)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1138, file: !1139, line: 163, baseType: !952, size: 64, align: 64, offset: 256)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1138, file: !1139, line: 165, baseType: !1262, size: 128, align: 64, offset: 320)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1139, line: 122, baseType: !1263)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1139, line: 119, size: 128, align: 64, elements: !1264)
!1264 = !{!1265, !1289}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1263, file: !1139, line: 120, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1269)
!1269 = !{!1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1285, !1286, !1287, !1288}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1268, file: !57, line: 1451, baseType: !1182, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1268, file: !57, line: 1461, baseType: !953, size: 64, align: 64, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1268, file: !57, line: 1467, baseType: !953, size: 64, align: 64, offset: 128)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1268, file: !57, line: 1468, baseType: !957, size: 64, align: 64, offset: 192)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1268, file: !57, line: 1469, baseType: !940, size: 32, align: 32, offset: 256)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1268, file: !57, line: 1470, baseType: !940, size: 32, align: 32, offset: 288)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1268, file: !57, line: 1474, baseType: !940, size: 32, align: 32, offset: 320)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1268, file: !57, line: 1479, baseType: !1278, size: 64, align: 64, offset: 384)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1280)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1281)
!1281 = !{!1282, !1283, !1284}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1280, file: !57, line: 1412, baseType: !957, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1280, file: !57, line: 1413, baseType: !940, size: 32, align: 32, offset: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1280, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1268, file: !57, line: 1480, baseType: !940, size: 32, align: 32, offset: 448)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1268, file: !57, line: 1486, baseType: !953, size: 64, align: 64, offset: 512)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1268, file: !57, line: 1488, baseType: !953, size: 64, align: 64, offset: 576)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1268, file: !57, line: 1497, baseType: !953, size: 64, align: 64, offset: 640)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1263, file: !1139, line: 121, baseType: !1145, size: 64, align: 64, offset: 64)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1138, file: !1139, line: 166, baseType: !1291, size: 128, align: 64, offset: 448)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1139, line: 127, baseType: !1292)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1139, line: 124, size: 128, align: 64, elements: !1293)
!1293 = !{!1294, !1367}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1292, file: !1139, line: 125, baseType: !1295, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1298)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1299)
!1299 = !{!1300, !1301, !1325, !1329, !1330, !1364, !1365, !1366}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1298, file: !57, line: 5751, baseType: !1035, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1298, file: !57, line: 5756, baseType: !1302, size: 64, align: 64, offset: 64)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1304)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1305)
!1305 = !{!1306, !1307, !1310, !1311, !1312, !1316, !1320, !1324}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1304, file: !57, line: 5797, baseType: !1005, size: 64, align: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1304, file: !57, line: 5804, baseType: !1308, size: 64, align: 64, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1304, file: !57, line: 5815, baseType: !1035, size: 64, align: 64, offset: 128)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1304, file: !57, line: 5825, baseType: !940, size: 32, align: 32, offset: 192)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1304, file: !57, line: 5826, baseType: !1313, size: 64, align: 64, offset: 256)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!940, !1296}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1304, file: !57, line: 5827, baseType: !1317, size: 64, align: 64, offset: 320)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!940, !1296, !1266}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1304, file: !57, line: 5828, baseType: !1321, size: 64, align: 64, offset: 384)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DISubroutineType(types: !1323)
!1323 = !{null, !1296}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1304, file: !57, line: 5829, baseType: !1321, size: 64, align: 64, offset: 448)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1298, file: !57, line: 5762, baseType: !1326, size: 64, align: 64, offset: 128)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1328)
!1328 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1298, file: !57, line: 5768, baseType: !952, size: 64, align: 64, offset: 192)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1298, file: !57, line: 5775, baseType: !1331, size: 64, align: 64, offset: 256)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1333)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1334)
!1334 = !{!1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1333, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1333, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1333, file: !57, line: 3948, baseType: !948, size: 32, align: 32, offset: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1333, file: !57, line: 3958, baseType: !957, size: 64, align: 64, offset: 128)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1333, file: !57, line: 3962, baseType: !940, size: 32, align: 32, offset: 192)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1333, file: !57, line: 3968, baseType: !940, size: 32, align: 32, offset: 224)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1333, file: !57, line: 3973, baseType: !953, size: 64, align: 64, offset: 256)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1333, file: !57, line: 3986, baseType: !940, size: 32, align: 32, offset: 320)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1333, file: !57, line: 3999, baseType: !940, size: 32, align: 32, offset: 352)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1333, file: !57, line: 4004, baseType: !940, size: 32, align: 32, offset: 384)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1333, file: !57, line: 4005, baseType: !940, size: 32, align: 32, offset: 416)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1333, file: !57, line: 4010, baseType: !940, size: 32, align: 32, offset: 448)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1333, file: !57, line: 4011, baseType: !940, size: 32, align: 32, offset: 480)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1333, file: !57, line: 4020, baseType: !1015, size: 64, align: 32, offset: 512)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1333, file: !57, line: 4025, baseType: !894, size: 32, align: 32, offset: 576)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1333, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1333, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1333, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1333, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1333, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1333, file: !57, line: 4039, baseType: !940, size: 32, align: 32, offset: 768)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1333, file: !57, line: 4046, baseType: !955, size: 64, align: 64, offset: 832)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1333, file: !57, line: 4050, baseType: !940, size: 32, align: 32, offset: 896)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1333, file: !57, line: 4054, baseType: !940, size: 32, align: 32, offset: 928)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1333, file: !57, line: 4061, baseType: !940, size: 32, align: 32, offset: 960)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1333, file: !57, line: 4065, baseType: !940, size: 32, align: 32, offset: 992)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1333, file: !57, line: 4073, baseType: !940, size: 32, align: 32, offset: 1024)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1333, file: !57, line: 4080, baseType: !940, size: 32, align: 32, offset: 1056)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1333, file: !57, line: 4084, baseType: !940, size: 32, align: 32, offset: 1088)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1298, file: !57, line: 5781, baseType: !1331, size: 64, align: 64, offset: 320)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1298, file: !57, line: 5787, baseType: !1015, size: 64, align: 32, offset: 384)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1298, file: !57, line: 5793, baseType: !1015, size: 64, align: 32, offset: 448)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1292, file: !1139, line: 126, baseType: !940, size: 32, align: 32, offset: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1138, file: !1139, line: 172, baseType: !1266, size: 64, align: 64, offset: 576)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1138, file: !1139, line: 177, baseType: !957, size: 64, align: 64, offset: 640)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1138, file: !1139, line: 178, baseType: !941, size: 32, align: 32, offset: 704)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1138, file: !1139, line: 180, baseType: !952, size: 64, align: 64, offset: 768)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1138, file: !1139, line: 185, baseType: !940, size: 32, align: 32, offset: 832)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1138, file: !1139, line: 190, baseType: !952, size: 64, align: 64, offset: 896)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1138, file: !1139, line: 195, baseType: !940, size: 32, align: 32, offset: 960)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1138, file: !1139, line: 200, baseType: !1266, size: 64, align: 64, offset: 1024)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1138, file: !1139, line: 201, baseType: !940, size: 32, align: 32, offset: 1088)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1138, file: !1139, line: 202, baseType: !1145, size: 64, align: 64, offset: 1152)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1138, file: !1139, line: 203, baseType: !940, size: 32, align: 32, offset: 1216)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1138, file: !1139, line: 205, baseType: !940, size: 32, align: 32, offset: 1248)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1138, file: !1139, line: 206, baseType: !940, size: 32, align: 32, offset: 1280)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1138, file: !1139, line: 209, baseType: !1233, size: 64, align: 64, offset: 1344)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1138, file: !1139, line: 212, baseType: !1233, size: 64, align: 64, offset: 1408)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1138, file: !1139, line: 213, baseType: !1145, size: 64, align: 64, offset: 1472)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1138, file: !1139, line: 215, baseType: !940, size: 32, align: 32, offset: 1536)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1138, file: !1139, line: 217, baseType: !940, size: 32, align: 32, offset: 1568)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1138, file: !1139, line: 220, baseType: !940, size: 32, align: 32, offset: 1600)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1125, file: !57, line: 1598, baseType: !952, size: 64, align: 64, offset: 384)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1125, file: !57, line: 1606, baseType: !953, size: 64, align: 64, offset: 448)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1125, file: !57, line: 1614, baseType: !940, size: 32, align: 32, offset: 512)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1125, file: !57, line: 1622, baseType: !940, size: 32, align: 32, offset: 544)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1125, file: !57, line: 1628, baseType: !940, size: 32, align: 32, offset: 576)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1125, file: !57, line: 1636, baseType: !940, size: 32, align: 32, offset: 608)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1125, file: !57, line: 1643, baseType: !940, size: 32, align: 32, offset: 640)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1125, file: !57, line: 1657, baseType: !957, size: 64, align: 64, offset: 704)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1125, file: !57, line: 1658, baseType: !940, size: 32, align: 32, offset: 768)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1125, file: !57, line: 1679, baseType: !1015, size: 64, align: 32, offset: 800)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1125, file: !57, line: 1688, baseType: !940, size: 32, align: 32, offset: 864)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1125, file: !57, line: 1712, baseType: !940, size: 32, align: 32, offset: 896)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1125, file: !57, line: 1729, baseType: !940, size: 32, align: 32, offset: 928)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1125, file: !57, line: 1729, baseType: !940, size: 32, align: 32, offset: 960)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1125, file: !57, line: 1744, baseType: !940, size: 32, align: 32, offset: 992)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1125, file: !57, line: 1744, baseType: !940, size: 32, align: 32, offset: 1024)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1125, file: !57, line: 1751, baseType: !940, size: 32, align: 32, offset: 1056)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1125, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1125, file: !57, line: 1791, baseType: !1406, size: 64, align: 64, offset: 1152)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DISubroutineType(types: !1408)
!1408 = !{null, !1409, !1410, !1412, !940, !940, !940}
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1146)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1125, file: !57, line: 1808, baseType: !1414, size: 64, align: 64, offset: 1216)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{!516, !1409, !1022}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1125, file: !57, line: 1816, baseType: !940, size: 32, align: 32, offset: 1280)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1125, file: !57, line: 1825, baseType: !1419, size: 32, align: 32, offset: 1312)
!1419 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1125, file: !57, line: 1830, baseType: !940, size: 32, align: 32, offset: 1344)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1125, file: !57, line: 1838, baseType: !1419, size: 32, align: 32, offset: 1376)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1125, file: !57, line: 1846, baseType: !940, size: 32, align: 32, offset: 1408)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1125, file: !57, line: 1851, baseType: !940, size: 32, align: 32, offset: 1440)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1125, file: !57, line: 1861, baseType: !1419, size: 32, align: 32, offset: 1472)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1125, file: !57, line: 1868, baseType: !1419, size: 32, align: 32, offset: 1504)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1125, file: !57, line: 1875, baseType: !1419, size: 32, align: 32, offset: 1536)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1125, file: !57, line: 1882, baseType: !1419, size: 32, align: 32, offset: 1568)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1125, file: !57, line: 1889, baseType: !1419, size: 32, align: 32, offset: 1600)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1125, file: !57, line: 1896, baseType: !1419, size: 32, align: 32, offset: 1632)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1125, file: !57, line: 1903, baseType: !1419, size: 32, align: 32, offset: 1664)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1125, file: !57, line: 1910, baseType: !940, size: 32, align: 32, offset: 1696)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1125, file: !57, line: 1915, baseType: !940, size: 32, align: 32, offset: 1728)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1125, file: !57, line: 1926, baseType: !1412, size: 64, align: 64, offset: 1792)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1125, file: !57, line: 1935, baseType: !1015, size: 64, align: 32, offset: 1856)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1125, file: !57, line: 1942, baseType: !940, size: 32, align: 32, offset: 1920)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1125, file: !57, line: 1948, baseType: !940, size: 32, align: 32, offset: 1952)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1125, file: !57, line: 1954, baseType: !940, size: 32, align: 32, offset: 1984)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1125, file: !57, line: 1960, baseType: !940, size: 32, align: 32, offset: 2016)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1125, file: !57, line: 1984, baseType: !940, size: 32, align: 32, offset: 2048)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1125, file: !57, line: 1991, baseType: !940, size: 32, align: 32, offset: 2080)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1125, file: !57, line: 1996, baseType: !940, size: 32, align: 32, offset: 2112)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1125, file: !57, line: 2004, baseType: !940, size: 32, align: 32, offset: 2144)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1125, file: !57, line: 2011, baseType: !940, size: 32, align: 32, offset: 2176)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1125, file: !57, line: 2018, baseType: !940, size: 32, align: 32, offset: 2208)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1125, file: !57, line: 2027, baseType: !940, size: 32, align: 32, offset: 2240)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1125, file: !57, line: 2034, baseType: !940, size: 32, align: 32, offset: 2272)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1125, file: !57, line: 2044, baseType: !940, size: 32, align: 32, offset: 2304)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1125, file: !57, line: 2054, baseType: !1449, size: 64, align: 64, offset: 2368)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !949, line: 49, baseType: !1451)
!1451 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1125, file: !57, line: 2061, baseType: !1449, size: 64, align: 64, offset: 2432)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1125, file: !57, line: 2066, baseType: !940, size: 32, align: 32, offset: 2496)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1125, file: !57, line: 2070, baseType: !940, size: 32, align: 32, offset: 2528)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1125, file: !57, line: 2078, baseType: !940, size: 32, align: 32, offset: 2560)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1125, file: !57, line: 2085, baseType: !940, size: 32, align: 32, offset: 2592)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1125, file: !57, line: 2092, baseType: !940, size: 32, align: 32, offset: 2624)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1125, file: !57, line: 2099, baseType: !940, size: 32, align: 32, offset: 2656)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1125, file: !57, line: 2106, baseType: !940, size: 32, align: 32, offset: 2688)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1125, file: !57, line: 2113, baseType: !940, size: 32, align: 32, offset: 2720)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1125, file: !57, line: 2120, baseType: !940, size: 32, align: 32, offset: 2752)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1125, file: !57, line: 2125, baseType: !940, size: 32, align: 32, offset: 2784)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1125, file: !57, line: 2133, baseType: !940, size: 32, align: 32, offset: 2816)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1125, file: !57, line: 2140, baseType: !940, size: 32, align: 32, offset: 2848)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1125, file: !57, line: 2145, baseType: !940, size: 32, align: 32, offset: 2880)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1125, file: !57, line: 2153, baseType: !940, size: 32, align: 32, offset: 2912)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1125, file: !57, line: 2158, baseType: !940, size: 32, align: 32, offset: 2944)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1125, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1125, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1125, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1125, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1125, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1125, file: !57, line: 2203, baseType: !940, size: 32, align: 32, offset: 3136)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1125, file: !57, line: 2209, baseType: !894, size: 32, align: 32, offset: 3168)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1125, file: !57, line: 2212, baseType: !940, size: 32, align: 32, offset: 3200)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1125, file: !57, line: 2213, baseType: !940, size: 32, align: 32, offset: 3232)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1125, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1125, file: !57, line: 2232, baseType: !940, size: 32, align: 32, offset: 3296)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1125, file: !57, line: 2243, baseType: !940, size: 32, align: 32, offset: 3328)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1125, file: !57, line: 2249, baseType: !940, size: 32, align: 32, offset: 3360)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1125, file: !57, line: 2256, baseType: !940, size: 32, align: 32, offset: 3392)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1125, file: !57, line: 2263, baseType: !955, size: 64, align: 64, offset: 3456)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1125, file: !57, line: 2270, baseType: !955, size: 64, align: 64, offset: 3520)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1125, file: !57, line: 2277, baseType: !902, size: 32, align: 32, offset: 3584)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1125, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1125, file: !57, line: 2367, baseType: !1487, size: 64, align: 64, offset: 3648)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DISubroutineType(types: !1489)
!1489 = !{!940, !1409, !1145, !940}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1125, file: !57, line: 2383, baseType: !940, size: 32, align: 32, offset: 3712)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1125, file: !57, line: 2386, baseType: !1419, size: 32, align: 32, offset: 3744)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1125, file: !57, line: 2387, baseType: !1419, size: 32, align: 32, offset: 3776)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1125, file: !57, line: 2394, baseType: !940, size: 32, align: 32, offset: 3808)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1125, file: !57, line: 2401, baseType: !940, size: 32, align: 32, offset: 3840)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1125, file: !57, line: 2408, baseType: !940, size: 32, align: 32, offset: 3872)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1125, file: !57, line: 2415, baseType: !940, size: 32, align: 32, offset: 3904)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1125, file: !57, line: 2422, baseType: !940, size: 32, align: 32, offset: 3936)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1125, file: !57, line: 2423, baseType: !1499, size: 64, align: 64, offset: 3968)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1501)
!1501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1502)
!1502 = !{!1503, !1504, !1505, !1506}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1501, file: !57, line: 827, baseType: !940, size: 32, align: 32)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1501, file: !57, line: 828, baseType: !940, size: 32, align: 32, offset: 32)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1501, file: !57, line: 829, baseType: !940, size: 32, align: 32, offset: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1501, file: !57, line: 830, baseType: !1419, size: 32, align: 32, offset: 96)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1125, file: !57, line: 2430, baseType: !953, size: 64, align: 64, offset: 4032)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1125, file: !57, line: 2437, baseType: !953, size: 64, align: 64, offset: 4096)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1125, file: !57, line: 2444, baseType: !1419, size: 32, align: 32, offset: 4160)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1125, file: !57, line: 2451, baseType: !1419, size: 32, align: 32, offset: 4192)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1125, file: !57, line: 2458, baseType: !940, size: 32, align: 32, offset: 4224)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1125, file: !57, line: 2469, baseType: !940, size: 32, align: 32, offset: 4256)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1125, file: !57, line: 2475, baseType: !940, size: 32, align: 32, offset: 4288)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1125, file: !57, line: 2481, baseType: !940, size: 32, align: 32, offset: 4320)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1125, file: !57, line: 2485, baseType: !940, size: 32, align: 32, offset: 4352)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1125, file: !57, line: 2489, baseType: !940, size: 32, align: 32, offset: 4384)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1125, file: !57, line: 2493, baseType: !940, size: 32, align: 32, offset: 4416)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1125, file: !57, line: 2501, baseType: !940, size: 32, align: 32, offset: 4448)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1125, file: !57, line: 2506, baseType: !940, size: 32, align: 32, offset: 4480)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1125, file: !57, line: 2510, baseType: !940, size: 32, align: 32, offset: 4512)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1125, file: !57, line: 2514, baseType: !953, size: 64, align: 64, offset: 4544)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1125, file: !57, line: 2528, baseType: !1523, size: 64, align: 64, offset: 4608)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DISubroutineType(types: !1525)
!1525 = !{null, !1409, !952, !940, !940}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1125, file: !57, line: 2534, baseType: !940, size: 32, align: 32, offset: 4672)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1125, file: !57, line: 2545, baseType: !940, size: 32, align: 32, offset: 4704)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1125, file: !57, line: 2547, baseType: !940, size: 32, align: 32, offset: 4736)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1125, file: !57, line: 2549, baseType: !940, size: 32, align: 32, offset: 4768)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1125, file: !57, line: 2551, baseType: !940, size: 32, align: 32, offset: 4800)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1125, file: !57, line: 2553, baseType: !940, size: 32, align: 32, offset: 4832)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1125, file: !57, line: 2555, baseType: !940, size: 32, align: 32, offset: 4864)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1125, file: !57, line: 2557, baseType: !940, size: 32, align: 32, offset: 4896)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1125, file: !57, line: 2559, baseType: !940, size: 32, align: 32, offset: 4928)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1125, file: !57, line: 2563, baseType: !940, size: 32, align: 32, offset: 4960)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1125, file: !57, line: 2571, baseType: !1537, size: 64, align: 64, offset: 4992)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1125, file: !57, line: 2579, baseType: !1537, size: 64, align: 64, offset: 5056)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1125, file: !57, line: 2586, baseType: !940, size: 32, align: 32, offset: 5120)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1125, file: !57, line: 2615, baseType: !940, size: 32, align: 32, offset: 5152)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1125, file: !57, line: 2627, baseType: !940, size: 32, align: 32, offset: 5184)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1125, file: !57, line: 2637, baseType: !940, size: 32, align: 32, offset: 5216)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1125, file: !57, line: 2681, baseType: !940, size: 32, align: 32, offset: 5248)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1125, file: !57, line: 2709, baseType: !953, size: 64, align: 64, offset: 5312)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1125, file: !57, line: 2716, baseType: !1546, size: 64, align: 64, offset: 5376)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1548)
!1548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1549)
!1549 = !{!1550, !1551, !1552, !1553, !1554, !1555, !1559, !1565, !1569, !1570, !1571, !1572, !2468, !2469, !2470, !2471, !2472}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1548, file: !57, line: 3642, baseType: !1005, size: 64, align: 64)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1548, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1548, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1548, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1548, file: !57, line: 3669, baseType: !940, size: 32, align: 32, offset: 160)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1548, file: !57, line: 3682, baseType: !1556, size: 64, align: 64, offset: 192)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64, align: 64)
!1557 = !DISubroutineType(types: !1558)
!1558 = !{!940, !1123, !1145}
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1548, file: !57, line: 3698, baseType: !1560, size: 64, align: 64, offset: 256)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DISubroutineType(types: !1562)
!1562 = !{!940, !1123, !1563, !948}
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1548, file: !57, line: 3712, baseType: !1566, size: 64, align: 64, offset: 320)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64, align: 64)
!1567 = !DISubroutineType(types: !1568)
!1568 = !{!940, !1123, !940, !1563, !948}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1548, file: !57, line: 3726, baseType: !1560, size: 64, align: 64, offset: 384)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1548, file: !57, line: 3737, baseType: !1120, size: 64, align: 64, offset: 448)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1548, file: !57, line: 3746, baseType: !940, size: 32, align: 32, offset: 512)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1548, file: !57, line: 3757, baseType: !1573, size: 64, align: 64, offset: 576)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DISubroutineType(types: !1575)
!1575 = !{null, !1576}
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !1578, line: 81, size: 86208, align: 64, elements: !1579)
!1578 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1579 = !{!1580, !1582, !1583, !1584, !1585, !1589, !1590, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1637, !1638, !1690, !1692, !1693, !1694, !1695, !1696, !1707, !1708, !1709, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1724, !1726, !1728, !1729, !1730, !1731, !1732, !1733, !1737, !1739, !1740, !1741, !1742, !1743, !1744, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1771, !1772, !1773, !1774, !1790, !1797, !1809, !1825, !1847, !1887, !1900, !1927, !1942, !1956, !1969, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1990, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2003, !2005, !2006, !2007, !2008, !2009, !2010, !2013, !2015, !2017, !2018, !2021, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2088, !2089, !2091, !2092, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2114, !2115, !2116, !2119, !2120, !2121, !2122, !2124, !2126, !2127, !2128, !2129, !2130, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2212, !2213, !2214, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2343, !2344, !2345, !2346, !2350, !2351, !2355, !2359, !2363, !2364, !2369, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2384, !2385, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2403, !2404, !2405, !2455, !2456, !2460, !2461, !2462, !2463, !2464, !2465, !2466, !2467}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1577, file: !1578, line: 82, baseType: !1581, size: 64, align: 64)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !1577, file: !1578, line: 84, baseType: !940, size: 32, align: 32, offset: 64)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !1577, file: !1578, line: 84, baseType: !940, size: 32, align: 32, offset: 96)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !1577, file: !1578, line: 85, baseType: !940, size: 32, align: 32, offset: 128)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !1577, file: !1578, line: 86, baseType: !1586, size: 384, align: 32, offset: 160)
!1586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !940, size: 384, align: 32, elements: !1587)
!1587 = !{!1588}
!1588 = !DISubrange(count: 12)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !1577, file: !1578, line: 87, baseType: !940, size: 32, align: 32, offset: 544)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !1577, file: !1578, line: 90, baseType: !1591, size: 1088, align: 64, offset: 576)
!1591 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !931, line: 35, baseType: !1592)
!1592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !931, line: 31, size: 1088, align: 64, elements: !1593)
!1593 = !{!1594, !1595, !1599}
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1592, file: !931, line: 32, baseType: !1563, size: 64, align: 64)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1592, file: !931, line: 33, baseType: !1596, size: 512, align: 8, offset: 64)
!1596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 512, align: 8, elements: !1597)
!1597 = !{!1598}
!1598 = !DISubrange(count: 64)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1592, file: !931, line: 34, baseType: !1596, size: 512, align: 8, offset: 576)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !1577, file: !1578, line: 91, baseType: !1591, size: 1088, align: 64, offset: 1664)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !1577, file: !1578, line: 92, baseType: !1591, size: 1088, align: 64, offset: 2752)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !1577, file: !1578, line: 93, baseType: !1591, size: 1088, align: 64, offset: 3840)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1577, file: !1578, line: 98, baseType: !1409, size: 64, align: 64, offset: 4928)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1577, file: !1578, line: 100, baseType: !940, size: 32, align: 32, offset: 4992)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1577, file: !1578, line: 100, baseType: !940, size: 32, align: 32, offset: 5024)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1577, file: !1578, line: 101, baseType: !940, size: 32, align: 32, offset: 5056)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "intra_only", scope: !1577, file: !1578, line: 102, baseType: !940, size: 32, align: 32, offset: 5088)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1577, file: !1578, line: 103, baseType: !953, size: 64, align: 64, offset: 5120)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "out_format", scope: !1577, file: !1578, line: 104, baseType: !923, size: 32, align: 32, offset: 5184)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "h263_pred", scope: !1577, file: !1578, line: 105, baseType: !940, size: 32, align: 32, offset: 5216)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "pb_frame", scope: !1577, file: !1578, line: 106, baseType: !940, size: 32, align: 32, offset: 5248)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "h263_plus", scope: !1577, file: !1578, line: 109, baseType: !940, size: 32, align: 32, offset: 5280)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "h263_flv", scope: !1577, file: !1578, line: 110, baseType: !940, size: 32, align: 32, offset: 5312)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1577, file: !1578, line: 112, baseType: !56, size: 32, align: 32, offset: 5344)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_qscale", scope: !1577, file: !1578, line: 113, baseType: !940, size: 32, align: 32, offset: 5376)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1577, file: !1578, line: 114, baseType: !940, size: 32, align: 32, offset: 5408)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1577, file: !1578, line: 115, baseType: !940, size: 32, align: 32, offset: 5440)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "luma_elim_threshold", scope: !1577, file: !1578, line: 116, baseType: !940, size: 32, align: 32, offset: 5472)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_elim_threshold", scope: !1577, file: !1578, line: 117, baseType: !940, size: 32, align: 32, offset: 5504)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1577, file: !1578, line: 118, baseType: !940, size: 32, align: 32, offset: 5536)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1577, file: !1578, line: 119, baseType: !940, size: 32, align: 32, offset: 5568)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1577, file: !1578, line: 120, baseType: !940, size: 32, align: 32, offset: 5600)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "context_initialized", scope: !1577, file: !1578, line: 124, baseType: !940, size: 32, align: 32, offset: 5632)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture_number", scope: !1577, file: !1578, line: 125, baseType: !940, size: 32, align: 32, offset: 5664)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1577, file: !1578, line: 126, baseType: !940, size: 32, align: 32, offset: 5696)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "picture_number", scope: !1577, file: !1578, line: 127, baseType: !940, size: 32, align: 32, offset: 5728)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "picture_in_gop_number", scope: !1577, file: !1578, line: 128, baseType: !940, size: 32, align: 32, offset: 5760)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !1577, file: !1578, line: 129, baseType: !940, size: 32, align: 32, offset: 5792)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !1577, file: !1578, line: 129, baseType: !940, size: 32, align: 32, offset: 5824)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "mb_stride", scope: !1577, file: !1578, line: 130, baseType: !940, size: 32, align: 32, offset: 5856)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "b8_stride", scope: !1577, file: !1578, line: 131, baseType: !940, size: 32, align: 32, offset: 5888)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "h_edge_pos", scope: !1577, file: !1578, line: 132, baseType: !940, size: 32, align: 32, offset: 5920)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "v_edge_pos", scope: !1577, file: !1578, line: 132, baseType: !940, size: 32, align: 32, offset: 5952)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "mb_num", scope: !1577, file: !1578, line: 133, baseType: !940, size: 32, align: 32, offset: 5984)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1577, file: !1578, line: 134, baseType: !1636, size: 64, align: 64, offset: 6016)
!1636 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1234, line: 149, baseType: !954)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "uvlinesize", scope: !1577, file: !1578, line: 135, baseType: !1636, size: 64, align: 64, offset: 6080)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "picture", scope: !1577, file: !1578, line: 136, baseType: !1639, size: 64, align: 64, offset: 6144)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !1641, line: 91, baseType: !1642)
!1641 = !DIFile(filename: "libavcodec/mpegpicture.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Picture", file: !1641, line: 45, size: 2624, align: 64, elements: !1643)
!1643 = !{!1644, !1646, !1656, !1657, !1658, !1660, !1664, !1665, !1667, !1668, !1669, !1670, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1642, file: !1641, line: 46, baseType: !1645, size: 64, align: 64)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "tf", scope: !1642, file: !1641, line: 47, baseType: !1647, size: 256, align: 64, offset: 64)
!1647 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadFrame", file: !1648, line: 40, baseType: !1649)
!1648 = !DIFile(filename: "libavcodec/thread.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadFrame", file: !1648, line: 34, size: 256, align: 64, elements: !1650)
!1650 = !{!1651, !1652, !1655}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1649, file: !1648, line: 35, baseType: !1145, size: 64, align: 64)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1649, file: !1648, line: 36, baseType: !1653, size: 128, align: 64, offset: 64)
!1653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1123, size: 128, align: 64, elements: !1654)
!1654 = !{!990}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1649, file: !1648, line: 39, baseType: !1182, size: 64, align: 64, offset: 192)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table_buf", scope: !1642, file: !1641, line: 49, baseType: !1182, size: 64, align: 64, offset: 320)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1642, file: !1641, line: 50, baseType: !1226, size: 64, align: 64, offset: 384)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val_buf", scope: !1642, file: !1641, line: 52, baseType: !1659, size: 128, align: 64, offset: 448)
!1659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1182, size: 128, align: 64, elements: !1654)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val", scope: !1642, file: !1641, line: 53, baseType: !1661, size: 128, align: 64, offset: 576)
!1661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1662, size: 128, align: 64, elements: !1654)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 32, align: 16, elements: !1654)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_buf", scope: !1642, file: !1641, line: 55, baseType: !1182, size: 64, align: 64, offset: 704)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !1642, file: !1641, line: 56, baseType: !1666, size: 64, align: 64, offset: 768)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "mbskip_table_buf", scope: !1642, file: !1641, line: 58, baseType: !1182, size: 64, align: 64, offset: 832)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "mbskip_table", scope: !1642, file: !1641, line: 59, baseType: !957, size: 64, align: 64, offset: 896)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "ref_index_buf", scope: !1642, file: !1641, line: 61, baseType: !1659, size: 128, align: 64, offset: 960)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "ref_index", scope: !1642, file: !1641, line: 62, baseType: !1671, size: 128, align: 64, offset: 1088)
!1671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1226, size: 128, align: 64, elements: !1654)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var_buf", scope: !1642, file: !1641, line: 64, baseType: !1182, size: 64, align: 64, offset: 1216)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var", scope: !1642, file: !1641, line: 65, baseType: !1449, size: 64, align: 64, offset: 1280)
