; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--vp9prob.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--vp9prob.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.VP9Context = type { %struct.VP9SharedContext, %struct.VP9TileData*, %struct.VP9DSPContext, %struct.VideoDSPContext, %struct.GetBitContext, %struct.VP56RangeCoder, i32, i32, %union.pthread_mutex_t, %union.pthread_cond_t, i32*, i8, i8, i8, i8, i8, i8, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x %struct.ThreadFrame], %struct.anon.8, [4 x %struct.anon.9], %struct.anon.11, i8*, i8*, i8*, [2 x i8*], i8*, i8*, i8*, i8*, i8*, i8*, i8*, [2 x %struct.VP56mv]*, [3 x i8*], %struct.VP9Filter*, i32, [3 x [2 x i16]], [3 x [2 x i8]] }
%struct.VP9SharedContext = type { %struct.VP9BitstreamHeader, [8 x %struct.ThreadFrame], [3 x %struct.VP9Frame] }
%struct.VP9BitstreamHeader = type { i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i8, i8, i8, i8, i8, [3 x i8], [3 x i8], i8, [2 x i8], %struct.anon, %struct.anon.0, i8, i8, i8, i8, i8, %struct.anon.1, i32, i32, %struct.anon.3, i32, i32 }
%struct.anon = type { i8, i8 }
%struct.anon.0 = type { i8, i8, [2 x i8], [4 x i8] }
%struct.anon.1 = type { i8, i8, i8, i8, [7 x i8], [3 x i8], [8 x %struct.anon.2] }
%struct.anon.2 = type { i8, i8, i8, i8, i8, i16, i8, [2 x [2 x i16]], [4 x [2 x i8]] }

!913 = !DIEnumerator(name: "BS_64x64", value: 0)
!914 = !DIEnumerator(name: "BS_64x32", value: 1)
!915 = !DIEnumerator(name: "BS_32x64", value: 2)
!916 = !DIEnumerator(name: "BS_32x32", value: 3)
!917 = !DIEnumerator(name: "BS_32x16", value: 4)
!918 = !DIEnumerator(name: "BS_16x32", value: 5)
!919 = !DIEnumerator(name: "BS_16x16", value: 6)
!920 = !DIEnumerator(name: "BS_16x8", value: 7)
!921 = !DIEnumerator(name: "BS_8x16", value: 8)
!922 = !DIEnumerator(name: "BS_8x8", value: 9)
!923 = !DIEnumerator(name: "BS_8x4", value: 10)
!924 = !DIEnumerator(name: "BS_4x8", value: 11)
!925 = !DIEnumerator(name: "BS_4x4", value: 12)
!926 = !DIEnumerator(name: "N_BS_SIZES", value: 13)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BlockLevel", file: !22, line: 70, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "BL_64X64", value: 0)
!930 = !DIEnumerator(name: "BL_32X32", value: 1)
!931 = !DIEnumerator(name: "BL_16X16", value: 2)
!932 = !DIEnumerator(name: "BL_8X8", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BlockPartition", file: !22, line: 34, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937, !938}
!935 = !DIEnumerator(name: "PARTITION_NONE", value: 0)
!936 = !DIEnumerator(name: "PARTITION_H", value: 1)
!937 = !DIEnumerator(name: "PARTITION_V", value: 2)
!938 = !DIEnumerator(name: "PARTITION_SPLIT", value: 3)
!939 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IntraPredMode", file: !4, line: 45, size: 32, align: 32, elements: !940)
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956}
!941 = !DIEnumerator(name: "VERT_PRED", value: 0)
!942 = !DIEnumerator(name: "HOR_PRED", value: 1)
!943 = !DIEnumerator(name: "DC_PRED", value: 2)
!944 = !DIEnumerator(name: "DIAG_DOWN_LEFT_PRED", value: 3)
!945 = !DIEnumerator(name: "DIAG_DOWN_RIGHT_PRED", value: 4)
!946 = !DIEnumerator(name: "VERT_RIGHT_PRED", value: 5)
!947 = !DIEnumerator(name: "HOR_DOWN_PRED", value: 6)
!948 = !DIEnumerator(name: "VERT_LEFT_PRED", value: 7)
!949 = !DIEnumerator(name: "HOR_UP_PRED", value: 8)
!950 = !DIEnumerator(name: "TM_VP8_PRED", value: 9)
!951 = !DIEnumerator(name: "LEFT_DC_PRED", value: 10)
!952 = !DIEnumerator(name: "TOP_DC_PRED", value: 11)
!953 = !DIEnumerator(name: "DC_128_PRED", value: 12)
!954 = !DIEnumerator(name: "DC_127_PRED", value: 13)
!955 = !DIEnumerator(name: "DC_129_PRED", value: 14)
!956 = !DIEnumerator(name: "N_INTRA_PRED_MODES", value: 15)
!957 = !{!958, !961, !963}
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !959, line: 51, baseType: !960)
!959 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!960 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !959, line: 55, baseType: !962)
!962 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !959, line: 40, baseType: !964)
!964 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!965 = !{i32 2, !"Dwarf Version", i32 4}
!966 = !{i32 2, !"Debug Info Version", i32 3}
!967 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!968 = distinct !DISubprogram(name: "ff_vp9_adapt_probs", scope: !969, file: !969, line: 46, type: !970, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2096)
!969 = !DIFile(filename: "libavcodec/vp9prob.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!970 = !DISubroutineType(types: !971)
!971 = !{null, !972}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP9Context", file: !974, line: 155, baseType: !975)
!974 = !DIFile(filename: "libavcodec/vp9dec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP9Context", file: !974, line: 91, size: 150080, align: 64, elements: !976)
!976 = !{!977, !1700, !1864, !1906, !1919, !1929, !1930, !1931, !1932, !1959, !1981, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2009, !2061, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2081, !2082, !2091, !2092, !2094}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !975, file: !974, line: 92, baseType: !978, size: 6400, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP9SharedContext", file: !22, line: 167, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP9SharedContext", file: !22, line: 159, size: 6400, align: 64, elements: !980)
!980 = !{!981, !1080, !1675}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !979, file: !22, line: 160, baseType: !982, size: 2400, align: 32)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP9BitstreamHeader", file: !22, line: 157, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP9BitstreamHeader", file: !22, line: 94, size: 2400, align: 32, elements: !984)
!984 = !{!985, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1006, !1007, !1008, !1012, !1019, !1030, !1031, !1032, !1033, !1034, !1035, !1068, !1069, !1070, !1077, !1079}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !983, file: !22, line: 96, baseType: !986, size: 8, align: 8)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !959, line: 48, baseType: !987)
!987 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "bpp", scope: !983, file: !22, line: 97, baseType: !986, size: 8, align: 8, offset: 8)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe", scope: !983, file: !22, line: 98, baseType: !986, size: 8, align: 8, offset: 16)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "invisible", scope: !983, file: !22, line: 99, baseType: !986, size: 8, align: 8, offset: 24)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "errorres", scope: !983, file: !22, line: 100, baseType: !986, size: 8, align: 8, offset: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "intraonly", scope: !983, file: !22, line: 101, baseType: !986, size: 8, align: 8, offset: 40)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "resetctx", scope: !983, file: !22, line: 102, baseType: !986, size: 8, align: 8, offset: 48)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "refreshrefmask", scope: !983, file: !22, line: 103, baseType: !986, size: 8, align: 8, offset: 56)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "highprecisionmvs", scope: !983, file: !22, line: 104, baseType: !986, size: 8, align: 8, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "filtermode", scope: !983, file: !22, line: 105, baseType: !3, size: 32, align: 32, offset: 96)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "allowcompinter", scope: !983, file: !22, line: 106, baseType: !986, size: 8, align: 8, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "refreshctx", scope: !983, file: !22, line: 107, baseType: !986, size: 8, align: 8, offset: 136)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "parallelmode", scope: !983, file: !22, line: 108, baseType: !986, size: 8, align: 8, offset: 144)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "framectxid", scope: !983, file: !22, line: 109, baseType: !986, size: 8, align: 8, offset: 152)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "use_last_frame_mvs", scope: !983, file: !22, line: 110, baseType: !986, size: 8, align: 8, offset: 160)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "refidx", scope: !983, file: !22, line: 111, baseType: !1003, size: 24, align: 8, offset: 168)
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 24, align: 8, elements: !1004)
!1004 = !{!1005}
!1005 = !DISubrange(count: 3)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "signbias", scope: !983, file: !22, line: 112, baseType: !1003, size: 24, align: 8, offset: 192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "fixcompref", scope: !983, file: !22, line: 113, baseType: !986, size: 8, align: 8, offset: 216)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "varcompref", scope: !983, file: !22, line: 114, baseType: !1009, size: 16, align: 8, offset: 224)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 16, align: 8, elements: !1010)
!1010 = !{!1011}
!1011 = !DISubrange(count: 2)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !983, file: !22, line: 118, baseType: !1013, size: 16, align: 8, offset: 240)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !983, file: !22, line: 115, size: 16, align: 8, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1013, file: !22, line: 116, baseType: !986, size: 8, align: 8)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "sharpness", scope: !1013, file: !22, line: 117, baseType: !1017, size: 8, align: 8, offset: 8)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !959, line: 36, baseType: !1018)
!1018 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "lf_delta", scope: !983, file: !22, line: 124, baseType: !1020, size: 64, align: 8, offset: 256)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !983, file: !22, line: 119, size: 64, align: 8, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1026}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !1020, file: !22, line: 120, baseType: !986, size: 8, align: 8)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !1020, file: !22, line: 121, baseType: !986, size: 8, align: 8, offset: 8)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1020, file: !22, line: 122, baseType: !1025, size: 16, align: 8, offset: 16)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 16, align: 8, elements: !1010)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !1020, file: !22, line: 123, baseType: !1027, size: 32, align: 8, offset: 32)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 32, align: 8, elements: !1028)
!1028 = !{!1029}
!1029 = !DISubrange(count: 4)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "yac_qi", scope: !983, file: !22, line: 125, baseType: !986, size: 8, align: 8, offset: 320)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ydc_qdelta", scope: !983, file: !22, line: 126, baseType: !1017, size: 8, align: 8, offset: 328)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "uvdc_qdelta", scope: !983, file: !22, line: 126, baseType: !1017, size: 8, align: 8, offset: 336)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "uvac_qdelta", scope: !983, file: !22, line: 126, baseType: !1017, size: 8, align: 8, offset: 344)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "lossless", scope: !983, file: !22, line: 127, baseType: !986, size: 8, align: 8, offset: 352)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "segmentation", scope: !983, file: !22, line: 147, baseType: !1036, size: 1776, align: 16, offset: 368)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !983, file: !22, line: 129, size: 1776, align: 16, elements: !1037)
!1037 = !{!1038, !1039, !1040, !1041, !1042, !1046, !1047}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !1036, file: !22, line: 130, baseType: !986, size: 8, align: 8)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "temporal", scope: !1036, file: !22, line: 131, baseType: !986, size: 8, align: 8, offset: 8)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_vals", scope: !1036, file: !22, line: 132, baseType: !986, size: 8, align: 8, offset: 16)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "update_map", scope: !1036, file: !22, line: 133, baseType: !986, size: 8, align: 8, offset: 24)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "prob", scope: !1036, file: !22, line: 134, baseType: !1043, size: 56, align: 8, offset: 32)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 56, align: 8, elements: !1044)
!1044 = !{!1045}
!1045 = !DISubrange(count: 7)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "pred_prob", scope: !1036, file: !22, line: 135, baseType: !1003, size: 24, align: 8, offset: 88)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "feat", scope: !1036, file: !22, line: 146, baseType: !1048, size: 1664, align: 16, offset: 112)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 1664, align: 16, elements: !1066)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1036, file: !22, line: 136, size: 208, align: 16, elements: !1050)
!1050 = !{!1051, !1052, !1053, !1054, !1055, !1056, !1059, !1060, !1063}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "q_enabled", scope: !1049, file: !22, line: 137, baseType: !986, size: 8, align: 8)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "lf_enabled", scope: !1049, file: !22, line: 138, baseType: !986, size: 8, align: 8, offset: 8)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "ref_enabled", scope: !1049, file: !22, line: 139, baseType: !986, size: 8, align: 8, offset: 16)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "skip_enabled", scope: !1049, file: !22, line: 140, baseType: !986, size: 8, align: 8, offset: 24)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "ref_val", scope: !1049, file: !22, line: 141, baseType: !986, size: 8, align: 8, offset: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "q_val", scope: !1049, file: !22, line: 142, baseType: !1057, size: 16, align: 16, offset: 48)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !959, line: 37, baseType: !1058)
!1058 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "lf_val", scope: !1049, file: !22, line: 143, baseType: !1017, size: 8, align: 8, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "qmul", scope: !1049, file: !22, line: 144, baseType: !1061, size: 64, align: 16, offset: 80)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1057, size: 64, align: 16, elements: !1062)
!1062 = !{!1011, !1011}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "lflvl", scope: !1049, file: !22, line: 145, baseType: !1064, size: 64, align: 8, offset: 144)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 64, align: 8, elements: !1065)
!1065 = !{!1029, !1011}
!1066 = !{!1067}
!1067 = !DISubrange(count: 8)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "txfmmode", scope: !983, file: !22, line: 148, baseType: !12, size: 32, align: 32, offset: 2144)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "comppredmode", scope: !983, file: !22, line: 149, baseType: !21, size: 32, align: 32, offset: 2176)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "tiling", scope: !983, file: !22, line: 153, baseType: !1071, size: 128, align: 32, offset: 2208)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !983, file: !22, line: 150, size: 128, align: 32, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1076}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "log2_tile_cols", scope: !1071, file: !22, line: 151, baseType: !960, size: 32, align: 32)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "log2_tile_rows", scope: !1071, file: !22, line: 151, baseType: !960, size: 32, align: 32, offset: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "tile_cols", scope: !1071, file: !22, line: 152, baseType: !960, size: 32, align: 32, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "tile_rows", scope: !1071, file: !22, line: 152, baseType: !960, size: 32, align: 32, offset: 96)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_header_size", scope: !983, file: !22, line: 155, baseType: !1078, size: 32, align: 32, offset: 2336)
!1078 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_header_size", scope: !983, file: !22, line: 156, baseType: !1078, size: 32, align: 32, offset: 2368)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !979, file: !22, line: 162, baseType: !1081, size: 2048, align: 64, offset: 2432)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1082, size: 2048, align: 64, elements: !1066)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadFrame", file: !1083, line: 40, baseType: !1084)
!1083 = !DIFile(filename: "libavcodec/thread.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadFrame", file: !1083, line: 34, size: 256, align: 64, elements: !1085)
!1085 = !{!1086, !1187, !1674}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1084, file: !1083, line: 35, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !39, line: 646, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !39, line: 268, size: 4288, align: 64, elements: !1090)
!1090 = !{!1091, !1094, !1096, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1119, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1141, !1143, !1144, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1175, !1176, !1177, !1178, !1179, !1180, !1183, !1184, !1185, !1186}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1089, file: !39, line: 282, baseType: !1092, size: 512, align: 64)
!1092 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1093, size: 512, align: 64, elements: !1066)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1089, file: !39, line: 299, baseType: !1095, size: 256, align: 32, offset: 512)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1078, size: 256, align: 32, elements: !1066)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1089, file: !39, line: 315, baseType: !1097, size: 64, align: 64, offset: 768)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1089, file: !39, line: 326, baseType: !1078, size: 32, align: 32, offset: 832)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1089, file: !39, line: 326, baseType: !1078, size: 32, align: 32, offset: 864)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1089, file: !39, line: 334, baseType: !1078, size: 32, align: 32, offset: 896)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1089, file: !39, line: 341, baseType: !1078, size: 32, align: 32, offset: 928)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1089, file: !39, line: 346, baseType: !1078, size: 32, align: 32, offset: 960)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1089, file: !39, line: 351, baseType: !27, size: 32, align: 32, offset: 992)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1089, file: !39, line: 356, baseType: !1105, size: 64, align: 32, offset: 1024)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1106, line: 61, baseType: !1107)
!1106 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1106, line: 58, size: 64, align: 32, elements: !1108)
!1108 = !{!1109, !1110}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1107, file: !1106, line: 59, baseType: !1078, size: 32, align: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1107, file: !1106, line: 60, baseType: !1078, size: 32, align: 32, offset: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1089, file: !39, line: 361, baseType: !963, size: 64, align: 64, offset: 1088)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1089, file: !39, line: 369, baseType: !963, size: 64, align: 64, offset: 1152)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1089, file: !39, line: 377, baseType: !963, size: 64, align: 64, offset: 1216)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1089, file: !39, line: 382, baseType: !1078, size: 32, align: 32, offset: 1280)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1089, file: !39, line: 386, baseType: !1078, size: 32, align: 32, offset: 1312)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1089, file: !39, line: 391, baseType: !1078, size: 32, align: 32, offset: 1344)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1089, file: !39, line: 396, baseType: !1118, size: 64, align: 64, offset: 1408)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1089, file: !39, line: 403, baseType: !1120, size: 512, align: 64, offset: 1472)
!1120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 512, align: 64, elements: !1066)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1089, file: !39, line: 410, baseType: !1078, size: 32, align: 32, offset: 1984)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1089, file: !39, line: 415, baseType: !1078, size: 32, align: 32, offset: 2016)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1089, file: !39, line: 420, baseType: !1078, size: 32, align: 32, offset: 2048)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1089, file: !39, line: 425, baseType: !1078, size: 32, align: 32, offset: 2080)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1089, file: !39, line: 435, baseType: !963, size: 64, align: 64, offset: 2112)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1089, file: !39, line: 440, baseType: !1078, size: 32, align: 32, offset: 2176)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1089, file: !39, line: 445, baseType: !961, size: 64, align: 64, offset: 2240)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1089, file: !39, line: 459, baseType: !1129, size: 512, align: 64, offset: 2304)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1130, size: 512, align: 64, elements: !1066)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1132, line: 94, baseType: !1133)
!1132 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1132, line: 81, size: 192, align: 64, elements: !1134)
!1134 = !{!1135, !1139, !1140}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1133, file: !1132, line: 82, baseType: !1136, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1132, line: 73, baseType: !1138)
!1138 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1132, line: 73, flags: DIFlagFwdDecl)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1133, file: !1132, line: 89, baseType: !1093, size: 64, align: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1133, file: !1132, line: 93, baseType: !1078, size: 32, align: 32, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1089, file: !39, line: 473, baseType: !1142, size: 64, align: 64, offset: 2816)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1089, file: !39, line: 477, baseType: !1078, size: 32, align: 32, offset: 2880)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1089, file: !39, line: 479, baseType: !1145, size: 64, align: 64, offset: 2944)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !39, line: 207, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !39, line: 201, size: 320, align: 64, elements: !1149)
!1149 = !{!1150, !1151, !1152, !1153, !1158}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1148, file: !39, line: 202, baseType: !38, size: 32, align: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1148, file: !39, line: 203, baseType: !1093, size: 64, align: 64, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1148, file: !39, line: 204, baseType: !1078, size: 32, align: 32, offset: 128)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1148, file: !39, line: 205, baseType: !1154, size: 64, align: 64, offset: 192)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1156, line: 86, baseType: !1157)
!1156 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1157 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1156, line: 86, flags: DIFlagFwdDecl)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1148, file: !39, line: 206, baseType: !1130, size: 64, align: 64, offset: 256)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1089, file: !39, line: 480, baseType: !1078, size: 32, align: 32, offset: 3008)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1089, file: !39, line: 505, baseType: !1078, size: 32, align: 32, offset: 3040)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1089, file: !39, line: 512, baseType: !62, size: 32, align: 32, offset: 3072)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1089, file: !39, line: 514, baseType: !69, size: 32, align: 32, offset: 3104)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1089, file: !39, line: 516, baseType: !87, size: 32, align: 32, offset: 3136)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1089, file: !39, line: 523, baseType: !111, size: 32, align: 32, offset: 3168)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1089, file: !39, line: 525, baseType: !130, size: 32, align: 32, offset: 3200)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1089, file: !39, line: 532, baseType: !963, size: 64, align: 64, offset: 3264)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1089, file: !39, line: 539, baseType: !963, size: 64, align: 64, offset: 3328)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1089, file: !39, line: 547, baseType: !963, size: 64, align: 64, offset: 3392)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1089, file: !39, line: 554, baseType: !1154, size: 64, align: 64, offset: 3456)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1089, file: !39, line: 563, baseType: !1078, size: 32, align: 32, offset: 3520)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1089, file: !39, line: 572, baseType: !1078, size: 32, align: 32, offset: 3552)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1089, file: !39, line: 581, baseType: !1078, size: 32, align: 32, offset: 3584)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1089, file: !39, line: 588, baseType: !1174, size: 64, align: 64, offset: 3648)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1089, file: !39, line: 593, baseType: !1078, size: 32, align: 32, offset: 3712)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1089, file: !39, line: 596, baseType: !1078, size: 32, align: 32, offset: 3744)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1089, file: !39, line: 599, baseType: !1130, size: 64, align: 64, offset: 3776)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1089, file: !39, line: 605, baseType: !1130, size: 64, align: 64, offset: 3840)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1089, file: !39, line: 616, baseType: !1130, size: 64, align: 64, offset: 3904)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1089, file: !39, line: 626, baseType: !1181, size: 64, align: 64, offset: 3968)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1182, line: 216, baseType: !962)
!1182 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1089, file: !39, line: 627, baseType: !1181, size: 64, align: 64, offset: 4032)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1089, file: !39, line: 628, baseType: !1181, size: 64, align: 64, offset: 4096)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1089, file: !39, line: 629, baseType: !1181, size: 64, align: 64, offset: 4160)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1089, file: !39, line: 645, baseType: !1130, size: 64, align: 64, offset: 4224)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1084, file: !1083, line: 36, baseType: !1188, size: 128, align: 64, offset: 64)
!1188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1189, size: 128, align: 64, elements: !1010)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !171, line: 3360, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !171, line: 1556, size: 8448, align: 64, elements: !1192)
!1192 = !{!1193, !1237, !1238, !1239, !1397, !1398, !1399, !1400, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1426, !1430, !1431, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1612, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1191, file: !171, line: 1561, baseType: !1194, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1196)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !141, line: 143, baseType: !1197)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !141, line: 67, size: 640, align: 64, elements: !1198)
!1198 = !{!1199, !1203, !1207, !1211, !1212, !1213, !1214, !1218, !1224, !1226, !1230}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1197, file: !141, line: 72, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1202)
!1202 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1197, file: !141, line: 78, baseType: !1204, size: 64, align: 64, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!1200, !1118}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1197, file: !141, line: 85, baseType: !1208, size: 64, align: 64, offset: 128)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1210)
!1210 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !141, line: 85, flags: DIFlagFwdDecl)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1197, file: !141, line: 93, baseType: !1078, size: 32, align: 32, offset: 192)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1197, file: !141, line: 99, baseType: !1078, size: 32, align: 32, offset: 224)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1197, file: !141, line: 108, baseType: !1078, size: 32, align: 32, offset: 256)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1197, file: !141, line: 113, baseType: !1215, size: 64, align: 64, offset: 320)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!1118, !1118, !1118}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1197, file: !141, line: 123, baseType: !1219, size: 64, align: 64, offset: 384)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{!1222, !1222}
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1197)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1197, file: !141, line: 130, baseType: !1225, size: 32, align: 32, offset: 448)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !141, line: 48, baseType: !140)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1197, file: !141, line: 136, baseType: !1227, size: 64, align: 64, offset: 512)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!1225, !1118}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1197, file: !141, line: 142, baseType: !1231, size: 64, align: 64, offset: 576)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!1078, !1234, !1118, !1200, !1078}
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !141, line: 60, flags: DIFlagFwdDecl)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1191, file: !171, line: 1562, baseType: !1078, size: 32, align: 32, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1191, file: !171, line: 1564, baseType: !161, size: 32, align: 32, offset: 96)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1191, file: !171, line: 1565, baseType: !1240, size: 64, align: 64, offset: 128)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !171, line: 3468, size: 1984, align: 64, elements: !1243)
!1243 = !{!1244, !1245, !1246, !1247, !1248, !1249, !1252, !1255, !1258, !1261, !1264, !1265, !1266, !1274, !1275, !1276, !1278, !1282, !1288, !1293, !1297, !1298, !1339, !1369, !1373, !1374, !1378, !1382, !1386, !1390, !1391, !1392}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1242, file: !171, line: 3475, baseType: !1200, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1242, file: !171, line: 3480, baseType: !1200, size: 64, align: 64, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1242, file: !171, line: 3481, baseType: !161, size: 32, align: 32, offset: 128)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1242, file: !171, line: 3482, baseType: !170, size: 32, align: 32, offset: 160)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1242, file: !171, line: 3487, baseType: !1078, size: 32, align: 32, offset: 192)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1242, file: !171, line: 3488, baseType: !1250, size: 64, align: 64, offset: 256)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1105)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1242, file: !171, line: 3489, baseType: !1253, size: 64, align: 64, offset: 320)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !630)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1242, file: !171, line: 3490, baseType: !1256, size: 64, align: 64, offset: 384)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1078)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1242, file: !171, line: 3491, baseType: !1259, size: 64, align: 64, offset: 448)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !829)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1242, file: !171, line: 3492, baseType: !1262, size: 64, align: 64, offset: 512)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1242, file: !171, line: 3493, baseType: !986, size: 8, align: 8, offset: 576)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1242, file: !171, line: 3494, baseType: !1194, size: 64, align: 64, offset: 640)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1242, file: !171, line: 3495, baseType: !1267, size: 64, align: 64, offset: 704)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1269)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !171, line: 3404, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !171, line: 3401, size: 128, align: 64, elements: !1271)
!1271 = !{!1272, !1273}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1270, file: !171, line: 3402, baseType: !1078, size: 32, align: 32)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1270, file: !171, line: 3403, baseType: !1200, size: 64, align: 64, offset: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1242, file: !171, line: 3507, baseType: !1200, size: 64, align: 64, offset: 768)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1242, file: !171, line: 3516, baseType: !1078, size: 32, align: 32, offset: 832)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1242, file: !171, line: 3517, baseType: !1277, size: 64, align: 64, offset: 896)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1242, file: !171, line: 3527, baseType: !1279, size: 64, align: 64, offset: 960)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{!1078, !1189}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1242, file: !171, line: 3535, baseType: !1283, size: 64, align: 64, offset: 1024)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!1078, !1189, !1286}
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1190)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1242, file: !171, line: 3541, baseType: !1289, size: 64, align: 64, offset: 1088)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1291)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !171, line: 3461, baseType: !1292)
!1292 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !171, line: 3461, flags: DIFlagFwdDecl)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1242, file: !171, line: 3549, baseType: !1294, size: 64, align: 64, offset: 1152)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{null, !1277}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1242, file: !171, line: 3551, baseType: !1279, size: 64, align: 64, offset: 1216)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1242, file: !171, line: 3552, baseType: !1299, size: 64, align: 64, offset: 1280)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DISubroutineType(types: !1301)
!1301 = !{!1078, !1189, !1093, !1078, !1302}
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1304)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !171, line: 3920, size: 256, align: 64, elements: !1305)
!1305 = !{!1306, !1309, !1310, !1311, !1312, !1338}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1304, file: !171, line: 3921, baseType: !1307, size: 16, align: 16)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !959, line: 49, baseType: !1308)
!1308 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1304, file: !171, line: 3922, baseType: !958, size: 32, align: 32, offset: 32)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1304, file: !171, line: 3923, baseType: !958, size: 32, align: 32, offset: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1304, file: !171, line: 3924, baseType: !960, size: 32, align: 32, offset: 96)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1304, file: !171, line: 3925, baseType: !1313, size: 64, align: 64, offset: 128)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !171, line: 3918, baseType: !1316)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !171, line: 3885, size: 1600, align: 64, elements: !1317)
!1317 = !{!1318, !1319, !1320, !1321, !1322, !1323, !1329, !1331, !1333, !1334, !1336, !1337}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1316, file: !171, line: 3886, baseType: !1078, size: 32, align: 32)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1316, file: !171, line: 3887, baseType: !1078, size: 32, align: 32, offset: 32)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1316, file: !171, line: 3888, baseType: !1078, size: 32, align: 32, offset: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1316, file: !171, line: 3889, baseType: !1078, size: 32, align: 32, offset: 96)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1316, file: !171, line: 3890, baseType: !1078, size: 32, align: 32, offset: 128)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1316, file: !171, line: 3897, baseType: !1324, size: 768, align: 64, offset: 192)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !171, line: 3858, baseType: !1325)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !171, line: 3853, size: 768, align: 64, elements: !1326)
!1326 = !{!1327, !1328}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1325, file: !171, line: 3855, baseType: !1092, size: 512, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1325, file: !171, line: 3857, baseType: !1095, size: 256, align: 32, offset: 512)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1316, file: !171, line: 3903, baseType: !1330, size: 256, align: 64, offset: 960)
!1330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1093, size: 256, align: 64, elements: !1028)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1316, file: !171, line: 3904, baseType: !1332, size: 128, align: 32, offset: 1216)
!1332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1078, size: 128, align: 32, elements: !1028)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1316, file: !171, line: 3906, baseType: !846, size: 32, align: 32, offset: 1344)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1316, file: !171, line: 3908, baseType: !1335, size: 64, align: 64, offset: 1408)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1316, file: !171, line: 3915, baseType: !1335, size: 64, align: 64, offset: 1472)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1316, file: !171, line: 3917, baseType: !1078, size: 32, align: 32, offset: 1536)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1304, file: !171, line: 3926, baseType: !963, size: 64, align: 64, offset: 192)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1242, file: !171, line: 3564, baseType: !1340, size: 64, align: 64, offset: 1344)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{!1078, !1189, !1343, !1366, !1368}
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !171, line: 1499, baseType: !1345)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !171, line: 1445, size: 704, align: 64, elements: !1346)
!1346 = !{!1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1362, !1363, !1364, !1365}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1345, file: !171, line: 1451, baseType: !1130, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1345, file: !171, line: 1461, baseType: !963, size: 64, align: 64, offset: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1345, file: !171, line: 1467, baseType: !963, size: 64, align: 64, offset: 128)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1345, file: !171, line: 1468, baseType: !1093, size: 64, align: 64, offset: 192)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1345, file: !171, line: 1469, baseType: !1078, size: 32, align: 32, offset: 256)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1345, file: !171, line: 1470, baseType: !1078, size: 32, align: 32, offset: 288)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1345, file: !171, line: 1474, baseType: !1078, size: 32, align: 32, offset: 320)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1345, file: !171, line: 1479, baseType: !1355, size: 64, align: 64, offset: 384)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !171, line: 1415, baseType: !1357)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !171, line: 1411, size: 128, align: 64, elements: !1358)
!1358 = !{!1359, !1360, !1361}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1357, file: !171, line: 1412, baseType: !1093, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1357, file: !171, line: 1413, baseType: !1078, size: 32, align: 32, offset: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1357, file: !171, line: 1414, baseType: !852, size: 32, align: 32, offset: 96)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1345, file: !171, line: 1480, baseType: !1078, size: 32, align: 32, offset: 448)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1345, file: !171, line: 1486, baseType: !963, size: 64, align: 64, offset: 512)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1345, file: !171, line: 1488, baseType: !963, size: 64, align: 64, offset: 576)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1345, file: !171, line: 1497, baseType: !963, size: 64, align: 64, offset: 640)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1088)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1242, file: !171, line: 3566, baseType: !1370, size: 64, align: 64, offset: 1408)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DISubroutineType(types: !1372)
!1372 = !{!1078, !1189, !1118, !1368, !1343}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1242, file: !171, line: 3567, baseType: !1279, size: 64, align: 64, offset: 1472)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1242, file: !171, line: 3576, baseType: !1375, size: 64, align: 64, offset: 1536)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DISubroutineType(types: !1377)
!1377 = !{!1078, !1189, !1366}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1242, file: !171, line: 3577, baseType: !1379, size: 64, align: 64, offset: 1600)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DISubroutineType(types: !1381)
!1381 = !{!1078, !1189, !1343}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1242, file: !171, line: 3584, baseType: !1383, size: 64, align: 64, offset: 1664)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DISubroutineType(types: !1385)
!1385 = !{!1078, !1189, !1087}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1242, file: !171, line: 3589, baseType: !1387, size: 64, align: 64, offset: 1728)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DISubroutineType(types: !1389)
!1389 = !{null, !1189}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1242, file: !171, line: 3594, baseType: !1078, size: 32, align: 32, offset: 1792)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1242, file: !171, line: 3600, baseType: !1200, size: 64, align: 64, offset: 1856)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1242, file: !171, line: 3609, baseType: !1393, size: 64, align: 64, offset: 1920)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1396)
!1396 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !171, line: 3609, flags: DIFlagFwdDecl)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1191, file: !171, line: 1566, baseType: !170, size: 32, align: 32, offset: 192)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1191, file: !171, line: 1581, baseType: !960, size: 32, align: 32, offset: 224)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1191, file: !171, line: 1583, baseType: !1118, size: 64, align: 64, offset: 256)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1191, file: !171, line: 1591, baseType: !1401, size: 64, align: 64, offset: 320)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !171, line: 1532, flags: DIFlagFwdDecl)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1191, file: !171, line: 1598, baseType: !1118, size: 64, align: 64, offset: 384)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1191, file: !171, line: 1606, baseType: !963, size: 64, align: 64, offset: 448)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1191, file: !171, line: 1614, baseType: !1078, size: 32, align: 32, offset: 512)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1191, file: !171, line: 1622, baseType: !1078, size: 32, align: 32, offset: 544)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1191, file: !171, line: 1628, baseType: !1078, size: 32, align: 32, offset: 576)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1191, file: !171, line: 1636, baseType: !1078, size: 32, align: 32, offset: 608)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1191, file: !171, line: 1643, baseType: !1078, size: 32, align: 32, offset: 640)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1191, file: !171, line: 1657, baseType: !1093, size: 64, align: 64, offset: 704)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1191, file: !171, line: 1658, baseType: !1078, size: 32, align: 32, offset: 768)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1191, file: !171, line: 1679, baseType: !1105, size: 64, align: 32, offset: 800)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1191, file: !171, line: 1688, baseType: !1078, size: 32, align: 32, offset: 864)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1191, file: !171, line: 1712, baseType: !1078, size: 32, align: 32, offset: 896)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1191, file: !171, line: 1729, baseType: !1078, size: 32, align: 32, offset: 928)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1191, file: !171, line: 1729, baseType: !1078, size: 32, align: 32, offset: 960)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1191, file: !171, line: 1744, baseType: !1078, size: 32, align: 32, offset: 992)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1191, file: !171, line: 1744, baseType: !1078, size: 32, align: 32, offset: 1024)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1191, file: !171, line: 1751, baseType: !1078, size: 32, align: 32, offset: 1056)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1191, file: !171, line: 1766, baseType: !630, size: 32, align: 32, offset: 1088)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1191, file: !171, line: 1791, baseType: !1422, size: 64, align: 64, offset: 1152)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{null, !1425, !1366, !1368, !1078, !1078, !1078}
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1191, file: !171, line: 1808, baseType: !1427, size: 64, align: 64, offset: 1216)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{!630, !1425, !1253}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1191, file: !171, line: 1816, baseType: !1078, size: 32, align: 32, offset: 1280)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1191, file: !171, line: 1825, baseType: !1432, size: 32, align: 32, offset: 1312)
!1432 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1191, file: !171, line: 1830, baseType: !1078, size: 32, align: 32, offset: 1344)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1191, file: !171, line: 1838, baseType: !1432, size: 32, align: 32, offset: 1376)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1191, file: !171, line: 1846, baseType: !1078, size: 32, align: 32, offset: 1408)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1191, file: !171, line: 1851, baseType: !1078, size: 32, align: 32, offset: 1440)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1191, file: !171, line: 1861, baseType: !1432, size: 32, align: 32, offset: 1472)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1191, file: !171, line: 1868, baseType: !1432, size: 32, align: 32, offset: 1504)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1191, file: !171, line: 1875, baseType: !1432, size: 32, align: 32, offset: 1536)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1191, file: !171, line: 1882, baseType: !1432, size: 32, align: 32, offset: 1568)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1191, file: !171, line: 1889, baseType: !1432, size: 32, align: 32, offset: 1600)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1191, file: !171, line: 1896, baseType: !1432, size: 32, align: 32, offset: 1632)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1191, file: !171, line: 1903, baseType: !1432, size: 32, align: 32, offset: 1664)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1191, file: !171, line: 1910, baseType: !1078, size: 32, align: 32, offset: 1696)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1191, file: !171, line: 1915, baseType: !1078, size: 32, align: 32, offset: 1728)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1191, file: !171, line: 1926, baseType: !1368, size: 64, align: 64, offset: 1792)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1191, file: !171, line: 1935, baseType: !1105, size: 64, align: 32, offset: 1856)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1191, file: !171, line: 1942, baseType: !1078, size: 32, align: 32, offset: 1920)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1191, file: !171, line: 1948, baseType: !1078, size: 32, align: 32, offset: 1952)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1191, file: !171, line: 1954, baseType: !1078, size: 32, align: 32, offset: 1984)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1191, file: !171, line: 1960, baseType: !1078, size: 32, align: 32, offset: 2016)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1191, file: !171, line: 1984, baseType: !1078, size: 32, align: 32, offset: 2048)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1191, file: !171, line: 1991, baseType: !1078, size: 32, align: 32, offset: 2080)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1191, file: !171, line: 1996, baseType: !1078, size: 32, align: 32, offset: 2112)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1191, file: !171, line: 2004, baseType: !1078, size: 32, align: 32, offset: 2144)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1191, file: !171, line: 2011, baseType: !1078, size: 32, align: 32, offset: 2176)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1191, file: !171, line: 2018, baseType: !1078, size: 32, align: 32, offset: 2208)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1191, file: !171, line: 2027, baseType: !1078, size: 32, align: 32, offset: 2240)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1191, file: !171, line: 2034, baseType: !1078, size: 32, align: 32, offset: 2272)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1191, file: !171, line: 2044, baseType: !1078, size: 32, align: 32, offset: 2304)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1191, file: !171, line: 2054, baseType: !1462, size: 64, align: 64, offset: 2368)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1191, file: !171, line: 2061, baseType: !1462, size: 64, align: 64, offset: 2432)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1191, file: !171, line: 2066, baseType: !1078, size: 32, align: 32, offset: 2496)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1191, file: !171, line: 2070, baseType: !1078, size: 32, align: 32, offset: 2528)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1191, file: !171, line: 2078, baseType: !1078, size: 32, align: 32, offset: 2560)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1191, file: !171, line: 2085, baseType: !1078, size: 32, align: 32, offset: 2592)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1191, file: !171, line: 2092, baseType: !1078, size: 32, align: 32, offset: 2624)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1191, file: !171, line: 2099, baseType: !1078, size: 32, align: 32, offset: 2656)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1191, file: !171, line: 2106, baseType: !1078, size: 32, align: 32, offset: 2688)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1191, file: !171, line: 2113, baseType: !1078, size: 32, align: 32, offset: 2720)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1191, file: !171, line: 2120, baseType: !1078, size: 32, align: 32, offset: 2752)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1191, file: !171, line: 2125, baseType: !1078, size: 32, align: 32, offset: 2784)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1191, file: !171, line: 2133, baseType: !1078, size: 32, align: 32, offset: 2816)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1191, file: !171, line: 2140, baseType: !1078, size: 32, align: 32, offset: 2848)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1191, file: !171, line: 2145, baseType: !1078, size: 32, align: 32, offset: 2880)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1191, file: !171, line: 2153, baseType: !1078, size: 32, align: 32, offset: 2912)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1191, file: !171, line: 2158, baseType: !1078, size: 32, align: 32, offset: 2944)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1191, file: !171, line: 2166, baseType: !69, size: 32, align: 32, offset: 2976)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1191, file: !171, line: 2173, baseType: !87, size: 32, align: 32, offset: 3008)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1191, file: !171, line: 2180, baseType: !111, size: 32, align: 32, offset: 3040)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1191, file: !171, line: 2187, baseType: !62, size: 32, align: 32, offset: 3072)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1191, file: !171, line: 2194, baseType: !130, size: 32, align: 32, offset: 3104)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1191, file: !171, line: 2203, baseType: !1078, size: 32, align: 32, offset: 3136)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1191, file: !171, line: 2209, baseType: !882, size: 32, align: 32, offset: 3168)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1191, file: !171, line: 2212, baseType: !1078, size: 32, align: 32, offset: 3200)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1191, file: !171, line: 2213, baseType: !1078, size: 32, align: 32, offset: 3232)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1191, file: !171, line: 2220, baseType: !829, size: 32, align: 32, offset: 3264)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1191, file: !171, line: 2232, baseType: !1078, size: 32, align: 32, offset: 3296)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1191, file: !171, line: 2243, baseType: !1078, size: 32, align: 32, offset: 3328)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1191, file: !171, line: 2249, baseType: !1078, size: 32, align: 32, offset: 3360)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1191, file: !171, line: 2256, baseType: !1078, size: 32, align: 32, offset: 3392)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1191, file: !171, line: 2263, baseType: !961, size: 64, align: 64, offset: 3456)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1191, file: !171, line: 2270, baseType: !961, size: 64, align: 64, offset: 3520)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1191, file: !171, line: 2277, baseType: !890, size: 32, align: 32, offset: 3584)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1191, file: !171, line: 2285, baseType: !829, size: 32, align: 32, offset: 3616)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1191, file: !171, line: 2367, baseType: !1498, size: 64, align: 64, offset: 3648)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DISubroutineType(types: !1500)
!1500 = !{!1078, !1425, !1087, !1078}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1191, file: !171, line: 2383, baseType: !1078, size: 32, align: 32, offset: 3712)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1191, file: !171, line: 2386, baseType: !1432, size: 32, align: 32, offset: 3744)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1191, file: !171, line: 2387, baseType: !1432, size: 32, align: 32, offset: 3776)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1191, file: !171, line: 2394, baseType: !1078, size: 32, align: 32, offset: 3808)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1191, file: !171, line: 2401, baseType: !1078, size: 32, align: 32, offset: 3840)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1191, file: !171, line: 2408, baseType: !1078, size: 32, align: 32, offset: 3872)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1191, file: !171, line: 2415, baseType: !1078, size: 32, align: 32, offset: 3904)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1191, file: !171, line: 2422, baseType: !1078, size: 32, align: 32, offset: 3936)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1191, file: !171, line: 2423, baseType: !1510, size: 64, align: 64, offset: 3968)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !171, line: 831, baseType: !1512)
!1512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !171, line: 826, size: 128, align: 32, elements: !1513)
!1513 = !{!1514, !1515, !1516, !1517}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1512, file: !171, line: 827, baseType: !1078, size: 32, align: 32)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1512, file: !171, line: 828, baseType: !1078, size: 32, align: 32, offset: 32)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1512, file: !171, line: 829, baseType: !1078, size: 32, align: 32, offset: 64)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1512, file: !171, line: 830, baseType: !1432, size: 32, align: 32, offset: 96)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1191, file: !171, line: 2430, baseType: !963, size: 64, align: 64, offset: 4032)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1191, file: !171, line: 2437, baseType: !963, size: 64, align: 64, offset: 4096)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1191, file: !171, line: 2444, baseType: !1432, size: 32, align: 32, offset: 4160)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1191, file: !171, line: 2451, baseType: !1432, size: 32, align: 32, offset: 4192)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1191, file: !171, line: 2458, baseType: !1078, size: 32, align: 32, offset: 4224)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1191, file: !171, line: 2469, baseType: !1078, size: 32, align: 32, offset: 4256)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1191, file: !171, line: 2475, baseType: !1078, size: 32, align: 32, offset: 4288)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1191, file: !171, line: 2481, baseType: !1078, size: 32, align: 32, offset: 4320)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1191, file: !171, line: 2485, baseType: !1078, size: 32, align: 32, offset: 4352)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1191, file: !171, line: 2489, baseType: !1078, size: 32, align: 32, offset: 4384)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1191, file: !171, line: 2493, baseType: !1078, size: 32, align: 32, offset: 4416)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1191, file: !171, line: 2501, baseType: !1078, size: 32, align: 32, offset: 4448)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1191, file: !171, line: 2506, baseType: !1078, size: 32, align: 32, offset: 4480)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1191, file: !171, line: 2510, baseType: !1078, size: 32, align: 32, offset: 4512)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1191, file: !171, line: 2514, baseType: !963, size: 64, align: 64, offset: 4544)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1191, file: !171, line: 2528, baseType: !1534, size: 64, align: 64, offset: 4608)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{null, !1425, !1118, !1078, !1078}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1191, file: !171, line: 2534, baseType: !1078, size: 32, align: 32, offset: 4672)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1191, file: !171, line: 2545, baseType: !1078, size: 32, align: 32, offset: 4704)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1191, file: !171, line: 2547, baseType: !1078, size: 32, align: 32, offset: 4736)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1191, file: !171, line: 2549, baseType: !1078, size: 32, align: 32, offset: 4768)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1191, file: !171, line: 2551, baseType: !1078, size: 32, align: 32, offset: 4800)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1191, file: !171, line: 2553, baseType: !1078, size: 32, align: 32, offset: 4832)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1191, file: !171, line: 2555, baseType: !1078, size: 32, align: 32, offset: 4864)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1191, file: !171, line: 2557, baseType: !1078, size: 32, align: 32, offset: 4896)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1191, file: !171, line: 2559, baseType: !1078, size: 32, align: 32, offset: 4928)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1191, file: !171, line: 2563, baseType: !1078, size: 32, align: 32, offset: 4960)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1191, file: !171, line: 2571, baseType: !1335, size: 64, align: 64, offset: 4992)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1191, file: !171, line: 2579, baseType: !1335, size: 64, align: 64, offset: 5056)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1191, file: !171, line: 2586, baseType: !1078, size: 32, align: 32, offset: 5120)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1191, file: !171, line: 2615, baseType: !1078, size: 32, align: 32, offset: 5152)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1191, file: !171, line: 2627, baseType: !1078, size: 32, align: 32, offset: 5184)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1191, file: !171, line: 2637, baseType: !1078, size: 32, align: 32, offset: 5216)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1191, file: !171, line: 2681, baseType: !1078, size: 32, align: 32, offset: 5248)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1191, file: !171, line: 2709, baseType: !963, size: 64, align: 64, offset: 5312)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1191, file: !171, line: 2716, baseType: !1556, size: 64, align: 64, offset: 5376)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64, align: 64)
!1557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1558)
!1558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !171, line: 3636, size: 896, align: 64, elements: !1559)
!1559 = !{!1560, !1561, !1562, !1563, !1564, !1565, !1566, !1572, !1576, !1577, !1578, !1579, !1585, !1586, !1587, !1588, !1589}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1558, file: !171, line: 3642, baseType: !1200, size: 64, align: 64)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1558, file: !171, line: 3649, baseType: !161, size: 32, align: 32, offset: 64)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1558, file: !171, line: 3656, baseType: !170, size: 32, align: 32, offset: 96)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1558, file: !171, line: 3663, baseType: !630, size: 32, align: 32, offset: 128)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1558, file: !171, line: 3669, baseType: !1078, size: 32, align: 32, offset: 160)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1558, file: !171, line: 3682, baseType: !1383, size: 64, align: 64, offset: 192)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1558, file: !171, line: 3698, baseType: !1567, size: 64, align: 64, offset: 256)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DISubroutineType(types: !1569)
!1569 = !{!1078, !1189, !1570, !958}
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1558, file: !171, line: 3712, baseType: !1573, size: 64, align: 64, offset: 320)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DISubroutineType(types: !1575)
!1575 = !{!1078, !1189, !1078, !1570, !958}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1558, file: !171, line: 3726, baseType: !1567, size: 64, align: 64, offset: 384)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1558, file: !171, line: 3737, baseType: !1279, size: 64, align: 64, offset: 448)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1558, file: !171, line: 3746, baseType: !1078, size: 32, align: 32, offset: 512)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1558, file: !171, line: 3757, baseType: !1580, size: 64, align: 64, offset: 576)
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1581, size: 64, align: 64)
!1581 = !DISubroutineType(types: !1582)
!1582 = !{null, !1583}
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !171, line: 3617, flags: DIFlagFwdDecl)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1558, file: !171, line: 3766, baseType: !1279, size: 64, align: 64, offset: 640)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1558, file: !171, line: 3774, baseType: !1279, size: 64, align: 64, offset: 704)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1558, file: !171, line: 3780, baseType: !1078, size: 32, align: 32, offset: 768)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1558, file: !171, line: 3785, baseType: !1078, size: 32, align: 32, offset: 800)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1558, file: !171, line: 3795, baseType: !1590, size: 64, align: 64, offset: 832)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64, align: 64)
!1591 = !DISubroutineType(types: !1592)
!1592 = !{!1078, !1189, !1130}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1191, file: !171, line: 2728, baseType: !1118, size: 64, align: 64, offset: 5440)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1191, file: !171, line: 2735, baseType: !1120, size: 512, align: 64, offset: 5504)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1191, file: !171, line: 2742, baseType: !1078, size: 32, align: 32, offset: 6016)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1191, file: !171, line: 2755, baseType: !1078, size: 32, align: 32, offset: 6048)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1191, file: !171, line: 2776, baseType: !1078, size: 32, align: 32, offset: 6080)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1191, file: !171, line: 2783, baseType: !1078, size: 32, align: 32, offset: 6112)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1191, file: !171, line: 2791, baseType: !1078, size: 32, align: 32, offset: 6144)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1191, file: !171, line: 2802, baseType: !1087, size: 64, align: 64, offset: 6208)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1191, file: !171, line: 2811, baseType: !1078, size: 32, align: 32, offset: 6272)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1191, file: !171, line: 2821, baseType: !1078, size: 32, align: 32, offset: 6304)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1191, file: !171, line: 2830, baseType: !1078, size: 32, align: 32, offset: 6336)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1191, file: !171, line: 2840, baseType: !1078, size: 32, align: 32, offset: 6368)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1191, file: !171, line: 2851, baseType: !1606, size: 64, align: 64, offset: 6400)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DISubroutineType(types: !1608)
!1608 = !{!1078, !1425, !1609, !1118, !1368, !1078, !1078}
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DISubroutineType(types: !1611)
!1611 = !{!1078, !1425, !1118}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1191, file: !171, line: 2871, baseType: !1613, size: 64, align: 64, offset: 6464)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DISubroutineType(types: !1615)
!1615 = !{!1078, !1425, !1616, !1118, !1368, !1078}
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DISubroutineType(types: !1618)
!1618 = !{!1078, !1425, !1118, !1078, !1078}
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1191, file: !171, line: 2878, baseType: !1078, size: 32, align: 32, offset: 6528)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1191, file: !171, line: 2885, baseType: !1078, size: 32, align: 32, offset: 6560)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1191, file: !171, line: 3005, baseType: !1078, size: 32, align: 32, offset: 6592)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1191, file: !171, line: 3013, baseType: !902, size: 32, align: 32, offset: 6624)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1191, file: !171, line: 3020, baseType: !902, size: 32, align: 32, offset: 6656)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1191, file: !171, line: 3027, baseType: !902, size: 32, align: 32, offset: 6688)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1191, file: !171, line: 3037, baseType: !1093, size: 64, align: 64, offset: 6720)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1191, file: !171, line: 3038, baseType: !1078, size: 32, align: 32, offset: 6784)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1191, file: !171, line: 3050, baseType: !961, size: 64, align: 64, offset: 6848)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1191, file: !171, line: 3065, baseType: !1078, size: 32, align: 32, offset: 6912)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1191, file: !171, line: 3083, baseType: !1078, size: 32, align: 32, offset: 6944)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1191, file: !171, line: 3092, baseType: !1105, size: 64, align: 32, offset: 6976)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1191, file: !171, line: 3099, baseType: !630, size: 32, align: 32, offset: 7040)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1191, file: !171, line: 3106, baseType: !1105, size: 64, align: 32, offset: 7072)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1191, file: !171, line: 3113, baseType: !1634, size: 64, align: 64, offset: 7168)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1636)
!1636 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !171, line: 740, baseType: !1637)
!1637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !171, line: 712, size: 384, align: 64, elements: !1638)
!1638 = !{!1639, !1640, !1641, !1642, !1643, !1644, !1647}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1637, file: !171, line: 713, baseType: !170, size: 32, align: 32)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1637, file: !171, line: 714, baseType: !161, size: 32, align: 32, offset: 32)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1637, file: !171, line: 720, baseType: !1200, size: 64, align: 64, offset: 64)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1637, file: !171, line: 724, baseType: !1200, size: 64, align: 64, offset: 128)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1637, file: !171, line: 728, baseType: !1078, size: 32, align: 32, offset: 192)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1637, file: !171, line: 734, baseType: !1645, size: 64, align: 64, offset: 256)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1200)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1637, file: !171, line: 739, baseType: !1648, size: 64, align: 64, offset: 320)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1270)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1191, file: !171, line: 3129, baseType: !963, size: 64, align: 64, offset: 7232)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1191, file: !171, line: 3130, baseType: !963, size: 64, align: 64, offset: 7296)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1191, file: !171, line: 3131, baseType: !963, size: 64, align: 64, offset: 7360)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1191, file: !171, line: 3132, baseType: !963, size: 64, align: 64, offset: 7424)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1191, file: !171, line: 3139, baseType: !1335, size: 64, align: 64, offset: 7488)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1191, file: !171, line: 3147, baseType: !1078, size: 32, align: 32, offset: 7552)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1191, file: !171, line: 3165, baseType: !1078, size: 32, align: 32, offset: 7584)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1191, file: !171, line: 3172, baseType: !1078, size: 32, align: 32, offset: 7616)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1191, file: !171, line: 3180, baseType: !1078, size: 32, align: 32, offset: 7648)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1191, file: !171, line: 3191, baseType: !1462, size: 64, align: 64, offset: 7680)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1191, file: !171, line: 3199, baseType: !1093, size: 64, align: 64, offset: 7744)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1191, file: !171, line: 3207, baseType: !1335, size: 64, align: 64, offset: 7808)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1191, file: !171, line: 3214, baseType: !960, size: 32, align: 32, offset: 7872)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1191, file: !171, line: 3224, baseType: !1355, size: 64, align: 64, offset: 7936)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1191, file: !171, line: 3225, baseType: !1078, size: 32, align: 32, offset: 8000)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1191, file: !171, line: 3249, baseType: !1130, size: 64, align: 64, offset: 8064)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1191, file: !171, line: 3256, baseType: !1078, size: 32, align: 32, offset: 8128)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1191, file: !171, line: 3271, baseType: !1078, size: 32, align: 32, offset: 8160)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1191, file: !171, line: 3279, baseType: !963, size: 64, align: 64, offset: 8192)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1191, file: !171, line: 3301, baseType: !1130, size: 64, align: 64, offset: 8256)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1191, file: !171, line: 3310, baseType: !1078, size: 32, align: 32, offset: 8320)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1191, file: !171, line: 3337, baseType: !1078, size: 32, align: 32, offset: 8352)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1191, file: !171, line: 3351, baseType: !1078, size: 32, align: 32, offset: 8384)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1191, file: !171, line: 3359, baseType: !1078, size: 32, align: 32, offset: 8416)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1084, file: !1083, line: 39, baseType: !1130, size: 64, align: 64, offset: 192)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !979, file: !22, line: 166, baseType: !1676, size: 1920, align: 64, offset: 4480)
!1676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1677, size: 1920, align: 64, elements: !1004)
!1677 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP9Frame", file: !22, line: 68, baseType: !1678)
!1678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP9Frame", file: !22, line: 59, size: 640, align: 64, elements: !1679)
!1679 = !{!1680, !1681, !1682, !1683, !1697, !1698, !1699}
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "tf", scope: !1678, file: !22, line: 60, baseType: !1082, size: 256, align: 64)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1678, file: !22, line: 61, baseType: !1130, size: 64, align: 64, offset: 256)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "segmentation_map", scope: !1678, file: !22, line: 62, baseType: !1093, size: 64, align: 64, offset: 320)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !1678, file: !22, line: 63, baseType: !1684, size: 64, align: 64, offset: 384)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP9mvrefPair", file: !22, line: 57, baseType: !1686)
!1686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP9mvrefPair", file: !22, line: 54, size: 96, align: 32, elements: !1687)
!1687 = !{!1688, !1696}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !1686, file: !22, line: 55, baseType: !1689, size: 64, align: 32)
!1689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1690, size: 64, align: 32, elements: !1010)
!1690 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP56mv", file: !1691, line: 69, baseType: !1692)
!1691 = !DIFile(filename: "libavcodec/vp56.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP56mv", file: !1691, line: 66, size: 32, align: 32, elements: !1693)
!1693 = !{!1694, !1695}
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1692, file: !1691, line: 67, baseType: !1057, size: 16, align: 16)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1692, file: !1691, line: 68, baseType: !1057, size: 16, align: 16, offset: 16)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !1686, file: !22, line: 56, baseType: !1025, size: 16, align: 8, offset: 64)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "uses_2pass", scope: !1678, file: !22, line: 64, baseType: !1078, size: 32, align: 32, offset: 448)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_buf", scope: !1678, file: !22, line: 66, baseType: !1130, size: 64, align: 64, offset: 512)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_picture_private", scope: !1678, file: !22, line: 67, baseType: !1118, size: 64, align: 64, offset: 576)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "td", scope: !975, file: !974, line: 93, baseType: !1701, size: 64, align: 64, offset: 6400)
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64, align: 64)
!1702 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP9TileData", file: !974, line: 89, baseType: !1703)
!1703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP9TileData", file: !974, line: 157, size: 617216, align: 256, elements: !1704)
!1704 = !{!1705, !1706, !1716, !1717, !1718, !1719, !1720, !1721, !1723, !1725, !1726, !1747, !1748, !1749, !1816, !1820, !1824, !1825, !1828, !1831, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1844, !1847, !1852, !1853, !1855, !1856, !1858, !1859, !1860, !1862, !1863}
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !1703, file: !974, line: 160, baseType: !972, size: 64, align: 64)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "c_b", scope: !1703, file: !974, line: 161, baseType: !1707, size: 64, align: 64, offset: 64)
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64, align: 64)
!1708 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP56RangeCoder", file: !1691, line: 92, baseType: !1709)
!1709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP56RangeCoder", file: !1691, line: 85, size: 256, align: 64, elements: !1710)
!1710 = !{!1711, !1712, !1713, !1714, !1715}
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1709, file: !1691, line: 86, baseType: !1078, size: 32, align: 32)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1709, file: !1691, line: 87, baseType: !1078, size: 32, align: 32, offset: 32)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1709, file: !1691, line: 89, baseType: !1570, size: 64, align: 64, offset: 64)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1709, file: !1691, line: 90, baseType: !1570, size: 64, align: 64, offset: 128)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "code_word", scope: !1709, file: !1691, line: 91, baseType: !960, size: 32, align: 32, offset: 192)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1703, file: !974, line: 162, baseType: !1707, size: 64, align: 64, offset: 128)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1703, file: !974, line: 163, baseType: !1078, size: 32, align: 32, offset: 192)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "row7", scope: !1703, file: !974, line: 163, baseType: !1078, size: 32, align: 32, offset: 224)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1703, file: !974, line: 163, baseType: !1078, size: 32, align: 32, offset: 256)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "col7", scope: !1703, file: !974, line: 163, baseType: !1078, size: 32, align: 32, offset: 288)
