; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--webvttenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--webvttenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!821 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!822 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !14, line: 1534, size: 32, align: 32, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829}
!824 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!825 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!826 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!827 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!828 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!829 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!830 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !837, !838, !839, !840, !841}
!832 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!833 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!834 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!835 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!836 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!837 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!838 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!839 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!840 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!841 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!842 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !843)
!843 = !{!844, !845, !846, !847, !848, !849, !850}
!844 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!845 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!846 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!847 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!848 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!849 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!850 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!851 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !14, line: 1175, size: 32, align: 32, elements: !852)
!852 = !{!853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880}
!853 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!854 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!855 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!856 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!857 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!858 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!859 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!860 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!861 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!862 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!863 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!864 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!865 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!866 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!867 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!868 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!869 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!870 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!871 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!872 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!873 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!874 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!875 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!876 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!877 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!878 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!879 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!880 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !{!888, !889}
!888 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!889 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!890 = !{!891, !1493}
!891 = distinct !DIGlobalVariable(name: "ff_webvtt_encoder", scope: !0, file: !892, line: 227, type: !893, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_webvtt_encoder)
!892 = !DIFile(filename: "libavcodec/webvttenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !895)
!895 = !{!896, !900, !901, !902, !903, !904, !913, !916, !919, !922, !928, !931, !973, !981, !982, !983, !985, !1392, !1398, !1403, !1407, !1408, !1448, !1468, !1472, !1473, !1477, !1481, !1482, !1486, !1487, !1488}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !894, file: !14, line: 3475, baseType: !897, size: 64, align: 64)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64, align: 64)
!898 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!899 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !894, file: !14, line: 3480, baseType: !897, size: 64, align: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !894, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !894, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !894, file: !14, line: 3487, baseType: !889, size: 32, align: 32, offset: 192)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !894, file: !14, line: 3488, baseType: !905, size: 64, align: 64, offset: 256)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !908, line: 61, baseType: !909)
!908 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !908, line: 58, size: 64, align: 32, elements: !910)
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !909, file: !908, line: 59, baseType: !889, size: 32, align: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !909, file: !908, line: 60, baseType: !889, size: 32, align: 32, offset: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !894, file: !14, line: 3489, baseType: !914, size: 64, align: 64, offset: 320)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !894, file: !14, line: 3490, baseType: !917, size: 64, align: 64, offset: 384)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !889)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !894, file: !14, line: 3491, baseType: !920, size: 64, align: 64, offset: 448)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !894, file: !14, line: 3492, baseType: !923, size: 64, align: 64, offset: 512)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !926, line: 55, baseType: !927)
!926 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!927 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !894, file: !14, line: 3493, baseType: !929, size: 8, align: 8, offset: 576)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !926, line: 48, baseType: !930)
!930 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !894, file: !14, line: 3494, baseType: !932, size: 64, align: 64, offset: 640)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !936)
!936 = !{!937, !938, !943, !947, !948, !949, !950, !954, !960, !962, !966}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !935, file: !691, line: 72, baseType: !897, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !935, file: !691, line: 78, baseType: !939, size: 64, align: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!897, !942}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !935, file: !691, line: 85, baseType: !944, size: 64, align: 64, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !935, file: !691, line: 93, baseType: !889, size: 32, align: 32, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !935, file: !691, line: 99, baseType: !889, size: 32, align: 32, offset: 224)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !935, file: !691, line: 108, baseType: !889, size: 32, align: 32, offset: 256)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !935, file: !691, line: 113, baseType: !951, size: 64, align: 64, offset: 320)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!942, !942, !942}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !935, file: !691, line: 123, baseType: !955, size: 64, align: 64, offset: 384)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!958, !958}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !935, file: !691, line: 130, baseType: !961, size: 32, align: 32, offset: 448)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !935, file: !691, line: 136, baseType: !963, size: 64, align: 64, offset: 512)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!961, !942}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !935, file: !691, line: 142, baseType: !967, size: 64, align: 64, offset: 576)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!889, !970, !942, !897, !889}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !894, file: !14, line: 3495, baseType: !974, size: 64, align: 64, offset: 704)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !978)
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !977, file: !14, line: 3402, baseType: !889, size: 32, align: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !977, file: !14, line: 3403, baseType: !897, size: 64, align: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !894, file: !14, line: 3507, baseType: !897, size: 64, align: 64, offset: 768)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !894, file: !14, line: 3516, baseType: !889, size: 32, align: 32, offset: 832)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !894, file: !14, line: 3517, baseType: !984, size: 64, align: 64, offset: 896)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !894, file: !14, line: 3527, baseType: !986, size: 64, align: 64, offset: 960)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!889, !989}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !992)
!992 = !{!993, !994, !995, !996, !999, !1000, !1001, !1002, !1005, !1006, !1009, !1010, !1011, !1012, !1013, !1014, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1129, !1133, !1134, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1323, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !991, file: !14, line: 1561, baseType: !932, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !991, file: !14, line: 1562, baseType: !889, size: 32, align: 32, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !991, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !991, file: !14, line: 1565, baseType: !997, size: 64, align: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !894)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !991, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !991, file: !14, line: 1581, baseType: !888, size: 32, align: 32, offset: 224)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !991, file: !14, line: 1583, baseType: !942, size: 64, align: 64, offset: 256)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !991, file: !14, line: 1591, baseType: !1003, size: 64, align: 64, offset: 320)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !14, line: 1532, flags: DIFlagFwdDecl)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !991, file: !14, line: 1598, baseType: !942, size: 64, align: 64, offset: 384)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !991, file: !14, line: 1606, baseType: !1007, size: 64, align: 64, offset: 448)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !926, line: 40, baseType: !1008)
!1008 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !991, file: !14, line: 1614, baseType: !889, size: 32, align: 32, offset: 512)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !991, file: !14, line: 1622, baseType: !889, size: 32, align: 32, offset: 544)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !991, file: !14, line: 1628, baseType: !889, size: 32, align: 32, offset: 576)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !991, file: !14, line: 1636, baseType: !889, size: 32, align: 32, offset: 608)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !991, file: !14, line: 1643, baseType: !889, size: 32, align: 32, offset: 640)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !991, file: !14, line: 1657, baseType: !1015, size: 64, align: 64, offset: 704)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !991, file: !14, line: 1658, baseType: !889, size: 32, align: 32, offset: 768)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !991, file: !14, line: 1679, baseType: !907, size: 64, align: 32, offset: 800)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !991, file: !14, line: 1688, baseType: !889, size: 32, align: 32, offset: 864)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !991, file: !14, line: 1712, baseType: !889, size: 32, align: 32, offset: 896)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !991, file: !14, line: 1729, baseType: !889, size: 32, align: 32, offset: 928)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !991, file: !14, line: 1729, baseType: !889, size: 32, align: 32, offset: 960)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !991, file: !14, line: 1744, baseType: !889, size: 32, align: 32, offset: 992)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !991, file: !14, line: 1744, baseType: !889, size: 32, align: 32, offset: 1024)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !991, file: !14, line: 1751, baseType: !889, size: 32, align: 32, offset: 1056)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !991, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !991, file: !14, line: 1791, baseType: !1027, size: 64, align: 64, offset: 1152)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{null, !1030, !1031, !1128, !889, !889, !889}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1033)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1035)
!1035 = !{!1036, !1040, !1042, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1080, !1082, !1083, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1116, !1117, !1118, !1119, !1120, !1121, !1124, !1125, !1126, !1127}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1034, file: !722, line: 282, baseType: !1037, size: 512, align: 64)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1015, size: 512, align: 64, elements: !1038)
!1038 = !{!1039}
!1039 = !DISubrange(count: 8)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1034, file: !722, line: 299, baseType: !1041, size: 256, align: 32, offset: 512)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 256, align: 32, elements: !1038)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1034, file: !722, line: 315, baseType: !1043, size: 64, align: 64, offset: 768)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1034, file: !722, line: 326, baseType: !889, size: 32, align: 32, offset: 832)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1034, file: !722, line: 326, baseType: !889, size: 32, align: 32, offset: 864)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1034, file: !722, line: 334, baseType: !889, size: 32, align: 32, offset: 896)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1034, file: !722, line: 341, baseType: !889, size: 32, align: 32, offset: 928)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1034, file: !722, line: 346, baseType: !889, size: 32, align: 32, offset: 960)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1034, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1034, file: !722, line: 356, baseType: !907, size: 64, align: 32, offset: 1024)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1034, file: !722, line: 361, baseType: !1007, size: 64, align: 64, offset: 1088)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1034, file: !722, line: 369, baseType: !1007, size: 64, align: 64, offset: 1152)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1034, file: !722, line: 377, baseType: !1007, size: 64, align: 64, offset: 1216)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1034, file: !722, line: 382, baseType: !889, size: 32, align: 32, offset: 1280)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1034, file: !722, line: 386, baseType: !889, size: 32, align: 32, offset: 1312)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1034, file: !722, line: 391, baseType: !889, size: 32, align: 32, offset: 1344)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1034, file: !722, line: 396, baseType: !942, size: 64, align: 64, offset: 1408)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1034, file: !722, line: 403, baseType: !1059, size: 512, align: 64, offset: 1472)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 512, align: 64, elements: !1038)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1034, file: !722, line: 410, baseType: !889, size: 32, align: 32, offset: 1984)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1034, file: !722, line: 415, baseType: !889, size: 32, align: 32, offset: 2016)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1034, file: !722, line: 420, baseType: !889, size: 32, align: 32, offset: 2048)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1034, file: !722, line: 425, baseType: !889, size: 32, align: 32, offset: 2080)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1034, file: !722, line: 435, baseType: !1007, size: 64, align: 64, offset: 2112)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1034, file: !722, line: 440, baseType: !889, size: 32, align: 32, offset: 2176)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1034, file: !722, line: 445, baseType: !925, size: 64, align: 64, offset: 2240)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1034, file: !722, line: 459, baseType: !1068, size: 512, align: 64, offset: 2304)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1069, size: 512, align: 64, elements: !1038)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1071, line: 94, baseType: !1072)
!1071 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1071, line: 81, size: 192, align: 64, elements: !1073)
!1073 = !{!1074, !1078, !1079}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1072, file: !1071, line: 82, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1071, line: 73, baseType: !1077)
!1077 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1071, line: 73, flags: DIFlagFwdDecl)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1072, file: !1071, line: 89, baseType: !1015, size: 64, align: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1072, file: !1071, line: 93, baseType: !889, size: 32, align: 32, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1034, file: !722, line: 473, baseType: !1081, size: 64, align: 64, offset: 2816)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1034, file: !722, line: 477, baseType: !889, size: 32, align: 32, offset: 2880)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1034, file: !722, line: 479, baseType: !1084, size: 64, align: 64, offset: 2944)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1087)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1088)
!1088 = !{!1089, !1090, !1091, !1092, !1097}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1087, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1087, file: !722, line: 203, baseType: !1015, size: 64, align: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1087, file: !722, line: 204, baseType: !889, size: 32, align: 32, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1087, file: !722, line: 205, baseType: !1093, size: 64, align: 64, offset: 192)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1095, line: 86, baseType: !1096)
!1095 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1096 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1095, line: 86, flags: DIFlagFwdDecl)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1087, file: !722, line: 206, baseType: !1069, size: 64, align: 64, offset: 256)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1034, file: !722, line: 480, baseType: !889, size: 32, align: 32, offset: 3008)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1034, file: !722, line: 505, baseType: !889, size: 32, align: 32, offset: 3040)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1034, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1034, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1034, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1034, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1034, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1034, file: !722, line: 532, baseType: !1007, size: 64, align: 64, offset: 3264)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1034, file: !722, line: 539, baseType: !1007, size: 64, align: 64, offset: 3328)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1034, file: !722, line: 547, baseType: !1007, size: 64, align: 64, offset: 3392)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1034, file: !722, line: 554, baseType: !1093, size: 64, align: 64, offset: 3456)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1034, file: !722, line: 563, baseType: !889, size: 32, align: 32, offset: 3520)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1034, file: !722, line: 572, baseType: !889, size: 32, align: 32, offset: 3552)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1034, file: !722, line: 581, baseType: !889, size: 32, align: 32, offset: 3584)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1034, file: !722, line: 588, baseType: !1113, size: 64, align: 64, offset: 3648)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !926, line: 36, baseType: !1115)
!1115 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1034, file: !722, line: 593, baseType: !889, size: 32, align: 32, offset: 3712)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1034, file: !722, line: 596, baseType: !889, size: 32, align: 32, offset: 3744)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1034, file: !722, line: 599, baseType: !1069, size: 64, align: 64, offset: 3776)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1034, file: !722, line: 605, baseType: !1069, size: 64, align: 64, offset: 3840)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1034, file: !722, line: 616, baseType: !1069, size: 64, align: 64, offset: 3904)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1034, file: !722, line: 626, baseType: !1122, size: 64, align: 64, offset: 3968)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1123, line: 216, baseType: !927)
!1123 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1034, file: !722, line: 627, baseType: !1122, size: 64, align: 64, offset: 4032)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1034, file: !722, line: 628, baseType: !1122, size: 64, align: 64, offset: 4096)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1034, file: !722, line: 629, baseType: !1122, size: 64, align: 64, offset: 4160)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1034, file: !722, line: 645, baseType: !1069, size: 64, align: 64, offset: 4224)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !991, file: !14, line: 1808, baseType: !1130, size: 64, align: 64, offset: 1216)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!473, !1030, !914}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !991, file: !14, line: 1816, baseType: !889, size: 32, align: 32, offset: 1280)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !991, file: !14, line: 1825, baseType: !1135, size: 32, align: 32, offset: 1312)
!1135 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !991, file: !14, line: 1830, baseType: !889, size: 32, align: 32, offset: 1344)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !991, file: !14, line: 1838, baseType: !1135, size: 32, align: 32, offset: 1376)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !991, file: !14, line: 1846, baseType: !889, size: 32, align: 32, offset: 1408)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !991, file: !14, line: 1851, baseType: !889, size: 32, align: 32, offset: 1440)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !991, file: !14, line: 1861, baseType: !1135, size: 32, align: 32, offset: 1472)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !991, file: !14, line: 1868, baseType: !1135, size: 32, align: 32, offset: 1504)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !991, file: !14, line: 1875, baseType: !1135, size: 32, align: 32, offset: 1536)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !991, file: !14, line: 1882, baseType: !1135, size: 32, align: 32, offset: 1568)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !991, file: !14, line: 1889, baseType: !1135, size: 32, align: 32, offset: 1600)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !991, file: !14, line: 1896, baseType: !1135, size: 32, align: 32, offset: 1632)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !991, file: !14, line: 1903, baseType: !1135, size: 32, align: 32, offset: 1664)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !991, file: !14, line: 1910, baseType: !889, size: 32, align: 32, offset: 1696)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !991, file: !14, line: 1915, baseType: !889, size: 32, align: 32, offset: 1728)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !991, file: !14, line: 1926, baseType: !1128, size: 64, align: 64, offset: 1792)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !991, file: !14, line: 1935, baseType: !907, size: 64, align: 32, offset: 1856)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !991, file: !14, line: 1942, baseType: !889, size: 32, align: 32, offset: 1920)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !991, file: !14, line: 1948, baseType: !889, size: 32, align: 32, offset: 1952)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !991, file: !14, line: 1954, baseType: !889, size: 32, align: 32, offset: 1984)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !991, file: !14, line: 1960, baseType: !889, size: 32, align: 32, offset: 2016)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !991, file: !14, line: 1984, baseType: !889, size: 32, align: 32, offset: 2048)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !991, file: !14, line: 1991, baseType: !889, size: 32, align: 32, offset: 2080)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !991, file: !14, line: 1996, baseType: !889, size: 32, align: 32, offset: 2112)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !991, file: !14, line: 2004, baseType: !889, size: 32, align: 32, offset: 2144)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !991, file: !14, line: 2011, baseType: !889, size: 32, align: 32, offset: 2176)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !991, file: !14, line: 2018, baseType: !889, size: 32, align: 32, offset: 2208)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !991, file: !14, line: 2027, baseType: !889, size: 32, align: 32, offset: 2240)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !991, file: !14, line: 2034, baseType: !889, size: 32, align: 32, offset: 2272)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !991, file: !14, line: 2044, baseType: !889, size: 32, align: 32, offset: 2304)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !991, file: !14, line: 2054, baseType: !1165, size: 64, align: 64, offset: 2368)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !926, line: 49, baseType: !1167)
!1167 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !991, file: !14, line: 2061, baseType: !1165, size: 64, align: 64, offset: 2432)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !991, file: !14, line: 2066, baseType: !889, size: 32, align: 32, offset: 2496)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !991, file: !14, line: 2070, baseType: !889, size: 32, align: 32, offset: 2528)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !991, file: !14, line: 2078, baseType: !889, size: 32, align: 32, offset: 2560)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !991, file: !14, line: 2085, baseType: !889, size: 32, align: 32, offset: 2592)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !991, file: !14, line: 2092, baseType: !889, size: 32, align: 32, offset: 2624)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !991, file: !14, line: 2099, baseType: !889, size: 32, align: 32, offset: 2656)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !991, file: !14, line: 2106, baseType: !889, size: 32, align: 32, offset: 2688)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !991, file: !14, line: 2113, baseType: !889, size: 32, align: 32, offset: 2720)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !991, file: !14, line: 2120, baseType: !889, size: 32, align: 32, offset: 2752)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !991, file: !14, line: 2125, baseType: !889, size: 32, align: 32, offset: 2784)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !991, file: !14, line: 2133, baseType: !889, size: 32, align: 32, offset: 2816)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !991, file: !14, line: 2140, baseType: !889, size: 32, align: 32, offset: 2848)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !991, file: !14, line: 2145, baseType: !889, size: 32, align: 32, offset: 2880)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !991, file: !14, line: 2153, baseType: !889, size: 32, align: 32, offset: 2912)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !991, file: !14, line: 2158, baseType: !889, size: 32, align: 32, offset: 2944)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !991, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !991, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !991, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !991, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !991, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !991, file: !14, line: 2203, baseType: !889, size: 32, align: 32, offset: 3136)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !991, file: !14, line: 2209, baseType: !822, size: 32, align: 32, offset: 3168)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !991, file: !14, line: 2212, baseType: !889, size: 32, align: 32, offset: 3200)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !991, file: !14, line: 2213, baseType: !889, size: 32, align: 32, offset: 3232)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !991, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !991, file: !14, line: 2232, baseType: !889, size: 32, align: 32, offset: 3296)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !991, file: !14, line: 2243, baseType: !889, size: 32, align: 32, offset: 3328)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !991, file: !14, line: 2249, baseType: !889, size: 32, align: 32, offset: 3360)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !991, file: !14, line: 2256, baseType: !889, size: 32, align: 32, offset: 3392)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !991, file: !14, line: 2263, baseType: !925, size: 64, align: 64, offset: 3456)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !991, file: !14, line: 2270, baseType: !925, size: 64, align: 64, offset: 3520)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !991, file: !14, line: 2277, baseType: !830, size: 32, align: 32, offset: 3584)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !991, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !991, file: !14, line: 2367, baseType: !1203, size: 64, align: 64, offset: 3648)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!889, !1030, !1206, !889}
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !991, file: !14, line: 2383, baseType: !889, size: 32, align: 32, offset: 3712)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !991, file: !14, line: 2386, baseType: !1135, size: 32, align: 32, offset: 3744)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !991, file: !14, line: 2387, baseType: !1135, size: 32, align: 32, offset: 3776)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !991, file: !14, line: 2394, baseType: !889, size: 32, align: 32, offset: 3808)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !991, file: !14, line: 2401, baseType: !889, size: 32, align: 32, offset: 3840)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !991, file: !14, line: 2408, baseType: !889, size: 32, align: 32, offset: 3872)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !991, file: !14, line: 2415, baseType: !889, size: 32, align: 32, offset: 3904)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !991, file: !14, line: 2422, baseType: !889, size: 32, align: 32, offset: 3936)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !991, file: !14, line: 2423, baseType: !1216, size: 64, align: 64, offset: 3968)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1219)
!1219 = !{!1220, !1221, !1222, !1223}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1218, file: !14, line: 827, baseType: !889, size: 32, align: 32)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1218, file: !14, line: 828, baseType: !889, size: 32, align: 32, offset: 32)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1218, file: !14, line: 829, baseType: !889, size: 32, align: 32, offset: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1218, file: !14, line: 830, baseType: !1135, size: 32, align: 32, offset: 96)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !991, file: !14, line: 2430, baseType: !1007, size: 64, align: 64, offset: 4032)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !991, file: !14, line: 2437, baseType: !1007, size: 64, align: 64, offset: 4096)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !991, file: !14, line: 2444, baseType: !1135, size: 32, align: 32, offset: 4160)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !991, file: !14, line: 2451, baseType: !1135, size: 32, align: 32, offset: 4192)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !991, file: !14, line: 2458, baseType: !889, size: 32, align: 32, offset: 4224)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !991, file: !14, line: 2469, baseType: !889, size: 32, align: 32, offset: 4256)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !991, file: !14, line: 2475, baseType: !889, size: 32, align: 32, offset: 4288)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !991, file: !14, line: 2481, baseType: !889, size: 32, align: 32, offset: 4320)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !991, file: !14, line: 2485, baseType: !889, size: 32, align: 32, offset: 4352)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !991, file: !14, line: 2489, baseType: !889, size: 32, align: 32, offset: 4384)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !991, file: !14, line: 2493, baseType: !889, size: 32, align: 32, offset: 4416)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !991, file: !14, line: 2501, baseType: !889, size: 32, align: 32, offset: 4448)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !991, file: !14, line: 2506, baseType: !889, size: 32, align: 32, offset: 4480)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !991, file: !14, line: 2510, baseType: !889, size: 32, align: 32, offset: 4512)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !991, file: !14, line: 2514, baseType: !1007, size: 64, align: 64, offset: 4544)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !991, file: !14, line: 2528, baseType: !1240, size: 64, align: 64, offset: 4608)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{null, !1030, !942, !889, !889}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !991, file: !14, line: 2534, baseType: !889, size: 32, align: 32, offset: 4672)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !991, file: !14, line: 2545, baseType: !889, size: 32, align: 32, offset: 4704)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !991, file: !14, line: 2547, baseType: !889, size: 32, align: 32, offset: 4736)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !991, file: !14, line: 2549, baseType: !889, size: 32, align: 32, offset: 4768)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !991, file: !14, line: 2551, baseType: !889, size: 32, align: 32, offset: 4800)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !991, file: !14, line: 2553, baseType: !889, size: 32, align: 32, offset: 4832)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !991, file: !14, line: 2555, baseType: !889, size: 32, align: 32, offset: 4864)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !991, file: !14, line: 2557, baseType: !889, size: 32, align: 32, offset: 4896)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !991, file: !14, line: 2559, baseType: !889, size: 32, align: 32, offset: 4928)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !991, file: !14, line: 2563, baseType: !889, size: 32, align: 32, offset: 4960)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !991, file: !14, line: 2571, baseType: !1254, size: 64, align: 64, offset: 4992)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !991, file: !14, line: 2579, baseType: !1254, size: 64, align: 64, offset: 5056)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !991, file: !14, line: 2586, baseType: !889, size: 32, align: 32, offset: 5120)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !991, file: !14, line: 2615, baseType: !889, size: 32, align: 32, offset: 5152)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !991, file: !14, line: 2627, baseType: !889, size: 32, align: 32, offset: 5184)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !991, file: !14, line: 2637, baseType: !889, size: 32, align: 32, offset: 5216)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !991, file: !14, line: 2681, baseType: !889, size: 32, align: 32, offset: 5248)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !991, file: !14, line: 2709, baseType: !1007, size: 64, align: 64, offset: 5312)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !991, file: !14, line: 2716, baseType: !1263, size: 64, align: 64, offset: 5376)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1265)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1266)
!1266 = !{!1267, !1268, !1269, !1270, !1271, !1272, !1276, !1283, !1287, !1288, !1289, !1290, !1296, !1297, !1298, !1299, !1300}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1265, file: !14, line: 3642, baseType: !897, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1265, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1265, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1265, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1265, file: !14, line: 3669, baseType: !889, size: 32, align: 32, offset: 160)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1265, file: !14, line: 3682, baseType: !1273, size: 64, align: 64, offset: 192)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!889, !989, !1206}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1265, file: !14, line: 3698, baseType: !1277, size: 64, align: 64, offset: 256)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{!889, !989, !1280, !1282}
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !926, line: 51, baseType: !888)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1265, file: !14, line: 3712, baseType: !1284, size: 64, align: 64, offset: 320)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!889, !989, !889, !1280, !1282}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1265, file: !14, line: 3726, baseType: !1277, size: 64, align: 64, offset: 384)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1265, file: !14, line: 3737, baseType: !986, size: 64, align: 64, offset: 448)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1265, file: !14, line: 3746, baseType: !889, size: 32, align: 32, offset: 512)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1265, file: !14, line: 3757, baseType: !1291, size: 64, align: 64, offset: 576)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{null, !1294}
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1265, file: !14, line: 3766, baseType: !986, size: 64, align: 64, offset: 640)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1265, file: !14, line: 3774, baseType: !986, size: 64, align: 64, offset: 704)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1265, file: !14, line: 3780, baseType: !889, size: 32, align: 32, offset: 768)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1265, file: !14, line: 3785, baseType: !889, size: 32, align: 32, offset: 800)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1265, file: !14, line: 3795, baseType: !1301, size: 64, align: 64, offset: 832)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!889, !989, !1069}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !991, file: !14, line: 2728, baseType: !942, size: 64, align: 64, offset: 5440)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !991, file: !14, line: 2735, baseType: !1059, size: 512, align: 64, offset: 5504)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !991, file: !14, line: 2742, baseType: !889, size: 32, align: 32, offset: 6016)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !991, file: !14, line: 2755, baseType: !889, size: 32, align: 32, offset: 6048)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !991, file: !14, line: 2776, baseType: !889, size: 32, align: 32, offset: 6080)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !991, file: !14, line: 2783, baseType: !889, size: 32, align: 32, offset: 6112)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !991, file: !14, line: 2791, baseType: !889, size: 32, align: 32, offset: 6144)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !991, file: !14, line: 2802, baseType: !1206, size: 64, align: 64, offset: 6208)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !991, file: !14, line: 2811, baseType: !889, size: 32, align: 32, offset: 6272)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !991, file: !14, line: 2821, baseType: !889, size: 32, align: 32, offset: 6304)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !991, file: !14, line: 2830, baseType: !889, size: 32, align: 32, offset: 6336)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !991, file: !14, line: 2840, baseType: !889, size: 32, align: 32, offset: 6368)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !991, file: !14, line: 2851, baseType: !1317, size: 64, align: 64, offset: 6400)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!889, !1030, !1320, !942, !1128, !889, !889}
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{!889, !1030, !942}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !991, file: !14, line: 2871, baseType: !1324, size: 64, align: 64, offset: 6464)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!889, !1030, !1327, !942, !1128, !889}
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!889, !1030, !942, !889, !889}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !991, file: !14, line: 2878, baseType: !889, size: 32, align: 32, offset: 6528)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !991, file: !14, line: 2885, baseType: !889, size: 32, align: 32, offset: 6560)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !991, file: !14, line: 3005, baseType: !889, size: 32, align: 32, offset: 6592)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !991, file: !14, line: 3013, baseType: !842, size: 32, align: 32, offset: 6624)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !991, file: !14, line: 3020, baseType: !842, size: 32, align: 32, offset: 6656)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !991, file: !14, line: 3027, baseType: !842, size: 32, align: 32, offset: 6688)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !991, file: !14, line: 3037, baseType: !1015, size: 64, align: 64, offset: 6720)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !991, file: !14, line: 3038, baseType: !889, size: 32, align: 32, offset: 6784)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !991, file: !14, line: 3050, baseType: !925, size: 64, align: 64, offset: 6848)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !991, file: !14, line: 3065, baseType: !889, size: 32, align: 32, offset: 6912)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !991, file: !14, line: 3083, baseType: !889, size: 32, align: 32, offset: 6944)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !991, file: !14, line: 3092, baseType: !907, size: 64, align: 32, offset: 6976)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !991, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !991, file: !14, line: 3106, baseType: !907, size: 64, align: 32, offset: 7072)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !991, file: !14, line: 3113, baseType: !1345, size: 64, align: 64, offset: 7168)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1347)
!1347 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1348)
!1348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1349)
!1349 = !{!1350, !1351, !1352, !1353, !1354, !1355, !1358}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1348, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1348, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1348, file: !14, line: 720, baseType: !897, size: 64, align: 64, offset: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1348, file: !14, line: 724, baseType: !897, size: 64, align: 64, offset: 128)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1348, file: !14, line: 728, baseType: !889, size: 32, align: 32, offset: 192)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1348, file: !14, line: 734, baseType: !1356, size: 64, align: 64, offset: 256)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !897)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1348, file: !14, line: 739, baseType: !1359, size: 64, align: 64, offset: 320)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !991, file: !14, line: 3129, baseType: !1007, size: 64, align: 64, offset: 7232)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !991, file: !14, line: 3130, baseType: !1007, size: 64, align: 64, offset: 7296)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !991, file: !14, line: 3131, baseType: !1007, size: 64, align: 64, offset: 7360)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !991, file: !14, line: 3132, baseType: !1007, size: 64, align: 64, offset: 7424)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !991, file: !14, line: 3139, baseType: !1254, size: 64, align: 64, offset: 7488)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !991, file: !14, line: 3147, baseType: !889, size: 32, align: 32, offset: 7552)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !991, file: !14, line: 3165, baseType: !889, size: 32, align: 32, offset: 7584)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !991, file: !14, line: 3172, baseType: !889, size: 32, align: 32, offset: 7616)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !991, file: !14, line: 3180, baseType: !889, size: 32, align: 32, offset: 7648)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !991, file: !14, line: 3191, baseType: !1165, size: 64, align: 64, offset: 7680)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !991, file: !14, line: 3199, baseType: !1015, size: 64, align: 64, offset: 7744)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !991, file: !14, line: 3207, baseType: !1254, size: 64, align: 64, offset: 7808)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !991, file: !14, line: 3214, baseType: !888, size: 32, align: 32, offset: 7872)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !991, file: !14, line: 3224, baseType: !1375, size: 64, align: 64, offset: 7936)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1377)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1378)
!1378 = !{!1379, !1380, !1381}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1377, file: !14, line: 1412, baseType: !1015, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1377, file: !14, line: 1413, baseType: !889, size: 32, align: 32, offset: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1377, file: !14, line: 1414, baseType: !851, size: 32, align: 32, offset: 96)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !991, file: !14, line: 3225, baseType: !889, size: 32, align: 32, offset: 8000)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !991, file: !14, line: 3249, baseType: !1069, size: 64, align: 64, offset: 8064)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !991, file: !14, line: 3256, baseType: !889, size: 32, align: 32, offset: 8128)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !991, file: !14, line: 3271, baseType: !889, size: 32, align: 32, offset: 8160)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !991, file: !14, line: 3279, baseType: !1007, size: 64, align: 64, offset: 8192)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !991, file: !14, line: 3301, baseType: !1069, size: 64, align: 64, offset: 8256)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !991, file: !14, line: 3310, baseType: !889, size: 32, align: 32, offset: 8320)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !991, file: !14, line: 3337, baseType: !889, size: 32, align: 32, offset: 8352)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !991, file: !14, line: 3351, baseType: !889, size: 32, align: 32, offset: 8384)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !991, file: !14, line: 3359, baseType: !889, size: 32, align: 32, offset: 8416)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !894, file: !14, line: 3535, baseType: !1393, size: 64, align: 64, offset: 1024)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DISubroutineType(types: !1395)
!1395 = !{!889, !989, !1396}
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !894, file: !14, line: 3541, baseType: !1399, size: 64, align: 64, offset: 1088)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1401)
!1401 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1402)
!1402 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !14, line: 3461, flags: DIFlagFwdDecl)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !894, file: !14, line: 3549, baseType: !1404, size: 64, align: 64, offset: 1152)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DISubroutineType(types: !1406)
!1406 = !{null, !984}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !894, file: !14, line: 3551, baseType: !986, size: 64, align: 64, offset: 1216)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !894, file: !14, line: 3552, baseType: !1409, size: 64, align: 64, offset: 1280)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DISubroutineType(types: !1411)
!1411 = !{!889, !989, !1015, !889, !1412}
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1414)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1415)
!1415 = !{!1416, !1417, !1418, !1419, !1420, !1447}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1414, file: !14, line: 3921, baseType: !1166, size: 16, align: 16)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1414, file: !14, line: 3922, baseType: !1282, size: 32, align: 32, offset: 32)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1414, file: !14, line: 3923, baseType: !1282, size: 32, align: 32, offset: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1414, file: !14, line: 3924, baseType: !888, size: 32, align: 32, offset: 96)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1414, file: !14, line: 3925, baseType: !1421, size: 64, align: 64, offset: 128)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1424)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1425)
!1425 = !{!1426, !1427, !1428, !1429, !1430, !1431, !1437, !1441, !1443, !1444, !1445, !1446}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1424, file: !14, line: 3886, baseType: !889, size: 32, align: 32)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1424, file: !14, line: 3887, baseType: !889, size: 32, align: 32, offset: 32)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1424, file: !14, line: 3888, baseType: !889, size: 32, align: 32, offset: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1424, file: !14, line: 3889, baseType: !889, size: 32, align: 32, offset: 96)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1424, file: !14, line: 3890, baseType: !889, size: 32, align: 32, offset: 128)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1424, file: !14, line: 3897, baseType: !1432, size: 768, align: 64, offset: 192)
!1432 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1433)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1434)
!1434 = !{!1435, !1436}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1433, file: !14, line: 3855, baseType: !1037, size: 512, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1433, file: !14, line: 3857, baseType: !1041, size: 256, align: 32, offset: 512)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1424, file: !14, line: 3903, baseType: !1438, size: 256, align: 64, offset: 960)
!1438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1015, size: 256, align: 64, elements: !1439)
!1439 = !{!1440}
!1440 = !DISubrange(count: 4)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1424, file: !14, line: 3904, baseType: !1442, size: 128, align: 32, offset: 1216)
!1442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 128, align: 32, elements: !1439)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1424, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1424, file: !14, line: 3908, baseType: !1254, size: 64, align: 64, offset: 1408)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1424, file: !14, line: 3915, baseType: !1254, size: 64, align: 64, offset: 1472)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1424, file: !14, line: 3917, baseType: !889, size: 32, align: 32, offset: 1536)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1414, file: !14, line: 3926, baseType: !1007, size: 64, align: 64, offset: 192)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !894, file: !14, line: 3564, baseType: !1449, size: 64, align: 64, offset: 1344)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DISubroutineType(types: !1451)
!1451 = !{!889, !989, !1452, !1031, !1128}
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1454)
!1454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1455)
!1455 = !{!1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1454, file: !14, line: 1451, baseType: !1069, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1454, file: !14, line: 1461, baseType: !1007, size: 64, align: 64, offset: 64)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1454, file: !14, line: 1467, baseType: !1007, size: 64, align: 64, offset: 128)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1454, file: !14, line: 1468, baseType: !1015, size: 64, align: 64, offset: 192)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1454, file: !14, line: 1469, baseType: !889, size: 32, align: 32, offset: 256)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1454, file: !14, line: 1470, baseType: !889, size: 32, align: 32, offset: 288)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1454, file: !14, line: 1474, baseType: !889, size: 32, align: 32, offset: 320)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1454, file: !14, line: 1479, baseType: !1375, size: 64, align: 64, offset: 384)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1454, file: !14, line: 1480, baseType: !889, size: 32, align: 32, offset: 448)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1454, file: !14, line: 1486, baseType: !1007, size: 64, align: 64, offset: 512)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1454, file: !14, line: 1488, baseType: !1007, size: 64, align: 64, offset: 576)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1454, file: !14, line: 1497, baseType: !1007, size: 64, align: 64, offset: 640)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !894, file: !14, line: 3566, baseType: !1469, size: 64, align: 64, offset: 1408)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DISubroutineType(types: !1471)
!1471 = !{!889, !989, !942, !1128, !1452}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !894, file: !14, line: 3567, baseType: !986, size: 64, align: 64, offset: 1472)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !894, file: !14, line: 3576, baseType: !1474, size: 64, align: 64, offset: 1536)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64, align: 64)
!1475 = !DISubroutineType(types: !1476)
!1476 = !{!889, !989, !1031}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !894, file: !14, line: 3577, baseType: !1478, size: 64, align: 64, offset: 1600)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DISubroutineType(types: !1480)
!1480 = !{!889, !989, !1452}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !894, file: !14, line: 3584, baseType: !1273, size: 64, align: 64, offset: 1664)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !894, file: !14, line: 3589, baseType: !1483, size: 64, align: 64, offset: 1728)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DISubroutineType(types: !1485)
!1485 = !{null, !989}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !894, file: !14, line: 3594, baseType: !889, size: 32, align: 32, offset: 1792)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !894, file: !14, line: 3600, baseType: !897, size: 64, align: 64, offset: 1856)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !894, file: !14, line: 3609, baseType: !1489, size: 64, align: 64, offset: 1920)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1492)
!1492 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1493 = distinct !DIGlobalVariable(name: "webvtt_callbacks", scope: !0, file: !892, line: 144, type: !1494, isLocal: true, isDefinition: true, variable: %struct.ASSCodesCallbacks* @webvtt_callbacks)
!1494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1495)
!1495 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASSCodesCallbacks", file: !1496, line: 184, baseType: !1497)
!1496 = !DIFile(filename: "libavcodec/ass_split.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1497 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1496, line: 154, size: 768, align: 64, elements: !1498)
!1498 = !{!1499, !1503, !1507, !1511, !1515, !1519, !1523, !1524, !1525, !1526, !1530, !1531}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1497, file: !1496, line: 159, baseType: !1500, size: 64, align: 64)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{null, !942, !897, !889}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "new_line", scope: !1497, file: !1496, line: 160, baseType: !1504, size: 64, align: 64, offset: 64)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{null, !942, !889}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1497, file: !1496, line: 161, baseType: !1508, size: 64, align: 64, offset: 128)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DISubroutineType(types: !1510)
!1510 = !{null, !942, !899, !889}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1497, file: !1496, line: 162, baseType: !1512, size: 64, align: 64, offset: 192)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64, align: 64)
!1513 = !DISubroutineType(types: !1514)
!1514 = !{null, !942, !888, !888}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1497, file: !1496, line: 163, baseType: !1516, size: 64, align: 64, offset: 256)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DISubroutineType(types: !1518)
!1518 = !{null, !942, !889, !889}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "font_name", scope: !1497, file: !1496, line: 164, baseType: !1520, size: 64, align: 64, offset: 320)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DISubroutineType(types: !1522)
!1522 = !{null, !942, !897}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "font_size", scope: !1497, file: !1496, line: 165, baseType: !1504, size: 64, align: 64, offset: 384)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1497, file: !1496, line: 166, baseType: !1504, size: 64, align: 64, offset: 448)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "cancel_overrides", scope: !1497, file: !1496, line: 167, baseType: !1520, size: 64, align: 64, offset: 512)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "move", scope: !1497, file: !1496, line: 174, baseType: !1527, size: 64, align: 64, offset: 576)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64, align: 64)
!1528 = !DISubroutineType(types: !1529)
!1529 = !{null, !942, !889, !889, !889, !889, !889, !889}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !1497, file: !1496, line: 175, baseType: !1516, size: 64, align: 64, offset: 640)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1497, file: !1496, line: 182, baseType: !1532, size: 64, align: 64, offset: 704)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64, align: 64)
!1533 = !DISubroutineType(types: !1534)
!1534 = !{null, !942}
!1535 = !{i32 2, !"Dwarf Version", i32 4}
!1536 = !{i32 2, !"Debug Info Version", i32 3}
!1537 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1538 = distinct !DISubprogram(name: "webvtt_encode_init", scope: !892, file: !892, line: 218, type: !987, isLocal: true, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1539)
!1539 = !{}
!1540 = !DILocalVariable(name: "avctx", arg: 1, scope: !1538, file: !892, line: 218, type: !989)
!1541 = !DIExpression()
!1542 = !DILocation(line: 218, column: 69, scope: !1538)
!1543 = !DILocalVariable(name: "s", scope: !1538, file: !892, line: 220, type: !1544)
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DIDerivedType(tag: DW_TAG_typedef, name: "WebVTTContext", file: !892, line: 39, baseType: !1546)
!1546 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !892, line: 31, size: 8960, align: 64, elements: !1547)
!1547 = !{!1548, !1549, !1553, !1570, !1571, !1572, !1576}
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1546, file: !892, line: 32, baseType: !989, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "ass_ctx", scope: !1546, file: !892, line: 33, baseType: !1550, size: 64, align: 64, offset: 64)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASSSplitContext", file: !1496, line: 101, baseType: !1552)
!1552 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASSSplitContext", file: !1496, line: 101, flags: DIFlagFwdDecl)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1546, file: !892, line: 34, baseType: !1554, size: 8192, align: 64, offset: 128)
!1554 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBPrint", file: !1555, line: 82, baseType: !1556)
!1555 = !DIFile(filename: "./libavutil/bprint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBPrint", file: !1555, line: 82, size: 8192, align: 64, elements: !1557)
!1557 = !{!1558, !1559, !1560, !1561, !1562, !1566}
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1556, file: !1555, line: 82, baseType: !1254, size: 64, align: 64)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1556, file: !1555, line: 82, baseType: !888, size: 32, align: 32, offset: 64)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1556, file: !1555, line: 82, baseType: !888, size: 32, align: 32, offset: 96)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "size_max", scope: !1556, file: !1555, line: 82, baseType: !888, size: 32, align: 32, offset: 128)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_internal_buffer", scope: !1556, file: !1555, line: 82, baseType: !1563, size: 8, align: 8, offset: 160)
!1563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 8, align: 8, elements: !1564)
!1564 = !{!1565}
!1565 = !DISubrange(count: 1)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_padding", scope: !1556, file: !1555, line: 82, baseType: !1567, size: 8000, align: 8, offset: 168)
!1567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 8000, align: 8, elements: !1568)
!1568 = !{!1569}
!1569 = !DISubrange(count: 1000)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp_end", scope: !1546, file: !892, line: 35, baseType: !888, size: 32, align: 32, offset: 8320)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1546, file: !892, line: 36, baseType: !889, size: 32, align: 32, offset: 8352)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !1546, file: !892, line: 37, baseType: !1573, size: 512, align: 8, offset: 8384)
!1573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 512, align: 8, elements: !1574)
!1574 = !{!1575}
!1575 = !DISubrange(count: 64)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "stack_ptr", scope: !1546, file: !892, line: 38, baseType: !889, size: 32, align: 32, offset: 8896)
!1577 = !DILocation(line: 220, column: 20, scope: !1538)
!1578 = !DILocation(line: 220, column: 24, scope: !1538)
!1579 = !DILocation(line: 220, column: 31, scope: !1538)
!1580 = !DILocation(line: 221, column: 16, scope: !1538)
!1581 = !DILocation(line: 221, column: 5, scope: !1538)
!1582 = !DILocation(line: 221, column: 8, scope: !1538)
!1583 = !DILocation(line: 221, column: 14, scope: !1538)
!1584 = !DILocation(line: 222, column: 31, scope: !1538)
!1585 = !DILocation(line: 222, column: 38, scope: !1538)
!1586 = !DILocation(line: 222, column: 18, scope: !1538)
!1587 = !DILocation(line: 222, column: 5, scope: !1538)
!1588 = !DILocation(line: 222, column: 8, scope: !1538)
!1589 = !DILocation(line: 222, column: 16, scope: !1538)
!1590 = !DILocation(line: 223, column: 21, scope: !1538)
!1591 = !DILocation(line: 223, column: 24, scope: !1538)
!1592 = !DILocation(line: 223, column: 5, scope: !1538)
!1593 = !DILocation(line: 224, column: 12, scope: !1538)
!1594 = !DILocation(line: 224, column: 15, scope: !1538)
!1595 = !DILocation(line: 224, column: 5, scope: !1538)
!1596 = distinct !DISubprogram(name: "webvtt_encode_frame", scope: !892, file: !892, line: 157, type: !1597, isLocal: true, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1539)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{!889, !989, !1599, !889, !1600}
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1602)
!1602 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitle", file: !14, line: 3927, baseType: !1414)
!1603 = !DILocalVariable(name: "avctx", arg: 1, scope: !1596, file: !892, line: 157, type: !989)
!1604 = !DILocation(line: 157, column: 48, scope: !1596)
!1605 = !DILocalVariable(name: "buf", arg: 2, scope: !1596, file: !892, line: 158, type: !1599)
!1606 = !DILocation(line: 158, column: 47, scope: !1596)
!1607 = !DILocalVariable(name: "bufsize", arg: 3, scope: !1596, file: !892, line: 158, type: !889)
!1608 = !DILocation(line: 158, column: 56, scope: !1596)
!1609 = !DILocalVariable(name: "sub", arg: 4, scope: !1596, file: !892, line: 158, type: !1600)
!1610 = !DILocation(line: 158, column: 83, scope: !1596)
!1611 = !DILocalVariable(name: "s", scope: !1596, file: !892, line: 160, type: !1544)
!1612 = !DILocation(line: 160, column: 20, scope: !1596)
!1613 = !DILocation(line: 160, column: 24, scope: !1596)
!1614 = !DILocation(line: 160, column: 31, scope: !1596)
!1615 = !DILocalVariable(name: "dialog", scope: !1596, file: !892, line: 161, type: !1616)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASSDialog", file: !1496, line: 85, baseType: !1618)
!1618 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1496, line: 71, size: 512, align: 64, elements: !1619)
!1619 = !{!1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630}
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "readorder", scope: !1618, file: !1496, line: 72, baseType: !889, size: 32, align: 32)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1618, file: !1496, line: 73, baseType: !889, size: 32, align: 32, offset: 32)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1618, file: !1496, line: 74, baseType: !889, size: 32, align: 32, offset: 64)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1618, file: !1496, line: 75, baseType: !889, size: 32, align: 32, offset: 96)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1618, file: !1496, line: 76, baseType: !1254, size: 64, align: 64, offset: 128)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1618, file: !1496, line: 77, baseType: !1254, size: 64, align: 64, offset: 192)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "margin_l", scope: !1618, file: !1496, line: 78, baseType: !889, size: 32, align: 32, offset: 256)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "margin_r", scope: !1618, file: !1496, line: 79, baseType: !889, size: 32, align: 32, offset: 288)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "margin_v", scope: !1618, file: !1496, line: 80, baseType: !889, size: 32, align: 32, offset: 320)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !1618, file: !1496, line: 81, baseType: !1254, size: 64, align: 64, offset: 384)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1618, file: !1496, line: 82, baseType: !1254, size: 64, align: 64, offset: 448)
!1631 = !DILocation(line: 161, column: 16, scope: !1596)
!1632 = !DILocalVariable(name: "i", scope: !1596, file: !892, line: 162, type: !889)
!1633 = !DILocation(line: 162, column: 9, scope: !1596)
!1634 = !DILocation(line: 164, column: 22, scope: !1596)
!1635 = !DILocation(line: 164, column: 25, scope: !1596)
!1636 = !DILocation(line: 164, column: 5, scope: !1596)
!1637 = !DILocation(line: 166, column: 11, scope: !1638)
!1638 = distinct !DILexicalBlock(scope: !1596, file: !892, line: 166, column: 5)
!1639 = !DILocation(line: 166, column: 10, scope: !1638)
!1640 = !DILocation(line: 166, column: 15, scope: !1641)
!1641 = !DILexicalBlockFile(scope: !1642, file: !892, discriminator: 1)
!1642 = distinct !DILexicalBlock(scope: !1638, file: !892, line: 166, column: 5)
!1643 = !DILocation(line: 166, column: 17, scope: !1641)
!1644 = !DILocation(line: 166, column: 22, scope: !1641)
!1645 = !DILocation(line: 166, column: 16, scope: !1641)
!1646 = !DILocation(line: 166, column: 5, scope: !1641)
!1647 = !DILocalVariable(name: "ass", scope: !1648, file: !892, line: 167, type: !897)
!1648 = distinct !DILexicalBlock(scope: !1642, file: !892, line: 166, column: 38)
!1649 = !DILocation(line: 167, column: 21, scope: !1648)
!1650 = !DILocation(line: 167, column: 38, scope: !1648)
!1651 = !DILocation(line: 167, column: 27, scope: !1648)
!1652 = !DILocation(line: 167, column: 32, scope: !1648)
!1653 = !DILocation(line: 167, column: 42, scope: !1648)
!1654 = !DILocation(line: 169, column: 24, scope: !1655)
!1655 = distinct !DILexicalBlock(scope: !1648, file: !892, line: 169, column: 13)
!1656 = !DILocation(line: 169, column: 13, scope: !1655)
!1657 = !DILocation(line: 169, column: 18, scope: !1655)
!1658 = !DILocation(line: 169, column: 28, scope: !1655)
!1659 = !DILocation(line: 169, column: 33, scope: !1655)
!1660 = !DILocation(line: 169, column: 13, scope: !1648)
!1661 = !DILocation(line: 170, column: 20, scope: !1662)
!1662 = distinct !DILexicalBlock(scope: !1655, file: !892, line: 169, column: 50)
!1663 = !DILocation(line: 170, column: 13, scope: !1662)
!1664 = !DILocation(line: 171, column: 13, scope: !1662)
!1665 = !DILocation(line: 175, column: 22, scope: !1666)
!1666 = distinct !DILexicalBlock(scope: !1648, file: !892, line: 175, column: 13)
!1667 = !DILocation(line: 175, column: 14, scope: !1666)
!1668 = !DILocation(line: 175, column: 13, scope: !1648)
!1669 = !DILocalVariable(name: "num", scope: !1670, file: !892, line: 176, type: !889)
!1670 = distinct !DILexicalBlock(scope: !1666, file: !892, line: 175, column: 46)
!1671 = !DILocation(line: 176, column: 17, scope: !1670)
!1672 = !DILocation(line: 177, column: 42, scope: !1670)
!1673 = !DILocation(line: 177, column: 45, scope: !1670)
!1674 = !DILocation(line: 177, column: 54, scope: !1670)
!1675 = !DILocation(line: 177, column: 22, scope: !1670)
!1676 = !DILocation(line: 177, column: 20, scope: !1670)
!1677 = !DILocation(line: 179, column: 9, scope: !1670)
!1678 = !DILocation(line: 179, column: 16, scope: !1679)
!1679 = !DILexicalBlockFile(scope: !1680, file: !892, discriminator: 1)
!1680 = distinct !DILexicalBlock(scope: !1681, file: !892, line: 179, column: 9)
!1681 = distinct !DILexicalBlock(scope: !1670, file: !892, line: 179, column: 9)
!1682 = !DILocation(line: 179, column: 23, scope: !1679)
!1683 = !DILocation(line: 179, column: 29, scope: !1684)
!1684 = !DILexicalBlockFile(scope: !1680, file: !892, discriminator: 2)
!1685 = !DILocation(line: 179, column: 23, scope: !1684)
!1686 = !DILocation(line: 179, column: 9, scope: !1687)
!1687 = !DILexicalBlockFile(scope: !1681, file: !892, discriminator: 3)
!1688 = !DILocation(line: 180, column: 32, scope: !1689)
!1689 = distinct !DILexicalBlock(scope: !1680, file: !892, line: 179, column: 43)
!1690 = !DILocation(line: 180, column: 35, scope: !1689)
!1691 = !DILocation(line: 180, column: 43, scope: !1689)
!1692 = !DILocation(line: 180, column: 13, scope: !1689)
!1693 = !DILocation(line: 181, column: 60, scope: !1689)
!1694 = !DILocation(line: 181, column: 63, scope: !1689)
!1695 = !DILocation(line: 181, column: 71, scope: !1689)
!1696 = !DILocation(line: 181, column: 13, scope: !1689)
!1697 = !DILocation(line: 182, column: 9, scope: !1689)
!1698 = !DILocation(line: 179, column: 39, scope: !1699)
!1699 = !DILexicalBlockFile(scope: !1680, file: !892, discriminator: 4)
!1700 = !DILocation(line: 179, column: 9, scope: !1699)
!1701 = distinct !{!1701, !1677}
!1702 = !DILocation(line: 183, column: 9, scope: !1670)
!1703 = !DILocation(line: 185, column: 43, scope: !1704)
!1704 = distinct !DILexicalBlock(scope: !1666, file: !892, line: 183, column: 16)
!1705 = !DILocation(line: 185, column: 46, scope: !1704)
!1706 = !DILocation(line: 185, column: 55, scope: !1704)
!1707 = !DILocation(line: 185, column: 22, scope: !1704)
!1708 = !DILocation(line: 185, column: 20, scope: !1704)
!1709 = !DILocation(line: 186, column: 18, scope: !1710)
!1710 = distinct !DILexicalBlock(scope: !1704, file: !892, line: 186, column: 17)
!1711 = !DILocation(line: 186, column: 17, scope: !1704)
!1712 = !DILocation(line: 187, column: 17, scope: !1710)
!1713 = !DILocation(line: 188, column: 32, scope: !1704)
!1714 = !DILocation(line: 188, column: 35, scope: !1704)
!1715 = !DILocation(line: 188, column: 43, scope: !1704)
!1716 = !DILocation(line: 188, column: 13, scope: !1704)
!1717 = !DILocation(line: 189, column: 60, scope: !1704)
!1718 = !DILocation(line: 189, column: 63, scope: !1704)
!1719 = !DILocation(line: 189, column: 71, scope: !1704)
!1720 = !DILocation(line: 189, column: 13, scope: !1704)
!1721 = !DILocation(line: 190, column: 13, scope: !1704)
!1722 = !DILocation(line: 194, column: 5, scope: !1648)
!1723 = !DILocation(line: 166, column: 34, scope: !1724)
