; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--aacsbr.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--aacsbr.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon = type { i8*, i8*, i32, i32 }
%struct.VLC = type { i32, [2 x i16]*, i32, i32 }
%struct.AACContext = type { %struct.AVClass*, %struct.AVCodecContext*, %struct.AVFrame*, i32, %struct.DynamicRangeControl, [4 x [16 x %struct.ChannelElement*]], [4 x [16 x %struct.ChannelElement*]], i32, i32, [1024 x float], %struct.FFTContext, %struct.FFTContext, %struct.FFTContext, %struct.FFTContext, %struct.MDCT15Context*, %struct.MDCT15Context*, %struct.MDCT15Context*, %struct.AVFloatDSPContext*, i32, [64 x %struct.SingleChannelElement*], i32, i32, [16 x i8], [128 x float], [2 x %struct.OutputConfiguration], i32, i32, i32, void (%struct.AACContext*, %struct.SingleChannelElement*)*, void (%struct.AACContext*, %struct.SingleChannelElement*)*, void (float*, %struct.TemporalNoiseShaping*, %struct.IndividualChannelStream*, i32)*, void (%struct.AACContext*, float*, float*, %struct.IndividualChannelStream*)*, void (%struct.AACContext*, %struct.SingleChannelElement*)*, void (i32*, i32)*, void (i32*, i32*, i32, i32, i32, i8*)*, [8 x i8] }

!942 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !936, line: 42, size: 32, align: 32, elements: !943)
!943 = !{!944, !945, !946, !947, !948, !949, !950, !951, !952, !953}
!944 = !DIEnumerator(name: "T_HUFFMAN_ENV_1_5DB", value: 0)
!945 = !DIEnumerator(name: "F_HUFFMAN_ENV_1_5DB", value: 1)
!946 = !DIEnumerator(name: "T_HUFFMAN_ENV_BAL_1_5DB", value: 2)
!947 = !DIEnumerator(name: "F_HUFFMAN_ENV_BAL_1_5DB", value: 3)
!948 = !DIEnumerator(name: "T_HUFFMAN_ENV_3_0DB", value: 4)
!949 = !DIEnumerator(name: "F_HUFFMAN_ENV_3_0DB", value: 5)
!950 = !DIEnumerator(name: "T_HUFFMAN_ENV_BAL_3_0DB", value: 6)
!951 = !DIEnumerator(name: "F_HUFFMAN_ENV_BAL_3_0DB", value: 7)
!952 = !DIEnumerator(name: "T_HUFFMAN_NOISE_3_0DB", value: 8)
!953 = !DIEnumerator(name: "T_HUFFMAN_NOISE_BAL_3_0DB", value: 9)
!954 = !{!955, !959, !965, !969, !970, !973, !977, !986, !988, !958, !992, !985}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTFLOAT", file: !957, line: 86, baseType: !958)
!957 = !DIFile(filename: "libavcodec/aac_defines.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!958 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 65536, align: 32, elements: !962)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!962 = !{!963, !963, !964}
!963 = !DISubrange(count: 32)
!964 = !DISubrange(count: 2)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 2560, align: 32, elements: !967)
!967 = !{!968, !964}
!968 = !DISubrange(count: 40)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 64, align: 32, elements: !972)
!972 = !{!964}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 4096, align: 32, elements: !975)
!975 = !{!976, !964}
!976 = !DISubrange(count: 64)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !980, line: 221, size: 32, align: 8, elements: !981)
!980 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!981 = !{!982}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !979, file: !980, line: 221, baseType: !983, size: 32, align: 32)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !984, line: 51, baseType: !985)
!984 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!985 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !984, line: 48, baseType: !987)
!987 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !984, line: 37, baseType: !991)
!991 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!992 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!993 = !{!994, !999, !1018, !1022, !1026, !1030, !1034, !1038, !1042, !1046, !1047, !1051, !1055, !1068, !1073, !1076, !1077, !1078, !1082, !1084, !1085, !1086, !1090, !1092, !1093, !1094, !1101, !1103, !1104, !1105, !1107, !1108, !1109, !1110, !1115, !1119, !2564, !2568, !2570, !2572, !2577, !2582, !2586}
!994 = distinct !DIGlobalVariable(name: "ff_sbr_noise_table", scope: !0, file: !995, line: 271, type: !996, isLocal: false, isDefinition: true, variable: [520 x [2 x float]]* @ff_sbr_noise_table)
!995 = !DIFile(filename: "libavcodec/aacsbrdata.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 33280, align: 32, elements: !997)
!997 = !{!998, !964}
!998 = !DISubrange(count: 520)
!999 = distinct !DIGlobalVariable(name: "sbr_tmp", scope: !1000, file: !1001, line: 54, type: !1005, isLocal: true, isDefinition: true, variable: [10 x %struct.anon]* @ff_aac_sbr_init.sbr_tmp)
!1000 = distinct !DISubprogram(name: "ff_aac_sbr_init", scope: !1001, file: !1001, line: 49, type: !1002, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1004)
!1001 = !DIFile(filename: "libavcodec/aacsbr_template.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1002 = !DISubroutineType(types: !1003)
!1003 = !{null}
!1004 = !{}
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 1920, align: 64, elements: !1016)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1000, file: !1001, line: 51, size: 192, align: 64, elements: !1008)
!1008 = !{!1009, !1012, !1013, !1015}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "sbr_codes", scope: !1007, file: !1001, line: 52, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "sbr_bits", scope: !1007, file: !1001, line: 52, baseType: !1010, size: 64, align: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !1007, file: !1001, line: 53, baseType: !1014, size: 32, align: 32, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "elem_size", scope: !1007, file: !1001, line: 53, baseType: !1014, size: 32, align: 32, offset: 160)
!1016 = !{!1017}
!1017 = !DISubrange(count: 10)
!1018 = distinct !DIGlobalVariable(name: "table", scope: !1000, file: !1001, line: 68, type: !1019, isLocal: true, isDefinition: true, variable: [1098 x [2 x i16]]* @ff_aac_sbr_init.table)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 35136, align: 16, elements: !1020)
!1020 = !{!1021, !964}
!1021 = !DISubrange(count: 1098)
!1022 = distinct !DIGlobalVariable(name: "table", scope: !1000, file: !1001, line: 69, type: !1023, isLocal: true, isDefinition: true, variable: [1092 x [2 x i16]]* @ff_aac_sbr_init.table.1)
!1023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 34944, align: 16, elements: !1024)
!1024 = !{!1025, !964}
!1025 = !DISubrange(count: 1092)
!1026 = distinct !DIGlobalVariable(name: "table", scope: !1000, file: !1001, line: 70, type: !1027, isLocal: true, isDefinition: true, variable: [768 x [2 x i16]]* @ff_aac_sbr_init.table.2)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 24576, align: 16, elements: !1028)
!1028 = !{!1029, !964}
!1029 = !DISubrange(count: 768)
!1030 = distinct !DIGlobalVariable(name: "table", scope: !1000, file: !1001, line: 71, type: !1031, isLocal: true, isDefinition: true, variable: [1026 x [2 x i16]]* @ff_aac_sbr_init.table.3)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 32832, align: 16, elements: !1032)
!1032 = !{!1033, !964}
!1033 = !DISubrange(count: 1026)
!1034 = distinct !DIGlobalVariable(name: "table", scope: !1000, file: !1001, line: 72, type: !1035, isLocal: true, isDefinition: true, variable: [1058 x [2 x i16]]* @ff_aac_sbr_init.table.4)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 33856, align: 16, elements: !1036)
!1036 = !{!1037, !964}
!1037 = !DISubrange(count: 1058)
!1038 = distinct !DIGlobalVariable(name: "table", scope: !1000, file: !1001, line: 73, type: !1039, isLocal: true, isDefinition: true, variable: [1052 x [2 x i16]]* @ff_aac_sbr_init.table.5)
!1039 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 33664, align: 16, elements: !1040)
!1040 = !{!1041, !964}
!1041 = !DISubrange(count: 1052)
!1042 = distinct !DIGlobalVariable(name: "table", scope: !1000, file: !1001, line: 74, type: !1043, isLocal: true, isDefinition: true, variable: [544 x [2 x i16]]* @ff_aac_sbr_init.table.6)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 17408, align: 16, elements: !1044)
!1044 = !{!1045, !964}
!1045 = !DISubrange(count: 544)
!1046 = distinct !DIGlobalVariable(name: "table", scope: !1000, file: !1001, line: 75, type: !1043, isLocal: true, isDefinition: true, variable: [544 x [2 x i16]]* @ff_aac_sbr_init.table.7)
!1047 = distinct !DIGlobalVariable(name: "table", scope: !1000, file: !1001, line: 76, type: !1048, isLocal: true, isDefinition: true, variable: [592 x [2 x i16]]* @ff_aac_sbr_init.table.8)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 18944, align: 16, elements: !1049)
!1049 = !{!1050, !964}
!1050 = !DISubrange(count: 592)
!1051 = distinct !DIGlobalVariable(name: "table", scope: !1000, file: !1001, line: 77, type: !1052, isLocal: true, isDefinition: true, variable: [512 x [2 x i16]]* @ff_aac_sbr_init.table.9)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 16384, align: 16, elements: !1053)
!1053 = !{!1054, !964}
!1054 = !DISubrange(count: 512)
!1055 = distinct !DIGlobalVariable(name: "vlc_sbr", scope: !0, file: !1056, line: 51, type: !1057, isLocal: true, isDefinition: true, variable: [10 x %struct.VLC]* @vlc_sbr)
!1056 = !DIFile(filename: "libavcodec/aacsbr.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1058, size: 1920, align: 64, elements: !1016)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "VLC", file: !1059, line: 30, baseType: !1060)
!1059 = !DIFile(filename: "libavcodec/vlc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VLC", file: !1059, line: 26, size: 192, align: 64, elements: !1061)
!1061 = !{!1062, !1063, !1066, !1067}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1060, file: !1059, line: 27, baseType: !992, size: 32, align: 32)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !1060, file: !1059, line: 28, baseType: !1064, size: 64, align: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 32, align: 16, elements: !972)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !1060, file: !1059, line: 29, baseType: !992, size: 32, align: 32, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "table_allocated", scope: !1060, file: !1059, line: 29, baseType: !992, size: 32, align: 32, offset: 160)
!1068 = distinct !DIGlobalVariable(name: "t_huffman_env_1_5dB_codes", scope: !0, file: !995, line: 56, type: !1069, isLocal: true, isDefinition: true, variable: [121 x i32]* @t_huffman_env_1_5dB_codes)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1070, size: 3872, align: 32, elements: !1071)
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!1071 = !{!1072}
!1072 = !DISubrange(count: 121)
!1073 = distinct !DIGlobalVariable(name: "t_huffman_env_1_5dB_bits", scope: !0, file: !995, line: 37, type: !1074, isLocal: true, isDefinition: true, variable: [121 x i8]* @t_huffman_env_1_5dB_bits)
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1075, size: 968, align: 8, elements: !1071)
!1075 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!1076 = distinct !DIGlobalVariable(name: "f_huffman_env_1_5dB_codes", scope: !0, file: !995, line: 94, type: !1069, isLocal: true, isDefinition: true, variable: [121 x i32]* @f_huffman_env_1_5dB_codes)
!1077 = distinct !DIGlobalVariable(name: "f_huffman_env_1_5dB_bits", scope: !0, file: !995, line: 75, type: !1074, isLocal: true, isDefinition: true, variable: [121 x i8]* @f_huffman_env_1_5dB_bits)
!1078 = distinct !DIGlobalVariable(name: "t_huffman_env_bal_1_5dB_codes", scope: !0, file: !995, line: 123, type: !1079, isLocal: true, isDefinition: true, variable: [49 x i32]* @t_huffman_env_bal_1_5dB_codes)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1070, size: 1568, align: 32, elements: !1080)
!1080 = !{!1081}
!1081 = !DISubrange(count: 49)
!1082 = distinct !DIGlobalVariable(name: "t_huffman_env_bal_1_5dB_bits", scope: !0, file: !995, line: 113, type: !1083, isLocal: true, isDefinition: true, variable: [49 x i8]* @t_huffman_env_bal_1_5dB_bits)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1075, size: 392, align: 8, elements: !1080)
!1084 = distinct !DIGlobalVariable(name: "f_huffman_env_bal_1_5dB_codes", scope: !0, file: !995, line: 143, type: !1079, isLocal: true, isDefinition: true, variable: [49 x i32]* @f_huffman_env_bal_1_5dB_codes)
!1085 = distinct !DIGlobalVariable(name: "f_huffman_env_bal_1_5dB_bits", scope: !0, file: !995, line: 133, type: !1083, isLocal: true, isDefinition: true, variable: [49 x i8]* @f_huffman_env_bal_1_5dB_bits)
!1086 = distinct !DIGlobalVariable(name: "t_huffman_env_3_0dB_codes", scope: !0, file: !995, line: 164, type: !1087, isLocal: true, isDefinition: true, variable: [63 x i32]* @t_huffman_env_3_0dB_codes)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1070, size: 2016, align: 32, elements: !1088)
!1088 = !{!1089}
!1089 = !DISubrange(count: 63)
!1090 = distinct !DIGlobalVariable(name: "t_huffman_env_3_0dB_bits", scope: !0, file: !995, line: 153, type: !1091, isLocal: true, isDefinition: true, variable: [63 x i8]* @t_huffman_env_3_0dB_bits)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1075, size: 504, align: 8, elements: !1088)
!1092 = distinct !DIGlobalVariable(name: "f_huffman_env_3_0dB_codes", scope: !0, file: !995, line: 186, type: !1087, isLocal: true, isDefinition: true, variable: [63 x i32]* @f_huffman_env_3_0dB_codes)
!1093 = distinct !DIGlobalVariable(name: "f_huffman_env_3_0dB_bits", scope: !0, file: !995, line: 175, type: !1091, isLocal: true, isDefinition: true, variable: [63 x i8]* @f_huffman_env_3_0dB_bits)
!1094 = distinct !DIGlobalVariable(name: "t_huffman_env_bal_3_0dB_codes", scope: !0, file: !995, line: 204, type: !1095, isLocal: true, isDefinition: true, variable: [25 x i16]* @t_huffman_env_bal_3_0dB_codes)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1096, size: 400, align: 16, elements: !1099)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !984, line: 49, baseType: !1098)
!1098 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1099 = !{!1100}
!1100 = !DISubrange(count: 25)
!1101 = distinct !DIGlobalVariable(name: "t_huffman_env_bal_3_0dB_bits", scope: !0, file: !995, line: 197, type: !1102, isLocal: true, isDefinition: true, variable: [25 x i8]* @t_huffman_env_bal_3_0dB_bits)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1075, size: 200, align: 8, elements: !1099)
!1103 = distinct !DIGlobalVariable(name: "f_huffman_env_bal_3_0dB_codes", scope: !0, file: !995, line: 218, type: !1095, isLocal: true, isDefinition: true, variable: [25 x i16]* @f_huffman_env_bal_3_0dB_codes)
!1104 = distinct !DIGlobalVariable(name: "f_huffman_env_bal_3_0dB_bits", scope: !0, file: !995, line: 211, type: !1102, isLocal: true, isDefinition: true, variable: [25 x i8]* @f_huffman_env_bal_3_0dB_bits)
!1105 = distinct !DIGlobalVariable(name: "t_huffman_noise_3_0dB_codes", scope: !0, file: !995, line: 236, type: !1106, isLocal: true, isDefinition: true, variable: [63 x i16]* @t_huffman_noise_3_0dB_codes)
!1106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1096, size: 1008, align: 16, elements: !1088)
!1107 = distinct !DIGlobalVariable(name: "t_huffman_noise_3_0dB_bits", scope: !0, file: !995, line: 225, type: !1091, isLocal: true, isDefinition: true, variable: [63 x i8]* @t_huffman_noise_3_0dB_bits)
!1108 = distinct !DIGlobalVariable(name: "t_huffman_noise_bal_3_0dB_codes", scope: !0, file: !995, line: 254, type: !1102, isLocal: true, isDefinition: true, variable: [25 x i8]* @t_huffman_noise_bal_3_0dB_codes)
!1109 = distinct !DIGlobalVariable(name: "t_huffman_noise_bal_3_0dB_bits", scope: !0, file: !995, line: 247, type: !1102, isLocal: true, isDefinition: true, variable: [25 x i8]* @t_huffman_noise_bal_3_0dB_bits)
!1110 = distinct !DIGlobalVariable(name: "sbr_qmf_window_us", scope: !0, file: !1111, line: 30, type: !1112, isLocal: true, isDefinition: true, variable: [640 x float]* @sbr_qmf_window_us)
!1111 = !DIFile(filename: "libavcodec/aacsbr_tablegen_common.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 20480, align: 32, elements: !1113)
!1113 = !{!1114}
!1114 = !DISubrange(count: 640)
!1115 = distinct !DIGlobalVariable(name: "sbr_qmf_window_ds", scope: !0, file: !1111, line: 29, type: !1116, isLocal: true, isDefinition: true, variable: [320 x float]* @sbr_qmf_window_ds)
!1116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 10240, align: 32, elements: !1117)
!1117 = !{!1118}
!1118 = !DISubrange(count: 320)
!1119 = distinct !DIGlobalVariable(name: "bands_warped", scope: !1120, file: !1001, line: 140, type: !2563, isLocal: true, isDefinition: true, variable: [3 x float]* @sbr_make_f_tablelim.bands_warped)
!1120 = distinct !DISubprogram(name: "sbr_make_f_tablelim", scope: !1001, file: !1001, line: 136, type: !1121, isLocal: true, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1004)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{null, !1123}
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpectralBandReplication", file: !1125, line: 115, baseType: !1126)
!1125 = !DIFile(filename: "libavcodec/sbr.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpectralBandReplication", file: !1125, line: 139, size: 3129856, align: 256, elements: !1127)
!1127 = !{!1128, !1129, !1130, !1131, !1132, !1133, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1154, !1156, !1157, !1158, !1159, !1236, !1356, !1357, !1358, !1359, !1361, !1363, !1364, !1366, !1370, !1371, !1373, !1374, !1377, !1380, !1383, !1385, !1386, !1389, !1390, !1392, !1393, !1394, !1395, !1396, !1399, !1445, !1446, !1496}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1126, file: !1125, line: 140, baseType: !992, size: 32, align: 32)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1126, file: !1125, line: 141, baseType: !992, size: 32, align: 32, offset: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "ready_for_dequant", scope: !1126, file: !1125, line: 142, baseType: !992, size: 32, align: 32, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "id_aac", scope: !1126, file: !1125, line: 143, baseType: !992, size: 32, align: 32, offset: 96)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !1126, file: !1125, line: 144, baseType: !992, size: 32, align: 32, offset: 128)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "spectrum_params", scope: !1126, file: !1125, line: 145, baseType: !1134, size: 48, align: 8, offset: 160)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpectrumParameters", file: !1125, line: 55, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpectrumParameters", file: !1125, line: 42, size: 48, align: 8, elements: !1136)
!1136 = !{!1137, !1138, !1139, !1140, !1141, !1142}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "bs_start_freq", scope: !1135, file: !1125, line: 43, baseType: !986, size: 8, align: 8)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "bs_stop_freq", scope: !1135, file: !1125, line: 44, baseType: !986, size: 8, align: 8, offset: 8)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "bs_xover_band", scope: !1135, file: !1125, line: 45, baseType: !986, size: 8, align: 8, offset: 16)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "bs_freq_scale", scope: !1135, file: !1125, line: 51, baseType: !986, size: 8, align: 8, offset: 24)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "bs_alter_scale", scope: !1135, file: !1125, line: 52, baseType: !986, size: 8, align: 8, offset: 32)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "bs_noise_bands", scope: !1135, file: !1125, line: 53, baseType: !986, size: 8, align: 8, offset: 40)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "bs_amp_res_header", scope: !1126, file: !1125, line: 146, baseType: !992, size: 32, align: 32, offset: 224)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "bs_limiter_bands", scope: !1126, file: !1125, line: 151, baseType: !985, size: 32, align: 32, offset: 256)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "bs_limiter_gains", scope: !1126, file: !1125, line: 152, baseType: !985, size: 32, align: 32, offset: 288)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "bs_interpol_freq", scope: !1126, file: !1125, line: 153, baseType: !985, size: 32, align: 32, offset: 320)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "bs_smoothing_mode", scope: !1126, file: !1125, line: 154, baseType: !985, size: 32, align: 32, offset: 352)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "bs_coupling", scope: !1126, file: !1125, line: 156, baseType: !985, size: 32, align: 32, offset: 384)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !1126, file: !1125, line: 157, baseType: !1150, size: 160, align: 32, offset: 416)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1151, size: 160, align: 32, elements: !1152)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "AAC_SIGNE", file: !957, line: 91, baseType: !985)
!1152 = !{!1153}
!1153 = !DISubrange(count: 5)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !1126, file: !1125, line: 160, baseType: !1155, size: 64, align: 32, offset: 576)
!1155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1151, size: 64, align: 32, elements: !972)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1126, file: !1125, line: 162, baseType: !1155, size: 64, align: 32, offset: 640)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "kx_and_m_pushed", scope: !1126, file: !1125, line: 163, baseType: !985, size: 32, align: 32, offset: 704)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "n_master", scope: !1126, file: !1125, line: 165, baseType: !1151, size: 32, align: 32, offset: 736)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1126, file: !1125, line: 166, baseType: !1160, size: 1407488, align: 256, offset: 768)
!1160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1161, size: 1407488, align: 256, elements: !972)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBRData", file: !1125, line: 113, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SBRData", file: !1125, line: 62, size: 703744, align: 256, elements: !1163)
!1163 = !{!1164, !1165, !1166, !1167, !1171, !1172, !1174, !1176, !1179, !1183, !1184, !1188, !1192, !1193, !1195, !1197, !1200, !1201, !1205, !1210, !1211, !1215, !1219, !1221, !1225, !1227, !1230, !1231, !1234, !1235}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "bs_frame_class", scope: !1162, file: !1125, line: 67, baseType: !985, size: 32, align: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "bs_add_harmonic_flag", scope: !1162, file: !1125, line: 68, baseType: !985, size: 32, align: 32, offset: 32)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "bs_num_env", scope: !1162, file: !1125, line: 69, baseType: !1151, size: 32, align: 32, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "bs_freq_res", scope: !1162, file: !1125, line: 70, baseType: !1168, size: 56, align: 8, offset: 96)
!1168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 56, align: 8, elements: !1169)
!1169 = !{!1170}
!1170 = !DISubrange(count: 7)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "bs_num_noise", scope: !1162, file: !1125, line: 71, baseType: !1151, size: 32, align: 32, offset: 160)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "bs_df_env", scope: !1162, file: !1125, line: 72, baseType: !1173, size: 40, align: 8, offset: 192)
!1173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 40, align: 8, elements: !1152)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "bs_df_noise", scope: !1162, file: !1125, line: 73, baseType: !1175, size: 16, align: 8, offset: 232)
!1175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 16, align: 8, elements: !972)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "bs_invf_mode", scope: !1162, file: !1125, line: 74, baseType: !1177, size: 80, align: 8, offset: 248)
!1177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 80, align: 8, elements: !1178)
!1178 = !{!964, !1153}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "bs_add_harmonic", scope: !1162, file: !1125, line: 75, baseType: !1180, size: 384, align: 8, offset: 328)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 384, align: 8, elements: !1181)
!1181 = !{!1182}
!1182 = !DISubrange(count: 48)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "bs_amp_res", scope: !1162, file: !1125, line: 76, baseType: !985, size: 32, align: 32, offset: 736)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "synthesis_filterbank_samples", scope: !1162, file: !1125, line: 83, baseType: !1185, size: 73728, align: 32, offset: 768)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 73728, align: 32, elements: !1186)
!1186 = !{!1187}
!1187 = !DISubrange(count: 2304)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "analysis_filterbank_samples", scope: !1162, file: !1125, line: 84, baseType: !1189, size: 41984, align: 32, offset: 74496)
!1189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 41984, align: 32, elements: !1190)
!1190 = !{!1191}
!1191 = !DISubrange(count: 1312)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "synthesis_filterbank_samples_offset", scope: !1162, file: !1125, line: 85, baseType: !992, size: 32, align: 32, offset: 116480)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "e_a", scope: !1162, file: !1125, line: 87, baseType: !1194, size: 64, align: 32, offset: 116512)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 64, align: 32, elements: !972)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "bw_array", scope: !1162, file: !1125, line: 89, baseType: !1196, size: 160, align: 32, offset: 116576)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 160, align: 32, elements: !1152)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !1162, file: !1125, line: 91, baseType: !1198, size: 131072, align: 32, offset: 116736)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 131072, align: 32, elements: !1199)
!1199 = !{!964, !963, !963, !964}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "Ypos", scope: !1162, file: !1125, line: 93, baseType: !992, size: 32, align: 32, offset: 247808)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "Y", scope: !1162, file: !1125, line: 94, baseType: !1202, size: 311296, align: 32, offset: 247936)
!1202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 311296, align: 32, elements: !1203)
!1203 = !{!964, !1204, !976, !964}
!1204 = !DISubrange(count: 38)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "g_temp", scope: !1162, file: !1125, line: 95, baseType: !1206, size: 64512, align: 32, offset: 559232)
!1206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1207, size: 64512, align: 32, elements: !1208)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "AAC_FLOAT", file: !957, line: 90, baseType: !958)
!1208 = !{!1209, !1182}
!1209 = !DISubrange(count: 42)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "q_temp", scope: !1162, file: !1125, line: 96, baseType: !1206, size: 64512, align: 32, offset: 623744)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "s_indexmapped", scope: !1162, file: !1125, line: 97, baseType: !1212, size: 3072, align: 8, offset: 688256)
!1212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 3072, align: 8, elements: !1213)
!1213 = !{!1214, !1182}
!1214 = !DISubrange(count: 8)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "env_facs_q", scope: !1162, file: !1125, line: 99, baseType: !1216, size: 2304, align: 8, offset: 691328)
!1216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 2304, align: 8, elements: !1217)
!1217 = !{!1218, !1182}
!1218 = !DISubrange(count: 6)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "env_facs", scope: !1162, file: !1125, line: 100, baseType: !1220, size: 9216, align: 32, offset: 693632)
!1220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1207, size: 9216, align: 32, elements: !1217)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "noise_facs_q", scope: !1162, file: !1125, line: 102, baseType: !1222, size: 120, align: 8, offset: 702848)
!1222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 120, align: 8, elements: !1223)
!1223 = !{!1224, !1153}
!1224 = !DISubrange(count: 3)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "noise_facs", scope: !1162, file: !1125, line: 103, baseType: !1226, size: 480, align: 32, offset: 702976)
!1226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1207, size: 480, align: 32, elements: !1223)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "t_env", scope: !1162, file: !1125, line: 105, baseType: !1228, size: 64, align: 8, offset: 703456)
!1228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 64, align: 8, elements: !1229)
!1229 = !{!1214}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "t_env_num_env_old", scope: !1162, file: !1125, line: 107, baseType: !986, size: 8, align: 8, offset: 703520)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "t_q", scope: !1162, file: !1125, line: 109, baseType: !1232, size: 24, align: 8, offset: 703528)
!1232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 24, align: 8, elements: !1233)
!1233 = !{!1224}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "f_indexnoise", scope: !1162, file: !1125, line: 110, baseType: !985, size: 32, align: 32, offset: 703552)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "f_indexsine", scope: !1162, file: !1125, line: 111, baseType: !985, size: 32, align: 32, offset: 703584)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "ps", scope: !1126, file: !1125, line: 167, baseType: !1237, size: 1072896, align: 128, offset: 1408256)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSContext", file: !1238, line: 79, baseType: !1239)
!1238 = !DIFile(filename: "libavcodec/aacps.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PSContext", file: !1238, line: 41, size: 1072896, align: 128, elements: !1240)
!1240 = !{!1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1257, !1263, !1264, !1265, !1266, !1267, !1268, !1272, !1277, !1282, !1285, !1286, !1287, !1290, !1291, !1292, !1293, !1296, !1297, !1299, !1300}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1239, file: !1238, line: 42, baseType: !992, size: 32, align: 32)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "enable_iid", scope: !1239, file: !1238, line: 43, baseType: !992, size: 32, align: 32, offset: 32)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "iid_quant", scope: !1239, file: !1238, line: 44, baseType: !992, size: 32, align: 32, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "nr_iid_par", scope: !1239, file: !1238, line: 45, baseType: !992, size: 32, align: 32, offset: 96)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "nr_ipdopd_par", scope: !1239, file: !1238, line: 46, baseType: !992, size: 32, align: 32, offset: 128)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "enable_icc", scope: !1239, file: !1238, line: 47, baseType: !992, size: 32, align: 32, offset: 160)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "icc_mode", scope: !1239, file: !1238, line: 48, baseType: !992, size: 32, align: 32, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "nr_icc_par", scope: !1239, file: !1238, line: 49, baseType: !992, size: 32, align: 32, offset: 224)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "enable_ext", scope: !1239, file: !1238, line: 50, baseType: !992, size: 32, align: 32, offset: 256)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "frame_class", scope: !1239, file: !1238, line: 51, baseType: !992, size: 32, align: 32, offset: 288)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "num_env_old", scope: !1239, file: !1238, line: 52, baseType: !992, size: 32, align: 32, offset: 320)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "num_env", scope: !1239, file: !1238, line: 53, baseType: !992, size: 32, align: 32, offset: 352)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "enable_ipdopd", scope: !1239, file: !1238, line: 54, baseType: !992, size: 32, align: 32, offset: 384)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "border_position", scope: !1239, file: !1238, line: 55, baseType: !1255, size: 192, align: 32, offset: 416)
!1255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 192, align: 32, elements: !1256)
!1256 = !{!1218}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "iid_par", scope: !1239, file: !1238, line: 56, baseType: !1258, size: 1360, align: 8, offset: 608)
!1258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1259, size: 1360, align: 8, elements: !1261)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !984, line: 36, baseType: !1260)
!1260 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1261 = !{!1153, !1262}
!1262 = !DISubrange(count: 34)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "icc_par", scope: !1239, file: !1238, line: 57, baseType: !1258, size: 1360, align: 8, offset: 1968)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "ipd_par", scope: !1239, file: !1238, line: 59, baseType: !1258, size: 1360, align: 8, offset: 3328)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "opd_par", scope: !1239, file: !1238, line: 60, baseType: !1258, size: 1360, align: 8, offset: 4688)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "is34bands", scope: !1239, file: !1238, line: 61, baseType: !992, size: 32, align: 32, offset: 6048)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "is34bands_old", scope: !1239, file: !1238, line: 62, baseType: !992, size: 32, align: 32, offset: 6080)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !1239, file: !1238, line: 64, baseType: !1269, size: 14080, align: 32, offset: 6144)
!1269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 14080, align: 32, elements: !1270)
!1270 = !{!1153, !1271, !964}
!1271 = !DISubrange(count: 44)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1239, file: !1238, line: 65, baseType: !1273, size: 267904, align: 32, offset: 20224)
!1273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 267904, align: 32, elements: !1274)
!1274 = !{!1275, !1276, !964}
!1275 = !DISubrange(count: 91)
!1276 = !DISubrange(count: 46)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "ap_delay", scope: !1239, file: !1238, line: 66, baseType: !1278, size: 355200, align: 32, offset: 288128)
!1278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 355200, align: 32, elements: !1279)
!1279 = !{!1280, !1224, !1281, !964}
!1280 = !DISubrange(count: 50)
!1281 = !DISubrange(count: 37)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "peak_decay_nrg", scope: !1239, file: !1238, line: 67, baseType: !1283, size: 1088, align: 32, offset: 643328)
!1283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 1088, align: 32, elements: !1284)
!1284 = !{!1262}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "power_smooth", scope: !1239, file: !1238, line: 68, baseType: !1283, size: 1088, align: 32, offset: 644480)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "peak_decay_diff_smooth", scope: !1239, file: !1238, line: 69, baseType: !1283, size: 1088, align: 32, offset: 645632)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "H11", scope: !1239, file: !1238, line: 70, baseType: !1288, size: 13056, align: 32, offset: 646784)
!1288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 13056, align: 32, elements: !1289)
!1289 = !{!964, !1218, !1262}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "H12", scope: !1239, file: !1238, line: 71, baseType: !1288, size: 13056, align: 32, offset: 659840)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "H21", scope: !1239, file: !1238, line: 72, baseType: !1288, size: 13056, align: 32, offset: 672896)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "H22", scope: !1239, file: !1238, line: 73, baseType: !1288, size: 13056, align: 32, offset: 685952)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "Lbuf", scope: !1239, file: !1238, line: 74, baseType: !1294, size: 186368, align: 32, offset: 699008)
!1294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 186368, align: 32, elements: !1295)
!1295 = !{!1275, !963, !964}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "Rbuf", scope: !1239, file: !1238, line: 75, baseType: !1294, size: 186368, align: 32, offset: 885376)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "opd_hist", scope: !1239, file: !1238, line: 76, baseType: !1298, size: 272, align: 8, offset: 1071744)
!1298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1259, size: 272, align: 8, elements: !1284)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "ipd_hist", scope: !1239, file: !1238, line: 77, baseType: !1298, size: 272, align: 8, offset: 1072016)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "dsp", scope: !1239, file: !1238, line: 78, baseType: !1301, size: 512, align: 64, offset: 1072320)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSDSPContext", file: !1302, line: 52, baseType: !1303)
!1302 = !DIFile(filename: "libavcodec/aacpsdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PSDSPContext", file: !1302, line: 32, size: 512, align: 64, elements: !1304)
!1304 = !{!1305, !1309, !1315, !1325, !1335, !1339, !1347}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "add_squares", scope: !1303, file: !1302, line: 33, baseType: !1306, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{null, !955, !970, !992}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "mul_pair_single", scope: !1303, file: !1302, line: 34, baseType: !1310, size: 64, align: 64, offset: 64)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DISubroutineType(types: !1312)
!1312 = !{null, !1313, !1313, !955, !992}
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 64, align: 32, elements: !972)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "hybrid_analysis", scope: !1303, file: !1302, line: 36, baseType: !1316, size: 64, align: 64, offset: 128)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{null, !1313, !1313, !1319, !1322, !992}
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 512, align: 32, elements: !1321)
!1321 = !{!1214, !964}
!1322 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1323, line: 149, baseType: !1324)
!1323 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1324 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "hybrid_analysis_ileave", scope: !1303, file: !1302, line: 39, baseType: !1326, size: 64, align: 64, offset: 192)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{null, !1329, !1332, !992, !992}
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 2048, align: 32, elements: !1331)
!1331 = !{!963, !964}
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 77824, align: 32, elements: !1334)
!1334 = !{!1204, !976}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "hybrid_synthesis_deint", scope: !1303, file: !1302, line: 41, baseType: !1336, size: 64, align: 64, offset: 256)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{null, !1332, !1329, !992, !992}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "decorrelate", scope: !1303, file: !1302, line: 43, baseType: !1340, size: 64, align: 64, offset: 320)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{null, !1313, !1313, !1343, !1346, !970, !1346, !956, !992}
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 2368, align: 32, elements: !1345)
!1345 = !{!1281, !964}
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "stereo_interpolate", scope: !1303, file: !1302, line: 49, baseType: !1348, size: 128, align: 64, offset: 384)
!1348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1349, size: 128, align: 64, elements: !972)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{null, !1313, !1313, !1352, !1352, !992}
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 128, align: 32, elements: !1354)
!1354 = !{!1355}
!1355 = !DISubrange(count: 4)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1126, file: !1125, line: 169, baseType: !1155, size: 64, align: 32, offset: 2481152)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "n_q", scope: !1126, file: !1125, line: 171, baseType: !1151, size: 32, align: 32, offset: 2481216)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "n_lim", scope: !1126, file: !1125, line: 173, baseType: !1151, size: 32, align: 32, offset: 2481248)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "f_master", scope: !1126, file: !1125, line: 175, baseType: !1360, size: 784, align: 16, offset: 2481280)
!1360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1097, size: 784, align: 16, elements: !1080)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablelow", scope: !1126, file: !1125, line: 177, baseType: !1362, size: 400, align: 16, offset: 2482064)
!1362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1097, size: 400, align: 16, elements: !1099)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablehigh", scope: !1126, file: !1125, line: 179, baseType: !1360, size: 784, align: 16, offset: 2482464)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablenoise", scope: !1126, file: !1125, line: 181, baseType: !1365, size: 96, align: 16, offset: 2483248)
!1365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1097, size: 96, align: 16, elements: !1256)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablelim", scope: !1126, file: !1125, line: 183, baseType: !1367, size: 480, align: 16, offset: 2483344)
!1367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1097, size: 480, align: 16, elements: !1368)
!1368 = !{!1369}
!1369 = !DISubrange(count: 30)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "num_patches", scope: !1126, file: !1125, line: 184, baseType: !1151, size: 32, align: 32, offset: 2483840)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "patch_num_subbands", scope: !1126, file: !1125, line: 185, baseType: !1372, size: 48, align: 8, offset: 2483872)
!1372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 48, align: 8, elements: !1256)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "patch_start_subband", scope: !1126, file: !1125, line: 186, baseType: !1372, size: 48, align: 8, offset: 2483920)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "X_low", scope: !1126, file: !1125, line: 188, baseType: !1375, size: 81920, align: 32, offset: 2483968)
!1375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 81920, align: 32, elements: !1376)
!1376 = !{!963, !968, !964}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "X_high", scope: !1126, file: !1125, line: 190, baseType: !1378, size: 163840, align: 32, offset: 2565888)
!1378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 163840, align: 32, elements: !1379)
!1379 = !{!976, !968, !964}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !1126, file: !1125, line: 192, baseType: !1381, size: 311296, align: 32, offset: 2729728)
!1381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 311296, align: 32, elements: !1382)
!1382 = !{!964, !964, !1204, !976}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "alpha0", scope: !1126, file: !1125, line: 194, baseType: !1384, size: 4096, align: 32, offset: 3041024)
!1384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 4096, align: 32, elements: !975)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "alpha1", scope: !1126, file: !1125, line: 196, baseType: !1384, size: 4096, align: 32, offset: 3045120)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "e_origmapped", scope: !1126, file: !1125, line: 198, baseType: !1387, size: 10752, align: 32, offset: 3049216)
!1387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1207, size: 10752, align: 32, elements: !1388)
!1388 = !{!1170, !1182}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "q_mapped", scope: !1126, file: !1125, line: 200, baseType: !1387, size: 10752, align: 32, offset: 3059968)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "s_mapped", scope: !1126, file: !1125, line: 202, baseType: !1391, size: 2688, align: 8, offset: 3070720)
!1391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 2688, align: 8, elements: !1388)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "e_curr", scope: !1126, file: !1125, line: 204, baseType: !1387, size: 10752, align: 32, offset: 3073408)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "q_m", scope: !1126, file: !1125, line: 206, baseType: !1387, size: 10752, align: 32, offset: 3084160)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "s_m", scope: !1126, file: !1125, line: 208, baseType: !1387, size: 10752, align: 32, offset: 3094912)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1126, file: !1125, line: 209, baseType: !1387, size: 10752, align: 32, offset: 3105664)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_filter_scratch", scope: !1126, file: !1125, line: 210, baseType: !1397, size: 10240, align: 32, offset: 3116544)
!1397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 10240, align: 32, elements: !1398)
!1398 = !{!1153, !976}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_ana", scope: !1126, file: !1125, line: 211, baseType: !1400, size: 896, align: 64, offset: 3126784)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !1401, line: 41, baseType: !1402)
!1401 = !DIFile(filename: "libavcodec/avfft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !919, line: 88, size: 896, align: 64, elements: !1403)
!1403 = !{!1404, !1405, !1406, !1408, !1416, !1417, !1418, !1420, !1421, !1426, !1427, !1433, !1434, !1435, !1441, !1442, !1443}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !1402, file: !919, line: 89, baseType: !992, size: 32, align: 32)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !1402, file: !919, line: 90, baseType: !992, size: 32, align: 32, offset: 32)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "revtab", scope: !1402, file: !919, line: 91, baseType: !1407, size: 64, align: 64, offset: 64)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !1402, file: !919, line: 92, baseType: !1409, size: 64, align: 64, offset: 128)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !1401, line: 39, baseType: !1411)
!1411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !1401, line: 37, size: 64, align: 32, elements: !1412)
!1412 = !{!1413, !1415}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !1411, file: !1401, line: 38, baseType: !1414, size: 32, align: 32)
!1414 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !1401, line: 35, baseType: !958)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !1411, file: !1401, line: 38, baseType: !1414, size: 32, align: 32, offset: 32)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_size", scope: !1402, file: !919, line: 93, baseType: !992, size: 32, align: 32, offset: 192)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_bits", scope: !1402, file: !919, line: 94, baseType: !992, size: 32, align: 32, offset: 224)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !1402, file: !919, line: 96, baseType: !1419, size: 64, align: 64, offset: 256)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !1402, file: !919, line: 97, baseType: !1419, size: 64, align: 64, offset: 320)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permute", scope: !1402, file: !919, line: 101, baseType: !1422, size: 64, align: 64, offset: 384)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{null, !1425, !1409}
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "fft_calc", scope: !1402, file: !919, line: 106, baseType: !1422, size: 64, align: 64, offset: 448)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_calc", scope: !1402, file: !919, line: 107, baseType: !1428, size: 64, align: 64, offset: 512)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{null, !1425, !1419, !1431}
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1414)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !1402, file: !919, line: 108, baseType: !1428, size: 64, align: 64, offset: 576)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calc", scope: !1402, file: !919, line: 109, baseType: !1428, size: 64, align: 64, offset: 640)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calcw", scope: !1402, file: !919, line: 110, baseType: !1436, size: 64, align: 64, offset: 704)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DISubroutineType(types: !1438)
!1438 = !{null, !1425, !1439, !1431}
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1440 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTDouble", file: !919, line: 43, baseType: !958)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permutation", scope: !1402, file: !919, line: 111, baseType: !918, size: 32, align: 32, offset: 768)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_permutation", scope: !1402, file: !919, line: 112, baseType: !924, size: 32, align: 32, offset: 800)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "revtab32", scope: !1402, file: !919, line: 113, baseType: !1444, size: 64, align: 64, offset: 832)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "mdct", scope: !1126, file: !1125, line: 212, baseType: !1400, size: 896, align: 64, offset: 3127680)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "dsp", scope: !1126, file: !1125, line: 213, baseType: !1447, size: 896, align: 64, offset: 3128576)
!1447 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBRDSPContext", file: !1448, line: 45, baseType: !1449)
!1448 = !DIFile(filename: "libavcodec/sbrdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SBRDSPContext", file: !1448, line: 28, size: 896, align: 64, elements: !1450)
!1450 = !{!1451, !1455, !1459, !1460, !1461, !1465, !1469, !1473, !1480, !1484, !1491}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "sum64x5", scope: !1449, file: !1448, line: 29, baseType: !1452, size: 64, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DISubroutineType(types: !1454)
!1454 = !{null, !955}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "sum_square", scope: !1449, file: !1448, line: 30, baseType: !1456, size: 64, align: 64, offset: 64)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DISubroutineType(types: !1458)
!1458 = !{!1207, !1313, !992}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "neg_odd_64", scope: !1449, file: !1448, line: 31, baseType: !1452, size: 64, align: 64, offset: 128)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_pre_shuffle", scope: !1449, file: !1448, line: 32, baseType: !1452, size: 64, align: 64, offset: 192)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_post_shuffle", scope: !1449, file: !1448, line: 33, baseType: !1462, size: 64, align: 64, offset: 256)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{null, !1313, !1346}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_deint_neg", scope: !1449, file: !1448, line: 34, baseType: !1466, size: 64, align: 64, offset: 320)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DISubroutineType(types: !1468)
!1468 = !{null, !955, !1346}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_deint_bfly", scope: !1449, file: !1448, line: 35, baseType: !1470, size: 64, align: 64, offset: 384)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{null, !955, !1346, !1346}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "autocorrelate", scope: !1449, file: !1448, line: 36, baseType: !1474, size: 64, align: 64, offset: 448)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64, align: 64)
!1475 = !DISubroutineType(types: !1476)
!1476 = !{null, !970, !1477}
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1207, size: 128, align: 32, elements: !1479)
!1479 = !{!964, !964}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "hf_gen", scope: !1449, file: !1448, line: 37, baseType: !1481, size: 64, align: 64, offset: 512)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{null, !1313, !970, !1346, !1346, !956, !992, !992}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "hf_g_filt", scope: !1449, file: !1448, line: 40, baseType: !1485, size: 64, align: 64, offset: 576)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{null, !1313, !965, !1488, !992, !1490}
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1207)
!1490 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !984, line: 119, baseType: !1324)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "hf_apply_noise", scope: !1449, file: !1448, line: 42, baseType: !1492, size: 256, align: 64, offset: 640)
!1492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1493, size: 256, align: 64, elements: !1354)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DISubroutineType(types: !1495)
!1495 = !{null, !1313, !1488, !1488, !992, !992, !992}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1126, file: !1125, line: 214, baseType: !1497, size: 256, align: 64, offset: 3129472)
!1497 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACSBRContext", file: !1125, line: 134, baseType: !1498)
!1498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACSBRContext", file: !1125, line: 120, size: 256, align: 64, elements: !1499)
!1499 = !{!1500, !2548, !2554, !2558}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "sbr_lf_gen", scope: !1498, file: !1125, line: 121, baseType: !1501, size: 64, align: 64)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{!992, !1504, !1123, !2546, !959, !992}
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACContext", file: !1125, line: 37, baseType: !1506)
!1506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACContext", file: !888, line: 293, size: 62208, align: 256, elements: !1507)
!1507 = !{!1508, !1551, !2223, !2224, !2225, !2242, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2403, !2437, !2438, !2439, !2482, !2483, !2486, !2487, !2488, !2490, !2519, !2520, !2521, !2522, !2526, !2527, !2533, !2537, !2538, !2542}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1506, file: !888, line: 294, baseType: !1509, size: 64, align: 64)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1511)
!1511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1512)
!1512 = !{!1513, !1517, !1521, !1525, !1526, !1527, !1528, !1532, !1538, !1540, !1544}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1511, file: !4, line: 72, baseType: !1514, size: 64, align: 64)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1516)
!1516 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1511, file: !4, line: 78, baseType: !1518, size: 64, align: 64, offset: 64)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DISubroutineType(types: !1520)
!1520 = !{!1514, !969}
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1511, file: !4, line: 85, baseType: !1522, size: 64, align: 64, offset: 128)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!1523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1524)
!1524 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1511, file: !4, line: 93, baseType: !992, size: 32, align: 32, offset: 192)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1511, file: !4, line: 99, baseType: !992, size: 32, align: 32, offset: 224)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1511, file: !4, line: 108, baseType: !992, size: 32, align: 32, offset: 256)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1511, file: !4, line: 113, baseType: !1529, size: 64, align: 64, offset: 320)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DISubroutineType(types: !1531)
!1531 = !{!969, !969, !969}
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1511, file: !4, line: 123, baseType: !1533, size: 64, align: 64, offset: 384)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64, align: 64)
!1534 = !DISubroutineType(types: !1535)
!1535 = !{!1536, !1536}
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1511)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1511, file: !4, line: 130, baseType: !1539, size: 32, align: 32, offset: 448)
!1539 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1511, file: !4, line: 136, baseType: !1541, size: 64, align: 64, offset: 512)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{!1539, !969}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1511, file: !4, line: 142, baseType: !1545, size: 64, align: 64, offset: 576)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64, align: 64)
!1546 = !DISubroutineType(types: !1547)
!1547 = !{!992, !1548, !969, !1514, !992}
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64, align: 64)
!1550 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1506, file: !888, line: 295, baseType: !1552, size: 64, align: 64, offset: 64)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1553 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1554)
!1554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1555)
!1555 = !{!1556, !1559, !1560, !1561, !1823, !1824, !1825, !1826, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1979, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2161, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1554, file: !35, line: 1561, baseType: !1557, size: 64, align: 64)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1510)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1554, file: !35, line: 1562, baseType: !992, size: 32, align: 32, offset: 64)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1554, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1554, file: !35, line: 1565, baseType: !1562, size: 64, align: 64, offset: 128)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1564)
!1564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1565)
!1565 = !{!1566, !1567, !1568, !1569, !1570, !1571, !1580, !1583, !1586, !1589, !1594, !1595, !1596, !1604, !1605, !1606, !1608, !1612, !1618, !1628, !1632, !1633, !1676, !1794, !1798, !1799, !1803, !1807, !1812, !1816, !1817, !1818}
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1564, file: !35, line: 3475, baseType: !1514, size: 64, align: 64)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1564, file: !35, line: 3480, baseType: !1514, size: 64, align: 64, offset: 64)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1564, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1564, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1564, file: !35, line: 3487, baseType: !992, size: 32, align: 32, offset: 192)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1564, file: !35, line: 3488, baseType: !1572, size: 64, align: 64, offset: 256)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1574)
!1574 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1575, line: 61, baseType: !1576)
!1575 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1575, line: 58, size: 64, align: 32, elements: !1577)
!1577 = !{!1578, !1579}
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1576, file: !1575, line: 59, baseType: !992, size: 32, align: 32)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1576, file: !1575, line: 60, baseType: !992, size: 32, align: 32, offset: 32)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1564, file: !35, line: 3489, baseType: !1581, size: 64, align: 64, offset: 320)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64, align: 64)
!1582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1564, file: !35, line: 3490, baseType: !1584, size: 64, align: 64, offset: 384)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1564, file: !35, line: 3491, baseType: !1587, size: 64, align: 64, offset: 448)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64, align: 64)
!1588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1564, file: !35, line: 3492, baseType: !1590, size: 64, align: 64, offset: 512)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64, align: 64)
!1591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1592)
!1592 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !984, line: 55, baseType: !1593)
!1593 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1564, file: !35, line: 3493, baseType: !986, size: 8, align: 8, offset: 576)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1564, file: !35, line: 3494, baseType: !1557, size: 64, align: 64, offset: 640)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1564, file: !35, line: 3495, baseType: !1597, size: 64, align: 64, offset: 704)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1599)
!1599 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1600)
!1600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1601)
!1601 = !{!1602, !1603}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1600, file: !35, line: 3402, baseType: !992, size: 32, align: 32)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1600, file: !35, line: 3403, baseType: !1514, size: 64, align: 64, offset: 64)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1564, file: !35, line: 3507, baseType: !1514, size: 64, align: 64, offset: 768)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1564, file: !35, line: 3516, baseType: !992, size: 32, align: 32, offset: 832)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1564, file: !35, line: 3517, baseType: !1607, size: 64, align: 64, offset: 896)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1564, file: !35, line: 3527, baseType: !1609, size: 64, align: 64, offset: 960)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DISubroutineType(types: !1611)
!1611 = !{!992, !1552}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1564, file: !35, line: 3535, baseType: !1613, size: 64, align: 64, offset: 1024)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DISubroutineType(types: !1615)
!1615 = !{!992, !1552, !1616}
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1553)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1564, file: !35, line: 3541, baseType: !1619, size: 64, align: 64, offset: 1088)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1621)
!1621 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1622)
!1622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1623, line: 223, size: 128, align: 64, elements: !1624)
!1623 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1624 = !{!1625, !1627}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1622, file: !1623, line: 224, baseType: !1626, size: 64, align: 64)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1622, file: !1623, line: 225, baseType: !1626, size: 64, align: 64, offset: 64)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1564, file: !35, line: 3549, baseType: !1629, size: 64, align: 64, offset: 1152)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DISubroutineType(types: !1631)
!1631 = !{null, !1607}
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1564, file: !35, line: 3551, baseType: !1609, size: 64, align: 64, offset: 1216)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1564, file: !35, line: 3552, baseType: !1634, size: 64, align: 64, offset: 1280)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DISubroutineType(types: !1636)
!1636 = !{!992, !1552, !1637, !992, !1638}
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64, align: 64)
!1639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1640)
!1640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1641)
!1641 = !{!1642, !1643, !1644, !1645, !1646, !1674}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1640, file: !35, line: 3921, baseType: !1097, size: 16, align: 16)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1640, file: !35, line: 3922, baseType: !983, size: 32, align: 32, offset: 32)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1640, file: !35, line: 3923, baseType: !983, size: 32, align: 32, offset: 64)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1640, file: !35, line: 3924, baseType: !985, size: 32, align: 32, offset: 96)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1640, file: !35, line: 3925, baseType: !1647, size: 64, align: 64, offset: 128)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1650)
!1650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1651)
!1651 = !{!1652, !1653, !1654, !1655, !1656, !1657, !1665, !1667, !1669, !1670, !1672, !1673}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1650, file: !35, line: 3886, baseType: !992, size: 32, align: 32)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1650, file: !35, line: 3887, baseType: !992, size: 32, align: 32, offset: 32)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1650, file: !35, line: 3888, baseType: !992, size: 32, align: 32, offset: 64)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1650, file: !35, line: 3889, baseType: !992, size: 32, align: 32, offset: 96)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1650, file: !35, line: 3890, baseType: !992, size: 32, align: 32, offset: 128)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1650, file: !35, line: 3897, baseType: !1658, size: 768, align: 64, offset: 192)
!1658 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1659)
!1659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1660)
!1660 = !{!1661, !1663}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1659, file: !35, line: 3855, baseType: !1662, size: 512, align: 64)
!1662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1637, size: 512, align: 64, elements: !1229)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1659, file: !35, line: 3857, baseType: !1664, size: 256, align: 32, offset: 512)
!1664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 256, align: 32, elements: !1229)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1650, file: !35, line: 3903, baseType: !1666, size: 256, align: 64, offset: 960)
!1666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1637, size: 256, align: 64, elements: !1354)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1650, file: !35, line: 3904, baseType: !1668, size: 128, align: 32, offset: 1216)
!1668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 128, align: 32, elements: !1354)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1650, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1650, file: !35, line: 3908, baseType: !1671, size: 64, align: 64, offset: 1408)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1650, file: !35, line: 3915, baseType: !1671, size: 64, align: 64, offset: 1472)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1650, file: !35, line: 3917, baseType: !992, size: 32, align: 32, offset: 1536)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1640, file: !35, line: 3926, baseType: !1675, size: 64, align: 64, offset: 192)
!1675 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !984, line: 40, baseType: !1324)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1564, file: !35, line: 3564, baseType: !1677, size: 64, align: 64, offset: 1344)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64, align: 64)
!1678 = !DISubroutineType(types: !1679)
!1679 = !{!992, !1552, !1680, !1714, !1793}
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1682)
!1682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1683)
!1683 = !{!1684, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1710, !1711, !1712, !1713}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1682, file: !35, line: 1451, baseType: !1685, size: 64, align: 64)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1687, line: 94, baseType: !1688)
!1687 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1687, line: 81, size: 192, align: 64, elements: !1689)
!1689 = !{!1690, !1694, !1695}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1688, file: !1687, line: 82, baseType: !1691, size: 64, align: 64)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64, align: 64)
!1692 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1687, line: 73, baseType: !1693)
!1693 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1687, line: 73, flags: DIFlagFwdDecl)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1688, file: !1687, line: 89, baseType: !1637, size: 64, align: 64, offset: 64)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1688, file: !1687, line: 93, baseType: !992, size: 32, align: 32, offset: 128)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1682, file: !35, line: 1461, baseType: !1675, size: 64, align: 64, offset: 64)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1682, file: !35, line: 1467, baseType: !1675, size: 64, align: 64, offset: 128)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1682, file: !35, line: 1468, baseType: !1637, size: 64, align: 64, offset: 192)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1682, file: !35, line: 1469, baseType: !992, size: 32, align: 32, offset: 256)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1682, file: !35, line: 1470, baseType: !992, size: 32, align: 32, offset: 288)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1682, file: !35, line: 1474, baseType: !992, size: 32, align: 32, offset: 320)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1682, file: !35, line: 1479, baseType: !1703, size: 64, align: 64, offset: 384)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64, align: 64)
!1704 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1705)
!1705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1706)
!1706 = !{!1707, !1708, !1709}
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1705, file: !35, line: 1412, baseType: !1637, size: 64, align: 64)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1705, file: !35, line: 1413, baseType: !992, size: 32, align: 32, offset: 64)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1705, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1682, file: !35, line: 1480, baseType: !992, size: 32, align: 32, offset: 448)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1682, file: !35, line: 1486, baseType: !1675, size: 64, align: 64, offset: 512)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1682, file: !35, line: 1488, baseType: !1675, size: 64, align: 64, offset: 576)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1682, file: !35, line: 1497, baseType: !1675, size: 64, align: 64, offset: 640)
!1714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1715, size: 64, align: 64)
!1715 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1716)
!1716 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1717)
!1717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1718)
!1718 = !{!1719, !1720, !1721, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1748, !1750, !1751, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1782, !1783, !1784, !1785, !1786, !1787, !1789, !1790, !1791, !1792}
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1717, file: !758, line: 282, baseType: !1662, size: 512, align: 64)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1717, file: !758, line: 299, baseType: !1664, size: 256, align: 32, offset: 512)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1717, file: !758, line: 315, baseType: !1722, size: 64, align: 64, offset: 768)
!1722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1717, file: !758, line: 326, baseType: !992, size: 32, align: 32, offset: 832)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1717, file: !758, line: 326, baseType: !992, size: 32, align: 32, offset: 864)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1717, file: !758, line: 334, baseType: !992, size: 32, align: 32, offset: 896)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1717, file: !758, line: 341, baseType: !992, size: 32, align: 32, offset: 928)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1717, file: !758, line: 346, baseType: !992, size: 32, align: 32, offset: 960)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1717, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1717, file: !758, line: 356, baseType: !1574, size: 64, align: 32, offset: 1024)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1717, file: !758, line: 361, baseType: !1675, size: 64, align: 64, offset: 1088)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1717, file: !758, line: 369, baseType: !1675, size: 64, align: 64, offset: 1152)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1717, file: !758, line: 377, baseType: !1675, size: 64, align: 64, offset: 1216)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1717, file: !758, line: 382, baseType: !992, size: 32, align: 32, offset: 1280)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1717, file: !758, line: 386, baseType: !992, size: 32, align: 32, offset: 1312)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1717, file: !758, line: 391, baseType: !992, size: 32, align: 32, offset: 1344)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1717, file: !758, line: 396, baseType: !969, size: 64, align: 64, offset: 1408)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1717, file: !758, line: 403, baseType: !1738, size: 512, align: 64, offset: 1472)
!1738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1592, size: 512, align: 64, elements: !1229)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1717, file: !758, line: 410, baseType: !992, size: 32, align: 32, offset: 1984)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1717, file: !758, line: 415, baseType: !992, size: 32, align: 32, offset: 2016)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1717, file: !758, line: 420, baseType: !992, size: 32, align: 32, offset: 2048)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1717, file: !758, line: 425, baseType: !992, size: 32, align: 32, offset: 2080)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1717, file: !758, line: 435, baseType: !1675, size: 64, align: 64, offset: 2112)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1717, file: !758, line: 440, baseType: !992, size: 32, align: 32, offset: 2176)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1717, file: !758, line: 445, baseType: !1592, size: 64, align: 64, offset: 2240)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1717, file: !758, line: 459, baseType: !1747, size: 512, align: 64, offset: 2304)
!1747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1685, size: 512, align: 64, elements: !1229)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1717, file: !758, line: 473, baseType: !1749, size: 64, align: 64, offset: 2816)
!1749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1717, file: !758, line: 477, baseType: !992, size: 32, align: 32, offset: 2880)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1717, file: !758, line: 479, baseType: !1752, size: 64, align: 64, offset: 2944)
!1752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1753, size: 64, align: 64)
!1753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1754, size: 64, align: 64)
!1754 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1755)
!1755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1756)
!1756 = !{!1757, !1758, !1759, !1760, !1765}
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1755, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1755, file: !758, line: 203, baseType: !1637, size: 64, align: 64, offset: 64)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1755, file: !758, line: 204, baseType: !992, size: 32, align: 32, offset: 128)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1755, file: !758, line: 205, baseType: !1761, size: 64, align: 64, offset: 192)
!1761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1762, size: 64, align: 64)
!1762 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1763, line: 86, baseType: !1764)
!1763 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1764 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1763, line: 86, flags: DIFlagFwdDecl)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1755, file: !758, line: 206, baseType: !1685, size: 64, align: 64, offset: 256)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1717, file: !758, line: 480, baseType: !992, size: 32, align: 32, offset: 3008)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1717, file: !758, line: 505, baseType: !992, size: 32, align: 32, offset: 3040)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1717, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1717, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1717, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1717, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1717, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1717, file: !758, line: 532, baseType: !1675, size: 64, align: 64, offset: 3264)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1717, file: !758, line: 539, baseType: !1675, size: 64, align: 64, offset: 3328)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1717, file: !758, line: 547, baseType: !1675, size: 64, align: 64, offset: 3392)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1717, file: !758, line: 554, baseType: !1761, size: 64, align: 64, offset: 3456)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1717, file: !758, line: 563, baseType: !992, size: 32, align: 32, offset: 3520)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1717, file: !758, line: 572, baseType: !992, size: 32, align: 32, offset: 3552)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1717, file: !758, line: 581, baseType: !992, size: 32, align: 32, offset: 3584)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1717, file: !758, line: 588, baseType: !1781, size: 64, align: 64, offset: 3648)
!1781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1717, file: !758, line: 593, baseType: !992, size: 32, align: 32, offset: 3712)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1717, file: !758, line: 596, baseType: !992, size: 32, align: 32, offset: 3744)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1717, file: !758, line: 599, baseType: !1685, size: 64, align: 64, offset: 3776)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1717, file: !758, line: 605, baseType: !1685, size: 64, align: 64, offset: 3840)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1717, file: !758, line: 616, baseType: !1685, size: 64, align: 64, offset: 3904)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1717, file: !758, line: 626, baseType: !1788, size: 64, align: 64, offset: 3968)
!1788 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1323, line: 216, baseType: !1593)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1717, file: !758, line: 627, baseType: !1788, size: 64, align: 64, offset: 4032)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1717, file: !758, line: 628, baseType: !1788, size: 64, align: 64, offset: 4096)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1717, file: !758, line: 629, baseType: !1788, size: 64, align: 64, offset: 4160)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1717, file: !758, line: 645, baseType: !1685, size: 64, align: 64, offset: 4224)
!1793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1564, file: !35, line: 3566, baseType: !1795, size: 64, align: 64, offset: 1408)
!1795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1796, size: 64, align: 64)
!1796 = !DISubroutineType(types: !1797)
!1797 = !{!992, !1552, !969, !1793, !1680}
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1564, file: !35, line: 3567, baseType: !1609, size: 64, align: 64, offset: 1472)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1564, file: !35, line: 3576, baseType: !1800, size: 64, align: 64, offset: 1536)
!1800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1801, size: 64, align: 64)
!1801 = !DISubroutineType(types: !1802)
!1802 = !{!992, !1552, !1714}
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1564, file: !35, line: 3577, baseType: !1804, size: 64, align: 64, offset: 1600)
!1804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1805, size: 64, align: 64)
!1805 = !DISubroutineType(types: !1806)
!1806 = !{!992, !1552, !1680}
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1564, file: !35, line: 3584, baseType: !1808, size: 64, align: 64, offset: 1664)
!1808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1809, size: 64, align: 64)
!1809 = !DISubroutineType(types: !1810)
!1810 = !{!992, !1552, !1811}
!1811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64, align: 64)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1564, file: !35, line: 3589, baseType: !1813, size: 64, align: 64, offset: 1728)
!1813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1814, size: 64, align: 64)
!1814 = !DISubroutineType(types: !1815)
!1815 = !{null, !1552}
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1564, file: !35, line: 3594, baseType: !992, size: 32, align: 32, offset: 1792)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1564, file: !35, line: 3600, baseType: !1514, size: 64, align: 64, offset: 1856)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1564, file: !35, line: 3609, baseType: !1819, size: 64, align: 64, offset: 1920)
!1819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1820, size: 64, align: 64)
!1820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1821, size: 64, align: 64)
!1821 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1822)
!1822 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1554, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1554, file: !35, line: 1581, baseType: !985, size: 32, align: 32, offset: 224)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1554, file: !35, line: 1583, baseType: !969, size: 64, align: 64, offset: 256)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1554, file: !35, line: 1591, baseType: !1827, size: 64, align: 64, offset: 320)
!1827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1828, size: 64, align: 64)
!1828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1623, line: 129, size: 1664, align: 64, elements: !1829)
!1829 = !{!1830, !1831, !1832, !1833, !1834, !1852, !1853, !1859, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955}
