; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBSFInternal = type { %struct.AVPacket*, i32 }
%struct.AVPacket = type { %struct.AVBufferRef*, i64, i64, i8*, i32, i32, i32, %struct.AVPacketSideData*, i32, i64, i64, i64 }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

!555 = !DIFile(filename: "./libavutil/pixfmt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!556 = !{!557, !558, !559, !560}
!557 = !DIEnumerator(name: "AVCOL_RANGE_UNSPECIFIED", value: 0)
!558 = !DIEnumerator(name: "AVCOL_RANGE_MPEG", value: 1)
!559 = !DIEnumerator(name: "AVCOL_RANGE_JPEG", value: 2)
!560 = !DIEnumerator(name: "AVCOL_RANGE_NB", value: 3)
!561 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorPrimaries", file: !555, line: 440, size: 32, align: 32, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578}
!563 = !DIEnumerator(name: "AVCOL_PRI_RESERVED0", value: 0)
!564 = !DIEnumerator(name: "AVCOL_PRI_BT709", value: 1)
!565 = !DIEnumerator(name: "AVCOL_PRI_UNSPECIFIED", value: 2)
!566 = !DIEnumerator(name: "AVCOL_PRI_RESERVED", value: 3)
!567 = !DIEnumerator(name: "AVCOL_PRI_BT470M", value: 4)
!568 = !DIEnumerator(name: "AVCOL_PRI_BT470BG", value: 5)
!569 = !DIEnumerator(name: "AVCOL_PRI_SMPTE170M", value: 6)
!570 = !DIEnumerator(name: "AVCOL_PRI_SMPTE240M", value: 7)
!571 = !DIEnumerator(name: "AVCOL_PRI_FILM", value: 8)
!572 = !DIEnumerator(name: "AVCOL_PRI_BT2020", value: 9)
!573 = !DIEnumerator(name: "AVCOL_PRI_SMPTE428", value: 10)
!574 = !DIEnumerator(name: "AVCOL_PRI_SMPTEST428_1", value: 10)
!575 = !DIEnumerator(name: "AVCOL_PRI_SMPTE431", value: 11)
!576 = !DIEnumerator(name: "AVCOL_PRI_SMPTE432", value: 12)
!577 = !DIEnumerator(name: "AVCOL_PRI_JEDEC_P22", value: 22)
!578 = !DIEnumerator(name: "AVCOL_PRI_NB", value: 23)
!579 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorTransferCharacteristic", file: !555, line: 464, size: 32, align: 32, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602}
!581 = !DIEnumerator(name: "AVCOL_TRC_RESERVED0", value: 0)
!582 = !DIEnumerator(name: "AVCOL_TRC_BT709", value: 1)
!583 = !DIEnumerator(name: "AVCOL_TRC_UNSPECIFIED", value: 2)
!584 = !DIEnumerator(name: "AVCOL_TRC_RESERVED", value: 3)
!585 = !DIEnumerator(name: "AVCOL_TRC_GAMMA22", value: 4)
!586 = !DIEnumerator(name: "AVCOL_TRC_GAMMA28", value: 5)
!587 = !DIEnumerator(name: "AVCOL_TRC_SMPTE170M", value: 6)
!588 = !DIEnumerator(name: "AVCOL_TRC_SMPTE240M", value: 7)
!589 = !DIEnumerator(name: "AVCOL_TRC_LINEAR", value: 8)
!590 = !DIEnumerator(name: "AVCOL_TRC_LOG", value: 9)
!591 = !DIEnumerator(name: "AVCOL_TRC_LOG_SQRT", value: 10)
!592 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_4", value: 11)
!593 = !DIEnumerator(name: "AVCOL_TRC_BT1361_ECG", value: 12)
!594 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_1", value: 13)
!595 = !DIEnumerator(name: "AVCOL_TRC_BT2020_10", value: 14)
!596 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!597 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!598 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!599 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!600 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!601 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!602 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!603 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !555, line: 493, size: 32, align: 32, elements: !604)
!604 = !{!605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!605 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!606 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!607 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!608 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!609 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!610 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!611 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!612 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!613 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!614 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!615 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!616 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!617 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!618 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!619 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!620 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!621 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!622 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !555, line: 538, size: 32, align: 32, elements: !623)
!623 = !{!624, !625, !626, !627, !628, !629, !630, !631}
!624 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!625 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!626 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!627 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!628 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!629 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!630 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!631 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!632 = !{!633, !656, !720, !647}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64, align: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !638)
!638 = !{!639, !643, !648, !679, !680, !681, !682, !686, !692, !694, !698}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !637, file: !26, line: 72, baseType: !640, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !642)
!642 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !637, file: !26, line: 78, baseType: !644, size: 64, align: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64, align: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!640, !647}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !637, file: !26, line: 85, baseType: !649, size: 64, align: 64, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !652)
!652 = !{!653, !654, !655, !657, !658, !675, !676, !677, !678}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !651, file: !4, line: 247, baseType: !640, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !651, file: !4, line: 253, baseType: !640, size: 64, align: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !651, file: !4, line: 259, baseType: !656, size: 32, align: 32, offset: 128)
!656 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !651, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !651, file: !4, line: 271, baseType: !659, size: 64, align: 64, offset: 192)
!659 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !651, file: !4, line: 265, size: 64, align: 64, elements: !660)
!660 = !{!661, !665, !667, !668}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !659, file: !4, line: 266, baseType: !662, size: 64, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !663, line: 40, baseType: !664)
!663 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!664 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !659, file: !4, line: 267, baseType: !666, size: 64, align: 64)
!666 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !659, file: !4, line: 268, baseType: !640, size: 64, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !659, file: !4, line: 270, baseType: !669, size: 64, align: 32)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !670, line: 61, baseType: !671)
!670 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !670, line: 58, size: 64, align: 32, elements: !672)
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !671, file: !670, line: 59, baseType: !656, size: 32, align: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !671, file: !670, line: 60, baseType: !656, size: 32, align: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !651, file: !4, line: 272, baseType: !666, size: 64, align: 64, offset: 256)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !651, file: !4, line: 273, baseType: !666, size: 64, align: 64, offset: 320)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !651, file: !4, line: 275, baseType: !656, size: 32, align: 32, offset: 384)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !651, file: !4, line: 300, baseType: !640, size: 64, align: 64, offset: 448)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !637, file: !26, line: 93, baseType: !656, size: 32, align: 32, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !637, file: !26, line: 99, baseType: !656, size: 32, align: 32, offset: 224)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !637, file: !26, line: 108, baseType: !656, size: 32, align: 32, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !637, file: !26, line: 113, baseType: !683, size: 64, align: 64, offset: 320)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64, align: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!647, !647, !647}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !637, file: !26, line: 123, baseType: !687, size: 64, align: 64, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64, align: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!690, !690}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !637)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !637, file: !26, line: 130, baseType: !693, size: 32, align: 32, offset: 448)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !637, file: !26, line: 136, baseType: !695, size: 64, align: 64, offset: 512)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64, align: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!693, !647}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !637, file: !26, line: 142, baseType: !699, size: 64, align: 64, offset: 576)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64, align: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!656, !702, !647, !640, !656}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64, align: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !705)
!705 = !{!706, !718, !719}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !704, file: !4, line: 360, baseType: !707, size: 64, align: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64, align: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !711)
!711 = !{!712, !713, !714, !715, !716, !717}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !710, file: !4, line: 307, baseType: !640, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !710, file: !4, line: 313, baseType: !666, size: 64, align: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !710, file: !4, line: 313, baseType: !666, size: 64, align: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !710, file: !4, line: 318, baseType: !666, size: 64, align: 64, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !710, file: !4, line: 318, baseType: !666, size: 64, align: 64, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !710, file: !4, line: 323, baseType: !656, size: 32, align: 32, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !704, file: !4, line: 364, baseType: !656, size: 32, align: 32, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !704, file: !4, line: 368, baseType: !656, size: 32, align: 32, offset: 96)
!720 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!721 = !{!722, !840, !841, !842}
!722 = distinct !DIGlobalVariable(name: "ff_list_bsf", scope: !0, file: !723, line: 404, type: !724, isLocal: false, isDefinition: true, variable: %struct.AVBitStreamFilter* @ff_list_bsf)
!723 = !DIFile(filename: "libavcodec/bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !725)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !47, line: 5830, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !47, line: 5796, size: 512, align: 64, elements: !727)
!727 = !{!728, !729, !732, !733, !734, !831, !835, !839}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !726, file: !47, line: 5797, baseType: !640, size: 64, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !726, file: !47, line: 5804, baseType: !730, size: 64, align: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64, align: 64)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !726, file: !47, line: 5815, baseType: !634, size: 64, align: 64, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !726, file: !47, line: 5825, baseType: !656, size: 32, align: 32, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !726, file: !47, line: 5826, baseType: !735, size: 64, align: 64, offset: 256)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64, align: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!656, !738}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64, align: 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !47, line: 5794, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !47, line: 5747, size: 512, align: 64, elements: !741)
!741 = !{!742, !743, !746, !790, !791, !828, !829, !830}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !740, file: !47, line: 5751, baseType: !634, size: 64, align: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !740, file: !47, line: 5756, baseType: !744, size: 64, align: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64, align: 64)
!745 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !726)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !740, file: !47, line: 5762, baseType: !747, size: 64, align: 64, offset: 128)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64, align: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !47, line: 5735, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !723, line: 30, size: 128, align: 64, elements: !750)
!750 = !{!751, !789}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !749, file: !723, line: 31, baseType: !752, size: 64, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64, align: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !47, line: 1499, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !47, line: 1445, size: 704, align: 64, elements: !755)
!755 = !{!756, !771, !772, !773, !774, !775, !776, !777, !785, !786, !787, !788}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !754, file: !47, line: 1451, baseType: !757, size: 64, align: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !759, line: 94, baseType: !760)
!759 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !759, line: 81, size: 192, align: 64, elements: !761)
!761 = !{!762, !766, !770}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !760, file: !759, line: 82, baseType: !763, size: 64, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64, align: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !759, line: 73, baseType: !765)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !759, line: 73, flags: DIFlagFwdDecl)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !760, file: !759, line: 89, baseType: !767, size: 64, align: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64, align: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !663, line: 48, baseType: !769)
!769 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !760, file: !759, line: 93, baseType: !656, size: 32, align: 32, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !754, file: !47, line: 1461, baseType: !662, size: 64, align: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !754, file: !47, line: 1467, baseType: !662, size: 64, align: 64, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !754, file: !47, line: 1468, baseType: !767, size: 64, align: 64, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !754, file: !47, line: 1469, baseType: !656, size: 32, align: 32, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !754, file: !47, line: 1470, baseType: !656, size: 32, align: 32, offset: 288)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !754, file: !47, line: 1474, baseType: !656, size: 32, align: 32, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !754, file: !47, line: 1479, baseType: !778, size: 64, align: 64, offset: 384)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64, align: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !47, line: 1415, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !47, line: 1411, size: 128, align: 64, elements: !781)
!781 = !{!782, !783, !784}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !780, file: !47, line: 1412, baseType: !767, size: 64, align: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !780, file: !47, line: 1413, baseType: !656, size: 32, align: 32, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !780, file: !47, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !754, file: !47, line: 1480, baseType: !656, size: 32, align: 32, offset: 448)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !754, file: !47, line: 1486, baseType: !662, size: 64, align: 64, offset: 512)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !754, file: !47, line: 1488, baseType: !662, size: 64, align: 64, offset: 576)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !754, file: !47, line: 1497, baseType: !662, size: 64, align: 64, offset: 640)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !749, file: !723, line: 32, baseType: !656, size: 32, align: 32, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !740, file: !47, line: 5768, baseType: !647, size: 64, align: 64, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !740, file: !47, line: 5775, baseType: !792, size: 64, align: 64, offset: 256)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64, align: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !47, line: 4085, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !47, line: 3936, size: 1152, align: 64, elements: !795)
!795 = !{!796, !797, !798, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !821, !822, !823, !824, !825, !826, !827}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !794, file: !47, line: 3940, baseType: !536, size: 32, align: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !794, file: !47, line: 3944, baseType: !46, size: 32, align: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !794, file: !47, line: 3948, baseType: !799, size: 32, align: 32, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !663, line: 51, baseType: !720)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !794, file: !47, line: 3958, baseType: !767, size: 64, align: 64, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !794, file: !47, line: 3962, baseType: !656, size: 32, align: 32, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !794, file: !47, line: 3968, baseType: !656, size: 32, align: 32, offset: 224)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !794, file: !47, line: 3973, baseType: !662, size: 64, align: 64, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !794, file: !47, line: 3986, baseType: !656, size: 32, align: 32, offset: 320)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !794, file: !47, line: 3999, baseType: !656, size: 32, align: 32, offset: 352)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !794, file: !47, line: 4004, baseType: !656, size: 32, align: 32, offset: 384)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !794, file: !47, line: 4005, baseType: !656, size: 32, align: 32, offset: 416)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !794, file: !47, line: 4010, baseType: !656, size: 32, align: 32, offset: 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !794, file: !47, line: 4011, baseType: !656, size: 32, align: 32, offset: 480)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !794, file: !47, line: 4020, baseType: !669, size: 64, align: 32, offset: 512)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !794, file: !47, line: 4025, baseType: !546, size: 32, align: 32, offset: 576)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !794, file: !47, line: 4030, baseType: !554, size: 32, align: 32, offset: 608)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !794, file: !47, line: 4031, baseType: !561, size: 32, align: 32, offset: 640)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !794, file: !47, line: 4032, baseType: !579, size: 32, align: 32, offset: 672)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !794, file: !47, line: 4033, baseType: !603, size: 32, align: 32, offset: 704)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !794, file: !47, line: 4034, baseType: !622, size: 32, align: 32, offset: 736)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !794, file: !47, line: 4039, baseType: !656, size: 32, align: 32, offset: 768)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !794, file: !47, line: 4046, baseType: !819, size: 64, align: 64, offset: 832)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !663, line: 55, baseType: !820)
!820 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !794, file: !47, line: 4050, baseType: !656, size: 32, align: 32, offset: 896)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !794, file: !47, line: 4054, baseType: !656, size: 32, align: 32, offset: 928)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !794, file: !47, line: 4061, baseType: !656, size: 32, align: 32, offset: 960)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !794, file: !47, line: 4065, baseType: !656, size: 32, align: 32, offset: 992)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !794, file: !47, line: 4073, baseType: !656, size: 32, align: 32, offset: 1024)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !794, file: !47, line: 4080, baseType: !656, size: 32, align: 32, offset: 1056)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !794, file: !47, line: 4084, baseType: !656, size: 32, align: 32, offset: 1088)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !740, file: !47, line: 5781, baseType: !792, size: 64, align: 64, offset: 320)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !740, file: !47, line: 5787, baseType: !669, size: 64, align: 32, offset: 384)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !740, file: !47, line: 5793, baseType: !669, size: 64, align: 32, offset: 448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !726, file: !47, line: 5827, baseType: !832, size: 64, align: 64, offset: 320)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64, align: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!656, !738, !752}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !726, file: !47, line: 5828, baseType: !836, size: 64, align: 64, offset: 384)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64, align: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{null, !738}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !726, file: !47, line: 5829, baseType: !836, size: 64, align: 64, offset: 448)
!840 = distinct !DIGlobalVariable(name: "bsf_class", scope: !0, file: !723, line: 68, type: !635, isLocal: true, isDefinition: true, variable: %struct.AVClass* @bsf_class)
!841 = distinct !DIGlobalVariable(name: "bsf_list_class", scope: !0, file: !723, line: 398, type: !635, isLocal: true, isDefinition: true, variable: %struct.AVClass* @bsf_list_class)
!842 = distinct !DIGlobalVariable(name: "null_filter_name", scope: !843, file: !723, line: 375, type: !640, isLocal: true, isDefinition: true, variable: i8** @bsf_list_item_name.null_filter_name)
!843 = distinct !DISubprogram(name: "bsf_list_item_name", scope: !723, file: !723, line: 373, type: !645, isLocal: true, isDefinition: true, scopeLine: 374, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !844)
!844 = !{}
!845 = !{i32 2, !"Dwarf Version", i32 4}
!846 = !{i32 2, !"Debug Info Version", i32 3}
!847 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!848 = distinct !DISubprogram(name: "av_bsf_free", scope: !723, file: !723, line: 35, type: !849, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !844)
!849 = !DISubroutineType(types: !850)
!850 = !{null, !851}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64, align: 64)
!852 = !DILocalVariable(name: "pctx", arg: 1, scope: !848, file: !723, line: 35, type: !851)
!853 = !DIExpression()
!854 = !DILocation(line: 35, column: 33, scope: !848)
!855 = !DILocalVariable(name: "ctx", scope: !848, file: !723, line: 37, type: !738)
!856 = !DILocation(line: 37, column: 19, scope: !848)
!857 = !DILocation(line: 39, column: 10, scope: !858)
!858 = distinct !DILexicalBlock(scope: !848, file: !723, line: 39, column: 9)
!859 = !DILocation(line: 39, column: 15, scope: !858)
!860 = !DILocation(line: 39, column: 20, scope: !861)
!861 = !DILexicalBlockFile(scope: !858, file: !723, discriminator: 1)
!862 = !DILocation(line: 39, column: 19, scope: !861)
!863 = !DILocation(line: 39, column: 9, scope: !861)
!864 = !DILocation(line: 40, column: 9, scope: !858)
!865 = !DILocation(line: 41, column: 12, scope: !848)
!866 = !DILocation(line: 41, column: 11, scope: !848)
!867 = !DILocation(line: 41, column: 9, scope: !848)
!868 = !DILocation(line: 43, column: 9, scope: !869)
!869 = distinct !DILexicalBlock(scope: !848, file: !723, line: 43, column: 9)
!870 = !DILocation(line: 43, column: 14, scope: !869)
!871 = !DILocation(line: 43, column: 22, scope: !869)
!872 = !DILocation(line: 43, column: 9, scope: !848)
!873 = !DILocation(line: 44, column: 9, scope: !869)
!874 = !DILocation(line: 44, column: 14, scope: !869)
!875 = !DILocation(line: 44, column: 22, scope: !869)
!876 = !DILocation(line: 44, column: 28, scope: !869)
!877 = !DILocation(line: 45, column: 9, scope: !878)
!878 = distinct !DILexicalBlock(scope: !848, file: !723, line: 45, column: 9)
!879 = !DILocation(line: 45, column: 14, scope: !878)
!880 = !DILocation(line: 45, column: 22, scope: !878)
!881 = !DILocation(line: 45, column: 33, scope: !878)
!882 = !DILocation(line: 45, column: 36, scope: !883)
!883 = !DILexicalBlockFile(scope: !878, file: !723, discriminator: 1)
!884 = !DILocation(line: 45, column: 41, scope: !883)
!885 = !DILocation(line: 45, column: 9, scope: !883)
!886 = !DILocation(line: 46, column: 21, scope: !878)
!887 = !DILocation(line: 46, column: 26, scope: !878)
!888 = !DILocation(line: 46, column: 9, scope: !878)
!889 = !DILocation(line: 48, column: 17, scope: !848)
!890 = !DILocation(line: 48, column: 5, scope: !848)
!891 = !DILocation(line: 50, column: 21, scope: !848)
!892 = !DILocation(line: 50, column: 26, scope: !848)
!893 = !DILocation(line: 50, column: 36, scope: !848)
!894 = !DILocation(line: 50, column: 5, scope: !848)
!895 = !DILocation(line: 51, column: 15, scope: !848)
!896 = !DILocation(line: 51, column: 20, scope: !848)
!897 = !DILocation(line: 51, column: 14, scope: !848)
!898 = !DILocation(line: 51, column: 5, scope: !848)
!899 = !DILocation(line: 52, column: 15, scope: !848)
!900 = !DILocation(line: 52, column: 20, scope: !848)
!901 = !DILocation(line: 52, column: 14, scope: !848)
!902 = !DILocation(line: 52, column: 5, scope: !848)
!903 = !DILocation(line: 54, column: 30, scope: !848)
!904 = !DILocation(line: 54, column: 35, scope: !848)
!905 = !DILocation(line: 54, column: 5, scope: !848)
!906 = !DILocation(line: 55, column: 30, scope: !848)
!907 = !DILocation(line: 55, column: 35, scope: !848)
!908 = !DILocation(line: 55, column: 5, scope: !848)
!909 = !DILocation(line: 57, column: 14, scope: !848)
!910 = !DILocation(line: 57, column: 5, scope: !848)
!911 = !DILocation(line: 58, column: 1, scope: !848)
!912 = !DILocation(line: 58, column: 1, scope: !913)
!913 = !DILexicalBlockFile(scope: !848, file: !723, discriminator: 1)
!914 = distinct !DISubprogram(name: "av_bsf_get_class", scope: !723, file: !723, line: 76, type: !915, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !844)
!915 = !DISubroutineType(types: !916)
!916 = !{!634}
!917 = !DILocation(line: 78, column: 5, scope: !914)
!918 = distinct !DISubprogram(name: "av_bsf_alloc", scope: !723, file: !723, line: 81, type: !919, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !844)
!919 = !DISubroutineType(types: !920)
!920 = !{!656, !921, !851}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64, align: 64)
!922 = !DILocalVariable(name: "filter", arg: 1, scope: !918, file: !723, line: 81, type: !921)
!923 = !DILocation(line: 81, column: 43, scope: !918)
!924 = !DILocalVariable(name: "pctx", arg: 2, scope: !918, file: !723, line: 81, type: !851)
!925 = !DILocation(line: 81, column: 66, scope: !918)
!926 = !DILocalVariable(name: "ctx", scope: !918, file: !723, line: 83, type: !738)
!927 = !DILocation(line: 83, column: 19, scope: !918)
!928 = !DILocalVariable(name: "ret", scope: !918, file: !723, line: 84, type: !656)
!929 = !DILocation(line: 84, column: 9, scope: !918)
!930 = !DILocation(line: 86, column: 11, scope: !918)
!931 = !DILocation(line: 86, column: 9, scope: !918)
!932 = !DILocation(line: 87, column: 10, scope: !933)
!933 = distinct !DILexicalBlock(scope: !918, file: !723, line: 87, column: 9)
!934 = !DILocation(line: 87, column: 9, scope: !918)
!935 = !DILocation(line: 88, column: 9, scope: !933)
!936 = !DILocation(line: 90, column: 5, scope: !918)
!937 = !DILocation(line: 90, column: 10, scope: !918)
!938 = !DILocation(line: 90, column: 19, scope: !918)
!939 = !DILocation(line: 91, column: 19, scope: !918)
!940 = !DILocation(line: 91, column: 5, scope: !918)
!941 = !DILocation(line: 91, column: 10, scope: !918)
!942 = !DILocation(line: 91, column: 17, scope: !918)
!943 = !DILocation(line: 93, column: 19, scope: !918)
!944 = !DILocation(line: 93, column: 5, scope: !918)
!945 = !DILocation(line: 93, column: 10, scope: !918)
!946 = !DILocation(line: 93, column: 17, scope: !918)
!947 = !DILocation(line: 94, column: 20, scope: !918)
!948 = !DILocation(line: 94, column: 5, scope: !918)
!949 = !DILocation(line: 94, column: 10, scope: !918)
!950 = !DILocation(line: 94, column: 18, scope: !918)
!951 = !DILocation(line: 95, column: 10, scope: !952)
!952 = distinct !DILexicalBlock(scope: !918, file: !723, line: 95, column: 9)
!953 = !DILocation(line: 95, column: 15, scope: !952)
!954 = !DILocation(line: 95, column: 22, scope: !952)
!955 = !DILocation(line: 95, column: 26, scope: !956)
!956 = !DILexicalBlockFile(scope: !952, file: !723, discriminator: 1)
!957 = !DILocation(line: 95, column: 31, scope: !956)
!958 = !DILocation(line: 95, column: 9, scope: !956)
!959 = !DILocation(line: 96, column: 13, scope: !960)
!960 = distinct !DILexicalBlock(scope: !952, file: !723, line: 95, column: 40)
!961 = !DILocation(line: 97, column: 9, scope: !960)
!962 = !DILocation(line: 100, column: 21, scope: !918)
!963 = !DILocation(line: 100, column: 5, scope: !918)
!964 = !DILocation(line: 100, column: 10, scope: !918)
!965 = !DILocation(line: 100, column: 19, scope: !918)
!966 = !DILocation(line: 101, column: 10, scope: !967)
!967 = distinct !DILexicalBlock(scope: !918, file: !723, line: 101, column: 9)
!968 = !DILocation(line: 101, column: 15, scope: !967)
!969 = !DILocation(line: 101, column: 9, scope: !918)
!970 = !DILocation(line: 102, column: 13, scope: !971)
!971 = distinct !DILexicalBlock(scope: !967, file: !723, line: 101, column: 25)
!972 = !DILocation(line: 103, column: 9, scope: !971)
!973 = !DILocation(line: 106, column: 33, scope: !918)
!974 = !DILocation(line: 106, column: 5, scope: !918)
!975 = !DILocation(line: 106, column: 10, scope: !918)
!976 = !DILocation(line: 106, column: 20, scope: !918)
!977 = !DILocation(line: 106, column: 31, scope: !918)
!978 = !DILocation(line: 107, column: 10, scope: !979)
!979 = distinct !DILexicalBlock(scope: !918, file: !723, line: 107, column: 9)
!980 = !DILocation(line: 107, column: 15, scope: !979)
!981 = !DILocation(line: 107, column: 25, scope: !979)
!982 = !DILocation(line: 107, column: 9, scope: !918)
!983 = !DILocation(line: 108, column: 13, scope: !984)
!984 = distinct !DILexicalBlock(scope: !979, file: !723, line: 107, column: 37)
!985 = !DILocation(line: 109, column: 9, scope: !984)
!986 = !DILocation(line: 112, column: 25, scope: !918)
!987 = !DILocation(line: 112, column: 5, scope: !918)
!988 = !DILocation(line: 115, column: 9, scope: !989)
!989 = distinct !DILexicalBlock(scope: !918, file: !723, line: 115, column: 9)
!990 = !DILocation(line: 115, column: 17, scope: !989)
!991 = !DILocation(line: 115, column: 9, scope: !918)
!992 = !DILocation(line: 116, column: 37, scope: !993)
!993 = distinct !DILexicalBlock(scope: !989, file: !723, line: 115, column: 33)
!994 = !DILocation(line: 116, column: 45, scope: !993)
!995 = !DILocation(line: 116, column: 26, scope: !993)
!996 = !DILocation(line: 116, column: 9, scope: !993)
!997 = !DILocation(line: 116, column: 14, scope: !993)
!998 = !DILocation(line: 116, column: 24, scope: !993)
!999 = !DILocation(line: 117, column: 14, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !993, file: !723, line: 117, column: 13)
!1001 = !DILocation(line: 117, column: 19, scope: !1000)
!1002 = !DILocation(line: 117, column: 13, scope: !993)
!1003 = !DILocation(line: 118, column: 17, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !1000, file: !723, line: 117, column: 30)
!1005 = !DILocation(line: 119, column: 13, scope: !1004)
!1006 = !DILocation(line: 121, column: 13, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !993, file: !723, line: 121, column: 13)
!1008 = !DILocation(line: 121, column: 21, scope: !1007)
!1009 = !DILocation(line: 121, column: 13, scope: !993)
!1010 = !DILocation(line: 122, column: 49, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1007, file: !723, line: 121, column: 33)
!1012 = !DILocation(line: 122, column: 57, scope: !1011)
!1013 = !DILocation(line: 122, column: 32, scope: !1011)
!1014 = !DILocation(line: 122, column: 37, scope: !1011)
!1015 = !DILocation(line: 122, column: 14, scope: !1011)
!1016 = !DILocation(line: 122, column: 47, scope: !1011)
!1017 = !DILocation(line: 123, column: 33, scope: !1011)
!1018 = !DILocation(line: 123, column: 38, scope: !1011)
!1019 = !DILocation(line: 123, column: 13, scope: !1011)
!1020 = !DILocation(line: 124, column: 9, scope: !1011)
!1021 = !DILocation(line: 125, column: 5, scope: !993)
!1022 = !DILocation(line: 127, column: 13, scope: !918)
!1023 = !DILocation(line: 127, column: 6, scope: !918)
!1024 = !DILocation(line: 127, column: 11, scope: !918)
!1025 = !DILocation(line: 128, column: 5, scope: !918)
!1026 = !DILocation(line: 130, column: 5, scope: !918)
!1027 = !DILocation(line: 131, column: 12, scope: !918)
!1028 = !DILocation(line: 131, column: 5, scope: !918)
!1029 = !DILocation(line: 132, column: 1, scope: !918)
!1030 = distinct !DISubprogram(name: "av_bsf_init", scope: !723, file: !723, line: 134, type: !736, isLocal: false, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !844)
!1031 = !DILocalVariable(name: "ctx", arg: 1, scope: !1030, file: !723, line: 134, type: !738)
!1032 = !DILocation(line: 134, column: 31, scope: !1030)
!1033 = !DILocalVariable(name: "ret", scope: !1030, file: !723, line: 136, type: !656)
!1034 = !DILocation(line: 136, column: 9, scope: !1030)
!1035 = !DILocalVariable(name: "i", scope: !1030, file: !723, line: 136, type: !656)
!1036 = !DILocation(line: 136, column: 14, scope: !1030)
!1037 = !DILocation(line: 139, column: 9, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1030, file: !723, line: 139, column: 9)
!1039 = !DILocation(line: 139, column: 14, scope: !1038)
!1040 = !DILocation(line: 139, column: 22, scope: !1038)
!1041 = !DILocation(line: 139, column: 9, scope: !1030)
!1042 = !DILocation(line: 140, column: 16, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !723, line: 140, column: 9)
!1044 = distinct !DILexicalBlock(scope: !1038, file: !723, line: 139, column: 33)
!1045 = !DILocation(line: 140, column: 14, scope: !1043)
!1046 = !DILocation(line: 140, column: 44, scope: !1047)
!1047 = !DILexicalBlockFile(scope: !1048, file: !723, discriminator: 1)
!1048 = distinct !DILexicalBlock(scope: !1043, file: !723, line: 140, column: 9)
!1049 = !DILocation(line: 140, column: 21, scope: !1047)
!1050 = !DILocation(line: 140, column: 26, scope: !1047)
!1051 = !DILocation(line: 140, column: 34, scope: !1047)
!1052 = !DILocation(line: 140, column: 47, scope: !1047)
!1053 = !DILocation(line: 140, column: 9, scope: !1047)
!1054 = !DILocation(line: 141, column: 17, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1048, file: !723, line: 141, column: 17)
!1056 = !DILocation(line: 141, column: 22, scope: !1055)
!1057 = !DILocation(line: 141, column: 30, scope: !1055)
!1058 = !DILocation(line: 141, column: 65, scope: !1055)
!1059 = !DILocation(line: 141, column: 42, scope: !1055)
!1060 = !DILocation(line: 141, column: 47, scope: !1055)
!1061 = !DILocation(line: 141, column: 55, scope: !1055)
!1062 = !DILocation(line: 141, column: 39, scope: !1055)
!1063 = !DILocation(line: 141, column: 17, scope: !1048)
!1064 = !DILocation(line: 142, column: 17, scope: !1055)
!1065 = !DILocation(line: 141, column: 66, scope: !1066)
!1066 = !DILexicalBlockFile(scope: !1055, file: !723, discriminator: 1)
!1067 = !DILocation(line: 140, column: 69, scope: !1068)
!1068 = !DILexicalBlockFile(scope: !1048, file: !723, discriminator: 2)
!1069 = !DILocation(line: 140, column: 9, scope: !1068)
!1070 = distinct !{!1070, !1071}
!1071 = !DILocation(line: 140, column: 9, scope: !1044)
!1072 = !DILocation(line: 143, column: 36, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1044, file: !723, line: 143, column: 13)
!1074 = !DILocation(line: 143, column: 13, scope: !1073)
!1075 = !DILocation(line: 143, column: 18, scope: !1073)
!1076 = !DILocation(line: 143, column: 26, scope: !1073)
!1077 = !DILocation(line: 143, column: 39, scope: !1073)
!1078 = !DILocation(line: 143, column: 13, scope: !1044)
!1079 = !DILocalVariable(name: "desc", scope: !1080, file: !723, line: 144, type: !1081)
!1080 = distinct !DILexicalBlock(scope: !1073, file: !723, line: 143, column: 60)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1083)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !47, line: 740, baseType: !1084)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !47, line: 712, size: 384, align: 64, elements: !1085)
!1085 = !{!1086, !1087, !1088, !1089, !1090, !1091, !1094}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1084, file: !47, line: 713, baseType: !46, size: 32, align: 32)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1084, file: !47, line: 714, baseType: !536, size: 32, align: 32, offset: 32)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1084, file: !47, line: 720, baseType: !640, size: 64, align: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1084, file: !47, line: 724, baseType: !640, size: 64, align: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1084, file: !47, line: 728, baseType: !656, size: 32, align: 32, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1084, file: !47, line: 734, baseType: !1092, size: 64, align: 64, offset: 256)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !640)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1084, file: !47, line: 739, baseType: !1095, size: 64, align: 64, offset: 320)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1097)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !47, line: 3401, size: 128, align: 64, elements: !1098)
!1098 = !{!1099, !1100}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1097, file: !47, line: 3402, baseType: !656, size: 32, align: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1097, file: !47, line: 3403, baseType: !640, size: 64, align: 64, offset: 64)
!1101 = !DILocation(line: 144, column: 38, scope: !1080)
!1102 = !DILocation(line: 144, column: 68, scope: !1080)
!1103 = !DILocation(line: 144, column: 73, scope: !1080)
!1104 = !DILocation(line: 144, column: 81, scope: !1080)
!1105 = !DILocation(line: 144, column: 45, scope: !1080)
!1106 = !DILocation(line: 145, column: 20, scope: !1080)
!1107 = !DILocation(line: 147, column: 20, scope: !1080)
!1108 = !DILocation(line: 147, column: 27, scope: !1109)
!1109 = !DILexicalBlockFile(scope: !1080, file: !723, discriminator: 1)
!1110 = !DILocation(line: 147, column: 33, scope: !1109)
!1111 = !DILocation(line: 147, column: 20, scope: !1109)
!1112 = !DILocation(line: 147, column: 20, scope: !1113)
!1113 = !DILexicalBlockFile(scope: !1080, file: !723, discriminator: 2)
!1114 = !DILocation(line: 147, column: 20, scope: !1115)
!1115 = !DILexicalBlockFile(scope: !1080, file: !723, discriminator: 3)
!1116 = !DILocation(line: 147, column: 51, scope: !1115)
!1117 = !DILocation(line: 147, column: 56, scope: !1115)
!1118 = !DILocation(line: 147, column: 64, scope: !1115)
!1119 = !DILocation(line: 147, column: 74, scope: !1115)
!1120 = !DILocation(line: 147, column: 79, scope: !1115)
!1121 = !DILocation(line: 147, column: 87, scope: !1115)
!1122 = !DILocation(line: 145, column: 13, scope: !1109)
!1123 = !DILocation(line: 148, column: 20, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1080, file: !723, line: 148, column: 13)
!1125 = !DILocation(line: 148, column: 18, scope: !1124)
!1126 = !DILocation(line: 148, column: 48, scope: !1127)
!1127 = !DILexicalBlockFile(scope: !1128, file: !723, discriminator: 1)
!1128 = distinct !DILexicalBlock(scope: !1124, file: !723, line: 148, column: 13)
!1129 = !DILocation(line: 148, column: 25, scope: !1127)
!1130 = !DILocation(line: 148, column: 30, scope: !1127)
!1131 = !DILocation(line: 148, column: 38, scope: !1127)
!1132 = !DILocation(line: 148, column: 51, scope: !1127)
!1133 = !DILocation(line: 148, column: 13, scope: !1127)
!1134 = !DILocation(line: 149, column: 70, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1128, file: !723, line: 148, column: 77)
!1136 = !DILocation(line: 149, column: 47, scope: !1135)
!1137 = !DILocation(line: 149, column: 52, scope: !1135)
!1138 = !DILocation(line: 149, column: 60, scope: !1135)
!1139 = !DILocation(line: 149, column: 24, scope: !1135)
!1140 = !DILocation(line: 149, column: 22, scope: !1135)
!1141 = !DILocation(line: 150, column: 24, scope: !1135)
!1142 = !DILocation(line: 151, column: 24, scope: !1135)
!1143 = !DILocation(line: 151, column: 31, scope: !1144)
!1144 = !DILexicalBlockFile(scope: !1135, file: !723, discriminator: 1)
!1145 = !DILocation(line: 151, column: 37, scope: !1144)
!1146 = !DILocation(line: 151, column: 24, scope: !1144)
!1147 = !DILocation(line: 151, column: 24, scope: !1148)
!1148 = !DILexicalBlockFile(scope: !1135, file: !723, discriminator: 2)
!1149 = !DILocation(line: 151, column: 24, scope: !1150)
!1150 = !DILexicalBlockFile(scope: !1135, file: !723, discriminator: 3)
!1151 = !DILocation(line: 151, column: 78, scope: !1150)
!1152 = !DILocation(line: 151, column: 55, scope: !1150)
!1153 = !DILocation(line: 151, column: 60, scope: !1150)
!1154 = !DILocation(line: 151, column: 68, scope: !1150)
!1155 = !DILocation(line: 150, column: 17, scope: !1144)
!1156 = !DILocation(line: 152, column: 13, scope: !1135)
!1157 = !DILocation(line: 148, column: 73, scope: !1158)
!1158 = !DILexicalBlockFile(scope: !1128, file: !723, discriminator: 2)
!1159 = !DILocation(line: 148, column: 13, scope: !1158)
!1160 = distinct !{!1160, !1161}
!1161 = !DILocation(line: 148, column: 13, scope: !1080)
!1162 = !DILocation(line: 153, column: 20, scope: !1080)
!1163 = !DILocation(line: 153, column: 13, scope: !1080)
!1164 = !DILocation(line: 154, column: 13, scope: !1080)
!1165 = !DILocation(line: 156, column: 5, scope: !1044)
!1166 = !DILocation(line: 160, column: 35, scope: !1030)
!1167 = !DILocation(line: 160, column: 40, scope: !1030)
!1168 = !DILocation(line: 160, column: 49, scope: !1030)
!1169 = !DILocation(line: 160, column: 54, scope: !1030)
!1170 = !DILocation(line: 160, column: 11, scope: !1030)
!1171 = !DILocation(line: 160, column: 9, scope: !1030)
!1172 = !DILocation(line: 161, column: 9, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1030, file: !723, line: 161, column: 9)
!1174 = !DILocation(line: 161, column: 13, scope: !1173)
!1175 = !DILocation(line: 161, column: 9, scope: !1030)
!1176 = !DILocation(line: 162, column: 16, scope: !1173)
!1177 = !DILocation(line: 162, column: 9, scope: !1173)
!1178 = !DILocation(line: 164, column: 5, scope: !1030)
!1179 = !DILocation(line: 164, column: 10, scope: !1030)
!1180 = !DILocation(line: 164, column: 26, scope: !1030)
!1181 = !DILocation(line: 164, column: 31, scope: !1030)
!1182 = !DILocation(line: 166, column: 9, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1030, file: !723, line: 166, column: 9)
!1184 = !DILocation(line: 166, column: 14, scope: !1183)
!1185 = !DILocation(line: 166, column: 22, scope: !1183)
!1186 = !DILocation(line: 166, column: 9, scope: !1030)
!1187 = !DILocation(line: 167, column: 15, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1183, file: !723, line: 166, column: 28)
!1189 = !DILocation(line: 167, column: 20, scope: !1188)
!1190 = !DILocation(line: 167, column: 28, scope: !1188)
!1191 = !DILocation(line: 167, column: 33, scope: !1188)
!1192 = !DILocation(line: 167, column: 13, scope: !1188)
!1193 = !DILocation(line: 168, column: 13, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1188, file: !723, line: 168, column: 13)
!1195 = !DILocation(line: 168, column: 17, scope: !1194)
!1196 = !DILocation(line: 168, column: 13, scope: !1188)
!1197 = !DILocation(line: 169, column: 20, scope: !1194)
!1198 = !DILocation(line: 169, column: 13, scope: !1194)
!1199 = !DILocation(line: 170, column: 5, scope: !1188)
!1200 = !DILocation(line: 172, column: 5, scope: !1030)
!1201 = !DILocation(line: 173, column: 1, scope: !1030)
!1202 = distinct !DISubprogram(name: "av_bsf_flush", scope: !723, file: !723, line: 175, type: !837, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !844)
!1203 = !DILocalVariable(name: "ctx", arg: 1, scope: !1202, file: !723, line: 175, type: !738)
!1204 = !DILocation(line: 175, column: 33, scope: !1202)
!1205 = !DILocation(line: 177, column: 5, scope: !1202)
!1206 = !DILocation(line: 177, column: 10, scope: !1202)
!1207 = !DILocation(line: 177, column: 20, scope: !1202)
!1208 = !DILocation(line: 177, column: 24, scope: !1202)
!1209 = !DILocation(line: 179, column: 21, scope: !1202)
!1210 = !DILocation(line: 179, column: 26, scope: !1202)
!1211 = !DILocation(line: 179, column: 36, scope: !1202)
!1212 = !DILocation(line: 179, column: 5, scope: !1202)
!1213 = !DILocation(line: 181, column: 9, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1202, file: !723, line: 181, column: 9)
!1215 = !DILocation(line: 181, column: 14, scope: !1214)
!1216 = !DILocation(line: 181, column: 22, scope: !1214)
!1217 = !DILocation(line: 181, column: 9, scope: !1202)
!1218 = !DILocation(line: 182, column: 9, scope: !1214)
!1219 = !DILocation(line: 182, column: 14, scope: !1214)
!1220 = !DILocation(line: 182, column: 22, scope: !1214)
!1221 = !DILocation(line: 182, column: 28, scope: !1214)
!1222 = !DILocation(line: 183, column: 1, scope: !1202)
!1223 = distinct !DISubprogram(name: "av_bsf_send_packet", scope: !723, file: !723, line: 185, type: !833, isLocal: false, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !844)
!1224 = !DILocalVariable(name: "ctx", arg: 1, scope: !1223, file: !723, line: 185, type: !738)
!1225 = !DILocation(line: 185, column: 38, scope: !1223)
!1226 = !DILocalVariable(name: "pkt", arg: 2, scope: !1223, file: !723, line: 185, type: !752)
!1227 = !DILocation(line: 185, column: 53, scope: !1223)
!1228 = !DILocalVariable(name: "ret", scope: !1223, file: !723, line: 187, type: !656)
!1229 = !DILocation(line: 187, column: 9, scope: !1223)
!1230 = !DILocation(line: 189, column: 10, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1223, file: !723, line: 189, column: 9)
!1232 = !DILocation(line: 189, column: 14, scope: !1231)
!1233 = !DILocation(line: 189, column: 19, scope: !1234)
!1234 = !DILexicalBlockFile(scope: !1231, file: !723, discriminator: 1)
!1235 = !DILocation(line: 189, column: 24, scope: !1234)
!1236 = !DILocation(line: 189, column: 29, scope: !1234)
!1237 = !DILocation(line: 189, column: 33, scope: !1238)
!1238 = !DILexicalBlockFile(scope: !1231, file: !723, discriminator: 2)
!1239 = !DILocation(line: 189, column: 38, scope: !1238)
!1240 = !DILocation(line: 189, column: 9, scope: !1238)
!1241 = !DILocation(line: 190, column: 9, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1231, file: !723, line: 189, column: 56)
!1243 = !DILocation(line: 190, column: 14, scope: !1242)
!1244 = !DILocation(line: 190, column: 24, scope: !1242)
!1245 = !DILocation(line: 190, column: 28, scope: !1242)
!1246 = !DILocation(line: 191, column: 9, scope: !1242)
!1247 = !DILocation(line: 194, column: 9, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1223, file: !723, line: 194, column: 9)
!1249 = !DILocation(line: 194, column: 14, scope: !1248)
!1250 = !DILocation(line: 194, column: 24, scope: !1248)
!1251 = !DILocation(line: 194, column: 9, scope: !1223)
!1252 = !DILocation(line: 195, column: 16, scope: !1253)
!1253 = distinct !DILexicalBlock(scope: !1248, file: !723, line: 194, column: 29)
!1254 = !DILocation(line: 195, column: 9, scope: !1253)
!1255 = !DILocation(line: 196, column: 9, scope: !1253)
!1256 = !DILocation(line: 199, column: 9, scope: !1257)
!1257 = distinct !DILexicalBlock(scope: !1223, file: !723, line: 199, column: 9)
!1258 = !DILocation(line: 199, column: 14, scope: !1257)
!1259 = !DILocation(line: 199, column: 24, scope: !1257)
!1260 = !DILocation(line: 199, column: 36, scope: !1257)
!1261 = !DILocation(line: 199, column: 41, scope: !1257)
!1262 = !DILocation(line: 200, column: 9, scope: !1257)
!1263 = !DILocation(line: 200, column: 14, scope: !1257)
!1264 = !DILocation(line: 200, column: 24, scope: !1257)
!1265 = !DILocation(line: 200, column: 36, scope: !1257)
!1266 = !DILocation(line: 199, column: 9, scope: !1267)
!1267 = !DILexicalBlockFile(scope: !1223, file: !723, discriminator: 1)
!1268 = !DILocation(line: 201, column: 9, scope: !1257)
!1269 = !DILocation(line: 203, column: 37, scope: !1223)
!1270 = !DILocation(line: 203, column: 11, scope: !1223)
!1271 = !DILocation(line: 203, column: 9, scope: !1223)
!1272 = !DILocation(line: 204, column: 9, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1223, file: !723, line: 204, column: 9)
!1274 = !DILocation(line: 204, column: 13, scope: !1273)
!1275 = !DILocation(line: 204, column: 9, scope: !1223)
!1276 = !DILocation(line: 205, column: 16, scope: !1273)
!1277 = !DILocation(line: 205, column: 9, scope: !1273)
!1278 = !DILocation(line: 206, column: 24, scope: !1223)
!1279 = !DILocation(line: 206, column: 29, scope: !1223)
!1280 = !DILocation(line: 206, column: 39, scope: !1223)
!1281 = !DILocation(line: 206, column: 51, scope: !1223)
!1282 = !DILocation(line: 206, column: 5, scope: !1223)
!1283 = !DILocation(line: 208, column: 5, scope: !1223)
!1284 = !DILocation(line: 209, column: 1, scope: !1223)
!1285 = distinct !DISubprogram(name: "av_bsf_receive_packet", scope: !723, file: !723, line: 211, type: !833, isLocal: false, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !844)
!1286 = !DILocalVariable(name: "ctx", arg: 1, scope: !1285, file: !723, line: 211, type: !738)
!1287 = !DILocation(line: 211, column: 41, scope: !1285)
!1288 = !DILocalVariable(name: "pkt", arg: 2, scope: !1285, file: !723, line: 211, type: !752)
!1289 = !DILocation(line: 211, column: 56, scope: !1285)
!1290 = !DILocation(line: 213, column: 12, scope: !1285)
!1291 = !DILocation(line: 213, column: 17, scope: !1285)
!1292 = !DILocation(line: 213, column: 25, scope: !1285)
!1293 = !DILocation(line: 213, column: 32, scope: !1285)
!1294 = !DILocation(line: 213, column: 37, scope: !1285)
!1295 = !DILocation(line: 213, column: 5, scope: !1285)
!1296 = distinct !DISubprogram(name: "ff_bsf_get_packet", scope: !723, file: !723, line: 216, type: !1297, isLocal: false, isDefinition: true, scopeLine: 217, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !844)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!656, !738, !1299}
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64, align: 64)
!1300 = !DILocalVariable(name: "ctx", arg: 1, scope: !1296, file: !723, line: 216, type: !738)
!1301 = !DILocation(line: 216, column: 37, scope: !1296)
!1302 = !DILocalVariable(name: "pkt", arg: 2, scope: !1296, file: !723, line: 216, type: !1299)
!1303 = !DILocation(line: 216, column: 53, scope: !1296)
!1304 = !DILocalVariable(name: "in", scope: !1296, file: !723, line: 218, type: !747)
!1305 = !DILocation(line: 218, column: 20, scope: !1296)
!1306 = !DILocation(line: 218, column: 25, scope: !1296)
!1307 = !DILocation(line: 218, column: 30, scope: !1296)
!1308 = !DILocalVariable(name: "tmp_pkt", scope: !1296, file: !723, line: 219, type: !752)
!1309 = !DILocation(line: 219, column: 15, scope: !1296)
!1310 = !DILocation(line: 221, column: 9, scope: !1311)
!1311 = distinct !DILexicalBlock(scope: !1296, file: !723, line: 221, column: 9)
!1312 = !DILocation(line: 221, column: 13, scope: !1311)
!1313 = !DILocation(line: 221, column: 9, scope: !1296)
!1314 = !DILocation(line: 222, column: 9, scope: !1311)
!1315 = !DILocation(line: 224, column: 10, scope: !1316)
!1316 = distinct !DILexicalBlock(scope: !1296, file: !723, line: 224, column: 9)
!1317 = !DILocation(line: 224, column: 15, scope: !1316)
!1318 = !DILocation(line: 224, column: 25, scope: !1316)
!1319 = !DILocation(line: 224, column: 37, scope: !1316)
!1320 = !DILocation(line: 224, column: 42, scope: !1316)
!1321 = !DILocation(line: 225, column: 10, scope: !1316)
!1322 = !DILocation(line: 225, column: 15, scope: !1316)
!1323 = !DILocation(line: 225, column: 25, scope: !1316)
!1324 = !DILocation(line: 225, column: 37, scope: !1316)
!1325 = !DILocation(line: 224, column: 9, scope: !1326)
!1326 = !DILexicalBlockFile(scope: !1296, file: !723, discriminator: 1)
!1327 = !DILocation(line: 226, column: 9, scope: !1316)
!1328 = !DILocation(line: 228, column: 15, scope: !1296)
!1329 = !DILocation(line: 228, column: 13, scope: !1296)
!1330 = !DILocation(line: 229, column: 10, scope: !1331)
!1331 = distinct !DILexicalBlock(scope: !1296, file: !723, line: 229, column: 9)
!1332 = !DILocation(line: 229, column: 9, scope: !1296)
!1333 = !DILocation(line: 230, column: 9, scope: !1331)
!1334 = !DILocation(line: 232, column: 12, scope: !1296)
!1335 = !DILocation(line: 232, column: 17, scope: !1296)
!1336 = !DILocation(line: 232, column: 27, scope: !1296)
!1337 = !DILocation(line: 232, column: 6, scope: !1296)
!1338 = !DILocation(line: 232, column: 10, scope: !1296)
!1339 = !DILocation(line: 233, column: 33, scope: !1296)
!1340 = !DILocation(line: 233, column: 5, scope: !1296)
!1341 = !DILocation(line: 233, column: 10, scope: !1296)
!1342 = !DILocation(line: 233, column: 20, scope: !1296)
!1343 = !DILocation(line: 233, column: 31, scope: !1296)
!1344 = !DILocation(line: 235, column: 5, scope: !1296)
!1345 = !DILocation(line: 236, column: 1, scope: !1296)
!1346 = distinct !DISubprogram(name: "ff_bsf_get_packet_ref", scope: !723, file: !723, line: 238, type: !833, isLocal: false, isDefinition: true, scopeLine: 239, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !844)
!1347 = !DILocalVariable(name: "ctx", arg: 1, scope: !1346, file: !723, line: 238, type: !738)
!1348 = !DILocation(line: 238, column: 41, scope: !1346)
!1349 = !DILocalVariable(name: "pkt", arg: 2, scope: !1346, file: !723, line: 238, type: !752)
!1350 = !DILocation(line: 238, column: 56, scope: !1346)
!1351 = !DILocalVariable(name: "in", scope: !1346, file: !723, line: 240, type: !747)
!1352 = !DILocation(line: 240, column: 20, scope: !1346)
!1353 = !DILocation(line: 240, column: 25, scope: !1346)
!1354 = !DILocation(line: 240, column: 30, scope: !1346)
!1355 = !DILocation(line: 242, column: 9, scope: !1356)
!1356 = distinct !DILexicalBlock(scope: !1346, file: !723, line: 242, column: 9)
!1357 = !DILocation(line: 242, column: 13, scope: !1356)
!1358 = !DILocation(line: 242, column: 9, scope: !1346)
!1359 = !DILocation(line: 243, column: 9, scope: !1356)
!1360 = !DILocation(line: 245, column: 10, scope: !1361)
!1361 = distinct !DILexicalBlock(scope: !1346, file: !723, line: 245, column: 9)
!1362 = !DILocation(line: 245, column: 15, scope: !1361)
!1363 = !DILocation(line: 245, column: 25, scope: !1361)
!1364 = !DILocation(line: 245, column: 37, scope: !1361)
!1365 = !DILocation(line: 245, column: 42, scope: !1361)
!1366 = !DILocation(line: 246, column: 10, scope: !1361)
!1367 = !DILocation(line: 246, column: 15, scope: !1361)
!1368 = !DILocation(line: 246, column: 25, scope: !1361)
!1369 = !DILocation(line: 246, column: 37, scope: !1361)
!1370 = !DILocation(line: 245, column: 9, scope: !1371)
!1371 = !DILexicalBlockFile(scope: !1346, file: !723, discriminator: 1)
!1372 = !DILocation(line: 247, column: 9, scope: !1361)
!1373 = !DILocation(line: 249, column: 24, scope: !1346)
!1374 = !DILocation(line: 249, column: 29, scope: !1346)
!1375 = !DILocation(line: 249, column: 34, scope: !1346)
!1376 = !DILocation(line: 249, column: 44, scope: !1346)
!1377 = !DILocation(line: 249, column: 5, scope: !1346)
!1378 = !DILocation(line: 251, column: 5, scope: !1346)
!1379 = !DILocation(line: 252, column: 1, scope: !1346)
!1380 = distinct !DISubprogram(name: "bsf_list_init", scope: !723, file: !723, line: 267, type: !736, isLocal: true, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !844)
!1381 = !DILocalVariable(name: "bsf", arg: 1, scope: !1380, file: !723, line: 267, type: !738)
!1382 = !DILocation(line: 267, column: 40, scope: !1380)
!1383 = !DILocalVariable(name: "lst", scope: !1380, file: !723, line: 269, type: !1384)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_typedef, name: "BSFListContext", file: !723, line: 264, baseType: !1386)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BSFListContext", file: !723, line: 254, size: 320, align: 64, elements: !1387)
!1387 = !{!1388, !1389, !1390, !1391, !1392, !1393}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1386, file: !723, line: 255, baseType: !634, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1386, file: !723, line: 257, baseType: !851, size: 64, align: 64, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1386, file: !723, line: 258, baseType: !656, size: 32, align: 32, offset: 128)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1386, file: !723, line: 260, baseType: !720, size: 32, align: 32, offset: 160)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "flushed_idx", scope: !1386, file: !723, line: 261, baseType: !720, size: 32, align: 32, offset: 192)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1386, file: !723, line: 263, baseType: !1394, size: 64, align: 64, offset: 256)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64, align: 64)
!1395 = !DILocation(line: 269, column: 21, scope: !1380)
!1396 = !DILocation(line: 269, column: 27, scope: !1380)
!1397 = !DILocation(line: 269, column: 32, scope: !1380)
!1398 = !DILocalVariable(name: "ret", scope: !1380, file: !723, line: 270, type: !656)
!1399 = !DILocation(line: 270, column: 9, scope: !1380)
!1400 = !DILocalVariable(name: "i", scope: !1380, file: !723, line: 270, type: !656)
!1401 = !DILocation(line: 270, column: 14, scope: !1380)
!1402 = !DILocalVariable(name: "cod_par", scope: !1380, file: !723, line: 271, type: !1403)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !793)
!1405 = !DILocation(line: 271, column: 30, scope: !1380)
!1406 = !DILocation(line: 271, column: 40, scope: !1380)
!1407 = !DILocation(line: 271, column: 45, scope: !1380)
!1408 = !DILocalVariable(name: "tb", scope: !1380, file: !723, line: 272, type: !669)
!1409 = !DILocation(line: 272, column: 16, scope: !1380)
!1410 = !DILocation(line: 272, column: 21, scope: !1380)
!1411 = !DILocation(line: 272, column: 26, scope: !1380)
!1412 = !DILocation(line: 274, column: 12, scope: !1413)
!1413 = distinct !DILexicalBlock(scope: !1380, file: !723, line: 274, column: 5)
!1414 = !DILocation(line: 274, column: 10, scope: !1413)
!1415 = !DILocation(line: 274, column: 17, scope: !1416)
!1416 = !DILexicalBlockFile(scope: !1417, file: !723, discriminator: 1)
!1417 = distinct !DILexicalBlock(scope: !1413, file: !723, line: 274, column: 5)
!1418 = !DILocation(line: 274, column: 21, scope: !1416)
!1419 = !DILocation(line: 274, column: 26, scope: !1416)
!1420 = !DILocation(line: 274, column: 19, scope: !1416)
!1421 = !DILocation(line: 274, column: 5, scope: !1416)
!1422 = !DILocation(line: 275, column: 49, scope: !1423)
!1423 = distinct !DILexicalBlock(scope: !1417, file: !723, line: 274, column: 40)
!1424 = !DILocation(line: 275, column: 39, scope: !1423)
!1425 = !DILocation(line: 275, column: 44, scope: !1423)
!1426 = !DILocation(line: 275, column: 53, scope: !1423)
!1427 = !DILocation(line: 275, column: 61, scope: !1423)
!1428 = !DILocation(line: 275, column: 15, scope: !1423)
!1429 = !DILocation(line: 275, column: 13, scope: !1423)
!1430 = !DILocation(line: 276, column: 13, scope: !1431)
!1431 = distinct !DILexicalBlock(scope: !1423, file: !723, line: 276, column: 13)
!1432 = !DILocation(line: 276, column: 17, scope: !1431)
!1433 = !DILocation(line: 276, column: 13, scope: !1423)
!1434 = !DILocation(line: 277, column: 13, scope: !1431)
!1435 = !DILocation(line: 279, column: 19, scope: !1423)
!1436 = !DILocation(line: 279, column: 9, scope: !1423)
!1437 = !DILocation(line: 279, column: 14, scope: !1423)
!1438 = !DILocation(line: 279, column: 23, scope: !1423)
!1439 = !DILocation(line: 279, column: 38, scope: !1423)
!1440 = !DILocation(line: 281, column: 37, scope: !1423)
!1441 = !DILocation(line: 281, column: 27, scope: !1423)
!1442 = !DILocation(line: 281, column: 32, scope: !1423)
!1443 = !DILocation(line: 281, column: 15, scope: !1423)
!1444 = !DILocation(line: 281, column: 13, scope: !1423)
!1445 = !DILocation(line: 282, column: 13, scope: !1446)
!1446 = distinct !DILexicalBlock(scope: !1423, file: !723, line: 282, column: 13)
!1447 = !DILocation(line: 282, column: 17, scope: !1446)
!1448 = !DILocation(line: 282, column: 13, scope: !1423)
!1449 = !DILocation(line: 283, column: 13, scope: !1446)
!1450 = !DILocation(line: 285, column: 29, scope: !1423)
!1451 = !DILocation(line: 285, column: 19, scope: !1423)
!1452 = !DILocation(line: 285, column: 24, scope: !1423)
!1453 = !DILocation(line: 285, column: 33, scope: !1423)
!1454 = !DILocation(line: 285, column: 17, scope: !1423)
!1455 = !DILocation(line: 286, column: 24, scope: !1423)
!1456 = !DILocation(line: 286, column: 14, scope: !1423)
!1457 = !DILocation(line: 286, column: 19, scope: !1423)
!1458 = !DILocation(line: 286, column: 28, scope: !1423)
!1459 = !DILocation(line: 287, column: 5, scope: !1423)
!1460 = !DILocation(line: 274, column: 35, scope: !1461)
!1461 = !DILexicalBlockFile(scope: !1417, file: !723, discriminator: 2)
!1462 = !DILocation(line: 274, column: 5, scope: !1461)
!1463 = distinct !{!1463, !1464}
!1464 = !DILocation(line: 274, column: 5, scope: !1380)
!1465 = !DILocation(line: 289, column: 5, scope: !1380)
!1466 = !DILocation(line: 289, column: 10, scope: !1380)
!1467 = !DILocation(line: 289, column: 26, scope: !1380)
!1468 = !DILocation(line: 290, column: 35, scope: !1380)
!1469 = !DILocation(line: 290, column: 40, scope: !1380)
!1470 = !DILocation(line: 290, column: 49, scope: !1380)
!1471 = !DILocation(line: 290, column: 11, scope: !1380)
!1472 = !DILocation(line: 290, column: 9, scope: !1380)
!1473 = !DILocation(line: 290, column: 5, scope: !1380)
!1474 = !DILocation(line: 293, column: 12, scope: !1380)
!1475 = !DILocation(line: 293, column: 5, scope: !1380)
!1476 = distinct !DISubprogram(name: "bsf_list_filter", scope: !723, file: !723, line: 296, type: !833, isLocal: true, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !844)
!1477 = !DILocalVariable(name: "bsf", arg: 1, scope: !1476, file: !723, line: 296, type: !738)
!1478 = !DILocation(line: 296, column: 42, scope: !1476)
!1479 = !DILocalVariable(name: "out", arg: 2, scope: !1476, file: !723, line: 296, type: !752)
!1480 = !DILocation(line: 296, column: 57, scope: !1476)
!1481 = !DILocalVariable(name: "lst", scope: !1476, file: !723, line: 298, type: !1384)
!1482 = !DILocation(line: 298, column: 21, scope: !1476)
!1483 = !DILocation(line: 298, column: 27, scope: !1476)
!1484 = !DILocation(line: 298, column: 32, scope: !1476)
!1485 = !DILocalVariable(name: "ret", scope: !1476, file: !723, line: 299, type: !656)
!1486 = !DILocation(line: 299, column: 9, scope: !1476)
!1487 = !DILocation(line: 301, column: 10, scope: !1488)
!1488 = distinct !DILexicalBlock(scope: !1476, file: !723, line: 301, column: 9)
!1489 = !DILocation(line: 301, column: 15, scope: !1488)
!1490 = !DILocation(line: 301, column: 9, scope: !1476)
!1491 = !DILocation(line: 302, column: 38, scope: !1488)
!1492 = !DILocation(line: 302, column: 43, scope: !1488)
!1493 = !DILocation(line: 302, column: 16, scope: !1488)
!1494 = !DILocation(line: 302, column: 9, scope: !1488)
!1495 = !DILocation(line: 304, column: 5, scope: !1476)
!1496 = !DILocation(line: 305, column: 13, scope: !1497)
!1497 = distinct !DILexicalBlock(scope: !1498, file: !723, line: 305, column: 13)
!1498 = distinct !DILexicalBlock(scope: !1476, file: !723, line: 304, column: 15)
!1499 = !DILocation(line: 305, column: 18, scope: !1497)
!1500 = !DILocation(line: 305, column: 24, scope: !1497)
!1501 = !DILocation(line: 305, column: 29, scope: !1497)
!1502 = !DILocation(line: 305, column: 22, scope: !1497)
!1503 = !DILocation(line: 305, column: 13, scope: !1498)
!1504 = !DILocation(line: 306, column: 51, scope: !1505)
!1505 = distinct !DILexicalBlock(scope: !1497, file: !723, line: 305, column: 42)
!1506 = !DILocation(line: 306, column: 56, scope: !1505)
!1507 = !DILocation(line: 306, column: 59, scope: !1505)
!1508 = !DILocation(line: 306, column: 41, scope: !1505)
!1509 = !DILocation(line: 306, column: 46, scope: !1505)
!1510 = !DILocation(line: 306, column: 64, scope: !1505)
!1511 = !DILocation(line: 306, column: 19, scope: !1505)
!1512 = !DILocation(line: 306, column: 17, scope: !1505)
!1513 = !DILocation(line: 307, column: 17, scope: !1514)
!1514 = distinct !DILexicalBlock(scope: !1505, file: !723, line: 307, column: 17)
!1515 = !DILocation(line: 307, column: 21, scope: !1514)
!1516 = !DILocation(line: 307, column: 17, scope: !1505)
!1517 = !DILocation(line: 309, column: 21, scope: !1518)
!1518 = distinct !DILexicalBlock(scope: !1514, file: !723, line: 307, column: 27)
!1519 = !DILocation(line: 310, column: 17, scope: !1518)
!1520 = !DILocation(line: 310, column: 22, scope: !1518)
!1521 = !DILocation(line: 310, column: 25, scope: !1518)
!1522 = !DILocation(line: 311, column: 17, scope: !1518)
!1523 = distinct !{!1523, !1495}
!1524 = !DILocation(line: 312, column: 24, scope: !1525)
!1525 = distinct !DILexicalBlock(scope: !1514, file: !723, line: 312, column: 24)
!1526 = !DILocation(line: 312, column: 28, scope: !1525)
!1527 = !DILocation(line: 312, column: 24, scope: !1514)
!1528 = !DILocation(line: 314, column: 36, scope: !1529)
!1529 = distinct !DILexicalBlock(scope: !1525, file: !723, line: 312, column: 105)
!1530 = !DILocation(line: 314, column: 41, scope: !1529)
!1531 = !DILocation(line: 314, column: 17, scope: !1529)
!1532 = !DILocation(line: 314, column: 22, scope: !1529)
!1533 = !DILocation(line: 314, column: 34, scope: !1529)
!1534 = !DILocation(line: 315, column: 17, scope: !1529)
!1535 = !DILocation(line: 316, column: 23, scope: !1536)
!1536 = distinct !DILexicalBlock(scope: !1525, file: !723, line: 316, column: 23)
!1537 = !DILocation(line: 316, column: 27, scope: !1536)
!1538 = !DILocation(line: 316, column: 23, scope: !1525)
!1539 = !DILocation(line: 318, column: 17, scope: !1540)
!1540 = distinct !DILexicalBlock(scope: !1536, file: !723, line: 316, column: 32)
!1541 = !DILocation(line: 320, column: 9, scope: !1505)
!1542 = !DILocation(line: 321, column: 41, scope: !1543)
!1543 = distinct !DILexicalBlock(scope: !1497, file: !723, line: 320, column: 16)
!1544 = !DILocation(line: 321, column: 46, scope: !1543)
!1545 = !DILocation(line: 321, column: 19, scope: !1543)
!1546 = !DILocation(line: 321, column: 17, scope: !1543)
!1547 = !DILocation(line: 322, column: 17, scope: !1548)
!1548 = distinct !DILexicalBlock(scope: !1543, file: !723, line: 322, column: 17)
!1549 = !DILocation(line: 322, column: 21, scope: !1548)
!1550 = !DILocation(line: 322, column: 17, scope: !1543)
!1551 = !DILocation(line: 323, column: 28, scope: !1552)
!1552 = distinct !DILexicalBlock(scope: !1548, file: !723, line: 322, column: 98)
!1553 = !DILocation(line: 323, column: 33, scope: !1552)
!1554 = !DILocation(line: 323, column: 17, scope: !1552)
!1555 = !DILocation(line: 323, column: 22, scope: !1552)
!1556 = !DILocation(line: 323, column: 26, scope: !1552)
!1557 = !DILocation(line: 324, column: 13, scope: !1552)
!1558 = !DILocation(line: 324, column: 24, scope: !1559)
!1559 = !DILexicalBlockFile(scope: !1560, file: !723, discriminator: 1)
!1560 = distinct !DILexicalBlock(scope: !1548, file: !723, line: 324, column: 24)
!1561 = !DILocation(line: 324, column: 28, scope: !1559)
!1562 = !DILocation(line: 325, column: 17, scope: !1560)
!1563 = !DILocation(line: 328, column: 13, scope: !1564)
!1564 = distinct !DILexicalBlock(scope: !1498, file: !723, line: 328, column: 13)
!1565 = !DILocation(line: 328, column: 18, scope: !1564)
!1566 = !DILocation(line: 328, column: 24, scope: !1564)
!1567 = !DILocation(line: 328, column: 29, scope: !1564)
!1568 = !DILocation(line: 328, column: 22, scope: !1564)
!1569 = !DILocation(line: 328, column: 13, scope: !1498)
!1570 = !DILocalVariable(name: "pkt", scope: !1571, file: !723, line: 329, type: !752)
!1571 = distinct !DILexicalBlock(scope: !1564, file: !723, line: 328, column: 38)
!1572 = !DILocation(line: 329, column: 23, scope: !1571)
!1573 = !DILocation(line: 330, column: 17, scope: !1574)
!1574 = distinct !DILexicalBlock(scope: !1571, file: !723, line: 330, column: 17)
!1575 = !DILocation(line: 330, column: 21, scope: !1574)
!1576 = !DILocation(line: 330, column: 97, scope: !1574)
!1577 = !DILocation(line: 330, column: 100, scope: !1578)
!1578 = !DILexicalBlockFile(scope: !1574, file: !723, discriminator: 1)
!1579 = !DILocation(line: 330, column: 105, scope: !1578)
!1580 = !DILocation(line: 330, column: 112, scope: !1578)
!1581 = !DILocation(line: 330, column: 117, scope: !1578)
!1582 = !DILocation(line: 330, column: 109, scope: !1578)
!1583 = !DILocation(line: 330, column: 17, scope: !1578)
!1584 = !DILocation(line: 333, column: 21, scope: !1585)
!1585 = distinct !DILexicalBlock(scope: !1574, file: !723, line: 330, column: 130)
!1586 = !DILocation(line: 334, column: 13, scope: !1585)
!1587 = !DILocation(line: 335, column: 23, scope: !1588)
!1588 = distinct !DILexicalBlock(scope: !1574, file: !723, line: 334, column: 20)
!1589 = !DILocation(line: 335, column: 21, scope: !1588)
!1590 = !DILocation(line: 337, column: 48, scope: !1571)
!1591 = !DILocation(line: 337, column: 53, scope: !1571)
!1592 = !DILocation(line: 337, column: 38, scope: !1571)
!1593 = !DILocation(line: 337, column: 43, scope: !1571)
!1594 = !DILocation(line: 337, column: 59, scope: !1571)
!1595 = !DILocation(line: 337, column: 19, scope: !1571)
!1596 = !DILocation(line: 337, column: 17, scope: !1571)
!1597 = !DILocation(line: 338, column: 17, scope: !1598)
!1598 = distinct !DILexicalBlock(scope: !1571, file: !723, line: 338, column: 17)
!1599 = !DILocation(line: 338, column: 21, scope: !1598)
!1600 = !DILocation(line: 338, column: 17, scope: !1571)
!1601 = !DILocation(line: 339, column: 17, scope: !1598)
!1602 = !DILocation(line: 340, column: 13, scope: !1571)
!1603 = !DILocation(line: 340, column: 18, scope: !1571)
!1604 = !DILocation(line: 340, column: 21, scope: !1571)
!1605 = !DILocation(line: 341, column: 9, scope: !1571)
!1606 = !DILocation(line: 343, column: 13, scope: !1607)
!1607 = distinct !DILexicalBlock(scope: !1564, file: !723, line: 341, column: 16)
!1608 = !DILocation(line: 304, column: 5, scope: !1609)
!1609 = !DILexicalBlockFile(scope: !1476, file: !723, discriminator: 1)
!1610 = !DILocation(line: 347, column: 9, scope: !1611)
!1611 = distinct !DILexicalBlock(scope: !1476, file: !723, line: 347, column: 9)
!1612 = !DILocation(line: 347, column: 13, scope: !1611)
!1613 = !DILocation(line: 347, column: 9, scope: !1476)
!1614 = !DILocation(line: 348, column: 25, scope: !1611)
!1615 = !DILocation(line: 348, column: 9, scope: !1611)
!1616 = !DILocation(line: 350, column: 12, scope: !1476)
!1617 = !DILocation(line: 350, column: 5, scope: !1476)
!1618 = !DILocation(line: 351, column: 1, scope: !1476)
!1619 = distinct !DISubprogram(name: "bsf_list_close", scope: !723, file: !723, line: 362, type: !837, isLocal: true, isDefinition: true, scopeLine: 363, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !844)
!1620 = !DILocalVariable(name: "bsf", arg: 1, scope: !1619, file: !723, line: 362, type: !738)
!1621 = !DILocation(line: 362, column: 42, scope: !1619)
!1622 = !DILocalVariable(name: "lst", scope: !1619, file: !723, line: 364, type: !1384)
!1623 = !DILocation(line: 364, column: 21, scope: !1619)
!1624 = !DILocation(line: 364, column: 27, scope: !1619)
!1625 = !DILocation(line: 364, column: 32, scope: !1619)
!1626 = !DILocalVariable(name: "i", scope: !1619, file: !723, line: 365, type: !656)
!1627 = !DILocation(line: 365, column: 9, scope: !1619)
!1628 = !DILocation(line: 367, column: 12, scope: !1629)
!1629 = distinct !DILexicalBlock(scope: !1619, file: !723, line: 367, column: 5)
!1630 = !DILocation(line: 367, column: 10, scope: !1629)
!1631 = !DILocation(line: 367, column: 17, scope: !1632)
!1632 = !DILexicalBlockFile(scope: !1633, file: !723, discriminator: 1)
!1633 = distinct !DILexicalBlock(scope: !1629, file: !723, line: 367, column: 5)
!1634 = !DILocation(line: 367, column: 21, scope: !1632)
!1635 = !DILocation(line: 367, column: 26, scope: !1632)
!1636 = !DILocation(line: 367, column: 19, scope: !1632)
!1637 = !DILocation(line: 367, column: 5, scope: !1632)
!1638 = !DILocation(line: 368, column: 32, scope: !1633)
!1639 = !DILocation(line: 368, column: 22, scope: !1633)
!1640 = !DILocation(line: 368, column: 27, scope: !1633)
!1641 = !DILocation(line: 368, column: 9, scope: !1633)
!1642 = !DILocation(line: 367, column: 35, scope: !1643)
!1643 = !DILexicalBlockFile(scope: !1633, file: !723, discriminator: 2)
!1644 = !DILocation(line: 367, column: 5, scope: !1643)
!1645 = distinct !{!1645, !1646}
!1646 = !DILocation(line: 367, column: 5, scope: !1619)
!1647 = !DILocation(line: 369, column: 15, scope: !1619)
!1648 = !DILocation(line: 369, column: 20, scope: !1619)
!1649 = !DILocation(line: 369, column: 14, scope: !1619)
!1650 = !DILocation(line: 369, column: 5, scope: !1619)
!1651 = !DILocation(line: 370, column: 15, scope: !1619)
!1652 = !DILocation(line: 370, column: 20, scope: !1619)
!1653 = !DILocation(line: 370, column: 14, scope: !1619)
!1654 = !DILocation(line: 370, column: 5, scope: !1619)
!1655 = !DILocation(line: 371, column: 1, scope: !1619)
!1656 = distinct !DISubprogram(name: "bsf_list_flush", scope: !723, file: !723, line: 353, type: !837, isLocal: true, isDefinition: true, scopeLine: 354, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !844)
!1657 = !DILocalVariable(name: "bsf", arg: 1, scope: !1656, file: !723, line: 353, type: !738)
!1658 = !DILocation(line: 353, column: 42, scope: !1656)
!1659 = !DILocalVariable(name: "lst", scope: !1656, file: !723, line: 355, type: !1384)
!1660 = !DILocation(line: 355, column: 21, scope: !1656)
!1661 = !DILocation(line: 355, column: 27, scope: !1656)
!1662 = !DILocation(line: 355, column: 32, scope: !1656)
!1663 = !DILocalVariable(name: "i", scope: !1664, file: !723, line: 357, type: !656)
!1664 = distinct !DILexicalBlock(scope: !1656, file: !723, line: 357, column: 5)
!1665 = !DILocation(line: 357, column: 14, scope: !1664)
!1666 = !DILocation(line: 357, column: 10, scope: !1664)
!1667 = !DILocation(line: 357, column: 21, scope: !1668)
!1668 = !DILexicalBlockFile(scope: !1669, file: !723, discriminator: 1)
!1669 = distinct !DILexicalBlock(scope: !1664, file: !723, line: 357, column: 5)
!1670 = !DILocation(line: 357, column: 25, scope: !1668)
!1671 = !DILocation(line: 357, column: 30, scope: !1668)
!1672 = !DILocation(line: 357, column: 23, scope: !1668)
!1673 = !DILocation(line: 357, column: 5, scope: !1668)
!1674 = !DILocation(line: 358, column: 32, scope: !1669)
!1675 = !DILocation(line: 358, column: 22, scope: !1669)
!1676 = !DILocation(line: 358, column: 27, scope: !1669)
!1677 = !DILocation(line: 358, column: 9, scope: !1669)
!1678 = !DILocation(line: 357, column: 40, scope: !1679)
!1679 = !DILexicalBlockFile(scope: !1669, file: !723, discriminator: 2)
!1680 = !DILocation(line: 357, column: 5, scope: !1679)
!1681 = distinct !{!1681, !1682}
!1682 = !DILocation(line: 357, column: 5, scope: !1656)
!1683 = !DILocation(line: 359, column: 16, scope: !1656)
!1684 = !DILocation(line: 359, column: 21, scope: !1656)
!1685 = !DILocation(line: 359, column: 33, scope: !1656)
!1686 = !DILocation(line: 359, column: 5, scope: !1656)
!1687 = !DILocation(line: 359, column: 10, scope: !1656)
!1688 = !DILocation(line: 359, column: 14, scope: !1656)
!1689 = !DILocation(line: 360, column: 1, scope: !1656)
!1690 = distinct !DISubprogram(name: "av_bsf_list_alloc", scope: !723, file: !723, line: 419, type: !1691, isLocal: false, isDefinition: true, scopeLine: 420, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !844)
!1691 = !DISubroutineType(types: !1692)
!1692 = !{!1693}
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64, align: 64)
!1694 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFList", file: !47, line: 5979, baseType: !1695)
!1695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFList", file: !723, line: 414, size: 128, align: 64, elements: !1696)
!1696 = !{!1697, !1698}
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1695, file: !723, line: 415, baseType: !851, size: 64, align: 64)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1695, file: !723, line: 416, baseType: !656, size: 32, align: 32, offset: 64)
!1699 = !DILocation(line: 421, column: 12, scope: !1690)
!1700 = !DILocation(line: 421, column: 5, scope: !1690)
!1701 = distinct !DISubprogram(name: "av_bsf_list_free", scope: !723, file: !723, line: 424, type: !1702, isLocal: false, isDefinition: true, scopeLine: 425, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !844)
!1702 = !DISubroutineType(types: !1703)
!1703 = !{null, !1704}
!1704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1705 = !DILocalVariable(name: "lst", arg: 1, scope: !1701, file: !723, line: 424, type: !1704)
!1706 = !DILocation(line: 424, column: 35, scope: !1701)
!1707 = !DILocalVariable(name: "i", scope: !1701, file: !723, line: 426, type: !656)
!1708 = !DILocation(line: 426, column: 9, scope: !1701)
!1709 = !DILocation(line: 428, column: 11, scope: !1710)
!1710 = distinct !DILexicalBlock(scope: !1701, file: !723, line: 428, column: 9)
!1711 = !DILocation(line: 428, column: 10, scope: !1710)
!1712 = !DILocation(line: 428, column: 9, scope: !1701)
!1713 = !DILocation(line: 429, column: 9, scope: !1710)
!1714 = !DILocation(line: 431, column: 12, scope: !1715)
!1715 = distinct !DILexicalBlock(scope: !1701, file: !723, line: 431, column: 5)
!1716 = !DILocation(line: 431, column: 10, scope: !1715)
!1717 = !DILocation(line: 431, column: 17, scope: !1718)
!1718 = !DILexicalBlockFile(scope: !1719, file: !723, discriminator: 1)
!1719 = distinct !DILexicalBlock(scope: !1715, file: !723, line: 431, column: 5)
!1720 = !DILocation(line: 431, column: 23, scope: !1718)
!1721 = !DILocation(line: 431, column: 22, scope: !1718)
!1722 = !DILocation(line: 431, column: 29, scope: !1718)
!1723 = !DILocation(line: 431, column: 19, scope: !1718)
!1724 = !DILocation(line: 431, column: 5, scope: !1718)
!1725 = !DILocation(line: 432, column: 35, scope: !1719)
!1726 = !DILocation(line: 432, column: 22, scope: !1719)
!1727 = !DILocation(line: 432, column: 24, scope: !1719)
!1728 = !DILocation(line: 432, column: 23, scope: !1719)
!1729 = !DILocation(line: 432, column: 30, scope: !1719)
!1730 = !DILocation(line: 432, column: 9, scope: !1719)
!1731 = !DILocation(line: 431, column: 38, scope: !1732)
!1732 = !DILexicalBlockFile(scope: !1719, file: !723, discriminator: 2)
!1733 = !DILocation(line: 431, column: 5, scope: !1732)
!1734 = distinct !{!1734, !1735}
!1735 = !DILocation(line: 431, column: 5, scope: !1701)
!1736 = !DILocation(line: 433, column: 15, scope: !1701)
!1737 = !DILocation(line: 433, column: 14, scope: !1701)
!1738 = !DILocation(line: 433, column: 21, scope: !1701)
!1739 = !DILocation(line: 433, column: 13, scope: !1701)
!1740 = !DILocation(line: 433, column: 5, scope: !1701)
!1741 = !DILocation(line: 434, column: 14, scope: !1701)
!1742 = !DILocation(line: 434, column: 5, scope: !1701)
!1743 = !DILocation(line: 435, column: 1, scope: !1701)
!1744 = !DILocation(line: 435, column: 1, scope: !1745)
!1745 = !DILexicalBlockFile(scope: !1701, file: !723, discriminator: 1)
!1746 = distinct !DISubprogram(name: "av_bsf_list_append", scope: !723, file: !723, line: 437, type: !1747, isLocal: false, isDefinition: true, scopeLine: 438, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !844)
!1747 = !DISubroutineType(types: !1748)
!1748 = !{!656, !1693, !738}
!1749 = !DILocalVariable(name: "lst", arg: 1, scope: !1746, file: !723, line: 437, type: !1693)
!1750 = !DILocation(line: 437, column: 35, scope: !1746)
!1751 = !DILocalVariable(name: "bsf", arg: 2, scope: !1746, file: !723, line: 437, type: !738)
!1752 = !DILocation(line: 437, column: 54, scope: !1746)
!1753 = !DILocation(line: 439, column: 36, scope: !1746)
!1754 = !DILocation(line: 439, column: 41, scope: !1746)
!1755 = !DILocation(line: 439, column: 35, scope: !1746)
!1756 = !DILocation(line: 439, column: 48, scope: !1746)
!1757 = !DILocation(line: 439, column: 53, scope: !1746)
!1758 = !DILocation(line: 439, column: 62, scope: !1746)
!1759 = !DILocation(line: 439, column: 12, scope: !1746)
!1760 = !DILocation(line: 439, column: 5, scope: !1746)
!1761 = distinct !DISubprogram(name: "av_bsf_list_append2", scope: !723, file: !723, line: 442, type: !1762, isLocal: false, isDefinition: true, scopeLine: 443, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !844)
!1762 = !DISubroutineType(types: !1763)
!1763 = !{!656, !1693, !640, !1764}
!1764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1765, size: 64, align: 64)
!1765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1766, size: 64, align: 64)
!1766 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1767, line: 86, baseType: !1768)
!1767 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1768 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1767, line: 86, flags: DIFlagFwdDecl)
!1769 = !DILocalVariable(name: "lst", arg: 1, scope: !1761, file: !723, line: 442, type: !1693)
!1770 = !DILocation(line: 442, column: 36, scope: !1761)
!1771 = !DILocalVariable(name: "bsf_name", arg: 2, scope: !1761, file: !723, line: 442, type: !640)
!1772 = !DILocation(line: 442, column: 53, scope: !1761)
!1773 = !DILocalVariable(name: "options", arg: 3, scope: !1761, file: !723, line: 442, type: !1764)
!1774 = !DILocation(line: 442, column: 79, scope: !1761)
!1775 = !DILocalVariable(name: "ret", scope: !1761, file: !723, line: 444, type: !656)
!1776 = !DILocation(line: 444, column: 9, scope: !1761)
!1777 = !DILocalVariable(name: "filter", scope: !1761, file: !723, line: 445, type: !921)
!1778 = !DILocation(line: 445, column: 30, scope: !1761)
!1779 = !DILocalVariable(name: "bsf", scope: !1761, file: !723, line: 446, type: !738)
!1780 = !DILocation(line: 446, column: 19, scope: !1761)
!1781 = !DILocation(line: 448, column: 33, scope: !1761)
!1782 = !DILocation(line: 448, column: 14, scope: !1761)
!1783 = !DILocation(line: 448, column: 12, scope: !1761)
!1784 = !DILocation(line: 449, column: 10, scope: !1785)
!1785 = distinct !DILexicalBlock(scope: !1761, file: !723, line: 449, column: 9)
!1786 = !DILocation(line: 449, column: 9, scope: !1761)
!1787 = !DILocation(line: 450, column: 9, scope: !1785)
!1788 = !DILocation(line: 452, column: 24, scope: !1761)
!1789 = !DILocation(line: 452, column: 11, scope: !1761)
!1790 = !DILocation(line: 452, column: 9, scope: !1761)
!1791 = !DILocation(line: 453, column: 9, scope: !1792)
!1792 = distinct !DILexicalBlock(scope: !1761, file: !723, line: 453, column: 9)
!1793 = !DILocation(line: 453, column: 13, scope: !1792)
!1794 = !DILocation(line: 453, column: 9, scope: !1761)
!1795 = !DILocation(line: 454, column: 16, scope: !1792)
!1796 = !DILocation(line: 454, column: 9, scope: !1792)
!1797 = !DILocation(line: 456, column: 9, scope: !1798)
!1798 = distinct !DILexicalBlock(scope: !1761, file: !723, line: 456, column: 9)
!1799 = !DILocation(line: 456, column: 9, scope: !1761)
!1800 = !DILocation(line: 457, column: 32, scope: !1801)
!1801 = distinct !DILexicalBlock(scope: !1798, file: !723, line: 456, column: 18)
!1802 = !DILocation(line: 457, column: 37, scope: !1801)
!1803 = !DILocation(line: 457, column: 15, scope: !1801)
!1804 = !DILocation(line: 457, column: 13, scope: !1801)
!1805 = !DILocation(line: 458, column: 13, scope: !1806)
!1806 = distinct !DILexicalBlock(scope: !1801, file: !723, line: 458, column: 13)
!1807 = !DILocation(line: 458, column: 17, scope: !1806)
!1808 = !DILocation(line: 458, column: 13, scope: !1801)
!1809 = !DILocation(line: 459, column: 13, scope: !1806)
!1810 = !DILocation(line: 460, column: 5, scope: !1801)
!1811 = !DILocation(line: 462, column: 30, scope: !1761)
!1812 = !DILocation(line: 462, column: 35, scope: !1761)
!1813 = !DILocation(line: 462, column: 11, scope: !1761)
!1814 = !DILocation(line: 462, column: 9, scope: !1761)
!1815 = !DILocation(line: 462, column: 5, scope: !1761)
!1816 = !DILocation(line: 465, column: 9, scope: !1817)
!1817 = distinct !DILexicalBlock(scope: !1761, file: !723, line: 465, column: 9)
!1818 = !DILocation(line: 465, column: 13, scope: !1817)
!1819 = !DILocation(line: 465, column: 9, scope: !1761)
!1820 = !DILocation(line: 466, column: 9, scope: !1817)
!1821 = !DILocation(line: 468, column: 12, scope: !1761)
!1822 = !DILocation(line: 468, column: 5, scope: !1761)
!1823 = !DILocation(line: 469, column: 1, scope: !1761)
!1824 = distinct !DISubprogram(name: "av_bsf_list_finalize", scope: !723, file: !723, line: 471, type: !1825, isLocal: false, isDefinition: true, scopeLine: 472, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !844)
!1825 = !DISubroutineType(types: !1826)
!1826 = !{!656, !1704, !851}
!1827 = !DILocalVariable(name: "lst", arg: 1, scope: !1824, file: !723, line: 471, type: !1704)
!1828 = !DILocation(line: 471, column: 38, scope: !1824)
!1829 = !DILocalVariable(name: "bsf", arg: 2, scope: !1824, file: !723, line: 471, type: !851)
!1830 = !DILocation(line: 471, column: 58, scope: !1824)
!1831 = !DILocalVariable(name: "ret", scope: !1824, file: !723, line: 473, type: !656)
!1832 = !DILocation(line: 473, column: 9, scope: !1824)
!1833 = !DILocalVariable(name: "ctx", scope: !1824, file: !723, line: 474, type: !1384)
!1834 = !DILocation(line: 474, column: 21, scope: !1824)
!1835 = !DILocation(line: 476, column: 11, scope: !1836)
!1836 = distinct !DILexicalBlock(scope: !1824, file: !723, line: 476, column: 9)
!1837 = !DILocation(line: 476, column: 10, scope: !1836)
!1838 = !DILocation(line: 476, column: 17, scope: !1836)
!1839 = !DILocation(line: 476, column: 25, scope: !1836)
!1840 = !DILocation(line: 476, column: 9, scope: !1824)
!1841 = !DILocation(line: 477, column: 18, scope: !1842)
!1842 = distinct !DILexicalBlock(scope: !1836, file: !723, line: 476, column: 31)
!1843 = !DILocation(line: 477, column: 17, scope: !1842)
!1844 = !DILocation(line: 477, column: 24, scope: !1842)
!1845 = !DILocation(line: 477, column: 16, scope: !1842)
!1846 = !DILocation(line: 477, column: 10, scope: !1842)
!1847 = !DILocation(line: 477, column: 14, scope: !1842)
!1848 = !DILocation(line: 478, column: 21, scope: !1842)
!1849 = !DILocation(line: 478, column: 20, scope: !1842)
!1850 = !DILocation(line: 478, column: 27, scope: !1842)
!1851 = !DILocation(line: 478, column: 18, scope: !1842)
!1852 = !DILocation(line: 478, column: 9, scope: !1842)
!1853 = !DILocation(line: 479, column: 11, scope: !1842)
!1854 = !DILocation(line: 479, column: 10, scope: !1842)
!1855 = !DILocation(line: 479, column: 17, scope: !1842)
!1856 = !DILocation(line: 479, column: 25, scope: !1842)
!1857 = !DILocation(line: 480, column: 9, scope: !1842)
!1858 = !DILocation(line: 483, column: 38, scope: !1824)
!1859 = !DILocation(line: 483, column: 11, scope: !1824)
!1860 = !DILocation(line: 483, column: 9, scope: !1824)
!1861 = !DILocation(line: 484, column: 9, scope: !1862)
!1862 = distinct !DILexicalBlock(scope: !1824, file: !723, line: 484, column: 9)
!1863 = !DILocation(line: 484, column: 13, scope: !1862)
!1864 = !DILocation(line: 484, column: 9, scope: !1824)
!1865 = !DILocation(line: 485, column: 16, scope: !1862)
!1866 = !DILocation(line: 485, column: 9, scope: !1862)
!1867 = !DILocation(line: 487, column: 13, scope: !1824)
!1868 = !DILocation(line: 487, column: 12, scope: !1824)
!1869 = !DILocation(line: 487, column: 19, scope: !1824)
!1870 = !DILocation(line: 487, column: 11, scope: !1824)
!1871 = !DILocation(line: 487, column: 9, scope: !1824)
!1872 = !DILocation(line: 489, column: 19, scope: !1824)
!1873 = !DILocation(line: 489, column: 18, scope: !1824)
!1874 = !DILocation(line: 489, column: 25, scope: !1824)
!1875 = !DILocation(line: 489, column: 5, scope: !1824)
!1876 = !DILocation(line: 489, column: 10, scope: !1824)
!1877 = !DILocation(line: 489, column: 15, scope: !1824)
!1878 = !DILocation(line: 490, column: 22, scope: !1824)
!1879 = !DILocation(line: 490, column: 21, scope: !1824)
!1880 = !DILocation(line: 490, column: 28, scope: !1824)
!1881 = !DILocation(line: 490, column: 5, scope: !1824)
!1882 = !DILocation(line: 490, column: 10, scope: !1824)
!1883 = !DILocation(line: 490, column: 18, scope: !1824)
!1884 = !DILocation(line: 493, column: 14, scope: !1824)
!1885 = !DILocation(line: 493, column: 5, scope: !1824)
!1886 = !DILocation(line: 494, column: 12, scope: !1824)
!1887 = !DILocation(line: 494, column: 5, scope: !1824)
!1888 = !DILocation(line: 495, column: 1, scope: !1824)
!1889 = distinct !DISubprogram(name: "av_bsf_list_parse_str", scope: !723, file: !723, line: 526, type: !1890, isLocal: false, isDefinition: true, scopeLine: 527, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !844)
!1890 = !DISubroutineType(types: !1891)
!1891 = !{!656, !640, !851}
!1892 = !DILocalVariable(name: "str", arg: 1, scope: !1889, file: !723, line: 526, type: !640)
!1893 = !DILocation(line: 526, column: 39, scope: !1889)
!1894 = !DILocalVariable(name: "bsf_lst", arg: 2, scope: !1889, file: !723, line: 526, type: !851)
!1895 = !DILocation(line: 526, column: 59, scope: !1889)
!1896 = !DILocalVariable(name: "lst", scope: !1889, file: !723, line: 528, type: !1693)
!1897 = !DILocation(line: 528, column: 16, scope: !1889)
!1898 = !DILocalVariable(name: "bsf_str", scope: !1889, file: !723, line: 529, type: !1394)
