; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--aacenc_tns.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--aacenc_tns.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AACEncContext = type { %struct.AVClass*, %struct.AACEncOptions, %struct.PutBitContext, %struct.FFTContext, %struct.FFTContext, %struct.AVFloatDSPContext*, %struct.AACPCEInfo, [16 x float*], i32, i32, [8 x i8], %struct.LPCContext, i32, i32, i8*, i8*, %struct.ChannelElement*, %struct.FFPsyContext, %struct.FFPsyPreprocessContext*, %struct.AACCoefficientsEncoder*, i32, i32, float, i32, float, i32, i32, %struct.AudioFrameQueue, [96 x i32], [1024 x float], i16, [256 x [128 x %struct.AACQuantizeBandCostCacheEntry]], void (float*, float*, i32)*, void (i32*, float*, float*, i32, i32, i32, float, float)*, %struct.anon.0 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AACEncOptions = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.PutBitContext = type { i32, i32, i8*, i8*, i8*, i32 }

!952 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!954 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "LPC_TYPE_U", file: !35, line: 127, baseType: !954)
!956 = !{!957, !967, !971, !972, !982, !986, !988, !990}
!957 = distinct !DIGlobalVariable(name: "tns_min_sfb", scope: !0, file: !958, line: 112, type: !959, isLocal: true, isDefinition: true, variable: [2 x i8*]* @tns_min_sfb)
!958 = !DIFile(filename: "libavcodec/aacenctab.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 128, align: 64, elements: !965)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !951, line: 48, baseType: !964)
!964 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!965 = !{!966}
!966 = !DISubrange(count: 2)
!967 = distinct !DIGlobalVariable(name: "tns_min_sfb_long", scope: !0, file: !958, line: 108, type: !968, isLocal: true, isDefinition: true, variable: [16 x i8]* @tns_min_sfb_long)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 128, align: 8, elements: !969)
!969 = !{!970}
!970 = !DISubrange(count: 16)
!971 = distinct !DIGlobalVariable(name: "tns_min_sfb_short", scope: !0, file: !958, line: 104, type: !968, isLocal: true, isDefinition: true, variable: [16 x i8]* @tns_min_sfb_short)
!972 = distinct !DIGlobalVariable(name: "tns_tmp2_map", scope: !0, file: !973, line: 126, type: !974, isLocal: true, isDefinition: true, variable: [4 x float*]* @tns_tmp2_map)
!973 = !DIFile(filename: "libavcodec/aactab.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 256, align: 64, elements: !980)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTFLOAT", file: !979, line: 86, baseType: !954)
!979 = !DIFile(filename: "libavcodec/aac_defines.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!980 = !{!981}
!981 = !DISubrange(count: 4)
!982 = distinct !DIGlobalVariable(name: "tns_tmp2_map_0_3", scope: !0, file: !973, line: 109, type: !983, isLocal: true, isDefinition: true, variable: [8 x float]* @tns_tmp2_map_0_3)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 256, align: 32, elements: !984)
!984 = !{!985}
!985 = !DISubrange(count: 8)
!986 = distinct !DIGlobalVariable(name: "tns_tmp2_map_0_4", scope: !0, file: !973, line: 119, type: !987, isLocal: true, isDefinition: true, variable: [16 x float]* @tns_tmp2_map_0_4)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 512, align: 32, elements: !969)
!988 = distinct !DIGlobalVariable(name: "tns_tmp2_map_1_3", scope: !0, file: !973, line: 105, type: !989, isLocal: true, isDefinition: true, variable: [4 x float]* @tns_tmp2_map_1_3)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 128, align: 32, elements: !980)
!990 = distinct !DIGlobalVariable(name: "tns_tmp2_map_1_4", scope: !0, file: !973, line: 114, type: !983, isLocal: true, isDefinition: true, variable: [8 x float]* @tns_tmp2_map_1_4)
!991 = !{i32 2, !"Dwarf Version", i32 4}
!992 = !{i32 2, !"Debug Info Version", i32 3}
!993 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!994 = distinct !DISubprogram(name: "ff_aac_encode_tns_info", scope: !995, file: !995, line: 70, type: !996, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2752)
!995 = !DIFile(filename: "libavcodec/aacenc_tns.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!996 = !DISubroutineType(types: !997)
!997 = !{null, !998, !2474}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACEncContext", file: !1000, line: 421, baseType: !1001)
!1000 = !DIFile(filename: "libavcodec/aacenc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACEncContext", file: !1000, line: 376, size: 4539904, align: 256, elements: !1002)
!1002 = !{!1003, !1047, !1059, !1071, !1119, !1120, !1166, !1185, !1187, !1188, !1189, !1236, !1237, !1238, !1239, !1240, !2558, !2638, !2641, !2696, !2697, !2698, !2699, !2700, !2701, !2702, !2703, !2720, !2724, !2726, !2727, !2740, !2744, !2748}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1001, file: !1000, line: 377, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1007)
!1007 = !{!1008, !1012, !1016, !1020, !1022, !1023, !1024, !1028, !1034, !1036, !1040}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1006, file: !4, line: 72, baseType: !1009, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1011)
!1011 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1006, file: !4, line: 78, baseType: !1013, size: 64, align: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!1009, !953}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1006, file: !4, line: 85, baseType: !1017, size: 64, align: 64, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1019 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1006, file: !4, line: 93, baseType: !1021, size: 32, align: 32, offset: 192)
!1021 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1006, file: !4, line: 99, baseType: !1021, size: 32, align: 32, offset: 224)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1006, file: !4, line: 108, baseType: !1021, size: 32, align: 32, offset: 256)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1006, file: !4, line: 113, baseType: !1025, size: 64, align: 64, offset: 320)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!953, !953, !953}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1006, file: !4, line: 123, baseType: !1029, size: 64, align: 64, offset: 384)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!1032, !1032}
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1006, file: !4, line: 130, baseType: !1035, size: 32, align: 32, offset: 448)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1006, file: !4, line: 136, baseType: !1037, size: 64, align: 64, offset: 512)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!1035, !953}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1006, file: !4, line: 142, baseType: !1041, size: 64, align: 64, offset: 576)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!1021, !1044, !953, !1009, !1021}
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1001, file: !1000, line: 378, baseType: !1048, size: 256, align: 32, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACEncOptions", file: !1000, line: 52, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACEncOptions", file: !1000, line: 43, size: 256, align: 32, elements: !1050)
!1050 = !{!1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !1049, file: !1000, line: 44, baseType: !1021, size: 32, align: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "pns", scope: !1049, file: !1000, line: 45, baseType: !1021, size: 32, align: 32, offset: 32)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "tns", scope: !1049, file: !1000, line: 46, baseType: !1021, size: 32, align: 32, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "ltp", scope: !1049, file: !1000, line: 47, baseType: !1021, size: 32, align: 32, offset: 96)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "pce", scope: !1049, file: !1000, line: 48, baseType: !1021, size: 32, align: 32, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !1049, file: !1000, line: 49, baseType: !1021, size: 32, align: 32, offset: 160)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "mid_side", scope: !1049, file: !1000, line: 50, baseType: !1021, size: 32, align: 32, offset: 192)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "intensity_stereo", scope: !1049, file: !1000, line: 51, baseType: !1021, size: 32, align: 32, offset: 224)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1001, file: !1000, line: 379, baseType: !1060, size: 320, align: 64, offset: 320)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "PutBitContext", file: !1061, line: 40, baseType: !1062)
!1061 = !DIFile(filename: "libavcodec/put_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PutBitContext", file: !1061, line: 35, size: 320, align: 64, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1068, !1069, !1070}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "bit_buf", scope: !1062, file: !1061, line: 36, baseType: !950, size: 32, align: 32)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "bit_left", scope: !1062, file: !1061, line: 37, baseType: !1021, size: 32, align: 32, offset: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1062, file: !1061, line: 38, baseType: !1067, size: 64, align: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1062, file: !1061, line: 38, baseType: !1067, size: 64, align: 64, offset: 128)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1062, file: !1061, line: 38, baseType: !1067, size: 64, align: 64, offset: 192)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1062, file: !1061, line: 39, baseType: !1021, size: 32, align: 32, offset: 256)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "mdct1024", scope: !1001, file: !1000, line: 380, baseType: !1072, size: 896, align: 64, offset: 640)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !1073, line: 41, baseType: !1074)
!1073 = !DIFile(filename: "libavcodec/avfft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !25, line: 88, size: 896, align: 64, elements: !1075)
!1075 = !{!1076, !1077, !1078, !1082, !1090, !1091, !1092, !1094, !1095, !1100, !1101, !1107, !1108, !1109, !1115, !1116, !1117}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !1074, file: !25, line: 89, baseType: !1021, size: 32, align: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !1074, file: !25, line: 90, baseType: !1021, size: 32, align: 32, offset: 32)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "revtab", scope: !1074, file: !25, line: 91, baseType: !1079, size: 64, align: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !951, line: 49, baseType: !1081)
!1081 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !1074, file: !25, line: 92, baseType: !1083, size: 64, align: 64, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !1073, line: 39, baseType: !1085)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !1073, line: 37, size: 64, align: 32, elements: !1086)
!1086 = !{!1087, !1089}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !1085, file: !1073, line: 38, baseType: !1088, size: 32, align: 32)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !1073, line: 35, baseType: !954)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !1085, file: !1073, line: 38, baseType: !1088, size: 32, align: 32, offset: 32)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_size", scope: !1074, file: !25, line: 93, baseType: !1021, size: 32, align: 32, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_bits", scope: !1074, file: !25, line: 94, baseType: !1021, size: 32, align: 32, offset: 224)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !1074, file: !25, line: 96, baseType: !1093, size: 64, align: 64, offset: 256)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !1074, file: !25, line: 97, baseType: !1093, size: 64, align: 64, offset: 320)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permute", scope: !1074, file: !25, line: 101, baseType: !1096, size: 64, align: 64, offset: 384)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{null, !1099, !1083}
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "fft_calc", scope: !1074, file: !25, line: 106, baseType: !1096, size: 64, align: 64, offset: 448)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_calc", scope: !1074, file: !25, line: 107, baseType: !1102, size: 64, align: 64, offset: 512)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{null, !1099, !1093, !1105}
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1088)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !1074, file: !25, line: 108, baseType: !1102, size: 64, align: 64, offset: 576)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calc", scope: !1074, file: !25, line: 109, baseType: !1102, size: 64, align: 64, offset: 640)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calcw", scope: !1074, file: !25, line: 110, baseType: !1110, size: 64, align: 64, offset: 704)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{null, !1099, !1113, !1105}
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTDouble", file: !25, line: 43, baseType: !954)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permutation", scope: !1074, file: !25, line: 111, baseType: !24, size: 32, align: 32, offset: 768)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_permutation", scope: !1074, file: !25, line: 112, baseType: !30, size: 32, align: 32, offset: 800)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "revtab32", scope: !1074, file: !25, line: 113, baseType: !1118, size: 64, align: 64, offset: 832)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "mdct128", scope: !1001, file: !1000, line: 381, baseType: !1072, size: 896, align: 64, offset: 1536)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "fdsp", scope: !1001, file: !1000, line: 382, baseType: !1121, size: 64, align: 64, offset: 2432)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFloatDSPContext", file: !1123, line: 192, baseType: !1124)
!1123 = !DIFile(filename: "./libavutil/float_dsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFloatDSPContext", file: !1123, line: 24, size: 704, align: 64, elements: !1125)
!1125 = !{!1126, !1133, !1137, !1145, !1146, !1147, !1151, !1152, !1153, !1158, !1162}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul", scope: !1124, file: !1123, line: 38, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{null, !1130, !1131, !1131, !1021}
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmac_scalar", scope: !1124, file: !1123, line: 54, baseType: !1134, size: 64, align: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{null, !1130, !1131, !954, !1021}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmac_scalar", scope: !1124, file: !1123, line: 70, baseType: !1138, size: 64, align: 64, offset: 128)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{null, !1141, !1143, !1142, !1021}
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1142)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_scalar", scope: !1124, file: !1123, line: 85, baseType: !1134, size: 64, align: 64, offset: 192)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmul_scalar", scope: !1124, file: !1123, line: 100, baseType: !1138, size: 64, align: 64, offset: 256)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_window", scope: !1124, file: !1123, line: 119, baseType: !1148, size: 64, align: 64, offset: 320)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{null, !1130, !1131, !1131, !1131, !1021}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_add", scope: !1124, file: !1123, line: 137, baseType: !1148, size: 64, align: 64, offset: 384)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_reverse", scope: !1124, file: !1123, line: 154, baseType: !1127, size: 64, align: 64, offset: 448)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "butterflies_float", scope: !1124, file: !1123, line: 164, baseType: !1154, size: 64, align: 64, offset: 512)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{null, !1157, !1157, !1021}
!1157 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1130)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "scalarproduct_float", scope: !1124, file: !1123, line: 175, baseType: !1159, size: 64, align: 64, offset: 576)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!954, !1131, !1131, !1021}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmul", scope: !1124, file: !1123, line: 190, baseType: !1163, size: 64, align: 64, offset: 640)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{null, !1141, !1143, !1143, !1021}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "pce", scope: !1001, file: !1000, line: 383, baseType: !1167, size: 2240, align: 64, offset: 2496)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACPCEInfo", file: !1000, line: 100, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACPCEInfo", file: !1000, line: 93, size: 2240, align: 64, elements: !1169)
!1169 = !{!1170, !1173, !1175, !1179, !1182, !1184}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !1168, file: !1000, line: 94, baseType: !1171, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !951, line: 40, baseType: !1172)
!1172 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "num_ele", scope: !1168, file: !1000, line: 95, baseType: !1174, size: 128, align: 32, offset: 64)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 128, align: 32, elements: !980)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pairing", scope: !1168, file: !1000, line: 96, baseType: !1176, size: 768, align: 32, offset: 192)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 768, align: 32, elements: !1177)
!1177 = !{!1178, !985}
!1178 = !DISubrange(count: 3)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1168, file: !1000, line: 97, baseType: !1180, size: 1024, align: 32, offset: 960)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 1024, align: 32, elements: !1181)
!1181 = !{!981, !985}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "config_map", scope: !1168, file: !1000, line: 98, baseType: !1183, size: 128, align: 8, offset: 1984)
!1183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 128, align: 8, elements: !969)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "reorder_map", scope: !1168, file: !1000, line: 99, baseType: !1183, size: 128, align: 8, offset: 2112)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "planar_samples", scope: !1001, file: !1000, line: 384, baseType: !1186, size: 1024, align: 64, offset: 4736)
!1186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1130, size: 1024, align: 64, elements: !969)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1001, file: !1000, line: 386, baseType: !1021, size: 32, align: 32, offset: 5760)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "needs_pce", scope: !1001, file: !1000, line: 387, baseType: !1021, size: 32, align: 32, offset: 5792)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "lpc", scope: !1001, file: !1000, line: 388, baseType: !1190, size: 302080, align: 256, offset: 5888)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "LPCContext", file: !35, line: 87, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LPCContext", file: !35, line: 52, size: 302080, align: 256, elements: !1192)
!1192 = !{!1193, !1194, !1195, !1196, !1197, !1198, !1205, !1209}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "blocksize", scope: !1191, file: !35, line: 53, baseType: !1021, size: 32, align: 32)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "max_order", scope: !1191, file: !35, line: 54, baseType: !1021, size: 32, align: 32, offset: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "lpc_type", scope: !1191, file: !35, line: 55, baseType: !34, size: 32, align: 32, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "windowed_buffer", scope: !1191, file: !35, line: 56, baseType: !1141, size: 64, align: 64, offset: 128)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "windowed_samples", scope: !1191, file: !35, line: 57, baseType: !1141, size: 64, align: 64, offset: 192)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "lpc_apply_welch_window", scope: !1191, file: !35, line: 67, baseType: !1199, size: 64, align: 64, offset: 256)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{null, !1202, !1021, !1141}
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1204)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !951, line: 38, baseType: !1021)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "lpc_compute_autocorr", scope: !1191, file: !35, line: 82, baseType: !1206, size: 64, align: 64, offset: 320)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{null, !1143, !1021, !1021, !1141}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "lls_models", scope: !1191, file: !35, line: 86, baseType: !1210, size: 301568, align: 256, offset: 512)
!1210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1211, size: 301568, align: 256, elements: !965)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLSModel", file: !1212, line: 58, baseType: !1213)
!1212 = !DIFile(filename: "./libavutil/lls.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LLSModel", file: !1212, line: 38, size: 150784, align: 256, elements: !1214)
!1214 = !{!1215, !1219, !1223, !1226, !1227, !1232}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "covariance", scope: !1213, file: !1212, line: 39, baseType: !1216, size: 82944, align: 64)
!1216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1142, size: 82944, align: 64, elements: !1217)
!1217 = !{!1218, !1218}
!1218 = !DISubrange(count: 36)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "coeff", scope: !1213, file: !1212, line: 40, baseType: !1220, size: 65536, align: 64, offset: 82944)
!1220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1142, size: 65536, align: 64, elements: !1221)
!1221 = !{!1222, !1222}
!1222 = !DISubrange(count: 32)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "variance", scope: !1213, file: !1212, line: 41, baseType: !1224, size: 2048, align: 64, offset: 148480)
!1224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1142, size: 2048, align: 64, elements: !1225)
!1225 = !{!1222}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "indep_count", scope: !1213, file: !1212, line: 42, baseType: !1021, size: 32, align: 32, offset: 150528)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "update_lls", scope: !1213, file: !1212, line: 50, baseType: !1228, size: 64, align: 64, offset: 150592)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{null, !1231, !1143}
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "evaluate_lls", scope: !1213, file: !1212, line: 57, baseType: !1233, size: 64, align: 64, offset: 150656)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!1142, !1231, !1143, !1021}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "samplerate_index", scope: !1001, file: !1000, line: 389, baseType: !1021, size: 32, align: 32, offset: 307968)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1001, file: !1000, line: 390, baseType: !1021, size: 32, align: 32, offset: 308000)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "reorder_map", scope: !1001, file: !1000, line: 391, baseType: !961, size: 64, align: 64, offset: 308032)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "chan_map", scope: !1001, file: !1000, line: 392, baseType: !961, size: 64, align: 64, offset: 308096)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "cpe", scope: !1001, file: !1000, line: 394, baseType: !1241, size: 64, align: 64, offset: 308160)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelElement", file: !44, line: 288, baseType: !1243)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelElement", file: !44, line: 275, size: 4381952, align: 256, elements: !1244)
!1244 = !{!1245, !1246, !1247, !1248, !1249, !1253, !1254, !1387, !1400}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !1243, file: !44, line: 276, baseType: !1021, size: 32, align: 32)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "common_window", scope: !1243, file: !44, line: 278, baseType: !1021, size: 32, align: 32, offset: 32)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "ms_mode", scope: !1243, file: !44, line: 279, baseType: !1021, size: 32, align: 32, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "is_mode", scope: !1243, file: !44, line: 280, baseType: !963, size: 8, align: 8, offset: 96)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "ms_mask", scope: !1243, file: !44, line: 281, baseType: !1250, size: 1024, align: 8, offset: 104)
!1250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 1024, align: 8, elements: !1251)
!1251 = !{!1252}
!1252 = !DISubrange(count: 128)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "is_mask", scope: !1243, file: !44, line: 282, baseType: !1250, size: 1024, align: 8, offset: 1128)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !1243, file: !44, line: 284, baseType: !1255, size: 1187328, align: 256, offset: 2304)
!1255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1256, size: 1187328, align: 256, elements: !965)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "SingleChannelElement", file: !44, line: 270, baseType: !1257)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SingleChannelElement", file: !44, line: 248, size: 593664, align: 256, elements: !1258)
!1258 = !{!1259, !1307, !1325, !1333, !1335, !1336, !1340, !1342, !1344, !1345, !1346, !1348, !1349, !1353, !1354, !1358, !1362, !1366, !1369, !1370, !1385}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "ics", scope: !1257, file: !44, line: 249, baseType: !1260, size: 2432, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndividualChannelStream", file: !44, line: 193, baseType: !1261)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IndividualChannelStream", file: !44, line: 174, size: 2432, align: 64, elements: !1262)
!1262 = !{!1263, !1264, !1266, !1268, !1269, !1271, !1287, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1301, !1305, !1306}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "max_sfb", scope: !1261, file: !44, line: 175, baseType: !963, size: 8, align: 8)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "window_sequence", scope: !1261, file: !44, line: 176, baseType: !1265, size: 64, align: 32, offset: 32)
!1265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 64, align: 32, elements: !965)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "use_kb_window", scope: !1261, file: !44, line: 177, baseType: !1267, size: 16, align: 8, offset: 96)
!1267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 16, align: 8, elements: !965)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "num_window_groups", scope: !1261, file: !44, line: 178, baseType: !1021, size: 32, align: 32, offset: 128)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "group_len", scope: !1261, file: !44, line: 179, baseType: !1270, size: 64, align: 8, offset: 160)
!1270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 64, align: 8, elements: !984)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "ltp", scope: !1261, file: !44, line: 180, baseType: !1272, size: 416, align: 32, offset: 224)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "LongTermPrediction", file: !44, line: 169, baseType: !1273)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LongTermPrediction", file: !44, line: 163, size: 416, align: 32, elements: !1274)
!1274 = !{!1275, !1278, !1281, !1282, !1283}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !1273, file: !44, line: 164, baseType: !1276, size: 8, align: 8)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !951, line: 36, baseType: !1277)
!1277 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !1273, file: !44, line: 165, baseType: !1279, size: 16, align: 16, offset: 16)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !951, line: 37, baseType: !1280)
!1280 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "coef_idx", scope: !1273, file: !44, line: 166, baseType: !1021, size: 32, align: 32, offset: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !1273, file: !44, line: 167, baseType: !978, size: 32, align: 32, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1273, file: !44, line: 168, baseType: !1284, size: 320, align: 8, offset: 96)
!1284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1276, size: 320, align: 8, elements: !1285)
!1285 = !{!1286}
!1286 = !DISubrange(count: 40)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "swb_offset", scope: !1261, file: !44, line: 181, baseType: !1288, size: 64, align: 64, offset: 640)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1080)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "swb_sizes", scope: !1261, file: !44, line: 182, baseType: !961, size: 64, align: 64, offset: 704)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "num_swb", scope: !1261, file: !44, line: 183, baseType: !1021, size: 32, align: 32, offset: 768)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "num_windows", scope: !1261, file: !44, line: 184, baseType: !1021, size: 32, align: 32, offset: 800)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "tns_max_bands", scope: !1261, file: !44, line: 185, baseType: !1021, size: 32, align: 32, offset: 832)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_present", scope: !1261, file: !44, line: 186, baseType: !1021, size: 32, align: 32, offset: 864)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_initialized", scope: !1261, file: !44, line: 187, baseType: !1021, size: 32, align: 32, offset: 896)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_reset_group", scope: !1261, file: !44, line: 188, baseType: !1021, size: 32, align: 32, offset: 928)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_reset_count", scope: !1261, file: !44, line: 189, baseType: !1298, size: 992, align: 32, offset: 960)
!1298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 992, align: 32, elements: !1299)
!1299 = !{!1300}
!1300 = !DISubrange(count: 31)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_used", scope: !1261, file: !44, line: 190, baseType: !1302, size: 328, align: 8, offset: 1952)
!1302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 328, align: 8, elements: !1303)
!1303 = !{!1304}
!1304 = !DISubrange(count: 41)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "window_clipping", scope: !1261, file: !44, line: 191, baseType: !1270, size: 64, align: 8, offset: 2280)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "clip_avoidance_factor", scope: !1261, file: !44, line: 192, baseType: !954, size: 32, align: 32, offset: 2368)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "tns", scope: !1257, file: !44, line: 250, baseType: !1308, size: 44320, align: 32, offset: 2432)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "TemporalNoiseShaping", file: !44, line: 206, baseType: !1309)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TemporalNoiseShaping", file: !44, line: 198, size: 44320, align: 32, elements: !1310)
!1310 = !{!1311, !1312, !1314, !1317, !1318, !1319, !1323}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !1309, file: !44, line: 199, baseType: !1021, size: 32, align: 32)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "n_filt", scope: !1309, file: !44, line: 200, baseType: !1313, size: 256, align: 32, offset: 32)
!1313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 256, align: 32, elements: !984)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1309, file: !44, line: 201, baseType: !1315, size: 1024, align: 32, offset: 288)
!1315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 1024, align: 32, elements: !1316)
!1316 = !{!985, !981}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !1309, file: !44, line: 202, baseType: !1315, size: 1024, align: 32, offset: 1312)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !1309, file: !44, line: 203, baseType: !1315, size: 1024, align: 32, offset: 2336)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "coef_idx", scope: !1309, file: !44, line: 204, baseType: !1320, size: 20480, align: 32, offset: 3360)
!1320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 20480, align: 32, elements: !1321)
!1321 = !{!985, !981, !1322}
!1322 = !DISubrange(count: 20)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !1309, file: !44, line: 205, baseType: !1324, size: 20480, align: 32, offset: 23840)
!1324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 20480, align: 32, elements: !1321)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "pulse", scope: !1257, file: !44, line: 251, baseType: !1326, size: 320, align: 32, offset: 46752)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pulse", file: !44, line: 229, baseType: !1327)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Pulse", file: !44, line: 224, size: 320, align: 32, elements: !1328)
!1328 = !{!1329, !1330, !1331, !1332}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "num_pulse", scope: !1327, file: !44, line: 225, baseType: !1021, size: 32, align: 32)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1327, file: !44, line: 226, baseType: !1021, size: 32, align: 32, offset: 32)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1327, file: !44, line: 227, baseType: !1174, size: 128, align: 32, offset: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "amp", scope: !1327, file: !44, line: 228, baseType: !1174, size: 128, align: 32, offset: 192)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "band_type", scope: !1257, file: !44, line: 252, baseType: !1334, size: 4096, align: 32, offset: 47072)
!1334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 4096, align: 32, elements: !1251)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "band_alt", scope: !1257, file: !44, line: 253, baseType: !1334, size: 4096, align: 32, offset: 51168)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "band_type_run_end", scope: !1257, file: !44, line: 254, baseType: !1337, size: 3840, align: 32, offset: 55264)
!1337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 3840, align: 32, elements: !1338)
!1338 = !{!1339}
!1339 = !DISubrange(count: 120)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !1257, file: !44, line: 255, baseType: !1341, size: 3840, align: 32, offset: 59104)
!1341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 3840, align: 32, elements: !1338)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "sf_idx", scope: !1257, file: !44, line: 256, baseType: !1343, size: 4096, align: 32, offset: 62944)
!1343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 4096, align: 32, elements: !1251)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "zeroes", scope: !1257, file: !44, line: 257, baseType: !1250, size: 1024, align: 8, offset: 67040)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "can_pns", scope: !1257, file: !44, line: 258, baseType: !1250, size: 1024, align: 8, offset: 68064)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "is_ener", scope: !1257, file: !44, line: 259, baseType: !1347, size: 4096, align: 32, offset: 69088)
!1347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 4096, align: 32, elements: !1251)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "pns_ener", scope: !1257, file: !44, line: 260, baseType: !1347, size: 4096, align: 32, offset: 73184)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "pcoeffs", scope: !1257, file: !44, line: 261, baseType: !1350, size: 32768, align: 32, offset: 77312)
!1350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 32768, align: 32, elements: !1351)
!1351 = !{!1352}
!1352 = !DISubrange(count: 1024)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "coeffs", scope: !1257, file: !44, line: 262, baseType: !1350, size: 32768, align: 32, offset: 110080)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1257, file: !44, line: 263, baseType: !1355, size: 49152, align: 32, offset: 142848)
!1355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 49152, align: 32, elements: !1356)
!1356 = !{!1357}
!1357 = !DISubrange(count: 1536)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "ret_buf", scope: !1257, file: !44, line: 264, baseType: !1359, size: 65536, align: 32, offset: 192000)
!1359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 65536, align: 32, elements: !1360)
!1360 = !{!1361}
!1361 = !DISubrange(count: 2048)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "ltp_state", scope: !1257, file: !44, line: 265, baseType: !1363, size: 98304, align: 32, offset: 257536)
!1363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 98304, align: 32, elements: !1364)
!1364 = !{!1365}
!1365 = !DISubrange(count: 3072)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "lcoeffs", scope: !1257, file: !44, line: 266, baseType: !1367, size: 32768, align: 32, offset: 355840)
!1367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1368, size: 32768, align: 32, elements: !1351)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "AAC_FLOAT", file: !979, line: 90, baseType: !954)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "prcoeffs", scope: !1257, file: !44, line: 267, baseType: !1367, size: 32768, align: 32, offset: 388608)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_state", scope: !1257, file: !44, line: 268, baseType: !1371, size: 172032, align: 32, offset: 421376)
!1371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1372, size: 172032, align: 32, elements: !1383)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "PredictorState", file: !44, line: 144, baseType: !1373)
!1373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PredictorState", file: !44, line: 135, size: 256, align: 32, elements: !1374)
!1374 = !{!1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "cor0", scope: !1373, file: !44, line: 136, baseType: !1368, size: 32, align: 32)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "cor1", scope: !1373, file: !44, line: 137, baseType: !1368, size: 32, align: 32, offset: 32)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "var0", scope: !1373, file: !44, line: 138, baseType: !1368, size: 32, align: 32, offset: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "var1", scope: !1373, file: !44, line: 139, baseType: !1368, size: 32, align: 32, offset: 96)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "r0", scope: !1373, file: !44, line: 140, baseType: !1368, size: 32, align: 32, offset: 128)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "r1", scope: !1373, file: !44, line: 141, baseType: !1368, size: 32, align: 32, offset: 160)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1373, file: !44, line: 142, baseType: !1368, size: 32, align: 32, offset: 192)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "x_est", scope: !1373, file: !44, line: 143, baseType: !1368, size: 32, align: 32, offset: 224)
!1383 = !{!1384}
!1384 = !DISubrange(count: 672)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "ret", scope: !1257, file: !44, line: 269, baseType: !1386, size: 64, align: 64, offset: 593408)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "coup", scope: !1243, file: !44, line: 286, baseType: !1388, size: 62272, align: 32, offset: 1189632)
!1388 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelCoupling", file: !44, line: 243, baseType: !1389)
!1389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelCoupling", file: !44, line: 234, size: 62272, align: 32, elements: !1390)
!1390 = !{!1391, !1392, !1393, !1395, !1396, !1397}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "coupling_point", scope: !1389, file: !44, line: 235, baseType: !59, size: 32, align: 32)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "num_coupled", scope: !1389, file: !44, line: 236, baseType: !1021, size: 32, align: 32, offset: 32)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1389, file: !44, line: 237, baseType: !1394, size: 256, align: 32, offset: 64)
!1394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 256, align: 32, elements: !984)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "id_select", scope: !1389, file: !44, line: 238, baseType: !1313, size: 256, align: 32, offset: 320)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "ch_select", scope: !1389, file: !44, line: 239, baseType: !1313, size: 256, align: 32, offset: 576)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1389, file: !44, line: 242, baseType: !1398, size: 61440, align: 32, offset: 832)
!1398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 61440, align: 32, elements: !1399)
!1399 = !{!970, !1339}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "sbr", scope: !1243, file: !44, line: 287, baseType: !1401, size: 3129856, align: 256, offset: 1252096)
!1401 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpectralBandReplication", file: !1402, line: 115, baseType: !1403)
!1402 = !DIFile(filename: "libavcodec/sbr.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpectralBandReplication", file: !1402, line: 139, size: 3129856, align: 256, elements: !1404)
!1404 = !{!1405, !1406, !1407, !1408, !1409, !1410, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1431, !1433, !1434, !1435, !1436, !1508, !1624, !1625, !1626, !1627, !1631, !1635, !1636, !1638, !1642, !1643, !1645, !1646, !1649, !1652, !1655, !1658, !1659, !1662, !1663, !1665, !1666, !1667, !1668, !1669, !1672, !1673, !1674, !1727}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1403, file: !1402, line: 140, baseType: !1021, size: 32, align: 32)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1403, file: !1402, line: 141, baseType: !1021, size: 32, align: 32, offset: 32)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "ready_for_dequant", scope: !1403, file: !1402, line: 142, baseType: !1021, size: 32, align: 32, offset: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "id_aac", scope: !1403, file: !1402, line: 143, baseType: !1021, size: 32, align: 32, offset: 96)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !1403, file: !1402, line: 144, baseType: !1021, size: 32, align: 32, offset: 128)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "spectrum_params", scope: !1403, file: !1402, line: 145, baseType: !1411, size: 48, align: 8, offset: 160)
!1411 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpectrumParameters", file: !1402, line: 55, baseType: !1412)
!1412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpectrumParameters", file: !1402, line: 42, size: 48, align: 8, elements: !1413)
!1413 = !{!1414, !1415, !1416, !1417, !1418, !1419}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "bs_start_freq", scope: !1412, file: !1402, line: 43, baseType: !963, size: 8, align: 8)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "bs_stop_freq", scope: !1412, file: !1402, line: 44, baseType: !963, size: 8, align: 8, offset: 8)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "bs_xover_band", scope: !1412, file: !1402, line: 45, baseType: !963, size: 8, align: 8, offset: 16)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "bs_freq_scale", scope: !1412, file: !1402, line: 51, baseType: !963, size: 8, align: 8, offset: 24)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "bs_alter_scale", scope: !1412, file: !1402, line: 52, baseType: !963, size: 8, align: 8, offset: 32)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "bs_noise_bands", scope: !1412, file: !1402, line: 53, baseType: !963, size: 8, align: 8, offset: 40)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "bs_amp_res_header", scope: !1403, file: !1402, line: 146, baseType: !1021, size: 32, align: 32, offset: 224)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "bs_limiter_bands", scope: !1403, file: !1402, line: 151, baseType: !952, size: 32, align: 32, offset: 256)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "bs_limiter_gains", scope: !1403, file: !1402, line: 152, baseType: !952, size: 32, align: 32, offset: 288)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "bs_interpol_freq", scope: !1403, file: !1402, line: 153, baseType: !952, size: 32, align: 32, offset: 320)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "bs_smoothing_mode", scope: !1403, file: !1402, line: 154, baseType: !952, size: 32, align: 32, offset: 352)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "bs_coupling", scope: !1403, file: !1402, line: 156, baseType: !952, size: 32, align: 32, offset: 384)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !1403, file: !1402, line: 157, baseType: !1427, size: 160, align: 32, offset: 416)
!1427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1428, size: 160, align: 32, elements: !1429)
!1428 = !DIDerivedType(tag: DW_TAG_typedef, name: "AAC_SIGNE", file: !979, line: 91, baseType: !952)
!1429 = !{!1430}
!1430 = !DISubrange(count: 5)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !1403, file: !1402, line: 160, baseType: !1432, size: 64, align: 32, offset: 576)
!1432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1428, size: 64, align: 32, elements: !965)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1403, file: !1402, line: 162, baseType: !1432, size: 64, align: 32, offset: 640)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "kx_and_m_pushed", scope: !1403, file: !1402, line: 163, baseType: !952, size: 32, align: 32, offset: 704)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "n_master", scope: !1403, file: !1402, line: 165, baseType: !1428, size: 32, align: 32, offset: 736)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1403, file: !1402, line: 166, baseType: !1437, size: 1407488, align: 256, offset: 768)
!1437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1438, size: 1407488, align: 256, elements: !965)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBRData", file: !1402, line: 113, baseType: !1439)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SBRData", file: !1402, line: 62, size: 703744, align: 256, elements: !1440)
!1440 = !{!1441, !1442, !1443, !1444, !1448, !1449, !1451, !1452, !1455, !1459, !1460, !1464, !1468, !1469, !1471, !1473, !1476, !1477, !1482, !1486, !1487, !1490, !1494, !1496, !1499, !1501, !1502, !1503, !1506, !1507}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "bs_frame_class", scope: !1439, file: !1402, line: 67, baseType: !952, size: 32, align: 32)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "bs_add_harmonic_flag", scope: !1439, file: !1402, line: 68, baseType: !952, size: 32, align: 32, offset: 32)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "bs_num_env", scope: !1439, file: !1402, line: 69, baseType: !1428, size: 32, align: 32, offset: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "bs_freq_res", scope: !1439, file: !1402, line: 70, baseType: !1445, size: 56, align: 8, offset: 96)
!1445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 56, align: 8, elements: !1446)
!1446 = !{!1447}
!1447 = !DISubrange(count: 7)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "bs_num_noise", scope: !1439, file: !1402, line: 71, baseType: !1428, size: 32, align: 32, offset: 160)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "bs_df_env", scope: !1439, file: !1402, line: 72, baseType: !1450, size: 40, align: 8, offset: 192)
!1450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 40, align: 8, elements: !1429)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "bs_df_noise", scope: !1439, file: !1402, line: 73, baseType: !1267, size: 16, align: 8, offset: 232)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "bs_invf_mode", scope: !1439, file: !1402, line: 74, baseType: !1453, size: 80, align: 8, offset: 248)
!1453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 80, align: 8, elements: !1454)
!1454 = !{!966, !1430}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "bs_add_harmonic", scope: !1439, file: !1402, line: 75, baseType: !1456, size: 384, align: 8, offset: 328)
!1456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 384, align: 8, elements: !1457)
!1457 = !{!1458}
!1458 = !DISubrange(count: 48)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "bs_amp_res", scope: !1439, file: !1402, line: 76, baseType: !952, size: 32, align: 32, offset: 736)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "synthesis_filterbank_samples", scope: !1439, file: !1402, line: 83, baseType: !1461, size: 73728, align: 32, offset: 768)
!1461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 73728, align: 32, elements: !1462)
!1462 = !{!1463}
!1463 = !DISubrange(count: 2304)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "analysis_filterbank_samples", scope: !1439, file: !1402, line: 84, baseType: !1465, size: 41984, align: 32, offset: 74496)
!1465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 41984, align: 32, elements: !1466)
!1466 = !{!1467}
!1467 = !DISubrange(count: 1312)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "synthesis_filterbank_samples_offset", scope: !1439, file: !1402, line: 85, baseType: !1021, size: 32, align: 32, offset: 116480)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "e_a", scope: !1439, file: !1402, line: 87, baseType: !1470, size: 64, align: 32, offset: 116512)
!1470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 64, align: 32, elements: !965)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "bw_array", scope: !1439, file: !1402, line: 89, baseType: !1472, size: 160, align: 32, offset: 116576)
!1472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 160, align: 32, elements: !1429)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !1439, file: !1402, line: 91, baseType: !1474, size: 131072, align: 32, offset: 116736)
!1474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 131072, align: 32, elements: !1475)
!1475 = !{!966, !1222, !1222, !966}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "Ypos", scope: !1439, file: !1402, line: 93, baseType: !1021, size: 32, align: 32, offset: 247808)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "Y", scope: !1439, file: !1402, line: 94, baseType: !1478, size: 311296, align: 32, offset: 247936)
!1478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 311296, align: 32, elements: !1479)
!1479 = !{!966, !1480, !1481, !966}
!1480 = !DISubrange(count: 38)
!1481 = !DISubrange(count: 64)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "g_temp", scope: !1439, file: !1402, line: 95, baseType: !1483, size: 64512, align: 32, offset: 559232)
!1483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1368, size: 64512, align: 32, elements: !1484)
!1484 = !{!1485, !1458}
!1485 = !DISubrange(count: 42)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "q_temp", scope: !1439, file: !1402, line: 96, baseType: !1483, size: 64512, align: 32, offset: 623744)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "s_indexmapped", scope: !1439, file: !1402, line: 97, baseType: !1488, size: 3072, align: 8, offset: 688256)
!1488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 3072, align: 8, elements: !1489)
!1489 = !{!985, !1458}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "env_facs_q", scope: !1439, file: !1402, line: 99, baseType: !1491, size: 2304, align: 8, offset: 691328)
!1491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 2304, align: 8, elements: !1492)
!1492 = !{!1493, !1458}
!1493 = !DISubrange(count: 6)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "env_facs", scope: !1439, file: !1402, line: 100, baseType: !1495, size: 9216, align: 32, offset: 693632)
!1495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1368, size: 9216, align: 32, elements: !1492)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "noise_facs_q", scope: !1439, file: !1402, line: 102, baseType: !1497, size: 120, align: 8, offset: 702848)
!1497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 120, align: 8, elements: !1498)
!1498 = !{!1178, !1430}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "noise_facs", scope: !1439, file: !1402, line: 103, baseType: !1500, size: 480, align: 32, offset: 702976)
!1500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1368, size: 480, align: 32, elements: !1498)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "t_env", scope: !1439, file: !1402, line: 105, baseType: !1270, size: 64, align: 8, offset: 703456)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "t_env_num_env_old", scope: !1439, file: !1402, line: 107, baseType: !963, size: 8, align: 8, offset: 703520)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "t_q", scope: !1439, file: !1402, line: 109, baseType: !1504, size: 24, align: 8, offset: 703528)
!1504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 24, align: 8, elements: !1505)
!1505 = !{!1178}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "f_indexnoise", scope: !1439, file: !1402, line: 110, baseType: !952, size: 32, align: 32, offset: 703552)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "f_indexsine", scope: !1439, file: !1402, line: 111, baseType: !952, size: 32, align: 32, offset: 703584)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "ps", scope: !1403, file: !1402, line: 167, baseType: !1509, size: 1072896, align: 128, offset: 1408256)
!1509 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSContext", file: !1510, line: 79, baseType: !1511)
!1510 = !DIFile(filename: "libavcodec/aacps.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PSContext", file: !1510, line: 41, size: 1072896, align: 128, elements: !1512)
!1512 = !{!1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1529, !1533, !1534, !1535, !1536, !1537, !1538, !1542, !1547, !1552, !1555, !1556, !1557, !1560, !1561, !1562, !1563, !1566, !1567, !1569, !1570}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1511, file: !1510, line: 42, baseType: !1021, size: 32, align: 32)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "enable_iid", scope: !1511, file: !1510, line: 43, baseType: !1021, size: 32, align: 32, offset: 32)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "iid_quant", scope: !1511, file: !1510, line: 44, baseType: !1021, size: 32, align: 32, offset: 64)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "nr_iid_par", scope: !1511, file: !1510, line: 45, baseType: !1021, size: 32, align: 32, offset: 96)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "nr_ipdopd_par", scope: !1511, file: !1510, line: 46, baseType: !1021, size: 32, align: 32, offset: 128)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "enable_icc", scope: !1511, file: !1510, line: 47, baseType: !1021, size: 32, align: 32, offset: 160)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "icc_mode", scope: !1511, file: !1510, line: 48, baseType: !1021, size: 32, align: 32, offset: 192)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "nr_icc_par", scope: !1511, file: !1510, line: 49, baseType: !1021, size: 32, align: 32, offset: 224)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "enable_ext", scope: !1511, file: !1510, line: 50, baseType: !1021, size: 32, align: 32, offset: 256)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "frame_class", scope: !1511, file: !1510, line: 51, baseType: !1021, size: 32, align: 32, offset: 288)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "num_env_old", scope: !1511, file: !1510, line: 52, baseType: !1021, size: 32, align: 32, offset: 320)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "num_env", scope: !1511, file: !1510, line: 53, baseType: !1021, size: 32, align: 32, offset: 352)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "enable_ipdopd", scope: !1511, file: !1510, line: 54, baseType: !1021, size: 32, align: 32, offset: 384)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "border_position", scope: !1511, file: !1510, line: 55, baseType: !1527, size: 192, align: 32, offset: 416)
!1527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 192, align: 32, elements: !1528)
!1528 = !{!1493}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "iid_par", scope: !1511, file: !1510, line: 56, baseType: !1530, size: 1360, align: 8, offset: 608)
!1530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1276, size: 1360, align: 8, elements: !1531)
!1531 = !{!1430, !1532}
!1532 = !DISubrange(count: 34)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "icc_par", scope: !1511, file: !1510, line: 57, baseType: !1530, size: 1360, align: 8, offset: 1968)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "ipd_par", scope: !1511, file: !1510, line: 59, baseType: !1530, size: 1360, align: 8, offset: 3328)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "opd_par", scope: !1511, file: !1510, line: 60, baseType: !1530, size: 1360, align: 8, offset: 4688)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "is34bands", scope: !1511, file: !1510, line: 61, baseType: !1021, size: 32, align: 32, offset: 6048)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "is34bands_old", scope: !1511, file: !1510, line: 62, baseType: !1021, size: 32, align: 32, offset: 6080)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !1511, file: !1510, line: 64, baseType: !1539, size: 14080, align: 32, offset: 6144)
!1539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 14080, align: 32, elements: !1540)
!1540 = !{!1430, !1541, !966}
!1541 = !DISubrange(count: 44)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1511, file: !1510, line: 65, baseType: !1543, size: 267904, align: 32, offset: 20224)
!1543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 267904, align: 32, elements: !1544)
!1544 = !{!1545, !1546, !966}
!1545 = !DISubrange(count: 91)
!1546 = !DISubrange(count: 46)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "ap_delay", scope: !1511, file: !1510, line: 66, baseType: !1548, size: 355200, align: 32, offset: 288128)
!1548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 355200, align: 32, elements: !1549)
!1549 = !{!1550, !1178, !1551, !966}
!1550 = !DISubrange(count: 50)
!1551 = !DISubrange(count: 37)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "peak_decay_nrg", scope: !1511, file: !1510, line: 67, baseType: !1553, size: 1088, align: 32, offset: 643328)
!1553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 1088, align: 32, elements: !1554)
!1554 = !{!1532}
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "power_smooth", scope: !1511, file: !1510, line: 68, baseType: !1553, size: 1088, align: 32, offset: 644480)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "peak_decay_diff_smooth", scope: !1511, file: !1510, line: 69, baseType: !1553, size: 1088, align: 32, offset: 645632)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "H11", scope: !1511, file: !1510, line: 70, baseType: !1558, size: 13056, align: 32, offset: 646784)
!1558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 13056, align: 32, elements: !1559)
!1559 = !{!966, !1493, !1532}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "H12", scope: !1511, file: !1510, line: 71, baseType: !1558, size: 13056, align: 32, offset: 659840)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "H21", scope: !1511, file: !1510, line: 72, baseType: !1558, size: 13056, align: 32, offset: 672896)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "H22", scope: !1511, file: !1510, line: 73, baseType: !1558, size: 13056, align: 32, offset: 685952)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "Lbuf", scope: !1511, file: !1510, line: 74, baseType: !1564, size: 186368, align: 32, offset: 699008)
!1564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 186368, align: 32, elements: !1565)
!1565 = !{!1545, !1222, !966}
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "Rbuf", scope: !1511, file: !1510, line: 75, baseType: !1564, size: 186368, align: 32, offset: 885376)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "opd_hist", scope: !1511, file: !1510, line: 76, baseType: !1568, size: 272, align: 8, offset: 1071744)
!1568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1276, size: 272, align: 8, elements: !1554)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "ipd_hist", scope: !1511, file: !1510, line: 77, baseType: !1568, size: 272, align: 8, offset: 1072016)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "dsp", scope: !1511, file: !1510, line: 78, baseType: !1571, size: 512, align: 64, offset: 1072320)
!1571 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSDSPContext", file: !1572, line: 52, baseType: !1573)
!1572 = !DIFile(filename: "libavcodec/aacpsdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PSDSPContext", file: !1572, line: 32, size: 512, align: 64, elements: !1574)
!1574 = !{!1575, !1581, !1587, !1596, !1606, !1610, !1617}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "add_squares", scope: !1573, file: !1572, line: 33, baseType: !1576, size: 64, align: 64)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DISubroutineType(types: !1578)
!1578 = !{null, !1386, !1579, !1021}
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 64, align: 32, elements: !965)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "mul_pair_single", scope: !1573, file: !1572, line: 34, baseType: !1582, size: 64, align: 64, offset: 64)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DISubroutineType(types: !1584)
!1584 = !{null, !1585, !1585, !1386, !1021}
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 64, align: 32, elements: !965)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "hybrid_analysis", scope: !1573, file: !1572, line: 36, baseType: !1588, size: 64, align: 64, offset: 128)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DISubroutineType(types: !1590)
!1590 = !{null, !1585, !1585, !1591, !1594, !1021}
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64, align: 64)
!1592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 512, align: 32, elements: !1593)
!1593 = !{!985, !966}
!1594 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1595, line: 149, baseType: !1172)
!1595 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "hybrid_analysis_ileave", scope: !1573, file: !1572, line: 39, baseType: !1597, size: 64, align: 64, offset: 192)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DISubroutineType(types: !1599)
!1599 = !{null, !1600, !1603, !1021, !1021}
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 2048, align: 32, elements: !1602)
!1602 = !{!1222, !966}
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 77824, align: 32, elements: !1605)
!1605 = !{!1480, !1481}
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "hybrid_synthesis_deint", scope: !1573, file: !1572, line: 41, baseType: !1607, size: 64, align: 64, offset: 256)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DISubroutineType(types: !1609)
!1609 = !{null, !1603, !1600, !1021, !1021}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "decorrelate", scope: !1573, file: !1572, line: 43, baseType: !1611, size: 64, align: 64, offset: 320)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DISubroutineType(types: !1613)
!1613 = !{null, !1585, !1585, !1614, !976, !1579, !976, !978, !1021}
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1615, size: 64, align: 64)
!1615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 2368, align: 32, elements: !1616)
!1616 = !{!1551, !966}
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "stereo_interpolate", scope: !1573, file: !1572, line: 49, baseType: !1618, size: 128, align: 64, offset: 384)
!1618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1619, size: 128, align: 64, elements: !965)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DISubroutineType(types: !1621)
!1621 = !{null, !1585, !1585, !1622, !1622, !1021}
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 128, align: 32, elements: !980)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1403, file: !1402, line: 169, baseType: !1432, size: 64, align: 32, offset: 2481152)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "n_q", scope: !1403, file: !1402, line: 171, baseType: !1428, size: 32, align: 32, offset: 2481216)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "n_lim", scope: !1403, file: !1402, line: 173, baseType: !1428, size: 32, align: 32, offset: 2481248)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "f_master", scope: !1403, file: !1402, line: 175, baseType: !1628, size: 784, align: 16, offset: 2481280)
!1628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1080, size: 784, align: 16, elements: !1629)
!1629 = !{!1630}
!1630 = !DISubrange(count: 49)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablelow", scope: !1403, file: !1402, line: 177, baseType: !1632, size: 400, align: 16, offset: 2482064)
!1632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1080, size: 400, align: 16, elements: !1633)
!1633 = !{!1634}
!1634 = !DISubrange(count: 25)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablehigh", scope: !1403, file: !1402, line: 179, baseType: !1628, size: 784, align: 16, offset: 2482464)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablenoise", scope: !1403, file: !1402, line: 181, baseType: !1637, size: 96, align: 16, offset: 2483248)
!1637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1080, size: 96, align: 16, elements: !1528)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablelim", scope: !1403, file: !1402, line: 183, baseType: !1639, size: 480, align: 16, offset: 2483344)
!1639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1080, size: 480, align: 16, elements: !1640)
!1640 = !{!1641}
!1641 = !DISubrange(count: 30)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "num_patches", scope: !1403, file: !1402, line: 184, baseType: !1428, size: 32, align: 32, offset: 2483840)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "patch_num_subbands", scope: !1403, file: !1402, line: 185, baseType: !1644, size: 48, align: 8, offset: 2483872)
!1644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 48, align: 8, elements: !1528)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "patch_start_subband", scope: !1403, file: !1402, line: 186, baseType: !1644, size: 48, align: 8, offset: 2483920)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "X_low", scope: !1403, file: !1402, line: 188, baseType: !1647, size: 81920, align: 32, offset: 2483968)
!1647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 81920, align: 32, elements: !1648)
!1648 = !{!1222, !1286, !966}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "X_high", scope: !1403, file: !1402, line: 190, baseType: !1650, size: 163840, align: 32, offset: 2565888)
!1650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 163840, align: 32, elements: !1651)
!1651 = !{!1481, !1286, !966}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !1403, file: !1402, line: 192, baseType: !1653, size: 311296, align: 32, offset: 2729728)
!1653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 311296, align: 32, elements: !1654)
!1654 = !{!966, !966, !1480, !1481}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "alpha0", scope: !1403, file: !1402, line: 194, baseType: !1656, size: 4096, align: 32, offset: 3041024)
!1656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 4096, align: 32, elements: !1657)
!1657 = !{!1481, !966}
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "alpha1", scope: !1403, file: !1402, line: 196, baseType: !1656, size: 4096, align: 32, offset: 3045120)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "e_origmapped", scope: !1403, file: !1402, line: 198, baseType: !1660, size: 10752, align: 32, offset: 3049216)
!1660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1368, size: 10752, align: 32, elements: !1661)
!1661 = !{!1447, !1458}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "q_mapped", scope: !1403, file: !1402, line: 200, baseType: !1660, size: 10752, align: 32, offset: 3059968)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "s_mapped", scope: !1403, file: !1402, line: 202, baseType: !1664, size: 2688, align: 8, offset: 3070720)
!1664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 2688, align: 8, elements: !1661)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "e_curr", scope: !1403, file: !1402, line: 204, baseType: !1660, size: 10752, align: 32, offset: 3073408)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "q_m", scope: !1403, file: !1402, line: 206, baseType: !1660, size: 10752, align: 32, offset: 3084160)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "s_m", scope: !1403, file: !1402, line: 208, baseType: !1660, size: 10752, align: 32, offset: 3094912)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1403, file: !1402, line: 209, baseType: !1660, size: 10752, align: 32, offset: 3105664)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_filter_scratch", scope: !1403, file: !1402, line: 210, baseType: !1670, size: 10240, align: 32, offset: 3116544)
!1670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 10240, align: 32, elements: !1671)
!1671 = !{!1430, !1481}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_ana", scope: !1403, file: !1402, line: 211, baseType: !1072, size: 896, align: 64, offset: 3126784)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "mdct", scope: !1403, file: !1402, line: 212, baseType: !1072, size: 896, align: 64, offset: 3127680)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "dsp", scope: !1403, file: !1402, line: 213, baseType: !1675, size: 896, align: 64, offset: 3128576)
!1675 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBRDSPContext", file: !1676, line: 45, baseType: !1677)
!1676 = !DIFile(filename: "libavcodec/sbrdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SBRDSPContext", file: !1676, line: 28, size: 896, align: 64, elements: !1678)
!1678 = !{!1679, !1683, !1687, !1688, !1689, !1693, !1697, !1701, !1708, !1712, !1722}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "sum64x5", scope: !1677, file: !1676, line: 29, baseType: !1680, size: 64, align: 64)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{null, !1386}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "sum_square", scope: !1677, file: !1676, line: 30, baseType: !1684, size: 64, align: 64, offset: 64)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DISubroutineType(types: !1686)
!1686 = !{!1368, !1585, !1021}
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "neg_odd_64", scope: !1677, file: !1676, line: 31, baseType: !1680, size: 64, align: 64, offset: 128)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_pre_shuffle", scope: !1677, file: !1676, line: 32, baseType: !1680, size: 64, align: 64, offset: 192)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_post_shuffle", scope: !1677, file: !1676, line: 33, baseType: !1690, size: 64, align: 64, offset: 256)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DISubroutineType(types: !1692)
!1692 = !{null, !1585, !976}
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_deint_neg", scope: !1677, file: !1676, line: 34, baseType: !1694, size: 64, align: 64, offset: 320)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64, align: 64)
!1695 = !DISubroutineType(types: !1696)
!1696 = !{null, !1386, !976}
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_deint_bfly", scope: !1677, file: !1676, line: 35, baseType: !1698, size: 64, align: 64, offset: 384)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
!1699 = !DISubroutineType(types: !1700)
!1700 = !{null, !1386, !976, !976}
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "autocorrelate", scope: !1677, file: !1676, line: 36, baseType: !1702, size: 64, align: 64, offset: 448)
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64, align: 64)
!1703 = !DISubroutineType(types: !1704)
!1704 = !{null, !1579, !1705}
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64, align: 64)
!1706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1368, size: 128, align: 32, elements: !1707)
!1707 = !{!966, !966}
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "hf_gen", scope: !1677, file: !1676, line: 37, baseType: !1709, size: 64, align: 64, offset: 512)
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1710 = !DISubroutineType(types: !1711)
!1711 = !{null, !1585, !1579, !976, !976, !978, !1021, !1021}
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "hf_g_filt", scope: !1677, file: !1676, line: 40, baseType: !1713, size: 64, align: 64, offset: 576)
!1713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1714, size: 64, align: 64)
!1714 = !DISubroutineType(types: !1715)
!1715 = !{null, !1585, !1716, !1719, !1021, !1721}
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64, align: 64)
!1717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 2560, align: 32, elements: !1718)
!1718 = !{!1286, !966}
!1719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1720, size: 64, align: 64)
!1720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1368)
!1721 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !951, line: 119, baseType: !1172)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "hf_apply_noise", scope: !1677, file: !1676, line: 42, baseType: !1723, size: 256, align: 64, offset: 640)
!1723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1724, size: 256, align: 64, elements: !980)
!1724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1725, size: 64, align: 64)
!1725 = !DISubroutineType(types: !1726)
!1726 = !{null, !1585, !1719, !1719, !1021, !1021, !1021}
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1403, file: !1402, line: 214, baseType: !1728, size: 256, align: 64, offset: 3129472)
!1728 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACSBRContext", file: !1402, line: 134, baseType: !1729)
!1729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACSBRContext", file: !1402, line: 120, size: 256, align: 64, elements: !1730)
!1730 = !{!1731, !2541, !2547, !2553}
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "sbr_lf_gen", scope: !1729, file: !1402, line: 121, baseType: !1732, size: 64, align: 64)
!1732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1733, size: 64, align: 64)
!1733 = !DISubroutineType(types: !1734)
!1734 = !{!1021, !1735, !2535, !2536, !2538, !1021}
!1735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1736, size: 64, align: 64)
!1736 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACContext", file: !1402, line: 37, baseType: !1737)
!1737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACContext", file: !44, line: 293, size: 62208, align: 256, elements: !1738)
!1738 = !{!1739, !1740, !2407, !2408, !2409, !2426, !2429, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2468, !2469, !2470, !2471, !2472, !2475, !2476, !2477, !2479, !2508, !2509, !2510, !2511, !2515, !2516, !2522, !2526, !2527, !2531}
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1737, file: !44, line: 294, baseType: !1004, size: 64, align: 64)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1737, file: !44, line: 295, baseType: !1741, size: 64, align: 64, offset: 64)
!1741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1742, size: 64, align: 64)
!1742 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !85, line: 3360, baseType: !1743)
!1743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !85, line: 1556, size: 8448, align: 64, elements: !1744)
!1744 = !{!1745, !1748, !1749, !1750, !2007, !2008, !2009, !2010, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2163, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2335, !2336, !2337, !2338, !2345, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2403, !2404, !2405, !2406}
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1743, file: !85, line: 1561, baseType: !1746, size: 64, align: 64)
!1746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1747, size: 64, align: 64)
!1747 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1743, file: !85, line: 1562, baseType: !1021, size: 32, align: 32, offset: 64)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1743, file: !85, line: 1564, baseType: !74, size: 32, align: 32, offset: 96)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1743, file: !85, line: 1565, baseType: !1751, size: 64, align: 64, offset: 128)
!1751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1752, size: 64, align: 64)
!1752 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1753)
!1753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !85, line: 3468, size: 1984, align: 64, elements: !1754)
!1754 = !{!1755, !1756, !1757, !1758, !1759, !1760, !1769, !1772, !1775, !1778, !1783, !1784, !1785, !1793, !1794, !1795, !1797, !1801, !1807, !1816, !1820, !1821, !1860, !1978, !1982, !1983, !1987, !1991, !1996, !2000, !2001, !2002}
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1753, file: !85, line: 3475, baseType: !1009, size: 64, align: 64)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1753, file: !85, line: 3480, baseType: !1009, size: 64, align: 64, offset: 64)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1753, file: !85, line: 3481, baseType: !74, size: 32, align: 32, offset: 128)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1753, file: !85, line: 3482, baseType: !84, size: 32, align: 32, offset: 160)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1753, file: !85, line: 3487, baseType: !1021, size: 32, align: 32, offset: 192)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1753, file: !85, line: 3488, baseType: !1761, size: 64, align: 64, offset: 256)
!1761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1762, size: 64, align: 64)
!1762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1763)
!1763 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1764, line: 61, baseType: !1765)
!1764 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1764, line: 58, size: 64, align: 32, elements: !1766)
!1766 = !{!1767, !1768}
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1765, file: !1764, line: 59, baseType: !1021, size: 32, align: 32)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1765, file: !1764, line: 60, baseType: !1021, size: 32, align: 32, offset: 32)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1753, file: !85, line: 3489, baseType: !1770, size: 64, align: 64, offset: 320)
!1770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1771, size: 64, align: 64)
!1771 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1753, file: !85, line: 3490, baseType: !1773, size: 64, align: 64, offset: 384)
!1773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1774, size: 64, align: 64)
!1774 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1021)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1753, file: !85, line: 3491, baseType: !1776, size: 64, align: 64, offset: 448)
!1776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1777, size: 64, align: 64)
!1777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !744)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1753, file: !85, line: 3492, baseType: !1779, size: 64, align: 64, offset: 512)
!1779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1780, size: 64, align: 64)
!1780 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1781)
!1781 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !951, line: 55, baseType: !1782)
!1782 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1753, file: !85, line: 3493, baseType: !963, size: 8, align: 8, offset: 576)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1753, file: !85, line: 3494, baseType: !1746, size: 64, align: 64, offset: 640)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1753, file: !85, line: 3495, baseType: !1786, size: 64, align: 64, offset: 704)
!1786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1787, size: 64, align: 64)
!1787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1788)
!1788 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !85, line: 3404, baseType: !1789)
!1789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !85, line: 3401, size: 128, align: 64, elements: !1790)
!1790 = !{!1791, !1792}
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1789, file: !85, line: 3402, baseType: !1021, size: 32, align: 32)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1789, file: !85, line: 3403, baseType: !1009, size: 64, align: 64, offset: 64)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1753, file: !85, line: 3507, baseType: !1009, size: 64, align: 64, offset: 768)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1753, file: !85, line: 3516, baseType: !1021, size: 32, align: 32, offset: 832)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1753, file: !85, line: 3517, baseType: !1796, size: 64, align: 64, offset: 896)
!1796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1753, size: 64, align: 64)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1753, file: !85, line: 3527, baseType: !1798, size: 64, align: 64, offset: 960)
!1798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1799, size: 64, align: 64)
!1799 = !DISubroutineType(types: !1800)
!1800 = !{!1021, !1741}
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1753, file: !85, line: 3535, baseType: !1802, size: 64, align: 64, offset: 1024)
!1802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1803, size: 64, align: 64)
!1803 = !DISubroutineType(types: !1804)
!1804 = !{!1021, !1741, !1805}
!1805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1806, size: 64, align: 64)
!1806 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1742)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1753, file: !85, line: 3541, baseType: !1808, size: 64, align: 64, offset: 1088)
!1808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1809, size: 64, align: 64)
!1809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1810)
!1810 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !85, line: 3461, baseType: !1811)
!1811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1812, line: 223, size: 128, align: 64, elements: !1813)
!1812 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1813 = !{!1814, !1815}
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1811, file: !1812, line: 224, baseType: !961, size: 64, align: 64)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1811, file: !1812, line: 225, baseType: !961, size: 64, align: 64, offset: 64)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1753, file: !85, line: 3549, baseType: !1817, size: 64, align: 64, offset: 1152)
!1817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1818, size: 64, align: 64)
!1818 = !DISubroutineType(types: !1819)
!1819 = !{null, !1796}
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1753, file: !85, line: 3551, baseType: !1798, size: 64, align: 64, offset: 1216)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1753, file: !85, line: 3552, baseType: !1822, size: 64, align: 64, offset: 1280)
!1822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1823, size: 64, align: 64)
!1823 = !DISubroutineType(types: !1824)
!1824 = !{!1021, !1741, !1067, !1021, !1825}
!1825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1826, size: 64, align: 64)
!1826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1827)
!1827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !85, line: 3920, size: 256, align: 64, elements: !1828)
!1828 = !{!1829, !1830, !1831, !1832, !1833, !1859}
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1827, file: !85, line: 3921, baseType: !1080, size: 16, align: 16)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1827, file: !85, line: 3922, baseType: !950, size: 32, align: 32, offset: 32)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1827, file: !85, line: 3923, baseType: !950, size: 32, align: 32, offset: 64)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1827, file: !85, line: 3924, baseType: !952, size: 32, align: 32, offset: 96)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1827, file: !85, line: 3925, baseType: !1834, size: 64, align: 64, offset: 128)
!1834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1835, size: 64, align: 64)
!1835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1836, size: 64, align: 64)
!1836 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !85, line: 3918, baseType: !1837)
!1837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !85, line: 3885, size: 1600, align: 64, elements: !1838)
!1838 = !{!1839, !1840, !1841, !1842, !1843, !1844, !1851, !1853, !1854, !1855, !1857, !1858}
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1837, file: !85, line: 3886, baseType: !1021, size: 32, align: 32)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1837, file: !85, line: 3887, baseType: !1021, size: 32, align: 32, offset: 32)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1837, file: !85, line: 3888, baseType: !1021, size: 32, align: 32, offset: 64)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1837, file: !85, line: 3889, baseType: !1021, size: 32, align: 32, offset: 96)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1837, file: !85, line: 3890, baseType: !1021, size: 32, align: 32, offset: 128)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1837, file: !85, line: 3897, baseType: !1845, size: 768, align: 64, offset: 192)
!1845 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !85, line: 3858, baseType: !1846)
!1846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !85, line: 3853, size: 768, align: 64, elements: !1847)
!1847 = !{!1848, !1850}
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1846, file: !85, line: 3855, baseType: !1849, size: 512, align: 64)
!1849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1067, size: 512, align: 64, elements: !984)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1846, file: !85, line: 3857, baseType: !1313, size: 256, align: 32, offset: 512)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1837, file: !85, line: 3903, baseType: !1852, size: 256, align: 64, offset: 960)
!1852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1067, size: 256, align: 64, elements: !980)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1837, file: !85, line: 3904, baseType: !1174, size: 128, align: 32, offset: 1216)
