; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--snow.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--snow.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.slice_buffer_s = type { i16**, i16**, i32, i32, i32, i32, i16* }
%struct.SnowContext = type { %struct.AVClass*, %struct.AVCodecContext*, %struct.RangeCoder, %struct.MECmpContext, %struct.HpelDSPContext, %struct.QpelDSPContext, %struct.VideoDSPContext, %struct.H264QpelContext, %struct.MpegvideoEncDSPContext, %struct.SnowDWTContext, %struct.AVFrame*, %struct.AVFrame*, [8 x %struct.AVFrame*], [8 x [4 x [4 x i8*]]], %struct.AVFrame*, [32 x i8], [4224 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x [2 x i16]*], [8 x i32*], i32*, i32*, i16*, i16*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [4 x %struct.Plane], %struct.BlockNode*, [1024 x i32], i32, %struct.slice_buffer_s, i32, i32, i32, i32, i32, i32, %struct.MpegEncContext, i8*, i8*, %struct.AVMotionVector*, i32, [8 x i64], i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }

!913 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!914 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!915 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !57, line: 798, size: 32, align: 32, elements: !917)
!917 = !{!918, !919, !920, !921, !922, !923, !924}
!918 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!919 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!920 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!921 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!922 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!923 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!924 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!925 = !{!926, !929, !930, !931}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !928, line: 51, baseType: !929)
!928 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!929 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!930 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!932 = !{!933, !941, !950, !954, !958, !962, !964, !968, !972, !1032, !1033}
!933 = distinct !DIGlobalVariable(name: "ff_quant3bA", scope: !0, file: !934, line: 104, type: !935, isLocal: false, isDefinition: true, variable: [256 x i8]* @ff_quant3bA)
!934 = !DIFile(filename: "libavcodec/snowdata.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 2048, align: 8, elements: !939)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !928, line: 36, baseType: !938)
!938 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!939 = !{!940}
!940 = !DISubrange(count: 256)
!941 = distinct !DIGlobalVariable(name: "ff_obmc_tab", scope: !0, file: !934, line: 123, type: !942, isLocal: false, isDefinition: true, variable: [4 x i8*]* @ff_obmc_tab)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 256, align: 64, elements: !948)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !928, line: 48, baseType: !947)
!947 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!948 = !{!949}
!949 = !DISubrange(count: 4)
!950 = distinct !DIGlobalVariable(name: "ff_qexp", scope: !0, file: !934, line: 128, type: !951, isLocal: false, isDefinition: true, variable: [32 x i8]* @ff_qexp)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, size: 256, align: 8, elements: !952)
!952 = !{!953}
!953 = !DISubrange(count: 32)
!954 = distinct !DIGlobalVariable(name: "ff_scale_mv_ref", scope: !0, file: !934, line: 129, type: !955, isLocal: false, isDefinition: true, variable: [8 x [8 x i32]]* @ff_scale_mv_ref)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 2048, align: 32, elements: !956)
!956 = !{!957, !957}
!957 = !DISubrange(count: 8)
!958 = distinct !DIGlobalVariable(name: "obmc32", scope: !0, file: !934, line: 27, type: !959, isLocal: true, isDefinition: true, variable: [1024 x i8]* @obmc32)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 8192, align: 8, elements: !960)
!960 = !{!961}
!961 = !DISubrange(count: 1024)
!962 = distinct !DIGlobalVariable(name: "obmc16", scope: !0, file: !934, line: 62, type: !963, isLocal: true, isDefinition: true, variable: [256 x i8]* @obmc16)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 2048, align: 8, elements: !939)
!964 = distinct !DIGlobalVariable(name: "obmc8", scope: !0, file: !934, line: 83, type: !965, isLocal: true, isDefinition: true, variable: [64 x i8]* @obmc8)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 512, align: 8, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 64)
!968 = distinct !DIGlobalVariable(name: "obmc4", scope: !0, file: !934, line: 96, type: !969, isLocal: true, isDefinition: true, variable: [16 x i8]* @obmc4)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 128, align: 8, elements: !970)
!970 = !{!971}
!971 = !DISubrange(count: 16)
!972 = distinct !DIGlobalVariable(name: "weight", scope: !973, file: !974, line: 135, type: !965, isLocal: true, isDefinition: true, variable: [64 x i8]* @mc_block.weight)
!973 = distinct !DISubprogram(name: "mc_block", scope: !974, file: !974, line: 134, type: !975, isLocal: true, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1031)
!974 = !DIFile(filename: "libavcodec/snow.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!975 = !DISubroutineType(types: !976)
!976 = !{null, !977, !1030, !944, !930, !930, !930, !930, !930}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "Plane", file: !979, line: 112, baseType: !980)
!979 = !DIFile(filename: "libavcodec/snow.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Plane", file: !979, line: 99, size: 4270400, align: 64, elements: !981)
!981 = !{!982, !983, !984, !1022, !1023, !1025, !1026, !1027, !1028, !1029}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !980, file: !979, line: 100, baseType: !930, size: 32, align: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !980, file: !979, line: 101, baseType: !930, size: 32, align: 32, offset: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "band", scope: !980, file: !979, line: 102, baseType: !985, size: 4270080, align: 64, offset: 64)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 4270080, align: 64, elements: !1021)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubBand", file: !979, line: 97, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SubBand", file: !979, line: 83, size: 133440, align: 64, elements: !988)
!988 = !{!989, !990, !991, !992, !993, !994, !998, !1002, !1003, !1004, !1005, !1015, !1017}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !987, file: !979, line: 84, baseType: !930, size: 32, align: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !987, file: !979, line: 85, baseType: !930, size: 32, align: 32, offset: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !987, file: !979, line: 86, baseType: !930, size: 32, align: 32, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !987, file: !979, line: 87, baseType: !930, size: 32, align: 32, offset: 96)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "qlog", scope: !987, file: !979, line: 88, baseType: !930, size: 32, align: 32, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !987, file: !979, line: 89, baseType: !995, size: 64, align: 64, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "DWTELEM", file: !997, line: 29, baseType: !930)
!997 = !DIFile(filename: "libavcodec/snow_dwt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!998 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !987, file: !979, line: 90, baseType: !999, size: 64, align: 64, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDWTELEM", file: !997, line: 30, baseType: !1001)
!1001 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "buf_x_offset", scope: !987, file: !979, line: 91, baseType: !930, size: 32, align: 32, offset: 320)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "buf_y_offset", scope: !987, file: !979, line: 92, baseType: !930, size: 32, align: 32, offset: 352)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "stride_line", scope: !987, file: !979, line: 93, baseType: !930, size: 32, align: 32, offset: 384)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "x_coeff", scope: !987, file: !979, line: 94, baseType: !1006, size: 64, align: 64, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "x_and_coeff", file: !979, line: 81, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x_and_coeff", file: !979, line: 78, size: 32, align: 16, elements: !1009)
!1009 = !{!1010, !1012}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1008, file: !979, line: 79, baseType: !1011, size: 16, align: 16)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !928, line: 37, baseType: !1001)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "coeff", scope: !1008, file: !979, line: 80, baseType: !1013, size: 16, align: 16, offset: 16)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !928, line: 49, baseType: !1014)
!1014 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !987, file: !979, line: 95, baseType: !1016, size: 64, align: 64, offset: 512)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !987, file: !979, line: 96, baseType: !1018, size: 132864, align: 8, offset: 576)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, size: 132864, align: 8, elements: !1019)
!1019 = !{!1020, !953}
!1020 = !DISubrange(count: 519)
!1021 = !{!957, !949}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "htaps", scope: !980, file: !979, line: 104, baseType: !930, size: 32, align: 32, offset: 4270144)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "hcoeff", scope: !980, file: !979, line: 105, baseType: !1024, size: 32, align: 8, offset: 4270176)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 32, align: 8, elements: !948)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "diag_mc", scope: !980, file: !979, line: 106, baseType: !930, size: 32, align: 32, offset: 4270208)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "fast_mc", scope: !980, file: !979, line: 107, baseType: !930, size: 32, align: 32, offset: 4270240)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "last_htaps", scope: !980, file: !979, line: 109, baseType: !930, size: 32, align: 32, offset: 4270272)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "last_hcoeff", scope: !980, file: !979, line: 110, baseType: !1024, size: 32, align: 8, offset: 4270304)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "last_diag_mc", scope: !980, file: !979, line: 111, baseType: !930, size: 32, align: 32, offset: 4270336)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!1031 = !{}
!1032 = distinct !DIGlobalVariable(name: "brane", scope: !973, file: !974, line: 146, type: !963, isLocal: true, isDefinition: true, variable: [256 x i8]* @mc_block.brane)
!1033 = distinct !DIGlobalVariable(name: "needs", scope: !973, file: !974, line: 165, type: !969, isLocal: true, isDefinition: true, variable: [16 x i8]* @mc_block.needs)
!1034 = !{i32 2, !"Dwarf Version", i32 4}
!1035 = !{i32 2, !"Debug Info Version", i32 3}
!1036 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1037 = distinct !DISubprogram(name: "ff_snow_inner_add_yblock", scope: !974, file: !974, line: 36, type: !1038, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1031)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{null, !944, !1040, !1041, !930, !930, !930, !930, !930, !1042, !930, !1030}
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "slice_buffer", file: !997, line: 52, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice_buffer_s", file: !997, line: 44, size: 320, align: 64, elements: !1045)
!1045 = !{!1046, !1048, !1049, !1050, !1051, !1052, !1053}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !1044, file: !997, line: 45, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "data_stack", scope: !1044, file: !997, line: 46, baseType: !1047, size: 64, align: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "data_stack_top", scope: !1044, file: !997, line: 47, baseType: !930, size: 32, align: 32, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "line_count", scope: !1044, file: !997, line: 48, baseType: !930, size: 32, align: 32, offset: 160)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "line_width", scope: !1044, file: !997, line: 49, baseType: !930, size: 32, align: 32, offset: 192)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "data_count", scope: !1044, file: !997, line: 50, baseType: !930, size: 32, align: 32, offset: 224)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "base_buffer", scope: !1044, file: !997, line: 51, baseType: !999, size: 64, align: 64, offset: 256)
!1054 = !DILocalVariable(name: "obmc", arg: 1, scope: !1037, file: !974, line: 36, type: !944)
!1055 = !DIExpression()
!1056 = !DILocation(line: 36, column: 46, scope: !1037)
!1057 = !DILocalVariable(name: "obmc_stride", arg: 2, scope: !1037, file: !974, line: 36, type: !1040)
!1058 = !DILocation(line: 36, column: 62, scope: !1037)
!1059 = !DILocalVariable(name: "block", arg: 3, scope: !1037, file: !974, line: 36, type: !1041)
!1060 = !DILocation(line: 36, column: 87, scope: !1037)
!1061 = !DILocalVariable(name: "b_w", arg: 4, scope: !1037, file: !974, line: 36, type: !930)
!1062 = !DILocation(line: 36, column: 98, scope: !1037)
!1063 = !DILocalVariable(name: "b_h", arg: 5, scope: !1037, file: !974, line: 36, type: !930)
!1064 = !DILocation(line: 36, column: 107, scope: !1037)
!1065 = !DILocalVariable(name: "src_x", arg: 6, scope: !1037, file: !974, line: 37, type: !930)
!1066 = !DILocation(line: 37, column: 35, scope: !1037)
!1067 = !DILocalVariable(name: "src_y", arg: 7, scope: !1037, file: !974, line: 37, type: !930)
!1068 = !DILocation(line: 37, column: 46, scope: !1037)
!1069 = !DILocalVariable(name: "src_stride", arg: 8, scope: !1037, file: !974, line: 37, type: !930)
!1070 = !DILocation(line: 37, column: 57, scope: !1037)
!1071 = !DILocalVariable(name: "sb", arg: 9, scope: !1037, file: !974, line: 37, type: !1042)
!1072 = !DILocation(line: 37, column: 84, scope: !1037)
!1073 = !DILocalVariable(name: "add", arg: 10, scope: !1037, file: !974, line: 37, type: !930)
!1074 = !DILocation(line: 37, column: 92, scope: !1037)
!1075 = !DILocalVariable(name: "dst8", arg: 11, scope: !1037, file: !974, line: 37, type: !1030)
!1076 = !DILocation(line: 37, column: 107, scope: !1037)
!1077 = !DILocalVariable(name: "y", scope: !1037, file: !974, line: 38, type: !930)
!1078 = !DILocation(line: 38, column: 9, scope: !1037)
!1079 = !DILocalVariable(name: "x", scope: !1037, file: !974, line: 38, type: !930)
!1080 = !DILocation(line: 38, column: 12, scope: !1037)
!1081 = !DILocalVariable(name: "dst", scope: !1037, file: !974, line: 39, type: !999)
!1082 = !DILocation(line: 39, column: 16, scope: !1037)
!1083 = !DILocation(line: 40, column: 10, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1037, file: !974, line: 40, column: 5)
!1085 = !DILocation(line: 40, column: 9, scope: !1084)
!1086 = !DILocation(line: 40, column: 14, scope: !1087)
!1087 = !DILexicalBlockFile(scope: !1088, file: !974, discriminator: 1)
!1088 = distinct !DILexicalBlock(scope: !1084, file: !974, line: 40, column: 5)
!1089 = !DILocation(line: 40, column: 16, scope: !1087)
!1090 = !DILocation(line: 40, column: 15, scope: !1087)
!1091 = !DILocation(line: 40, column: 5, scope: !1087)
!1092 = !DILocalVariable(name: "obmc1", scope: !1093, file: !974, line: 42, type: !944)
!1093 = distinct !DILexicalBlock(scope: !1088, file: !974, line: 40, column: 25)
!1094 = !DILocation(line: 42, column: 24, scope: !1093)
!1095 = !DILocation(line: 42, column: 31, scope: !1093)
!1096 = !DILocation(line: 42, column: 38, scope: !1093)
!1097 = !DILocation(line: 42, column: 40, scope: !1093)
!1098 = !DILocation(line: 42, column: 39, scope: !1093)
!1099 = !DILocation(line: 42, column: 36, scope: !1093)
!1100 = !DILocalVariable(name: "obmc2", scope: !1093, file: !974, line: 43, type: !944)
!1101 = !DILocation(line: 43, column: 24, scope: !1093)
!1102 = !DILocation(line: 43, column: 31, scope: !1093)
!1103 = !DILocation(line: 43, column: 39, scope: !1093)
!1104 = !DILocation(line: 43, column: 50, scope: !1093)
!1105 = !DILocation(line: 43, column: 36, scope: !1093)
!1106 = !DILocalVariable(name: "obmc3", scope: !1093, file: !974, line: 44, type: !944)
!1107 = !DILocation(line: 44, column: 24, scope: !1093)
!1108 = !DILocation(line: 44, column: 31, scope: !1093)
!1109 = !DILocation(line: 44, column: 38, scope: !1093)
!1110 = !DILocation(line: 44, column: 51, scope: !1093)
!1111 = !DILocation(line: 44, column: 62, scope: !1093)
!1112 = !DILocation(line: 44, column: 49, scope: !1093)
!1113 = !DILocation(line: 44, column: 36, scope: !1093)
!1114 = !DILocalVariable(name: "obmc4", scope: !1093, file: !974, line: 45, type: !944)
!1115 = !DILocation(line: 45, column: 24, scope: !1093)
!1116 = !DILocation(line: 45, column: 31, scope: !1093)
!1117 = !DILocation(line: 45, column: 39, scope: !1093)
!1118 = !DILocation(line: 45, column: 50, scope: !1093)
!1119 = !DILocation(line: 45, column: 36, scope: !1093)
!1120 = !DILocation(line: 46, column: 27, scope: !1093)
!1121 = !DILocation(line: 46, column: 35, scope: !1093)
!1122 = !DILocation(line: 46, column: 33, scope: !1093)
!1123 = !DILocation(line: 46, column: 16, scope: !1093)
!1124 = !DILocation(line: 46, column: 17, scope: !1093)
!1125 = !DILocation(line: 46, column: 22, scope: !1093)
!1126 = !DILocation(line: 46, column: 51, scope: !1127)
!1127 = !DILexicalBlockFile(scope: !1093, file: !974, discriminator: 1)
!1128 = !DILocation(line: 46, column: 59, scope: !1127)
!1129 = !DILocation(line: 46, column: 57, scope: !1127)
!1130 = !DILocation(line: 46, column: 40, scope: !1127)
!1131 = !DILocation(line: 46, column: 41, scope: !1127)
!1132 = !DILocation(line: 46, column: 46, scope: !1127)
!1133 = !DILocation(line: 46, column: 16, scope: !1127)
!1134 = !DILocation(line: 46, column: 91, scope: !1135)
!1135 = !DILexicalBlockFile(scope: !1093, file: !974, discriminator: 2)
!1136 = !DILocation(line: 46, column: 97, scope: !1135)
!1137 = !DILocation(line: 46, column: 105, scope: !1135)
!1138 = !DILocation(line: 46, column: 103, scope: !1135)
!1139 = !DILocation(line: 46, column: 64, scope: !1135)
!1140 = !DILocation(line: 46, column: 16, scope: !1135)
!1141 = !DILocation(line: 46, column: 16, scope: !1142)
!1142 = !DILexicalBlockFile(scope: !1093, file: !974, discriminator: 3)
!1143 = !DILocation(line: 46, column: 13, scope: !1142)
!1144 = !DILocation(line: 47, column: 14, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1093, file: !974, line: 47, column: 9)
!1146 = !DILocation(line: 47, column: 13, scope: !1145)
!1147 = !DILocation(line: 47, column: 18, scope: !1148)
!1148 = !DILexicalBlockFile(scope: !1149, file: !974, discriminator: 1)
!1149 = distinct !DILexicalBlock(scope: !1145, file: !974, line: 47, column: 9)
!1150 = !DILocation(line: 47, column: 20, scope: !1148)
!1151 = !DILocation(line: 47, column: 19, scope: !1148)
!1152 = !DILocation(line: 47, column: 9, scope: !1148)
!1153 = !DILocalVariable(name: "v", scope: !1154, file: !974, line: 48, type: !930)
!1154 = distinct !DILexicalBlock(scope: !1149, file: !974, line: 47, column: 29)
!1155 = !DILocation(line: 48, column: 17, scope: !1154)
!1156 = !DILocation(line: 48, column: 26, scope: !1154)
!1157 = !DILocation(line: 48, column: 20, scope: !1154)
!1158 = !DILocation(line: 48, column: 40, scope: !1154)
!1159 = !DILocation(line: 48, column: 44, scope: !1154)
!1160 = !DILocation(line: 48, column: 46, scope: !1154)
!1161 = !DILocation(line: 48, column: 45, scope: !1154)
!1162 = !DILocation(line: 48, column: 42, scope: !1154)
!1163 = !DILocation(line: 48, column: 31, scope: !1154)
!1164 = !DILocation(line: 48, column: 29, scope: !1154)
!1165 = !DILocation(line: 49, column: 28, scope: !1154)
!1166 = !DILocation(line: 49, column: 22, scope: !1154)
!1167 = !DILocation(line: 49, column: 42, scope: !1154)
!1168 = !DILocation(line: 49, column: 46, scope: !1154)
!1169 = !DILocation(line: 49, column: 48, scope: !1154)
!1170 = !DILocation(line: 49, column: 47, scope: !1154)
!1171 = !DILocation(line: 49, column: 44, scope: !1154)
!1172 = !DILocation(line: 49, column: 33, scope: !1154)
!1173 = !DILocation(line: 49, column: 31, scope: !1154)
!1174 = !DILocation(line: 49, column: 21, scope: !1154)
!1175 = !DILocation(line: 50, column: 28, scope: !1154)
!1176 = !DILocation(line: 50, column: 22, scope: !1154)
!1177 = !DILocation(line: 50, column: 42, scope: !1154)
!1178 = !DILocation(line: 50, column: 46, scope: !1154)
!1179 = !DILocation(line: 50, column: 48, scope: !1154)
!1180 = !DILocation(line: 50, column: 47, scope: !1154)
!1181 = !DILocation(line: 50, column: 44, scope: !1154)
!1182 = !DILocation(line: 50, column: 33, scope: !1154)
!1183 = !DILocation(line: 50, column: 31, scope: !1154)
!1184 = !DILocation(line: 50, column: 21, scope: !1154)
!1185 = !DILocation(line: 51, column: 28, scope: !1154)
!1186 = !DILocation(line: 51, column: 22, scope: !1154)
!1187 = !DILocation(line: 51, column: 42, scope: !1154)
!1188 = !DILocation(line: 51, column: 46, scope: !1154)
!1189 = !DILocation(line: 51, column: 48, scope: !1154)
!1190 = !DILocation(line: 51, column: 47, scope: !1154)
!1191 = !DILocation(line: 51, column: 44, scope: !1154)
!1192 = !DILocation(line: 51, column: 33, scope: !1154)
!1193 = !DILocation(line: 51, column: 31, scope: !1154)
!1194 = !DILocation(line: 51, column: 21, scope: !1154)
!1195 = !DILocation(line: 53, column: 15, scope: !1154)
!1196 = !DILocation(line: 55, column: 19, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1198, file: !974, line: 54, column: 23)
!1198 = distinct !DILexicalBlock(scope: !1154, file: !974, line: 54, column: 16)
!1199 = !DILocation(line: 57, column: 16, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1154, file: !974, line: 57, column: 16)
!1201 = !DILocation(line: 57, column: 16, scope: !1154)
!1202 = !DILocation(line: 58, column: 26, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1200, file: !974, line: 57, column: 20)
!1204 = !DILocation(line: 58, column: 30, scope: !1203)
!1205 = !DILocation(line: 58, column: 28, scope: !1203)
!1206 = !DILocation(line: 58, column: 22, scope: !1203)
!1207 = !DILocation(line: 58, column: 19, scope: !1203)
!1208 = !DILocation(line: 59, column: 22, scope: !1203)
!1209 = !DILocation(line: 59, column: 24, scope: !1203)
!1210 = !DILocation(line: 59, column: 39, scope: !1203)
!1211 = !DILocation(line: 59, column: 19, scope: !1203)
!1212 = !DILocation(line: 60, column: 20, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1203, file: !974, line: 60, column: 20)
!1214 = !DILocation(line: 60, column: 21, scope: !1213)
!1215 = !DILocation(line: 60, column: 20, scope: !1203)
!1216 = !DILocation(line: 60, column: 35, scope: !1217)
!1217 = !DILexicalBlockFile(scope: !1213, file: !974, discriminator: 1)
!1218 = !DILocation(line: 60, column: 36, scope: !1217)
!1219 = !DILocation(line: 60, column: 33, scope: !1217)
!1220 = !DILocation(line: 60, column: 31, scope: !1217)
!1221 = !DILocation(line: 60, column: 30, scope: !1217)
!1222 = !DILocation(line: 61, column: 42, scope: !1203)
!1223 = !DILocation(line: 61, column: 22, scope: !1203)
!1224 = !DILocation(line: 61, column: 26, scope: !1203)
!1225 = !DILocation(line: 61, column: 28, scope: !1203)
!1226 = !DILocation(line: 61, column: 27, scope: !1203)
!1227 = !DILocation(line: 61, column: 24, scope: !1203)
!1228 = !DILocation(line: 61, column: 17, scope: !1203)
!1229 = !DILocation(line: 61, column: 40, scope: !1203)
!1230 = !DILocation(line: 62, column: 13, scope: !1203)
!1231 = !DILocation(line: 63, column: 35, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1200, file: !974, line: 62, column: 18)
!1233 = !DILocation(line: 63, column: 21, scope: !1232)
!1234 = !DILocation(line: 63, column: 25, scope: !1232)
!1235 = !DILocation(line: 63, column: 23, scope: !1232)
!1236 = !DILocation(line: 63, column: 17, scope: !1232)
!1237 = !DILocation(line: 63, column: 32, scope: !1232)
!1238 = !DILocation(line: 65, column: 9, scope: !1154)
!1239 = !DILocation(line: 47, column: 26, scope: !1240)
!1240 = !DILexicalBlockFile(scope: !1149, file: !974, discriminator: 2)
!1241 = !DILocation(line: 47, column: 9, scope: !1240)
!1242 = distinct !{!1242, !1243}
!1243 = !DILocation(line: 47, column: 9, scope: !1093)
!1244 = !DILocation(line: 66, column: 5, scope: !1093)
!1245 = !DILocation(line: 40, column: 22, scope: !1246)
!1246 = !DILexicalBlockFile(scope: !1088, file: !974, discriminator: 2)
!1247 = !DILocation(line: 40, column: 5, scope: !1246)
!1248 = distinct !{!1248, !1249}
!1249 = !DILocation(line: 40, column: 5, scope: !1037)
!1250 = !DILocation(line: 67, column: 1, scope: !1037)
!1251 = distinct !DISubprogram(name: "ff_snow_get_buffer", scope: !974, file: !974, line: 69, type: !1252, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1031)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!930, !1254, !1592}
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "SnowContext", file: !979, line: 193, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SnowContext", file: !979, line: 114, size: 17279104, align: 64, elements: !1257)
!1257 = !{!1258, !1341, !2890, !2906, !2907, !2908, !2909, !2910, !2919, !2920, !2934, !2935, !2936, !2938, !2941, !2942, !2943, !2947, !2948, !2949, !2950, !2951, !2952, !2953, !2954, !2955, !2956, !2957, !2958, !2960, !2962, !2963, !2964, !2965, !2966, !2967, !2968, !2969, !2970, !2971, !2972, !2973, !2974, !2975, !2976, !2977, !2978, !2979, !2980, !2981, !2982, !2983, !2984, !2985, !2987, !2999, !3001, !3002, !3003, !3004, !3005, !3006, !3007, !3008, !3009, !3011, !3012, !3013, !3030, !3031, !3032}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1256, file: !979, line: 115, baseType: !1259, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !1261)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !1262)
!1262 = !{!1263, !1267, !1271, !1300, !1301, !1302, !1303, !1307, !1313, !1315, !1319}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1261, file: !26, line: 72, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1266)
!1266 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1261, file: !26, line: 78, baseType: !1268, size: 64, align: 64, offset: 64)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!1264, !931}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1261, file: !26, line: 85, baseType: !1272, size: 64, align: 64, offset: 128)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !1275)
!1275 = !{!1276, !1277, !1278, !1279, !1280, !1296, !1297, !1298, !1299}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1274, file: !4, line: 247, baseType: !1264, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1274, file: !4, line: 253, baseType: !1264, size: 64, align: 64, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1274, file: !4, line: 259, baseType: !930, size: 32, align: 32, offset: 128)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1274, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1274, file: !4, line: 271, baseType: !1281, size: 64, align: 64, offset: 192)
!1281 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1274, file: !4, line: 265, size: 64, align: 64, elements: !1282)
!1282 = !{!1283, !1286, !1288, !1289}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1281, file: !4, line: 266, baseType: !1284, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !928, line: 40, baseType: !1285)
!1285 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1281, file: !4, line: 267, baseType: !1287, size: 64, align: 64)
!1287 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1281, file: !4, line: 268, baseType: !1264, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1281, file: !4, line: 270, baseType: !1290, size: 64, align: 32)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1291, line: 61, baseType: !1292)
!1291 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1291, line: 58, size: 64, align: 32, elements: !1293)
!1293 = !{!1294, !1295}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1292, file: !1291, line: 59, baseType: !930, size: 32, align: 32)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1292, file: !1291, line: 60, baseType: !930, size: 32, align: 32, offset: 32)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1274, file: !4, line: 272, baseType: !1287, size: 64, align: 64, offset: 256)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1274, file: !4, line: 273, baseType: !1287, size: 64, align: 64, offset: 320)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1274, file: !4, line: 275, baseType: !930, size: 32, align: 32, offset: 384)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1274, file: !4, line: 300, baseType: !1264, size: 64, align: 64, offset: 448)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1261, file: !26, line: 93, baseType: !930, size: 32, align: 32, offset: 192)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1261, file: !26, line: 99, baseType: !930, size: 32, align: 32, offset: 224)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1261, file: !26, line: 108, baseType: !930, size: 32, align: 32, offset: 256)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1261, file: !26, line: 113, baseType: !1304, size: 64, align: 64, offset: 320)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DISubroutineType(types: !1306)
!1306 = !{!931, !931, !931}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1261, file: !26, line: 123, baseType: !1308, size: 64, align: 64, offset: 384)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DISubroutineType(types: !1310)
!1310 = !{!1311, !1311}
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1261)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1261, file: !26, line: 130, baseType: !1314, size: 32, align: 32, offset: 448)
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1261, file: !26, line: 136, baseType: !1316, size: 64, align: 64, offset: 512)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{!1314, !931}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1261, file: !26, line: 142, baseType: !1320, size: 64, align: 64, offset: 576)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{!930, !1323, !931, !1264, !930}
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1326)
!1326 = !{!1327, !1339, !1340}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1325, file: !4, line: 360, baseType: !1328, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1331)
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1332)
!1332 = !{!1333, !1334, !1335, !1336, !1337, !1338}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1331, file: !4, line: 307, baseType: !1264, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1331, file: !4, line: 313, baseType: !1287, size: 64, align: 64, offset: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1331, file: !4, line: 313, baseType: !1287, size: 64, align: 64, offset: 128)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1331, file: !4, line: 318, baseType: !1287, size: 64, align: 64, offset: 192)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1331, file: !4, line: 318, baseType: !1287, size: 64, align: 64, offset: 256)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1331, file: !4, line: 323, baseType: !930, size: 32, align: 32, offset: 320)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1325, file: !4, line: 364, baseType: !930, size: 32, align: 32, offset: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1325, file: !4, line: 368, baseType: !930, size: 32, align: 32, offset: 96)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1256, file: !979, line: 116, baseType: !1342, size: 64, align: 64, offset: 64)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1344)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1345)
!1345 = !{!1346, !1349, !1350, !1351, !1604, !1605, !1606, !1607, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1760, !1764, !1765, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !2809, !2810, !2811, !2812, !2813, !2814, !2815, !2816, !2817, !2818, !2819, !2820, !2821, !2828, !2835, !2836, !2837, !2838, !2839, !2840, !2841, !2842, !2843, !2844, !2845, !2846, !2847, !2848, !2849, !2866, !2867, !2868, !2869, !2870, !2871, !2872, !2873, !2874, !2875, !2876, !2877, !2878, !2879, !2880, !2881, !2882, !2883, !2884, !2885, !2886, !2887, !2888, !2889}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1344, file: !57, line: 1561, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1260)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1344, file: !57, line: 1562, baseType: !930, size: 32, align: 32, offset: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1344, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1344, file: !57, line: 1565, baseType: !1352, size: 64, align: 64, offset: 128)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1354)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1355)
!1355 = !{!1356, !1357, !1358, !1359, !1360, !1361, !1364, !1367, !1369, !1372, !1377, !1378, !1379, !1387, !1388, !1389, !1391, !1395, !1401, !1410, !1414, !1415, !1457, !1575, !1579, !1580, !1584, !1588, !1593, !1597, !1598, !1599}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1354, file: !57, line: 3475, baseType: !1264, size: 64, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1354, file: !57, line: 3480, baseType: !1264, size: 64, align: 64, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1354, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1354, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1354, file: !57, line: 3487, baseType: !930, size: 32, align: 32, offset: 192)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1354, file: !57, line: 3488, baseType: !1362, size: 64, align: 64, offset: 256)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1290)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1354, file: !57, line: 3489, baseType: !1365, size: 64, align: 64, offset: 320)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1354, file: !57, line: 3490, baseType: !1368, size: 64, align: 64, offset: 384)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1354, file: !57, line: 3491, baseType: !1370, size: 64, align: 64, offset: 448)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1354, file: !57, line: 3492, baseType: !1373, size: 64, align: 64, offset: 512)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1375)
!1375 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !928, line: 55, baseType: !1376)
!1376 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1354, file: !57, line: 3493, baseType: !946, size: 8, align: 8, offset: 576)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1354, file: !57, line: 3494, baseType: !1347, size: 64, align: 64, offset: 640)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1354, file: !57, line: 3495, baseType: !1380, size: 64, align: 64, offset: 704)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1382)
!1382 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1383)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1384)
!1384 = !{!1385, !1386}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1383, file: !57, line: 3402, baseType: !930, size: 32, align: 32)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1383, file: !57, line: 3403, baseType: !1264, size: 64, align: 64, offset: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1354, file: !57, line: 3507, baseType: !1264, size: 64, align: 64, offset: 768)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1354, file: !57, line: 3516, baseType: !930, size: 32, align: 32, offset: 832)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1354, file: !57, line: 3517, baseType: !1390, size: 64, align: 64, offset: 896)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1354, file: !57, line: 3527, baseType: !1392, size: 64, align: 64, offset: 960)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DISubroutineType(types: !1394)
!1394 = !{!930, !1342}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1354, file: !57, line: 3535, baseType: !1396, size: 64, align: 64, offset: 1024)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DISubroutineType(types: !1398)
!1398 = !{!930, !1342, !1399}
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1343)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1354, file: !57, line: 3541, baseType: !1402, size: 64, align: 64, offset: 1088)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1404)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1405)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1406, line: 223, size: 128, align: 64, elements: !1407)
!1406 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1407 = !{!1408, !1409}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1405, file: !1406, line: 224, baseType: !944, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1405, file: !1406, line: 225, baseType: !944, size: 64, align: 64, offset: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1354, file: !57, line: 3549, baseType: !1411, size: 64, align: 64, offset: 1152)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DISubroutineType(types: !1413)
!1413 = !{null, !1390}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1354, file: !57, line: 3551, baseType: !1392, size: 64, align: 64, offset: 1216)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1354, file: !57, line: 3552, baseType: !1416, size: 64, align: 64, offset: 1280)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DISubroutineType(types: !1418)
!1418 = !{!930, !1342, !1030, !930, !1419}
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1421)
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1422)
!1422 = !{!1423, !1424, !1425, !1426, !1427, !1456}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1421, file: !57, line: 3921, baseType: !1013, size: 16, align: 16)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1421, file: !57, line: 3922, baseType: !927, size: 32, align: 32, offset: 32)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1421, file: !57, line: 3923, baseType: !927, size: 32, align: 32, offset: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1421, file: !57, line: 3924, baseType: !929, size: 32, align: 32, offset: 96)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1421, file: !57, line: 3925, baseType: !1428, size: 64, align: 64, offset: 128)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1431)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1432)
!1432 = !{!1433, !1434, !1435, !1436, !1437, !1438, !1447, !1449, !1451, !1452, !1454, !1455}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1431, file: !57, line: 3886, baseType: !930, size: 32, align: 32)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1431, file: !57, line: 3887, baseType: !930, size: 32, align: 32, offset: 32)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1431, file: !57, line: 3888, baseType: !930, size: 32, align: 32, offset: 64)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1431, file: !57, line: 3889, baseType: !930, size: 32, align: 32, offset: 96)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1431, file: !57, line: 3890, baseType: !930, size: 32, align: 32, offset: 128)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1431, file: !57, line: 3897, baseType: !1439, size: 768, align: 64, offset: 192)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1440)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1441)
!1441 = !{!1442, !1445}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1440, file: !57, line: 3855, baseType: !1443, size: 512, align: 64)
!1443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1030, size: 512, align: 64, elements: !1444)
!1444 = !{!957}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1440, file: !57, line: 3857, baseType: !1446, size: 256, align: 32, offset: 512)
!1446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 256, align: 32, elements: !1444)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1431, file: !57, line: 3903, baseType: !1448, size: 256, align: 64, offset: 960)
!1448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1030, size: 256, align: 64, elements: !948)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1431, file: !57, line: 3904, baseType: !1450, size: 128, align: 32, offset: 1216)
!1450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 128, align: 32, elements: !948)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1431, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1431, file: !57, line: 3908, baseType: !1453, size: 64, align: 64, offset: 1408)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1431, file: !57, line: 3915, baseType: !1453, size: 64, align: 64, offset: 1472)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1431, file: !57, line: 3917, baseType: !930, size: 32, align: 32, offset: 1536)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1421, file: !57, line: 3926, baseType: !1284, size: 64, align: 64, offset: 192)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1354, file: !57, line: 3564, baseType: !1458, size: 64, align: 64, offset: 1344)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DISubroutineType(types: !1460)
!1460 = !{!930, !1342, !1461, !1495, !1574}
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1463)
!1463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1464)
!1464 = !{!1465, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1491, !1492, !1493, !1494}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1463, file: !57, line: 1451, baseType: !1466, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1468, line: 94, baseType: !1469)
!1468 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1468, line: 81, size: 192, align: 64, elements: !1470)
!1470 = !{!1471, !1475, !1476}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1469, file: !1468, line: 82, baseType: !1472, size: 64, align: 64)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1468, line: 73, baseType: !1474)
!1474 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1468, line: 73, flags: DIFlagFwdDecl)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1469, file: !1468, line: 89, baseType: !1030, size: 64, align: 64, offset: 64)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1469, file: !1468, line: 93, baseType: !930, size: 32, align: 32, offset: 128)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1463, file: !57, line: 1461, baseType: !1284, size: 64, align: 64, offset: 64)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1463, file: !57, line: 1467, baseType: !1284, size: 64, align: 64, offset: 128)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1463, file: !57, line: 1468, baseType: !1030, size: 64, align: 64, offset: 192)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1463, file: !57, line: 1469, baseType: !930, size: 32, align: 32, offset: 256)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1463, file: !57, line: 1470, baseType: !930, size: 32, align: 32, offset: 288)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1463, file: !57, line: 1474, baseType: !930, size: 32, align: 32, offset: 320)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1463, file: !57, line: 1479, baseType: !1484, size: 64, align: 64, offset: 384)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1486)
!1486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1487)
!1487 = !{!1488, !1489, !1490}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1486, file: !57, line: 1412, baseType: !1030, size: 64, align: 64)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1486, file: !57, line: 1413, baseType: !930, size: 32, align: 32, offset: 64)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1486, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1463, file: !57, line: 1480, baseType: !930, size: 32, align: 32, offset: 448)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1463, file: !57, line: 1486, baseType: !1284, size: 64, align: 64, offset: 512)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1463, file: !57, line: 1488, baseType: !1284, size: 64, align: 64, offset: 576)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1463, file: !57, line: 1497, baseType: !1284, size: 64, align: 64, offset: 640)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1497)
!1497 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1498)
!1498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1499)
!1499 = !{!1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1528, !1530, !1531, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1562, !1563, !1564, !1565, !1566, !1567, !1570, !1571, !1572, !1573}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1498, file: !780, line: 282, baseType: !1443, size: 512, align: 64)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1498, file: !780, line: 299, baseType: !1446, size: 256, align: 32, offset: 512)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1498, file: !780, line: 315, baseType: !1041, size: 64, align: 64, offset: 768)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1498, file: !780, line: 326, baseType: !930, size: 32, align: 32, offset: 832)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1498, file: !780, line: 326, baseType: !930, size: 32, align: 32, offset: 864)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1498, file: !780, line: 334, baseType: !930, size: 32, align: 32, offset: 896)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1498, file: !780, line: 341, baseType: !930, size: 32, align: 32, offset: 928)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1498, file: !780, line: 346, baseType: !930, size: 32, align: 32, offset: 960)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1498, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1498, file: !780, line: 356, baseType: !1290, size: 64, align: 32, offset: 1024)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1498, file: !780, line: 361, baseType: !1284, size: 64, align: 64, offset: 1088)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1498, file: !780, line: 369, baseType: !1284, size: 64, align: 64, offset: 1152)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1498, file: !780, line: 377, baseType: !1284, size: 64, align: 64, offset: 1216)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1498, file: !780, line: 382, baseType: !930, size: 32, align: 32, offset: 1280)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1498, file: !780, line: 386, baseType: !930, size: 32, align: 32, offset: 1312)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1498, file: !780, line: 391, baseType: !930, size: 32, align: 32, offset: 1344)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1498, file: !780, line: 396, baseType: !931, size: 64, align: 64, offset: 1408)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1498, file: !780, line: 403, baseType: !1518, size: 512, align: 64, offset: 1472)
!1518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1375, size: 512, align: 64, elements: !1444)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1498, file: !780, line: 410, baseType: !930, size: 32, align: 32, offset: 1984)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1498, file: !780, line: 415, baseType: !930, size: 32, align: 32, offset: 2016)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1498, file: !780, line: 420, baseType: !930, size: 32, align: 32, offset: 2048)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1498, file: !780, line: 425, baseType: !930, size: 32, align: 32, offset: 2080)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1498, file: !780, line: 435, baseType: !1284, size: 64, align: 64, offset: 2112)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1498, file: !780, line: 440, baseType: !930, size: 32, align: 32, offset: 2176)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1498, file: !780, line: 445, baseType: !1375, size: 64, align: 64, offset: 2240)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1498, file: !780, line: 459, baseType: !1527, size: 512, align: 64, offset: 2304)
!1527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1466, size: 512, align: 64, elements: !1444)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1498, file: !780, line: 473, baseType: !1529, size: 64, align: 64, offset: 2816)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1498, file: !780, line: 477, baseType: !930, size: 32, align: 32, offset: 2880)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1498, file: !780, line: 479, baseType: !1532, size: 64, align: 64, offset: 2944)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64, align: 64)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64, align: 64)
!1534 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1535)
!1535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1536)
!1536 = !{!1537, !1538, !1539, !1540, !1545}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1535, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1535, file: !780, line: 203, baseType: !1030, size: 64, align: 64, offset: 64)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1535, file: !780, line: 204, baseType: !930, size: 32, align: 32, offset: 128)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1535, file: !780, line: 205, baseType: !1541, size: 64, align: 64, offset: 192)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1543, line: 86, baseType: !1544)
!1543 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1544 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1543, line: 86, flags: DIFlagFwdDecl)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1535, file: !780, line: 206, baseType: !1466, size: 64, align: 64, offset: 256)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1498, file: !780, line: 480, baseType: !930, size: 32, align: 32, offset: 3008)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1498, file: !780, line: 505, baseType: !930, size: 32, align: 32, offset: 3040)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1498, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1498, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1498, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1498, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1498, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1498, file: !780, line: 532, baseType: !1284, size: 64, align: 64, offset: 3264)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1498, file: !780, line: 539, baseType: !1284, size: 64, align: 64, offset: 3328)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1498, file: !780, line: 547, baseType: !1284, size: 64, align: 64, offset: 3392)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1498, file: !780, line: 554, baseType: !1541, size: 64, align: 64, offset: 3456)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1498, file: !780, line: 563, baseType: !930, size: 32, align: 32, offset: 3520)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1498, file: !780, line: 572, baseType: !930, size: 32, align: 32, offset: 3552)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1498, file: !780, line: 581, baseType: !930, size: 32, align: 32, offset: 3584)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1498, file: !780, line: 588, baseType: !1561, size: 64, align: 64, offset: 3648)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1498, file: !780, line: 593, baseType: !930, size: 32, align: 32, offset: 3712)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1498, file: !780, line: 596, baseType: !930, size: 32, align: 32, offset: 3744)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1498, file: !780, line: 599, baseType: !1466, size: 64, align: 64, offset: 3776)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1498, file: !780, line: 605, baseType: !1466, size: 64, align: 64, offset: 3840)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1498, file: !780, line: 616, baseType: !1466, size: 64, align: 64, offset: 3904)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1498, file: !780, line: 626, baseType: !1568, size: 64, align: 64, offset: 3968)
!1568 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1569, line: 216, baseType: !1376)
!1569 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1498, file: !780, line: 627, baseType: !1568, size: 64, align: 64, offset: 4032)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1498, file: !780, line: 628, baseType: !1568, size: 64, align: 64, offset: 4096)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1498, file: !780, line: 629, baseType: !1568, size: 64, align: 64, offset: 4160)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1498, file: !780, line: 645, baseType: !1466, size: 64, align: 64, offset: 4224)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1354, file: !57, line: 3566, baseType: !1576, size: 64, align: 64, offset: 1408)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DISubroutineType(types: !1578)
!1578 = !{!930, !1342, !931, !1574, !1461}
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1354, file: !57, line: 3567, baseType: !1392, size: 64, align: 64, offset: 1472)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1354, file: !57, line: 3576, baseType: !1581, size: 64, align: 64, offset: 1536)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64, align: 64)
!1582 = !DISubroutineType(types: !1583)
!1583 = !{!930, !1342, !1495}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1354, file: !57, line: 3577, baseType: !1585, size: 64, align: 64, offset: 1600)
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1586 = !DISubroutineType(types: !1587)
!1587 = !{!930, !1342, !1461}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1354, file: !57, line: 3584, baseType: !1589, size: 64, align: 64, offset: 1664)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DISubroutineType(types: !1591)
!1591 = !{!930, !1342, !1592}
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1354, file: !57, line: 3589, baseType: !1594, size: 64, align: 64, offset: 1728)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DISubroutineType(types: !1596)
!1596 = !{null, !1342}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1354, file: !57, line: 3594, baseType: !930, size: 32, align: 32, offset: 1792)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1354, file: !57, line: 3600, baseType: !1264, size: 64, align: 64, offset: 1856)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1354, file: !57, line: 3609, baseType: !1600, size: 64, align: 64, offset: 1920)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1603)
!1603 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1344, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1344, file: !57, line: 1581, baseType: !929, size: 32, align: 32, offset: 224)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1344, file: !57, line: 1583, baseType: !931, size: 64, align: 64, offset: 256)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1344, file: !57, line: 1591, baseType: !1608, size: 64, align: 64, offset: 320)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1406, line: 129, size: 1664, align: 64, elements: !1610)
!1610 = !{!1611, !1612, !1613, !1614, !1615, !1633, !1634, !1640, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1609, file: !1406, line: 136, baseType: !930, size: 32, align: 32)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1609, file: !1406, line: 151, baseType: !930, size: 32, align: 32, offset: 32)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1609, file: !1406, line: 157, baseType: !930, size: 32, align: 32, offset: 64)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1609, file: !1406, line: 159, baseType: !1592, size: 64, align: 64, offset: 128)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1609, file: !1406, line: 161, baseType: !1616, size: 64, align: 64, offset: 192)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1406, line: 117, baseType: !1618)
!1618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1406, line: 100, size: 832, align: 64, elements: !1619)
!1619 = !{!1620, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632}
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1618, file: !1406, line: 105, baseType: !1621, size: 256, align: 64)
!1621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1622, size: 256, align: 64, elements: !948)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1468, line: 238, baseType: !1624)
!1624 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1468, line: 238, flags: DIFlagFwdDecl)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1618, file: !1406, line: 110, baseType: !930, size: 32, align: 32, offset: 256)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1618, file: !1406, line: 111, baseType: !930, size: 32, align: 32, offset: 288)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1618, file: !1406, line: 111, baseType: !930, size: 32, align: 32, offset: 320)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1618, file: !1406, line: 112, baseType: !1446, size: 256, align: 32, offset: 352)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1618, file: !1406, line: 113, baseType: !1450, size: 128, align: 32, offset: 608)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1618, file: !1406, line: 114, baseType: !930, size: 32, align: 32, offset: 736)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1618, file: !1406, line: 115, baseType: !930, size: 32, align: 32, offset: 768)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1618, file: !1406, line: 116, baseType: !930, size: 32, align: 32, offset: 800)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1609, file: !1406, line: 163, baseType: !931, size: 64, align: 64, offset: 256)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1609, file: !1406, line: 165, baseType: !1635, size: 128, align: 64, offset: 320)
!1635 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1406, line: 122, baseType: !1636)
!1636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1406, line: 119, size: 128, align: 64, elements: !1637)
!1637 = !{!1638, !1639}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1636, file: !1406, line: 120, baseType: !1461, size: 64, align: 64)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1636, file: !1406, line: 121, baseType: !1592, size: 64, align: 64, offset: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1609, file: !1406, line: 166, baseType: !1641, size: 128, align: 64, offset: 448)
!1641 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1406, line: 127, baseType: !1642)
!1642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1406, line: 124, size: 128, align: 64, elements: !1643)
!1643 = !{!1644, !1717}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1642, file: !1406, line: 125, baseType: !1645, size: 64, align: 64)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1648)
!1648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1649)
!1649 = !{!1650, !1651, !1675, !1679, !1680, !1714, !1715, !1716}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1648, file: !57, line: 5751, baseType: !1347, size: 64, align: 64)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1648, file: !57, line: 5756, baseType: !1652, size: 64, align: 64, offset: 64)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1654)
!1654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1655)
!1655 = !{!1656, !1657, !1660, !1661, !1662, !1666, !1670, !1674}
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1654, file: !57, line: 5797, baseType: !1264, size: 64, align: 64)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1654, file: !57, line: 5804, baseType: !1658, size: 64, align: 64, offset: 64)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1654, file: !57, line: 5815, baseType: !1347, size: 64, align: 64, offset: 128)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1654, file: !57, line: 5825, baseType: !930, size: 32, align: 32, offset: 192)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1654, file: !57, line: 5826, baseType: !1663, size: 64, align: 64, offset: 256)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DISubroutineType(types: !1665)
!1665 = !{!930, !1646}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1654, file: !57, line: 5827, baseType: !1667, size: 64, align: 64, offset: 320)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DISubroutineType(types: !1669)
!1669 = !{!930, !1646, !1461}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1654, file: !57, line: 5828, baseType: !1671, size: 64, align: 64, offset: 384)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DISubroutineType(types: !1673)
!1673 = !{null, !1646}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1654, file: !57, line: 5829, baseType: !1671, size: 64, align: 64, offset: 448)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1648, file: !57, line: 5762, baseType: !1676, size: 64, align: 64, offset: 128)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1678)
!1678 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1648, file: !57, line: 5768, baseType: !931, size: 64, align: 64, offset: 192)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1648, file: !57, line: 5775, baseType: !1681, size: 64, align: 64, offset: 256)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1683)
!1683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1684)
!1684 = !{!1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713}
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1683, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1683, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1683, file: !57, line: 3948, baseType: !927, size: 32, align: 32, offset: 64)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1683, file: !57, line: 3958, baseType: !1030, size: 64, align: 64, offset: 128)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1683, file: !57, line: 3962, baseType: !930, size: 32, align: 32, offset: 192)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1683, file: !57, line: 3968, baseType: !930, size: 32, align: 32, offset: 224)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1683, file: !57, line: 3973, baseType: !1284, size: 64, align: 64, offset: 256)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1683, file: !57, line: 3986, baseType: !930, size: 32, align: 32, offset: 320)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1683, file: !57, line: 3999, baseType: !930, size: 32, align: 32, offset: 352)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1683, file: !57, line: 4004, baseType: !930, size: 32, align: 32, offset: 384)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1683, file: !57, line: 4005, baseType: !930, size: 32, align: 32, offset: 416)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1683, file: !57, line: 4010, baseType: !930, size: 32, align: 32, offset: 448)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1683, file: !57, line: 4011, baseType: !930, size: 32, align: 32, offset: 480)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1683, file: !57, line: 4020, baseType: !1290, size: 64, align: 32, offset: 512)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1683, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1683, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1683, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1683, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1683, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1683, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1683, file: !57, line: 4039, baseType: !930, size: 32, align: 32, offset: 768)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1683, file: !57, line: 4046, baseType: !1375, size: 64, align: 64, offset: 832)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1683, file: !57, line: 4050, baseType: !930, size: 32, align: 32, offset: 896)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1683, file: !57, line: 4054, baseType: !930, size: 32, align: 32, offset: 928)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1683, file: !57, line: 4061, baseType: !930, size: 32, align: 32, offset: 960)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1683, file: !57, line: 4065, baseType: !930, size: 32, align: 32, offset: 992)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1683, file: !57, line: 4073, baseType: !930, size: 32, align: 32, offset: 1024)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1683, file: !57, line: 4080, baseType: !930, size: 32, align: 32, offset: 1056)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1683, file: !57, line: 4084, baseType: !930, size: 32, align: 32, offset: 1088)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1648, file: !57, line: 5781, baseType: !1681, size: 64, align: 64, offset: 320)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1648, file: !57, line: 5787, baseType: !1290, size: 64, align: 32, offset: 384)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1648, file: !57, line: 5793, baseType: !1290, size: 64, align: 32, offset: 448)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1642, file: !1406, line: 126, baseType: !930, size: 32, align: 32, offset: 64)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1609, file: !1406, line: 172, baseType: !1461, size: 64, align: 64, offset: 576)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1609, file: !1406, line: 177, baseType: !1030, size: 64, align: 64, offset: 640)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1609, file: !1406, line: 178, baseType: !929, size: 32, align: 32, offset: 704)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1609, file: !1406, line: 180, baseType: !931, size: 64, align: 64, offset: 768)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1609, file: !1406, line: 185, baseType: !930, size: 32, align: 32, offset: 832)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1609, file: !1406, line: 190, baseType: !931, size: 64, align: 64, offset: 896)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1609, file: !1406, line: 195, baseType: !930, size: 32, align: 32, offset: 960)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1609, file: !1406, line: 200, baseType: !1461, size: 64, align: 64, offset: 1024)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1609, file: !1406, line: 201, baseType: !930, size: 32, align: 32, offset: 1088)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1609, file: !1406, line: 202, baseType: !1592, size: 64, align: 64, offset: 1152)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1609, file: !1406, line: 203, baseType: !930, size: 32, align: 32, offset: 1216)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1609, file: !1406, line: 205, baseType: !930, size: 32, align: 32, offset: 1248)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1609, file: !1406, line: 206, baseType: !930, size: 32, align: 32, offset: 1280)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1609, file: !1406, line: 209, baseType: !1568, size: 64, align: 64, offset: 1344)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1609, file: !1406, line: 212, baseType: !1568, size: 64, align: 64, offset: 1408)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1609, file: !1406, line: 213, baseType: !1592, size: 64, align: 64, offset: 1472)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1609, file: !1406, line: 215, baseType: !930, size: 32, align: 32, offset: 1536)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1609, file: !1406, line: 217, baseType: !930, size: 32, align: 32, offset: 1568)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1609, file: !1406, line: 220, baseType: !930, size: 32, align: 32, offset: 1600)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1344, file: !57, line: 1598, baseType: !931, size: 64, align: 64, offset: 384)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1344, file: !57, line: 1606, baseType: !1284, size: 64, align: 64, offset: 448)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1344, file: !57, line: 1614, baseType: !930, size: 32, align: 32, offset: 512)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1344, file: !57, line: 1622, baseType: !930, size: 32, align: 32, offset: 544)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1344, file: !57, line: 1628, baseType: !930, size: 32, align: 32, offset: 576)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1344, file: !57, line: 1636, baseType: !930, size: 32, align: 32, offset: 608)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1344, file: !57, line: 1643, baseType: !930, size: 32, align: 32, offset: 640)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1344, file: !57, line: 1657, baseType: !1030, size: 64, align: 64, offset: 704)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1344, file: !57, line: 1658, baseType: !930, size: 32, align: 32, offset: 768)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1344, file: !57, line: 1679, baseType: !1290, size: 64, align: 32, offset: 800)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1344, file: !57, line: 1688, baseType: !930, size: 32, align: 32, offset: 864)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1344, file: !57, line: 1712, baseType: !930, size: 32, align: 32, offset: 896)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1344, file: !57, line: 1729, baseType: !930, size: 32, align: 32, offset: 928)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1344, file: !57, line: 1729, baseType: !930, size: 32, align: 32, offset: 960)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1344, file: !57, line: 1744, baseType: !930, size: 32, align: 32, offset: 992)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1344, file: !57, line: 1744, baseType: !930, size: 32, align: 32, offset: 1024)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1344, file: !57, line: 1751, baseType: !930, size: 32, align: 32, offset: 1056)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1344, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1344, file: !57, line: 1791, baseType: !1756, size: 64, align: 64, offset: 1152)
!1756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1757, size: 64, align: 64)
!1757 = !DISubroutineType(types: !1758)
!1758 = !{null, !1759, !1495, !1574, !930, !930, !930}
!1759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1344, file: !57, line: 1808, baseType: !1761, size: 64, align: 64, offset: 1216)
!1761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1762, size: 64, align: 64)
!1762 = !DISubroutineType(types: !1763)
!1763 = !{!516, !1759, !1365}
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1344, file: !57, line: 1816, baseType: !930, size: 32, align: 32, offset: 1280)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1344, file: !57, line: 1825, baseType: !1766, size: 32, align: 32, offset: 1312)
!1766 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1344, file: !57, line: 1830, baseType: !930, size: 32, align: 32, offset: 1344)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1344, file: !57, line: 1838, baseType: !1766, size: 32, align: 32, offset: 1376)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1344, file: !57, line: 1846, baseType: !930, size: 32, align: 32, offset: 1408)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1344, file: !57, line: 1851, baseType: !930, size: 32, align: 32, offset: 1440)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1344, file: !57, line: 1861, baseType: !1766, size: 32, align: 32, offset: 1472)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1344, file: !57, line: 1868, baseType: !1766, size: 32, align: 32, offset: 1504)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1344, file: !57, line: 1875, baseType: !1766, size: 32, align: 32, offset: 1536)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1344, file: !57, line: 1882, baseType: !1766, size: 32, align: 32, offset: 1568)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1344, file: !57, line: 1889, baseType: !1766, size: 32, align: 32, offset: 1600)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1344, file: !57, line: 1896, baseType: !1766, size: 32, align: 32, offset: 1632)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1344, file: !57, line: 1903, baseType: !1766, size: 32, align: 32, offset: 1664)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1344, file: !57, line: 1910, baseType: !930, size: 32, align: 32, offset: 1696)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1344, file: !57, line: 1915, baseType: !930, size: 32, align: 32, offset: 1728)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1344, file: !57, line: 1926, baseType: !1574, size: 64, align: 64, offset: 1792)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1344, file: !57, line: 1935, baseType: !1290, size: 64, align: 32, offset: 1856)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1344, file: !57, line: 1942, baseType: !930, size: 32, align: 32, offset: 1920)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1344, file: !57, line: 1948, baseType: !930, size: 32, align: 32, offset: 1952)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1344, file: !57, line: 1954, baseType: !930, size: 32, align: 32, offset: 1984)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1344, file: !57, line: 1960, baseType: !930, size: 32, align: 32, offset: 2016)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1344, file: !57, line: 1984, baseType: !930, size: 32, align: 32, offset: 2048)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1344, file: !57, line: 1991, baseType: !930, size: 32, align: 32, offset: 2080)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1344, file: !57, line: 1996, baseType: !930, size: 32, align: 32, offset: 2112)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1344, file: !57, line: 2004, baseType: !930, size: 32, align: 32, offset: 2144)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1344, file: !57, line: 2011, baseType: !930, size: 32, align: 32, offset: 2176)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1344, file: !57, line: 2018, baseType: !930, size: 32, align: 32, offset: 2208)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1344, file: !57, line: 2027, baseType: !930, size: 32, align: 32, offset: 2240)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1344, file: !57, line: 2034, baseType: !930, size: 32, align: 32, offset: 2272)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1344, file: !57, line: 2044, baseType: !930, size: 32, align: 32, offset: 2304)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1344, file: !57, line: 2054, baseType: !1796, size: 64, align: 64, offset: 2368)
!1796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1344, file: !57, line: 2061, baseType: !1796, size: 64, align: 64, offset: 2432)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1344, file: !57, line: 2066, baseType: !930, size: 32, align: 32, offset: 2496)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1344, file: !57, line: 2070, baseType: !930, size: 32, align: 32, offset: 2528)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1344, file: !57, line: 2078, baseType: !930, size: 32, align: 32, offset: 2560)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1344, file: !57, line: 2085, baseType: !930, size: 32, align: 32, offset: 2592)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1344, file: !57, line: 2092, baseType: !930, size: 32, align: 32, offset: 2624)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1344, file: !57, line: 2099, baseType: !930, size: 32, align: 32, offset: 2656)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1344, file: !57, line: 2106, baseType: !930, size: 32, align: 32, offset: 2688)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1344, file: !57, line: 2113, baseType: !930, size: 32, align: 32, offset: 2720)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1344, file: !57, line: 2120, baseType: !930, size: 32, align: 32, offset: 2752)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1344, file: !57, line: 2125, baseType: !930, size: 32, align: 32, offset: 2784)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1344, file: !57, line: 2133, baseType: !930, size: 32, align: 32, offset: 2816)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1344, file: !57, line: 2140, baseType: !930, size: 32, align: 32, offset: 2848)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1344, file: !57, line: 2145, baseType: !930, size: 32, align: 32, offset: 2880)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1344, file: !57, line: 2153, baseType: !930, size: 32, align: 32, offset: 2912)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1344, file: !57, line: 2158, baseType: !930, size: 32, align: 32, offset: 2944)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1344, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1344, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1344, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1344, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1344, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1344, file: !57, line: 2203, baseType: !930, size: 32, align: 32, offset: 3136)
