; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--x86--lpc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--x86--lpc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.LPCContext = type { i32, i32, i32, double*, double*, void (i32*, i32, double*)*, void (double*, i32, i32, double*)*, [16 x i8], [2 x %struct.LLSModel] }
%struct.LLSModel = type { [36 x [36 x double]], [32 x [32 x double]], [32 x double], i32, void (%struct.LLSModel*, double*)*, double (%struct.LLSModel*, double*, i32)*, [8 x i8] }

@pd_1 = internal constant [2 x double] [double 1.000000e+00, double 1.000000e+00], align 16
@pd_2 = internal constant [2 x double] [double 2.000000e+00, double 2.000000e+00], align 16
@llvm.used = appending global [2 x i8*] [i8* bitcast ([2 x double]* @pd_1 to i8*), i8* bitcast ([2 x double]* @pd_2 to i8*)], section "llvm.metadata"

; Function Attrs: cold nounwind optsize uwtable
define void @ff_lpc_init_x86(%struct.LPCContext* %c) #0 !dbg !30 {
entry:
  %c.addr = alloca %struct.LPCContext*, align 8
  %cpu_flags = alloca i32, align 4
  store %struct.LPCContext* %c, %struct.LPCContext** %c.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.LPCContext** %c.addr, metadata !84, metadata !85), !dbg !86

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !12, globals: !18)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--x86--lpc.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FFLPCType", file: !4, line: 43, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavcodec/lpc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!5 = !{!6, !7, !8, !9, !10, !11}
!6 = !DIEnumerator(name: "FF_LPC_TYPE_DEFAULT", value: -1)
!7 = !DIEnumerator(name: "FF_LPC_TYPE_NONE", value: 0)
!8 = !DIEnumerator(name: "FF_LPC_TYPE_FIXED", value: 1)
!9 = !DIEnumerator(name: "FF_LPC_TYPE_LEVINSON", value: 2)
!10 = !DIEnumerator(name: "FF_LPC_TYPE_CHOLESKY", value: 3)
!11 = !DIEnumerator(name: "FF_LPC_TYPE_NB", value: 4)
!12 = !{!13}
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "x86_reg", file: !14, line: 39, baseType: !15)
!14 = !DIFile(filename: "./libavutil/x86/asm.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !16, line: 40, baseType: !17)
!16 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !{!19, !26}
!19 = distinct !DIGlobalVariable(name: "pd_1", scope: !0, file: !20, line: 29, type: !21, isLocal: true, isDefinition: true, variable: [2 x double]* @pd_1)
!20 = !DIFile(filename: "libavcodec/x86/lpc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, align: 64, elements: !24)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!23 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!24 = !{!25}
!25 = !DISubrange(count: 2)
!26 = distinct !DIGlobalVariable(name: "pd_2", scope: !0, file: !20, line: 30, type: !21, isLocal: true, isDefinition: true, variable: [2 x double]* @pd_2)
!27 = !{i32 2, !"Dwarf Version", i32 4}
!28 = !{i32 2, !"Debug Info Version", i32 3}
!29 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!30 = distinct !DISubprogram(name: "ff_lpc_init_x86", scope: !20, file: !20, line: 152, type: !31, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !83)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !33}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "LPCContext", file: !4, line: 87, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LPCContext", file: !4, line: 52, size: 302080, align: 256, elements: !36)
!36 = !{!37, !39, !40, !41, !43, !44, !51, !56}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "blocksize", scope: !35, file: !4, line: 53, baseType: !38, size: 32, align: 32)
!38 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "max_order", scope: !35, file: !4, line: 54, baseType: !38, size: 32, align: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "lpc_type", scope: !35, file: !4, line: 55, baseType: !3, size: 32, align: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "windowed_buffer", scope: !35, file: !4, line: 56, baseType: !42, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "windowed_samples", scope: !35, file: !4, line: 57, baseType: !42, size: 64, align: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "lpc_apply_welch_window", scope: !35, file: !4, line: 67, baseType: !45, size: 64, align: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !48, !38, !42}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !16, line: 38, baseType: !38)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "lpc_compute_autocorr", scope: !35, file: !4, line: 82, baseType: !52, size: 64, align: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55, !38, !38, !42}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "lls_models", scope: !35, file: !4, line: 86, baseType: !57, size: 301568, align: 256, offset: 512)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 301568, align: 256, elements: !24)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLSModel", file: !59, line: 58, baseType: !60)
!59 = !DIFile(filename: "./libavutil/lls.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LLSModel", file: !59, line: 38, size: 150784, align: 256, elements: !61)
!61 = !{!62, !66, !70, !73, !74, !79}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "covariance", scope: !60, file: !59, line: 39, baseType: !63, size: 82944, align: 64)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 82944, align: 64, elements: !64)
!64 = !{!65, !65}
!65 = !DISubrange(count: 36)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "coeff", scope: !60, file: !59, line: 40, baseType: !67, size: 65536, align: 64, offset: 82944)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 65536, align: 64, elements: !68)
!68 = !{!69, !69}
!69 = !DISubrange(count: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "variance", scope: !60, file: !59, line: 41, baseType: !71, size: 2048, align: 64, offset: 148480)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 2048, align: 64, elements: !72)
!72 = !{!69}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "indep_count", scope: !60, file: !59, line: 42, baseType: !38, size: 32, align: 32, offset: 150528)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "update_lls", scope: !60, file: !59, line: 50, baseType: !75, size: 64, align: 64, offset: 150592)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !78, !55}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "evaluate_lls", scope: !60, file: !59, line: 57, baseType: !80, size: 64, align: 64, offset: 150656)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!23, !78, !55, !38}
!83 = !{}
!84 = !DILocalVariable(name: "c", arg: 1, scope: !30, file: !20, line: 152, type: !33)
!85 = !DIExpression()
!86 = !DILocation(line: 152, column: 56, scope: !30)
!87 = !DILocalVariable(name: "cpu_flags", scope: !30, file: !20, line: 155, type: !38)
!88 = !DILocation(line: 155, column: 9, scope: !30)
!89 = !DILocation(line: 155, column: 21, scope: !30)
!90 = !DILocation(line: 157, column: 17, scope: !91)
!91 = distinct !DILexicalBlock(scope: !30, file: !20, line: 157, column: 9)
!92 = !DILocation(line: 157, column: 28, scope: !91)
!93 = !DILocation(line: 157, column: 39, scope: !91)
!94 = !DILocation(line: 157, column: 50, scope: !95)
!95 = !DILexicalBlockFile(scope: !91, file: !20, discriminator: 1)
!96 = !DILocation(line: 157, column: 61, scope: !95)
!97 = !DILocation(line: 157, column: 71, scope: !95)
!98 = !DILocation(line: 157, column: 76, scope: !99)
!99 = !DILexicalBlockFile(scope: !91, file: !20, discriminator: 2)
!100 = !DILocation(line: 157, column: 87, scope: !99)
!101 = !DILocation(line: 157, column: 9, scope: !99)
!102 = !DILocation(line: 158, column: 9, scope: !103)
!103 = distinct !DILexicalBlock(scope: !91, file: !20, line: 157, column: 103)
!104 = !DILocation(line: 158, column: 12, scope: !103)
!105 = !DILocation(line: 158, column: 35, scope: !103)
!106 = !DILocation(line: 159, column: 9, scope: !103)
!107 = !DILocation(line: 159, column: 12, scope: !103)
!108 = !DILocation(line: 159, column: 33, scope: !103)
!109 = !DILocation(line: 160, column: 5, scope: !103)
!110 = !DILocation(line: 162, column: 1, scope: !30)
!111 = distinct !DISubprogram(name: "lpc_apply_welch_window_sse2", scope: !20, file: !20, line: 34, type: !46, isLocal: true, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !83)
!112 = !DILocalVariable(name: "data", arg: 1, scope: !111, file: !20, line: 34, type: !48)
!113 = !DILocation(line: 34, column: 56, scope: !111)
!114 = !DILocalVariable(name: "len", arg: 2, scope: !111, file: !20, line: 34, type: !38)
!115 = !DILocation(line: 34, column: 66, scope: !111)
!116 = !DILocalVariable(name: "w_data", arg: 3, scope: !111, file: !20, line: 35, type: !42)
!117 = !DILocation(line: 35, column: 49, scope: !111)
!118 = !DILocalVariable(name: "c", scope: !111, file: !20, line: 37, type: !23)
!119 = !DILocation(line: 37, column: 12, scope: !111)
!120 = !DILocation(line: 37, column: 23, scope: !111)
!121 = !DILocation(line: 37, column: 26, scope: !111)
!122 = !DILocation(line: 37, column: 20, scope: !111)
!123 = !DILocalVariable(name: "n2", scope: !111, file: !20, line: 38, type: !38)
!124 = !DILocation(line: 38, column: 9, scope: !111)
!125 = !DILocation(line: 38, column: 14, scope: !111)
!126 = !DILocation(line: 38, column: 17, scope: !111)
!127 = !DILocalVariable(name: "i", scope: !111, file: !20, line: 39, type: !13)
!128 = !DILocation(line: 39, column: 13, scope: !111)
!129 = !DILocation(line: 39, column: 18, scope: !111)
!130 = !DILocation(line: 39, column: 17, scope: !111)
!131 = !DILocation(line: 39, column: 20, scope: !111)
!132 = !DILocalVariable(name: "j", scope: !111, file: !20, line: 40, type: !13)
!133 = !DILocation(line: 40, column: 13, scope: !111)
!134 = !DILocation(line: 40, column: 17, scope: !111)
!135 = !DILocation(line: 40, column: 19, scope: !111)
!136 = !DILocation(line: 41, column: 5, scope: !111)
!137 = !DILocation(line: 74, column: 14, scope: !111)
!138 = !DILocation(line: 74, column: 21, scope: !111)
!139 = !DILocation(line: 74, column: 20, scope: !111)
!140 = !DILocation(line: 74, column: 30, scope: !111)
!141 = !DILocation(line: 74, column: 35, scope: !111)
!142 = !DILocation(line: 74, column: 34, scope: !111)
