; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--jpeg2000.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--jpeg2000.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Jpeg2000T1Context = type { [6144 x i32], [6156 x i16], %struct.MqcState, i32 }
%struct.MqcState = type { i8*, i8*, i32, i32, i32, [19 x i8], i32 }
%struct.Jpeg2000Component = type { %struct.Jpeg2000ResLevel*, %struct.DWTContext, float*, i32*, [2 x [2 x i32]], [2 x [2 x i32]] }
%struct.Jpeg2000ResLevel = type { i8, [2 x [2 x i32]], i32, i32, i8, i8, %struct.Jpeg2000Band* }
%struct.Jpeg2000Band = type { [2 x [2 x i32]], i16, i16, i32, float, %struct.Jpeg2000Prec* }
%struct.Jpeg2000Prec = type { i32, i32, %struct.Jpeg2000TgtNode*, %struct.Jpeg2000TgtNode*, %struct.Jpeg2000Cblk*, i32, [2 x [2 x i32]] }
%struct.Jpeg2000TgtNode = type { i8, i8, %struct.Jpeg2000TgtNode* }
%struct.Jpeg2000Cblk = type { i8, i8, i8, i16, i16*, i8, i8, i8*, i64, i32, i32, i32*, %struct.Jpeg2000Pass*, [2 x [2 x i32]] }
%struct.Jpeg2000Pass = type { i16, i64, [4 x i8], i32 }
%struct.DWTContext = type { [32 x [2 x i32]], [32 x [2 x i8]], i8, i8, i32*, float* }
%struct.Jpeg2000CodingStyle = type { i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, [34 x i8], [34 x i8] }
%struct.Jpeg2000QuantStyle = type { [99 x i8], [99 x i16], i8, i8 }

!1176 = distinct !DILexicalBlock(scope: !1134, file: !907, line: 134, column: 13)
!1177 = !DILocation(line: 134, column: 15, scope: !1176)
!1178 = !DILocation(line: 134, column: 14, scope: !1176)
!1179 = !DILocation(line: 134, column: 17, scope: !1176)
!1180 = !DILocation(line: 134, column: 13, scope: !1134)
!1181 = !DILocation(line: 134, column: 23, scope: !1182)
!1182 = !DILexicalBlockFile(scope: !1176, file: !907, discriminator: 1)
!1183 = !DILocation(line: 135, column: 13, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1134, file: !907, line: 135, column: 13)
!1185 = !DILocation(line: 135, column: 15, scope: !1184)
!1186 = !DILocation(line: 135, column: 14, scope: !1184)
!1187 = !DILocation(line: 135, column: 17, scope: !1184)
!1188 = !DILocation(line: 135, column: 13, scope: !1134)
!1189 = !DILocation(line: 135, column: 23, scope: !1190)
!1190 = !DILexicalBlockFile(scope: !1184, file: !907, discriminator: 1)
!1191 = !DILocation(line: 137, column: 5, scope: !1014)
!1192 = !DILocation(line: 138, column: 1, scope: !1014)
!1193 = distinct !DISubprogram(name: "getsgnctxno", scope: !907, file: !907, line: 146, type: !1194, isLocal: true, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !932)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!895, !895, !1196}
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!1197 = !DILocalVariable(name: "flag", arg: 1, scope: !1193, file: !907, line: 146, type: !895)
!1198 = !DILocation(line: 146, column: 28, scope: !1193)
!1199 = !DILocalVariable(name: "xorbit", arg: 2, scope: !1193, file: !907, line: 146, type: !1196)
!1200 = !DILocation(line: 146, column: 43, scope: !1193)
!1201 = !DILocalVariable(name: "vcontrib", scope: !1193, file: !907, line: 148, type: !895)
!1202 = !DILocation(line: 148, column: 9, scope: !1193)
!1203 = !DILocalVariable(name: "hcontrib", scope: !1193, file: !907, line: 148, type: !895)
!1204 = !DILocation(line: 148, column: 19, scope: !1193)
!1205 = !DILocation(line: 151, column: 27, scope: !1193)
!1206 = !DILocation(line: 151, column: 32, scope: !1193)
!1207 = !DILocation(line: 151, column: 43, scope: !1208)
!1208 = !DILexicalBlockFile(scope: !1193, file: !907, discriminator: 1)
!1209 = !DILocation(line: 151, column: 48, scope: !1208)
!1210 = !DILocation(line: 151, column: 27, scope: !1208)
!1211 = !DILocation(line: 151, column: 27, scope: !1212)
!1212 = !DILexicalBlockFile(scope: !1193, file: !907, discriminator: 2)
!1213 = !DILocation(line: 151, column: 27, scope: !1214)
!1214 = !DILexicalBlockFile(scope: !1193, file: !907, discriminator: 3)
!1215 = !DILocation(line: 150, column: 16, scope: !1193)
!1216 = !DILocation(line: 150, column: 27, scope: !1193)
!1217 = !DILocation(line: 150, column: 32, scope: !1193)
!1218 = !DILocation(line: 150, column: 43, scope: !1208)
!1219 = !DILocation(line: 150, column: 48, scope: !1208)
!1220 = !DILocation(line: 150, column: 27, scope: !1208)
!1221 = !DILocation(line: 150, column: 27, scope: !1212)
!1222 = !DILocation(line: 150, column: 27, scope: !1214)
!1223 = !DILocation(line: 150, column: 16, scope: !1214)
!1224 = !DILocation(line: 151, column: 70, scope: !1225)
!1225 = !DILexicalBlockFile(scope: !1193, file: !907, discriminator: 4)
!1226 = !DILocation(line: 150, column: 14, scope: !1214)
!1227 = !DILocation(line: 153, column: 27, scope: !1193)
!1228 = !DILocation(line: 153, column: 32, scope: !1193)
!1229 = !DILocation(line: 153, column: 43, scope: !1208)
!1230 = !DILocation(line: 153, column: 48, scope: !1208)
!1231 = !DILocation(line: 153, column: 27, scope: !1208)
!1232 = !DILocation(line: 153, column: 27, scope: !1212)
!1233 = !DILocation(line: 153, column: 27, scope: !1214)
!1234 = !DILocation(line: 152, column: 16, scope: !1193)
!1235 = !DILocation(line: 152, column: 27, scope: !1193)
!1236 = !DILocation(line: 152, column: 32, scope: !1193)
!1237 = !DILocation(line: 152, column: 43, scope: !1208)
!1238 = !DILocation(line: 152, column: 48, scope: !1208)
!1239 = !DILocation(line: 152, column: 27, scope: !1208)
!1240 = !DILocation(line: 152, column: 27, scope: !1212)
!1241 = !DILocation(line: 152, column: 27, scope: !1214)
!1242 = !DILocation(line: 152, column: 16, scope: !1214)
!1243 = !DILocation(line: 153, column: 70, scope: !1225)
!1244 = !DILocation(line: 152, column: 14, scope: !1214)
!1245 = !DILocation(line: 154, column: 35, scope: !1193)
!1246 = !DILocation(line: 154, column: 15, scope: !1193)
!1247 = !DILocation(line: 154, column: 25, scope: !1193)
!1248 = !DILocation(line: 154, column: 6, scope: !1193)
!1249 = !DILocation(line: 154, column: 13, scope: !1193)
!1250 = !DILocation(line: 156, column: 32, scope: !1193)
!1251 = !DILocation(line: 156, column: 12, scope: !1193)
!1252 = !DILocation(line: 156, column: 22, scope: !1193)
!1253 = !DILocation(line: 156, column: 5, scope: !1193)
!1254 = distinct !DISubprogram(name: "ff_jpeg2000_set_significance", scope: !907, file: !907, line: 171, type: !1255, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !932)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{null, !1257, !895, !895, !895}
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jpeg2000T1Context", file: !1259, line: 126, baseType: !1260)
!1259 = !DIFile(filename: "libavcodec/jpeg2000.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Jpeg2000T1Context", file: !1259, line: 121, size: 295616, align: 64, elements: !1261)
!1261 = !{!1262, !1266, !1272, !1287}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1260, file: !1259, line: 122, baseType: !1263, size: 196608, align: 32)
!1263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 196608, align: 32, elements: !1264)
!1264 = !{!1265}
!1265 = !DISubrange(count: 6144)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1260, file: !1259, line: 123, baseType: !1267, size: 98496, align: 16, offset: 196608)
!1267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1268, size: 98496, align: 16, elements: !1270)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !898, line: 49, baseType: !1269)
!1269 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1270 = !{!1271}
!1271 = !DISubrange(count: 6156)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "mqc", scope: !1260, file: !1259, line: 124, baseType: !1273, size: 448, align: 64, offset: 295104)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "MqcState", file: !1274, line: 47, baseType: !1275)
!1274 = !DIFile(filename: "libavcodec/mqc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MqcState", file: !1274, line: 40, size: 448, align: 64, elements: !1276)
!1276 = !{!1277, !1278, !1279, !1280, !1281, !1282, !1286}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "bp", scope: !1275, file: !1274, line: 41, baseType: !1196, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "bpstart", scope: !1275, file: !1274, line: 41, baseType: !1196, size: 64, align: 64, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1275, file: !1274, line: 42, baseType: !896, size: 32, align: 32, offset: 128)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1275, file: !1274, line: 43, baseType: !896, size: 32, align: 32, offset: 160)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !1275, file: !1274, line: 44, baseType: !896, size: 32, align: 32, offset: 192)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "cx_states", scope: !1275, file: !1274, line: 45, baseType: !1283, size: 152, align: 8, offset: 224)
!1283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 152, align: 8, elements: !1284)
!1284 = !{!1285}
!1285 = !DISubrange(count: 19)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !1275, file: !1274, line: 46, baseType: !895, size: 32, align: 32, offset: 384)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !1260, file: !1259, line: 125, baseType: !895, size: 32, align: 32, offset: 295552)
!1288 = !DILocalVariable(name: "t1", arg: 1, scope: !1254, file: !907, line: 171, type: !1257)
!1289 = !DILocation(line: 171, column: 54, scope: !1254)
!1290 = !DILocalVariable(name: "x", arg: 2, scope: !1254, file: !907, line: 171, type: !895)
!1291 = !DILocation(line: 171, column: 62, scope: !1254)
!1292 = !DILocalVariable(name: "y", arg: 3, scope: !1254, file: !907, line: 171, type: !895)
!1293 = !DILocation(line: 171, column: 69, scope: !1254)
!1294 = !DILocalVariable(name: "negative", arg: 4, scope: !1254, file: !907, line: 172, type: !895)
!1295 = !DILocation(line: 172, column: 39, scope: !1254)
!1296 = !DILocation(line: 174, column: 6, scope: !1254)
!1297 = !DILocation(line: 175, column: 6, scope: !1254)
!1298 = !DILocation(line: 176, column: 16, scope: !1254)
!1299 = !DILocation(line: 176, column: 21, scope: !1254)
!1300 = !DILocation(line: 176, column: 25, scope: !1254)
!1301 = !DILocation(line: 176, column: 19, scope: !1254)
!1302 = !DILocation(line: 176, column: 34, scope: !1254)
!1303 = !DILocation(line: 176, column: 32, scope: !1254)
!1304 = !DILocation(line: 176, column: 5, scope: !1254)
!1305 = !DILocation(line: 176, column: 9, scope: !1254)
!1306 = !DILocation(line: 176, column: 37, scope: !1254)
!1307 = !DILocation(line: 177, column: 9, scope: !1308)
!1308 = distinct !DILexicalBlock(scope: !1254, file: !907, line: 177, column: 9)
!1309 = !DILocation(line: 177, column: 9, scope: !1254)
!1310 = !DILocation(line: 178, column: 20, scope: !1311)
!1311 = distinct !DILexicalBlock(scope: !1308, file: !907, line: 177, column: 19)
!1312 = !DILocation(line: 178, column: 25, scope: !1311)
!1313 = !DILocation(line: 178, column: 29, scope: !1311)
!1314 = !DILocation(line: 178, column: 23, scope: !1311)
!1315 = !DILocation(line: 178, column: 38, scope: !1311)
!1316 = !DILocation(line: 178, column: 36, scope: !1311)
!1317 = !DILocation(line: 178, column: 40, scope: !1311)
!1318 = !DILocation(line: 178, column: 9, scope: !1311)
!1319 = !DILocation(line: 178, column: 13, scope: !1311)
!1320 = !DILocation(line: 178, column: 45, scope: !1311)
!1321 = !DILocation(line: 179, column: 20, scope: !1311)
!1322 = !DILocation(line: 179, column: 25, scope: !1311)
!1323 = !DILocation(line: 179, column: 29, scope: !1311)
!1324 = !DILocation(line: 179, column: 23, scope: !1311)
!1325 = !DILocation(line: 179, column: 38, scope: !1311)
!1326 = !DILocation(line: 179, column: 36, scope: !1311)
!1327 = !DILocation(line: 179, column: 40, scope: !1311)
!1328 = !DILocation(line: 179, column: 9, scope: !1311)
!1329 = !DILocation(line: 179, column: 13, scope: !1311)
!1330 = !DILocation(line: 179, column: 45, scope: !1311)
!1331 = !DILocation(line: 180, column: 20, scope: !1311)
!1332 = !DILocation(line: 180, column: 22, scope: !1311)
!1333 = !DILocation(line: 180, column: 29, scope: !1311)
!1334 = !DILocation(line: 180, column: 33, scope: !1311)
!1335 = !DILocation(line: 180, column: 27, scope: !1311)
!1336 = !DILocation(line: 180, column: 42, scope: !1311)
!1337 = !DILocation(line: 180, column: 40, scope: !1311)
!1338 = !DILocation(line: 180, column: 9, scope: !1311)
!1339 = !DILocation(line: 180, column: 13, scope: !1311)
!1340 = !DILocation(line: 180, column: 45, scope: !1311)
!1341 = !DILocation(line: 181, column: 20, scope: !1311)
!1342 = !DILocation(line: 181, column: 22, scope: !1311)
!1343 = !DILocation(line: 181, column: 29, scope: !1311)
!1344 = !DILocation(line: 181, column: 33, scope: !1311)
!1345 = !DILocation(line: 181, column: 27, scope: !1311)
!1346 = !DILocation(line: 181, column: 42, scope: !1311)
!1347 = !DILocation(line: 181, column: 40, scope: !1311)
!1348 = !DILocation(line: 181, column: 9, scope: !1311)
!1349 = !DILocation(line: 181, column: 13, scope: !1311)
!1350 = !DILocation(line: 181, column: 45, scope: !1311)
!1351 = !DILocation(line: 182, column: 5, scope: !1311)
!1352 = !DILocation(line: 183, column: 20, scope: !1353)
!1353 = distinct !DILexicalBlock(scope: !1308, file: !907, line: 182, column: 12)
!1354 = !DILocation(line: 183, column: 25, scope: !1353)
!1355 = !DILocation(line: 183, column: 29, scope: !1353)
!1356 = !DILocation(line: 183, column: 23, scope: !1353)
!1357 = !DILocation(line: 183, column: 38, scope: !1353)
!1358 = !DILocation(line: 183, column: 36, scope: !1353)
!1359 = !DILocation(line: 183, column: 40, scope: !1353)
!1360 = !DILocation(line: 183, column: 9, scope: !1353)
!1361 = !DILocation(line: 183, column: 13, scope: !1353)
!1362 = !DILocation(line: 183, column: 45, scope: !1353)
!1363 = !DILocation(line: 184, column: 20, scope: !1353)
!1364 = !DILocation(line: 184, column: 25, scope: !1353)
!1365 = !DILocation(line: 184, column: 29, scope: !1353)
!1366 = !DILocation(line: 184, column: 23, scope: !1353)
!1367 = !DILocation(line: 184, column: 38, scope: !1353)
!1368 = !DILocation(line: 184, column: 36, scope: !1353)
!1369 = !DILocation(line: 184, column: 40, scope: !1353)
!1370 = !DILocation(line: 184, column: 9, scope: !1353)
!1371 = !DILocation(line: 184, column: 13, scope: !1353)
!1372 = !DILocation(line: 184, column: 45, scope: !1353)
!1373 = !DILocation(line: 185, column: 20, scope: !1353)
!1374 = !DILocation(line: 185, column: 22, scope: !1353)
!1375 = !DILocation(line: 185, column: 29, scope: !1353)
!1376 = !DILocation(line: 185, column: 33, scope: !1353)
!1377 = !DILocation(line: 185, column: 27, scope: !1353)
!1378 = !DILocation(line: 185, column: 42, scope: !1353)
!1379 = !DILocation(line: 185, column: 40, scope: !1353)
!1380 = !DILocation(line: 185, column: 9, scope: !1353)
!1381 = !DILocation(line: 185, column: 13, scope: !1353)
!1382 = !DILocation(line: 185, column: 45, scope: !1353)
!1383 = !DILocation(line: 186, column: 20, scope: !1353)
!1384 = !DILocation(line: 186, column: 22, scope: !1353)
!1385 = !DILocation(line: 186, column: 29, scope: !1353)
!1386 = !DILocation(line: 186, column: 33, scope: !1353)
!1387 = !DILocation(line: 186, column: 27, scope: !1353)
!1388 = !DILocation(line: 186, column: 42, scope: !1353)
!1389 = !DILocation(line: 186, column: 40, scope: !1353)
!1390 = !DILocation(line: 186, column: 9, scope: !1353)
!1391 = !DILocation(line: 186, column: 13, scope: !1353)
!1392 = !DILocation(line: 186, column: 45, scope: !1353)
!1393 = !DILocation(line: 188, column: 16, scope: !1254)
!1394 = !DILocation(line: 188, column: 18, scope: !1254)
!1395 = !DILocation(line: 188, column: 25, scope: !1254)
!1396 = !DILocation(line: 188, column: 29, scope: !1254)
!1397 = !DILocation(line: 188, column: 23, scope: !1254)
!1398 = !DILocation(line: 188, column: 38, scope: !1254)
!1399 = !DILocation(line: 188, column: 36, scope: !1254)
!1400 = !DILocation(line: 188, column: 40, scope: !1254)
!1401 = !DILocation(line: 188, column: 5, scope: !1254)
!1402 = !DILocation(line: 188, column: 9, scope: !1254)
!1403 = !DILocation(line: 188, column: 45, scope: !1254)
!1404 = !DILocation(line: 189, column: 16, scope: !1254)
!1405 = !DILocation(line: 189, column: 18, scope: !1254)
!1406 = !DILocation(line: 189, column: 25, scope: !1254)
!1407 = !DILocation(line: 189, column: 29, scope: !1254)
!1408 = !DILocation(line: 189, column: 23, scope: !1254)
!1409 = !DILocation(line: 189, column: 38, scope: !1254)
!1410 = !DILocation(line: 189, column: 36, scope: !1254)
!1411 = !DILocation(line: 189, column: 40, scope: !1254)
!1412 = !DILocation(line: 189, column: 5, scope: !1254)
!1413 = !DILocation(line: 189, column: 9, scope: !1254)
!1414 = !DILocation(line: 189, column: 45, scope: !1254)
!1415 = !DILocation(line: 190, column: 16, scope: !1254)
!1416 = !DILocation(line: 190, column: 18, scope: !1254)
!1417 = !DILocation(line: 190, column: 25, scope: !1254)
!1418 = !DILocation(line: 190, column: 29, scope: !1254)
!1419 = !DILocation(line: 190, column: 23, scope: !1254)
!1420 = !DILocation(line: 190, column: 38, scope: !1254)
!1421 = !DILocation(line: 190, column: 36, scope: !1254)
!1422 = !DILocation(line: 190, column: 40, scope: !1254)
!1423 = !DILocation(line: 190, column: 5, scope: !1254)
!1424 = !DILocation(line: 190, column: 9, scope: !1254)
!1425 = !DILocation(line: 190, column: 45, scope: !1254)
!1426 = !DILocation(line: 191, column: 16, scope: !1254)
!1427 = !DILocation(line: 191, column: 18, scope: !1254)
!1428 = !DILocation(line: 191, column: 25, scope: !1254)
!1429 = !DILocation(line: 191, column: 29, scope: !1254)
!1430 = !DILocation(line: 191, column: 23, scope: !1254)
!1431 = !DILocation(line: 191, column: 38, scope: !1254)
!1432 = !DILocation(line: 191, column: 36, scope: !1254)
!1433 = !DILocation(line: 191, column: 40, scope: !1254)
!1434 = !DILocation(line: 191, column: 5, scope: !1254)
!1435 = !DILocation(line: 191, column: 9, scope: !1254)
!1436 = !DILocation(line: 191, column: 45, scope: !1254)
!1437 = !DILocation(line: 192, column: 1, scope: !1254)
!1438 = distinct !DISubprogram(name: "ff_jpeg2000_init_component", scope: !907, file: !907, line: 446, type: !1439, isLocal: false, isDefinition: true, scopeLine: 451, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !932)
!1439 = !DISubroutineType(types: !1440)
!1440 = !{!895, !1441, !1542, !1561, !895, !895, !895, !1573}
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jpeg2000Component", file: !1259, line: 213, baseType: !1443)
!1443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Jpeg2000Component", file: !1259, line: 206, size: 3200, align: 64, elements: !1444)
!1444 = !{!1445, !1522, !1538, !1539, !1540, !1541}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "reslevel", scope: !1443, file: !1259, line: 207, baseType: !1446, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jpeg2000ResLevel", file: !1259, line: 204, baseType: !1448)
!1448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Jpeg2000ResLevel", file: !1259, line: 198, size: 320, align: 64, elements: !1449)
!1449 = !{!1450, !1451, !1455, !1456, !1457, !1458, !1459}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "nbands", scope: !1448, file: !1259, line: 199, baseType: !909, size: 8, align: 8)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "coord", scope: !1448, file: !1259, line: 200, baseType: !1452, size: 128, align: 32, offset: 32)
!1452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 128, align: 32, elements: !1453)
!1453 = !{!1454, !1454}
!1454 = !DISubrange(count: 2)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "num_precincts_x", scope: !1448, file: !1259, line: 201, baseType: !895, size: 32, align: 32, offset: 160)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "num_precincts_y", scope: !1448, file: !1259, line: 201, baseType: !895, size: 32, align: 32, offset: 192)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "log2_prec_width", scope: !1448, file: !1259, line: 202, baseType: !909, size: 8, align: 8, offset: 224)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "log2_prec_height", scope: !1448, file: !1259, line: 202, baseType: !909, size: 8, align: 8, offset: 232)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "band", scope: !1448, file: !1259, line: 203, baseType: !1460, size: 64, align: 64, offset: 256)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jpeg2000Band", file: !1259, line: 196, baseType: !1462)
!1462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Jpeg2000Band", file: !1259, line: 190, size: 320, align: 64, elements: !1463)
!1463 = !{!1464, !1465, !1466, !1467, !1468, !1470}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "coord", scope: !1462, file: !1259, line: 191, baseType: !1452, size: 128, align: 32)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "log2_cblk_width", scope: !1462, file: !1259, line: 192, baseType: !1268, size: 16, align: 16, offset: 128)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "log2_cblk_height", scope: !1462, file: !1259, line: 192, baseType: !1268, size: 16, align: 16, offset: 144)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "i_stepsize", scope: !1462, file: !1259, line: 193, baseType: !895, size: 32, align: 32, offset: 160)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "f_stepsize", scope: !1462, file: !1259, line: 194, baseType: !1469, size: 32, align: 32, offset: 192)
!1469 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !1462, file: !1259, line: 195, baseType: !1471, size: 64, align: 64, offset: 256)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jpeg2000Prec", file: !1259, line: 188, baseType: !1473)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Jpeg2000Prec", file: !1259, line: 180, size: 448, align: 64, elements: !1474)
!1474 = !{!1475, !1476, !1477, !1486, !1487, !1520, !1521}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "nb_codeblocks_width", scope: !1473, file: !1259, line: 181, baseType: !895, size: 32, align: 32)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "nb_codeblocks_height", scope: !1473, file: !1259, line: 182, baseType: !895, size: 32, align: 32, offset: 32)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "zerobits", scope: !1473, file: !1259, line: 183, baseType: !1478, size: 64, align: 64, offset: 64)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jpeg2000TgtNode", file: !1259, line: 132, baseType: !1480)
!1480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Jpeg2000TgtNode", file: !1259, line: 128, size: 128, align: 64, elements: !1481)
!1481 = !{!1482, !1483, !1484}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1480, file: !1259, line: 129, baseType: !909, size: 8, align: 8)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "vis", scope: !1480, file: !1259, line: 130, baseType: !909, size: 8, align: 8, offset: 8)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1480, file: !1259, line: 131, baseType: !1485, size: 64, align: 64, offset: 64)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "cblkincl", scope: !1473, file: !1259, line: 184, baseType: !1478, size: 64, align: 64, offset: 128)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "cblk", scope: !1473, file: !1259, line: 185, baseType: !1488, size: 64, align: 64, offset: 192)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jpeg2000Cblk", file: !1259, line: 178, baseType: !1490)
!1490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Jpeg2000Cblk", file: !1259, line: 163, size: 640, align: 64, elements: !1491)
!1491 = !{!1492, !1493, !1494, !1495, !1496, !1498, !1499, !1500, !1501, !1504, !1505, !1506, !1508, !1519}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "npasses", scope: !1490, file: !1259, line: 164, baseType: !909, size: 8, align: 8)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "ninclpasses", scope: !1490, file: !1259, line: 165, baseType: !909, size: 8, align: 8, offset: 8)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerobits", scope: !1490, file: !1259, line: 166, baseType: !909, size: 8, align: 8, offset: 16)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1490, file: !1259, line: 167, baseType: !1268, size: 16, align: 16, offset: 32)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "lengthinc", scope: !1490, file: !1259, line: 168, baseType: !1497, size: 64, align: 64, offset: 64)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lengthinc", scope: !1490, file: !1259, line: 169, baseType: !909, size: 8, align: 8, offset: 128)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "lblock", scope: !1490, file: !1259, line: 170, baseType: !909, size: 8, align: 8, offset: 136)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1490, file: !1259, line: 171, baseType: !1196, size: 64, align: 64, offset: 192)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "data_allocated", scope: !1490, file: !1259, line: 172, baseType: !1502, size: 64, align: 64, offset: 256)
!1502 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1503, line: 216, baseType: !899)
!1503 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "nb_terminations", scope: !1490, file: !1259, line: 173, baseType: !895, size: 32, align: 32, offset: 320)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "nb_terminationsinc", scope: !1490, file: !1259, line: 174, baseType: !895, size: 32, align: 32, offset: 352)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "data_start", scope: !1490, file: !1259, line: 175, baseType: !1507, size: 64, align: 64, offset: 384)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64, align: 64)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "passes", scope: !1490, file: !1259, line: 176, baseType: !1509, size: 64, align: 64, offset: 448)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jpeg2000Pass", file: !1259, line: 161, baseType: !1511)
!1511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Jpeg2000Pass", file: !1259, line: 156, size: 192, align: 64, elements: !1512)
!1512 = !{!1513, !1514, !1515, !1518}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !1511, file: !1259, line: 157, baseType: !1268, size: 16, align: 16)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "disto", scope: !1511, file: !1259, line: 158, baseType: !900, size: 64, align: 64, offset: 64)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "flushed", scope: !1511, file: !1259, line: 159, baseType: !1516, size: 32, align: 8, offset: 128)
!1516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 32, align: 8, elements: !1517)
!1517 = !{!913}
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "flushed_len", scope: !1511, file: !1259, line: 160, baseType: !895, size: 32, align: 32, offset: 160)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "coord", scope: !1490, file: !1259, line: 177, baseType: !1452, size: 128, align: 32, offset: 512)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "decoded_layers", scope: !1473, file: !1259, line: 186, baseType: !895, size: 32, align: 32, offset: 256)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "coord", scope: !1473, file: !1259, line: 187, baseType: !1452, size: 128, align: 32, offset: 288)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "dwt", scope: !1443, file: !1259, line: 208, baseType: !1523, size: 2752, align: 64, offset: 64)
!1523 = !DIDerivedType(tag: DW_TAG_typedef, name: "DWTContext", file: !888, line: 51, baseType: !1524)
!1524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DWTContext", file: !888, line: 43, size: 2752, align: 64, elements: !1525)
!1525 = !{!1526, !1530, !1532, !1533, !1534, !1536}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "linelen", scope: !1524, file: !888, line: 45, baseType: !1527, size: 2048, align: 32)
!1527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 2048, align: 32, elements: !1528)
!1528 = !{!1529, !1454}
!1529 = !DISubrange(count: 32)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !1524, file: !888, line: 46, baseType: !1531, size: 512, align: 8, offset: 2048)
!1531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 512, align: 8, elements: !1528)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "ndeclevels", scope: !1524, file: !888, line: 47, baseType: !909, size: 8, align: 8, offset: 2560)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1524, file: !888, line: 48, baseType: !909, size: 8, align: 8, offset: 2568)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "i_linebuf", scope: !1524, file: !888, line: 49, baseType: !1535, size: 64, align: 64, offset: 2624)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64, align: 64)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "f_linebuf", scope: !1524, file: !888, line: 50, baseType: !1537, size: 64, align: 64, offset: 2688)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "f_data", scope: !1443, file: !1259, line: 209, baseType: !1537, size: 64, align: 64, offset: 2816)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "i_data", scope: !1443, file: !1259, line: 210, baseType: !1507, size: 64, align: 64, offset: 2880)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "coord", scope: !1443, file: !1259, line: 211, baseType: !1452, size: 128, align: 32, offset: 2944)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "coord_o", scope: !1443, file: !1259, line: 212, baseType: !1452, size: 128, align: 32, offset: 3072)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jpeg2000CodingStyle", file: !1259, line: 147, baseType: !1544)
!1544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Jpeg2000CodingStyle", file: !1259, line: 134, size: 672, align: 32, elements: !1545)
!1545 = !{!1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1560}
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "nreslevels", scope: !1544, file: !1259, line: 135, baseType: !895, size: 32, align: 32)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "nreslevels2decode", scope: !1544, file: !1259, line: 136, baseType: !895, size: 32, align: 32, offset: 32)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "log2_cblk_width", scope: !1544, file: !1259, line: 137, baseType: !909, size: 8, align: 8, offset: 64)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "log2_cblk_height", scope: !1544, file: !1259, line: 138, baseType: !909, size: 8, align: 8, offset: 72)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1544, file: !1259, line: 139, baseType: !909, size: 8, align: 8, offset: 80)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "csty", scope: !1544, file: !1259, line: 140, baseType: !909, size: 8, align: 8, offset: 88)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "nlayers", scope: !1544, file: !1259, line: 141, baseType: !909, size: 8, align: 8, offset: 96)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "mct", scope: !1544, file: !1259, line: 142, baseType: !909, size: 8, align: 8, offset: 104)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "cblk_style", scope: !1544, file: !1259, line: 143, baseType: !909, size: 8, align: 8, offset: 112)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "prog_order", scope: !1544, file: !1259, line: 144, baseType: !909, size: 8, align: 8, offset: 120)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "log2_prec_widths", scope: !1544, file: !1259, line: 145, baseType: !1557, size: 272, align: 8, offset: 128)
!1557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 272, align: 8, elements: !1558)
!1558 = !{!1559}
!1559 = !DISubrange(count: 34)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "log2_prec_heights", scope: !1544, file: !1259, line: 146, baseType: !1557, size: 272, align: 8, offset: 400)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jpeg2000QuantStyle", file: !1259, line: 154, baseType: !1563)
!1563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Jpeg2000QuantStyle", file: !1259, line: 149, size: 2400, align: 16, elements: !1564)
!1564 = !{!1565, !1569, !1571, !1572}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "expn", scope: !1563, file: !1259, line: 150, baseType: !1566, size: 792, align: 8)
!1566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 792, align: 8, elements: !1567)
!1567 = !{!1568}
!1568 = !DISubrange(count: 99)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "mant", scope: !1563, file: !1259, line: 151, baseType: !1570, size: 1584, align: 16, offset: 800)
!1570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1268, size: 1584, align: 16, elements: !1567)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "quantsty", scope: !1563, file: !1259, line: 152, baseType: !909, size: 8, align: 8, offset: 2384)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "nguardbits", scope: !1563, file: !1259, line: 153, baseType: !909, size: 8, align: 8, offset: 2392)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1575)
!1575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1576)
!1576 = !{!1577, !1621, !1622, !1623, !1884, !1885, !1886, !1887, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2040, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2222, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1575, file: !35, line: 1561, baseType: !1578, size: 64, align: 64)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64, align: 64)
!1579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1580)
!1580 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1581)
!1581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1582)
!1582 = !{!1583, !1587, !1591, !1595, !1596, !1597, !1598, !1602, !1608, !1610, !1614}
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1581, file: !4, line: 72, baseType: !1584, size: 64, align: 64)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1586)
!1586 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1581, file: !4, line: 78, baseType: !1588, size: 64, align: 64, offset: 64)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DISubroutineType(types: !1590)
!1590 = !{!1584, !903}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1581, file: !4, line: 85, baseType: !1592, size: 64, align: 64, offset: 128)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1594)
!1594 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1581, file: !4, line: 93, baseType: !895, size: 32, align: 32, offset: 192)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1581, file: !4, line: 99, baseType: !895, size: 32, align: 32, offset: 224)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1581, file: !4, line: 108, baseType: !895, size: 32, align: 32, offset: 256)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1581, file: !4, line: 113, baseType: !1599, size: 64, align: 64, offset: 320)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = !DISubroutineType(types: !1601)
!1601 = !{!903, !903, !903}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1581, file: !4, line: 123, baseType: !1603, size: 64, align: 64, offset: 384)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DISubroutineType(types: !1605)
!1605 = !{!1606, !1606}
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1581)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1581, file: !4, line: 130, baseType: !1609, size: 32, align: 32, offset: 448)
!1609 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1581, file: !4, line: 136, baseType: !1611, size: 64, align: 64, offset: 512)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DISubroutineType(types: !1613)
!1613 = !{!1609, !903}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1581, file: !4, line: 142, baseType: !1615, size: 64, align: 64, offset: 576)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = !DISubroutineType(types: !1617)
!1617 = !{!895, !1618, !903, !1584, !895}
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1575, file: !35, line: 1562, baseType: !895, size: 32, align: 32, offset: 64)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1575, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1575, file: !35, line: 1565, baseType: !1624, size: 64, align: 64, offset: 128)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1626)
!1626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1627)
!1627 = !{!1628, !1629, !1630, !1631, !1632, !1633, !1642, !1645, !1647, !1650, !1653, !1654, !1655, !1663, !1664, !1665, !1667, !1671, !1677, !1688, !1692, !1693, !1737, !1855, !1859, !1860, !1864, !1868, !1873, !1877, !1878, !1879}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1626, file: !35, line: 3475, baseType: !1584, size: 64, align: 64)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1626, file: !35, line: 3480, baseType: !1584, size: 64, align: 64, offset: 64)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1626, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1626, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1626, file: !35, line: 3487, baseType: !895, size: 32, align: 32, offset: 192)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1626, file: !35, line: 3488, baseType: !1634, size: 64, align: 64, offset: 256)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1636)
!1636 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1637, line: 61, baseType: !1638)
!1637 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1637, line: 58, size: 64, align: 32, elements: !1639)
!1639 = !{!1640, !1641}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1638, file: !1637, line: 59, baseType: !895, size: 32, align: 32)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1638, file: !1637, line: 60, baseType: !895, size: 32, align: 32, offset: 32)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1626, file: !35, line: 3489, baseType: !1643, size: 64, align: 64, offset: 320)
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64, align: 64)
!1644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1626, file: !35, line: 3490, baseType: !1646, size: 64, align: 64, offset: 384)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1626, file: !35, line: 3491, baseType: !1648, size: 64, align: 64, offset: 448)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1626, file: !35, line: 3492, baseType: !1651, size: 64, align: 64, offset: 512)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !897)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1626, file: !35, line: 3493, baseType: !909, size: 8, align: 8, offset: 576)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1626, file: !35, line: 3494, baseType: !1578, size: 64, align: 64, offset: 640)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1626, file: !35, line: 3495, baseType: !1656, size: 64, align: 64, offset: 704)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1658)
!1658 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1659)
!1659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1660)
!1660 = !{!1661, !1662}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1659, file: !35, line: 3402, baseType: !895, size: 32, align: 32)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1659, file: !35, line: 3403, baseType: !1584, size: 64, align: 64, offset: 64)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1626, file: !35, line: 3507, baseType: !1584, size: 64, align: 64, offset: 768)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1626, file: !35, line: 3516, baseType: !895, size: 32, align: 32, offset: 832)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1626, file: !35, line: 3517, baseType: !1666, size: 64, align: 64, offset: 896)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64, align: 64)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1626, file: !35, line: 3527, baseType: !1668, size: 64, align: 64, offset: 960)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DISubroutineType(types: !1670)
!1670 = !{!895, !1573}
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1626, file: !35, line: 3535, baseType: !1672, size: 64, align: 64, offset: 1024)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DISubroutineType(types: !1674)
!1674 = !{!895, !1573, !1675}
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64, align: 64)
!1676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1574)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1626, file: !35, line: 3541, baseType: !1678, size: 64, align: 64, offset: 1088)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1680)
!1680 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1681)
!1681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1682, line: 223, size: 128, align: 64, elements: !1683)
!1682 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1683 = !{!1684, !1687}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1681, file: !1682, line: 224, baseType: !1685, size: 64, align: 64)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !909)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1681, file: !1682, line: 225, baseType: !1685, size: 64, align: 64, offset: 64)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1626, file: !35, line: 3549, baseType: !1689, size: 64, align: 64, offset: 1152)
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64, align: 64)
!1690 = !DISubroutineType(types: !1691)
!1691 = !{null, !1666}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1626, file: !35, line: 3551, baseType: !1668, size: 64, align: 64, offset: 1216)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1626, file: !35, line: 3552, baseType: !1694, size: 64, align: 64, offset: 1280)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64, align: 64)
!1695 = !DISubroutineType(types: !1696)
!1696 = !{!895, !1573, !1196, !895, !1697}
!1697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1698, size: 64, align: 64)
!1698 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1699)
!1699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1700)
!1700 = !{!1701, !1702, !1704, !1705, !1706, !1736}
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1699, file: !35, line: 3921, baseType: !1268, size: 16, align: 16)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1699, file: !35, line: 3922, baseType: !1703, size: 32, align: 32, offset: 32)
!1703 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !898, line: 51, baseType: !896)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1699, file: !35, line: 3923, baseType: !1703, size: 32, align: 32, offset: 64)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1699, file: !35, line: 3924, baseType: !896, size: 32, align: 32, offset: 96)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1699, file: !35, line: 3925, baseType: !1707, size: 64, align: 64, offset: 128)
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64, align: 64)
!1708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1709, size: 64, align: 64)
!1709 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1710)
!1710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1711)
!1711 = !{!1712, !1713, !1714, !1715, !1716, !1717, !1727, !1729, !1731, !1732, !1734, !1735}
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1710, file: !35, line: 3886, baseType: !895, size: 32, align: 32)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1710, file: !35, line: 3887, baseType: !895, size: 32, align: 32, offset: 32)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1710, file: !35, line: 3888, baseType: !895, size: 32, align: 32, offset: 64)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1710, file: !35, line: 3889, baseType: !895, size: 32, align: 32, offset: 96)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1710, file: !35, line: 3890, baseType: !895, size: 32, align: 32, offset: 128)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1710, file: !35, line: 3897, baseType: !1718, size: 768, align: 64, offset: 192)
!1718 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1719)
!1719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1720)
!1720 = !{!1721, !1725}
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1719, file: !35, line: 3855, baseType: !1722, size: 512, align: 64)
!1722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1196, size: 512, align: 64, elements: !1723)
!1723 = !{!1724}
!1724 = !DISubrange(count: 8)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1719, file: !35, line: 3857, baseType: !1726, size: 256, align: 32, offset: 512)
!1726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 256, align: 32, elements: !1723)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1710, file: !35, line: 3903, baseType: !1728, size: 256, align: 64, offset: 960)
!1728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1196, size: 256, align: 64, elements: !1517)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1710, file: !35, line: 3904, baseType: !1730, size: 128, align: 32, offset: 1216)
!1730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 128, align: 32, elements: !1517)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1710, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1710, file: !35, line: 3908, baseType: !1733, size: 64, align: 64, offset: 1408)
!1733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1710, file: !35, line: 3915, baseType: !1733, size: 64, align: 64, offset: 1472)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1710, file: !35, line: 3917, baseType: !895, size: 32, align: 32, offset: 1536)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1699, file: !35, line: 3926, baseType: !900, size: 64, align: 64, offset: 192)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1626, file: !35, line: 3564, baseType: !1738, size: 64, align: 64, offset: 1344)
!1738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1739, size: 64, align: 64)
!1739 = !DISubroutineType(types: !1740)
!1740 = !{!895, !1573, !1741, !1775, !1507}
!1741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1742, size: 64, align: 64)
!1742 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1743)
!1743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1744)
!1744 = !{!1745, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1771, !1772, !1773, !1774}
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1743, file: !35, line: 1451, baseType: !1746, size: 64, align: 64)
!1746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1747, size: 64, align: 64)
!1747 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1748, line: 94, baseType: !1749)
!1748 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1748, line: 81, size: 192, align: 64, elements: !1750)
!1750 = !{!1751, !1755, !1756}
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1749, file: !1748, line: 82, baseType: !1752, size: 64, align: 64)
!1752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1753, size: 64, align: 64)
!1753 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1748, line: 73, baseType: !1754)
!1754 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1748, line: 73, flags: DIFlagFwdDecl)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1749, file: !1748, line: 89, baseType: !1196, size: 64, align: 64, offset: 64)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1749, file: !1748, line: 93, baseType: !895, size: 32, align: 32, offset: 128)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1743, file: !35, line: 1461, baseType: !900, size: 64, align: 64, offset: 64)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1743, file: !35, line: 1467, baseType: !900, size: 64, align: 64, offset: 128)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1743, file: !35, line: 1468, baseType: !1196, size: 64, align: 64, offset: 192)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1743, file: !35, line: 1469, baseType: !895, size: 32, align: 32, offset: 256)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1743, file: !35, line: 1470, baseType: !895, size: 32, align: 32, offset: 288)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1743, file: !35, line: 1474, baseType: !895, size: 32, align: 32, offset: 320)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1743, file: !35, line: 1479, baseType: !1764, size: 64, align: 64, offset: 384)
!1764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1765, size: 64, align: 64)
!1765 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1766)
!1766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1767)
!1767 = !{!1768, !1769, !1770}
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1766, file: !35, line: 1412, baseType: !1196, size: 64, align: 64)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1766, file: !35, line: 1413, baseType: !895, size: 32, align: 32, offset: 64)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1766, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1743, file: !35, line: 1480, baseType: !895, size: 32, align: 32, offset: 448)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1743, file: !35, line: 1486, baseType: !900, size: 64, align: 64, offset: 512)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1743, file: !35, line: 1488, baseType: !900, size: 64, align: 64, offset: 576)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1743, file: !35, line: 1497, baseType: !900, size: 64, align: 64, offset: 640)
!1775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1776, size: 64, align: 64)
!1776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1777)
!1777 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1778)
!1778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1779)
!1779 = !{!1780, !1781, !1782, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1809, !1811, !1812, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854}
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1778, file: !758, line: 282, baseType: !1722, size: 512, align: 64)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1778, file: !758, line: 299, baseType: !1726, size: 256, align: 32, offset: 512)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1778, file: !758, line: 315, baseType: !1783, size: 64, align: 64, offset: 768)
!1783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1778, file: !758, line: 326, baseType: !895, size: 32, align: 32, offset: 832)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1778, file: !758, line: 326, baseType: !895, size: 32, align: 32, offset: 864)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1778, file: !758, line: 334, baseType: !895, size: 32, align: 32, offset: 896)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1778, file: !758, line: 341, baseType: !895, size: 32, align: 32, offset: 928)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1778, file: !758, line: 346, baseType: !895, size: 32, align: 32, offset: 960)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1778, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1778, file: !758, line: 356, baseType: !1636, size: 64, align: 32, offset: 1024)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1778, file: !758, line: 361, baseType: !900, size: 64, align: 64, offset: 1088)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1778, file: !758, line: 369, baseType: !900, size: 64, align: 64, offset: 1152)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1778, file: !758, line: 377, baseType: !900, size: 64, align: 64, offset: 1216)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1778, file: !758, line: 382, baseType: !895, size: 32, align: 32, offset: 1280)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1778, file: !758, line: 386, baseType: !895, size: 32, align: 32, offset: 1312)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1778, file: !758, line: 391, baseType: !895, size: 32, align: 32, offset: 1344)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1778, file: !758, line: 396, baseType: !903, size: 64, align: 64, offset: 1408)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1778, file: !758, line: 403, baseType: !1799, size: 512, align: 64, offset: 1472)
!1799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !897, size: 512, align: 64, elements: !1723)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1778, file: !758, line: 410, baseType: !895, size: 32, align: 32, offset: 1984)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1778, file: !758, line: 415, baseType: !895, size: 32, align: 32, offset: 2016)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1778, file: !758, line: 420, baseType: !895, size: 32, align: 32, offset: 2048)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1778, file: !758, line: 425, baseType: !895, size: 32, align: 32, offset: 2080)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1778, file: !758, line: 435, baseType: !900, size: 64, align: 64, offset: 2112)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1778, file: !758, line: 440, baseType: !895, size: 32, align: 32, offset: 2176)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1778, file: !758, line: 445, baseType: !897, size: 64, align: 64, offset: 2240)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1778, file: !758, line: 459, baseType: !1808, size: 512, align: 64, offset: 2304)
!1808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1746, size: 512, align: 64, elements: !1723)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1778, file: !758, line: 473, baseType: !1810, size: 64, align: 64, offset: 2816)
!1810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1746, size: 64, align: 64)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1778, file: !758, line: 477, baseType: !895, size: 32, align: 32, offset: 2880)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1778, file: !758, line: 479, baseType: !1813, size: 64, align: 64, offset: 2944)
!1813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1814, size: 64, align: 64)
!1814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1815, size: 64, align: 64)
!1815 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1816)
!1816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1817)
!1817 = !{!1818, !1819, !1820, !1821, !1826}
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1816, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1816, file: !758, line: 203, baseType: !1196, size: 64, align: 64, offset: 64)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1816, file: !758, line: 204, baseType: !895, size: 32, align: 32, offset: 128)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1816, file: !758, line: 205, baseType: !1822, size: 64, align: 64, offset: 192)
!1822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1823, size: 64, align: 64)
!1823 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1824, line: 86, baseType: !1825)
!1824 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1825 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1824, line: 86, flags: DIFlagFwdDecl)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1816, file: !758, line: 206, baseType: !1746, size: 64, align: 64, offset: 256)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1778, file: !758, line: 480, baseType: !895, size: 32, align: 32, offset: 3008)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1778, file: !758, line: 505, baseType: !895, size: 32, align: 32, offset: 3040)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1778, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1778, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1778, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1778, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1778, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1778, file: !758, line: 532, baseType: !900, size: 64, align: 64, offset: 3264)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1778, file: !758, line: 539, baseType: !900, size: 64, align: 64, offset: 3328)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1778, file: !758, line: 547, baseType: !900, size: 64, align: 64, offset: 3392)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1778, file: !758, line: 554, baseType: !1822, size: 64, align: 64, offset: 3456)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1778, file: !758, line: 563, baseType: !895, size: 32, align: 32, offset: 3520)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1778, file: !758, line: 572, baseType: !895, size: 32, align: 32, offset: 3552)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1778, file: !758, line: 581, baseType: !895, size: 32, align: 32, offset: 3584)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1778, file: !758, line: 588, baseType: !1842, size: 64, align: 64, offset: 3648)
!1842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1843, size: 64, align: 64)
!1843 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !901, line: 194, baseType: !1844)
!1844 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1778, file: !758, line: 593, baseType: !895, size: 32, align: 32, offset: 3712)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1778, file: !758, line: 596, baseType: !895, size: 32, align: 32, offset: 3744)
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1778, file: !758, line: 599, baseType: !1746, size: 64, align: 64, offset: 3776)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1778, file: !758, line: 605, baseType: !1746, size: 64, align: 64, offset: 3840)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1778, file: !758, line: 616, baseType: !1746, size: 64, align: 64, offset: 3904)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1778, file: !758, line: 626, baseType: !1502, size: 64, align: 64, offset: 3968)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1778, file: !758, line: 627, baseType: !1502, size: 64, align: 64, offset: 4032)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1778, file: !758, line: 628, baseType: !1502, size: 64, align: 64, offset: 4096)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1778, file: !758, line: 629, baseType: !1502, size: 64, align: 64, offset: 4160)
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1778, file: !758, line: 645, baseType: !1746, size: 64, align: 64, offset: 4224)
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1626, file: !35, line: 3566, baseType: !1856, size: 64, align: 64, offset: 1408)
!1856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1857, size: 64, align: 64)
!1857 = !DISubroutineType(types: !1858)
!1858 = !{!895, !1573, !903, !1507, !1741}
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1626, file: !35, line: 3567, baseType: !1668, size: 64, align: 64, offset: 1472)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1626, file: !35, line: 3576, baseType: !1861, size: 64, align: 64, offset: 1536)
!1861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1862, size: 64, align: 64)
!1862 = !DISubroutineType(types: !1863)
!1863 = !{!895, !1573, !1775}
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1626, file: !35, line: 3577, baseType: !1865, size: 64, align: 64, offset: 1600)
!1865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1866, size: 64, align: 64)
!1866 = !DISubroutineType(types: !1867)
!1867 = !{!895, !1573, !1741}
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1626, file: !35, line: 3584, baseType: !1869, size: 64, align: 64, offset: 1664)
!1869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1870, size: 64, align: 64)
!1870 = !DISubroutineType(types: !1871)
!1871 = !{!895, !1573, !1872}
!1872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1777, size: 64, align: 64)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1626, file: !35, line: 3589, baseType: !1874, size: 64, align: 64, offset: 1728)
!1874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1875, size: 64, align: 64)
!1875 = !DISubroutineType(types: !1876)
!1876 = !{null, !1573}
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1626, file: !35, line: 3594, baseType: !895, size: 32, align: 32, offset: 1792)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1626, file: !35, line: 3600, baseType: !1584, size: 64, align: 64, offset: 1856)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1626, file: !35, line: 3609, baseType: !1880, size: 64, align: 64, offset: 1920)
!1880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1881, size: 64, align: 64)
!1881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1882, size: 64, align: 64)
!1882 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1883)
!1883 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1575, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1575, file: !35, line: 1581, baseType: !896, size: 32, align: 32, offset: 224)
!1886 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1575, file: !35, line: 1583, baseType: !903, size: 64, align: 64, offset: 256)
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1575, file: !35, line: 1591, baseType: !1888, size: 64, align: 64, offset: 320)
!1888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1889, size: 64, align: 64)
!1889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1682, line: 129, size: 1664, align: 64, elements: !1890)
!1890 = !{!1891, !1892, !1893, !1894, !1895, !1913, !1914, !1920, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016}
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1889, file: !1682, line: 136, baseType: !895, size: 32, align: 32)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1889, file: !1682, line: 151, baseType: !895, size: 32, align: 32, offset: 32)
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1889, file: !1682, line: 157, baseType: !895, size: 32, align: 32, offset: 64)
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1889, file: !1682, line: 159, baseType: !1872, size: 64, align: 64, offset: 128)
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1889, file: !1682, line: 161, baseType: !1896, size: 64, align: 64, offset: 192)
!1896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1897, size: 64, align: 64)
!1897 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1682, line: 117, baseType: !1898)
!1898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1682, line: 100, size: 832, align: 64, elements: !1899)
!1899 = !{!1900, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912}
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1898, file: !1682, line: 105, baseType: !1901, size: 256, align: 64)
!1901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1902, size: 256, align: 64, elements: !1517)
!1902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1903, size: 64, align: 64)
!1903 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1748, line: 238, baseType: !1904)
!1904 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1748, line: 238, flags: DIFlagFwdDecl)
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1898, file: !1682, line: 110, baseType: !895, size: 32, align: 32, offset: 256)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1898, file: !1682, line: 111, baseType: !895, size: 32, align: 32, offset: 288)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1898, file: !1682, line: 111, baseType: !895, size: 32, align: 32, offset: 320)
!1908 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1898, file: !1682, line: 112, baseType: !1726, size: 256, align: 32, offset: 352)
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1898, file: !1682, line: 113, baseType: !1730, size: 128, align: 32, offset: 608)
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1898, file: !1682, line: 114, baseType: !895, size: 32, align: 32, offset: 736)
!1911 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1898, file: !1682, line: 115, baseType: !895, size: 32, align: 32, offset: 768)
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1898, file: !1682, line: 116, baseType: !895, size: 32, align: 32, offset: 800)
!1913 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1889, file: !1682, line: 163, baseType: !903, size: 64, align: 64, offset: 256)
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1889, file: !1682, line: 165, baseType: !1915, size: 128, align: 64, offset: 320)
!1915 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1682, line: 122, baseType: !1916)
!1916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1682, line: 119, size: 128, align: 64, elements: !1917)
!1917 = !{!1918, !1919}
!1918 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1916, file: !1682, line: 120, baseType: !1741, size: 64, align: 64)
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1916, file: !1682, line: 121, baseType: !1872, size: 64, align: 64, offset: 64)
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1889, file: !1682, line: 166, baseType: !1921, size: 128, align: 64, offset: 448)
!1921 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1682, line: 127, baseType: !1922)
!1922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1682, line: 124, size: 128, align: 64, elements: !1923)
!1923 = !{!1924, !1997}
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1922, file: !1682, line: 125, baseType: !1925, size: 64, align: 64)
!1925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1926, size: 64, align: 64)
!1926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1927, size: 64, align: 64)
!1927 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1928)
!1928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1929)
!1929 = !{!1930, !1931, !1955, !1959, !1960, !1994, !1995, !1996}
!1930 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1928, file: !35, line: 5751, baseType: !1578, size: 64, align: 64)
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1928, file: !35, line: 5756, baseType: !1932, size: 64, align: 64, offset: 64)
!1932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1933, size: 64, align: 64)
!1933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1934)
!1934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1935)
!1935 = !{!1936, !1937, !1940, !1941, !1942, !1946, !1950, !1954}
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1934, file: !35, line: 5797, baseType: !1584, size: 64, align: 64)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1934, file: !35, line: 5804, baseType: !1938, size: 64, align: 64, offset: 64)
!1938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1939, size: 64, align: 64)
!1939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1934, file: !35, line: 5815, baseType: !1578, size: 64, align: 64, offset: 128)
!1941 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1934, file: !35, line: 5825, baseType: !895, size: 32, align: 32, offset: 192)
!1942 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1934, file: !35, line: 5826, baseType: !1943, size: 64, align: 64, offset: 256)
!1943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1944, size: 64, align: 64)
!1944 = !DISubroutineType(types: !1945)
!1945 = !{!895, !1926}
!1946 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1934, file: !35, line: 5827, baseType: !1947, size: 64, align: 64, offset: 320)
!1947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1948, size: 64, align: 64)
!1948 = !DISubroutineType(types: !1949)
!1949 = !{!895, !1926, !1741}
!1950 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1934, file: !35, line: 5828, baseType: !1951, size: 64, align: 64, offset: 384)
!1951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1952, size: 64, align: 64)
!1952 = !DISubroutineType(types: !1953)
!1953 = !{null, !1926}
!1954 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1934, file: !35, line: 5829, baseType: !1951, size: 64, align: 64, offset: 448)
!1955 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1928, file: !35, line: 5762, baseType: !1956, size: 64, align: 64, offset: 128)
!1956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1957, size: 64, align: 64)
!1957 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1958)
!1958 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1959 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1928, file: !35, line: 5768, baseType: !903, size: 64, align: 64, offset: 192)
!1960 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1928, file: !35, line: 5775, baseType: !1961, size: 64, align: 64, offset: 256)
!1961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1962, size: 64, align: 64)
!1962 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1963)
!1963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1964)
!1964 = !{!1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993}
!1965 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1963, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1966 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1963, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1967 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1963, file: !35, line: 3948, baseType: !1703, size: 32, align: 32, offset: 64)
!1968 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1963, file: !35, line: 3958, baseType: !1196, size: 64, align: 64, offset: 128)
!1969 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1963, file: !35, line: 3962, baseType: !895, size: 32, align: 32, offset: 192)
!1970 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1963, file: !35, line: 3968, baseType: !895, size: 32, align: 32, offset: 224)
!1971 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1963, file: !35, line: 3973, baseType: !900, size: 64, align: 64, offset: 256)
!1972 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1963, file: !35, line: 3986, baseType: !895, size: 32, align: 32, offset: 320)
!1973 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1963, file: !35, line: 3999, baseType: !895, size: 32, align: 32, offset: 352)
!1974 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1963, file: !35, line: 4004, baseType: !895, size: 32, align: 32, offset: 384)
!1975 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1963, file: !35, line: 4005, baseType: !895, size: 32, align: 32, offset: 416)
!1976 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1963, file: !35, line: 4010, baseType: !895, size: 32, align: 32, offset: 448)
!1977 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1963, file: !35, line: 4011, baseType: !895, size: 32, align: 32, offset: 480)
!1978 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1963, file: !35, line: 4020, baseType: !1636, size: 64, align: 32, offset: 512)
!1979 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1963, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1980 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1963, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1981 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1963, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1982 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1963, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1983 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1963, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1984 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1963, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1985 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1963, file: !35, line: 4039, baseType: !895, size: 32, align: 32, offset: 768)
!1986 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1963, file: !35, line: 4046, baseType: !897, size: 64, align: 64, offset: 832)
!1987 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1963, file: !35, line: 4050, baseType: !895, size: 32, align: 32, offset: 896)
!1988 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1963, file: !35, line: 4054, baseType: !895, size: 32, align: 32, offset: 928)
!1989 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1963, file: !35, line: 4061, baseType: !895, size: 32, align: 32, offset: 960)
!1990 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1963, file: !35, line: 4065, baseType: !895, size: 32, align: 32, offset: 992)
!1991 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1963, file: !35, line: 4073, baseType: !895, size: 32, align: 32, offset: 1024)
!1992 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1963, file: !35, line: 4080, baseType: !895, size: 32, align: 32, offset: 1056)
!1993 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1963, file: !35, line: 4084, baseType: !895, size: 32, align: 32, offset: 1088)
!1994 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1928, file: !35, line: 5781, baseType: !1961, size: 64, align: 64, offset: 320)
!1995 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1928, file: !35, line: 5787, baseType: !1636, size: 64, align: 32, offset: 384)
!1996 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1928, file: !35, line: 5793, baseType: !1636, size: 64, align: 32, offset: 448)
!1997 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1922, file: !1682, line: 126, baseType: !895, size: 32, align: 32, offset: 64)
!1998 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1889, file: !1682, line: 172, baseType: !1741, size: 64, align: 64, offset: 576)
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1889, file: !1682, line: 177, baseType: !1196, size: 64, align: 64, offset: 640)
!2000 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1889, file: !1682, line: 178, baseType: !896, size: 32, align: 32, offset: 704)
!2001 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1889, file: !1682, line: 180, baseType: !903, size: 64, align: 64, offset: 768)
!2002 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1889, file: !1682, line: 185, baseType: !895, size: 32, align: 32, offset: 832)
!2003 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1889, file: !1682, line: 190, baseType: !903, size: 64, align: 64, offset: 896)
!2004 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1889, file: !1682, line: 195, baseType: !895, size: 32, align: 32, offset: 960)
!2005 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1889, file: !1682, line: 200, baseType: !1741, size: 64, align: 64, offset: 1024)
!2006 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1889, file: !1682, line: 201, baseType: !895, size: 32, align: 32, offset: 1088)
!2007 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1889, file: !1682, line: 202, baseType: !1872, size: 64, align: 64, offset: 1152)
!2008 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1889, file: !1682, line: 203, baseType: !895, size: 32, align: 32, offset: 1216)
!2009 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1889, file: !1682, line: 205, baseType: !895, size: 32, align: 32, offset: 1248)
!2010 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1889, file: !1682, line: 206, baseType: !895, size: 32, align: 32, offset: 1280)
!2011 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1889, file: !1682, line: 209, baseType: !1502, size: 64, align: 64, offset: 1344)
!2012 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1889, file: !1682, line: 212, baseType: !1502, size: 64, align: 64, offset: 1408)
!2013 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1889, file: !1682, line: 213, baseType: !1872, size: 64, align: 64, offset: 1472)
!2014 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1889, file: !1682, line: 215, baseType: !895, size: 32, align: 32, offset: 1536)
!2015 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1889, file: !1682, line: 217, baseType: !895, size: 32, align: 32, offset: 1568)
!2016 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1889, file: !1682, line: 220, baseType: !895, size: 32, align: 32, offset: 1600)
!2017 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1575, file: !35, line: 1598, baseType: !903, size: 64, align: 64, offset: 384)
!2018 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1575, file: !35, line: 1606, baseType: !900, size: 64, align: 64, offset: 448)
!2019 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1575, file: !35, line: 1614, baseType: !895, size: 32, align: 32, offset: 512)
!2020 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1575, file: !35, line: 1622, baseType: !895, size: 32, align: 32, offset: 544)
!2021 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1575, file: !35, line: 1628, baseType: !895, size: 32, align: 32, offset: 576)
!2022 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1575, file: !35, line: 1636, baseType: !895, size: 32, align: 32, offset: 608)
!2023 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1575, file: !35, line: 1643, baseType: !895, size: 32, align: 32, offset: 640)
!2024 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1575, file: !35, line: 1657, baseType: !1196, size: 64, align: 64, offset: 704)
!2025 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1575, file: !35, line: 1658, baseType: !895, size: 32, align: 32, offset: 768)
!2026 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1575, file: !35, line: 1679, baseType: !1636, size: 64, align: 32, offset: 800)
!2027 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1575, file: !35, line: 1688, baseType: !895, size: 32, align: 32, offset: 864)
!2028 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1575, file: !35, line: 1712, baseType: !895, size: 32, align: 32, offset: 896)
!2029 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1575, file: !35, line: 1729, baseType: !895, size: 32, align: 32, offset: 928)
!2030 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1575, file: !35, line: 1729, baseType: !895, size: 32, align: 32, offset: 960)
!2031 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1575, file: !35, line: 1744, baseType: !895, size: 32, align: 32, offset: 992)
!2032 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1575, file: !35, line: 1744, baseType: !895, size: 32, align: 32, offset: 1024)
!2033 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1575, file: !35, line: 1751, baseType: !895, size: 32, align: 32, offset: 1056)
!2034 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1575, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!2035 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1575, file: !35, line: 1791, baseType: !2036, size: 64, align: 64, offset: 1152)
!2036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2037, size: 64, align: 64)
!2037 = !DISubroutineType(types: !2038)
!2038 = !{null, !2039, !1775, !1507, !895, !895, !895}
!2039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!2040 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1575, file: !35, line: 1808, baseType: !2041, size: 64, align: 64, offset: 1216)
!2041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2042, size: 64, align: 64)
!2042 = !DISubroutineType(types: !2043)
!2043 = !{!494, !2039, !1643}
!2044 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1575, file: !35, line: 1816, baseType: !895, size: 32, align: 32, offset: 1280)
!2045 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1575, file: !35, line: 1825, baseType: !1469, size: 32, align: 32, offset: 1312)
!2046 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1575, file: !35, line: 1830, baseType: !895, size: 32, align: 32, offset: 1344)
!2047 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1575, file: !35, line: 1838, baseType: !1469, size: 32, align: 32, offset: 1376)
!2048 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1575, file: !35, line: 1846, baseType: !895, size: 32, align: 32, offset: 1408)
!2049 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1575, file: !35, line: 1851, baseType: !895, size: 32, align: 32, offset: 1440)
!2050 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1575, file: !35, line: 1861, baseType: !1469, size: 32, align: 32, offset: 1472)
!2051 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1575, file: !35, line: 1868, baseType: !1469, size: 32, align: 32, offset: 1504)
!2052 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1575, file: !35, line: 1875, baseType: !1469, size: 32, align: 32, offset: 1536)
!2053 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1575, file: !35, line: 1882, baseType: !1469, size: 32, align: 32, offset: 1568)
!2054 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1575, file: !35, line: 1889, baseType: !1469, size: 32, align: 32, offset: 1600)
!2055 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1575, file: !35, line: 1896, baseType: !1469, size: 32, align: 32, offset: 1632)
!2056 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1575, file: !35, line: 1903, baseType: !1469, size: 32, align: 32, offset: 1664)
!2057 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1575, file: !35, line: 1910, baseType: !895, size: 32, align: 32, offset: 1696)
!2058 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1575, file: !35, line: 1915, baseType: !895, size: 32, align: 32, offset: 1728)
!2059 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1575, file: !35, line: 1926, baseType: !1507, size: 64, align: 64, offset: 1792)
!2060 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1575, file: !35, line: 1935, baseType: !1636, size: 64, align: 32, offset: 1856)
!2061 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1575, file: !35, line: 1942, baseType: !895, size: 32, align: 32, offset: 1920)
!2062 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1575, file: !35, line: 1948, baseType: !895, size: 32, align: 32, offset: 1952)
!2063 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1575, file: !35, line: 1954, baseType: !895, size: 32, align: 32, offset: 1984)
!2064 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1575, file: !35, line: 1960, baseType: !895, size: 32, align: 32, offset: 2016)
!2065 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1575, file: !35, line: 1984, baseType: !895, size: 32, align: 32, offset: 2048)
!2066 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1575, file: !35, line: 1991, baseType: !895, size: 32, align: 32, offset: 2080)
!2067 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1575, file: !35, line: 1996, baseType: !895, size: 32, align: 32, offset: 2112)
!2068 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1575, file: !35, line: 2004, baseType: !895, size: 32, align: 32, offset: 2144)
!2069 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1575, file: !35, line: 2011, baseType: !895, size: 32, align: 32, offset: 2176)
!2070 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1575, file: !35, line: 2018, baseType: !895, size: 32, align: 32, offset: 2208)
!2071 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1575, file: !35, line: 2027, baseType: !895, size: 32, align: 32, offset: 2240)
!2072 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1575, file: !35, line: 2034, baseType: !895, size: 32, align: 32, offset: 2272)
!2073 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1575, file: !35, line: 2044, baseType: !895, size: 32, align: 32, offset: 2304)
!2074 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1575, file: !35, line: 2054, baseType: !1497, size: 64, align: 64, offset: 2368)
!2075 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1575, file: !35, line: 2061, baseType: !1497, size: 64, align: 64, offset: 2432)
!2076 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1575, file: !35, line: 2066, baseType: !895, size: 32, align: 32, offset: 2496)
!2077 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1575, file: !35, line: 2070, baseType: !895, size: 32, align: 32, offset: 2528)
!2078 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1575, file: !35, line: 2078, baseType: !895, size: 32, align: 32, offset: 2560)
!2079 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1575, file: !35, line: 2085, baseType: !895, size: 32, align: 32, offset: 2592)
!2080 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1575, file: !35, line: 2092, baseType: !895, size: 32, align: 32, offset: 2624)
!2081 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1575, file: !35, line: 2099, baseType: !895, size: 32, align: 32, offset: 2656)
!2082 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1575, file: !35, line: 2106, baseType: !895, size: 32, align: 32, offset: 2688)
!2083 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1575, file: !35, line: 2113, baseType: !895, size: 32, align: 32, offset: 2720)
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1575, file: !35, line: 2120, baseType: !895, size: 32, align: 32, offset: 2752)
!2085 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1575, file: !35, line: 2125, baseType: !895, size: 32, align: 32, offset: 2784)
!2086 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1575, file: !35, line: 2133, baseType: !895, size: 32, align: 32, offset: 2816)
!2087 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1575, file: !35, line: 2140, baseType: !895, size: 32, align: 32, offset: 2848)
!2088 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1575, file: !35, line: 2145, baseType: !895, size: 32, align: 32, offset: 2880)
