; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--flac_parser.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--flac_parser.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecParserContext = type { i8*, %struct.AVCodecParser*, i64, i64, i64, i32, i32, i64, i64, i64, i64, i32, i32, [4 x i64], [4 x i64], [4 x i64], i32, i64, [4 x i64], i32, i64, i32, i32, i32, [4 x i64], i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!863 = !{!864, !865, !866, !867, !868, !869, !870, !871}
!864 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!865 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!866 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!867 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!868 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!869 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!870 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!871 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892}
!886 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!887 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!888 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!889 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!890 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!891 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!892 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !894, line: 49, size: 32, align: 32, elements: !895)
!894 = !DIFile(filename: "./libavutil/crc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!895 = !{!896, !897, !898, !899, !900, !901, !902, !903, !904}
!896 = !DIEnumerator(name: "AV_CRC_8_ATM", value: 0)
!897 = !DIEnumerator(name: "AV_CRC_16_ANSI", value: 1)
!898 = !DIEnumerator(name: "AV_CRC_16_CCITT", value: 2)
!899 = !DIEnumerator(name: "AV_CRC_32_IEEE", value: 3)
!900 = !DIEnumerator(name: "AV_CRC_32_IEEE_LE", value: 4)
!901 = !DIEnumerator(name: "AV_CRC_16_ANSI_LE", value: 5)
!902 = !DIEnumerator(name: "AV_CRC_24_IEEE", value: 6)
!903 = !DIEnumerator(name: "AV_CRC_8_EBU", value: 7)
!904 = !DIEnumerator(name: "AV_CRC_MAX", value: 8)
!905 = !{!906, !907, !908, !909, !918, !924}
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!907 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!908 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !912, line: 222, size: 16, align: 8, elements: !913)
!912 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!913 = !{!914}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !911, file: !912, line: 222, baseType: !915, size: 16, align: 16)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !916, line: 49, baseType: !917)
!916 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!917 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !912, line: 221, size: 32, align: 8, elements: !921)
!921 = !{!922}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !920, file: !912, line: 221, baseType: !923, size: 32, align: 32)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !916, line: 51, baseType: !908)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !916, line: 48, baseType: !926)
!926 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!927 = !{!928}
!928 = distinct !DIGlobalVariable(name: "ff_flac_parser", scope: !0, file: !929, line: 756, type: !930, isLocal: false, isDefinition: true, variable: { [5 x i32], i32, i32 (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecParserContext*, %struct.AVCodecContext*, i8**, i32*, i8*, i32)*, void (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecContext*, i8*, i32)*, %struct.AVCodecParser* }* @ff_flac_parser)
!929 = !DIFile(filename: "libavcodec/flac_parser.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParser", file: !4, line: 5272, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParser", file: !4, line: 5259, size: 512, align: 64, elements: !932)
!932 = !{!933, !937, !938, !988, !1580, !1584, !1588}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !931, file: !4, line: 5260, baseType: !934, size: 160, align: 32)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 160, align: 32, elements: !935)
!935 = !{!936}
!936 = !DISubrange(count: 5)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !931, file: !4, line: 5261, baseType: !907, size: 32, align: 32, offset: 160)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "parser_init", scope: !931, file: !4, line: 5262, baseType: !939, size: 64, align: 64, offset: 192)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!907, !942}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParserContext", file: !4, line: 5257, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParserContext", file: !4, line: 5092, size: 2816, align: 64, elements: !945)
!945 = !{!946, !947, !949, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !944, file: !4, line: 5093, baseType: !906, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !944, file: !4, line: 5094, baseType: !948, size: 64, align: 64, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !944, file: !4, line: 5095, baseType: !950, size: 64, align: 64, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !916, line: 40, baseType: !951)
!951 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "cur_offset", scope: !944, file: !4, line: 5096, baseType: !950, size: 64, align: 64, offset: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame_offset", scope: !944, file: !4, line: 5098, baseType: !950, size: 64, align: 64, offset: 256)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !944, file: !4, line: 5100, baseType: !907, size: 32, align: 32, offset: 320)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !944, file: !4, line: 5110, baseType: !907, size: 32, align: 32, offset: 352)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !944, file: !4, line: 5111, baseType: !950, size: 64, align: 64, offset: 384)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !944, file: !4, line: 5112, baseType: !950, size: 64, align: 64, offset: 448)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "last_pts", scope: !944, file: !4, line: 5115, baseType: !950, size: 64, align: 64, offset: 512)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "last_dts", scope: !944, file: !4, line: 5116, baseType: !950, size: 64, align: 64, offset: 576)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "fetch_timestamp", scope: !944, file: !4, line: 5117, baseType: !907, size: 32, align: 32, offset: 640)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_start_index", scope: !944, file: !4, line: 5120, baseType: !907, size: 32, align: 32, offset: 672)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_offset", scope: !944, file: !4, line: 5121, baseType: !963, size: 256, align: 64, offset: 704)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 256, align: 64, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 4)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pts", scope: !944, file: !4, line: 5122, baseType: !963, size: 256, align: 64, offset: 960)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_dts", scope: !944, file: !4, line: 5123, baseType: !963, size: 256, align: 64, offset: 1216)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !944, file: !4, line: 5125, baseType: !907, size: 32, align: 32, offset: 1472)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !944, file: !4, line: 5132, baseType: !950, size: 64, align: 64, offset: 1536)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_end", scope: !944, file: !4, line: 5133, baseType: !963, size: 256, align: 64, offset: 1600)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !944, file: !4, line: 5141, baseType: !907, size: 32, align: 32, offset: 1856)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !944, file: !4, line: 5148, baseType: !950, size: 64, align: 64, offset: 1920)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "dts_sync_point", scope: !944, file: !4, line: 5161, baseType: !907, size: 32, align: 32, offset: 1984)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "dts_ref_dts_delta", scope: !944, file: !4, line: 5176, baseType: !907, size: 32, align: 32, offset: 2016)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "pts_dts_delta", scope: !944, file: !4, line: 5190, baseType: !907, size: 32, align: 32, offset: 2048)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pos", scope: !944, file: !4, line: 5197, baseType: !963, size: 256, align: 64, offset: 2112)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !944, file: !4, line: 5202, baseType: !950, size: 64, align: 64, offset: 2368)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !944, file: !4, line: 5207, baseType: !950, size: 64, align: 64, offset: 2432)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !944, file: !4, line: 5214, baseType: !907, size: 32, align: 32, offset: 2496)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !944, file: !4, line: 5216, baseType: !3, size: 32, align: 32, offset: 2528)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "picture_structure", scope: !944, file: !4, line: 5226, baseType: !12, size: 32, align: 32, offset: 2560)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "output_picture_number", scope: !944, file: !4, line: 5234, baseType: !907, size: 32, align: 32, offset: 2592)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !944, file: !4, line: 5239, baseType: !907, size: 32, align: 32, offset: 2624)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !944, file: !4, line: 5240, baseType: !907, size: 32, align: 32, offset: 2656)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !944, file: !4, line: 5245, baseType: !907, size: 32, align: 32, offset: 2688)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !944, file: !4, line: 5246, baseType: !907, size: 32, align: 32, offset: 2720)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !944, file: !4, line: 5256, baseType: !907, size: 32, align: 32, offset: 2752)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "parser_parse", scope: !931, file: !4, line: 5265, baseType: !989, size: 64, align: 64, offset: 256)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!907, !942, !992, !1579, !1272, !1475, !907}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !995)
!995 = !{!996, !1040, !1041, !1042, !1302, !1303, !1304, !1305, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1331, !1335, !1336, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1517, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !994, file: !4, line: 1561, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !19, line: 143, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !19, line: 67, size: 640, align: 64, elements: !1001)
!1001 = !{!1002, !1006, !1010, !1014, !1015, !1016, !1017, !1021, !1027, !1029, !1033}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1000, file: !19, line: 72, baseType: !1003, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1005 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1000, file: !19, line: 78, baseType: !1007, size: 64, align: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!1003, !906}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1000, file: !19, line: 85, baseType: !1011, size: 64, align: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1013 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !19, line: 85, flags: DIFlagFwdDecl)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1000, file: !19, line: 93, baseType: !907, size: 32, align: 32, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1000, file: !19, line: 99, baseType: !907, size: 32, align: 32, offset: 224)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1000, file: !19, line: 108, baseType: !907, size: 32, align: 32, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1000, file: !19, line: 113, baseType: !1018, size: 64, align: 64, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!906, !906, !906}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1000, file: !19, line: 123, baseType: !1022, size: 64, align: 64, offset: 384)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!1025, !1025}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1000)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1000, file: !19, line: 130, baseType: !1028, size: 32, align: 32, offset: 448)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !19, line: 48, baseType: !18)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1000, file: !19, line: 136, baseType: !1030, size: 64, align: 64, offset: 512)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!1028, !906}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1000, file: !19, line: 142, baseType: !1034, size: 64, align: 64, offset: 576)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!907, !1037, !906, !1003, !907}
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !19, line: 60, flags: DIFlagFwdDecl)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !994, file: !4, line: 1562, baseType: !907, size: 32, align: 32, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !994, file: !4, line: 1564, baseType: !39, size: 32, align: 32, offset: 96)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !994, file: !4, line: 1565, baseType: !1043, size: 64, align: 64, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1046)
!1046 = !{!1047, !1048, !1049, !1050, !1051, !1052, !1061, !1064, !1067, !1070, !1075, !1076, !1077, !1085, !1086, !1087, !1089, !1093, !1099, !1104, !1108, !1109, !1152, !1273, !1277, !1278, !1282, !1286, !1291, !1295, !1296, !1297}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1045, file: !4, line: 3475, baseType: !1003, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1045, file: !4, line: 3480, baseType: !1003, size: 64, align: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1045, file: !4, line: 3481, baseType: !39, size: 32, align: 32, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1045, file: !4, line: 3482, baseType: !49, size: 32, align: 32, offset: 160)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1045, file: !4, line: 3487, baseType: !907, size: 32, align: 32, offset: 192)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1045, file: !4, line: 3488, baseType: !1053, size: 64, align: 64, offset: 256)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1055)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1056, line: 61, baseType: !1057)
!1056 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1056, line: 58, size: 64, align: 32, elements: !1058)
!1058 = !{!1059, !1060}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1057, file: !1056, line: 59, baseType: !907, size: 32, align: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1057, file: !1056, line: 60, baseType: !907, size: 32, align: 32, offset: 32)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1045, file: !4, line: 3489, baseType: !1062, size: 64, align: 64, offset: 320)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1045, file: !4, line: 3490, baseType: !1065, size: 64, align: 64, offset: 384)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !907)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1045, file: !4, line: 3491, baseType: !1068, size: 64, align: 64, offset: 448)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1045, file: !4, line: 3492, baseType: !1071, size: 64, align: 64, offset: 512)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1073)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !916, line: 55, baseType: !1074)
!1074 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1045, file: !4, line: 3493, baseType: !925, size: 8, align: 8, offset: 576)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1045, file: !4, line: 3494, baseType: !997, size: 64, align: 64, offset: 640)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1045, file: !4, line: 3495, baseType: !1078, size: 64, align: 64, offset: 704)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1080)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1082)
!1082 = !{!1083, !1084}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1081, file: !4, line: 3402, baseType: !907, size: 32, align: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1081, file: !4, line: 3403, baseType: !1003, size: 64, align: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1045, file: !4, line: 3507, baseType: !1003, size: 64, align: 64, offset: 768)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1045, file: !4, line: 3516, baseType: !907, size: 32, align: 32, offset: 832)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1045, file: !4, line: 3517, baseType: !1088, size: 64, align: 64, offset: 896)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1045, file: !4, line: 3527, baseType: !1090, size: 64, align: 64, offset: 960)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!907, !992}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1045, file: !4, line: 3535, baseType: !1094, size: 64, align: 64, offset: 1024)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!907, !992, !1097}
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1045, file: !4, line: 3541, baseType: !1100, size: 64, align: 64, offset: 1088)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1102)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1103)
!1103 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1045, file: !4, line: 3549, baseType: !1105, size: 64, align: 64, offset: 1152)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{null, !1088}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1045, file: !4, line: 3551, baseType: !1090, size: 64, align: 64, offset: 1216)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1045, file: !4, line: 3552, baseType: !1110, size: 64, align: 64, offset: 1280)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!907, !992, !924, !907, !1113}
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1115)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1116)
!1116 = !{!1117, !1118, !1119, !1120, !1121, !1151}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1115, file: !4, line: 3921, baseType: !915, size: 16, align: 16)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1115, file: !4, line: 3922, baseType: !923, size: 32, align: 32, offset: 32)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1115, file: !4, line: 3923, baseType: !923, size: 32, align: 32, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1115, file: !4, line: 3924, baseType: !908, size: 32, align: 32, offset: 96)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1115, file: !4, line: 3925, baseType: !1122, size: 64, align: 64, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1125)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1126)
!1126 = !{!1127, !1128, !1129, !1130, !1131, !1132, !1142, !1144, !1146, !1147, !1149, !1150}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1125, file: !4, line: 3886, baseType: !907, size: 32, align: 32)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1125, file: !4, line: 3887, baseType: !907, size: 32, align: 32, offset: 32)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1125, file: !4, line: 3888, baseType: !907, size: 32, align: 32, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1125, file: !4, line: 3889, baseType: !907, size: 32, align: 32, offset: 96)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1125, file: !4, line: 3890, baseType: !907, size: 32, align: 32, offset: 128)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1125, file: !4, line: 3897, baseType: !1133, size: 768, align: 64, offset: 192)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1134)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1135)
!1135 = !{!1136, !1140}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1134, file: !4, line: 3855, baseType: !1137, size: 512, align: 64)
!1137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !924, size: 512, align: 64, elements: !1138)
!1138 = !{!1139}
!1139 = !DISubrange(count: 8)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1134, file: !4, line: 3857, baseType: !1141, size: 256, align: 32, offset: 512)
!1141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 256, align: 32, elements: !1138)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1125, file: !4, line: 3903, baseType: !1143, size: 256, align: 64, offset: 960)
!1143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !924, size: 256, align: 64, elements: !964)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1125, file: !4, line: 3904, baseType: !1145, size: 128, align: 32, offset: 1216)
!1145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 128, align: 32, elements: !964)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1125, file: !4, line: 3906, baseType: !725, size: 32, align: 32, offset: 1344)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1125, file: !4, line: 3908, baseType: !1148, size: 64, align: 64, offset: 1408)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1125, file: !4, line: 3915, baseType: !1148, size: 64, align: 64, offset: 1472)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1125, file: !4, line: 3917, baseType: !907, size: 32, align: 32, offset: 1536)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1115, file: !4, line: 3926, baseType: !950, size: 64, align: 64, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1045, file: !4, line: 3564, baseType: !1153, size: 64, align: 64, offset: 1344)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!907, !992, !1156, !1190, !1272}
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1159)
!1159 = !{!1160, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1186, !1187, !1188, !1189}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1158, file: !4, line: 1451, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1163, line: 94, baseType: !1164)
!1163 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1163, line: 81, size: 192, align: 64, elements: !1165)
!1165 = !{!1166, !1170, !1171}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1164, file: !1163, line: 82, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1163, line: 73, baseType: !1169)
!1169 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1163, line: 73, flags: DIFlagFwdDecl)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1164, file: !1163, line: 89, baseType: !924, size: 64, align: 64, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1164, file: !1163, line: 93, baseType: !907, size: 32, align: 32, offset: 128)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1158, file: !4, line: 1461, baseType: !950, size: 64, align: 64, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1158, file: !4, line: 1467, baseType: !950, size: 64, align: 64, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1158, file: !4, line: 1468, baseType: !924, size: 64, align: 64, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1158, file: !4, line: 1469, baseType: !907, size: 32, align: 32, offset: 256)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1158, file: !4, line: 1470, baseType: !907, size: 32, align: 32, offset: 288)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1158, file: !4, line: 1474, baseType: !907, size: 32, align: 32, offset: 320)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1158, file: !4, line: 1479, baseType: !1179, size: 64, align: 64, offset: 384)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1182)
!1182 = !{!1183, !1184, !1185}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1181, file: !4, line: 1412, baseType: !924, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1181, file: !4, line: 1413, baseType: !907, size: 32, align: 32, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1181, file: !4, line: 1414, baseType: !731, size: 32, align: 32, offset: 96)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1158, file: !4, line: 1480, baseType: !907, size: 32, align: 32, offset: 448)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1158, file: !4, line: 1486, baseType: !950, size: 64, align: 64, offset: 512)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1158, file: !4, line: 1488, baseType: !950, size: 64, align: 64, offset: 576)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1158, file: !4, line: 1497, baseType: !950, size: 64, align: 64, offset: 640)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1192)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !772, line: 646, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !772, line: 268, size: 4288, align: 64, elements: !1194)
!1194 = !{!1195, !1196, !1197, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1224, !1226, !1227, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1260, !1261, !1262, !1263, !1264, !1265, !1268, !1269, !1270, !1271}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1193, file: !772, line: 282, baseType: !1137, size: 512, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1193, file: !772, line: 299, baseType: !1141, size: 256, align: 32, offset: 512)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1193, file: !772, line: 315, baseType: !1198, size: 64, align: 64, offset: 768)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1193, file: !772, line: 326, baseType: !907, size: 32, align: 32, offset: 832)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1193, file: !772, line: 326, baseType: !907, size: 32, align: 32, offset: 864)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1193, file: !772, line: 334, baseType: !907, size: 32, align: 32, offset: 896)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1193, file: !772, line: 341, baseType: !907, size: 32, align: 32, offset: 928)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1193, file: !772, line: 346, baseType: !907, size: 32, align: 32, offset: 960)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1193, file: !772, line: 351, baseType: !761, size: 32, align: 32, offset: 992)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1193, file: !772, line: 356, baseType: !1055, size: 64, align: 32, offset: 1024)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1193, file: !772, line: 361, baseType: !950, size: 64, align: 64, offset: 1088)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1193, file: !772, line: 369, baseType: !950, size: 64, align: 64, offset: 1152)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1193, file: !772, line: 377, baseType: !950, size: 64, align: 64, offset: 1216)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1193, file: !772, line: 382, baseType: !907, size: 32, align: 32, offset: 1280)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1193, file: !772, line: 386, baseType: !907, size: 32, align: 32, offset: 1312)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1193, file: !772, line: 391, baseType: !907, size: 32, align: 32, offset: 1344)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1193, file: !772, line: 396, baseType: !906, size: 64, align: 64, offset: 1408)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1193, file: !772, line: 403, baseType: !1214, size: 512, align: 64, offset: 1472)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1073, size: 512, align: 64, elements: !1138)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1193, file: !772, line: 410, baseType: !907, size: 32, align: 32, offset: 1984)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1193, file: !772, line: 415, baseType: !907, size: 32, align: 32, offset: 2016)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1193, file: !772, line: 420, baseType: !907, size: 32, align: 32, offset: 2048)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1193, file: !772, line: 425, baseType: !907, size: 32, align: 32, offset: 2080)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1193, file: !772, line: 435, baseType: !950, size: 64, align: 64, offset: 2112)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1193, file: !772, line: 440, baseType: !907, size: 32, align: 32, offset: 2176)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1193, file: !772, line: 445, baseType: !1073, size: 64, align: 64, offset: 2240)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1193, file: !772, line: 459, baseType: !1223, size: 512, align: 64, offset: 2304)
!1223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1161, size: 512, align: 64, elements: !1138)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1193, file: !772, line: 473, baseType: !1225, size: 64, align: 64, offset: 2816)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1193, file: !772, line: 477, baseType: !907, size: 32, align: 32, offset: 2880)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1193, file: !772, line: 479, baseType: !1228, size: 64, align: 64, offset: 2944)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !772, line: 207, baseType: !1231)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !772, line: 201, size: 320, align: 64, elements: !1232)
!1232 = !{!1233, !1234, !1235, !1236, !1241}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1231, file: !772, line: 202, baseType: !771, size: 32, align: 32)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1231, file: !772, line: 203, baseType: !924, size: 64, align: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1231, file: !772, line: 204, baseType: !907, size: 32, align: 32, offset: 128)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1231, file: !772, line: 205, baseType: !1237, size: 64, align: 64, offset: 192)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1239, line: 86, baseType: !1240)
!1239 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1240 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1239, line: 86, flags: DIFlagFwdDecl)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1231, file: !772, line: 206, baseType: !1161, size: 64, align: 64, offset: 256)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1193, file: !772, line: 480, baseType: !907, size: 32, align: 32, offset: 3008)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1193, file: !772, line: 505, baseType: !907, size: 32, align: 32, offset: 3040)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1193, file: !772, line: 512, baseType: !795, size: 32, align: 32, offset: 3072)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1193, file: !772, line: 514, baseType: !801, size: 32, align: 32, offset: 3104)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1193, file: !772, line: 516, baseType: !819, size: 32, align: 32, offset: 3136)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1193, file: !772, line: 523, baseType: !843, size: 32, align: 32, offset: 3168)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1193, file: !772, line: 525, baseType: !862, size: 32, align: 32, offset: 3200)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1193, file: !772, line: 532, baseType: !950, size: 64, align: 64, offset: 3264)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1193, file: !772, line: 539, baseType: !950, size: 64, align: 64, offset: 3328)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1193, file: !772, line: 547, baseType: !950, size: 64, align: 64, offset: 3392)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1193, file: !772, line: 554, baseType: !1237, size: 64, align: 64, offset: 3456)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1193, file: !772, line: 563, baseType: !907, size: 32, align: 32, offset: 3520)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1193, file: !772, line: 572, baseType: !907, size: 32, align: 32, offset: 3552)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1193, file: !772, line: 581, baseType: !907, size: 32, align: 32, offset: 3584)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1193, file: !772, line: 588, baseType: !1257, size: 64, align: 64, offset: 3648)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !916, line: 36, baseType: !1259)
!1259 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1193, file: !772, line: 593, baseType: !907, size: 32, align: 32, offset: 3712)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1193, file: !772, line: 596, baseType: !907, size: 32, align: 32, offset: 3744)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1193, file: !772, line: 599, baseType: !1161, size: 64, align: 64, offset: 3776)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1193, file: !772, line: 605, baseType: !1161, size: 64, align: 64, offset: 3840)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1193, file: !772, line: 616, baseType: !1161, size: 64, align: 64, offset: 3904)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1193, file: !772, line: 626, baseType: !1266, size: 64, align: 64, offset: 3968)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1267, line: 216, baseType: !1074)
!1267 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1193, file: !772, line: 627, baseType: !1266, size: 64, align: 64, offset: 4032)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1193, file: !772, line: 628, baseType: !1266, size: 64, align: 64, offset: 4096)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1193, file: !772, line: 629, baseType: !1266, size: 64, align: 64, offset: 4160)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1193, file: !772, line: 645, baseType: !1161, size: 64, align: 64, offset: 4224)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1045, file: !4, line: 3566, baseType: !1274, size: 64, align: 64, offset: 1408)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!907, !992, !906, !1272, !1156}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1045, file: !4, line: 3567, baseType: !1090, size: 64, align: 64, offset: 1472)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1045, file: !4, line: 3576, baseType: !1279, size: 64, align: 64, offset: 1536)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{!907, !992, !1190}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1045, file: !4, line: 3577, baseType: !1283, size: 64, align: 64, offset: 1600)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!907, !992, !1156}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1045, file: !4, line: 3584, baseType: !1287, size: 64, align: 64, offset: 1664)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{!907, !992, !1290}
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1045, file: !4, line: 3589, baseType: !1292, size: 64, align: 64, offset: 1728)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{null, !992}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1045, file: !4, line: 3594, baseType: !907, size: 32, align: 32, offset: 1792)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1045, file: !4, line: 3600, baseType: !1003, size: 64, align: 64, offset: 1856)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1045, file: !4, line: 3609, baseType: !1298, size: 64, align: 64, offset: 1920)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1301)
!1301 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !994, file: !4, line: 1566, baseType: !49, size: 32, align: 32, offset: 192)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !994, file: !4, line: 1581, baseType: !908, size: 32, align: 32, offset: 224)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !994, file: !4, line: 1583, baseType: !906, size: 64, align: 64, offset: 256)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !994, file: !4, line: 1591, baseType: !1306, size: 64, align: 64, offset: 320)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !994, file: !4, line: 1598, baseType: !906, size: 64, align: 64, offset: 384)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !994, file: !4, line: 1606, baseType: !950, size: 64, align: 64, offset: 448)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !994, file: !4, line: 1614, baseType: !907, size: 32, align: 32, offset: 512)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !994, file: !4, line: 1622, baseType: !907, size: 32, align: 32, offset: 544)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !994, file: !4, line: 1628, baseType: !907, size: 32, align: 32, offset: 576)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !994, file: !4, line: 1636, baseType: !907, size: 32, align: 32, offset: 608)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !994, file: !4, line: 1643, baseType: !907, size: 32, align: 32, offset: 640)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !994, file: !4, line: 1657, baseType: !924, size: 64, align: 64, offset: 704)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !994, file: !4, line: 1658, baseType: !907, size: 32, align: 32, offset: 768)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !994, file: !4, line: 1679, baseType: !1055, size: 64, align: 32, offset: 800)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !994, file: !4, line: 1688, baseType: !907, size: 32, align: 32, offset: 864)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !994, file: !4, line: 1712, baseType: !907, size: 32, align: 32, offset: 896)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !994, file: !4, line: 1729, baseType: !907, size: 32, align: 32, offset: 928)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !994, file: !4, line: 1729, baseType: !907, size: 32, align: 32, offset: 960)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !994, file: !4, line: 1744, baseType: !907, size: 32, align: 32, offset: 992)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !994, file: !4, line: 1744, baseType: !907, size: 32, align: 32, offset: 1024)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !994, file: !4, line: 1751, baseType: !907, size: 32, align: 32, offset: 1056)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !994, file: !4, line: 1766, baseType: !508, size: 32, align: 32, offset: 1088)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !994, file: !4, line: 1791, baseType: !1327, size: 64, align: 64, offset: 1152)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{null, !1330, !1190, !1272, !907, !907, !907}
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !994, file: !4, line: 1808, baseType: !1332, size: 64, align: 64, offset: 1216)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!508, !1330, !1062}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !994, file: !4, line: 1816, baseType: !907, size: 32, align: 32, offset: 1280)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !994, file: !4, line: 1825, baseType: !1337, size: 32, align: 32, offset: 1312)
!1337 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !994, file: !4, line: 1830, baseType: !907, size: 32, align: 32, offset: 1344)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !994, file: !4, line: 1838, baseType: !1337, size: 32, align: 32, offset: 1376)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !994, file: !4, line: 1846, baseType: !907, size: 32, align: 32, offset: 1408)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !994, file: !4, line: 1851, baseType: !907, size: 32, align: 32, offset: 1440)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !994, file: !4, line: 1861, baseType: !1337, size: 32, align: 32, offset: 1472)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !994, file: !4, line: 1868, baseType: !1337, size: 32, align: 32, offset: 1504)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !994, file: !4, line: 1875, baseType: !1337, size: 32, align: 32, offset: 1536)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !994, file: !4, line: 1882, baseType: !1337, size: 32, align: 32, offset: 1568)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !994, file: !4, line: 1889, baseType: !1337, size: 32, align: 32, offset: 1600)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !994, file: !4, line: 1896, baseType: !1337, size: 32, align: 32, offset: 1632)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !994, file: !4, line: 1903, baseType: !1337, size: 32, align: 32, offset: 1664)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !994, file: !4, line: 1910, baseType: !907, size: 32, align: 32, offset: 1696)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !994, file: !4, line: 1915, baseType: !907, size: 32, align: 32, offset: 1728)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !994, file: !4, line: 1926, baseType: !1272, size: 64, align: 64, offset: 1792)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !994, file: !4, line: 1935, baseType: !1055, size: 64, align: 32, offset: 1856)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !994, file: !4, line: 1942, baseType: !907, size: 32, align: 32, offset: 1920)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !994, file: !4, line: 1948, baseType: !907, size: 32, align: 32, offset: 1952)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !994, file: !4, line: 1954, baseType: !907, size: 32, align: 32, offset: 1984)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !994, file: !4, line: 1960, baseType: !907, size: 32, align: 32, offset: 2016)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !994, file: !4, line: 1984, baseType: !907, size: 32, align: 32, offset: 2048)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !994, file: !4, line: 1991, baseType: !907, size: 32, align: 32, offset: 2080)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !994, file: !4, line: 1996, baseType: !907, size: 32, align: 32, offset: 2112)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !994, file: !4, line: 2004, baseType: !907, size: 32, align: 32, offset: 2144)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !994, file: !4, line: 2011, baseType: !907, size: 32, align: 32, offset: 2176)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !994, file: !4, line: 2018, baseType: !907, size: 32, align: 32, offset: 2208)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !994, file: !4, line: 2027, baseType: !907, size: 32, align: 32, offset: 2240)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !994, file: !4, line: 2034, baseType: !907, size: 32, align: 32, offset: 2272)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !994, file: !4, line: 2044, baseType: !907, size: 32, align: 32, offset: 2304)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !994, file: !4, line: 2054, baseType: !1367, size: 64, align: 64, offset: 2368)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !994, file: !4, line: 2061, baseType: !1367, size: 64, align: 64, offset: 2432)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !994, file: !4, line: 2066, baseType: !907, size: 32, align: 32, offset: 2496)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !994, file: !4, line: 2070, baseType: !907, size: 32, align: 32, offset: 2528)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !994, file: !4, line: 2078, baseType: !907, size: 32, align: 32, offset: 2560)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !994, file: !4, line: 2085, baseType: !907, size: 32, align: 32, offset: 2592)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !994, file: !4, line: 2092, baseType: !907, size: 32, align: 32, offset: 2624)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !994, file: !4, line: 2099, baseType: !907, size: 32, align: 32, offset: 2656)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !994, file: !4, line: 2106, baseType: !907, size: 32, align: 32, offset: 2688)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !994, file: !4, line: 2113, baseType: !907, size: 32, align: 32, offset: 2720)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !994, file: !4, line: 2120, baseType: !907, size: 32, align: 32, offset: 2752)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !994, file: !4, line: 2125, baseType: !907, size: 32, align: 32, offset: 2784)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !994, file: !4, line: 2133, baseType: !907, size: 32, align: 32, offset: 2816)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !994, file: !4, line: 2140, baseType: !907, size: 32, align: 32, offset: 2848)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !994, file: !4, line: 2145, baseType: !907, size: 32, align: 32, offset: 2880)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !994, file: !4, line: 2153, baseType: !907, size: 32, align: 32, offset: 2912)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !994, file: !4, line: 2158, baseType: !907, size: 32, align: 32, offset: 2944)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !994, file: !4, line: 2166, baseType: !801, size: 32, align: 32, offset: 2976)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !994, file: !4, line: 2173, baseType: !819, size: 32, align: 32, offset: 3008)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !994, file: !4, line: 2180, baseType: !843, size: 32, align: 32, offset: 3040)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !994, file: !4, line: 2187, baseType: !795, size: 32, align: 32, offset: 3072)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !994, file: !4, line: 2194, baseType: !862, size: 32, align: 32, offset: 3104)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !994, file: !4, line: 2203, baseType: !907, size: 32, align: 32, offset: 3136)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !994, file: !4, line: 2209, baseType: !3, size: 32, align: 32, offset: 3168)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !994, file: !4, line: 2212, baseType: !907, size: 32, align: 32, offset: 3200)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !994, file: !4, line: 2213, baseType: !907, size: 32, align: 32, offset: 3232)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !994, file: !4, line: 2220, baseType: !708, size: 32, align: 32, offset: 3264)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !994, file: !4, line: 2232, baseType: !907, size: 32, align: 32, offset: 3296)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !994, file: !4, line: 2243, baseType: !907, size: 32, align: 32, offset: 3328)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !994, file: !4, line: 2249, baseType: !907, size: 32, align: 32, offset: 3360)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !994, file: !4, line: 2256, baseType: !907, size: 32, align: 32, offset: 3392)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !994, file: !4, line: 2263, baseType: !1073, size: 64, align: 64, offset: 3456)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !994, file: !4, line: 2270, baseType: !1073, size: 64, align: 64, offset: 3520)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !994, file: !4, line: 2277, baseType: !872, size: 32, align: 32, offset: 3584)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !994, file: !4, line: 2285, baseType: !708, size: 32, align: 32, offset: 3616)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !994, file: !4, line: 2367, baseType: !1403, size: 64, align: 64, offset: 3648)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DISubroutineType(types: !1405)
!1405 = !{!907, !1330, !1290, !907}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !994, file: !4, line: 2383, baseType: !907, size: 32, align: 32, offset: 3712)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !994, file: !4, line: 2386, baseType: !1337, size: 32, align: 32, offset: 3744)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !994, file: !4, line: 2387, baseType: !1337, size: 32, align: 32, offset: 3776)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !994, file: !4, line: 2394, baseType: !907, size: 32, align: 32, offset: 3808)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !994, file: !4, line: 2401, baseType: !907, size: 32, align: 32, offset: 3840)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !994, file: !4, line: 2408, baseType: !907, size: 32, align: 32, offset: 3872)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !994, file: !4, line: 2415, baseType: !907, size: 32, align: 32, offset: 3904)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !994, file: !4, line: 2422, baseType: !907, size: 32, align: 32, offset: 3936)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !994, file: !4, line: 2423, baseType: !1415, size: 64, align: 64, offset: 3968)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1417)
!1417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1418)
!1418 = !{!1419, !1420, !1421, !1422}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1417, file: !4, line: 827, baseType: !907, size: 32, align: 32)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1417, file: !4, line: 828, baseType: !907, size: 32, align: 32, offset: 32)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1417, file: !4, line: 829, baseType: !907, size: 32, align: 32, offset: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1417, file: !4, line: 830, baseType: !1337, size: 32, align: 32, offset: 96)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !994, file: !4, line: 2430, baseType: !950, size: 64, align: 64, offset: 4032)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !994, file: !4, line: 2437, baseType: !950, size: 64, align: 64, offset: 4096)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !994, file: !4, line: 2444, baseType: !1337, size: 32, align: 32, offset: 4160)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !994, file: !4, line: 2451, baseType: !1337, size: 32, align: 32, offset: 4192)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !994, file: !4, line: 2458, baseType: !907, size: 32, align: 32, offset: 4224)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !994, file: !4, line: 2469, baseType: !907, size: 32, align: 32, offset: 4256)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !994, file: !4, line: 2475, baseType: !907, size: 32, align: 32, offset: 4288)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !994, file: !4, line: 2481, baseType: !907, size: 32, align: 32, offset: 4320)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !994, file: !4, line: 2485, baseType: !907, size: 32, align: 32, offset: 4352)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !994, file: !4, line: 2489, baseType: !907, size: 32, align: 32, offset: 4384)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !994, file: !4, line: 2493, baseType: !907, size: 32, align: 32, offset: 4416)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !994, file: !4, line: 2501, baseType: !907, size: 32, align: 32, offset: 4448)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !994, file: !4, line: 2506, baseType: !907, size: 32, align: 32, offset: 4480)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !994, file: !4, line: 2510, baseType: !907, size: 32, align: 32, offset: 4512)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !994, file: !4, line: 2514, baseType: !950, size: 64, align: 64, offset: 4544)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !994, file: !4, line: 2528, baseType: !1439, size: 64, align: 64, offset: 4608)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1440 = !DISubroutineType(types: !1441)
!1441 = !{null, !1330, !906, !907, !907}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !994, file: !4, line: 2534, baseType: !907, size: 32, align: 32, offset: 4672)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !994, file: !4, line: 2545, baseType: !907, size: 32, align: 32, offset: 4704)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !994, file: !4, line: 2547, baseType: !907, size: 32, align: 32, offset: 4736)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !994, file: !4, line: 2549, baseType: !907, size: 32, align: 32, offset: 4768)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !994, file: !4, line: 2551, baseType: !907, size: 32, align: 32, offset: 4800)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !994, file: !4, line: 2553, baseType: !907, size: 32, align: 32, offset: 4832)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !994, file: !4, line: 2555, baseType: !907, size: 32, align: 32, offset: 4864)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !994, file: !4, line: 2557, baseType: !907, size: 32, align: 32, offset: 4896)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !994, file: !4, line: 2559, baseType: !907, size: 32, align: 32, offset: 4928)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !994, file: !4, line: 2563, baseType: !907, size: 32, align: 32, offset: 4960)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !994, file: !4, line: 2571, baseType: !1148, size: 64, align: 64, offset: 4992)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !994, file: !4, line: 2579, baseType: !1148, size: 64, align: 64, offset: 5056)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !994, file: !4, line: 2586, baseType: !907, size: 32, align: 32, offset: 5120)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !994, file: !4, line: 2615, baseType: !907, size: 32, align: 32, offset: 5152)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !994, file: !4, line: 2627, baseType: !907, size: 32, align: 32, offset: 5184)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !994, file: !4, line: 2637, baseType: !907, size: 32, align: 32, offset: 5216)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !994, file: !4, line: 2681, baseType: !907, size: 32, align: 32, offset: 5248)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !994, file: !4, line: 2709, baseType: !950, size: 64, align: 64, offset: 5312)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !994, file: !4, line: 2716, baseType: !1461, size: 64, align: 64, offset: 5376)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1463)
!1463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1464)
!1464 = !{!1465, !1466, !1467, !1468, !1469, !1470, !1471, !1477, !1481, !1482, !1483, !1484, !1490, !1491, !1492, !1493, !1494}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1463, file: !4, line: 3642, baseType: !1003, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1463, file: !4, line: 3649, baseType: !39, size: 32, align: 32, offset: 64)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1463, file: !4, line: 3656, baseType: !49, size: 32, align: 32, offset: 96)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1463, file: !4, line: 3663, baseType: !508, size: 32, align: 32, offset: 128)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1463, file: !4, line: 3669, baseType: !907, size: 32, align: 32, offset: 160)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1463, file: !4, line: 3682, baseType: !1287, size: 64, align: 64, offset: 192)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1463, file: !4, line: 3698, baseType: !1472, size: 64, align: 64, offset: 256)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DISubroutineType(types: !1474)
!1474 = !{!907, !992, !1475, !923}
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1463, file: !4, line: 3712, baseType: !1478, size: 64, align: 64, offset: 320)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DISubroutineType(types: !1480)
!1480 = !{!907, !992, !907, !1475, !923}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1463, file: !4, line: 3726, baseType: !1472, size: 64, align: 64, offset: 384)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1463, file: !4, line: 3737, baseType: !1090, size: 64, align: 64, offset: 448)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1463, file: !4, line: 3746, baseType: !907, size: 32, align: 32, offset: 512)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1463, file: !4, line: 3757, baseType: !1485, size: 64, align: 64, offset: 576)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{null, !1488}
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1463, file: !4, line: 3766, baseType: !1090, size: 64, align: 64, offset: 640)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1463, file: !4, line: 3774, baseType: !1090, size: 64, align: 64, offset: 704)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1463, file: !4, line: 3780, baseType: !907, size: 32, align: 32, offset: 768)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1463, file: !4, line: 3785, baseType: !907, size: 32, align: 32, offset: 800)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1463, file: !4, line: 3795, baseType: !1495, size: 64, align: 64, offset: 832)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{!907, !992, !1161}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !994, file: !4, line: 2728, baseType: !906, size: 64, align: 64, offset: 5440)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !994, file: !4, line: 2735, baseType: !1214, size: 512, align: 64, offset: 5504)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !994, file: !4, line: 2742, baseType: !907, size: 32, align: 32, offset: 6016)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !994, file: !4, line: 2755, baseType: !907, size: 32, align: 32, offset: 6048)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !994, file: !4, line: 2776, baseType: !907, size: 32, align: 32, offset: 6080)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !994, file: !4, line: 2783, baseType: !907, size: 32, align: 32, offset: 6112)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !994, file: !4, line: 2791, baseType: !907, size: 32, align: 32, offset: 6144)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !994, file: !4, line: 2802, baseType: !1290, size: 64, align: 64, offset: 6208)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !994, file: !4, line: 2811, baseType: !907, size: 32, align: 32, offset: 6272)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !994, file: !4, line: 2821, baseType: !907, size: 32, align: 32, offset: 6304)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !994, file: !4, line: 2830, baseType: !907, size: 32, align: 32, offset: 6336)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !994, file: !4, line: 2840, baseType: !907, size: 32, align: 32, offset: 6368)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !994, file: !4, line: 2851, baseType: !1511, size: 64, align: 64, offset: 6400)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DISubroutineType(types: !1513)
!1513 = !{!907, !1330, !1514, !906, !1272, !907, !907}
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DISubroutineType(types: !1516)
!1516 = !{!907, !1330, !906}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !994, file: !4, line: 2871, baseType: !1518, size: 64, align: 64, offset: 6464)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DISubroutineType(types: !1520)
!1520 = !{!907, !1330, !1521, !906, !1272, !907}
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DISubroutineType(types: !1523)
!1523 = !{!907, !1330, !906, !907, !907}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !994, file: !4, line: 2878, baseType: !907, size: 32, align: 32, offset: 6528)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !994, file: !4, line: 2885, baseType: !907, size: 32, align: 32, offset: 6560)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !994, file: !4, line: 3005, baseType: !907, size: 32, align: 32, offset: 6592)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !994, file: !4, line: 3013, baseType: !884, size: 32, align: 32, offset: 6624)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !994, file: !4, line: 3020, baseType: !884, size: 32, align: 32, offset: 6656)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !994, file: !4, line: 3027, baseType: !884, size: 32, align: 32, offset: 6688)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !994, file: !4, line: 3037, baseType: !924, size: 64, align: 64, offset: 6720)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !994, file: !4, line: 3038, baseType: !907, size: 32, align: 32, offset: 6784)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !994, file: !4, line: 3050, baseType: !1073, size: 64, align: 64, offset: 6848)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !994, file: !4, line: 3065, baseType: !907, size: 32, align: 32, offset: 6912)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !994, file: !4, line: 3083, baseType: !907, size: 32, align: 32, offset: 6944)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !994, file: !4, line: 3092, baseType: !1055, size: 64, align: 32, offset: 6976)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !994, file: !4, line: 3099, baseType: !508, size: 32, align: 32, offset: 7040)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !994, file: !4, line: 3106, baseType: !1055, size: 64, align: 32, offset: 7072)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !994, file: !4, line: 3113, baseType: !1539, size: 64, align: 64, offset: 7168)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64, align: 64)
!1540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1541)
!1541 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1542)
!1542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1543)
!1543 = !{!1544, !1545, !1546, !1547, !1548, !1549, !1552}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1542, file: !4, line: 713, baseType: !49, size: 32, align: 32)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1542, file: !4, line: 714, baseType: !39, size: 32, align: 32, offset: 32)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1542, file: !4, line: 720, baseType: !1003, size: 64, align: 64, offset: 64)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1542, file: !4, line: 724, baseType: !1003, size: 64, align: 64, offset: 128)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1542, file: !4, line: 728, baseType: !907, size: 32, align: 32, offset: 192)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1542, file: !4, line: 734, baseType: !1550, size: 64, align: 64, offset: 256)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1542, file: !4, line: 739, baseType: !1553, size: 64, align: 64, offset: 320)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1081)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !994, file: !4, line: 3129, baseType: !950, size: 64, align: 64, offset: 7232)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !994, file: !4, line: 3130, baseType: !950, size: 64, align: 64, offset: 7296)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !994, file: !4, line: 3131, baseType: !950, size: 64, align: 64, offset: 7360)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !994, file: !4, line: 3132, baseType: !950, size: 64, align: 64, offset: 7424)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !994, file: !4, line: 3139, baseType: !1148, size: 64, align: 64, offset: 7488)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !994, file: !4, line: 3147, baseType: !907, size: 32, align: 32, offset: 7552)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !994, file: !4, line: 3165, baseType: !907, size: 32, align: 32, offset: 7584)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !994, file: !4, line: 3172, baseType: !907, size: 32, align: 32, offset: 7616)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !994, file: !4, line: 3180, baseType: !907, size: 32, align: 32, offset: 7648)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !994, file: !4, line: 3191, baseType: !1367, size: 64, align: 64, offset: 7680)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !994, file: !4, line: 3199, baseType: !924, size: 64, align: 64, offset: 7744)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !994, file: !4, line: 3207, baseType: !1148, size: 64, align: 64, offset: 7808)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !994, file: !4, line: 3214, baseType: !908, size: 32, align: 32, offset: 7872)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !994, file: !4, line: 3224, baseType: !1179, size: 64, align: 64, offset: 7936)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !994, file: !4, line: 3225, baseType: !907, size: 32, align: 32, offset: 8000)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !994, file: !4, line: 3249, baseType: !1161, size: 64, align: 64, offset: 8064)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !994, file: !4, line: 3256, baseType: !907, size: 32, align: 32, offset: 8128)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !994, file: !4, line: 3271, baseType: !907, size: 32, align: 32, offset: 8160)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !994, file: !4, line: 3279, baseType: !950, size: 64, align: 64, offset: 8192)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !994, file: !4, line: 3301, baseType: !1161, size: 64, align: 64, offset: 8256)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !994, file: !4, line: 3310, baseType: !907, size: 32, align: 32, offset: 8320)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !994, file: !4, line: 3337, baseType: !907, size: 32, align: 32, offset: 8352)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !994, file: !4, line: 3351, baseType: !907, size: 32, align: 32, offset: 8384)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !994, file: !4, line: 3359, baseType: !907, size: 32, align: 32, offset: 8416)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64, align: 64)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "parser_close", scope: !931, file: !4, line: 5269, baseType: !1581, size: 64, align: 64, offset: 320)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64, align: 64)
!1582 = !DISubroutineType(types: !1583)
!1583 = !{null, !942}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !931, file: !4, line: 5270, baseType: !1585, size: 64, align: 64, offset: 384)
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1586 = !DISubroutineType(types: !1587)
!1587 = !{!907, !992, !1475, !907}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !931, file: !4, line: 5271, baseType: !948, size: 64, align: 64, offset: 448)
!1589 = !{i32 2, !"Dwarf Version", i32 4}
!1590 = !{i32 2, !"Debug Info Version", i32 3}
!1591 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1592 = distinct !DISubprogram(name: "flac_parse_init", scope: !929, file: !929, line: 726, type: !940, isLocal: true, isDefinition: true, scopeLine: 727, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1593)
!1593 = !{}
!1594 = !DILocalVariable(name: "c", arg: 1, scope: !1592, file: !929, line: 726, type: !942)
!1595 = !DIExpression()
!1596 = !DILocation(line: 726, column: 72, scope: !1592)
!1597 = !DILocalVariable(name: "fpc", scope: !1592, file: !929, line: 728, type: !1598)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLACParseContext", file: !929, line: 92, baseType: !1600)
!1600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FLACParseContext", file: !929, line: 74, size: 1024, align: 64, elements: !1601)
!1601 = !{!1602, !1603, !1604, !1627, !1628, !1629, !1630, !1631, !1643, !1644, !1645, !1646, !1647}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !1600, file: !929, line: 75, baseType: !942, size: 64, align: 64)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1600, file: !929, line: 76, baseType: !992, size: 64, align: 64, offset: 64)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !1600, file: !929, line: 77, baseType: !1605, size: 64, align: 64, offset: 128)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLACHeaderMarker", file: !929, line: 72, baseType: !1607)
!1607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FLACHeaderMarker", file: !929, line: 59, size: 640, align: 64, elements: !1608)
!1608 = !{!1609, !1610, !1611, !1612, !1624, !1626}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1607, file: !929, line: 60, baseType: !907, size: 32, align: 32)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "link_penalty", scope: !1607, file: !929, line: 61, baseType: !1272, size: 64, align: 64, offset: 64)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "max_score", scope: !1607, file: !929, line: 63, baseType: !907, size: 32, align: 32, offset: 128)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "fi", scope: !1607, file: !929, line: 65, baseType: !1613, size: 320, align: 64, offset: 192)
!1613 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLACFrameInfo", file: !1614, line: 91, baseType: !1615)
!1614 = !DIFile(filename: "libavcodec/flac.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FLACFrameInfo", file: !1614, line: 82, size: 320, align: 64, elements: !1616)
!1616 = !{!1617, !1618, !1619, !1620, !1621, !1622, !1623}
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "samplerate", scope: !1615, file: !1614, line: 83, baseType: !907, size: 32, align: 32)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1615, file: !1614, line: 83, baseType: !907, size: 32, align: 32, offset: 32)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !1615, file: !1614, line: 83, baseType: !907, size: 32, align: 32, offset: 64)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "blocksize", scope: !1615, file: !1614, line: 84, baseType: !907, size: 32, align: 32, offset: 96)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "ch_mode", scope: !1615, file: !1614, line: 85, baseType: !907, size: 32, align: 32, offset: 128)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "frame_or_sample_num", scope: !1615, file: !1614, line: 86, baseType: !950, size: 64, align: 64, offset: 192)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "is_var_size", scope: !1615, file: !1614, line: 87, baseType: !907, size: 32, align: 32, offset: 256)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1607, file: !929, line: 66, baseType: !1625, size: 64, align: 64, offset: 512)
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "best_child", scope: !1607, file: !929, line: 69, baseType: !1625, size: 64, align: 64, offset: 576)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "best_header", scope: !1600, file: !929, line: 79, baseType: !1605, size: 64, align: 64, offset: 192)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "nb_headers_found", scope: !1600, file: !929, line: 80, baseType: !907, size: 32, align: 32, offset: 256)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "nb_headers_buffered", scope: !1600, file: !929, line: 82, baseType: !907, size: 32, align: 32, offset: 288)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "best_header_valid", scope: !1600, file: !929, line: 83, baseType: !907, size: 32, align: 32, offset: 320)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_buf", scope: !1600, file: !929, line: 85, baseType: !1632, size: 64, align: 64, offset: 384)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64, align: 64)
!1633 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFifoBuffer", file: !1634, line: 35, baseType: !1635)
!1634 = !DIFile(filename: "./libavutil/fifo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFifoBuffer", file: !1634, line: 31, size: 320, align: 64, elements: !1636)
!1636 = !{!1637, !1638, !1639, !1640, !1641, !1642}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1635, file: !1634, line: 32, baseType: !924, size: 64, align: 64)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "rptr", scope: !1635, file: !1634, line: 33, baseType: !924, size: 64, align: 64, offset: 64)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "wptr", scope: !1635, file: !1634, line: 33, baseType: !924, size: 64, align: 64, offset: 128)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1635, file: !1634, line: 33, baseType: !924, size: 64, align: 64, offset: 192)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "rndx", scope: !1635, file: !1634, line: 34, baseType: !923, size: 32, align: 32, offset: 256)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "wndx", scope: !1635, file: !1634, line: 34, baseType: !923, size: 32, align: 32, offset: 288)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "end_padded", scope: !1600, file: !929, line: 87, baseType: !907, size: 32, align: 32, offset: 448)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_buf", scope: !1600, file: !929, line: 88, baseType: !924, size: 64, align: 64, offset: 512)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_buf_allocated_size", scope: !1600, file: !929, line: 89, baseType: !907, size: 32, align: 32, offset: 576)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "last_fi", scope: !1600, file: !929, line: 90, baseType: !1613, size: 320, align: 64, offset: 640)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "last_fi_valid", scope: !1600, file: !929, line: 91, baseType: !907, size: 32, align: 32, offset: 960)
!1648 = !DILocation(line: 728, column: 23, scope: !1592)
!1649 = !DILocation(line: 728, column: 29, scope: !1592)
!1650 = !DILocation(line: 728, column: 32, scope: !1592)
!1651 = !DILocation(line: 729, column: 15, scope: !1592)
!1652 = !DILocation(line: 729, column: 5, scope: !1592)
!1653 = !DILocation(line: 729, column: 10, scope: !1592)
!1654 = !DILocation(line: 729, column: 13, scope: !1592)
!1655 = !DILocation(line: 732, column: 21, scope: !1592)
!1656 = !DILocation(line: 732, column: 5, scope: !1592)
!1657 = !DILocation(line: 732, column: 10, scope: !1592)
!1658 = !DILocation(line: 732, column: 19, scope: !1592)
!1659 = !DILocation(line: 733, column: 10, scope: !1660)
!1660 = distinct !DILexicalBlock(scope: !1592, file: !929, line: 733, column: 9)
!1661 = !DILocation(line: 733, column: 15, scope: !1660)
!1662 = !DILocation(line: 733, column: 9, scope: !1592)
!1663 = !DILocation(line: 734, column: 16, scope: !1664)
!1664 = distinct !DILexicalBlock(scope: !1660, file: !929, line: 733, column: 25)
!1665 = !DILocation(line: 734, column: 21, scope: !1664)
!1666 = !DILocation(line: 734, column: 9, scope: !1664)
!1667 = !DILocation(line: 736, column: 9, scope: !1664)
!1668 = !DILocation(line: 738, column: 5, scope: !1592)
!1669 = !DILocation(line: 739, column: 1, scope: !1592)
!1670 = distinct !DISubprogram(name: "flac_parse", scope: !929, file: !929, line: 518, type: !990, isLocal: true, isDefinition: true, scopeLine: 521, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1593)
!1671 = !DILocalVariable(name: "s", arg: 1, scope: !1670, file: !929, line: 518, type: !942)
!1672 = !DILocation(line: 518, column: 45, scope: !1670)
!1673 = !DILocalVariable(name: "avctx", arg: 2, scope: !1670, file: !929, line: 518, type: !992)
!1674 = !DILocation(line: 518, column: 64, scope: !1670)
!1675 = !DILocalVariable(name: "poutbuf", arg: 3, scope: !1670, file: !929, line: 519, type: !1579)
!1676 = !DILocation(line: 519, column: 39, scope: !1670)
!1677 = !DILocalVariable(name: "poutbuf_size", arg: 4, scope: !1670, file: !929, line: 519, type: !1272)
!1678 = !DILocation(line: 519, column: 53, scope: !1670)
!1679 = !DILocalVariable(name: "buf", arg: 5, scope: !1670, file: !929, line: 520, type: !1475)
!1680 = !DILocation(line: 520, column: 38, scope: !1670)
!1681 = !DILocalVariable(name: "buf_size", arg: 6, scope: !1670, file: !929, line: 520, type: !907)
!1682 = !DILocation(line: 520, column: 47, scope: !1670)
!1683 = !DILocalVariable(name: "fpc", scope: !1670, file: !929, line: 522, type: !1598)
!1684 = !DILocation(line: 522, column: 23, scope: !1670)
!1685 = !DILocation(line: 522, column: 29, scope: !1670)
!1686 = !DILocation(line: 522, column: 32, scope: !1670)
!1687 = !DILocalVariable(name: "curr", scope: !1670, file: !929, line: 523, type: !1605)
!1688 = !DILocation(line: 523, column: 23, scope: !1670)
!1689 = !DILocalVariable(name: "nb_headers", scope: !1670, file: !929, line: 524, type: !907)
!1690 = !DILocation(line: 524, column: 9, scope: !1670)
!1691 = !DILocalVariable(name: "read_end", scope: !1670, file: !929, line: 525, type: !1475)
!1692 = !DILocation(line: 525, column: 20, scope: !1670)
!1693 = !DILocation(line: 525, column: 31, scope: !1670)
!1694 = !DILocalVariable(name: "read_start", scope: !1670, file: !929, line: 526, type: !1475)
!1695 = !DILocation(line: 526, column: 20, scope: !1670)
!1696 = !DILocation(line: 526, column: 33, scope: !1670)
!1697 = !DILocation(line: 528, column: 9, scope: !1698)
!1698 = distinct !DILexicalBlock(scope: !1670, file: !929, line: 528, column: 9)
!1699 = !DILocation(line: 528, column: 12, scope: !1698)
!1700 = !DILocation(line: 528, column: 18, scope: !1698)
!1701 = !DILocation(line: 528, column: 9, scope: !1670)
!1702 = !DILocalVariable(name: "fi", scope: !1703, file: !929, line: 529, type: !1613)
!1703 = distinct !DILexicalBlock(scope: !1698, file: !929, line: 528, column: 28)
!1704 = !DILocation(line: 529, column: 23, scope: !1703)
!1705 = !DILocation(line: 530, column: 35, scope: !1706)
!1706 = distinct !DILexicalBlock(scope: !1703, file: !929, line: 530, column: 13)
!1707 = !DILocation(line: 530, column: 42, scope: !1706)
!1708 = !DILocation(line: 530, column: 13, scope: !1706)
!1709 = !DILocation(line: 530, column: 13, scope: !1703)
!1710 = !DILocation(line: 531, column: 30, scope: !1711)
!1711 = distinct !DILexicalBlock(scope: !1706, file: !929, line: 530, column: 53)
