; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--adx.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--adx.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!919 = !DILocalVariable(name: "bits", arg: 3, scope: !908, file: !909, line: 26, type: !888)
!920 = !DILocation(line: 26, column: 63, scope: !908)
!921 = !DILocalVariable(name: "coeff", arg: 4, scope: !908, file: !909, line: 26, type: !912)
!922 = !DILocation(line: 26, column: 74, scope: !908)
!923 = !DILocalVariable(name: "a", scope: !908, file: !909, line: 28, type: !924)
!924 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!925 = !DILocation(line: 28, column: 12, scope: !908)
!926 = !DILocalVariable(name: "b", scope: !908, file: !909, line: 28, type: !924)
!927 = !DILocation(line: 28, column: 15, scope: !908)
!928 = !DILocalVariable(name: "c", scope: !908, file: !909, line: 28, type: !924)
!929 = !DILocation(line: 28, column: 18, scope: !908)
!930 = !DILocation(line: 30, column: 35, scope: !908)
!931 = !DILocation(line: 30, column: 33, scope: !908)
!932 = !DILocation(line: 30, column: 44, scope: !908)
!933 = !DILocation(line: 30, column: 42, scope: !908)
!934 = !DILocation(line: 30, column: 18, scope: !908)
!935 = !DILocation(line: 30, column: 16, scope: !908)
!936 = !DILocation(line: 30, column: 7, scope: !908)
!937 = !DILocation(line: 31, column: 7, scope: !908)
!938 = !DILocation(line: 32, column: 10, scope: !908)
!939 = !DILocation(line: 32, column: 20, scope: !908)
!940 = !DILocation(line: 32, column: 24, scope: !908)
!941 = !DILocation(line: 32, column: 22, scope: !908)
!942 = !DILocation(line: 32, column: 30, scope: !908)
!943 = !DILocation(line: 32, column: 34, scope: !908)
!944 = !DILocation(line: 32, column: 32, scope: !908)
!945 = !DILocation(line: 32, column: 27, scope: !908)
!946 = !DILocation(line: 32, column: 14, scope: !908)
!947 = !DILocation(line: 32, column: 12, scope: !908)
!948 = !DILocation(line: 32, column: 41, scope: !908)
!949 = !DILocation(line: 32, column: 39, scope: !908)
!950 = !DILocation(line: 32, column: 7, scope: !908)
!951 = !DILocation(line: 34, column: 23, scope: !908)
!952 = !DILocation(line: 34, column: 25, scope: !908)
!953 = !DILocation(line: 34, column: 39, scope: !908)
!954 = !DILocation(line: 34, column: 36, scope: !908)
!955 = !DILocation(line: 34, column: 33, scope: !908)
!956 = !DILocation(line: 34, column: 31, scope: !908)
!957 = !DILocation(line: 34, column: 16, scope: !908)
!958 = !DILocation(line: 34, column: 5, scope: !908)
!959 = !DILocation(line: 34, column: 14, scope: !908)
!960 = !DILocation(line: 35, column: 25, scope: !908)
!961 = !DILocation(line: 35, column: 29, scope: !908)
!962 = !DILocation(line: 35, column: 27, scope: !908)
!963 = !DILocation(line: 35, column: 23, scope: !908)
!964 = !DILocation(line: 35, column: 40, scope: !908)
!965 = !DILocation(line: 35, column: 37, scope: !908)
!966 = !DILocation(line: 35, column: 34, scope: !908)
!967 = !DILocation(line: 35, column: 32, scope: !908)
!968 = !DILocation(line: 35, column: 16, scope: !908)
!969 = !DILocation(line: 35, column: 5, scope: !908)
!970 = !DILocation(line: 35, column: 14, scope: !908)
!971 = !DILocation(line: 36, column: 1, scope: !908)
!972 = distinct !DISubprogram(name: "ff_adx_decode_header", scope: !909, file: !909, line: 38, type: !973, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !913)
!973 = !DISubroutineType(types: !974)
!974 = !{!888, !975, !1465, !888, !912, !912}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !978)
!978 = !{!979, !1024, !1025, !1026, !1292, !1293, !1294, !1295, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1321, !1325, !1326, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1507, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !977, file: !35, line: 1561, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !984)
!984 = !{!985, !989, !994, !998, !999, !1000, !1001, !1005, !1011, !1013, !1017}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !983, file: !4, line: 72, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !983, file: !4, line: 78, baseType: !990, size: 64, align: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!986, !993}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !983, file: !4, line: 85, baseType: !995, size: 64, align: 64, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!997 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !983, file: !4, line: 93, baseType: !888, size: 32, align: 32, offset: 192)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !983, file: !4, line: 99, baseType: !888, size: 32, align: 32, offset: 224)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !983, file: !4, line: 108, baseType: !888, size: 32, align: 32, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !983, file: !4, line: 113, baseType: !1002, size: 64, align: 64, offset: 320)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!993, !993, !993}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !983, file: !4, line: 123, baseType: !1006, size: 64, align: 64, offset: 384)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!1009, !1009}
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !983, file: !4, line: 130, baseType: !1012, size: 32, align: 32, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !983, file: !4, line: 136, baseType: !1014, size: 64, align: 64, offset: 512)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!1012, !993}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !983, file: !4, line: 142, baseType: !1018, size: 64, align: 64, offset: 576)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!888, !1021, !993, !986, !888}
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !977, file: !35, line: 1562, baseType: !888, size: 32, align: 32, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !977, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !977, file: !35, line: 1565, baseType: !1027, size: 64, align: 64, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1030)
!1030 = !{!1031, !1032, !1033, !1034, !1035, !1036, !1045, !1048, !1051, !1054, !1059, !1062, !1063, !1071, !1072, !1073, !1075, !1079, !1085, !1090, !1094, !1095, !1143, !1263, !1267, !1268, !1272, !1276, !1281, !1285, !1286, !1287}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1029, file: !35, line: 3475, baseType: !986, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1029, file: !35, line: 3480, baseType: !986, size: 64, align: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1029, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1029, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1029, file: !35, line: 3487, baseType: !888, size: 32, align: 32, offset: 192)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1029, file: !35, line: 3488, baseType: !1037, size: 64, align: 64, offset: 256)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1040, line: 61, baseType: !1041)
!1040 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1040, line: 58, size: 64, align: 32, elements: !1042)
!1042 = !{!1043, !1044}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1041, file: !1040, line: 59, baseType: !888, size: 32, align: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1041, file: !1040, line: 60, baseType: !888, size: 32, align: 32, offset: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1029, file: !35, line: 3489, baseType: !1046, size: 64, align: 64, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1029, file: !35, line: 3490, baseType: !1049, size: 64, align: 64, offset: 384)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !888)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1029, file: !35, line: 3491, baseType: !1052, size: 64, align: 64, offset: 448)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1029, file: !35, line: 3492, baseType: !1055, size: 64, align: 64, offset: 512)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1057)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !897, line: 55, baseType: !1058)
!1058 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1029, file: !35, line: 3493, baseType: !1060, size: 8, align: 8, offset: 576)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !897, line: 48, baseType: !1061)
!1061 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1029, file: !35, line: 3494, baseType: !980, size: 64, align: 64, offset: 640)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1029, file: !35, line: 3495, baseType: !1064, size: 64, align: 64, offset: 704)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1066)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1067)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1068)
!1068 = !{!1069, !1070}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1067, file: !35, line: 3402, baseType: !888, size: 32, align: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1067, file: !35, line: 3403, baseType: !986, size: 64, align: 64, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1029, file: !35, line: 3507, baseType: !986, size: 64, align: 64, offset: 768)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1029, file: !35, line: 3516, baseType: !888, size: 32, align: 32, offset: 832)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1029, file: !35, line: 3517, baseType: !1074, size: 64, align: 64, offset: 896)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1029, file: !35, line: 3527, baseType: !1076, size: 64, align: 64, offset: 960)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!888, !975}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1029, file: !35, line: 3535, baseType: !1080, size: 64, align: 64, offset: 1024)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!888, !975, !1083}
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1029, file: !35, line: 3541, baseType: !1086, size: 64, align: 64, offset: 1088)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1088)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1089)
!1089 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1029, file: !35, line: 3549, baseType: !1091, size: 64, align: 64, offset: 1152)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{null, !1074}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1029, file: !35, line: 3551, baseType: !1076, size: 64, align: 64, offset: 1216)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1029, file: !35, line: 3552, baseType: !1096, size: 64, align: 64, offset: 1280)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!888, !975, !1099, !888, !1100}
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1102)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1103)
!1103 = !{!1104, !1105, !1106, !1107, !1108, !1140}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1102, file: !35, line: 3921, baseType: !896, size: 16, align: 16)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1102, file: !35, line: 3922, baseType: !904, size: 32, align: 32, offset: 32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1102, file: !35, line: 3923, baseType: !904, size: 32, align: 32, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1102, file: !35, line: 3924, baseType: !889, size: 32, align: 32, offset: 96)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1102, file: !35, line: 3925, baseType: !1109, size: 64, align: 64, offset: 128)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1113)
!1113 = !{!1114, !1115, !1116, !1117, !1118, !1119, !1129, !1133, !1135, !1136, !1138, !1139}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1112, file: !35, line: 3886, baseType: !888, size: 32, align: 32)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1112, file: !35, line: 3887, baseType: !888, size: 32, align: 32, offset: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1112, file: !35, line: 3888, baseType: !888, size: 32, align: 32, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1112, file: !35, line: 3889, baseType: !888, size: 32, align: 32, offset: 96)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1112, file: !35, line: 3890, baseType: !888, size: 32, align: 32, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1112, file: !35, line: 3897, baseType: !1120, size: 768, align: 64, offset: 192)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1122)
!1122 = !{!1123, !1127}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1121, file: !35, line: 3855, baseType: !1124, size: 512, align: 64)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1099, size: 512, align: 64, elements: !1125)
!1125 = !{!1126}
!1126 = !DISubrange(count: 8)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1121, file: !35, line: 3857, baseType: !1128, size: 256, align: 32, offset: 512)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 256, align: 32, elements: !1125)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1112, file: !35, line: 3903, baseType: !1130, size: 256, align: 64, offset: 960)
!1130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1099, size: 256, align: 64, elements: !1131)
!1131 = !{!1132}
!1132 = !DISubrange(count: 4)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1112, file: !35, line: 3904, baseType: !1134, size: 128, align: 32, offset: 1216)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 128, align: 32, elements: !1131)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1112, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1112, file: !35, line: 3908, baseType: !1137, size: 64, align: 64, offset: 1408)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1112, file: !35, line: 3915, baseType: !1137, size: 64, align: 64, offset: 1472)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1112, file: !35, line: 3917, baseType: !888, size: 32, align: 32, offset: 1536)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1102, file: !35, line: 3926, baseType: !1141, size: 64, align: 64, offset: 192)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !897, line: 40, baseType: !1142)
!1142 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1029, file: !35, line: 3564, baseType: !1144, size: 64, align: 64, offset: 1344)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!888, !975, !1147, !1181, !912}
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1149)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1150)
!1150 = !{!1151, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1177, !1178, !1179, !1180}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1149, file: !35, line: 1451, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1154, line: 94, baseType: !1155)
!1154 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1154, line: 81, size: 192, align: 64, elements: !1156)
!1156 = !{!1157, !1161, !1162}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1155, file: !1154, line: 82, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1154, line: 73, baseType: !1160)
!1160 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1154, line: 73, flags: DIFlagFwdDecl)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1155, file: !1154, line: 89, baseType: !1099, size: 64, align: 64, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1155, file: !1154, line: 93, baseType: !888, size: 32, align: 32, offset: 128)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1149, file: !35, line: 1461, baseType: !1141, size: 64, align: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1149, file: !35, line: 1467, baseType: !1141, size: 64, align: 64, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1149, file: !35, line: 1468, baseType: !1099, size: 64, align: 64, offset: 192)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1149, file: !35, line: 1469, baseType: !888, size: 32, align: 32, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1149, file: !35, line: 1470, baseType: !888, size: 32, align: 32, offset: 288)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1149, file: !35, line: 1474, baseType: !888, size: 32, align: 32, offset: 320)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1149, file: !35, line: 1479, baseType: !1170, size: 64, align: 64, offset: 384)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1172)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1173)
!1173 = !{!1174, !1175, !1176}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1172, file: !35, line: 1412, baseType: !1099, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1172, file: !35, line: 1413, baseType: !888, size: 32, align: 32, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1172, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1149, file: !35, line: 1480, baseType: !888, size: 32, align: 32, offset: 448)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1149, file: !35, line: 1486, baseType: !1141, size: 64, align: 64, offset: 512)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1149, file: !35, line: 1488, baseType: !1141, size: 64, align: 64, offset: 576)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1149, file: !35, line: 1497, baseType: !1141, size: 64, align: 64, offset: 640)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1183)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1185)
!1185 = !{!1186, !1187, !1188, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1215, !1217, !1218, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1251, !1252, !1253, !1254, !1255, !1256, !1259, !1260, !1261, !1262}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1184, file: !758, line: 282, baseType: !1124, size: 512, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1184, file: !758, line: 299, baseType: !1128, size: 256, align: 32, offset: 512)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1184, file: !758, line: 315, baseType: !1189, size: 64, align: 64, offset: 768)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1184, file: !758, line: 326, baseType: !888, size: 32, align: 32, offset: 832)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1184, file: !758, line: 326, baseType: !888, size: 32, align: 32, offset: 864)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1184, file: !758, line: 334, baseType: !888, size: 32, align: 32, offset: 896)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1184, file: !758, line: 341, baseType: !888, size: 32, align: 32, offset: 928)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1184, file: !758, line: 346, baseType: !888, size: 32, align: 32, offset: 960)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1184, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1184, file: !758, line: 356, baseType: !1039, size: 64, align: 32, offset: 1024)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1184, file: !758, line: 361, baseType: !1141, size: 64, align: 64, offset: 1088)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1184, file: !758, line: 369, baseType: !1141, size: 64, align: 64, offset: 1152)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1184, file: !758, line: 377, baseType: !1141, size: 64, align: 64, offset: 1216)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1184, file: !758, line: 382, baseType: !888, size: 32, align: 32, offset: 1280)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1184, file: !758, line: 386, baseType: !888, size: 32, align: 32, offset: 1312)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1184, file: !758, line: 391, baseType: !888, size: 32, align: 32, offset: 1344)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1184, file: !758, line: 396, baseType: !993, size: 64, align: 64, offset: 1408)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1184, file: !758, line: 403, baseType: !1205, size: 512, align: 64, offset: 1472)
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1057, size: 512, align: 64, elements: !1125)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1184, file: !758, line: 410, baseType: !888, size: 32, align: 32, offset: 1984)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1184, file: !758, line: 415, baseType: !888, size: 32, align: 32, offset: 2016)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1184, file: !758, line: 420, baseType: !888, size: 32, align: 32, offset: 2048)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1184, file: !758, line: 425, baseType: !888, size: 32, align: 32, offset: 2080)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1184, file: !758, line: 435, baseType: !1141, size: 64, align: 64, offset: 2112)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1184, file: !758, line: 440, baseType: !888, size: 32, align: 32, offset: 2176)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1184, file: !758, line: 445, baseType: !1057, size: 64, align: 64, offset: 2240)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1184, file: !758, line: 459, baseType: !1214, size: 512, align: 64, offset: 2304)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1152, size: 512, align: 64, elements: !1125)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1184, file: !758, line: 473, baseType: !1216, size: 64, align: 64, offset: 2816)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1184, file: !758, line: 477, baseType: !888, size: 32, align: 32, offset: 2880)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1184, file: !758, line: 479, baseType: !1219, size: 64, align: 64, offset: 2944)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1222)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1223)
!1223 = !{!1224, !1225, !1226, !1227, !1232}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1222, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1222, file: !758, line: 203, baseType: !1099, size: 64, align: 64, offset: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1222, file: !758, line: 204, baseType: !888, size: 32, align: 32, offset: 128)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1222, file: !758, line: 205, baseType: !1228, size: 64, align: 64, offset: 192)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1230, line: 86, baseType: !1231)
!1230 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1231 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1230, line: 86, flags: DIFlagFwdDecl)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1222, file: !758, line: 206, baseType: !1152, size: 64, align: 64, offset: 256)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1184, file: !758, line: 480, baseType: !888, size: 32, align: 32, offset: 3008)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1184, file: !758, line: 505, baseType: !888, size: 32, align: 32, offset: 3040)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1184, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1184, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1184, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1184, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1184, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1184, file: !758, line: 532, baseType: !1141, size: 64, align: 64, offset: 3264)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1184, file: !758, line: 539, baseType: !1141, size: 64, align: 64, offset: 3328)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1184, file: !758, line: 547, baseType: !1141, size: 64, align: 64, offset: 3392)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1184, file: !758, line: 554, baseType: !1228, size: 64, align: 64, offset: 3456)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1184, file: !758, line: 563, baseType: !888, size: 32, align: 32, offset: 3520)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1184, file: !758, line: 572, baseType: !888, size: 32, align: 32, offset: 3552)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1184, file: !758, line: 581, baseType: !888, size: 32, align: 32, offset: 3584)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1184, file: !758, line: 588, baseType: !1248, size: 64, align: 64, offset: 3648)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !897, line: 36, baseType: !1250)
!1250 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1184, file: !758, line: 593, baseType: !888, size: 32, align: 32, offset: 3712)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1184, file: !758, line: 596, baseType: !888, size: 32, align: 32, offset: 3744)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1184, file: !758, line: 599, baseType: !1152, size: 64, align: 64, offset: 3776)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1184, file: !758, line: 605, baseType: !1152, size: 64, align: 64, offset: 3840)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1184, file: !758, line: 616, baseType: !1152, size: 64, align: 64, offset: 3904)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1184, file: !758, line: 626, baseType: !1257, size: 64, align: 64, offset: 3968)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1258, line: 216, baseType: !1058)
!1258 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1184, file: !758, line: 627, baseType: !1257, size: 64, align: 64, offset: 4032)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1184, file: !758, line: 628, baseType: !1257, size: 64, align: 64, offset: 4096)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1184, file: !758, line: 629, baseType: !1257, size: 64, align: 64, offset: 4160)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1184, file: !758, line: 645, baseType: !1152, size: 64, align: 64, offset: 4224)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1029, file: !35, line: 3566, baseType: !1264, size: 64, align: 64, offset: 1408)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!888, !975, !993, !912, !1147}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1029, file: !35, line: 3567, baseType: !1076, size: 64, align: 64, offset: 1472)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1029, file: !35, line: 3576, baseType: !1269, size: 64, align: 64, offset: 1536)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!888, !975, !1181}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1029, file: !35, line: 3577, baseType: !1273, size: 64, align: 64, offset: 1600)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!888, !975, !1147}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1029, file: !35, line: 3584, baseType: !1277, size: 64, align: 64, offset: 1664)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{!888, !975, !1280}
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1029, file: !35, line: 3589, baseType: !1282, size: 64, align: 64, offset: 1728)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{null, !975}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1029, file: !35, line: 3594, baseType: !888, size: 32, align: 32, offset: 1792)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1029, file: !35, line: 3600, baseType: !986, size: 64, align: 64, offset: 1856)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1029, file: !35, line: 3609, baseType: !1288, size: 64, align: 64, offset: 1920)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1291)
!1291 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !977, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !977, file: !35, line: 1581, baseType: !889, size: 32, align: 32, offset: 224)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !977, file: !35, line: 1583, baseType: !993, size: 64, align: 64, offset: 256)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !977, file: !35, line: 1591, baseType: !1296, size: 64, align: 64, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !977, file: !35, line: 1598, baseType: !993, size: 64, align: 64, offset: 384)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !977, file: !35, line: 1606, baseType: !1141, size: 64, align: 64, offset: 448)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !977, file: !35, line: 1614, baseType: !888, size: 32, align: 32, offset: 512)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !977, file: !35, line: 1622, baseType: !888, size: 32, align: 32, offset: 544)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !977, file: !35, line: 1628, baseType: !888, size: 32, align: 32, offset: 576)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !977, file: !35, line: 1636, baseType: !888, size: 32, align: 32, offset: 608)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !977, file: !35, line: 1643, baseType: !888, size: 32, align: 32, offset: 640)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !977, file: !35, line: 1657, baseType: !1099, size: 64, align: 64, offset: 704)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !977, file: !35, line: 1658, baseType: !888, size: 32, align: 32, offset: 768)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !977, file: !35, line: 1679, baseType: !1039, size: 64, align: 32, offset: 800)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !977, file: !35, line: 1688, baseType: !888, size: 32, align: 32, offset: 864)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !977, file: !35, line: 1712, baseType: !888, size: 32, align: 32, offset: 896)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !977, file: !35, line: 1729, baseType: !888, size: 32, align: 32, offset: 928)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !977, file: !35, line: 1729, baseType: !888, size: 32, align: 32, offset: 960)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !977, file: !35, line: 1744, baseType: !888, size: 32, align: 32, offset: 992)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !977, file: !35, line: 1744, baseType: !888, size: 32, align: 32, offset: 1024)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !977, file: !35, line: 1751, baseType: !888, size: 32, align: 32, offset: 1056)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !977, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !977, file: !35, line: 1791, baseType: !1317, size: 64, align: 64, offset: 1152)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{null, !1320, !1181, !912, !888, !888, !888}
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !977, file: !35, line: 1808, baseType: !1322, size: 64, align: 64, offset: 1216)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DISubroutineType(types: !1324)
!1324 = !{!494, !1320, !1046}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !977, file: !35, line: 1816, baseType: !888, size: 32, align: 32, offset: 1280)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !977, file: !35, line: 1825, baseType: !1327, size: 32, align: 32, offset: 1312)
!1327 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !977, file: !35, line: 1830, baseType: !888, size: 32, align: 32, offset: 1344)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !977, file: !35, line: 1838, baseType: !1327, size: 32, align: 32, offset: 1376)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !977, file: !35, line: 1846, baseType: !888, size: 32, align: 32, offset: 1408)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !977, file: !35, line: 1851, baseType: !888, size: 32, align: 32, offset: 1440)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !977, file: !35, line: 1861, baseType: !1327, size: 32, align: 32, offset: 1472)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !977, file: !35, line: 1868, baseType: !1327, size: 32, align: 32, offset: 1504)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !977, file: !35, line: 1875, baseType: !1327, size: 32, align: 32, offset: 1536)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !977, file: !35, line: 1882, baseType: !1327, size: 32, align: 32, offset: 1568)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !977, file: !35, line: 1889, baseType: !1327, size: 32, align: 32, offset: 1600)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !977, file: !35, line: 1896, baseType: !1327, size: 32, align: 32, offset: 1632)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !977, file: !35, line: 1903, baseType: !1327, size: 32, align: 32, offset: 1664)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !977, file: !35, line: 1910, baseType: !888, size: 32, align: 32, offset: 1696)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !977, file: !35, line: 1915, baseType: !888, size: 32, align: 32, offset: 1728)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !977, file: !35, line: 1926, baseType: !912, size: 64, align: 64, offset: 1792)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !977, file: !35, line: 1935, baseType: !1039, size: 64, align: 32, offset: 1856)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !977, file: !35, line: 1942, baseType: !888, size: 32, align: 32, offset: 1920)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !977, file: !35, line: 1948, baseType: !888, size: 32, align: 32, offset: 1952)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !977, file: !35, line: 1954, baseType: !888, size: 32, align: 32, offset: 1984)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !977, file: !35, line: 1960, baseType: !888, size: 32, align: 32, offset: 2016)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !977, file: !35, line: 1984, baseType: !888, size: 32, align: 32, offset: 2048)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !977, file: !35, line: 1991, baseType: !888, size: 32, align: 32, offset: 2080)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !977, file: !35, line: 1996, baseType: !888, size: 32, align: 32, offset: 2112)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !977, file: !35, line: 2004, baseType: !888, size: 32, align: 32, offset: 2144)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !977, file: !35, line: 2011, baseType: !888, size: 32, align: 32, offset: 2176)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !977, file: !35, line: 2018, baseType: !888, size: 32, align: 32, offset: 2208)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !977, file: !35, line: 2027, baseType: !888, size: 32, align: 32, offset: 2240)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !977, file: !35, line: 2034, baseType: !888, size: 32, align: 32, offset: 2272)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !977, file: !35, line: 2044, baseType: !888, size: 32, align: 32, offset: 2304)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !977, file: !35, line: 2054, baseType: !1357, size: 64, align: 64, offset: 2368)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !977, file: !35, line: 2061, baseType: !1357, size: 64, align: 64, offset: 2432)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !977, file: !35, line: 2066, baseType: !888, size: 32, align: 32, offset: 2496)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !977, file: !35, line: 2070, baseType: !888, size: 32, align: 32, offset: 2528)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !977, file: !35, line: 2078, baseType: !888, size: 32, align: 32, offset: 2560)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !977, file: !35, line: 2085, baseType: !888, size: 32, align: 32, offset: 2592)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !977, file: !35, line: 2092, baseType: !888, size: 32, align: 32, offset: 2624)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !977, file: !35, line: 2099, baseType: !888, size: 32, align: 32, offset: 2656)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !977, file: !35, line: 2106, baseType: !888, size: 32, align: 32, offset: 2688)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !977, file: !35, line: 2113, baseType: !888, size: 32, align: 32, offset: 2720)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !977, file: !35, line: 2120, baseType: !888, size: 32, align: 32, offset: 2752)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !977, file: !35, line: 2125, baseType: !888, size: 32, align: 32, offset: 2784)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !977, file: !35, line: 2133, baseType: !888, size: 32, align: 32, offset: 2816)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !977, file: !35, line: 2140, baseType: !888, size: 32, align: 32, offset: 2848)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !977, file: !35, line: 2145, baseType: !888, size: 32, align: 32, offset: 2880)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !977, file: !35, line: 2153, baseType: !888, size: 32, align: 32, offset: 2912)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !977, file: !35, line: 2158, baseType: !888, size: 32, align: 32, offset: 2944)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !977, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !977, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !977, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !977, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !977, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !977, file: !35, line: 2203, baseType: !888, size: 32, align: 32, offset: 3136)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !977, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !977, file: !35, line: 2212, baseType: !888, size: 32, align: 32, offset: 3200)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !977, file: !35, line: 2213, baseType: !888, size: 32, align: 32, offset: 3232)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !977, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !977, file: !35, line: 2232, baseType: !888, size: 32, align: 32, offset: 3296)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !977, file: !35, line: 2243, baseType: !888, size: 32, align: 32, offset: 3328)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !977, file: !35, line: 2249, baseType: !888, size: 32, align: 32, offset: 3360)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !977, file: !35, line: 2256, baseType: !888, size: 32, align: 32, offset: 3392)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !977, file: !35, line: 2263, baseType: !1057, size: 64, align: 64, offset: 3456)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !977, file: !35, line: 2270, baseType: !1057, size: 64, align: 64, offset: 3520)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !977, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !977, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !977, file: !35, line: 2367, baseType: !1393, size: 64, align: 64, offset: 3648)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DISubroutineType(types: !1395)
!1395 = !{!888, !1320, !1280, !888}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !977, file: !35, line: 2383, baseType: !888, size: 32, align: 32, offset: 3712)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !977, file: !35, line: 2386, baseType: !1327, size: 32, align: 32, offset: 3744)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !977, file: !35, line: 2387, baseType: !1327, size: 32, align: 32, offset: 3776)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !977, file: !35, line: 2394, baseType: !888, size: 32, align: 32, offset: 3808)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !977, file: !35, line: 2401, baseType: !888, size: 32, align: 32, offset: 3840)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !977, file: !35, line: 2408, baseType: !888, size: 32, align: 32, offset: 3872)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !977, file: !35, line: 2415, baseType: !888, size: 32, align: 32, offset: 3904)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !977, file: !35, line: 2422, baseType: !888, size: 32, align: 32, offset: 3936)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !977, file: !35, line: 2423, baseType: !1405, size: 64, align: 64, offset: 3968)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1407)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1408)
!1408 = !{!1409, !1410, !1411, !1412}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1407, file: !35, line: 827, baseType: !888, size: 32, align: 32)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1407, file: !35, line: 828, baseType: !888, size: 32, align: 32, offset: 32)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1407, file: !35, line: 829, baseType: !888, size: 32, align: 32, offset: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1407, file: !35, line: 830, baseType: !1327, size: 32, align: 32, offset: 96)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !977, file: !35, line: 2430, baseType: !1141, size: 64, align: 64, offset: 4032)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !977, file: !35, line: 2437, baseType: !1141, size: 64, align: 64, offset: 4096)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !977, file: !35, line: 2444, baseType: !1327, size: 32, align: 32, offset: 4160)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !977, file: !35, line: 2451, baseType: !1327, size: 32, align: 32, offset: 4192)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !977, file: !35, line: 2458, baseType: !888, size: 32, align: 32, offset: 4224)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !977, file: !35, line: 2469, baseType: !888, size: 32, align: 32, offset: 4256)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !977, file: !35, line: 2475, baseType: !888, size: 32, align: 32, offset: 4288)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !977, file: !35, line: 2481, baseType: !888, size: 32, align: 32, offset: 4320)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !977, file: !35, line: 2485, baseType: !888, size: 32, align: 32, offset: 4352)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !977, file: !35, line: 2489, baseType: !888, size: 32, align: 32, offset: 4384)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !977, file: !35, line: 2493, baseType: !888, size: 32, align: 32, offset: 4416)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !977, file: !35, line: 2501, baseType: !888, size: 32, align: 32, offset: 4448)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !977, file: !35, line: 2506, baseType: !888, size: 32, align: 32, offset: 4480)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !977, file: !35, line: 2510, baseType: !888, size: 32, align: 32, offset: 4512)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !977, file: !35, line: 2514, baseType: !1141, size: 64, align: 64, offset: 4544)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !977, file: !35, line: 2528, baseType: !1429, size: 64, align: 64, offset: 4608)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DISubroutineType(types: !1431)
!1431 = !{null, !1320, !993, !888, !888}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !977, file: !35, line: 2534, baseType: !888, size: 32, align: 32, offset: 4672)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !977, file: !35, line: 2545, baseType: !888, size: 32, align: 32, offset: 4704)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !977, file: !35, line: 2547, baseType: !888, size: 32, align: 32, offset: 4736)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !977, file: !35, line: 2549, baseType: !888, size: 32, align: 32, offset: 4768)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !977, file: !35, line: 2551, baseType: !888, size: 32, align: 32, offset: 4800)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !977, file: !35, line: 2553, baseType: !888, size: 32, align: 32, offset: 4832)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !977, file: !35, line: 2555, baseType: !888, size: 32, align: 32, offset: 4864)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !977, file: !35, line: 2557, baseType: !888, size: 32, align: 32, offset: 4896)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !977, file: !35, line: 2559, baseType: !888, size: 32, align: 32, offset: 4928)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !977, file: !35, line: 2563, baseType: !888, size: 32, align: 32, offset: 4960)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !977, file: !35, line: 2571, baseType: !1137, size: 64, align: 64, offset: 4992)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !977, file: !35, line: 2579, baseType: !1137, size: 64, align: 64, offset: 5056)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !977, file: !35, line: 2586, baseType: !888, size: 32, align: 32, offset: 5120)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !977, file: !35, line: 2615, baseType: !888, size: 32, align: 32, offset: 5152)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !977, file: !35, line: 2627, baseType: !888, size: 32, align: 32, offset: 5184)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !977, file: !35, line: 2637, baseType: !888, size: 32, align: 32, offset: 5216)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !977, file: !35, line: 2681, baseType: !888, size: 32, align: 32, offset: 5248)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !977, file: !35, line: 2709, baseType: !1141, size: 64, align: 64, offset: 5312)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !977, file: !35, line: 2716, baseType: !1451, size: 64, align: 64, offset: 5376)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1453)
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1454)
!1454 = !{!1455, !1456, !1457, !1458, !1459, !1460, !1461, !1467, !1471, !1472, !1473, !1474, !1480, !1481, !1482, !1483, !1484}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1453, file: !35, line: 3642, baseType: !986, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1453, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1453, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1453, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1453, file: !35, line: 3669, baseType: !888, size: 32, align: 32, offset: 160)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1453, file: !35, line: 3682, baseType: !1277, size: 64, align: 64, offset: 192)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1453, file: !35, line: 3698, baseType: !1462, size: 64, align: 64, offset: 256)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{!888, !975, !1465, !904}
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1060)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1453, file: !35, line: 3712, baseType: !1468, size: 64, align: 64, offset: 320)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!888, !975, !888, !1465, !904}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1453, file: !35, line: 3726, baseType: !1462, size: 64, align: 64, offset: 384)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1453, file: !35, line: 3737, baseType: !1076, size: 64, align: 64, offset: 448)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1453, file: !35, line: 3746, baseType: !888, size: 32, align: 32, offset: 512)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1453, file: !35, line: 3757, baseType: !1475, size: 64, align: 64, offset: 576)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{null, !1478}
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1453, file: !35, line: 3766, baseType: !1076, size: 64, align: 64, offset: 640)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1453, file: !35, line: 3774, baseType: !1076, size: 64, align: 64, offset: 704)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1453, file: !35, line: 3780, baseType: !888, size: 32, align: 32, offset: 768)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1453, file: !35, line: 3785, baseType: !888, size: 32, align: 32, offset: 800)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1453, file: !35, line: 3795, baseType: !1485, size: 64, align: 64, offset: 832)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{!888, !975, !1152}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !977, file: !35, line: 2728, baseType: !993, size: 64, align: 64, offset: 5440)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !977, file: !35, line: 2735, baseType: !1205, size: 512, align: 64, offset: 5504)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !977, file: !35, line: 2742, baseType: !888, size: 32, align: 32, offset: 6016)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !977, file: !35, line: 2755, baseType: !888, size: 32, align: 32, offset: 6048)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !977, file: !35, line: 2776, baseType: !888, size: 32, align: 32, offset: 6080)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !977, file: !35, line: 2783, baseType: !888, size: 32, align: 32, offset: 6112)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !977, file: !35, line: 2791, baseType: !888, size: 32, align: 32, offset: 6144)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !977, file: !35, line: 2802, baseType: !1280, size: 64, align: 64, offset: 6208)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !977, file: !35, line: 2811, baseType: !888, size: 32, align: 32, offset: 6272)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !977, file: !35, line: 2821, baseType: !888, size: 32, align: 32, offset: 6304)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !977, file: !35, line: 2830, baseType: !888, size: 32, align: 32, offset: 6336)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !977, file: !35, line: 2840, baseType: !888, size: 32, align: 32, offset: 6368)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !977, file: !35, line: 2851, baseType: !1501, size: 64, align: 64, offset: 6400)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{!888, !1320, !1504, !993, !912, !888, !888}
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{!888, !1320, !993}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !977, file: !35, line: 2871, baseType: !1508, size: 64, align: 64, offset: 6464)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DISubroutineType(types: !1510)
!1510 = !{!888, !1320, !1511, !993, !912, !888}
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DISubroutineType(types: !1513)
!1513 = !{!888, !1320, !993, !888, !888}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !977, file: !35, line: 2878, baseType: !888, size: 32, align: 32, offset: 6528)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !977, file: !35, line: 2885, baseType: !888, size: 32, align: 32, offset: 6560)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !977, file: !35, line: 3005, baseType: !888, size: 32, align: 32, offset: 6592)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !977, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !977, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !977, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !977, file: !35, line: 3037, baseType: !1099, size: 64, align: 64, offset: 6720)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !977, file: !35, line: 3038, baseType: !888, size: 32, align: 32, offset: 6784)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !977, file: !35, line: 3050, baseType: !1057, size: 64, align: 64, offset: 6848)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !977, file: !35, line: 3065, baseType: !888, size: 32, align: 32, offset: 6912)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !977, file: !35, line: 3083, baseType: !888, size: 32, align: 32, offset: 6944)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !977, file: !35, line: 3092, baseType: !1039, size: 64, align: 32, offset: 6976)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !977, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !977, file: !35, line: 3106, baseType: !1039, size: 64, align: 32, offset: 7072)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !977, file: !35, line: 3113, baseType: !1529, size: 64, align: 64, offset: 7168)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1531)
!1531 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1532)
!1532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1533)
!1533 = !{!1534, !1535, !1536, !1537, !1538, !1539, !1542}
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1532, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1532, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1532, file: !35, line: 720, baseType: !986, size: 64, align: 64, offset: 64)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1532, file: !35, line: 724, baseType: !986, size: 64, align: 64, offset: 128)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1532, file: !35, line: 728, baseType: !888, size: 32, align: 32, offset: 192)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1532, file: !35, line: 734, baseType: !1540, size: 64, align: 64, offset: 256)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1532, file: !35, line: 739, baseType: !1543, size: 64, align: 64, offset: 320)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1067)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !977, file: !35, line: 3129, baseType: !1141, size: 64, align: 64, offset: 7232)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !977, file: !35, line: 3130, baseType: !1141, size: 64, align: 64, offset: 7296)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !977, file: !35, line: 3131, baseType: !1141, size: 64, align: 64, offset: 7360)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !977, file: !35, line: 3132, baseType: !1141, size: 64, align: 64, offset: 7424)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !977, file: !35, line: 3139, baseType: !1137, size: 64, align: 64, offset: 7488)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !977, file: !35, line: 3147, baseType: !888, size: 32, align: 32, offset: 7552)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !977, file: !35, line: 3165, baseType: !888, size: 32, align: 32, offset: 7584)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !977, file: !35, line: 3172, baseType: !888, size: 32, align: 32, offset: 7616)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !977, file: !35, line: 3180, baseType: !888, size: 32, align: 32, offset: 7648)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !977, file: !35, line: 3191, baseType: !1357, size: 64, align: 64, offset: 7680)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !977, file: !35, line: 3199, baseType: !1099, size: 64, align: 64, offset: 7744)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !977, file: !35, line: 3207, baseType: !1137, size: 64, align: 64, offset: 7808)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !977, file: !35, line: 3214, baseType: !889, size: 32, align: 32, offset: 7872)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !977, file: !35, line: 3224, baseType: !1170, size: 64, align: 64, offset: 7936)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !977, file: !35, line: 3225, baseType: !888, size: 32, align: 32, offset: 8000)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !977, file: !35, line: 3249, baseType: !1152, size: 64, align: 64, offset: 8064)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !977, file: !35, line: 3256, baseType: !888, size: 32, align: 32, offset: 8128)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !977, file: !35, line: 3271, baseType: !888, size: 32, align: 32, offset: 8160)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !977, file: !35, line: 3279, baseType: !1141, size: 64, align: 64, offset: 8192)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !977, file: !35, line: 3301, baseType: !1152, size: 64, align: 64, offset: 8256)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !977, file: !35, line: 3310, baseType: !888, size: 32, align: 32, offset: 8320)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !977, file: !35, line: 3337, baseType: !888, size: 32, align: 32, offset: 8352)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !977, file: !35, line: 3351, baseType: !888, size: 32, align: 32, offset: 8384)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !977, file: !35, line: 3359, baseType: !888, size: 32, align: 32, offset: 8416)
!1569 = !DILocalVariable(name: "x", arg: 1, scope: !1570, file: !1571, line: 66, type: !904)
!1570 = distinct !DISubprogram(name: "av_bswap32", scope: !1571, file: !1571, line: 66, type: !1572, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !913)
!1571 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1572 = !DISubroutineType(types: !1573)
!1573 = !{!904, !904}
!1574 = !DILocation(line: 66, column: 98, scope: !1570, inlinedAt: !1575)
!1575 = distinct !DILocation(line: 66, column: 26, scope: !972)
!1576 = !DILocalVariable(name: "x", arg: 1, scope: !1577, file: !1571, line: 58, type: !896)
!1577 = distinct !DISubprogram(name: "av_bswap16", scope: !1571, file: !1571, line: 58, type: !1578, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !913)
!1578 = !DISubroutineType(types: !1579)
!1579 = !{!896, !896}
!1580 = !DILocation(line: 58, column: 98, scope: !1577, inlinedAt: !1581)
!1581 = distinct !DILocation(line: 76, column: 18, scope: !1582)
!1582 = distinct !DILexicalBlock(scope: !1583, file: !909, line: 75, column: 16)
!1583 = distinct !DILexicalBlock(scope: !972, file: !909, line: 75, column: 9)
!1584 = !DILocation(line: 58, column: 98, scope: !1577, inlinedAt: !1585)
!1585 = distinct !DILocation(line: 48, column: 14, scope: !972)
!1586 = !DILocation(line: 58, column: 98, scope: !1577, inlinedAt: !1587)
!1587 = distinct !DILocation(line: 46, column: 9, scope: !1588)
!1588 = distinct !DILexicalBlock(scope: !972, file: !909, line: 46, column: 9)
!1589 = !DILocalVariable(name: "avctx", arg: 1, scope: !972, file: !909, line: 38, type: !975)
!1590 = !DILocation(line: 38, column: 42, scope: !972)
!1591 = !DILocalVariable(name: "buf", arg: 2, scope: !972, file: !909, line: 38, type: !1465)
!1592 = !DILocation(line: 38, column: 64, scope: !972)
!1593 = !DILocalVariable(name: "bufsize", arg: 3, scope: !972, file: !909, line: 39, type: !888)
!1594 = !DILocation(line: 39, column: 30, scope: !972)
!1595 = !DILocalVariable(name: "header_size", arg: 4, scope: !972, file: !909, line: 39, type: !912)
!1596 = !DILocation(line: 39, column: 44, scope: !972)
!1597 = !DILocalVariable(name: "coeff", arg: 5, scope: !972, file: !909, line: 39, type: !912)
!1598 = !DILocation(line: 39, column: 62, scope: !972)
!1599 = !DILocalVariable(name: "offset", scope: !972, file: !909, line: 41, type: !888)
!1600 = !DILocation(line: 41, column: 9, scope: !972)
!1601 = !DILocalVariable(name: "cutoff", scope: !972, file: !909, line: 41, type: !888)
!1602 = !DILocation(line: 41, column: 17, scope: !972)
!1603 = !DILocation(line: 43, column: 9, scope: !1604)
!1604 = distinct !DILexicalBlock(scope: !972, file: !909, line: 43, column: 9)
!1605 = !DILocation(line: 43, column: 17, scope: !1604)
!1606 = !DILocation(line: 43, column: 9, scope: !972)
!1607 = !DILocation(line: 44, column: 9, scope: !1604)
!1608 = !DILocation(line: 46, column: 52, scope: !1588)
!1609 = !DILocation(line: 46, column: 59, scope: !1588)
!1610 = !DILocation(line: 46, column: 9, scope: !1588)
!1611 = !DILocation(line: 60, column: 9, scope: !1577, inlinedAt: !1587)
!1612 = !DILocation(line: 60, column: 10, scope: !1577, inlinedAt: !1587)
!1613 = !DILocation(line: 60, column: 18, scope: !1577, inlinedAt: !1587)
!1614 = !DILocation(line: 60, column: 19, scope: !1577, inlinedAt: !1587)
!1615 = !DILocation(line: 60, column: 15, scope: !1577, inlinedAt: !1587)
!1616 = !DILocation(line: 60, column: 8, scope: !1577, inlinedAt: !1587)
!1617 = !DILocation(line: 60, column: 6, scope: !1577, inlinedAt: !1587)
!1618 = !DILocation(line: 61, column: 12, scope: !1577, inlinedAt: !1587)
!1619 = !DILocation(line: 46, column: 63, scope: !1588)
