; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--psymodel.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--psymodel.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.FFPsyModel = type { i8*, i32 (%struct.FFPsyContext*)*, void (%struct.FFPsyWindowInfo*, %struct.FFPsyContext*, float*, float*, i32, i32)*, void (%struct.FFPsyContext*, i32, float**, %struct.FFPsyWindowInfo*)*, void (%struct.FFPsyContext*)* }
%struct.FFPsyContext = type { %struct.AVCodecContext*, %struct.FFPsyModel*, %struct.FFPsyChannel*, %struct.FFPsyChannelGroup*, i32, i32, i8**, i32*, i32, %struct.anon, i8* }

!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IIRFilterType", file: !888, line: 36, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/iirfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!889 = !{!890, !891, !892, !893, !894}
!890 = !DIEnumerator(name: "FF_FILTER_TYPE_BESSEL", value: 0)
!891 = !DIEnumerator(name: "FF_FILTER_TYPE_BIQUAD", value: 1)
!892 = !DIEnumerator(name: "FF_FILTER_TYPE_BUTTERWORTH", value: 2)
!893 = !DIEnumerator(name: "FF_FILTER_TYPE_CHEBYSHEV", value: 3)
!894 = !DIEnumerator(name: "FF_FILTER_TYPE_ELLIPTIC", value: 4)
!895 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IIRFilterMode", file: !888, line: 44, size: 32, align: 32, elements: !896)
!896 = !{!897, !898, !899, !900}
!897 = !DIEnumerator(name: "FF_FILTER_MODE_LOWPASS", value: 0)
!898 = !DIEnumerator(name: "FF_FILTER_MODE_HIGHPASS", value: 1)
!899 = !DIEnumerator(name: "FF_FILTER_MODE_BANDPASS", value: 2)
!900 = !DIEnumerator(name: "FF_FILTER_MODE_BANDSTOP", value: 3)
!901 = !{i32 2, !"Dwarf Version", i32 4}
!902 = !{i32 2, !"Debug Info Version", i32 3}
!903 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!904 = distinct !DISubprogram(name: "ff_psy_init", scope: !905, file: !905, line: 31, type: !906, isLocal: false, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1597)
!905 = !DIFile(filename: "libavcodec/psymodel.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!906 = !DISubroutineType(types: !907)
!907 = !{!908, !909, !915, !908, !1596, !989, !908, !1411}
!908 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFPsyContext", file: !911, line: 109, baseType: !912)
!911 = !DIFile(filename: "libavcodec/psymodel.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFPsyContext", file: !911, line: 89, size: 640, align: 64, elements: !913)
!913 = !{!914, !1515, !1555, !1572, !1584, !1585, !1586, !1587, !1588, !1589, !1595}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !912, file: !911, line: 90, baseType: !915, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64, align: 64)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !918)
!918 = !{!919, !964, !965, !966, !1238, !1239, !1240, !1241, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1267, !1271, !1272, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1453, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !917, file: !35, line: 1561, baseType: !920, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !922)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !924)
!924 = !{!925, !929, !934, !938, !939, !940, !941, !945, !951, !953, !957}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !923, file: !4, line: 72, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!928 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !923, file: !4, line: 78, baseType: !930, size: 64, align: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!926, !933}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !923, file: !4, line: 85, baseType: !935, size: 64, align: 64, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !923, file: !4, line: 93, baseType: !908, size: 32, align: 32, offset: 192)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !923, file: !4, line: 99, baseType: !908, size: 32, align: 32, offset: 224)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !923, file: !4, line: 108, baseType: !908, size: 32, align: 32, offset: 256)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !923, file: !4, line: 113, baseType: !942, size: 64, align: 64, offset: 320)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!933, !933, !933}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !923, file: !4, line: 123, baseType: !946, size: 64, align: 64, offset: 384)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!949, !949}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !923, file: !4, line: 130, baseType: !952, size: 32, align: 32, offset: 448)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !923, file: !4, line: 136, baseType: !954, size: 64, align: 64, offset: 512)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!952, !933}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !923, file: !4, line: 142, baseType: !958, size: 64, align: 64, offset: 576)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!908, !961, !933, !926, !908}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !917, file: !35, line: 1562, baseType: !908, size: 32, align: 32, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !917, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !917, file: !35, line: 1565, baseType: !967, size: 64, align: 64, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !970)
!970 = !{!971, !972, !973, !974, !975, !976, !985, !988, !991, !994, !1000, !1003, !1004, !1012, !1013, !1014, !1016, !1020, !1026, !1031, !1035, !1036, !1088, !1209, !1213, !1214, !1218, !1222, !1227, !1231, !1232, !1233}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !969, file: !35, line: 3475, baseType: !926, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !969, file: !35, line: 3480, baseType: !926, size: 64, align: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !969, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !969, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !969, file: !35, line: 3487, baseType: !908, size: 32, align: 32, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !969, file: !35, line: 3488, baseType: !977, size: 64, align: 64, offset: 256)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !980, line: 61, baseType: !981)
!980 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !980, line: 58, size: 64, align: 32, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !981, file: !980, line: 59, baseType: !908, size: 32, align: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !981, file: !980, line: 60, baseType: !908, size: 32, align: 32, offset: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !969, file: !35, line: 3489, baseType: !986, size: 64, align: 64, offset: 320)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !969, file: !35, line: 3490, baseType: !989, size: 64, align: 64, offset: 384)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !969, file: !35, line: 3491, baseType: !992, size: 64, align: 64, offset: 448)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !969, file: !35, line: 3492, baseType: !995, size: 64, align: 64, offset: 512)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !998, line: 55, baseType: !999)
!998 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!999 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !969, file: !35, line: 3493, baseType: !1001, size: 8, align: 8, offset: 576)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !998, line: 48, baseType: !1002)
!1002 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !969, file: !35, line: 3494, baseType: !920, size: 64, align: 64, offset: 640)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !969, file: !35, line: 3495, baseType: !1005, size: 64, align: 64, offset: 704)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1009)
!1009 = !{!1010, !1011}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1008, file: !35, line: 3402, baseType: !908, size: 32, align: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1008, file: !35, line: 3403, baseType: !926, size: 64, align: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !969, file: !35, line: 3507, baseType: !926, size: 64, align: 64, offset: 768)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !969, file: !35, line: 3516, baseType: !908, size: 32, align: 32, offset: 832)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !969, file: !35, line: 3517, baseType: !1015, size: 64, align: 64, offset: 896)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !969, file: !35, line: 3527, baseType: !1017, size: 64, align: 64, offset: 960)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!908, !915}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !969, file: !35, line: 3535, baseType: !1021, size: 64, align: 64, offset: 1024)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!908, !915, !1024}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !969, file: !35, line: 3541, baseType: !1027, size: 64, align: 64, offset: 1088)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1030)
!1030 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !969, file: !35, line: 3549, baseType: !1032, size: 64, align: 64, offset: 1152)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{null, !1015}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !969, file: !35, line: 3551, baseType: !1017, size: 64, align: 64, offset: 1216)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !969, file: !35, line: 3552, baseType: !1037, size: 64, align: 64, offset: 1280)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!908, !915, !1040, !908, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1044)
!1044 = !{!1045, !1048, !1051, !1052, !1053, !1085}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1043, file: !35, line: 3921, baseType: !1046, size: 16, align: 16)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !998, line: 49, baseType: !1047)
!1047 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1043, file: !35, line: 3922, baseType: !1049, size: 32, align: 32, offset: 32)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !998, line: 51, baseType: !1050)
!1050 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1043, file: !35, line: 3923, baseType: !1049, size: 32, align: 32, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1043, file: !35, line: 3924, baseType: !1050, size: 32, align: 32, offset: 96)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1043, file: !35, line: 3925, baseType: !1054, size: 64, align: 64, offset: 128)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1058)
!1058 = !{!1059, !1060, !1061, !1062, !1063, !1064, !1074, !1078, !1080, !1081, !1083, !1084}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1057, file: !35, line: 3886, baseType: !908, size: 32, align: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1057, file: !35, line: 3887, baseType: !908, size: 32, align: 32, offset: 32)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1057, file: !35, line: 3888, baseType: !908, size: 32, align: 32, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1057, file: !35, line: 3889, baseType: !908, size: 32, align: 32, offset: 96)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1057, file: !35, line: 3890, baseType: !908, size: 32, align: 32, offset: 128)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1057, file: !35, line: 3897, baseType: !1065, size: 768, align: 64, offset: 192)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1067)
!1067 = !{!1068, !1072}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1066, file: !35, line: 3855, baseType: !1069, size: 512, align: 64)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 512, align: 64, elements: !1070)
!1070 = !{!1071}
!1071 = !DISubrange(count: 8)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1066, file: !35, line: 3857, baseType: !1073, size: 256, align: 32, offset: 512)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 256, align: 32, elements: !1070)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1057, file: !35, line: 3903, baseType: !1075, size: 256, align: 64, offset: 960)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 256, align: 64, elements: !1076)
!1076 = !{!1077}
!1077 = !DISubrange(count: 4)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1057, file: !35, line: 3904, baseType: !1079, size: 128, align: 32, offset: 1216)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 128, align: 32, elements: !1076)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1057, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1057, file: !35, line: 3908, baseType: !1082, size: 64, align: 64, offset: 1408)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1057, file: !35, line: 3915, baseType: !1082, size: 64, align: 64, offset: 1472)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1057, file: !35, line: 3917, baseType: !908, size: 32, align: 32, offset: 1536)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1043, file: !35, line: 3926, baseType: !1086, size: 64, align: 64, offset: 192)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !998, line: 40, baseType: !1087)
!1087 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !969, file: !35, line: 3564, baseType: !1089, size: 64, align: 64, offset: 1344)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!908, !915, !1092, !1126, !1208}
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1094)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1095)
!1095 = !{!1096, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1122, !1123, !1124, !1125}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1094, file: !35, line: 1451, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1099, line: 94, baseType: !1100)
!1099 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1099, line: 81, size: 192, align: 64, elements: !1101)
!1101 = !{!1102, !1106, !1107}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1100, file: !1099, line: 82, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1099, line: 73, baseType: !1105)
!1105 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1099, line: 73, flags: DIFlagFwdDecl)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1100, file: !1099, line: 89, baseType: !1040, size: 64, align: 64, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1100, file: !1099, line: 93, baseType: !908, size: 32, align: 32, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1094, file: !35, line: 1461, baseType: !1086, size: 64, align: 64, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1094, file: !35, line: 1467, baseType: !1086, size: 64, align: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1094, file: !35, line: 1468, baseType: !1040, size: 64, align: 64, offset: 192)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1094, file: !35, line: 1469, baseType: !908, size: 32, align: 32, offset: 256)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1094, file: !35, line: 1470, baseType: !908, size: 32, align: 32, offset: 288)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1094, file: !35, line: 1474, baseType: !908, size: 32, align: 32, offset: 320)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1094, file: !35, line: 1479, baseType: !1115, size: 64, align: 64, offset: 384)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1118)
!1118 = !{!1119, !1120, !1121}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1117, file: !35, line: 1412, baseType: !1040, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1117, file: !35, line: 1413, baseType: !908, size: 32, align: 32, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1117, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1094, file: !35, line: 1480, baseType: !908, size: 32, align: 32, offset: 448)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1094, file: !35, line: 1486, baseType: !1086, size: 64, align: 64, offset: 512)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1094, file: !35, line: 1488, baseType: !1086, size: 64, align: 64, offset: 576)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1094, file: !35, line: 1497, baseType: !1086, size: 64, align: 64, offset: 640)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1128)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1130)
!1130 = !{!1131, !1132, !1133, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1160, !1162, !1163, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1196, !1197, !1198, !1199, !1200, !1201, !1204, !1205, !1206, !1207}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1129, file: !758, line: 282, baseType: !1069, size: 512, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1129, file: !758, line: 299, baseType: !1073, size: 256, align: 32, offset: 512)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1129, file: !758, line: 315, baseType: !1134, size: 64, align: 64, offset: 768)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1129, file: !758, line: 326, baseType: !908, size: 32, align: 32, offset: 832)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1129, file: !758, line: 326, baseType: !908, size: 32, align: 32, offset: 864)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1129, file: !758, line: 334, baseType: !908, size: 32, align: 32, offset: 896)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1129, file: !758, line: 341, baseType: !908, size: 32, align: 32, offset: 928)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1129, file: !758, line: 346, baseType: !908, size: 32, align: 32, offset: 960)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1129, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1129, file: !758, line: 356, baseType: !979, size: 64, align: 32, offset: 1024)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1129, file: !758, line: 361, baseType: !1086, size: 64, align: 64, offset: 1088)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1129, file: !758, line: 369, baseType: !1086, size: 64, align: 64, offset: 1152)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1129, file: !758, line: 377, baseType: !1086, size: 64, align: 64, offset: 1216)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1129, file: !758, line: 382, baseType: !908, size: 32, align: 32, offset: 1280)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1129, file: !758, line: 386, baseType: !908, size: 32, align: 32, offset: 1312)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1129, file: !758, line: 391, baseType: !908, size: 32, align: 32, offset: 1344)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1129, file: !758, line: 396, baseType: !933, size: 64, align: 64, offset: 1408)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1129, file: !758, line: 403, baseType: !1150, size: 512, align: 64, offset: 1472)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !997, size: 512, align: 64, elements: !1070)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1129, file: !758, line: 410, baseType: !908, size: 32, align: 32, offset: 1984)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1129, file: !758, line: 415, baseType: !908, size: 32, align: 32, offset: 2016)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1129, file: !758, line: 420, baseType: !908, size: 32, align: 32, offset: 2048)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1129, file: !758, line: 425, baseType: !908, size: 32, align: 32, offset: 2080)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1129, file: !758, line: 435, baseType: !1086, size: 64, align: 64, offset: 2112)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1129, file: !758, line: 440, baseType: !908, size: 32, align: 32, offset: 2176)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1129, file: !758, line: 445, baseType: !997, size: 64, align: 64, offset: 2240)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1129, file: !758, line: 459, baseType: !1159, size: 512, align: 64, offset: 2304)
!1159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1097, size: 512, align: 64, elements: !1070)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1129, file: !758, line: 473, baseType: !1161, size: 64, align: 64, offset: 2816)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1129, file: !758, line: 477, baseType: !908, size: 32, align: 32, offset: 2880)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1129, file: !758, line: 479, baseType: !1164, size: 64, align: 64, offset: 2944)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1167)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1168)
!1168 = !{!1169, !1170, !1171, !1172, !1177}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1167, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1167, file: !758, line: 203, baseType: !1040, size: 64, align: 64, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1167, file: !758, line: 204, baseType: !908, size: 32, align: 32, offset: 128)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1167, file: !758, line: 205, baseType: !1173, size: 64, align: 64, offset: 192)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1175, line: 86, baseType: !1176)
!1175 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1176 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1175, line: 86, flags: DIFlagFwdDecl)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1167, file: !758, line: 206, baseType: !1097, size: 64, align: 64, offset: 256)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1129, file: !758, line: 480, baseType: !908, size: 32, align: 32, offset: 3008)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1129, file: !758, line: 505, baseType: !908, size: 32, align: 32, offset: 3040)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1129, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1129, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1129, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1129, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1129, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1129, file: !758, line: 532, baseType: !1086, size: 64, align: 64, offset: 3264)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1129, file: !758, line: 539, baseType: !1086, size: 64, align: 64, offset: 3328)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1129, file: !758, line: 547, baseType: !1086, size: 64, align: 64, offset: 3392)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1129, file: !758, line: 554, baseType: !1173, size: 64, align: 64, offset: 3456)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1129, file: !758, line: 563, baseType: !908, size: 32, align: 32, offset: 3520)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1129, file: !758, line: 572, baseType: !908, size: 32, align: 32, offset: 3552)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1129, file: !758, line: 581, baseType: !908, size: 32, align: 32, offset: 3584)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1129, file: !758, line: 588, baseType: !1193, size: 64, align: 64, offset: 3648)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !998, line: 36, baseType: !1195)
!1195 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1129, file: !758, line: 593, baseType: !908, size: 32, align: 32, offset: 3712)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1129, file: !758, line: 596, baseType: !908, size: 32, align: 32, offset: 3744)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1129, file: !758, line: 599, baseType: !1097, size: 64, align: 64, offset: 3776)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1129, file: !758, line: 605, baseType: !1097, size: 64, align: 64, offset: 3840)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1129, file: !758, line: 616, baseType: !1097, size: 64, align: 64, offset: 3904)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1129, file: !758, line: 626, baseType: !1202, size: 64, align: 64, offset: 3968)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1203, line: 216, baseType: !999)
!1203 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1129, file: !758, line: 627, baseType: !1202, size: 64, align: 64, offset: 4032)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1129, file: !758, line: 628, baseType: !1202, size: 64, align: 64, offset: 4096)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1129, file: !758, line: 629, baseType: !1202, size: 64, align: 64, offset: 4160)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1129, file: !758, line: 645, baseType: !1097, size: 64, align: 64, offset: 4224)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !969, file: !35, line: 3566, baseType: !1210, size: 64, align: 64, offset: 1408)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!908, !915, !933, !1208, !1092}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !969, file: !35, line: 3567, baseType: !1017, size: 64, align: 64, offset: 1472)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !969, file: !35, line: 3576, baseType: !1215, size: 64, align: 64, offset: 1536)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!908, !915, !1126}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !969, file: !35, line: 3577, baseType: !1219, size: 64, align: 64, offset: 1600)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{!908, !915, !1092}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !969, file: !35, line: 3584, baseType: !1223, size: 64, align: 64, offset: 1664)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!908, !915, !1226}
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !969, file: !35, line: 3589, baseType: !1228, size: 64, align: 64, offset: 1728)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{null, !915}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !969, file: !35, line: 3594, baseType: !908, size: 32, align: 32, offset: 1792)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !969, file: !35, line: 3600, baseType: !926, size: 64, align: 64, offset: 1856)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !969, file: !35, line: 3609, baseType: !1234, size: 64, align: 64, offset: 1920)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1237)
!1237 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !917, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !917, file: !35, line: 1581, baseType: !1050, size: 32, align: 32, offset: 224)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !917, file: !35, line: 1583, baseType: !933, size: 64, align: 64, offset: 256)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !917, file: !35, line: 1591, baseType: !1242, size: 64, align: 64, offset: 320)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !917, file: !35, line: 1598, baseType: !933, size: 64, align: 64, offset: 384)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !917, file: !35, line: 1606, baseType: !1086, size: 64, align: 64, offset: 448)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !917, file: !35, line: 1614, baseType: !908, size: 32, align: 32, offset: 512)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !917, file: !35, line: 1622, baseType: !908, size: 32, align: 32, offset: 544)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !917, file: !35, line: 1628, baseType: !908, size: 32, align: 32, offset: 576)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !917, file: !35, line: 1636, baseType: !908, size: 32, align: 32, offset: 608)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !917, file: !35, line: 1643, baseType: !908, size: 32, align: 32, offset: 640)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !917, file: !35, line: 1657, baseType: !1040, size: 64, align: 64, offset: 704)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !917, file: !35, line: 1658, baseType: !908, size: 32, align: 32, offset: 768)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !917, file: !35, line: 1679, baseType: !979, size: 64, align: 32, offset: 800)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !917, file: !35, line: 1688, baseType: !908, size: 32, align: 32, offset: 864)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !917, file: !35, line: 1712, baseType: !908, size: 32, align: 32, offset: 896)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !917, file: !35, line: 1729, baseType: !908, size: 32, align: 32, offset: 928)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !917, file: !35, line: 1729, baseType: !908, size: 32, align: 32, offset: 960)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !917, file: !35, line: 1744, baseType: !908, size: 32, align: 32, offset: 992)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !917, file: !35, line: 1744, baseType: !908, size: 32, align: 32, offset: 1024)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !917, file: !35, line: 1751, baseType: !908, size: 32, align: 32, offset: 1056)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !917, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !917, file: !35, line: 1791, baseType: !1263, size: 64, align: 64, offset: 1152)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{null, !1266, !1126, !1208, !908, !908, !908}
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !917, file: !35, line: 1808, baseType: !1268, size: 64, align: 64, offset: 1216)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!494, !1266, !986}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !917, file: !35, line: 1816, baseType: !908, size: 32, align: 32, offset: 1280)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !917, file: !35, line: 1825, baseType: !1273, size: 32, align: 32, offset: 1312)
!1273 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !917, file: !35, line: 1830, baseType: !908, size: 32, align: 32, offset: 1344)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !917, file: !35, line: 1838, baseType: !1273, size: 32, align: 32, offset: 1376)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !917, file: !35, line: 1846, baseType: !908, size: 32, align: 32, offset: 1408)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !917, file: !35, line: 1851, baseType: !908, size: 32, align: 32, offset: 1440)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !917, file: !35, line: 1861, baseType: !1273, size: 32, align: 32, offset: 1472)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !917, file: !35, line: 1868, baseType: !1273, size: 32, align: 32, offset: 1504)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !917, file: !35, line: 1875, baseType: !1273, size: 32, align: 32, offset: 1536)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !917, file: !35, line: 1882, baseType: !1273, size: 32, align: 32, offset: 1568)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !917, file: !35, line: 1889, baseType: !1273, size: 32, align: 32, offset: 1600)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !917, file: !35, line: 1896, baseType: !1273, size: 32, align: 32, offset: 1632)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !917, file: !35, line: 1903, baseType: !1273, size: 32, align: 32, offset: 1664)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !917, file: !35, line: 1910, baseType: !908, size: 32, align: 32, offset: 1696)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !917, file: !35, line: 1915, baseType: !908, size: 32, align: 32, offset: 1728)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !917, file: !35, line: 1926, baseType: !1208, size: 64, align: 64, offset: 1792)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !917, file: !35, line: 1935, baseType: !979, size: 64, align: 32, offset: 1856)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !917, file: !35, line: 1942, baseType: !908, size: 32, align: 32, offset: 1920)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !917, file: !35, line: 1948, baseType: !908, size: 32, align: 32, offset: 1952)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !917, file: !35, line: 1954, baseType: !908, size: 32, align: 32, offset: 1984)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !917, file: !35, line: 1960, baseType: !908, size: 32, align: 32, offset: 2016)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !917, file: !35, line: 1984, baseType: !908, size: 32, align: 32, offset: 2048)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !917, file: !35, line: 1991, baseType: !908, size: 32, align: 32, offset: 2080)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !917, file: !35, line: 1996, baseType: !908, size: 32, align: 32, offset: 2112)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !917, file: !35, line: 2004, baseType: !908, size: 32, align: 32, offset: 2144)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !917, file: !35, line: 2011, baseType: !908, size: 32, align: 32, offset: 2176)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !917, file: !35, line: 2018, baseType: !908, size: 32, align: 32, offset: 2208)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !917, file: !35, line: 2027, baseType: !908, size: 32, align: 32, offset: 2240)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !917, file: !35, line: 2034, baseType: !908, size: 32, align: 32, offset: 2272)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !917, file: !35, line: 2044, baseType: !908, size: 32, align: 32, offset: 2304)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !917, file: !35, line: 2054, baseType: !1303, size: 64, align: 64, offset: 2368)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !917, file: !35, line: 2061, baseType: !1303, size: 64, align: 64, offset: 2432)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !917, file: !35, line: 2066, baseType: !908, size: 32, align: 32, offset: 2496)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !917, file: !35, line: 2070, baseType: !908, size: 32, align: 32, offset: 2528)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !917, file: !35, line: 2078, baseType: !908, size: 32, align: 32, offset: 2560)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !917, file: !35, line: 2085, baseType: !908, size: 32, align: 32, offset: 2592)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !917, file: !35, line: 2092, baseType: !908, size: 32, align: 32, offset: 2624)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !917, file: !35, line: 2099, baseType: !908, size: 32, align: 32, offset: 2656)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !917, file: !35, line: 2106, baseType: !908, size: 32, align: 32, offset: 2688)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !917, file: !35, line: 2113, baseType: !908, size: 32, align: 32, offset: 2720)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !917, file: !35, line: 2120, baseType: !908, size: 32, align: 32, offset: 2752)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !917, file: !35, line: 2125, baseType: !908, size: 32, align: 32, offset: 2784)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !917, file: !35, line: 2133, baseType: !908, size: 32, align: 32, offset: 2816)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !917, file: !35, line: 2140, baseType: !908, size: 32, align: 32, offset: 2848)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !917, file: !35, line: 2145, baseType: !908, size: 32, align: 32, offset: 2880)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !917, file: !35, line: 2153, baseType: !908, size: 32, align: 32, offset: 2912)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !917, file: !35, line: 2158, baseType: !908, size: 32, align: 32, offset: 2944)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !917, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !917, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !917, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !917, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !917, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !917, file: !35, line: 2203, baseType: !908, size: 32, align: 32, offset: 3136)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !917, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !917, file: !35, line: 2212, baseType: !908, size: 32, align: 32, offset: 3200)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !917, file: !35, line: 2213, baseType: !908, size: 32, align: 32, offset: 3232)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !917, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !917, file: !35, line: 2232, baseType: !908, size: 32, align: 32, offset: 3296)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !917, file: !35, line: 2243, baseType: !908, size: 32, align: 32, offset: 3328)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !917, file: !35, line: 2249, baseType: !908, size: 32, align: 32, offset: 3360)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !917, file: !35, line: 2256, baseType: !908, size: 32, align: 32, offset: 3392)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !917, file: !35, line: 2263, baseType: !997, size: 64, align: 64, offset: 3456)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !917, file: !35, line: 2270, baseType: !997, size: 64, align: 64, offset: 3520)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !917, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !917, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !917, file: !35, line: 2367, baseType: !1339, size: 64, align: 64, offset: 3648)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DISubroutineType(types: !1341)
!1341 = !{!908, !1266, !1226, !908}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !917, file: !35, line: 2383, baseType: !908, size: 32, align: 32, offset: 3712)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !917, file: !35, line: 2386, baseType: !1273, size: 32, align: 32, offset: 3744)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !917, file: !35, line: 2387, baseType: !1273, size: 32, align: 32, offset: 3776)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !917, file: !35, line: 2394, baseType: !908, size: 32, align: 32, offset: 3808)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !917, file: !35, line: 2401, baseType: !908, size: 32, align: 32, offset: 3840)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !917, file: !35, line: 2408, baseType: !908, size: 32, align: 32, offset: 3872)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !917, file: !35, line: 2415, baseType: !908, size: 32, align: 32, offset: 3904)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !917, file: !35, line: 2422, baseType: !908, size: 32, align: 32, offset: 3936)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !917, file: !35, line: 2423, baseType: !1351, size: 64, align: 64, offset: 3968)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1353)
!1353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1354)
!1354 = !{!1355, !1356, !1357, !1358}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1353, file: !35, line: 827, baseType: !908, size: 32, align: 32)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1353, file: !35, line: 828, baseType: !908, size: 32, align: 32, offset: 32)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1353, file: !35, line: 829, baseType: !908, size: 32, align: 32, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1353, file: !35, line: 830, baseType: !1273, size: 32, align: 32, offset: 96)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !917, file: !35, line: 2430, baseType: !1086, size: 64, align: 64, offset: 4032)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !917, file: !35, line: 2437, baseType: !1086, size: 64, align: 64, offset: 4096)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !917, file: !35, line: 2444, baseType: !1273, size: 32, align: 32, offset: 4160)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !917, file: !35, line: 2451, baseType: !1273, size: 32, align: 32, offset: 4192)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !917, file: !35, line: 2458, baseType: !908, size: 32, align: 32, offset: 4224)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !917, file: !35, line: 2469, baseType: !908, size: 32, align: 32, offset: 4256)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !917, file: !35, line: 2475, baseType: !908, size: 32, align: 32, offset: 4288)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !917, file: !35, line: 2481, baseType: !908, size: 32, align: 32, offset: 4320)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !917, file: !35, line: 2485, baseType: !908, size: 32, align: 32, offset: 4352)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !917, file: !35, line: 2489, baseType: !908, size: 32, align: 32, offset: 4384)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !917, file: !35, line: 2493, baseType: !908, size: 32, align: 32, offset: 4416)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !917, file: !35, line: 2501, baseType: !908, size: 32, align: 32, offset: 4448)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !917, file: !35, line: 2506, baseType: !908, size: 32, align: 32, offset: 4480)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !917, file: !35, line: 2510, baseType: !908, size: 32, align: 32, offset: 4512)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !917, file: !35, line: 2514, baseType: !1086, size: 64, align: 64, offset: 4544)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !917, file: !35, line: 2528, baseType: !1375, size: 64, align: 64, offset: 4608)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DISubroutineType(types: !1377)
!1377 = !{null, !1266, !933, !908, !908}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !917, file: !35, line: 2534, baseType: !908, size: 32, align: 32, offset: 4672)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !917, file: !35, line: 2545, baseType: !908, size: 32, align: 32, offset: 4704)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !917, file: !35, line: 2547, baseType: !908, size: 32, align: 32, offset: 4736)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !917, file: !35, line: 2549, baseType: !908, size: 32, align: 32, offset: 4768)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !917, file: !35, line: 2551, baseType: !908, size: 32, align: 32, offset: 4800)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !917, file: !35, line: 2553, baseType: !908, size: 32, align: 32, offset: 4832)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !917, file: !35, line: 2555, baseType: !908, size: 32, align: 32, offset: 4864)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !917, file: !35, line: 2557, baseType: !908, size: 32, align: 32, offset: 4896)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !917, file: !35, line: 2559, baseType: !908, size: 32, align: 32, offset: 4928)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !917, file: !35, line: 2563, baseType: !908, size: 32, align: 32, offset: 4960)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !917, file: !35, line: 2571, baseType: !1082, size: 64, align: 64, offset: 4992)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !917, file: !35, line: 2579, baseType: !1082, size: 64, align: 64, offset: 5056)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !917, file: !35, line: 2586, baseType: !908, size: 32, align: 32, offset: 5120)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !917, file: !35, line: 2615, baseType: !908, size: 32, align: 32, offset: 5152)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !917, file: !35, line: 2627, baseType: !908, size: 32, align: 32, offset: 5184)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !917, file: !35, line: 2637, baseType: !908, size: 32, align: 32, offset: 5216)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !917, file: !35, line: 2681, baseType: !908, size: 32, align: 32, offset: 5248)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !917, file: !35, line: 2709, baseType: !1086, size: 64, align: 64, offset: 5312)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !917, file: !35, line: 2716, baseType: !1397, size: 64, align: 64, offset: 5376)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1399)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1400)
!1400 = !{!1401, !1402, !1403, !1404, !1405, !1406, !1407, !1413, !1417, !1418, !1419, !1420, !1426, !1427, !1428, !1429, !1430}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1399, file: !35, line: 3642, baseType: !926, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1399, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1399, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1399, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1399, file: !35, line: 3669, baseType: !908, size: 32, align: 32, offset: 160)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1399, file: !35, line: 3682, baseType: !1223, size: 64, align: 64, offset: 192)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1399, file: !35, line: 3698, baseType: !1408, size: 64, align: 64, offset: 256)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DISubroutineType(types: !1410)
!1410 = !{!908, !915, !1411, !1049}
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1001)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1399, file: !35, line: 3712, baseType: !1414, size: 64, align: 64, offset: 320)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{!908, !915, !908, !1411, !1049}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1399, file: !35, line: 3726, baseType: !1408, size: 64, align: 64, offset: 384)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1399, file: !35, line: 3737, baseType: !1017, size: 64, align: 64, offset: 448)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1399, file: !35, line: 3746, baseType: !908, size: 32, align: 32, offset: 512)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1399, file: !35, line: 3757, baseType: !1421, size: 64, align: 64, offset: 576)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DISubroutineType(types: !1423)
!1423 = !{null, !1424}
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1399, file: !35, line: 3766, baseType: !1017, size: 64, align: 64, offset: 640)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1399, file: !35, line: 3774, baseType: !1017, size: 64, align: 64, offset: 704)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1399, file: !35, line: 3780, baseType: !908, size: 32, align: 32, offset: 768)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1399, file: !35, line: 3785, baseType: !908, size: 32, align: 32, offset: 800)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1399, file: !35, line: 3795, baseType: !1431, size: 64, align: 64, offset: 832)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DISubroutineType(types: !1433)
!1433 = !{!908, !915, !1097}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !917, file: !35, line: 2728, baseType: !933, size: 64, align: 64, offset: 5440)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !917, file: !35, line: 2735, baseType: !1150, size: 512, align: 64, offset: 5504)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !917, file: !35, line: 2742, baseType: !908, size: 32, align: 32, offset: 6016)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !917, file: !35, line: 2755, baseType: !908, size: 32, align: 32, offset: 6048)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !917, file: !35, line: 2776, baseType: !908, size: 32, align: 32, offset: 6080)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !917, file: !35, line: 2783, baseType: !908, size: 32, align: 32, offset: 6112)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !917, file: !35, line: 2791, baseType: !908, size: 32, align: 32, offset: 6144)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !917, file: !35, line: 2802, baseType: !1226, size: 64, align: 64, offset: 6208)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !917, file: !35, line: 2811, baseType: !908, size: 32, align: 32, offset: 6272)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !917, file: !35, line: 2821, baseType: !908, size: 32, align: 32, offset: 6304)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !917, file: !35, line: 2830, baseType: !908, size: 32, align: 32, offset: 6336)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !917, file: !35, line: 2840, baseType: !908, size: 32, align: 32, offset: 6368)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !917, file: !35, line: 2851, baseType: !1447, size: 64, align: 64, offset: 6400)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DISubroutineType(types: !1449)
!1449 = !{!908, !1266, !1450, !933, !1208, !908, !908}
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64, align: 64)
!1451 = !DISubroutineType(types: !1452)
!1452 = !{!908, !1266, !933}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !917, file: !35, line: 2871, baseType: !1454, size: 64, align: 64, offset: 6464)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DISubroutineType(types: !1456)
!1456 = !{!908, !1266, !1457, !933, !1208, !908}
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!908, !1266, !933, !908, !908}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !917, file: !35, line: 2878, baseType: !908, size: 32, align: 32, offset: 6528)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !917, file: !35, line: 2885, baseType: !908, size: 32, align: 32, offset: 6560)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !917, file: !35, line: 3005, baseType: !908, size: 32, align: 32, offset: 6592)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !917, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !917, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !917, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !917, file: !35, line: 3037, baseType: !1040, size: 64, align: 64, offset: 6720)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !917, file: !35, line: 3038, baseType: !908, size: 32, align: 32, offset: 6784)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !917, file: !35, line: 3050, baseType: !997, size: 64, align: 64, offset: 6848)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !917, file: !35, line: 3065, baseType: !908, size: 32, align: 32, offset: 6912)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !917, file: !35, line: 3083, baseType: !908, size: 32, align: 32, offset: 6944)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !917, file: !35, line: 3092, baseType: !979, size: 64, align: 32, offset: 6976)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !917, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !917, file: !35, line: 3106, baseType: !979, size: 64, align: 32, offset: 7072)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !917, file: !35, line: 3113, baseType: !1475, size: 64, align: 64, offset: 7168)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1477)
!1477 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1478)
!1478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1479)
!1479 = !{!1480, !1481, !1482, !1483, !1484, !1485, !1488}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1478, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1478, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1478, file: !35, line: 720, baseType: !926, size: 64, align: 64, offset: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1478, file: !35, line: 724, baseType: !926, size: 64, align: 64, offset: 128)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1478, file: !35, line: 728, baseType: !908, size: 32, align: 32, offset: 192)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1478, file: !35, line: 734, baseType: !1486, size: 64, align: 64, offset: 256)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1478, file: !35, line: 739, baseType: !1489, size: 64, align: 64, offset: 320)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !917, file: !35, line: 3129, baseType: !1086, size: 64, align: 64, offset: 7232)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !917, file: !35, line: 3130, baseType: !1086, size: 64, align: 64, offset: 7296)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !917, file: !35, line: 3131, baseType: !1086, size: 64, align: 64, offset: 7360)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !917, file: !35, line: 3132, baseType: !1086, size: 64, align: 64, offset: 7424)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !917, file: !35, line: 3139, baseType: !1082, size: 64, align: 64, offset: 7488)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !917, file: !35, line: 3147, baseType: !908, size: 32, align: 32, offset: 7552)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !917, file: !35, line: 3165, baseType: !908, size: 32, align: 32, offset: 7584)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !917, file: !35, line: 3172, baseType: !908, size: 32, align: 32, offset: 7616)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !917, file: !35, line: 3180, baseType: !908, size: 32, align: 32, offset: 7648)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !917, file: !35, line: 3191, baseType: !1303, size: 64, align: 64, offset: 7680)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !917, file: !35, line: 3199, baseType: !1040, size: 64, align: 64, offset: 7744)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !917, file: !35, line: 3207, baseType: !1082, size: 64, align: 64, offset: 7808)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !917, file: !35, line: 3214, baseType: !1050, size: 32, align: 32, offset: 7872)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !917, file: !35, line: 3224, baseType: !1115, size: 64, align: 64, offset: 7936)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !917, file: !35, line: 3225, baseType: !908, size: 32, align: 32, offset: 8000)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !917, file: !35, line: 3249, baseType: !1097, size: 64, align: 64, offset: 8064)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !917, file: !35, line: 3256, baseType: !908, size: 32, align: 32, offset: 8128)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !917, file: !35, line: 3271, baseType: !908, size: 32, align: 32, offset: 8160)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !917, file: !35, line: 3279, baseType: !1086, size: 64, align: 64, offset: 8192)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !917, file: !35, line: 3301, baseType: !1097, size: 64, align: 64, offset: 8256)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !917, file: !35, line: 3310, baseType: !908, size: 32, align: 32, offset: 8320)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !917, file: !35, line: 3337, baseType: !908, size: 32, align: 32, offset: 8352)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !917, file: !35, line: 3351, baseType: !908, size: 32, align: 32, offset: 8384)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !917, file: !35, line: 3359, baseType: !908, size: 32, align: 32, offset: 8416)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !912, file: !911, line: 91, baseType: !1516, size: 64, align: 64, offset: 64)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1518)
!1518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFPsyModel", file: !911, line: 114, size: 320, align: 64, elements: !1519)
!1519 = !{!1520, !1521, !1525, !1544, !1551}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1518, file: !911, line: 115, baseType: !926, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1518, file: !911, line: 116, baseType: !1522, size: 64, align: 64, offset: 64)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!1523 = !DISubroutineType(types: !1524)
!1524 = !{!908, !909}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1518, file: !911, line: 129, baseType: !1526, size: 64, align: 64, offset: 128)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64, align: 64)
!1527 = !DISubroutineType(types: !1528)
!1528 = !{!1529, !909, !1542, !1542, !908, !908}
!1529 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFPsyWindowInfo", file: !911, line: 84, baseType: !1530)
!1530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFPsyWindowInfo", file: !911, line: 77, size: 768, align: 64, elements: !1531)
!1531 = !{!1532, !1536, !1537, !1538, !1539, !1541}
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "window_type", scope: !1530, file: !911, line: 78, baseType: !1533, size: 96, align: 32)
!1533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 96, align: 32, elements: !1534)
!1534 = !{!1535}
!1535 = !DISubrange(count: 3)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "window_shape", scope: !1530, file: !911, line: 79, baseType: !908, size: 32, align: 32, offset: 96)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "num_windows", scope: !1530, file: !911, line: 80, baseType: !908, size: 32, align: 32, offset: 128)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !1530, file: !911, line: 81, baseType: !1073, size: 256, align: 32, offset: 160)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "clipping", scope: !1530, file: !911, line: 82, baseType: !1540, size: 256, align: 32, offset: 416)
!1540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1273, size: 256, align: 32, elements: !1070)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "window_sizes", scope: !1530, file: !911, line: 83, baseType: !1208, size: 64, align: 64, offset: 704)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1273)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "analyze", scope: !1518, file: !911, line: 139, baseType: !1545, size: 64, align: 64, offset: 192)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64, align: 64)
!1546 = !DISubroutineType(types: !1547)
!1547 = !{null, !909, !908, !1548, !1549}
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64, align: 64)
!1550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1529)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1518, file: !911, line: 141, baseType: !1552, size: 64, align: 64, offset: 256)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1553 = !DISubroutineType(types: !1554)
!1554 = !{null, !909}
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !912, file: !911, line: 93, baseType: !1556, size: 64, align: 64, offset: 128)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64, align: 64)
!1557 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFPsyChannel", file: !911, line: 63, baseType: !1558)
!1558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFPsyChannel", file: !911, line: 60, size: 16416, align: 32, elements: !1559)
!1559 = !{!1560, !1571}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "psy_bands", scope: !1558, file: !911, line: 61, baseType: !1561, size: 16384, align: 32)
!1561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1562, size: 16384, align: 32, elements: !1569)
!1562 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFPsyBand", file: !911, line: 55, baseType: !1563)
!1563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFPsyBand", file: !911, line: 50, size: 128, align: 32, elements: !1564)
!1564 = !{!1565, !1566, !1567, !1568}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1563, file: !911, line: 51, baseType: !908, size: 32, align: 32)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "energy", scope: !1563, file: !911, line: 52, baseType: !1273, size: 32, align: 32, offset: 32)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !1563, file: !911, line: 53, baseType: !1273, size: 32, align: 32, offset: 64)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "spread", scope: !1563, file: !911, line: 54, baseType: !1273, size: 32, align: 32, offset: 96)
!1569 = !{!1570}
!1570 = !DISubrange(count: 128)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !1558, file: !911, line: 62, baseType: !1273, size: 32, align: 32, offset: 16384)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !912, file: !911, line: 94, baseType: !1573, size: 64, align: 64, offset: 192)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFPsyChannelGroup", file: !911, line: 72, baseType: !1575)
!1575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFPsyChannelGroup", file: !911, line: 68, size: 2368, align: 64, elements: !1576)
!1576 = !{!1577, !1581, !1582}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !1575, file: !911, line: 69, baseType: !1578, size: 1280, align: 64)
!1578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1556, size: 1280, align: 64, elements: !1579)
!1579 = !{!1580}
!1580 = !DISubrange(count: 20)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "num_ch", scope: !1575, file: !911, line: 70, baseType: !1001, size: 8, align: 8, offset: 1280)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "coupling", scope: !1575, file: !911, line: 71, baseType: !1583, size: 1024, align: 8, offset: 1288)
!1583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1001, size: 1024, align: 8, elements: !1569)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "num_groups", scope: !912, file: !911, line: 95, baseType: !908, size: 32, align: 32, offset: 256)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !912, file: !911, line: 96, baseType: !908, size: 32, align: 32, offset: 288)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "bands", scope: !912, file: !911, line: 98, baseType: !1134, size: 64, align: 64, offset: 320)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "num_bands", scope: !912, file: !911, line: 99, baseType: !1208, size: 64, align: 64, offset: 384)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "num_lens", scope: !912, file: !911, line: 100, baseType: !908, size: 32, align: 32, offset: 448)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "bitres", scope: !912, file: !911, line: 106, baseType: !1590, size: 96, align: 32, offset: 480)
!1590 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !912, file: !911, line: 102, size: 96, align: 32, elements: !1591)
!1591 = !{!1592, !1593, !1594}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1590, file: !911, line: 103, baseType: !908, size: 32, align: 32)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1590, file: !911, line: 104, baseType: !908, size: 32, align: 32, offset: 32)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1590, file: !911, line: 105, baseType: !908, size: 32, align: 32, offset: 64)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "model_priv_data", scope: !912, file: !911, line: 108, baseType: !933, size: 64, align: 64, offset: 576)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1597 = !{}
!1598 = !DILocalVariable(name: "ctx", arg: 1, scope: !904, file: !905, line: 31, type: !909)
!1599 = !DIExpression()
!1600 = !DILocation(line: 31, column: 53, scope: !904)
!1601 = !DILocalVariable(name: "avctx", arg: 2, scope: !904, file: !905, line: 31, type: !915)
!1602 = !DILocation(line: 31, column: 74, scope: !904)
!1603 = !DILocalVariable(name: "num_lens", arg: 3, scope: !904, file: !905, line: 31, type: !908)
!1604 = !DILocation(line: 31, column: 85, scope: !904)
!1605 = !DILocalVariable(name: "bands", arg: 4, scope: !904, file: !905, line: 32, type: !1596)
!1606 = !DILocation(line: 32, column: 41, scope: !904)
!1607 = !DILocalVariable(name: "num_bands", arg: 5, scope: !904, file: !905, line: 32, type: !989)
!1608 = !DILocation(line: 32, column: 59, scope: !904)
!1609 = !DILocalVariable(name: "num_groups", arg: 6, scope: !904, file: !905, line: 33, type: !908)
!1610 = !DILocation(line: 33, column: 29, scope: !904)
!1611 = !DILocalVariable(name: "group_map", arg: 7, scope: !904, file: !905, line: 33, type: !1411)
!1612 = !DILocation(line: 33, column: 56, scope: !904)
!1613 = !DILocalVariable(name: "i", scope: !904, file: !905, line: 35, type: !908)
!1614 = !DILocation(line: 35, column: 9, scope: !904)
!1615 = !DILocalVariable(name: "j", scope: !904, file: !905, line: 35, type: !908)
!1616 = !DILocation(line: 35, column: 12, scope: !904)
!1617 = !DILocalVariable(name: "k", scope: !904, file: !905, line: 35, type: !908)
!1618 = !DILocation(line: 35, column: 15, scope: !904)
!1619 = !DILocation(line: 37, column: 18, scope: !904)
!1620 = !DILocation(line: 37, column: 5, scope: !904)
!1621 = !DILocation(line: 37, column: 10, scope: !904)
!1622 = !DILocation(line: 37, column: 16, scope: !904)
!1623 = !DILocation(line: 38, column: 52, scope: !904)
!1624 = !DILocation(line: 38, column: 59, scope: !904)
!1625 = !DILocation(line: 38, column: 68, scope: !904)
!1626 = !DILocation(line: 38, column: 15, scope: !904)
!1627 = !DILocation(line: 38, column: 5, scope: !904)
!1628 = !DILocation(line: 38, column: 10, scope: !904)
!1629 = !DILocation(line: 38, column: 13, scope: !904)
!1630 = !DILocation(line: 39, column: 58, scope: !904)
!1631 = !DILocation(line: 39, column: 18, scope: !904)
!1632 = !DILocation(line: 39, column: 5, scope: !904)
!1633 = !DILocation(line: 39, column: 10, scope: !904)
!1634 = !DILocation(line: 39, column: 16, scope: !904)
!1635 = !DILocation(line: 40, column: 58, scope: !904)
!1636 = !DILocation(line: 40, column: 18, scope: !904)
!1637 = !DILocation(line: 40, column: 5, scope: !904)
!1638 = !DILocation(line: 40, column: 10, scope: !904)
!1639 = !DILocation(line: 40, column: 16, scope: !904)
!1640 = !DILocation(line: 41, column: 66, scope: !904)
!1641 = !DILocation(line: 41, column: 22, scope: !904)
!1642 = !DILocation(line: 41, column: 5, scope: !904)
!1643 = !DILocation(line: 41, column: 10, scope: !904)
!1644 = !DILocation(line: 41, column: 20, scope: !904)
!1645 = !DILocation(line: 42, column: 19, scope: !904)
!1646 = !DILocation(line: 42, column: 26, scope: !904)
!1647 = !DILocation(line: 42, column: 5, scope: !904)
!1648 = !DILocation(line: 42, column: 10, scope: !904)
!1649 = !DILocation(line: 42, column: 17, scope: !904)
!1650 = !DILocation(line: 44, column: 10, scope: !1651)
!1651 = distinct !DILexicalBlock(scope: !904, file: !905, line: 44, column: 9)
!1652 = !DILocation(line: 44, column: 15, scope: !1651)
!1653 = !DILocation(line: 44, column: 18, scope: !1651)
!1654 = !DILocation(line: 44, column: 22, scope: !1655)
!1655 = !DILexicalBlockFile(scope: !1651, file: !905, discriminator: 1)
!1656 = !DILocation(line: 44, column: 27, scope: !1655)
!1657 = !DILocation(line: 44, column: 33, scope: !1655)
!1658 = !DILocation(line: 44, column: 37, scope: !1659)
!1659 = !DILexicalBlockFile(scope: !1651, file: !905, discriminator: 2)
!1660 = !DILocation(line: 44, column: 42, scope: !1659)
!1661 = !DILocation(line: 44, column: 48, scope: !1659)
!1662 = !DILocation(line: 44, column: 52, scope: !1663)
!1663 = !DILexicalBlockFile(scope: !1651, file: !905, discriminator: 3)
!1664 = !DILocation(line: 44, column: 57, scope: !1663)
!1665 = !DILocation(line: 44, column: 9, scope: !1663)
!1666 = !DILocation(line: 45, column: 20, scope: !1667)
!1667 = distinct !DILexicalBlock(scope: !1651, file: !905, line: 44, column: 68)
!1668 = !DILocation(line: 45, column: 9, scope: !1667)
!1669 = !DILocation(line: 46, column: 9, scope: !1667)
!1670 = !DILocation(line: 49, column: 12, scope: !904)
!1671 = !DILocation(line: 49, column: 17, scope: !904)
!1672 = !DILocation(line: 49, column: 5, scope: !904)
!1673 = !DILocation(line: 49, column: 24, scope: !904)
!1674 = !DILocation(line: 49, column: 55, scope: !904)
!1675 = !DILocation(line: 49, column: 53, scope: !904)
!1676 = !DILocation(line: 50, column: 12, scope: !904)
!1677 = !DILocation(line: 50, column: 17, scope: !904)
!1678 = !DILocation(line: 50, column: 5, scope: !904)
!1679 = !DILocation(line: 50, column: 28, scope: !904)
!1680 = !DILocation(line: 50, column: 67, scope: !904)
!1681 = !DILocation(line: 50, column: 65, scope: !904)
!1682 = !DILocation(line: 53, column: 12, scope: !1683)
!1683 = distinct !DILexicalBlock(scope: !904, file: !905, line: 53, column: 5)
!1684 = !DILocation(line: 53, column: 10, scope: !1683)
!1685 = !DILocation(line: 53, column: 17, scope: !1686)
!1686 = !DILexicalBlockFile(scope: !1687, file: !905, discriminator: 1)
!1687 = distinct !DILexicalBlock(scope: !1683, file: !905, line: 53, column: 5)
!1688 = !DILocation(line: 53, column: 21, scope: !1686)
!1689 = !DILocation(line: 53, column: 19, scope: !1686)
!1690 = !DILocation(line: 53, column: 5, scope: !1686)
!1691 = !DILocation(line: 58, column: 42, scope: !1692)
!1692 = distinct !DILexicalBlock(scope: !1687, file: !905, line: 53, column: 38)
!1693 = !DILocation(line: 58, column: 32, scope: !1692)
!1694 = !DILocation(line: 58, column: 45, scope: !1692)
!1695 = !DILocation(line: 58, column: 20, scope: !1692)
!1696 = !DILocation(line: 58, column: 9, scope: !1692)
!1697 = !DILocation(line: 58, column: 14, scope: !1692)
!1698 = !DILocation(line: 58, column: 23, scope: !1692)
!1699 = !DILocation(line: 58, column: 30, scope: !1692)
!1700 = !DILocation(line: 59, column: 16, scope: !1701)
!1701 = distinct !DILexicalBlock(scope: !1692, file: !905, line: 59, column: 9)
!1702 = !DILocation(line: 59, column: 14, scope: !1701)
!1703 = !DILocation(line: 59, column: 21, scope: !1704)
!1704 = !DILexicalBlockFile(scope: !1705, file: !905, discriminator: 1)
!1705 = distinct !DILexicalBlock(scope: !1701, file: !905, line: 59, column: 9)
!1706 = !DILocation(line: 59, column: 36, scope: !1704)
!1707 = !DILocation(line: 59, column: 25, scope: !1704)
!1708 = !DILocation(line: 59, column: 30, scope: !1704)
!1709 = !DILocation(line: 59, column: 39, scope: !1704)
!1710 = !DILocation(line: 59, column: 46, scope: !1704)
!1711 = !DILocation(line: 59, column: 23, scope: !1704)
!1712 = !DILocation(line: 59, column: 9, scope: !1704)
!1713 = !DILocation(line: 60, column: 45, scope: !1705)
!1714 = !DILocation(line: 60, column: 36, scope: !1705)
!1715 = !DILocation(line: 60, column: 41, scope: !1705)
!1716 = !DILocation(line: 60, column: 30, scope: !1705)
!1717 = !DILocation(line: 60, column: 13, scope: !1705)
!1718 = !DILocation(line: 60, column: 24, scope: !1705)
!1719 = !DILocation(line: 60, column: 18, scope: !1705)
!1720 = !DILocation(line: 60, column: 27, scope: !1705)
!1721 = !DILocation(line: 60, column: 33, scope: !1705)
!1722 = !DILocation(line: 59, column: 52, scope: !1723)
!1723 = !DILexicalBlockFile(scope: !1705, file: !905, discriminator: 2)
!1724 = !DILocation(line: 59, column: 9, scope: !1723)
!1725 = distinct !{!1725, !1726}
!1726 = !DILocation(line: 59, column: 9, scope: !1692)
!1727 = !DILocation(line: 61, column: 5, scope: !1692)
!1728 = !DILocation(line: 53, column: 34, scope: !1729)
!1729 = !DILexicalBlockFile(scope: !1687, file: !905, discriminator: 2)
!1730 = !DILocation(line: 53, column: 5, scope: !1729)
!1731 = distinct !{!1731, !1732}
!1732 = !DILocation(line: 53, column: 5, scope: !904)
!1733 = !DILocation(line: 63, column: 13, scope: !904)
!1734 = !DILocation(line: 63, column: 18, scope: !904)
!1735 = !DILocation(line: 63, column: 25, scope: !904)
!1736 = !DILocation(line: 63, column: 5, scope: !904)
!1737 = !DILocation(line: 65, column: 9, scope: !1738)
!1738 = distinct !DILexicalBlock(scope: !904, file: !905, line: 63, column: 35)
!1739 = !DILocation(line: 65, column: 14, scope: !1738)
!1740 = !DILocation(line: 65, column: 20, scope: !1738)
!1741 = !DILocation(line: 66, column: 9, scope: !1738)
!1742 = !DILocation(line: 68, column: 9, scope: !1743)
!1743 = distinct !DILexicalBlock(scope: !904, file: !905, line: 68, column: 9)
!1744 = !DILocation(line: 68, column: 14, scope: !1743)
!1745 = !DILocation(line: 68, column: 21, scope: !1743)
!1746 = !DILocation(line: 68, column: 9, scope: !904)
!1747 = !DILocation(line: 69, column: 16, scope: !1743)
!1748 = !DILocation(line: 69, column: 21, scope: !1743)
!1749 = !DILocation(line: 69, column: 28, scope: !1743)
!1750 = !DILocation(line: 69, column: 33, scope: !1743)
!1751 = !DILocation(line: 69, column: 9, scope: !1743)
!1752 = !DILocation(line: 70, column: 5, scope: !904)
!1753 = !DILocation(line: 71, column: 1, scope: !904)
!1754 = distinct !DISubprogram(name: "ff_psy_end", scope: !905, file: !905, line: 83, type: !1553, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1597)
!1755 = !DILocalVariable(name: "ctx", arg: 1, scope: !1754, file: !905, line: 83, type: !909)
!1756 = !DILocation(line: 83, column: 53, scope: !1754)
!1757 = !DILocation(line: 85, column: 9, scope: !1758)
!1758 = distinct !DILexicalBlock(scope: !1754, file: !905, line: 85, column: 9)
!1759 = !DILocation(line: 85, column: 14, scope: !1758)
!1760 = !DILocation(line: 85, column: 20, scope: !1758)
!1761 = !DILocation(line: 85, column: 23, scope: !1762)
!1762 = !DILexicalBlockFile(scope: !1758, file: !905, discriminator: 1)
!1763 = !DILocation(line: 85, column: 28, scope: !1762)
!1764 = !DILocation(line: 85, column: 35, scope: !1762)
!1765 = !DILocation(line: 85, column: 9, scope: !1762)
!1766 = !DILocation(line: 86, column: 9, scope: !1758)
!1767 = !DILocation(line: 86, column: 14, scope: !1758)
!1768 = !DILocation(line: 86, column: 21, scope: !1758)
!1769 = !DILocation(line: 86, column: 25, scope: !1758)
!1770 = !DILocation(line: 87, column: 15, scope: !1754)
!1771 = !DILocation(line: 87, column: 20, scope: !1754)
!1772 = !DILocation(line: 87, column: 14, scope: !1754)
!1773 = !DILocation(line: 87, column: 5, scope: !1754)
!1774 = !DILocation(line: 88, column: 15, scope: !1754)
!1775 = !DILocation(line: 88, column: 20, scope: !1754)
!1776 = !DILocation(line: 88, column: 14, scope: !1754)
!1777 = !DILocation(line: 88, column: 5, scope: !1754)
!1778 = !DILocation(line: 89, column: 15, scope: !1754)
!1779 = !DILocation(line: 89, column: 20, scope: !1754)
!1780 = !DILocation(line: 89, column: 14, scope: !1754)
!1781 = !DILocation(line: 89, column: 5, scope: !1754)
!1782 = !DILocation(line: 90, column: 15, scope: !1754)
!1783 = !DILocation(line: 90, column: 20, scope: !1754)
!1784 = !DILocation(line: 90, column: 14, scope: !1754)
!1785 = !DILocation(line: 90, column: 5, scope: !1754)
!1786 = !DILocation(line: 91, column: 1, scope: !1754)
!1787 = distinct !DISubprogram(name: "ff_psy_find_group", scope: !905, file: !905, line: 73, type: !1788, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1597)
!1788 = !DISubroutineType(types: !1789)
!1789 = !{!1573, !909, !908}
!1790 = !DILocalVariable(name: "ctx", arg: 1, scope: !1787, file: !905, line: 73, type: !909)
!1791 = !DILocation(line: 73, column: 52, scope: !1787)
!1792 = !DILocalVariable(name: "channel", arg: 2, scope: !1787, file: !905, line: 73, type: !908)
!1793 = !DILocation(line: 73, column: 61, scope: !1787)
!1794 = !DILocalVariable(name: "i", scope: !1787, file: !905, line: 75, type: !908)
!1795 = !DILocation(line: 75, column: 9, scope: !1787)
!1796 = !DILocalVariable(name: "ch", scope: !1787, file: !905, line: 75, type: !908)
!1797 = !DILocation(line: 75, column: 16, scope: !1787)
!1798 = !DILocation(line: 77, column: 5, scope: !1787)
!1799 = !DILocation(line: 77, column: 12, scope: !1800)
!1800 = !DILexicalBlockFile(scope: !1787, file: !905, discriminator: 1)
!1801 = !DILocation(line: 77, column: 18, scope: !1800)
