; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--g722.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--g722.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.G722Band = type { i16, i32, [2 x i8], i16, [2 x i16], [6 x i32], [6 x i16], i16, i16 }

@ff_g722_high_inv_quant = constant [4 x i16] [i16 -926, i16 -202, i16 926, i16 202], align 2
@ff_g722_low_inv_quant4 = constant [16 x i16] [i16 0, i16 -2557, i16 -1612, i16 -1121, i16 -786, i16 -530, i16 -323, i16 -150, i16 2557, i16 1612, i16 1121, i16 786, i16 530, i16 323, i16 150, i16 0], align 16
@ff_g722_low_inv_quant6 = constant [64 x i16] [i16 -17, i16 -17, i16 -17, i16 -17, i16 -3101, i16 -2738, i16 -2376, i16 -2088, i16 -1873, i16 -1689, i16 -1535, i16 -1399, i16 -1279, i16 -1170, i16 -1072, i16 -982, i16 -899, i16 -822, i16 -750, i16 -682, i16 -618, i16 -558, i16 -501, i16 -447, i16 -396, i16 -347, i16 -300, i16 -254, i16 -211, i16 -170, i16 -130, i16 -91, i16 3101, i16 2738, i16 2376, i16 2088, i16 1873, i16 1689, i16 1535, i16 1399, i16 1279, i16 1170, i16 1072, i16 982, i16 899, i16 822, i16 750, i16 682, i16 618, i16 558, i16 501, i16 447, i16 396, i16 347, i16 300, i16 254, i16 211, i16 170, i16 130, i16 91, i16 54, i16 17, i16 -54, i16 -17], align 16

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, globals: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--g722.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{}
!3 = !{!4, !13, !17, !21, !28, !29, !33}
!4 = distinct !DIGlobalVariable(name: "ff_g722_high_inv_quant", scope: !0, file: !5, line: 51, type: !6, isLocal: false, isDefinition: true, variable: [4 x i16]* @ff_g722_high_inv_quant)
!5 = !DIFile(filename: "libavcodec/g722.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!6 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, align: 16, elements: !11)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !9, line: 37, baseType: !10)
!9 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!10 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!11 = !{!12}
!12 = !DISubrange(count: 4)
!13 = distinct !DIGlobalVariable(name: "ff_g722_low_inv_quant4", scope: !0, file: !5, line: 59, type: !14, isLocal: false, isDefinition: true, variable: [16 x i16]* @ff_g722_low_inv_quant4)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, align: 16, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 16)
!17 = distinct !DIGlobalVariable(name: "ff_g722_low_inv_quant6", scope: !0, file: !5, line: 63, type: !18, isLocal: false, isDefinition: true, variable: [64 x i16]* @ff_g722_low_inv_quant6)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, align: 16, elements: !19)
!19 = !{!20}
!20 = !DISubrange(count: 64)
!21 = distinct !DIGlobalVariable(name: "sign_lookup", scope: !0, file: !5, line: 42, type: !22, isLocal: true, isDefinition: true, variable: [2 x i8]* @sign_lookup)
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 16, align: 8, elements: !26)
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !9, line: 36, baseType: !25)
!25 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!26 = !{!27}
!27 = !DISubrange(count: 2)
!28 = distinct !DIGlobalVariable(name: "low_log_factor_step", scope: !0, file: !5, line: 55, type: !14, isLocal: true, isDefinition: true, variable: [16 x i16]* @low_log_factor_step)
!29 = distinct !DIGlobalVariable(name: "inv_log2_table", scope: !0, file: !5, line: 44, type: !30, isLocal: true, isDefinition: true, variable: [32 x i16]* @inv_log2_table)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, align: 16, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 32)
!33 = distinct !DIGlobalVariable(name: "high_log_factor_step", scope: !0, file: !5, line: 50, type: !34, isLocal: true, isDefinition: true, variable: [2 x i16]* @high_log_factor_step)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32, align: 16, elements: !26)
!35 = !{i32 2, !"Dwarf Version", i32 4}
!36 = !{i32 2, !"Debug Info Version", i32 3}
!37 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!38 = distinct !DISubprogram(name: "ff_g722_update_low_predictor", scope: !5, file: !5, line: 143, type: !39, isLocal: false, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !41, !62}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "G722Band", file: !43, line: 43, size: 448, align: 32, elements: !44)
!43 = !DIFile(filename: "libavcodec/g722.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!44 = !{!45, !46, !49, !51, !52, !54, !58, !60, !61}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "s_predictor", scope: !42, file: !43, line: 44, baseType: !8, size: 16, align: 16)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "s_zero", scope: !42, file: !43, line: 45, baseType: !47, size: 32, align: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !9, line: 38, baseType: !48)
!48 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "part_reconst_mem", scope: !42, file: !43, line: 46, baseType: !50, size: 16, align: 8, offset: 64)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 16, align: 8, elements: !26)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qtzd_reconst", scope: !42, file: !43, line: 47, baseType: !8, size: 16, align: 16, offset: 80)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "pole_mem", scope: !42, file: !43, line: 48, baseType: !53, size: 32, align: 16, offset: 96)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, align: 16, elements: !26)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "diff_mem", scope: !42, file: !43, line: 49, baseType: !55, size: 192, align: 32, offset: 128)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 192, align: 32, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 6)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "zero_mem", scope: !42, file: !43, line: 50, baseType: !59, size: 96, align: 16, offset: 320)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 96, align: 16, elements: !56)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "log_factor", scope: !42, file: !43, line: 51, baseType: !8, size: 16, align: 16, offset: 416)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "scale_factor", scope: !42, file: !43, line: 52, baseType: !8, size: 16, align: 16, offset: 432)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!63 = !DILocalVariable(name: "a", arg: 1, scope: !64, file: !65, line: 127, type: !48)
!64 = distinct !DISubprogram(name: "av_clip_c", scope: !65, file: !65, line: 127, type: !66, isLocal: true, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!65 = !DIFile(filename: "./libavutil/common.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!66 = !DISubroutineType(types: !67)
!67 = !{!48, !48, !48, !48}
!68 = !DIExpression()
!69 = !DILocation(line: 127, column: 87, scope: !64, inlinedAt: !70)
!70 = distinct !DILocation(line: 149, column: 24, scope: !38)
!71 = !DILocalVariable(name: "amin", arg: 2, scope: !64, file: !65, line: 127, type: !48)
!72 = !DILocation(line: 127, column: 94, scope: !64, inlinedAt: !70)
!73 = !DILocalVariable(name: "amax", arg: 3, scope: !64, file: !65, line: 127, type: !48)
!74 = !DILocation(line: 127, column: 104, scope: !64, inlinedAt: !70)
!75 = !DILocalVariable(name: "band", arg: 1, scope: !38, file: !5, line: 143, type: !41)
!76 = !DILocation(line: 143, column: 52, scope: !38)
!77 = !DILocalVariable(name: "ilow", arg: 2, scope: !38, file: !5, line: 143, type: !62)
!78 = !DILocation(line: 143, column: 68, scope: !38)
!79 = !DILocation(line: 145, column: 28, scope: !38)
!80 = !DILocation(line: 146, column: 28, scope: !38)
!81 = !DILocation(line: 146, column: 34, scope: !38)
!82 = !DILocation(line: 146, column: 72, scope: !38)
!83 = !DILocation(line: 146, column: 49, scope: !38)
!84 = !DILocation(line: 146, column: 47, scope: !38)
!85 = !DILocation(line: 146, column: 78, scope: !38)
!86 = !DILocation(line: 145, column: 5, scope: !38)
!87 = !DILocation(line: 149, column: 35, scope: !38)
!88 = !DILocation(line: 149, column: 41, scope: !38)
!89 = !DILocation(line: 149, column: 52, scope: !38)
!90 = !DILocation(line: 149, column: 58, scope: !38)
!91 = !DILocation(line: 150, column: 54, scope: !38)
!92 = !DILocation(line: 150, column: 34, scope: !38)
!93 = !DILocation(line: 149, column: 64, scope: !38)
!94 = !DILocation(line: 149, column: 24, scope: !38)
!95 = !DILocation(line: 132, column: 9, scope: !96, inlinedAt: !70)
!96 = distinct !DILexicalBlock(scope: !64, file: !65, line: 132, column: 9)
!97 = !DILocation(line: 132, column: 13, scope: !96, inlinedAt: !70)
!98 = !DILocation(line: 132, column: 11, scope: !96, inlinedAt: !70)
!99 = !DILocation(line: 132, column: 9, scope: !64, inlinedAt: !70)
!100 = !DILocation(line: 132, column: 26, scope: !101, inlinedAt: !70)
!101 = !DILexicalBlockFile(scope: !96, file: !65, discriminator: 1)
!102 = !DILocation(line: 132, column: 19, scope: !101, inlinedAt: !70)
!103 = !DILocation(line: 133, column: 14, scope: !104, inlinedAt: !70)
!104 = distinct !DILexicalBlock(scope: !96, file: !65, line: 133, column: 14)
!105 = !DILocation(line: 133, column: 18, scope: !104, inlinedAt: !70)
!106 = !DILocation(line: 133, column: 16, scope: !104, inlinedAt: !70)
!107 = !DILocation(line: 133, column: 14, scope: !96, inlinedAt: !70)
!108 = !DILocation(line: 133, column: 31, scope: !109, inlinedAt: !70)
!109 = !DILexicalBlockFile(scope: !104, file: !65, discriminator: 1)
!110 = !DILocation(line: 133, column: 24, scope: !109, inlinedAt: !70)
!111 = !DILocation(line: 134, column: 17, scope: !104, inlinedAt: !70)
!112 = !DILocation(line: 134, column: 10, scope: !104, inlinedAt: !70)
!113 = !DILocation(line: 135, column: 1, scope: !64, inlinedAt: !70)
!114 = !DILocation(line: 149, column: 5, scope: !38)
!115 = !DILocation(line: 149, column: 11, scope: !38)
!116 = !DILocation(line: 149, column: 22, scope: !38)
!117 = !DILocation(line: 151, column: 46, scope: !38)
!118 = !DILocation(line: 151, column: 52, scope: !38)
!119 = !DILocation(line: 151, column: 63, scope: !38)
