; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--dvbsub_parser.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--dvbsub_parser.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecParserContext = type { i8*, %struct.AVCodecParser*, i64, i64, i64, i32, i32, i64, i64, i64, i64, i32, i32, [4 x i64], [4 x i64], [4 x i64], i32, i64, [4 x i64], i32, i64, i32, i32, i32, [4 x i64], i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!840 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!841 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!842 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!843 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !509, line: 493, size: 32, align: 32, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861}
!845 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!846 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!847 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!848 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!849 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!850 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!851 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!852 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!853 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!854 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!855 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!856 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!857 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!858 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!859 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!860 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!861 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!862 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !509, line: 538, size: 32, align: 32, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871}
!864 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!865 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!866 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!867 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!868 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!869 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!870 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!871 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892}
!886 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!887 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!888 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!889 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!890 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!891 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!892 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!893 = !{!894, !897}
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !895, line: 40, baseType: !896)
!895 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!896 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64, align: 64)
!898 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !900, line: 222, size: 16, align: 8, elements: !901)
!900 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!901 = !{!902}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !899, file: !900, line: 222, baseType: !903, size: 16, align: 16)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !895, line: 49, baseType: !904)
!904 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!905 = !{!906}
!906 = distinct !DIGlobalVariable(name: "ff_dvbsub_parser", scope: !0, file: !907, line: 182, type: !908, isLocal: false, isDefinition: true, variable: { [5 x i32], i32, i32 (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecParserContext*, %struct.AVCodecContext*, i8**, i32*, i8*, i32)*, void (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecContext*, i8*, i32)*, %struct.AVCodecParser* }* @ff_dvbsub_parser)
!907 = !DIFile(filename: "libavcodec/dvbsub_parser.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParser", file: !4, line: 5272, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParser", file: !4, line: 5259, size: 512, align: 64, elements: !910)
!910 = !{!911, !916, !917, !966, !1694, !1698, !1702}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !909, file: !4, line: 5260, baseType: !912, size: 160, align: 32)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !913, size: 160, align: 32, elements: !914)
!913 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!914 = !{!915}
!915 = !DISubrange(count: 5)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !909, file: !4, line: 5261, baseType: !913, size: 32, align: 32, offset: 160)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "parser_init", scope: !909, file: !4, line: 5262, baseType: !918, size: 64, align: 64, offset: 192)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!913, !921}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParserContext", file: !4, line: 5257, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParserContext", file: !4, line: 5092, size: 2816, align: 64, elements: !924)
!924 = !{!925, !927, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !923, file: !4, line: 5093, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !923, file: !4, line: 5094, baseType: !928, size: 64, align: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !923, file: !4, line: 5095, baseType: !894, size: 64, align: 64, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "cur_offset", scope: !923, file: !4, line: 5096, baseType: !894, size: 64, align: 64, offset: 192)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame_offset", scope: !923, file: !4, line: 5098, baseType: !894, size: 64, align: 64, offset: 256)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !923, file: !4, line: 5100, baseType: !913, size: 32, align: 32, offset: 320)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !923, file: !4, line: 5110, baseType: !913, size: 32, align: 32, offset: 352)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !923, file: !4, line: 5111, baseType: !894, size: 64, align: 64, offset: 384)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !923, file: !4, line: 5112, baseType: !894, size: 64, align: 64, offset: 448)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "last_pts", scope: !923, file: !4, line: 5115, baseType: !894, size: 64, align: 64, offset: 512)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "last_dts", scope: !923, file: !4, line: 5116, baseType: !894, size: 64, align: 64, offset: 576)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "fetch_timestamp", scope: !923, file: !4, line: 5117, baseType: !913, size: 32, align: 32, offset: 640)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_start_index", scope: !923, file: !4, line: 5120, baseType: !913, size: 32, align: 32, offset: 672)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_offset", scope: !923, file: !4, line: 5121, baseType: !941, size: 256, align: 64, offset: 704)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 256, align: 64, elements: !942)
!942 = !{!943}
!943 = !DISubrange(count: 4)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pts", scope: !923, file: !4, line: 5122, baseType: !941, size: 256, align: 64, offset: 960)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_dts", scope: !923, file: !4, line: 5123, baseType: !941, size: 256, align: 64, offset: 1216)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !923, file: !4, line: 5125, baseType: !913, size: 32, align: 32, offset: 1472)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !923, file: !4, line: 5132, baseType: !894, size: 64, align: 64, offset: 1536)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_end", scope: !923, file: !4, line: 5133, baseType: !941, size: 256, align: 64, offset: 1600)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !923, file: !4, line: 5141, baseType: !913, size: 32, align: 32, offset: 1856)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !923, file: !4, line: 5148, baseType: !894, size: 64, align: 64, offset: 1920)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "dts_sync_point", scope: !923, file: !4, line: 5161, baseType: !913, size: 32, align: 32, offset: 1984)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "dts_ref_dts_delta", scope: !923, file: !4, line: 5176, baseType: !913, size: 32, align: 32, offset: 2016)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "pts_dts_delta", scope: !923, file: !4, line: 5190, baseType: !913, size: 32, align: 32, offset: 2048)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pos", scope: !923, file: !4, line: 5197, baseType: !941, size: 256, align: 64, offset: 2112)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !923, file: !4, line: 5202, baseType: !894, size: 64, align: 64, offset: 2368)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !923, file: !4, line: 5207, baseType: !894, size: 64, align: 64, offset: 2432)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !923, file: !4, line: 5214, baseType: !913, size: 32, align: 32, offset: 2496)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !923, file: !4, line: 5216, baseType: !3, size: 32, align: 32, offset: 2528)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "picture_structure", scope: !923, file: !4, line: 5226, baseType: !12, size: 32, align: 32, offset: 2560)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "output_picture_number", scope: !923, file: !4, line: 5234, baseType: !913, size: 32, align: 32, offset: 2592)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !923, file: !4, line: 5239, baseType: !913, size: 32, align: 32, offset: 2624)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !923, file: !4, line: 5240, baseType: !913, size: 32, align: 32, offset: 2656)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !923, file: !4, line: 5245, baseType: !913, size: 32, align: 32, offset: 2688)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !923, file: !4, line: 5246, baseType: !913, size: 32, align: 32, offset: 2720)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !923, file: !4, line: 5256, baseType: !913, size: 32, align: 32, offset: 2752)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "parser_parse", scope: !909, file: !4, line: 5265, baseType: !967, size: 64, align: 64, offset: 256)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!913, !921, !970, !1693, !1261, !1087, !913}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !973)
!973 = !{!974, !1018, !1019, !1020, !1291, !1292, !1293, !1294, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1447, !1451, !1452, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1631, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !972, file: !4, line: 1561, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !19, line: 143, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !19, line: 67, size: 640, align: 64, elements: !979)
!979 = !{!980, !984, !988, !992, !993, !994, !995, !999, !1005, !1007, !1011}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !978, file: !19, line: 72, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!983 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !978, file: !19, line: 78, baseType: !985, size: 64, align: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!981, !926}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !978, file: !19, line: 85, baseType: !989, size: 64, align: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !19, line: 85, flags: DIFlagFwdDecl)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !978, file: !19, line: 93, baseType: !913, size: 32, align: 32, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !978, file: !19, line: 99, baseType: !913, size: 32, align: 32, offset: 224)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !978, file: !19, line: 108, baseType: !913, size: 32, align: 32, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !978, file: !19, line: 113, baseType: !996, size: 64, align: 64, offset: 320)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!926, !926, !926}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !978, file: !19, line: 123, baseType: !1000, size: 64, align: 64, offset: 384)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!1003, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !978, file: !19, line: 130, baseType: !1006, size: 32, align: 32, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !19, line: 48, baseType: !18)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !978, file: !19, line: 136, baseType: !1008, size: 64, align: 64, offset: 512)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!1006, !926}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !978, file: !19, line: 142, baseType: !1012, size: 64, align: 64, offset: 576)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!913, !1015, !926, !981, !913}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !19, line: 60, flags: DIFlagFwdDecl)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !972, file: !4, line: 1562, baseType: !913, size: 32, align: 32, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !972, file: !4, line: 1564, baseType: !39, size: 32, align: 32, offset: 96)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !972, file: !4, line: 1565, baseType: !1021, size: 64, align: 64, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1030, !1039, !1042, !1045, !1048, !1053, !1056, !1057, !1065, !1066, !1067, !1069, !1073, !1079, !1090, !1094, !1095, !1141, !1262, !1266, !1267, !1271, !1275, !1280, !1284, !1285, !1286}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1023, file: !4, line: 3475, baseType: !981, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1023, file: !4, line: 3480, baseType: !981, size: 64, align: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1023, file: !4, line: 3481, baseType: !39, size: 32, align: 32, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1023, file: !4, line: 3482, baseType: !49, size: 32, align: 32, offset: 160)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1023, file: !4, line: 3487, baseType: !913, size: 32, align: 32, offset: 192)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1023, file: !4, line: 3488, baseType: !1031, size: 64, align: 64, offset: 256)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1033)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1034, line: 61, baseType: !1035)
!1034 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1034, line: 58, size: 64, align: 32, elements: !1036)
!1036 = !{!1037, !1038}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1035, file: !1034, line: 59, baseType: !913, size: 32, align: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1035, file: !1034, line: 60, baseType: !913, size: 32, align: 32, offset: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1023, file: !4, line: 3489, baseType: !1040, size: 64, align: 64, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1023, file: !4, line: 3490, baseType: !1043, size: 64, align: 64, offset: 384)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !913)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1023, file: !4, line: 3491, baseType: !1046, size: 64, align: 64, offset: 448)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1023, file: !4, line: 3492, baseType: !1049, size: 64, align: 64, offset: 512)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1051)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !895, line: 55, baseType: !1052)
!1052 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1023, file: !4, line: 3493, baseType: !1054, size: 8, align: 8, offset: 576)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !895, line: 48, baseType: !1055)
!1055 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1023, file: !4, line: 3494, baseType: !975, size: 64, align: 64, offset: 640)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1023, file: !4, line: 3495, baseType: !1058, size: 64, align: 64, offset: 704)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1060)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1062)
!1062 = !{!1063, !1064}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1061, file: !4, line: 3402, baseType: !913, size: 32, align: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1061, file: !4, line: 3403, baseType: !981, size: 64, align: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1023, file: !4, line: 3507, baseType: !981, size: 64, align: 64, offset: 768)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1023, file: !4, line: 3516, baseType: !913, size: 32, align: 32, offset: 832)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1023, file: !4, line: 3517, baseType: !1068, size: 64, align: 64, offset: 896)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1023, file: !4, line: 3527, baseType: !1070, size: 64, align: 64, offset: 960)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!913, !970}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1023, file: !4, line: 3535, baseType: !1074, size: 64, align: 64, offset: 1024)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!913, !970, !1077}
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1023, file: !4, line: 3541, baseType: !1080, size: 64, align: 64, offset: 1088)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1082)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1084, line: 223, size: 128, align: 64, elements: !1085)
!1084 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1085 = !{!1086, !1089}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1083, file: !1084, line: 224, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1054)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1083, file: !1084, line: 225, baseType: !1087, size: 64, align: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1023, file: !4, line: 3549, baseType: !1091, size: 64, align: 64, offset: 1152)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{null, !1068}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1023, file: !4, line: 3551, baseType: !1070, size: 64, align: 64, offset: 1216)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1023, file: !4, line: 3552, baseType: !1096, size: 64, align: 64, offset: 1280)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!913, !970, !1099, !913, !1100}
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1102)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1103)
!1103 = !{!1104, !1105, !1108, !1109, !1110, !1140}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1102, file: !4, line: 3921, baseType: !903, size: 16, align: 16)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1102, file: !4, line: 3922, baseType: !1106, size: 32, align: 32, offset: 32)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !895, line: 51, baseType: !1107)
!1107 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1102, file: !4, line: 3923, baseType: !1106, size: 32, align: 32, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1102, file: !4, line: 3924, baseType: !1107, size: 32, align: 32, offset: 96)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1102, file: !4, line: 3925, baseType: !1111, size: 64, align: 64, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1115)
!1115 = !{!1116, !1117, !1118, !1119, !1120, !1121, !1131, !1133, !1135, !1136, !1138, !1139}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1114, file: !4, line: 3886, baseType: !913, size: 32, align: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1114, file: !4, line: 3887, baseType: !913, size: 32, align: 32, offset: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1114, file: !4, line: 3888, baseType: !913, size: 32, align: 32, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1114, file: !4, line: 3889, baseType: !913, size: 32, align: 32, offset: 96)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1114, file: !4, line: 3890, baseType: !913, size: 32, align: 32, offset: 128)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1114, file: !4, line: 3897, baseType: !1122, size: 768, align: 64, offset: 192)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1123)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1124)
!1124 = !{!1125, !1129}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1123, file: !4, line: 3855, baseType: !1126, size: 512, align: 64)
!1126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1099, size: 512, align: 64, elements: !1127)
!1127 = !{!1128}
!1128 = !DISubrange(count: 8)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1123, file: !4, line: 3857, baseType: !1130, size: 256, align: 32, offset: 512)
!1130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !913, size: 256, align: 32, elements: !1127)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1114, file: !4, line: 3903, baseType: !1132, size: 256, align: 64, offset: 960)
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1099, size: 256, align: 64, elements: !942)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1114, file: !4, line: 3904, baseType: !1134, size: 128, align: 32, offset: 1216)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !913, size: 128, align: 32, elements: !942)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1114, file: !4, line: 3906, baseType: !725, size: 32, align: 32, offset: 1344)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1114, file: !4, line: 3908, baseType: !1137, size: 64, align: 64, offset: 1408)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1114, file: !4, line: 3915, baseType: !1137, size: 64, align: 64, offset: 1472)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1114, file: !4, line: 3917, baseType: !913, size: 32, align: 32, offset: 1536)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1102, file: !4, line: 3926, baseType: !894, size: 64, align: 64, offset: 192)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1023, file: !4, line: 3564, baseType: !1142, size: 64, align: 64, offset: 1344)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!913, !970, !1145, !1179, !1261}
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1147)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1148)
!1148 = !{!1149, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1175, !1176, !1177, !1178}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1147, file: !4, line: 1451, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1152, line: 94, baseType: !1153)
!1152 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1152, line: 81, size: 192, align: 64, elements: !1154)
!1154 = !{!1155, !1159, !1160}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1153, file: !1152, line: 82, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1152, line: 73, baseType: !1158)
!1158 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1152, line: 73, flags: DIFlagFwdDecl)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1153, file: !1152, line: 89, baseType: !1099, size: 64, align: 64, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1153, file: !1152, line: 93, baseType: !913, size: 32, align: 32, offset: 128)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1147, file: !4, line: 1461, baseType: !894, size: 64, align: 64, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1147, file: !4, line: 1467, baseType: !894, size: 64, align: 64, offset: 128)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1147, file: !4, line: 1468, baseType: !1099, size: 64, align: 64, offset: 192)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1147, file: !4, line: 1469, baseType: !913, size: 32, align: 32, offset: 256)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1147, file: !4, line: 1470, baseType: !913, size: 32, align: 32, offset: 288)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1147, file: !4, line: 1474, baseType: !913, size: 32, align: 32, offset: 320)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1147, file: !4, line: 1479, baseType: !1168, size: 64, align: 64, offset: 384)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1170)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1171)
!1171 = !{!1172, !1173, !1174}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1170, file: !4, line: 1412, baseType: !1099, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1170, file: !4, line: 1413, baseType: !913, size: 32, align: 32, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1170, file: !4, line: 1414, baseType: !731, size: 32, align: 32, offset: 96)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1147, file: !4, line: 1480, baseType: !913, size: 32, align: 32, offset: 448)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1147, file: !4, line: 1486, baseType: !894, size: 64, align: 64, offset: 512)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1147, file: !4, line: 1488, baseType: !894, size: 64, align: 64, offset: 576)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1147, file: !4, line: 1497, baseType: !894, size: 64, align: 64, offset: 640)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1181)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !772, line: 646, baseType: !1182)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !772, line: 268, size: 4288, align: 64, elements: !1183)
!1183 = !{!1184, !1185, !1186, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1213, !1215, !1216, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1249, !1250, !1251, !1252, !1253, !1254, !1257, !1258, !1259, !1260}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1182, file: !772, line: 282, baseType: !1126, size: 512, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1182, file: !772, line: 299, baseType: !1130, size: 256, align: 32, offset: 512)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1182, file: !772, line: 315, baseType: !1187, size: 64, align: 64, offset: 768)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1182, file: !772, line: 326, baseType: !913, size: 32, align: 32, offset: 832)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1182, file: !772, line: 326, baseType: !913, size: 32, align: 32, offset: 864)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1182, file: !772, line: 334, baseType: !913, size: 32, align: 32, offset: 896)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1182, file: !772, line: 341, baseType: !913, size: 32, align: 32, offset: 928)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1182, file: !772, line: 346, baseType: !913, size: 32, align: 32, offset: 960)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1182, file: !772, line: 351, baseType: !761, size: 32, align: 32, offset: 992)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1182, file: !772, line: 356, baseType: !1033, size: 64, align: 32, offset: 1024)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1182, file: !772, line: 361, baseType: !894, size: 64, align: 64, offset: 1088)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1182, file: !772, line: 369, baseType: !894, size: 64, align: 64, offset: 1152)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1182, file: !772, line: 377, baseType: !894, size: 64, align: 64, offset: 1216)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1182, file: !772, line: 382, baseType: !913, size: 32, align: 32, offset: 1280)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1182, file: !772, line: 386, baseType: !913, size: 32, align: 32, offset: 1312)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1182, file: !772, line: 391, baseType: !913, size: 32, align: 32, offset: 1344)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1182, file: !772, line: 396, baseType: !926, size: 64, align: 64, offset: 1408)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1182, file: !772, line: 403, baseType: !1203, size: 512, align: 64, offset: 1472)
!1203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1051, size: 512, align: 64, elements: !1127)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1182, file: !772, line: 410, baseType: !913, size: 32, align: 32, offset: 1984)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1182, file: !772, line: 415, baseType: !913, size: 32, align: 32, offset: 2016)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1182, file: !772, line: 420, baseType: !913, size: 32, align: 32, offset: 2048)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1182, file: !772, line: 425, baseType: !913, size: 32, align: 32, offset: 2080)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1182, file: !772, line: 435, baseType: !894, size: 64, align: 64, offset: 2112)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1182, file: !772, line: 440, baseType: !913, size: 32, align: 32, offset: 2176)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1182, file: !772, line: 445, baseType: !1051, size: 64, align: 64, offset: 2240)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1182, file: !772, line: 459, baseType: !1212, size: 512, align: 64, offset: 2304)
!1212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1150, size: 512, align: 64, elements: !1127)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1182, file: !772, line: 473, baseType: !1214, size: 64, align: 64, offset: 2816)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1182, file: !772, line: 477, baseType: !913, size: 32, align: 32, offset: 2880)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1182, file: !772, line: 479, baseType: !1217, size: 64, align: 64, offset: 2944)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !772, line: 207, baseType: !1220)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !772, line: 201, size: 320, align: 64, elements: !1221)
!1221 = !{!1222, !1223, !1224, !1225, !1230}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1220, file: !772, line: 202, baseType: !771, size: 32, align: 32)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1220, file: !772, line: 203, baseType: !1099, size: 64, align: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1220, file: !772, line: 204, baseType: !913, size: 32, align: 32, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1220, file: !772, line: 205, baseType: !1226, size: 64, align: 64, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1228, line: 86, baseType: !1229)
!1228 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1229 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1228, line: 86, flags: DIFlagFwdDecl)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1220, file: !772, line: 206, baseType: !1150, size: 64, align: 64, offset: 256)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1182, file: !772, line: 480, baseType: !913, size: 32, align: 32, offset: 3008)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1182, file: !772, line: 505, baseType: !913, size: 32, align: 32, offset: 3040)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1182, file: !772, line: 512, baseType: !795, size: 32, align: 32, offset: 3072)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1182, file: !772, line: 514, baseType: !801, size: 32, align: 32, offset: 3104)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1182, file: !772, line: 516, baseType: !819, size: 32, align: 32, offset: 3136)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1182, file: !772, line: 523, baseType: !843, size: 32, align: 32, offset: 3168)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1182, file: !772, line: 525, baseType: !862, size: 32, align: 32, offset: 3200)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1182, file: !772, line: 532, baseType: !894, size: 64, align: 64, offset: 3264)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1182, file: !772, line: 539, baseType: !894, size: 64, align: 64, offset: 3328)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1182, file: !772, line: 547, baseType: !894, size: 64, align: 64, offset: 3392)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1182, file: !772, line: 554, baseType: !1226, size: 64, align: 64, offset: 3456)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1182, file: !772, line: 563, baseType: !913, size: 32, align: 32, offset: 3520)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1182, file: !772, line: 572, baseType: !913, size: 32, align: 32, offset: 3552)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1182, file: !772, line: 581, baseType: !913, size: 32, align: 32, offset: 3584)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1182, file: !772, line: 588, baseType: !1246, size: 64, align: 64, offset: 3648)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !895, line: 36, baseType: !1248)
!1248 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1182, file: !772, line: 593, baseType: !913, size: 32, align: 32, offset: 3712)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1182, file: !772, line: 596, baseType: !913, size: 32, align: 32, offset: 3744)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1182, file: !772, line: 599, baseType: !1150, size: 64, align: 64, offset: 3776)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1182, file: !772, line: 605, baseType: !1150, size: 64, align: 64, offset: 3840)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1182, file: !772, line: 616, baseType: !1150, size: 64, align: 64, offset: 3904)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1182, file: !772, line: 626, baseType: !1255, size: 64, align: 64, offset: 3968)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1256, line: 216, baseType: !1052)
!1256 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1182, file: !772, line: 627, baseType: !1255, size: 64, align: 64, offset: 4032)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1182, file: !772, line: 628, baseType: !1255, size: 64, align: 64, offset: 4096)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1182, file: !772, line: 629, baseType: !1255, size: 64, align: 64, offset: 4160)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1182, file: !772, line: 645, baseType: !1150, size: 64, align: 64, offset: 4224)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1023, file: !4, line: 3566, baseType: !1263, size: 64, align: 64, offset: 1408)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!913, !970, !926, !1261, !1145}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1023, file: !4, line: 3567, baseType: !1070, size: 64, align: 64, offset: 1472)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1023, file: !4, line: 3576, baseType: !1268, size: 64, align: 64, offset: 1536)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!913, !970, !1179}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1023, file: !4, line: 3577, baseType: !1272, size: 64, align: 64, offset: 1600)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{!913, !970, !1145}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1023, file: !4, line: 3584, baseType: !1276, size: 64, align: 64, offset: 1664)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{!913, !970, !1279}
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1023, file: !4, line: 3589, baseType: !1281, size: 64, align: 64, offset: 1728)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{null, !970}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1023, file: !4, line: 3594, baseType: !913, size: 32, align: 32, offset: 1792)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1023, file: !4, line: 3600, baseType: !981, size: 64, align: 64, offset: 1856)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1023, file: !4, line: 3609, baseType: !1287, size: 64, align: 64, offset: 1920)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1290)
!1290 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !972, file: !4, line: 1566, baseType: !49, size: 32, align: 32, offset: 192)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !972, file: !4, line: 1581, baseType: !1107, size: 32, align: 32, offset: 224)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !972, file: !4, line: 1583, baseType: !926, size: 64, align: 64, offset: 256)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !972, file: !4, line: 1591, baseType: !1295, size: 64, align: 64, offset: 320)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1084, line: 129, size: 1664, align: 64, elements: !1297)
!1297 = !{!1298, !1299, !1300, !1301, !1302, !1320, !1321, !1327, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1296, file: !1084, line: 136, baseType: !913, size: 32, align: 32)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1296, file: !1084, line: 151, baseType: !913, size: 32, align: 32, offset: 32)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1296, file: !1084, line: 157, baseType: !913, size: 32, align: 32, offset: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1296, file: !1084, line: 159, baseType: !1279, size: 64, align: 64, offset: 128)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1296, file: !1084, line: 161, baseType: !1303, size: 64, align: 64, offset: 192)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1084, line: 117, baseType: !1305)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1084, line: 100, size: 832, align: 64, elements: !1306)
!1306 = !{!1307, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1305, file: !1084, line: 105, baseType: !1308, size: 256, align: 64)
!1308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1309, size: 256, align: 64, elements: !942)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1152, line: 238, baseType: !1311)
!1311 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1152, line: 238, flags: DIFlagFwdDecl)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1305, file: !1084, line: 110, baseType: !913, size: 32, align: 32, offset: 256)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1305, file: !1084, line: 111, baseType: !913, size: 32, align: 32, offset: 288)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1305, file: !1084, line: 111, baseType: !913, size: 32, align: 32, offset: 320)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1305, file: !1084, line: 112, baseType: !1130, size: 256, align: 32, offset: 352)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1305, file: !1084, line: 113, baseType: !1134, size: 128, align: 32, offset: 608)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1305, file: !1084, line: 114, baseType: !913, size: 32, align: 32, offset: 736)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1305, file: !1084, line: 115, baseType: !913, size: 32, align: 32, offset: 768)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1305, file: !1084, line: 116, baseType: !913, size: 32, align: 32, offset: 800)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1296, file: !1084, line: 163, baseType: !926, size: 64, align: 64, offset: 256)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1296, file: !1084, line: 165, baseType: !1322, size: 128, align: 64, offset: 320)
!1322 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1084, line: 122, baseType: !1323)
!1323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1084, line: 119, size: 128, align: 64, elements: !1324)
!1324 = !{!1325, !1326}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1323, file: !1084, line: 120, baseType: !1145, size: 64, align: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1323, file: !1084, line: 121, baseType: !1279, size: 64, align: 64, offset: 64)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1296, file: !1084, line: 166, baseType: !1328, size: 128, align: 64, offset: 448)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1084, line: 127, baseType: !1329)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1084, line: 124, size: 128, align: 64, elements: !1330)
!1330 = !{!1331, !1404}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1329, file: !1084, line: 125, baseType: !1332, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !1335)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !1336)
!1336 = !{!1337, !1338, !1362, !1366, !1367, !1401, !1402, !1403}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1335, file: !4, line: 5751, baseType: !975, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1335, file: !4, line: 5756, baseType: !1339, size: 64, align: 64, offset: 64)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1341)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !1342)
!1342 = !{!1343, !1344, !1347, !1348, !1349, !1353, !1357, !1361}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1341, file: !4, line: 5797, baseType: !981, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1341, file: !4, line: 5804, baseType: !1345, size: 64, align: 64, offset: 64)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1341, file: !4, line: 5815, baseType: !975, size: 64, align: 64, offset: 128)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1341, file: !4, line: 5825, baseType: !913, size: 32, align: 32, offset: 192)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1341, file: !4, line: 5826, baseType: !1350, size: 64, align: 64, offset: 256)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DISubroutineType(types: !1352)
!1352 = !{!913, !1333}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1341, file: !4, line: 5827, baseType: !1354, size: 64, align: 64, offset: 320)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = !DISubroutineType(types: !1356)
!1356 = !{!913, !1333, !1145}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1341, file: !4, line: 5828, baseType: !1358, size: 64, align: 64, offset: 384)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DISubroutineType(types: !1360)
!1360 = !{null, !1333}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1341, file: !4, line: 5829, baseType: !1358, size: 64, align: 64, offset: 448)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1335, file: !4, line: 5762, baseType: !1363, size: 64, align: 64, offset: 128)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !1365)
!1365 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1335, file: !4, line: 5768, baseType: !926, size: 64, align: 64, offset: 192)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1335, file: !4, line: 5775, baseType: !1368, size: 64, align: 64, offset: 256)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !1370)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !1371)
!1371 = !{!1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1370, file: !4, line: 3940, baseType: !39, size: 32, align: 32)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1370, file: !4, line: 3944, baseType: !49, size: 32, align: 32, offset: 32)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1370, file: !4, line: 3948, baseType: !1106, size: 32, align: 32, offset: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1370, file: !4, line: 3958, baseType: !1099, size: 64, align: 64, offset: 128)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1370, file: !4, line: 3962, baseType: !913, size: 32, align: 32, offset: 192)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1370, file: !4, line: 3968, baseType: !913, size: 32, align: 32, offset: 224)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1370, file: !4, line: 3973, baseType: !894, size: 64, align: 64, offset: 256)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1370, file: !4, line: 3986, baseType: !913, size: 32, align: 32, offset: 320)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1370, file: !4, line: 3999, baseType: !913, size: 32, align: 32, offset: 352)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1370, file: !4, line: 4004, baseType: !913, size: 32, align: 32, offset: 384)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1370, file: !4, line: 4005, baseType: !913, size: 32, align: 32, offset: 416)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1370, file: !4, line: 4010, baseType: !913, size: 32, align: 32, offset: 448)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1370, file: !4, line: 4011, baseType: !913, size: 32, align: 32, offset: 480)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1370, file: !4, line: 4020, baseType: !1033, size: 64, align: 32, offset: 512)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1370, file: !4, line: 4025, baseType: !3, size: 32, align: 32, offset: 576)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1370, file: !4, line: 4030, baseType: !795, size: 32, align: 32, offset: 608)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1370, file: !4, line: 4031, baseType: !801, size: 32, align: 32, offset: 640)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1370, file: !4, line: 4032, baseType: !819, size: 32, align: 32, offset: 672)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1370, file: !4, line: 4033, baseType: !843, size: 32, align: 32, offset: 704)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1370, file: !4, line: 4034, baseType: !862, size: 32, align: 32, offset: 736)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1370, file: !4, line: 4039, baseType: !913, size: 32, align: 32, offset: 768)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1370, file: !4, line: 4046, baseType: !1051, size: 64, align: 64, offset: 832)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1370, file: !4, line: 4050, baseType: !913, size: 32, align: 32, offset: 896)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1370, file: !4, line: 4054, baseType: !913, size: 32, align: 32, offset: 928)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1370, file: !4, line: 4061, baseType: !913, size: 32, align: 32, offset: 960)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1370, file: !4, line: 4065, baseType: !913, size: 32, align: 32, offset: 992)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1370, file: !4, line: 4073, baseType: !913, size: 32, align: 32, offset: 1024)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1370, file: !4, line: 4080, baseType: !913, size: 32, align: 32, offset: 1056)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1370, file: !4, line: 4084, baseType: !913, size: 32, align: 32, offset: 1088)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1335, file: !4, line: 5781, baseType: !1368, size: 64, align: 64, offset: 320)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1335, file: !4, line: 5787, baseType: !1033, size: 64, align: 32, offset: 384)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1335, file: !4, line: 5793, baseType: !1033, size: 64, align: 32, offset: 448)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1329, file: !1084, line: 126, baseType: !913, size: 32, align: 32, offset: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1296, file: !1084, line: 172, baseType: !1145, size: 64, align: 64, offset: 576)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1296, file: !1084, line: 177, baseType: !1099, size: 64, align: 64, offset: 640)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1296, file: !1084, line: 178, baseType: !1107, size: 32, align: 32, offset: 704)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1296, file: !1084, line: 180, baseType: !926, size: 64, align: 64, offset: 768)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1296, file: !1084, line: 185, baseType: !913, size: 32, align: 32, offset: 832)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1296, file: !1084, line: 190, baseType: !926, size: 64, align: 64, offset: 896)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1296, file: !1084, line: 195, baseType: !913, size: 32, align: 32, offset: 960)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1296, file: !1084, line: 200, baseType: !1145, size: 64, align: 64, offset: 1024)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1296, file: !1084, line: 201, baseType: !913, size: 32, align: 32, offset: 1088)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1296, file: !1084, line: 202, baseType: !1279, size: 64, align: 64, offset: 1152)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1296, file: !1084, line: 203, baseType: !913, size: 32, align: 32, offset: 1216)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1296, file: !1084, line: 205, baseType: !913, size: 32, align: 32, offset: 1248)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1296, file: !1084, line: 206, baseType: !913, size: 32, align: 32, offset: 1280)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1296, file: !1084, line: 209, baseType: !1255, size: 64, align: 64, offset: 1344)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1296, file: !1084, line: 212, baseType: !1255, size: 64, align: 64, offset: 1408)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1296, file: !1084, line: 213, baseType: !1279, size: 64, align: 64, offset: 1472)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1296, file: !1084, line: 215, baseType: !913, size: 32, align: 32, offset: 1536)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1296, file: !1084, line: 217, baseType: !913, size: 32, align: 32, offset: 1568)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1296, file: !1084, line: 220, baseType: !913, size: 32, align: 32, offset: 1600)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !972, file: !4, line: 1598, baseType: !926, size: 64, align: 64, offset: 384)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !972, file: !4, line: 1606, baseType: !894, size: 64, align: 64, offset: 448)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !972, file: !4, line: 1614, baseType: !913, size: 32, align: 32, offset: 512)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !972, file: !4, line: 1622, baseType: !913, size: 32, align: 32, offset: 544)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !972, file: !4, line: 1628, baseType: !913, size: 32, align: 32, offset: 576)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !972, file: !4, line: 1636, baseType: !913, size: 32, align: 32, offset: 608)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !972, file: !4, line: 1643, baseType: !913, size: 32, align: 32, offset: 640)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !972, file: !4, line: 1657, baseType: !1099, size: 64, align: 64, offset: 704)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !972, file: !4, line: 1658, baseType: !913, size: 32, align: 32, offset: 768)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !972, file: !4, line: 1679, baseType: !1033, size: 64, align: 32, offset: 800)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !972, file: !4, line: 1688, baseType: !913, size: 32, align: 32, offset: 864)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !972, file: !4, line: 1712, baseType: !913, size: 32, align: 32, offset: 896)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !972, file: !4, line: 1729, baseType: !913, size: 32, align: 32, offset: 928)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !972, file: !4, line: 1729, baseType: !913, size: 32, align: 32, offset: 960)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !972, file: !4, line: 1744, baseType: !913, size: 32, align: 32, offset: 992)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !972, file: !4, line: 1744, baseType: !913, size: 32, align: 32, offset: 1024)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !972, file: !4, line: 1751, baseType: !913, size: 32, align: 32, offset: 1056)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !972, file: !4, line: 1766, baseType: !508, size: 32, align: 32, offset: 1088)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !972, file: !4, line: 1791, baseType: !1443, size: 64, align: 64, offset: 1152)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DISubroutineType(types: !1445)
!1445 = !{null, !1446, !1179, !1261, !913, !913, !913}
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !972, file: !4, line: 1808, baseType: !1448, size: 64, align: 64, offset: 1216)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{!508, !1446, !1040}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !972, file: !4, line: 1816, baseType: !913, size: 32, align: 32, offset: 1280)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !972, file: !4, line: 1825, baseType: !1453, size: 32, align: 32, offset: 1312)
!1453 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !972, file: !4, line: 1830, baseType: !913, size: 32, align: 32, offset: 1344)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !972, file: !4, line: 1838, baseType: !1453, size: 32, align: 32, offset: 1376)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !972, file: !4, line: 1846, baseType: !913, size: 32, align: 32, offset: 1408)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !972, file: !4, line: 1851, baseType: !913, size: 32, align: 32, offset: 1440)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !972, file: !4, line: 1861, baseType: !1453, size: 32, align: 32, offset: 1472)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !972, file: !4, line: 1868, baseType: !1453, size: 32, align: 32, offset: 1504)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !972, file: !4, line: 1875, baseType: !1453, size: 32, align: 32, offset: 1536)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !972, file: !4, line: 1882, baseType: !1453, size: 32, align: 32, offset: 1568)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !972, file: !4, line: 1889, baseType: !1453, size: 32, align: 32, offset: 1600)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !972, file: !4, line: 1896, baseType: !1453, size: 32, align: 32, offset: 1632)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !972, file: !4, line: 1903, baseType: !1453, size: 32, align: 32, offset: 1664)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !972, file: !4, line: 1910, baseType: !913, size: 32, align: 32, offset: 1696)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !972, file: !4, line: 1915, baseType: !913, size: 32, align: 32, offset: 1728)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !972, file: !4, line: 1926, baseType: !1261, size: 64, align: 64, offset: 1792)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !972, file: !4, line: 1935, baseType: !1033, size: 64, align: 32, offset: 1856)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !972, file: !4, line: 1942, baseType: !913, size: 32, align: 32, offset: 1920)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !972, file: !4, line: 1948, baseType: !913, size: 32, align: 32, offset: 1952)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !972, file: !4, line: 1954, baseType: !913, size: 32, align: 32, offset: 1984)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !972, file: !4, line: 1960, baseType: !913, size: 32, align: 32, offset: 2016)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !972, file: !4, line: 1984, baseType: !913, size: 32, align: 32, offset: 2048)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !972, file: !4, line: 1991, baseType: !913, size: 32, align: 32, offset: 2080)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !972, file: !4, line: 1996, baseType: !913, size: 32, align: 32, offset: 2112)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !972, file: !4, line: 2004, baseType: !913, size: 32, align: 32, offset: 2144)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !972, file: !4, line: 2011, baseType: !913, size: 32, align: 32, offset: 2176)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !972, file: !4, line: 2018, baseType: !913, size: 32, align: 32, offset: 2208)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !972, file: !4, line: 2027, baseType: !913, size: 32, align: 32, offset: 2240)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !972, file: !4, line: 2034, baseType: !913, size: 32, align: 32, offset: 2272)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !972, file: !4, line: 2044, baseType: !913, size: 32, align: 32, offset: 2304)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !972, file: !4, line: 2054, baseType: !1483, size: 64, align: 64, offset: 2368)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64, align: 64)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !972, file: !4, line: 2061, baseType: !1483, size: 64, align: 64, offset: 2432)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !972, file: !4, line: 2066, baseType: !913, size: 32, align: 32, offset: 2496)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !972, file: !4, line: 2070, baseType: !913, size: 32, align: 32, offset: 2528)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !972, file: !4, line: 2078, baseType: !913, size: 32, align: 32, offset: 2560)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !972, file: !4, line: 2085, baseType: !913, size: 32, align: 32, offset: 2592)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !972, file: !4, line: 2092, baseType: !913, size: 32, align: 32, offset: 2624)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !972, file: !4, line: 2099, baseType: !913, size: 32, align: 32, offset: 2656)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !972, file: !4, line: 2106, baseType: !913, size: 32, align: 32, offset: 2688)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !972, file: !4, line: 2113, baseType: !913, size: 32, align: 32, offset: 2720)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !972, file: !4, line: 2120, baseType: !913, size: 32, align: 32, offset: 2752)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !972, file: !4, line: 2125, baseType: !913, size: 32, align: 32, offset: 2784)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !972, file: !4, line: 2133, baseType: !913, size: 32, align: 32, offset: 2816)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !972, file: !4, line: 2140, baseType: !913, size: 32, align: 32, offset: 2848)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !972, file: !4, line: 2145, baseType: !913, size: 32, align: 32, offset: 2880)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !972, file: !4, line: 2153, baseType: !913, size: 32, align: 32, offset: 2912)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !972, file: !4, line: 2158, baseType: !913, size: 32, align: 32, offset: 2944)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !972, file: !4, line: 2166, baseType: !801, size: 32, align: 32, offset: 2976)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !972, file: !4, line: 2173, baseType: !819, size: 32, align: 32, offset: 3008)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !972, file: !4, line: 2180, baseType: !843, size: 32, align: 32, offset: 3040)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !972, file: !4, line: 2187, baseType: !795, size: 32, align: 32, offset: 3072)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !972, file: !4, line: 2194, baseType: !862, size: 32, align: 32, offset: 3104)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !972, file: !4, line: 2203, baseType: !913, size: 32, align: 32, offset: 3136)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !972, file: !4, line: 2209, baseType: !3, size: 32, align: 32, offset: 3168)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !972, file: !4, line: 2212, baseType: !913, size: 32, align: 32, offset: 3200)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !972, file: !4, line: 2213, baseType: !913, size: 32, align: 32, offset: 3232)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !972, file: !4, line: 2220, baseType: !708, size: 32, align: 32, offset: 3264)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !972, file: !4, line: 2232, baseType: !913, size: 32, align: 32, offset: 3296)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !972, file: !4, line: 2243, baseType: !913, size: 32, align: 32, offset: 3328)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !972, file: !4, line: 2249, baseType: !913, size: 32, align: 32, offset: 3360)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !972, file: !4, line: 2256, baseType: !913, size: 32, align: 32, offset: 3392)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !972, file: !4, line: 2263, baseType: !1051, size: 64, align: 64, offset: 3456)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !972, file: !4, line: 2270, baseType: !1051, size: 64, align: 64, offset: 3520)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !972, file: !4, line: 2277, baseType: !872, size: 32, align: 32, offset: 3584)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !972, file: !4, line: 2285, baseType: !708, size: 32, align: 32, offset: 3616)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !972, file: !4, line: 2367, baseType: !1519, size: 64, align: 64, offset: 3648)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DISubroutineType(types: !1521)
!1521 = !{!913, !1446, !1279, !913}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !972, file: !4, line: 2383, baseType: !913, size: 32, align: 32, offset: 3712)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !972, file: !4, line: 2386, baseType: !1453, size: 32, align: 32, offset: 3744)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !972, file: !4, line: 2387, baseType: !1453, size: 32, align: 32, offset: 3776)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !972, file: !4, line: 2394, baseType: !913, size: 32, align: 32, offset: 3808)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !972, file: !4, line: 2401, baseType: !913, size: 32, align: 32, offset: 3840)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !972, file: !4, line: 2408, baseType: !913, size: 32, align: 32, offset: 3872)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !972, file: !4, line: 2415, baseType: !913, size: 32, align: 32, offset: 3904)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !972, file: !4, line: 2422, baseType: !913, size: 32, align: 32, offset: 3936)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !972, file: !4, line: 2423, baseType: !1531, size: 64, align: 64, offset: 3968)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1533)
!1533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1534)
!1534 = !{!1535, !1536, !1537, !1538}
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1533, file: !4, line: 827, baseType: !913, size: 32, align: 32)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1533, file: !4, line: 828, baseType: !913, size: 32, align: 32, offset: 32)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1533, file: !4, line: 829, baseType: !913, size: 32, align: 32, offset: 64)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1533, file: !4, line: 830, baseType: !1453, size: 32, align: 32, offset: 96)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !972, file: !4, line: 2430, baseType: !894, size: 64, align: 64, offset: 4032)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !972, file: !4, line: 2437, baseType: !894, size: 64, align: 64, offset: 4096)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !972, file: !4, line: 2444, baseType: !1453, size: 32, align: 32, offset: 4160)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !972, file: !4, line: 2451, baseType: !1453, size: 32, align: 32, offset: 4192)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !972, file: !4, line: 2458, baseType: !913, size: 32, align: 32, offset: 4224)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !972, file: !4, line: 2469, baseType: !913, size: 32, align: 32, offset: 4256)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !972, file: !4, line: 2475, baseType: !913, size: 32, align: 32, offset: 4288)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !972, file: !4, line: 2481, baseType: !913, size: 32, align: 32, offset: 4320)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !972, file: !4, line: 2485, baseType: !913, size: 32, align: 32, offset: 4352)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !972, file: !4, line: 2489, baseType: !913, size: 32, align: 32, offset: 4384)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !972, file: !4, line: 2493, baseType: !913, size: 32, align: 32, offset: 4416)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !972, file: !4, line: 2501, baseType: !913, size: 32, align: 32, offset: 4448)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !972, file: !4, line: 2506, baseType: !913, size: 32, align: 32, offset: 4480)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !972, file: !4, line: 2510, baseType: !913, size: 32, align: 32, offset: 4512)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !972, file: !4, line: 2514, baseType: !894, size: 64, align: 64, offset: 4544)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !972, file: !4, line: 2528, baseType: !1555, size: 64, align: 64, offset: 4608)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1556 = !DISubroutineType(types: !1557)
!1557 = !{null, !1446, !926, !913, !913}
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !972, file: !4, line: 2534, baseType: !913, size: 32, align: 32, offset: 4672)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !972, file: !4, line: 2545, baseType: !913, size: 32, align: 32, offset: 4704)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !972, file: !4, line: 2547, baseType: !913, size: 32, align: 32, offset: 4736)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !972, file: !4, line: 2549, baseType: !913, size: 32, align: 32, offset: 4768)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !972, file: !4, line: 2551, baseType: !913, size: 32, align: 32, offset: 4800)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !972, file: !4, line: 2553, baseType: !913, size: 32, align: 32, offset: 4832)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !972, file: !4, line: 2555, baseType: !913, size: 32, align: 32, offset: 4864)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !972, file: !4, line: 2557, baseType: !913, size: 32, align: 32, offset: 4896)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !972, file: !4, line: 2559, baseType: !913, size: 32, align: 32, offset: 4928)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !972, file: !4, line: 2563, baseType: !913, size: 32, align: 32, offset: 4960)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !972, file: !4, line: 2571, baseType: !1137, size: 64, align: 64, offset: 4992)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !972, file: !4, line: 2579, baseType: !1137, size: 64, align: 64, offset: 5056)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !972, file: !4, line: 2586, baseType: !913, size: 32, align: 32, offset: 5120)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !972, file: !4, line: 2615, baseType: !913, size: 32, align: 32, offset: 5152)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !972, file: !4, line: 2627, baseType: !913, size: 32, align: 32, offset: 5184)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !972, file: !4, line: 2637, baseType: !913, size: 32, align: 32, offset: 5216)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !972, file: !4, line: 2681, baseType: !913, size: 32, align: 32, offset: 5248)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !972, file: !4, line: 2709, baseType: !894, size: 64, align: 64, offset: 5312)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !972, file: !4, line: 2716, baseType: !1577, size: 64, align: 64, offset: 5376)
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64, align: 64)
!1578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1579)
!1579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1580)
!1580 = !{!1581, !1582, !1583, !1584, !1585, !1586, !1587, !1591, !1595, !1596, !1597, !1598, !1604, !1605, !1606, !1607, !1608}
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1579, file: !4, line: 3642, baseType: !981, size: 64, align: 64)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1579, file: !4, line: 3649, baseType: !39, size: 32, align: 32, offset: 64)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1579, file: !4, line: 3656, baseType: !49, size: 32, align: 32, offset: 96)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1579, file: !4, line: 3663, baseType: !508, size: 32, align: 32, offset: 128)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1579, file: !4, line: 3669, baseType: !913, size: 32, align: 32, offset: 160)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1579, file: !4, line: 3682, baseType: !1276, size: 64, align: 64, offset: 192)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1579, file: !4, line: 3698, baseType: !1588, size: 64, align: 64, offset: 256)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DISubroutineType(types: !1590)
!1590 = !{!913, !970, !1087, !1106}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1579, file: !4, line: 3712, baseType: !1592, size: 64, align: 64, offset: 320)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DISubroutineType(types: !1594)
!1594 = !{!913, !970, !913, !1087, !1106}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1579, file: !4, line: 3726, baseType: !1588, size: 64, align: 64, offset: 384)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1579, file: !4, line: 3737, baseType: !1070, size: 64, align: 64, offset: 448)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1579, file: !4, line: 3746, baseType: !913, size: 32, align: 32, offset: 512)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1579, file: !4, line: 3757, baseType: !1599, size: 64, align: 64, offset: 576)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = !DISubroutineType(types: !1601)
!1601 = !{null, !1602}
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64, align: 64)
!1603 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1579, file: !4, line: 3766, baseType: !1070, size: 64, align: 64, offset: 640)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1579, file: !4, line: 3774, baseType: !1070, size: 64, align: 64, offset: 704)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1579, file: !4, line: 3780, baseType: !913, size: 32, align: 32, offset: 768)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1579, file: !4, line: 3785, baseType: !913, size: 32, align: 32, offset: 800)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1579, file: !4, line: 3795, baseType: !1609, size: 64, align: 64, offset: 832)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DISubroutineType(types: !1611)
!1611 = !{!913, !970, !1150}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !972, file: !4, line: 2728, baseType: !926, size: 64, align: 64, offset: 5440)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !972, file: !4, line: 2735, baseType: !1203, size: 512, align: 64, offset: 5504)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !972, file: !4, line: 2742, baseType: !913, size: 32, align: 32, offset: 6016)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !972, file: !4, line: 2755, baseType: !913, size: 32, align: 32, offset: 6048)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !972, file: !4, line: 2776, baseType: !913, size: 32, align: 32, offset: 6080)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !972, file: !4, line: 2783, baseType: !913, size: 32, align: 32, offset: 6112)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !972, file: !4, line: 2791, baseType: !913, size: 32, align: 32, offset: 6144)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !972, file: !4, line: 2802, baseType: !1279, size: 64, align: 64, offset: 6208)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !972, file: !4, line: 2811, baseType: !913, size: 32, align: 32, offset: 6272)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !972, file: !4, line: 2821, baseType: !913, size: 32, align: 32, offset: 6304)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !972, file: !4, line: 2830, baseType: !913, size: 32, align: 32, offset: 6336)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !972, file: !4, line: 2840, baseType: !913, size: 32, align: 32, offset: 6368)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !972, file: !4, line: 2851, baseType: !1625, size: 64, align: 64, offset: 6400)
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64, align: 64)
!1626 = !DISubroutineType(types: !1627)
!1627 = !{!913, !1446, !1628, !926, !1261, !913, !913}
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64, align: 64)
!1629 = !DISubroutineType(types: !1630)
!1630 = !{!913, !1446, !926}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !972, file: !4, line: 2871, baseType: !1632, size: 64, align: 64, offset: 6464)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64, align: 64)
!1633 = !DISubroutineType(types: !1634)
!1634 = !{!913, !1446, !1635, !926, !1261, !913}
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DISubroutineType(types: !1637)
!1637 = !{!913, !1446, !926, !913, !913}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !972, file: !4, line: 2878, baseType: !913, size: 32, align: 32, offset: 6528)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !972, file: !4, line: 2885, baseType: !913, size: 32, align: 32, offset: 6560)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !972, file: !4, line: 3005, baseType: !913, size: 32, align: 32, offset: 6592)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !972, file: !4, line: 3013, baseType: !884, size: 32, align: 32, offset: 6624)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !972, file: !4, line: 3020, baseType: !884, size: 32, align: 32, offset: 6656)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !972, file: !4, line: 3027, baseType: !884, size: 32, align: 32, offset: 6688)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !972, file: !4, line: 3037, baseType: !1099, size: 64, align: 64, offset: 6720)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !972, file: !4, line: 3038, baseType: !913, size: 32, align: 32, offset: 6784)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !972, file: !4, line: 3050, baseType: !1051, size: 64, align: 64, offset: 6848)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !972, file: !4, line: 3065, baseType: !913, size: 32, align: 32, offset: 6912)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !972, file: !4, line: 3083, baseType: !913, size: 32, align: 32, offset: 6944)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !972, file: !4, line: 3092, baseType: !1033, size: 64, align: 32, offset: 6976)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !972, file: !4, line: 3099, baseType: !508, size: 32, align: 32, offset: 7040)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !972, file: !4, line: 3106, baseType: !1033, size: 64, align: 32, offset: 7072)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !972, file: !4, line: 3113, baseType: !1653, size: 64, align: 64, offset: 7168)
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64, align: 64)
!1654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1655)
!1655 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1656)
!1656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1657)
!1657 = !{!1658, !1659, !1660, !1661, !1662, !1663, !1666}
