; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--huffman.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--huffman.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.HeapElem = type { i64, i32 }

!837 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!838 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!839 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!840 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!841 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!842 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!843 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!844 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!845 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!846 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!847 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!848 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !495, line: 538, size: 32, align: 32, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857}
!850 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!851 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!852 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!853 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!854 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!855 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!856 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!857 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !35, line: 1534, size: 32, align: 32, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865}
!860 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!861 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!862 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!863 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!864 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!865 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !35, line: 810, size: 32, align: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !{i32 2, !"Dwarf Version", i32 4}
!888 = !{i32 2, !"Debug Info Version", i32 3}
!889 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!890 = distinct !DISubprogram(name: "ff_huff_gen_len_table", scope: !891, file: !891, line: 58, type: !892, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !903)
!891 = !DIFile(filename: "libavcodec/huffman.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!892 = !DISubroutineType(types: !893)
!893 = !{!894, !895, !899, !894, !894}
!894 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64, align: 64)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !897, line: 48, baseType: !898)
!897 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!898 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64, align: 64)
!900 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !897, line: 55, baseType: !902)
!902 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!903 = !{}
!904 = !DILocalVariable(name: "dst", arg: 1, scope: !890, file: !891, line: 58, type: !895)
!905 = !DIExpression()
!906 = !DILocation(line: 58, column: 36, scope: !890)
!907 = !DILocalVariable(name: "stats", arg: 2, scope: !890, file: !891, line: 58, type: !899)
!908 = !DILocation(line: 58, column: 57, scope: !890)
!909 = !DILocalVariable(name: "stats_size", arg: 3, scope: !890, file: !891, line: 58, type: !894)
!910 = !DILocation(line: 58, column: 68, scope: !890)
!911 = !DILocalVariable(name: "skip0", arg: 4, scope: !890, file: !891, line: 58, type: !894)
!912 = !DILocation(line: 58, column: 84, scope: !890)
!913 = !DILocalVariable(name: "h", scope: !890, file: !891, line: 60, type: !914)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "HeapElem", file: !891, line: 42, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HeapElem", file: !891, line: 39, size: 128, align: 64, elements: !917)
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !916, file: !891, line: 40, baseType: !901, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !916, file: !891, line: 41, baseType: !894, size: 32, align: 32, offset: 64)
!920 = !DILocation(line: 60, column: 15, scope: !890)
!921 = !DILocation(line: 60, column: 47, scope: !890)
!922 = !DILocation(line: 60, column: 19, scope: !890)
!923 = !DILocalVariable(name: "up", scope: !890, file: !891, line: 61, type: !924)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64, align: 64)
!925 = !DILocation(line: 61, column: 10, scope: !890)
!926 = !DILocation(line: 61, column: 48, scope: !890)
!927 = !DILocation(line: 61, column: 15, scope: !890)
!928 = !DILocalVariable(name: "len", scope: !890, file: !891, line: 62, type: !895)
!929 = !DILocation(line: 62, column: 14, scope: !890)
!930 = !DILocation(line: 62, column: 54, scope: !890)
!931 = !DILocation(line: 62, column: 20, scope: !890)
!932 = !DILocalVariable(name: "map", scope: !890, file: !891, line: 63, type: !933)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !897, line: 49, baseType: !935)
!935 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!936 = !DILocation(line: 63, column: 15, scope: !890)
!937 = !DILocation(line: 63, column: 50, scope: !890)
!938 = !DILocation(line: 63, column: 20, scope: !890)
!939 = !DILocalVariable(name: "offset", scope: !890, file: !891, line: 64, type: !894)
!940 = !DILocation(line: 64, column: 9, scope: !890)
!941 = !DILocalVariable(name: "i", scope: !890, file: !891, line: 64, type: !894)
!942 = !DILocation(line: 64, column: 17, scope: !890)
!943 = !DILocalVariable(name: "next", scope: !890, file: !891, line: 64, type: !894)
!944 = !DILocation(line: 64, column: 20, scope: !890)
!945 = !DILocalVariable(name: "size", scope: !890, file: !891, line: 65, type: !894)
!946 = !DILocation(line: 65, column: 9, scope: !890)
!947 = !DILocalVariable(name: "ret", scope: !890, file: !891, line: 66, type: !894)
!948 = !DILocation(line: 66, column: 9, scope: !890)
!949 = !DILocation(line: 68, column: 10, scope: !950)
!950 = distinct !DILexicalBlock(scope: !890, file: !891, line: 68, column: 9)
!951 = !DILocation(line: 68, column: 12, scope: !950)
!952 = !DILocation(line: 68, column: 16, scope: !953)
!953 = !DILexicalBlockFile(scope: !950, file: !891, discriminator: 1)
!954 = !DILocation(line: 68, column: 19, scope: !953)
!955 = !DILocation(line: 68, column: 23, scope: !956)
!956 = !DILexicalBlockFile(scope: !950, file: !891, discriminator: 2)
!957 = !DILocation(line: 68, column: 27, scope: !956)
!958 = !DILocation(line: 68, column: 31, scope: !959)
!959 = !DILexicalBlockFile(scope: !950, file: !891, discriminator: 3)
!960 = !DILocation(line: 68, column: 9, scope: !959)
!961 = !DILocation(line: 69, column: 13, scope: !962)
!962 = distinct !DILexicalBlock(scope: !950, file: !891, line: 68, column: 36)
!963 = !DILocation(line: 70, column: 9, scope: !962)
!964 = !DILocation(line: 73, column: 12, scope: !965)
!965 = distinct !DILexicalBlock(scope: !890, file: !891, line: 73, column: 5)
!966 = !DILocation(line: 73, column: 10, scope: !965)
!967 = !DILocation(line: 73, column: 17, scope: !968)
!968 = !DILexicalBlockFile(scope: !969, file: !891, discriminator: 1)
!969 = distinct !DILexicalBlock(scope: !965, file: !891, line: 73, column: 5)
!970 = !DILocation(line: 73, column: 19, scope: !968)
!971 = !DILocation(line: 73, column: 18, scope: !968)
!972 = !DILocation(line: 73, column: 5, scope: !968)
!973 = !DILocation(line: 74, column: 13, scope: !974)
!974 = distinct !DILexicalBlock(scope: !969, file: !891, line: 73, column: 36)
!975 = !DILocation(line: 74, column: 9, scope: !974)
!976 = !DILocation(line: 74, column: 16, scope: !974)
!977 = !DILocation(line: 75, column: 19, scope: !978)
!978 = distinct !DILexicalBlock(scope: !974, file: !891, line: 75, column: 13)
!979 = !DILocation(line: 75, column: 13, scope: !978)
!980 = !DILocation(line: 75, column: 22, scope: !978)
!981 = !DILocation(line: 75, column: 26, scope: !982)
!982 = !DILexicalBlockFile(scope: !978, file: !891, discriminator: 1)
!983 = !DILocation(line: 75, column: 13, scope: !982)
!984 = !DILocation(line: 76, column: 27, scope: !978)
!985 = !DILocation(line: 76, column: 21, scope: !978)
!986 = !DILocation(line: 76, column: 13, scope: !978)
!987 = !DILocation(line: 76, column: 25, scope: !978)
!988 = !DILocation(line: 77, column: 5, scope: !974)
!989 = !DILocation(line: 73, column: 32, scope: !990)
!990 = !DILexicalBlockFile(scope: !969, file: !891, discriminator: 2)
!991 = !DILocation(line: 73, column: 5, scope: !990)
!992 = distinct !{!992, !993}
!993 = !DILocation(line: 73, column: 5, scope: !890)
!994 = !DILocation(line: 79, column: 17, scope: !995)
!995 = distinct !DILexicalBlock(scope: !890, file: !891, line: 79, column: 5)
!996 = !DILocation(line: 79, column: 10, scope: !995)
!997 = !DILocation(line: 80, column: 15, scope: !998)
!998 = distinct !DILexicalBlock(scope: !999, file: !891, line: 80, column: 9)
!999 = distinct !DILexicalBlock(scope: !1000, file: !891, line: 79, column: 38)
!1000 = distinct !DILexicalBlock(scope: !995, file: !891, line: 79, column: 5)
!1001 = !DILocation(line: 80, column: 14, scope: !998)
!1002 = !DILocation(line: 80, column: 19, scope: !1003)
!1003 = !DILexicalBlockFile(scope: !1004, file: !891, discriminator: 1)
!1004 = distinct !DILexicalBlock(scope: !998, file: !891, line: 80, column: 9)
!1005 = !DILocation(line: 80, column: 23, scope: !1003)
!1006 = !DILocation(line: 80, column: 21, scope: !1003)
!1007 = !DILocation(line: 80, column: 9, scope: !1003)
!1008 = !DILocation(line: 81, column: 25, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1004, file: !891, line: 80, column: 34)
!1010 = !DILocation(line: 81, column: 15, scope: !1009)
!1011 = !DILocation(line: 81, column: 13, scope: !1009)
!1012 = !DILocation(line: 81, column: 18, scope: !1009)
!1013 = !DILocation(line: 81, column: 23, scope: !1009)
!1014 = !DILocation(line: 82, column: 35, scope: !1009)
!1015 = !DILocation(line: 82, column: 31, scope: !1009)
!1016 = !DILocation(line: 82, column: 25, scope: !1009)
!1017 = !DILocation(line: 82, column: 39, scope: !1009)
!1018 = !DILocation(line: 82, column: 48, scope: !1009)
!1019 = !DILocation(line: 82, column: 46, scope: !1009)
!1020 = !DILocation(line: 82, column: 15, scope: !1009)
!1021 = !DILocation(line: 82, column: 13, scope: !1009)
!1022 = !DILocation(line: 82, column: 18, scope: !1009)
!1023 = !DILocation(line: 82, column: 22, scope: !1009)
!1024 = !DILocation(line: 83, column: 9, scope: !1009)
!1025 = !DILocation(line: 80, column: 30, scope: !1026)
!1026 = !DILexicalBlockFile(scope: !1004, file: !891, discriminator: 2)
!1027 = !DILocation(line: 80, column: 9, scope: !1026)
!1028 = distinct !{!1028, !1029}
!1029 = !DILocation(line: 80, column: 9, scope: !999)
!1030 = !DILocation(line: 84, column: 18, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !999, file: !891, line: 84, column: 9)
!1032 = !DILocation(line: 84, column: 23, scope: !1031)
!1033 = !DILocation(line: 84, column: 27, scope: !1031)
!1034 = !DILocation(line: 84, column: 16, scope: !1031)
!1035 = !DILocation(line: 84, column: 14, scope: !1031)
!1036 = !DILocation(line: 84, column: 32, scope: !1037)
!1037 = !DILexicalBlockFile(scope: !1038, file: !891, discriminator: 1)
!1038 = distinct !DILexicalBlock(scope: !1031, file: !891, line: 84, column: 9)
!1039 = !DILocation(line: 84, column: 34, scope: !1037)
!1040 = !DILocation(line: 84, column: 9, scope: !1037)
!1041 = !DILocation(line: 85, column: 23, scope: !1038)
!1042 = !DILocation(line: 85, column: 26, scope: !1038)
!1043 = !DILocation(line: 85, column: 29, scope: !1038)
!1044 = !DILocation(line: 85, column: 13, scope: !1038)
!1045 = !DILocation(line: 84, column: 41, scope: !1046)
!1046 = !DILexicalBlockFile(scope: !1038, file: !891, discriminator: 2)
!1047 = !DILocation(line: 84, column: 9, scope: !1046)
!1048 = distinct !{!1048, !1049}
!1049 = !DILocation(line: 84, column: 9, scope: !999)
!1050 = !DILocation(line: 87, column: 21, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !999, file: !891, line: 87, column: 9)
!1052 = !DILocation(line: 87, column: 19, scope: !1051)
!1053 = !DILocation(line: 87, column: 14, scope: !1051)
!1054 = !DILocation(line: 87, column: 27, scope: !1055)
!1055 = !DILexicalBlockFile(scope: !1056, file: !891, discriminator: 1)
!1056 = distinct !DILexicalBlock(scope: !1051, file: !891, line: 87, column: 9)
!1057 = !DILocation(line: 87, column: 34, scope: !1055)
!1058 = !DILocation(line: 87, column: 39, scope: !1055)
!1059 = !DILocation(line: 87, column: 43, scope: !1055)
!1060 = !DILocation(line: 87, column: 32, scope: !1055)
!1061 = !DILocation(line: 87, column: 9, scope: !1055)
!1062 = !DILocalVariable(name: "min1v", scope: !1063, file: !891, line: 89, type: !901)
!1063 = distinct !DILexicalBlock(scope: !1056, file: !891, line: 87, column: 56)
!1064 = !DILocation(line: 89, column: 22, scope: !1063)
!1065 = !DILocation(line: 89, column: 30, scope: !1063)
!1066 = !DILocation(line: 89, column: 35, scope: !1063)
!1067 = !DILocation(line: 90, column: 29, scope: !1063)
!1068 = !DILocation(line: 90, column: 16, scope: !1063)
!1069 = !DILocation(line: 90, column: 21, scope: !1063)
!1070 = !DILocation(line: 90, column: 13, scope: !1063)
!1071 = !DILocation(line: 90, column: 27, scope: !1063)
!1072 = !DILocation(line: 91, column: 13, scope: !1063)
!1073 = !DILocation(line: 91, column: 18, scope: !1063)
!1074 = !DILocation(line: 91, column: 22, scope: !1063)
!1075 = !DILocation(line: 92, column: 23, scope: !1063)
!1076 = !DILocation(line: 92, column: 29, scope: !1063)
!1077 = !DILocation(line: 92, column: 13, scope: !1063)
!1078 = !DILocation(line: 93, column: 29, scope: !1063)
!1079 = !DILocation(line: 93, column: 16, scope: !1063)
!1080 = !DILocation(line: 93, column: 21, scope: !1063)
!1081 = !DILocation(line: 93, column: 13, scope: !1063)
!1082 = !DILocation(line: 93, column: 27, scope: !1063)
!1083 = !DILocation(line: 94, column: 25, scope: !1063)
!1084 = !DILocation(line: 94, column: 13, scope: !1063)
!1085 = !DILocation(line: 94, column: 18, scope: !1063)
!1086 = !DILocation(line: 94, column: 23, scope: !1063)
!1087 = !DILocation(line: 95, column: 25, scope: !1063)
!1088 = !DILocation(line: 95, column: 13, scope: !1063)
!1089 = !DILocation(line: 95, column: 18, scope: !1063)
!1090 = !DILocation(line: 95, column: 22, scope: !1063)
!1091 = !DILocation(line: 96, column: 23, scope: !1063)
!1092 = !DILocation(line: 96, column: 29, scope: !1063)
!1093 = !DILocation(line: 96, column: 13, scope: !1063)
!1094 = !DILocation(line: 97, column: 9, scope: !1063)
!1095 = !DILocation(line: 87, column: 52, scope: !1096)
!1096 = !DILexicalBlockFile(scope: !1056, file: !891, discriminator: 2)
!1097 = !DILocation(line: 87, column: 9, scope: !1096)
!1098 = distinct !{!1098, !1099}
!1099 = !DILocation(line: 87, column: 9, scope: !999)
!1100 = !DILocation(line: 99, column: 17, scope: !999)
!1101 = !DILocation(line: 99, column: 15, scope: !999)
!1102 = !DILocation(line: 99, column: 22, scope: !999)
!1103 = !DILocation(line: 99, column: 9, scope: !999)
!1104 = !DILocation(line: 99, column: 27, scope: !999)
!1105 = !DILocation(line: 100, column: 22, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !999, file: !891, line: 100, column: 9)
!1107 = !DILocation(line: 100, column: 20, scope: !1106)
!1108 = !DILocation(line: 100, column: 27, scope: !1106)
!1109 = !DILocation(line: 100, column: 16, scope: !1106)
!1110 = !DILocation(line: 100, column: 14, scope: !1106)
!1111 = !DILocation(line: 100, column: 32, scope: !1112)
!1112 = !DILexicalBlockFile(scope: !1113, file: !891, discriminator: 1)
!1113 = distinct !DILexicalBlock(scope: !1106, file: !891, line: 100, column: 9)
!1114 = !DILocation(line: 100, column: 37, scope: !1112)
!1115 = !DILocation(line: 100, column: 34, scope: !1112)
!1116 = !DILocation(line: 100, column: 9, scope: !1112)
!1117 = !DILocation(line: 101, column: 29, scope: !1113)
!1118 = !DILocation(line: 101, column: 26, scope: !1113)
!1119 = !DILocation(line: 101, column: 22, scope: !1113)
!1120 = !DILocation(line: 101, column: 33, scope: !1113)
!1121 = !DILocation(line: 101, column: 17, scope: !1113)
!1122 = !DILocation(line: 101, column: 13, scope: !1113)
!1123 = !DILocation(line: 101, column: 20, scope: !1113)
!1124 = !DILocation(line: 100, column: 44, scope: !1125)
!1125 = !DILexicalBlockFile(scope: !1113, file: !891, discriminator: 2)
!1126 = !DILocation(line: 100, column: 9, scope: !1125)
!1127 = distinct !{!1127, !1128}
!1128 = !DILocation(line: 100, column: 9, scope: !999)
!1129 = !DILocation(line: 102, column: 16, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !999, file: !891, line: 102, column: 9)
!1131 = !DILocation(line: 102, column: 14, scope: !1130)
!1132 = !DILocation(line: 102, column: 21, scope: !1133)
!1133 = !DILexicalBlockFile(scope: !1134, file: !891, discriminator: 1)
!1134 = distinct !DILexicalBlock(scope: !1130, file: !891, line: 102, column: 9)
!1135 = !DILocation(line: 102, column: 25, scope: !1133)
!1136 = !DILocation(line: 102, column: 23, scope: !1133)
!1137 = !DILocation(line: 102, column: 9, scope: !1133)
!1138 = !DILocation(line: 103, column: 34, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1134, file: !891, line: 102, column: 36)
!1140 = !DILocation(line: 103, column: 31, scope: !1139)
!1141 = !DILocation(line: 103, column: 27, scope: !1139)
!1142 = !DILocation(line: 103, column: 38, scope: !1139)
!1143 = !DILocation(line: 103, column: 21, scope: !1139)
!1144 = !DILocation(line: 103, column: 17, scope: !1139)
!1145 = !DILocation(line: 103, column: 13, scope: !1139)
!1146 = !DILocation(line: 103, column: 25, scope: !1139)
!1147 = !DILocation(line: 104, column: 25, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1139, file: !891, line: 104, column: 17)
!1149 = !DILocation(line: 104, column: 21, scope: !1148)
!1150 = !DILocation(line: 104, column: 17, scope: !1148)
!1151 = !DILocation(line: 104, column: 29, scope: !1148)
!1152 = !DILocation(line: 104, column: 17, scope: !1139)
!1153 = !DILocation(line: 104, column: 36, scope: !1154)
!1154 = !DILexicalBlockFile(scope: !1148, file: !891, discriminator: 1)
!1155 = !DILocation(line: 105, column: 9, scope: !1139)
!1156 = !DILocation(line: 102, column: 32, scope: !1157)
!1157 = !DILexicalBlockFile(scope: !1134, file: !891, discriminator: 2)
!1158 = !DILocation(line: 102, column: 9, scope: !1157)
!1159 = distinct !{!1159, !1160}
!1160 = !DILocation(line: 102, column: 9, scope: !999)
!1161 = !DILocation(line: 106, column: 13, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !999, file: !891, line: 106, column: 13)
!1163 = !DILocation(line: 106, column: 16, scope: !1162)
!1164 = !DILocation(line: 106, column: 14, scope: !1162)
!1165 = !DILocation(line: 106, column: 13, scope: !999)
!1166 = !DILocation(line: 106, column: 22, scope: !1167)
!1167 = !DILexicalBlockFile(scope: !1162, file: !891, discriminator: 1)
!1168 = !DILocation(line: 107, column: 5, scope: !999)
!1169 = !DILocation(line: 79, column: 31, scope: !1170)
!1170 = !DILexicalBlockFile(scope: !1000, file: !891, discriminator: 1)
!1171 = !DILocation(line: 79, column: 5, scope: !1170)
!1172 = distinct !{!1172, !1173}
!1173 = !DILocation(line: 79, column: 5, scope: !890)
!1174 = !DILocation(line: 107, column: 5, scope: !1175)
!1175 = !DILexicalBlockFile(scope: !995, file: !891, discriminator: 1)
!1176 = !DILocation(line: 109, column: 13, scope: !890)
!1177 = !DILocation(line: 109, column: 5, scope: !890)
!1178 = !DILocation(line: 110, column: 13, scope: !890)
!1179 = !DILocation(line: 110, column: 5, scope: !890)
!1180 = !DILocation(line: 111, column: 13, scope: !890)
!1181 = !DILocation(line: 111, column: 5, scope: !890)
!1182 = !DILocation(line: 112, column: 13, scope: !890)
!1183 = !DILocation(line: 112, column: 5, scope: !890)
!1184 = !DILocation(line: 113, column: 12, scope: !890)
!1185 = !DILocation(line: 113, column: 5, scope: !890)
!1186 = distinct !DISubprogram(name: "heap_sift", scope: !891, file: !891, line: 44, type: !1187, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !903)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{null, !914, !894, !894}
!1189 = !DILocalVariable(name: "h", arg: 1, scope: !1186, file: !891, line: 44, type: !914)
!1190 = !DILocation(line: 44, column: 33, scope: !1186)
!1191 = !DILocalVariable(name: "root", arg: 2, scope: !1186, file: !891, line: 44, type: !894)
!1192 = !DILocation(line: 44, column: 40, scope: !1186)
!1193 = !DILocalVariable(name: "size", arg: 3, scope: !1186, file: !891, line: 44, type: !894)
!1194 = !DILocation(line: 44, column: 50, scope: !1186)
!1195 = !DILocation(line: 46, column: 5, scope: !1186)
!1196 = !DILocation(line: 46, column: 12, scope: !1197)
!1197 = !DILexicalBlockFile(scope: !1186, file: !891, discriminator: 1)
!1198 = !DILocation(line: 46, column: 17, scope: !1197)
!1199 = !DILocation(line: 46, column: 21, scope: !1197)
!1200 = !DILocation(line: 46, column: 27, scope: !1197)
!1201 = !DILocation(line: 46, column: 25, scope: !1197)
!1202 = !DILocation(line: 46, column: 5, scope: !1197)
!1203 = !DILocalVariable(name: "child", scope: !1204, file: !891, line: 47, type: !894)
!1204 = distinct !DILexicalBlock(scope: !1186, file: !891, line: 46, column: 33)
!1205 = !DILocation(line: 47, column: 13, scope: !1204)
!1206 = !DILocation(line: 47, column: 21, scope: !1204)
!1207 = !DILocation(line: 47, column: 26, scope: !1204)
!1208 = !DILocation(line: 47, column: 30, scope: !1204)
!1209 = !DILocation(line: 48, column: 13, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1204, file: !891, line: 48, column: 13)
!1211 = !DILocation(line: 48, column: 21, scope: !1210)
!1212 = !DILocation(line: 48, column: 26, scope: !1210)
!1213 = !DILocation(line: 48, column: 19, scope: !1210)
!1214 = !DILocation(line: 48, column: 30, scope: !1210)
!1215 = !DILocation(line: 48, column: 35, scope: !1216)
!1216 = !DILexicalBlockFile(scope: !1210, file: !891, discriminator: 1)
!1217 = !DILocation(line: 48, column: 33, scope: !1216)
!1218 = !DILocation(line: 48, column: 42, scope: !1216)
!1219 = !DILocation(line: 48, column: 50, scope: !1216)
!1220 = !DILocation(line: 48, column: 55, scope: !1216)
!1221 = !DILocation(line: 48, column: 48, scope: !1216)
!1222 = !DILocation(line: 48, column: 59, scope: !1216)
!1223 = !DILocation(line: 48, column: 46, scope: !1216)
!1224 = !DILocation(line: 48, column: 13, scope: !1216)
!1225 = !DILocation(line: 49, column: 18, scope: !1210)
!1226 = !DILocation(line: 49, column: 13, scope: !1210)
!1227 = !DILocation(line: 50, column: 15, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1204, file: !891, line: 50, column: 13)
!1229 = !DILocation(line: 50, column: 13, scope: !1228)
!1230 = !DILocation(line: 50, column: 21, scope: !1228)
!1231 = !DILocation(line: 50, column: 29, scope: !1228)
!1232 = !DILocation(line: 50, column: 27, scope: !1228)
!1233 = !DILocation(line: 50, column: 36, scope: !1228)
!1234 = !DILocation(line: 50, column: 25, scope: !1228)
!1235 = !DILocation(line: 50, column: 13, scope: !1204)
!1236 = !DILocation(line: 51, column: 13, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1228, file: !891, line: 50, column: 41)
!1238 = distinct !{!1238, !1236}
!1239 = !DILocalVariable(name: "SWAP_tmp", scope: !1240, file: !891, line: 51, type: !915)
!1240 = distinct !DILexicalBlock(scope: !1237, file: !891, line: 51, column: 15)
!1241 = !DILocation(line: 51, column: 25, scope: !1240)
!1242 = !DILocation(line: 51, column: 37, scope: !1243)
!1243 = !DILexicalBlockFile(scope: !1240, file: !891, discriminator: 1)
!1244 = !DILocation(line: 51, column: 35, scope: !1243)
!1245 = !DILocation(line: 51, column: 47, scope: !1243)
!1246 = !DILocation(line: 51, column: 45, scope: !1243)
!1247 = !DILocation(line: 51, column: 57, scope: !1243)
!1248 = !DILocation(line: 51, column: 55, scope: !1243)
!1249 = !DILocation(line: 51, column: 55, scope: !1250)
!1250 = !DILexicalBlockFile(scope: !1243, file: !891, discriminator: 2)
!1251 = !DILocation(line: 51, column: 66, scope: !1243)
!1252 = !DILocation(line: 51, column: 64, scope: !1243)
!1253 = !DILocation(line: 51, column: 73, scope: !1243)
!1254 = !DILocation(line: 51, column: 73, scope: !1255)
!1255 = !DILexicalBlockFile(scope: !1243, file: !891, discriminator: 3)
!1256 = !DILocation(line: 51, column: 82, scope: !1243)
!1257 = !DILocation(line: 52, column: 20, scope: !1237)
!1258 = !DILocation(line: 52, column: 18, scope: !1237)
!1259 = !DILocation(line: 53, column: 9, scope: !1237)
!1260 = !DILocation(line: 54, column: 13, scope: !1228)
!1261 = !DILocation(line: 46, column: 5, scope: !1262)
!1262 = !DILexicalBlockFile(scope: !1186, file: !891, discriminator: 2)
!1263 = distinct !{!1263, !1195}
!1264 = !DILocation(line: 56, column: 1, scope: !1186)
!1265 = distinct !DISubprogram(name: "ff_huff_build_tree", scope: !891, file: !891, line: 157, type: !1266, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !903)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!894, !1268, !1856, !894, !894, !1871, !1879, !894}
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1271)
!1271 = !{!1272, !1317, !1318, !1319, !1580, !1581, !1582, !1583, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1609, !1613, !1614, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1794, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1270, file: !35, line: 1561, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1275)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1276)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1277)
!1277 = !{!1278, !1282, !1287, !1291, !1292, !1293, !1294, !1298, !1304, !1306, !1310}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1276, file: !4, line: 72, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1281)
!1281 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1276, file: !4, line: 78, baseType: !1283, size: 64, align: 64, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!1279, !1286}
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1276, file: !4, line: 85, baseType: !1288, size: 64, align: 64, offset: 128)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1290)
!1290 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1276, file: !4, line: 93, baseType: !894, size: 32, align: 32, offset: 192)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1276, file: !4, line: 99, baseType: !894, size: 32, align: 32, offset: 224)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1276, file: !4, line: 108, baseType: !894, size: 32, align: 32, offset: 256)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1276, file: !4, line: 113, baseType: !1295, size: 64, align: 64, offset: 320)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{!1286, !1286, !1286}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1276, file: !4, line: 123, baseType: !1299, size: 64, align: 64, offset: 384)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DISubroutineType(types: !1301)
!1301 = !{!1302, !1302}
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1276)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1276, file: !4, line: 130, baseType: !1305, size: 32, align: 32, offset: 448)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1276, file: !4, line: 136, baseType: !1307, size: 64, align: 64, offset: 512)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!1305, !1286}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1276, file: !4, line: 142, baseType: !1311, size: 64, align: 64, offset: 576)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!894, !1314, !1286, !1279, !894}
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1270, file: !35, line: 1562, baseType: !894, size: 32, align: 32, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1270, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1270, file: !35, line: 1565, baseType: !1320, size: 64, align: 64, offset: 128)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1322)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1323)
!1323 = !{!1324, !1325, !1326, !1327, !1328, !1329, !1338, !1341, !1344, !1347, !1348, !1349, !1350, !1358, !1359, !1360, !1362, !1366, !1372, !1377, !1381, !1382, !1431, !1551, !1555, !1556, !1560, !1564, !1569, !1573, !1574, !1575}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1322, file: !35, line: 3475, baseType: !1279, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1322, file: !35, line: 3480, baseType: !1279, size: 64, align: 64, offset: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1322, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1322, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1322, file: !35, line: 3487, baseType: !894, size: 32, align: 32, offset: 192)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1322, file: !35, line: 3488, baseType: !1330, size: 64, align: 64, offset: 256)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1332)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1333, line: 61, baseType: !1334)
!1333 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1333, line: 58, size: 64, align: 32, elements: !1335)
!1335 = !{!1336, !1337}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1334, file: !1333, line: 59, baseType: !894, size: 32, align: 32)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1334, file: !1333, line: 60, baseType: !894, size: 32, align: 32, offset: 32)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1322, file: !35, line: 3489, baseType: !1339, size: 64, align: 64, offset: 320)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1322, file: !35, line: 3490, baseType: !1342, size: 64, align: 64, offset: 384)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !894)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1322, file: !35, line: 3491, baseType: !1345, size: 64, align: 64, offset: 448)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1322, file: !35, line: 3492, baseType: !899, size: 64, align: 64, offset: 512)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1322, file: !35, line: 3493, baseType: !896, size: 8, align: 8, offset: 576)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1322, file: !35, line: 3494, baseType: !1273, size: 64, align: 64, offset: 640)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1322, file: !35, line: 3495, baseType: !1351, size: 64, align: 64, offset: 704)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1353)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1354)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1355)
!1355 = !{!1356, !1357}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1354, file: !35, line: 3402, baseType: !894, size: 32, align: 32)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1354, file: !35, line: 3403, baseType: !1279, size: 64, align: 64, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1322, file: !35, line: 3507, baseType: !1279, size: 64, align: 64, offset: 768)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1322, file: !35, line: 3516, baseType: !894, size: 32, align: 32, offset: 832)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1322, file: !35, line: 3517, baseType: !1361, size: 64, align: 64, offset: 896)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1322, file: !35, line: 3527, baseType: !1363, size: 64, align: 64, offset: 960)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DISubroutineType(types: !1365)
!1365 = !{!894, !1268}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1322, file: !35, line: 3535, baseType: !1367, size: 64, align: 64, offset: 1024)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DISubroutineType(types: !1369)
!1369 = !{!894, !1268, !1370}
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1269)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1322, file: !35, line: 3541, baseType: !1373, size: 64, align: 64, offset: 1088)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1375)
!1375 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1376)
!1376 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1322, file: !35, line: 3549, baseType: !1378, size: 64, align: 64, offset: 1152)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DISubroutineType(types: !1380)
!1380 = !{null, !1361}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1322, file: !35, line: 3551, baseType: !1363, size: 64, align: 64, offset: 1216)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1322, file: !35, line: 3552, baseType: !1383, size: 64, align: 64, offset: 1280)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DISubroutineType(types: !1385)
!1385 = !{!894, !1268, !895, !894, !1386}
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1388)
!1388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1389)
!1389 = !{!1390, !1391, !1394, !1395, !1396, !1428}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1388, file: !35, line: 3921, baseType: !934, size: 16, align: 16)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1388, file: !35, line: 3922, baseType: !1392, size: 32, align: 32, offset: 32)
!1392 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !897, line: 51, baseType: !1393)
!1393 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1388, file: !35, line: 3923, baseType: !1392, size: 32, align: 32, offset: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1388, file: !35, line: 3924, baseType: !1393, size: 32, align: 32, offset: 96)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1388, file: !35, line: 3925, baseType: !1397, size: 64, align: 64, offset: 128)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1400)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1401)
!1401 = !{!1402, !1403, !1404, !1405, !1406, !1407, !1417, !1421, !1423, !1424, !1426, !1427}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1400, file: !35, line: 3886, baseType: !894, size: 32, align: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1400, file: !35, line: 3887, baseType: !894, size: 32, align: 32, offset: 32)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1400, file: !35, line: 3888, baseType: !894, size: 32, align: 32, offset: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1400, file: !35, line: 3889, baseType: !894, size: 32, align: 32, offset: 96)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1400, file: !35, line: 3890, baseType: !894, size: 32, align: 32, offset: 128)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1400, file: !35, line: 3897, baseType: !1408, size: 768, align: 64, offset: 192)
!1408 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1409)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1410)
!1410 = !{!1411, !1415}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1409, file: !35, line: 3855, baseType: !1412, size: 512, align: 64)
!1412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 512, align: 64, elements: !1413)
!1413 = !{!1414}
!1414 = !DISubrange(count: 8)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1409, file: !35, line: 3857, baseType: !1416, size: 256, align: 32, offset: 512)
!1416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 256, align: 32, elements: !1413)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1400, file: !35, line: 3903, baseType: !1418, size: 256, align: 64, offset: 960)
!1418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 256, align: 64, elements: !1419)
!1419 = !{!1420}
!1420 = !DISubrange(count: 4)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1400, file: !35, line: 3904, baseType: !1422, size: 128, align: 32, offset: 1216)
!1422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 128, align: 32, elements: !1419)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1400, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1400, file: !35, line: 3908, baseType: !1425, size: 64, align: 64, offset: 1408)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1400, file: !35, line: 3915, baseType: !1425, size: 64, align: 64, offset: 1472)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1400, file: !35, line: 3917, baseType: !894, size: 32, align: 32, offset: 1536)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1388, file: !35, line: 3926, baseType: !1429, size: 64, align: 64, offset: 192)
!1429 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !897, line: 40, baseType: !1430)
!1430 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1322, file: !35, line: 3564, baseType: !1432, size: 64, align: 64, offset: 1344)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DISubroutineType(types: !1434)
!1434 = !{!894, !1268, !1435, !1469, !924}
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1437)
!1437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1438)
!1438 = !{!1439, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1465, !1466, !1467, !1468}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1437, file: !35, line: 1451, baseType: !1440, size: 64, align: 64)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1442, line: 94, baseType: !1443)
!1442 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1442, line: 81, size: 192, align: 64, elements: !1444)
!1444 = !{!1445, !1449, !1450}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1443, file: !1442, line: 82, baseType: !1446, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1442, line: 73, baseType: !1448)
!1448 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1442, line: 73, flags: DIFlagFwdDecl)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1443, file: !1442, line: 89, baseType: !895, size: 64, align: 64, offset: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1443, file: !1442, line: 93, baseType: !894, size: 32, align: 32, offset: 128)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1437, file: !35, line: 1461, baseType: !1429, size: 64, align: 64, offset: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1437, file: !35, line: 1467, baseType: !1429, size: 64, align: 64, offset: 128)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1437, file: !35, line: 1468, baseType: !895, size: 64, align: 64, offset: 192)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1437, file: !35, line: 1469, baseType: !894, size: 32, align: 32, offset: 256)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1437, file: !35, line: 1470, baseType: !894, size: 32, align: 32, offset: 288)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1437, file: !35, line: 1474, baseType: !894, size: 32, align: 32, offset: 320)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1437, file: !35, line: 1479, baseType: !1458, size: 64, align: 64, offset: 384)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1460)
!1460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1461)
!1461 = !{!1462, !1463, !1464}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1460, file: !35, line: 1412, baseType: !895, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1460, file: !35, line: 1413, baseType: !894, size: 32, align: 32, offset: 64)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1460, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1437, file: !35, line: 1480, baseType: !894, size: 32, align: 32, offset: 448)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1437, file: !35, line: 1486, baseType: !1429, size: 64, align: 64, offset: 512)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1437, file: !35, line: 1488, baseType: !1429, size: 64, align: 64, offset: 576)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1437, file: !35, line: 1497, baseType: !1429, size: 64, align: 64, offset: 640)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1471)
!1471 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1472)
!1472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1473)
!1473 = !{!1474, !1475, !1476, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1503, !1505, !1506, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1539, !1540, !1541, !1542, !1543, !1544, !1547, !1548, !1549, !1550}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1472, file: !758, line: 282, baseType: !1412, size: 512, align: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1472, file: !758, line: 299, baseType: !1416, size: 256, align: 32, offset: 512)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1472, file: !758, line: 315, baseType: !1477, size: 64, align: 64, offset: 768)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64, align: 64)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1472, file: !758, line: 326, baseType: !894, size: 32, align: 32, offset: 832)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1472, file: !758, line: 326, baseType: !894, size: 32, align: 32, offset: 864)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1472, file: !758, line: 334, baseType: !894, size: 32, align: 32, offset: 896)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1472, file: !758, line: 341, baseType: !894, size: 32, align: 32, offset: 928)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1472, file: !758, line: 346, baseType: !894, size: 32, align: 32, offset: 960)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1472, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1472, file: !758, line: 356, baseType: !1332, size: 64, align: 32, offset: 1024)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1472, file: !758, line: 361, baseType: !1429, size: 64, align: 64, offset: 1088)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1472, file: !758, line: 369, baseType: !1429, size: 64, align: 64, offset: 1152)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1472, file: !758, line: 377, baseType: !1429, size: 64, align: 64, offset: 1216)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1472, file: !758, line: 382, baseType: !894, size: 32, align: 32, offset: 1280)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1472, file: !758, line: 386, baseType: !894, size: 32, align: 32, offset: 1312)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1472, file: !758, line: 391, baseType: !894, size: 32, align: 32, offset: 1344)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1472, file: !758, line: 396, baseType: !1286, size: 64, align: 64, offset: 1408)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1472, file: !758, line: 403, baseType: !1493, size: 512, align: 64, offset: 1472)
!1493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 512, align: 64, elements: !1413)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1472, file: !758, line: 410, baseType: !894, size: 32, align: 32, offset: 1984)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1472, file: !758, line: 415, baseType: !894, size: 32, align: 32, offset: 2016)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1472, file: !758, line: 420, baseType: !894, size: 32, align: 32, offset: 2048)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1472, file: !758, line: 425, baseType: !894, size: 32, align: 32, offset: 2080)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1472, file: !758, line: 435, baseType: !1429, size: 64, align: 64, offset: 2112)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1472, file: !758, line: 440, baseType: !894, size: 32, align: 32, offset: 2176)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1472, file: !758, line: 445, baseType: !901, size: 64, align: 64, offset: 2240)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1472, file: !758, line: 459, baseType: !1502, size: 512, align: 64, offset: 2304)
!1502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1440, size: 512, align: 64, elements: !1413)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1472, file: !758, line: 473, baseType: !1504, size: 64, align: 64, offset: 2816)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1472, file: !758, line: 477, baseType: !894, size: 32, align: 32, offset: 2880)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1472, file: !758, line: 479, baseType: !1507, size: 64, align: 64, offset: 2944)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1510)
!1510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1511)
!1511 = !{!1512, !1513, !1514, !1515, !1520}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1510, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1510, file: !758, line: 203, baseType: !895, size: 64, align: 64, offset: 64)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1510, file: !758, line: 204, baseType: !894, size: 32, align: 32, offset: 128)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1510, file: !758, line: 205, baseType: !1516, size: 64, align: 64, offset: 192)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1518, line: 86, baseType: !1519)
!1518 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1519 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1518, line: 86, flags: DIFlagFwdDecl)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1510, file: !758, line: 206, baseType: !1440, size: 64, align: 64, offset: 256)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1472, file: !758, line: 480, baseType: !894, size: 32, align: 32, offset: 3008)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1472, file: !758, line: 505, baseType: !894, size: 32, align: 32, offset: 3040)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1472, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1472, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1472, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1472, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1472, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1472, file: !758, line: 532, baseType: !1429, size: 64, align: 64, offset: 3264)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1472, file: !758, line: 539, baseType: !1429, size: 64, align: 64, offset: 3328)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1472, file: !758, line: 547, baseType: !1429, size: 64, align: 64, offset: 3392)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1472, file: !758, line: 554, baseType: !1516, size: 64, align: 64, offset: 3456)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1472, file: !758, line: 563, baseType: !894, size: 32, align: 32, offset: 3520)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1472, file: !758, line: 572, baseType: !894, size: 32, align: 32, offset: 3552)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1472, file: !758, line: 581, baseType: !894, size: 32, align: 32, offset: 3584)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1472, file: !758, line: 588, baseType: !1536, size: 64, align: 64, offset: 3648)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !897, line: 36, baseType: !1538)
!1538 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1472, file: !758, line: 593, baseType: !894, size: 32, align: 32, offset: 3712)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1472, file: !758, line: 596, baseType: !894, size: 32, align: 32, offset: 3744)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1472, file: !758, line: 599, baseType: !1440, size: 64, align: 64, offset: 3776)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1472, file: !758, line: 605, baseType: !1440, size: 64, align: 64, offset: 3840)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1472, file: !758, line: 616, baseType: !1440, size: 64, align: 64, offset: 3904)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1472, file: !758, line: 626, baseType: !1545, size: 64, align: 64, offset: 3968)
!1545 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1546, line: 216, baseType: !902)
!1546 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1472, file: !758, line: 627, baseType: !1545, size: 64, align: 64, offset: 4032)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1472, file: !758, line: 628, baseType: !1545, size: 64, align: 64, offset: 4096)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1472, file: !758, line: 629, baseType: !1545, size: 64, align: 64, offset: 4160)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1472, file: !758, line: 645, baseType: !1440, size: 64, align: 64, offset: 4224)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1322, file: !35, line: 3566, baseType: !1552, size: 64, align: 64, offset: 1408)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1553 = !DISubroutineType(types: !1554)
!1554 = !{!894, !1268, !1286, !924, !1435}
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1322, file: !35, line: 3567, baseType: !1363, size: 64, align: 64, offset: 1472)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1322, file: !35, line: 3576, baseType: !1557, size: 64, align: 64, offset: 1536)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DISubroutineType(types: !1559)
!1559 = !{!894, !1268, !1469}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1322, file: !35, line: 3577, baseType: !1561, size: 64, align: 64, offset: 1600)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{!894, !1268, !1435}
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1322, file: !35, line: 3584, baseType: !1565, size: 64, align: 64, offset: 1664)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1566, size: 64, align: 64)
!1566 = !DISubroutineType(types: !1567)
!1567 = !{!894, !1268, !1568}
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1322, file: !35, line: 3589, baseType: !1570, size: 64, align: 64, offset: 1728)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DISubroutineType(types: !1572)
!1572 = !{null, !1268}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1322, file: !35, line: 3594, baseType: !894, size: 32, align: 32, offset: 1792)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1322, file: !35, line: 3600, baseType: !1279, size: 64, align: 64, offset: 1856)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1322, file: !35, line: 3609, baseType: !1576, size: 64, align: 64, offset: 1920)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64, align: 64)
!1578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1579)
!1579 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1270, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1270, file: !35, line: 1581, baseType: !1393, size: 32, align: 32, offset: 224)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1270, file: !35, line: 1583, baseType: !1286, size: 64, align: 64, offset: 256)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1270, file: !35, line: 1591, baseType: !1584, size: 64, align: 64, offset: 320)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1270, file: !35, line: 1598, baseType: !1286, size: 64, align: 64, offset: 384)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1270, file: !35, line: 1606, baseType: !1429, size: 64, align: 64, offset: 448)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1270, file: !35, line: 1614, baseType: !894, size: 32, align: 32, offset: 512)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1270, file: !35, line: 1622, baseType: !894, size: 32, align: 32, offset: 544)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1270, file: !35, line: 1628, baseType: !894, size: 32, align: 32, offset: 576)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1270, file: !35, line: 1636, baseType: !894, size: 32, align: 32, offset: 608)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1270, file: !35, line: 1643, baseType: !894, size: 32, align: 32, offset: 640)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1270, file: !35, line: 1657, baseType: !895, size: 64, align: 64, offset: 704)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1270, file: !35, line: 1658, baseType: !894, size: 32, align: 32, offset: 768)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1270, file: !35, line: 1679, baseType: !1332, size: 64, align: 32, offset: 800)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1270, file: !35, line: 1688, baseType: !894, size: 32, align: 32, offset: 864)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1270, file: !35, line: 1712, baseType: !894, size: 32, align: 32, offset: 896)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1270, file: !35, line: 1729, baseType: !894, size: 32, align: 32, offset: 928)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1270, file: !35, line: 1729, baseType: !894, size: 32, align: 32, offset: 960)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1270, file: !35, line: 1744, baseType: !894, size: 32, align: 32, offset: 992)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1270, file: !35, line: 1744, baseType: !894, size: 32, align: 32, offset: 1024)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1270, file: !35, line: 1751, baseType: !894, size: 32, align: 32, offset: 1056)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1270, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1270, file: !35, line: 1791, baseType: !1605, size: 64, align: 64, offset: 1152)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DISubroutineType(types: !1607)
!1607 = !{null, !1608, !1469, !924, !894, !894, !894}
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1270, file: !35, line: 1808, baseType: !1610, size: 64, align: 64, offset: 1216)
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64, align: 64)
!1611 = !DISubroutineType(types: !1612)
!1612 = !{!494, !1608, !1339}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1270, file: !35, line: 1816, baseType: !894, size: 32, align: 32, offset: 1280)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1270, file: !35, line: 1825, baseType: !1615, size: 32, align: 32, offset: 1312)
!1615 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1270, file: !35, line: 1830, baseType: !894, size: 32, align: 32, offset: 1344)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1270, file: !35, line: 1838, baseType: !1615, size: 32, align: 32, offset: 1376)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1270, file: !35, line: 1846, baseType: !894, size: 32, align: 32, offset: 1408)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1270, file: !35, line: 1851, baseType: !894, size: 32, align: 32, offset: 1440)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1270, file: !35, line: 1861, baseType: !1615, size: 32, align: 32, offset: 1472)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1270, file: !35, line: 1868, baseType: !1615, size: 32, align: 32, offset: 1504)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1270, file: !35, line: 1875, baseType: !1615, size: 32, align: 32, offset: 1536)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1270, file: !35, line: 1882, baseType: !1615, size: 32, align: 32, offset: 1568)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1270, file: !35, line: 1889, baseType: !1615, size: 32, align: 32, offset: 1600)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1270, file: !35, line: 1896, baseType: !1615, size: 32, align: 32, offset: 1632)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1270, file: !35, line: 1903, baseType: !1615, size: 32, align: 32, offset: 1664)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1270, file: !35, line: 1910, baseType: !894, size: 32, align: 32, offset: 1696)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1270, file: !35, line: 1915, baseType: !894, size: 32, align: 32, offset: 1728)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1270, file: !35, line: 1926, baseType: !924, size: 64, align: 64, offset: 1792)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1270, file: !35, line: 1935, baseType: !1332, size: 64, align: 32, offset: 1856)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1270, file: !35, line: 1942, baseType: !894, size: 32, align: 32, offset: 1920)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1270, file: !35, line: 1948, baseType: !894, size: 32, align: 32, offset: 1952)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1270, file: !35, line: 1954, baseType: !894, size: 32, align: 32, offset: 1984)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1270, file: !35, line: 1960, baseType: !894, size: 32, align: 32, offset: 2016)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1270, file: !35, line: 1984, baseType: !894, size: 32, align: 32, offset: 2048)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1270, file: !35, line: 1991, baseType: !894, size: 32, align: 32, offset: 2080)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1270, file: !35, line: 1996, baseType: !894, size: 32, align: 32, offset: 2112)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1270, file: !35, line: 2004, baseType: !894, size: 32, align: 32, offset: 2144)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1270, file: !35, line: 2011, baseType: !894, size: 32, align: 32, offset: 2176)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1270, file: !35, line: 2018, baseType: !894, size: 32, align: 32, offset: 2208)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1270, file: !35, line: 2027, baseType: !894, size: 32, align: 32, offset: 2240)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1270, file: !35, line: 2034, baseType: !894, size: 32, align: 32, offset: 2272)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1270, file: !35, line: 2044, baseType: !894, size: 32, align: 32, offset: 2304)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1270, file: !35, line: 2054, baseType: !933, size: 64, align: 64, offset: 2368)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1270, file: !35, line: 2061, baseType: !933, size: 64, align: 64, offset: 2432)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1270, file: !35, line: 2066, baseType: !894, size: 32, align: 32, offset: 2496)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1270, file: !35, line: 2070, baseType: !894, size: 32, align: 32, offset: 2528)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1270, file: !35, line: 2078, baseType: !894, size: 32, align: 32, offset: 2560)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1270, file: !35, line: 2085, baseType: !894, size: 32, align: 32, offset: 2592)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1270, file: !35, line: 2092, baseType: !894, size: 32, align: 32, offset: 2624)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1270, file: !35, line: 2099, baseType: !894, size: 32, align: 32, offset: 2656)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1270, file: !35, line: 2106, baseType: !894, size: 32, align: 32, offset: 2688)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1270, file: !35, line: 2113, baseType: !894, size: 32, align: 32, offset: 2720)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1270, file: !35, line: 2120, baseType: !894, size: 32, align: 32, offset: 2752)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1270, file: !35, line: 2125, baseType: !894, size: 32, align: 32, offset: 2784)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1270, file: !35, line: 2133, baseType: !894, size: 32, align: 32, offset: 2816)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1270, file: !35, line: 2140, baseType: !894, size: 32, align: 32, offset: 2848)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1270, file: !35, line: 2145, baseType: !894, size: 32, align: 32, offset: 2880)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1270, file: !35, line: 2153, baseType: !894, size: 32, align: 32, offset: 2912)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1270, file: !35, line: 2158, baseType: !894, size: 32, align: 32, offset: 2944)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1270, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1270, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1270, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1270, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1270, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1270, file: !35, line: 2203, baseType: !894, size: 32, align: 32, offset: 3136)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1270, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1270, file: !35, line: 2212, baseType: !894, size: 32, align: 32, offset: 3200)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1270, file: !35, line: 2213, baseType: !894, size: 32, align: 32, offset: 3232)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1270, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1270, file: !35, line: 2232, baseType: !894, size: 32, align: 32, offset: 3296)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1270, file: !35, line: 2243, baseType: !894, size: 32, align: 32, offset: 3328)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1270, file: !35, line: 2249, baseType: !894, size: 32, align: 32, offset: 3360)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1270, file: !35, line: 2256, baseType: !894, size: 32, align: 32, offset: 3392)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1270, file: !35, line: 2263, baseType: !901, size: 64, align: 64, offset: 3456)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1270, file: !35, line: 2270, baseType: !901, size: 64, align: 64, offset: 3520)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1270, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1270, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1270, file: !35, line: 2367, baseType: !1680, size: 64, align: 64, offset: 3648)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{!894, !1608, !1568, !894}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1270, file: !35, line: 2383, baseType: !894, size: 32, align: 32, offset: 3712)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1270, file: !35, line: 2386, baseType: !1615, size: 32, align: 32, offset: 3744)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1270, file: !35, line: 2387, baseType: !1615, size: 32, align: 32, offset: 3776)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1270, file: !35, line: 2394, baseType: !894, size: 32, align: 32, offset: 3808)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1270, file: !35, line: 2401, baseType: !894, size: 32, align: 32, offset: 3840)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1270, file: !35, line: 2408, baseType: !894, size: 32, align: 32, offset: 3872)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1270, file: !35, line: 2415, baseType: !894, size: 32, align: 32, offset: 3904)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1270, file: !35, line: 2422, baseType: !894, size: 32, align: 32, offset: 3936)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1270, file: !35, line: 2423, baseType: !1692, size: 64, align: 64, offset: 3968)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1694)
!1694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1695)
!1695 = !{!1696, !1697, !1698, !1699}
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1694, file: !35, line: 827, baseType: !894, size: 32, align: 32)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1694, file: !35, line: 828, baseType: !894, size: 32, align: 32, offset: 32)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1694, file: !35, line: 829, baseType: !894, size: 32, align: 32, offset: 64)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1694, file: !35, line: 830, baseType: !1615, size: 32, align: 32, offset: 96)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1270, file: !35, line: 2430, baseType: !1429, size: 64, align: 64, offset: 4032)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1270, file: !35, line: 2437, baseType: !1429, size: 64, align: 64, offset: 4096)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1270, file: !35, line: 2444, baseType: !1615, size: 32, align: 32, offset: 4160)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1270, file: !35, line: 2451, baseType: !1615, size: 32, align: 32, offset: 4192)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1270, file: !35, line: 2458, baseType: !894, size: 32, align: 32, offset: 4224)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1270, file: !35, line: 2469, baseType: !894, size: 32, align: 32, offset: 4256)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1270, file: !35, line: 2475, baseType: !894, size: 32, align: 32, offset: 4288)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1270, file: !35, line: 2481, baseType: !894, size: 32, align: 32, offset: 4320)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1270, file: !35, line: 2485, baseType: !894, size: 32, align: 32, offset: 4352)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1270, file: !35, line: 2489, baseType: !894, size: 32, align: 32, offset: 4384)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1270, file: !35, line: 2493, baseType: !894, size: 32, align: 32, offset: 4416)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1270, file: !35, line: 2501, baseType: !894, size: 32, align: 32, offset: 4448)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1270, file: !35, line: 2506, baseType: !894, size: 32, align: 32, offset: 4480)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1270, file: !35, line: 2510, baseType: !894, size: 32, align: 32, offset: 4512)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1270, file: !35, line: 2514, baseType: !1429, size: 64, align: 64, offset: 4544)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1270, file: !35, line: 2528, baseType: !1716, size: 64, align: 64, offset: 4608)
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64, align: 64)
!1717 = !DISubroutineType(types: !1718)
!1718 = !{null, !1608, !1286, !894, !894}
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1270, file: !35, line: 2534, baseType: !894, size: 32, align: 32, offset: 4672)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1270, file: !35, line: 2545, baseType: !894, size: 32, align: 32, offset: 4704)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1270, file: !35, line: 2547, baseType: !894, size: 32, align: 32, offset: 4736)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1270, file: !35, line: 2549, baseType: !894, size: 32, align: 32, offset: 4768)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1270, file: !35, line: 2551, baseType: !894, size: 32, align: 32, offset: 4800)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1270, file: !35, line: 2553, baseType: !894, size: 32, align: 32, offset: 4832)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1270, file: !35, line: 2555, baseType: !894, size: 32, align: 32, offset: 4864)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1270, file: !35, line: 2557, baseType: !894, size: 32, align: 32, offset: 4896)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1270, file: !35, line: 2559, baseType: !894, size: 32, align: 32, offset: 4928)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1270, file: !35, line: 2563, baseType: !894, size: 32, align: 32, offset: 4960)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1270, file: !35, line: 2571, baseType: !1425, size: 64, align: 64, offset: 4992)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1270, file: !35, line: 2579, baseType: !1425, size: 64, align: 64, offset: 5056)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1270, file: !35, line: 2586, baseType: !894, size: 32, align: 32, offset: 5120)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1270, file: !35, line: 2615, baseType: !894, size: 32, align: 32, offset: 5152)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1270, file: !35, line: 2627, baseType: !894, size: 32, align: 32, offset: 5184)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1270, file: !35, line: 2637, baseType: !894, size: 32, align: 32, offset: 5216)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1270, file: !35, line: 2681, baseType: !894, size: 32, align: 32, offset: 5248)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1270, file: !35, line: 2709, baseType: !1429, size: 64, align: 64, offset: 5312)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1270, file: !35, line: 2716, baseType: !1738, size: 64, align: 64, offset: 5376)
!1738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1739, size: 64, align: 64)
!1739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1740)
!1740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1741)
!1741 = !{!1742, !1743, !1744, !1745, !1746, !1747, !1748, !1754, !1758, !1759, !1760, !1761, !1767, !1768, !1769, !1770, !1771}
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1740, file: !35, line: 3642, baseType: !1279, size: 64, align: 64)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1740, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1740, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1740, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1740, file: !35, line: 3669, baseType: !894, size: 32, align: 32, offset: 160)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1740, file: !35, line: 3682, baseType: !1565, size: 64, align: 64, offset: 192)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1740, file: !35, line: 3698, baseType: !1749, size: 64, align: 64, offset: 256)
!1749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1750, size: 64, align: 64)
!1750 = !DISubroutineType(types: !1751)
!1751 = !{!894, !1268, !1752, !1392}
!1752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1753, size: 64, align: 64)
!1753 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !896)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1740, file: !35, line: 3712, baseType: !1755, size: 64, align: 64, offset: 320)
!1755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1756, size: 64, align: 64)
!1756 = !DISubroutineType(types: !1757)
!1757 = !{!894, !1268, !894, !1752, !1392}
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1740, file: !35, line: 3726, baseType: !1749, size: 64, align: 64, offset: 384)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1740, file: !35, line: 3737, baseType: !1363, size: 64, align: 64, offset: 448)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1740, file: !35, line: 3746, baseType: !894, size: 32, align: 32, offset: 512)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1740, file: !35, line: 3757, baseType: !1762, size: 64, align: 64, offset: 576)
!1762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1763, size: 64, align: 64)
!1763 = !DISubroutineType(types: !1764)
!1764 = !{null, !1765}
!1765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1766, size: 64, align: 64)
!1766 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1740, file: !35, line: 3766, baseType: !1363, size: 64, align: 64, offset: 640)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1740, file: !35, line: 3774, baseType: !1363, size: 64, align: 64, offset: 704)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1740, file: !35, line: 3780, baseType: !894, size: 32, align: 32, offset: 768)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1740, file: !35, line: 3785, baseType: !894, size: 32, align: 32, offset: 800)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1740, file: !35, line: 3795, baseType: !1772, size: 64, align: 64, offset: 832)
!1772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1773, size: 64, align: 64)
!1773 = !DISubroutineType(types: !1774)
!1774 = !{!894, !1268, !1440}
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1270, file: !35, line: 2728, baseType: !1286, size: 64, align: 64, offset: 5440)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1270, file: !35, line: 2735, baseType: !1493, size: 512, align: 64, offset: 5504)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1270, file: !35, line: 2742, baseType: !894, size: 32, align: 32, offset: 6016)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1270, file: !35, line: 2755, baseType: !894, size: 32, align: 32, offset: 6048)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1270, file: !35, line: 2776, baseType: !894, size: 32, align: 32, offset: 6080)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1270, file: !35, line: 2783, baseType: !894, size: 32, align: 32, offset: 6112)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1270, file: !35, line: 2791, baseType: !894, size: 32, align: 32, offset: 6144)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1270, file: !35, line: 2802, baseType: !1568, size: 64, align: 64, offset: 6208)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1270, file: !35, line: 2811, baseType: !894, size: 32, align: 32, offset: 6272)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1270, file: !35, line: 2821, baseType: !894, size: 32, align: 32, offset: 6304)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1270, file: !35, line: 2830, baseType: !894, size: 32, align: 32, offset: 6336)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1270, file: !35, line: 2840, baseType: !894, size: 32, align: 32, offset: 6368)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1270, file: !35, line: 2851, baseType: !1788, size: 64, align: 64, offset: 6400)
!1788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1789, size: 64, align: 64)
!1789 = !DISubroutineType(types: !1790)
!1790 = !{!894, !1608, !1791, !1286, !924, !894, !894}
!1791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1792, size: 64, align: 64)
!1792 = !DISubroutineType(types: !1793)
!1793 = !{!894, !1608, !1286}
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1270, file: !35, line: 2871, baseType: !1795, size: 64, align: 64, offset: 6464)
!1795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1796, size: 64, align: 64)
!1796 = !DISubroutineType(types: !1797)
!1797 = !{!894, !1608, !1798, !1286, !924, !894}
!1798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1799, size: 64, align: 64)
!1799 = !DISubroutineType(types: !1800)
!1800 = !{!894, !1608, !1286, !894, !894}
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1270, file: !35, line: 2878, baseType: !894, size: 32, align: 32, offset: 6528)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1270, file: !35, line: 2885, baseType: !894, size: 32, align: 32, offset: 6560)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1270, file: !35, line: 3005, baseType: !894, size: 32, align: 32, offset: 6592)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1270, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1270, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1270, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1270, file: !35, line: 3037, baseType: !895, size: 64, align: 64, offset: 6720)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1270, file: !35, line: 3038, baseType: !894, size: 32, align: 32, offset: 6784)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1270, file: !35, line: 3050, baseType: !901, size: 64, align: 64, offset: 6848)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1270, file: !35, line: 3065, baseType: !894, size: 32, align: 32, offset: 6912)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1270, file: !35, line: 3083, baseType: !894, size: 32, align: 32, offset: 6944)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1270, file: !35, line: 3092, baseType: !1332, size: 64, align: 32, offset: 6976)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1270, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1270, file: !35, line: 3106, baseType: !1332, size: 64, align: 32, offset: 7072)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1270, file: !35, line: 3113, baseType: !1816, size: 64, align: 64, offset: 7168)
!1816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1817, size: 64, align: 64)
!1817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1818)
!1818 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1819)
!1819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1820)
!1820 = !{!1821, !1822, !1823, !1824, !1825, !1826, !1829}
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1819, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1819, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1819, file: !35, line: 720, baseType: !1279, size: 64, align: 64, offset: 64)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1819, file: !35, line: 724, baseType: !1279, size: 64, align: 64, offset: 128)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1819, file: !35, line: 728, baseType: !894, size: 32, align: 32, offset: 192)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1819, file: !35, line: 734, baseType: !1827, size: 64, align: 64, offset: 256)
!1827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1828, size: 64, align: 64)
!1828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1279)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1819, file: !35, line: 739, baseType: !1830, size: 64, align: 64, offset: 320)
!1830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1831, size: 64, align: 64)
!1831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1354)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1270, file: !35, line: 3129, baseType: !1429, size: 64, align: 64, offset: 7232)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1270, file: !35, line: 3130, baseType: !1429, size: 64, align: 64, offset: 7296)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1270, file: !35, line: 3131, baseType: !1429, size: 64, align: 64, offset: 7360)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1270, file: !35, line: 3132, baseType: !1429, size: 64, align: 64, offset: 7424)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1270, file: !35, line: 3139, baseType: !1425, size: 64, align: 64, offset: 7488)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1270, file: !35, line: 3147, baseType: !894, size: 32, align: 32, offset: 7552)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1270, file: !35, line: 3165, baseType: !894, size: 32, align: 32, offset: 7584)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1270, file: !35, line: 3172, baseType: !894, size: 32, align: 32, offset: 7616)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1270, file: !35, line: 3180, baseType: !894, size: 32, align: 32, offset: 7648)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1270, file: !35, line: 3191, baseType: !933, size: 64, align: 64, offset: 7680)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1270, file: !35, line: 3199, baseType: !895, size: 64, align: 64, offset: 7744)
