; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mjpega_dump_header_bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mjpega_dump_header_bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, {}*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }
%struct.AVPacket = type { %struct.AVBufferRef*, i64, i64, i8*, i32, i32, i32, %struct.AVPacketSideData*, i32, i64, i64, i64 }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }

!621 = !DIEnumerator(name: "SOF9", value: 201)
!622 = !DIEnumerator(name: "SOF10", value: 202)
!623 = !DIEnumerator(name: "SOF11", value: 203)
!624 = !DIEnumerator(name: "SOF13", value: 205)
!625 = !DIEnumerator(name: "SOF14", value: 206)
!626 = !DIEnumerator(name: "SOF15", value: 207)
!627 = !DIEnumerator(name: "DHT", value: 196)
!628 = !DIEnumerator(name: "DAC", value: 204)
!629 = !DIEnumerator(name: "RST0", value: 208)
!630 = !DIEnumerator(name: "RST1", value: 209)
!631 = !DIEnumerator(name: "RST2", value: 210)
!632 = !DIEnumerator(name: "RST3", value: 211)
!633 = !DIEnumerator(name: "RST4", value: 212)
!634 = !DIEnumerator(name: "RST5", value: 213)
!635 = !DIEnumerator(name: "RST6", value: 214)
!636 = !DIEnumerator(name: "RST7", value: 215)
!637 = !DIEnumerator(name: "SOI", value: 216)
!638 = !DIEnumerator(name: "EOI", value: 217)
!639 = !DIEnumerator(name: "SOS", value: 218)
!640 = !DIEnumerator(name: "DQT", value: 219)
!641 = !DIEnumerator(name: "DNL", value: 220)
!642 = !DIEnumerator(name: "DRI", value: 221)
!643 = !DIEnumerator(name: "DHP", value: 222)
!644 = !DIEnumerator(name: "EXP", value: 223)
!645 = !DIEnumerator(name: "APP0", value: 224)
!646 = !DIEnumerator(name: "APP1", value: 225)
!647 = !DIEnumerator(name: "APP2", value: 226)
!648 = !DIEnumerator(name: "APP3", value: 227)
!649 = !DIEnumerator(name: "APP4", value: 228)
!650 = !DIEnumerator(name: "APP5", value: 229)
!651 = !DIEnumerator(name: "APP6", value: 230)
!652 = !DIEnumerator(name: "APP7", value: 231)
!653 = !DIEnumerator(name: "APP8", value: 232)
!654 = !DIEnumerator(name: "APP9", value: 233)
!655 = !DIEnumerator(name: "APP10", value: 234)
!656 = !DIEnumerator(name: "APP11", value: 235)
!657 = !DIEnumerator(name: "APP12", value: 236)
!658 = !DIEnumerator(name: "APP13", value: 237)
!659 = !DIEnumerator(name: "APP14", value: 238)
!660 = !DIEnumerator(name: "APP15", value: 239)
!661 = !DIEnumerator(name: "JPG0", value: 240)
!662 = !DIEnumerator(name: "JPG1", value: 241)
!663 = !DIEnumerator(name: "JPG2", value: 242)
!664 = !DIEnumerator(name: "JPG3", value: 243)
!665 = !DIEnumerator(name: "JPG4", value: 244)
!666 = !DIEnumerator(name: "JPG5", value: 245)
!667 = !DIEnumerator(name: "JPG6", value: 246)
!668 = !DIEnumerator(name: "SOF48", value: 247)
!669 = !DIEnumerator(name: "LSE", value: 248)
!670 = !DIEnumerator(name: "JPG9", value: 249)
!671 = !DIEnumerator(name: "JPG10", value: 250)
!672 = !DIEnumerator(name: "JPG11", value: 251)
!673 = !DIEnumerator(name: "JPG12", value: 252)
!674 = !DIEnumerator(name: "JPG13", value: 253)
!675 = !DIEnumerator(name: "COM", value: 254)
!676 = !DIEnumerator(name: "TEM", value: 1)
!677 = !{!678, !687, !694, !693, !695, !698, !699}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !681, line: 222, size: 16, align: 8, elements: !682)
!681 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!682 = !{!683}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !680, file: !681, line: 222, baseType: !684, size: 16, align: 16)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !685, line: 49, baseType: !686)
!685 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!686 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !681, line: 221, size: 32, align: 8, elements: !690)
!690 = !{!691}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !689, file: !681, line: 221, baseType: !692, size: 32, align: 32)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !685, line: 51, baseType: !693)
!693 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!694 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !685, line: 48, baseType: !697)
!697 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64, align: 64)
!700 = !{!701, !864}
!701 = distinct !DIGlobalVariable(name: "ff_mjpega_dump_header_bsf", scope: !0, file: !702, line: 104, type: !703, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_mjpega_dump_header_bsf)
!702 = !DIFile(filename: "libavcodec/mjpega_dump_header_bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!703 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !706)
!706 = !{!707, !711, !714, !756, !757, !821, !859, !863}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !705, file: !4, line: 5797, baseType: !708, size: 64, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64, align: 64)
!709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !710)
!710 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !705, file: !4, line: 5804, baseType: !712, size: 64, align: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !705, file: !4, line: 5815, baseType: !715, size: 64, align: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64, align: 64)
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !719)
!719 = !{!720, !721, !726, !730, !731, !732, !733, !737, !743, !745, !749}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !718, file: !464, line: 72, baseType: !708, size: 64, align: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !718, file: !464, line: 78, baseType: !722, size: 64, align: 64, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64, align: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!708, !725}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !718, file: !464, line: 85, baseType: !727, size: 64, align: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64, align: 64)
!728 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !729)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !718, file: !464, line: 93, baseType: !694, size: 32, align: 32, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !718, file: !464, line: 99, baseType: !694, size: 32, align: 32, offset: 224)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !718, file: !464, line: 108, baseType: !694, size: 32, align: 32, offset: 256)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !718, file: !464, line: 113, baseType: !734, size: 64, align: 64, offset: 320)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64, align: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!725, !725, !725}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !718, file: !464, line: 123, baseType: !738, size: 64, align: 64, offset: 384)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64, align: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!741, !741}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64, align: 64)
!742 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !718)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !718, file: !464, line: 130, baseType: !744, size: 32, align: 32, offset: 448)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !718, file: !464, line: 136, baseType: !746, size: 64, align: 64, offset: 512)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64, align: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!744, !725}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !718, file: !464, line: 142, baseType: !750, size: 64, align: 64, offset: 576)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64, align: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!694, !753, !725, !708, !694}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64, align: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !705, file: !4, line: 5825, baseType: !694, size: 32, align: 32, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !705, file: !4, line: 5826, baseType: !758, size: 64, align: 64, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64, align: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!694, !761}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !764)
!764 = !{!765, !766, !769, !773, !774, !818, !819, !820}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !763, file: !4, line: 5751, baseType: !715, size: 64, align: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !763, file: !4, line: 5756, baseType: !767, size: 64, align: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64, align: 64)
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !705)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !763, file: !4, line: 5762, baseType: !770, size: 64, align: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64, align: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !772)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !763, file: !4, line: 5768, baseType: !725, size: 64, align: 64, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !763, file: !4, line: 5775, baseType: !775, size: 64, align: 64, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !778)
!778 = !{!779, !780, !781, !782, !783, !784, !785, !788, !789, !790, !791, !792, !793, !794, !801, !802, !803, !804, !805, !806, !807, !808, !811, !812, !813, !814, !815, !816, !817}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !777, file: !4, line: 3940, baseType: !484, size: 32, align: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !777, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !777, file: !4, line: 3948, baseType: !692, size: 32, align: 32, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !777, file: !4, line: 3958, baseType: !695, size: 64, align: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !777, file: !4, line: 3962, baseType: !694, size: 32, align: 32, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !777, file: !4, line: 3968, baseType: !694, size: 32, align: 32, offset: 224)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !777, file: !4, line: 3973, baseType: !786, size: 64, align: 64, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !685, line: 40, baseType: !787)
!787 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !777, file: !4, line: 3986, baseType: !694, size: 32, align: 32, offset: 320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !777, file: !4, line: 3999, baseType: !694, size: 32, align: 32, offset: 352)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !777, file: !4, line: 4004, baseType: !694, size: 32, align: 32, offset: 384)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !777, file: !4, line: 4005, baseType: !694, size: 32, align: 32, offset: 416)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !777, file: !4, line: 4010, baseType: !694, size: 32, align: 32, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !777, file: !4, line: 4011, baseType: !694, size: 32, align: 32, offset: 480)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !777, file: !4, line: 4020, baseType: !795, size: 64, align: 32, offset: 512)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !796, line: 61, baseType: !797)
!796 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !796, line: 58, size: 64, align: 32, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !797, file: !796, line: 59, baseType: !694, size: 32, align: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !797, file: !796, line: 60, baseType: !694, size: 32, align: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !777, file: !4, line: 4025, baseType: !494, size: 32, align: 32, offset: 576)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !777, file: !4, line: 4030, baseType: !502, size: 32, align: 32, offset: 608)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !777, file: !4, line: 4031, baseType: !509, size: 32, align: 32, offset: 640)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !777, file: !4, line: 4032, baseType: !527, size: 32, align: 32, offset: 672)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !777, file: !4, line: 4033, baseType: !551, size: 32, align: 32, offset: 704)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !777, file: !4, line: 4034, baseType: !570, size: 32, align: 32, offset: 736)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !777, file: !4, line: 4039, baseType: !694, size: 32, align: 32, offset: 768)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !777, file: !4, line: 4046, baseType: !809, size: 64, align: 64, offset: 832)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !685, line: 55, baseType: !810)
!810 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !777, file: !4, line: 4050, baseType: !694, size: 32, align: 32, offset: 896)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !777, file: !4, line: 4054, baseType: !694, size: 32, align: 32, offset: 928)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !777, file: !4, line: 4061, baseType: !694, size: 32, align: 32, offset: 960)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !777, file: !4, line: 4065, baseType: !694, size: 32, align: 32, offset: 992)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !777, file: !4, line: 4073, baseType: !694, size: 32, align: 32, offset: 1024)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !777, file: !4, line: 4080, baseType: !694, size: 32, align: 32, offset: 1056)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !777, file: !4, line: 4084, baseType: !694, size: 32, align: 32, offset: 1088)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !763, file: !4, line: 5781, baseType: !775, size: 64, align: 64, offset: 320)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !763, file: !4, line: 5787, baseType: !795, size: 64, align: 32, offset: 384)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !763, file: !4, line: 5793, baseType: !795, size: 64, align: 32, offset: 448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !705, file: !4, line: 5827, baseType: !822, size: 64, align: 64, offset: 320)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64, align: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!694, !761, !825}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64, align: 64)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !828)
!828 = !{!829, !841, !842, !843, !844, !845, !846, !847, !855, !856, !857, !858}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !827, file: !4, line: 1451, baseType: !830, size: 64, align: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64, align: 64)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !832, line: 94, baseType: !833)
!832 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !832, line: 81, size: 192, align: 64, elements: !834)
!834 = !{!835, !839, !840}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !833, file: !832, line: 82, baseType: !836, size: 64, align: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64, align: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !832, line: 73, baseType: !838)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !832, line: 73, flags: DIFlagFwdDecl)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !833, file: !832, line: 89, baseType: !695, size: 64, align: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !833, file: !832, line: 93, baseType: !694, size: 32, align: 32, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !827, file: !4, line: 1461, baseType: !786, size: 64, align: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !827, file: !4, line: 1467, baseType: !786, size: 64, align: 64, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !827, file: !4, line: 1468, baseType: !695, size: 64, align: 64, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !827, file: !4, line: 1469, baseType: !694, size: 32, align: 32, offset: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !827, file: !4, line: 1470, baseType: !694, size: 32, align: 32, offset: 288)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !827, file: !4, line: 1474, baseType: !694, size: 32, align: 32, offset: 320)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !827, file: !4, line: 1479, baseType: !848, size: 64, align: 64, offset: 384)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64, align: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !851)
!851 = !{!852, !853, !854}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !850, file: !4, line: 1412, baseType: !695, size: 64, align: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !850, file: !4, line: 1413, baseType: !694, size: 32, align: 32, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !850, file: !4, line: 1414, baseType: !580, size: 32, align: 32, offset: 96)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !827, file: !4, line: 1480, baseType: !694, size: 32, align: 32, offset: 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !827, file: !4, line: 1486, baseType: !786, size: 64, align: 64, offset: 512)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !827, file: !4, line: 1488, baseType: !786, size: 64, align: 64, offset: 576)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !827, file: !4, line: 1497, baseType: !786, size: 64, align: 64, offset: 640)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !705, file: !4, line: 5828, baseType: !860, size: 64, align: 64, offset: 384)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64, align: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !761}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !705, file: !4, line: 5829, baseType: !860, size: 64, align: 64, offset: 448)
!864 = distinct !DIGlobalVariable(name: "codec_ids", scope: !0, file: !702, line: 100, type: !865, isLocal: true, isDefinition: true, variable: [2 x i32]* @codec_ids)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !713, size: 64, align: 32, elements: !866)
!866 = !{!867}
!867 = !DISubrange(count: 2)
!868 = !{i32 2, !"Dwarf Version", i32 4}
!869 = !{i32 2, !"Debug Info Version", i32 3}
!870 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!871 = distinct !DISubprogram(name: "mjpega_dump_header", scope: !702, file: !702, line: 34, type: !823, isLocal: true, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !872)
!872 = !{}
!873 = !DILocalVariable(name: "b", arg: 1, scope: !874, file: !875, line: 95, type: !878)
!874 = distinct !DISubprogram(name: "bytestream_put_byte", scope: !875, file: !875, line: 95, type: !876, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !872)
!875 = !DIFile(filename: "libavcodec/bytestream.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!876 = !DISubroutineType(types: !877)
!877 = !{null, !878, !879}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64, align: 64)
!879 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !693)
!880 = !DIExpression()
!881 = !DILocation(line: 95, column: 233, scope: !874, inlinedAt: !882)
!882 = distinct !DILocation(line: 55, column: 5, scope: !871)
!883 = !DILocalVariable(name: "value", arg: 2, scope: !874, file: !875, line: 95, type: !879)
!884 = !DILocation(line: 95, column: 255, scope: !874, inlinedAt: !882)
!885 = !DILocation(line: 95, column: 233, scope: !874, inlinedAt: !886)
!886 = distinct !DILocation(line: 56, column: 5, scope: !871)
!887 = !DILocation(line: 95, column: 255, scope: !874, inlinedAt: !886)
!888 = !DILocation(line: 95, column: 233, scope: !874, inlinedAt: !889)
!889 = distinct !DILocation(line: 57, column: 5, scope: !871)
!890 = !DILocation(line: 95, column: 255, scope: !874, inlinedAt: !889)
!891 = !DILocalVariable(name: "x", arg: 1, scope: !892, file: !893, line: 58, type: !684)
!892 = distinct !DISubprogram(name: "av_bswap16", scope: !893, file: !893, line: 58, type: !894, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !872)
!893 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!894 = !DISubroutineType(types: !895)
!895 = !{!684, !684}
!896 = !DILocation(line: 58, column: 98, scope: !892, inlinedAt: !897)
!897 = distinct !DILocation(line: 94, column: 328, scope: !898, inlinedAt: !899)
!898 = distinct !DISubprogram(name: "bytestream_put_be16", scope: !875, file: !875, line: 94, type: !876, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !872)
!899 = distinct !DILocation(line: 58, column: 5, scope: !871)
!900 = !DILocalVariable(name: "b", arg: 1, scope: !898, file: !875, line: 94, type: !878)
!901 = !DILocation(line: 94, column: 258, scope: !898, inlinedAt: !899)
!902 = !DILocalVariable(name: "value", arg: 2, scope: !898, file: !875, line: 94, type: !879)
!903 = !DILocation(line: 94, column: 280, scope: !898, inlinedAt: !899)
!904 = !DILocalVariable(name: "x", arg: 1, scope: !905, file: !893, line: 66, type: !692)
!905 = distinct !DISubprogram(name: "av_bswap32", scope: !893, file: !893, line: 66, type: !906, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !872)
!906 = !DISubroutineType(types: !907)
!907 = !{!692, !692}
!908 = !DILocation(line: 66, column: 98, scope: !905, inlinedAt: !909)
